{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Absolutely surprised by the safety of this campus. There have been almost no problems past a few tornadoes or bad rainstorms. I have walked around on campus completely by myself at midnight. The worst I encountered was a wild skunk, who promptly wanted nothing to do with me and we left one another be.",
            "There are so many student clubs that I could not list them all even if I wanted to. I am currently part of the Horseman's Association (great for equestrians) and the Pre-Vet Club. The clubs can really help you with networking and making friends as well.",
            "Agriculture, engineering, business, pre-veterinary",
            "Tuition is way cheaper than many other colleges even if you were getting in-state tuition for them.",
            "When there isn't a football or other sports game, the best fun you can have is hanging out with friends. You can stay on campus and play frisbee, soccer, or whatever sport you prefer. You also have access to Sanderson, the gym on campus, and a couple tennis courts. There are multiple intramural sports teams available to students. Off campus, there are movie theaters, a bowling alley, and a few public parks.",
            "The cafeteria starts out really well at the beginning of the year and then slowly declines in quality of food. They have a good variety of food available though. Mississippi State University also has the Student Union, which contains: Chik-Fila, Pizza Hut, Panda Express, Starbucks, a small grocery store, a frozen yogurt place, and a salad place. There is also a few other small restaurants scattered around the campus, such as Burger King and Subway. Off campus, Starkville holds many restaurants that appeal to most people.",
            "Dorm life is no worse than you would expect it to be at college. I enjoyed it to an extent. The only thing I didn't like was not having my own personal bedroom. You can request that and pay double the amount if you shared, but I was able to survive that. For the most part, everyone minded their own business and making friends was rather easy.",
            "The intensity of the academic rigor at Mississippi State University varies between classes, between teachers, and even between students. For me, I only struggled in topics that I was never good at in the first place. Many of friends did very well in their classes though.",
            "Make friends with the people who live on your floor or in your dorm. Don't be afraid to ask for help from the teachers, your lab partner, or the person sitting next to you in class if it's allowed. Don't pull all-nighters the night before the test. Always do your lab homework.",
            "Mississippi State University has a great campus and lots of friendly faces. There are many good teachers on the campus. Classes and labs are easy to find and do well in."
        ]
    ],
    "pageTitle": "Mississippi State University (MSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mississippi-State-University/reviews?_escaped_fragment_=/show/87309",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900686815,
    "recordOffset": 900586806,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{115459=It is alright but if you live in a dorm, or are going to be put in one, be prepared for the noisy freshman, fire drills at 12:00 p.m., and the every ringing cow bell. Also be prepared to not have a parking space, especially on game day., 227451=In 2009, Forbes ranked Mississippi State University at #18 on their Best College Buys list., 561858=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/16/2009 Reviewer is A current student here. 22 out of 22 people found this review useful. 1 of 130 Marco from Mississippi State, MS Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Bang for the buck MSU is one of the cheapest colleges in the nations, even if a student comes from out of state or is a non-resident. You receive great information compared to other colleges and you pay less tuition compared to other colleges. Am enjoying being here MSU is in a small town so fun things to do is movies and a roller skating place. However, The campus life is really good. We have places to shop and other dining places besides the cafeteria in the Student's Union. The enjoyment part is the parties that are done by students/roommates and also during the football season, it feels great being in the stadium surrounded by students who shake their cowbells. Am learning a lot The teachers are really good and friendly. But besides that, the information they give us helps us learn a lot. They provide us with needed materials that students later on use in their chosen careers. If a student does not understand something, he or she can always go to a teacher's office or a tutor provided by the university to receive more help and this helps the student learn a lot. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}