{
    "relation": [
        [
            "Order #",
            "61B01",
            "61B00 - Get All 3 For One Low Price!"
        ],
        [
            "Format",
            "VHS",
            "VHS"
        ],
        [
            "Price",
            "$29.95 $15.00",
            "$ 74.99 $40.00"
        ],
        [
            "Buy Me",
            "",
            ""
        ]
    ],
    "pageTitle": "The Compleat Sculptor Clay Sculpture Videos",
    "title": "",
    "url": "http://www.sculpt.com/catalog_98/videos/clayvideos.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 702780905,
    "recordOffset": 702764945,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In this video, the artist goes beyond the head to the full female figure, placing emphasis on common problem areas at the shoulders, feet and hands. Step-by-step, in clear and detailed close-ups, Siegel makes it easy for the viewer to follow through to the completion of the female figure. A very good teaching tool. Running Time 57 min. VHS Format By Arlene Siegel. Sculpture Classroom II: Sculpting The Figure in Clay, VHS $39.95 61A01 Buy Me Price Order # By Arlene Siegel. A step-by-step guide to creating a head in water-based clay. This renowned artist has made this easier by breaking down the process into easy-to-follow steps. A very good teaching tool. Running Time 53 min.",
    "textAfterTable": "Order # Format Price Buy Me 61B01 VHS $29.95 $15.00 61B00 - Get All 3 For One Low Price! VHS $ 74.99 $40.00 Sculptor In You II: Sculpting the Female Torso, VHS By A. Wasil. The second video in the series of three, features portrait sculpture. The female torso is one of the classic forms in sculpture and capturing its nuances becomes a breeze when following Wasil through this video. It provides a beginner with a forum conducive to learning and the expert with a variety of tips and tricks for working with clay.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}