{
    "relation": [
        [
            "Patent application number",
            "20080302185",
            "20090128171",
            "20090140612",
            "20100161278"
        ],
        [
            "Description",
            "Microstructure Inspecting Apparatus and Microstructure Inspecting Method - Voltage is applied to a chip TP by a voltage drive unit",
            "Microstructure Probe Card, and Microstructure Inspecting Device, Method, and Computer Program - An inspecting method which is for a microstructure with a movable portion and executes a highly precise inspection without damaging a probe or an inspection electrode by supressing the effect of a needle pressure in contacting the probe to the inspection electrode is provided.",
            "Vibration-Wave Detector - A sensor body",
            "METHOD FOR DIAGNOSING ABNORMAL PLASMA DISCHARGE, ABNORMAL PLASMA DISCHARGE DIAGNOSTICS SYSTEM, AND COMPUTER PROGRAM - Provided are a data obtaining section ("
        ],
        [
            "Published",
            "12-11-2008",
            "05-21-2009",
            "06-04-2009",
            "06-24-2010"
        ]
    ],
    "pageTitle": "Ikeuchi, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ikeuchi-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438558331,
    "recordOffset": 438528696,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Naoki Ikeuchi, Hyogo JP 07-19-2012 SHORT ARC TYPE DISCHARGE LAMP - A short arc type discharge lamp includes a cathode and an anode arranged inside an arc tube to face each other. The cathode comprises a main body portion made of tungsten and an emitter portion made of thoriated tungsten that is joined at the tip of the main body portion, where a metal oxide other than thorium (Th) is contained in the main body portion of the cathode, and a tungsten carbide layer is formed on the metal oxide. 20120181925 02-25-2010 CATHODE FOR DISCHARGE LAMP AND DISCHARGE LAMP USING THE SAME - A cathode for a discharge lamp contains emitter material, wherein a carbide layer is formed on an outer surface of the cathode, the carbide layer is formed on an area extending from a tip portion of the cathode, and two or more grooves extending toward the tip portion of the cathode are formed on the area where the carbide layer is formed. 20100045185 Published Description Patent application number Mitsuru Ikeuchi, Hyogo JP //]]> BarDraw('2977109',['Patent applications by Mitsuru Ikeuchi, Himeji-Shi JP'],[[1,1,1,1,3]],['2005','2006','2010','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2977109\" align=\"center\"></div> </div> <canvas id=\"bg2977109\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Mitsuru Ikeuchi, Himeji-Shi JP</p> <div class=\"bar2977109\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-05-2012</td> <td><a href=\"/patents/app/20120081002\">SHORT ARC TYPE DISCHARGE LAMP</a> - A short arc",
    "textAfterTable": "Patent applications by Naoki Ikeuchi, Hyogo JP Naoki Ikeuchi, Amagasaki City JP Patent application number Description Published 20080223136 Minute structure inspection device, inspection method, and inspection program - There are provided an inspection device, an inspection method, and an inspection program for accurately inspecting a minute structure having a movable portion by using a simple method. A test sound wave is inputted and frequency characteristic of a sensor output voltage amplitude responding to the input of the test sound wave is analyzed. The maximum frequency and the minimum frequency of the device is calculated from estimated use conditions and it is judged whether it is possible to detect a desired characteristic in the frequency band. More specifically, the device is judged to be good or bad depending whether the response characteristic in a predetermined frequency band exceeds the minimum characteristic level as a threshold value. 09-18-2008 20090145230 Displacement Measurement apparatus for microstructure and displcement measurement method thereof - A displacement measurement apparatus for a microstructure according to the present invention measures a displacement of the microstructure having a fixed portion electrode including a first electrode and a second electrode and a movable portion electrode located oppositely to the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}