{
    "relation": [
        [
            "Elder",
            "Elder Stormbrow",
            "Elder Darkfeather",
            "Elder Goldwell",
            "Elder Ironband",
            "Elder Meadowrun",
            "Elder Rumblerock",
            "Elder Hammershout"
        ],
        [
            "Zone",
            "Elwynn Forest",
            "Twilight Highlands",
            "Dun Morogh",
            "Searing Gorge",
            "Western Plaguelands",
            "Burning Steppes",
            "Elwynn Forest"
        ],
        [
            "Coords",
            "39.8, 63.7",
            "51, 33",
            "53.9, 49.9",
            "21.3, 79.1",
            "63.5, 36.1",
            "70.1, 45.4",
            "34.2, 50.6"
        ],
        [
            "Location/Tips",
            "Goldshire: Fly to Flame Crest, Burning Steppes. Ride south through Redridge Mountains, heading west into Elwynn Forest. Stay clear of the human settlements and cavalry that patrols the road. The Elder is not in the town proper, so it's relatively easy to get.",
            "Thundermar Ruins: Enter via Wetlands, the path by Grim Batol will be empty due to phasing. Wetlands can be reached from riding south from Hammerfall, Arathi Highlands. Can get past Victor's Point without aggroing any mobs and heading north to Thundermar is also strangely empty of mobs as well with phasing. If you are getting the other Twilight Highlands Elder, you should be able to rez slightly north of the village and make a clean break for it too. Stick to the river and grasslands, not the cultist areas. Pick up the Elder when a Dragonmaw attack isn't in progress.",
            "Kharanos: Ride from Searing Gorge through Loch Modan into Dun Morogh (take the South gate). The town won't aggro guards, but the gnome Mechanostrider vendors are nearby and they will summon ?? guards if you get too close.",
            "Blackchar Cave: watch from aggro from level 50 mobs.",
            "Weeping Cave: Watch from aggro form level 50 mobs. Also inside a cave, so you will have to dismount.",
            "Dreadmaul Rock: Watch from aggro from level 50 mobs. Get up to the top-most plateau, then jump down a tier to the south.",
            "At Stormwind City's Gates: This is very easy to get for a city Elder-it just takes a lot of travel. See Goldshire Elder."
        ]
    ],
    "pageTitle": "World of Warcraft: Warlords of Draenor News",
    "title": "",
    "url": "http://www.wowhead.com/news&tag=zones&p=4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 849276523,
    "recordOffset": 849057833,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "",
    "textAfterTable": "Gruff Swiftbite Elwynn Forest Gnoll: Boarhide Leggings Gug Fatcandle Elwynn Forest Kobold (and apparently a mage): Fatcandle Bag Lost Soul Tirisfal Glades Banshee: Wispy Cloak Mazzranache Mulgore Flamingo: Sleek Feathered Tunic. Looks just like Swift Lovebird! Mother Fang Elwynn Forest Red spider: Web-Covered Boots Brood Mother Carapace Muad Tirisfal Glades Metallic murloc: Small Green Dagger Narg the Taskmaster Elwynn Forest Kobold: Ratty Old Belt Studded Blackjack Sister Hatelash Mulgore Harpy: Warm Cloak Slark Westfall Metallic murloc: Slarkskin Coral Claymore The Rake Mulgore Lion: Lionfur Armor Threggil Teldrassil Grell: Keen Machete Thuros Lightfingers Elwynn Forest Human rogue: Fingerless Gloves Thuggish Shield Timber Dun Morogh White wolf: Silver-Lined Bracers White Wolf Gloves Tormented Spirit Tirisfal Glades Banshee: Ghostly Bracers Uruson Teldrassil Furbolg: Gnarlpine Leggings Vultros Westfall Black vulture: Feathered Cape The Deadmines Brainwashed Noble is located outside the instance portal and doesn't drop anything exciting, but he",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}