{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "Total"
        ],
        [
            "Country",
            "Egypt",
            "Algeria",
            "Morocco",
            "Iraq",
            "Sudan",
            "Saudi Arabia",
            "Yemen",
            "Syria*",
            "Palestine",
            "Tunisia",
            "Somalia",
            "United Arab Emirates",
            "Libya",
            "Jordan",
            "Lebanon",
            "Kuwait",
            "Mauritania",
            "Oman",
            "Qatar",
            "Bahrain",
            "Djibouti",
            "Comoros",
            "Arab League"
        ],
        [
            "Population",
            "83,550,000",
            "37,100,000",
            "32,064,173",
            "31,234,000",
            "30,894,000",
            "28,146,658",
            "23,580,000",
            "21,906,000",
            "4,550,368",
            "10,673,800",
            "11,400,000",
            "8,264,070",
            "6,733,620",
            "6,332,000",
            "4,224,000",
            "3,566,437",
            "3,291,000",
            "2,845,000",
            "1,699,435",
            "1,234,596",
            "864,000",
            "691,000",
            "356,398,918"
        ],
        [
            "Density (/km2)",
            "95",
            "16",
            "77",
            "71",
            "16",
            "12",
            "45",
            "118",
            "756",
            "65",
            "18",
            "99",
            "3.8",
            "71",
            "404",
            "200",
            "3.2",
            "9.2",
            "154",
            "1,646",
            "37",
            "309",
            "30.4"
        ],
        [
            "Density (sq mi)",
            "246",
            "41",
            "199",
            "184",
            "41",
            "31",
            "117",
            "306",
            "1,958",
            "168",
            "47",
            "256",
            "9.8",
            "184",
            "1,046",
            "518",
            "8.3",
            "24",
            "399",
            "4,263",
            "96",
            "800",
            "78.7"
        ],
        [
            "Notes",
            "[38]",
            "[39]",
            "[40]",
            "[39]",
            "[41]",
            "[39]",
            "[39]",
            "[39]",
            "[42]",
            "[43]",
            "[39]",
            "[44]",
            "[39][45]",
            "[39]",
            "[39]",
            "[39]",
            "[39]",
            "[39]",
            "[39]",
            "[46]",
            "[39]",
            "[39]",
            ""
        ]
    ],
    "pageTitle": "Learn and talk about Arab League, 1945 establishments in Egypt, Arab League, Intergovernmental organizations established by treaty, International organizations of Africa",
    "title": "",
    "url": "http://www.digplanet.com/wiki/Arab_League",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 396585627,
    "recordOffset": 396528249,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{160628=The Arab League as an Organization has no military Force, like the UN or EU, but at the 2007 summit, the Leaders decided to reactivate their joint defense and establish a peacekeeping force to deploy in South Lebanon, Darfur, Iraq, and other hot spots., 160903=At a 2015 summit in Egypt, member nations agreed in principle to form a joint military force.[33], 199026=The Arab League is a culturally and ethnically one association of 22 member states, with the overwhelming majority of the League's population identified as Arab (either on a cultural basis, or on an ethno-racial basis). As of July 1, 2013, about 359,000,000 people live in the states of the Arab League. Its population grows faster than in most other global regions. The most populous member state is Egypt, with a population of about 91 million.[37] The least populated is the Comoros, with over 0.6 million inhabitants., 128670=At the Beirut Summit on 28 March 2002, the league adopted the Arab Peace Initiative,[28] a Saudi-inspired peace plan for the Arab–Israeli conflict. The initiative offered full normalisation of the relations with Israel. In exchange, Israel was required to withdraw from all occupied territories, including the Golan Heights, to recognise Palestinian independence in the West Bank and Gaza Strip, with East Jerusalem as its capital, as well as a \"just solution\" for the Palestinian refugees. The Peace Initiative was again endorsed at 2007 in the Riyadh Summit. In July 2007, the Arab League sent a mission, consisting of the Jordanian and Egyptian foreign ministers, to Israel to promote the initiative. Following Venezuela's move to expel Israeli diplomats amid the 2008–2009 Israel–Gaza conflict, Kuwaiti member of parliament Waleed Al-Tabtabaie proposed moving Arab League headquarters to Caracas, Venezuela.[29] On 13 June 2010, Amr Mohammed Moussa, Secretary-General of the Arab League, visited the Gaza Strip, the first visit by an official of the Arab League since Hamas' armed takeover in 2007., 171772=Economic achievements initiated by the League amongst member states have been less impressive than those achieved by smaller Arab organisations such as the Gulf Cooperation Council (GCC).[34] Among them is the Arab Gas Pipeline, that will transport Egyptian and Iraqi gas to Jordan, Syria, Lebanon, and Turkey. As of 2013, a significant difference in economic conditions exist between the developed oil states of Algeria, Qatar, Kuwait and the UAE, and developing countries like Comoros, Djibouti, Mauritania, Somalia, Sudan and Yemen., 372533=Copyright © 2009-2015 Digparty. All rights reserved., 116715=On 22 February 2011, following the start of the Libyan Civil War and the use of military force against civilians, the Arab League Secretary-General, Amr Moussa, stated that Libya's membership in the Arab League had been suspended: \"the organisation has decided to halt the participation of the Libyan delegations from all Arab League sessions\".[14] This makes Libya the second country in the League's history to have a frozen membership. Libyan leader Muammar Gaddafi declared that the League was illegitimate, saying: \"The Arab League is finished. There is no such thing as the Arab League.\"[15][16] On 25 August 2011, Secretary-General Nabil Elaraby announced it was \"about time\" Libya's full member status was restored. The National Transitional Council, the partially recognised interim government of Libya, will send a representative to be seated at the Arab League meeting on 17 August to participate in a discussion as to whether to readmit Libya to the organisation.[17], 127883=At the Cairo Summit of 1964, the Arab League initiated the creation of an organisation representing the Palestinian people. The first Palestinian National Council convened in East Jerusalem on 29 May 1964. The Palestinian Liberation Organization was founded during this meeting on 2 June 1964. Palestine was shortly admitted in to the Arab League, represented by the PLO. Today, State of Palestine is a full member of the Arab League., 124235=The Charter of the Arab League[6] endorsed the principle of an Arab homeland while respecting the sovereignty of the individual member states. The internal regulations of the Council of the League[24] and the committees[25] were agreed in October 1951. Those of the Secretariat-General were agreed in May 1953.[26], 96206=Following adoption of the Alexandria Protocol in 1944, the Arab League was founded on 22 March 1945. It aimed to be a regional organisation of Arab states with a focus to developing the economy, resolving disputes and coordinating political aims.[10] Other countries joined the league at later dates.[11] Each country was given one vote in the council. The first major action was the joint intervention, allegedly on behalf of the majority Arab population that was being uprooted as the state of Israel emerged in 1948 (and in response to popular outcry in the Arab world), although in fact a main participant in this intervention, Transjordan, had agreed with the Israelis to divide up the Arab Palestinian state proposed by the UN General Assembly, while Egypt intervened primarily to prevent its rival in Amman from accomplishing its objective.[12] This was followed by the creation of a mutual defence treaty two years later. A common market was established in 1965.[10][13], 179807=In collecting literacy data, many countries estimate the number of literate people based on self-reported data. Some use educational attainment data as a proxy, but measures of school attendance or grade completion may differ. Because definitions and data collection methods vary across countries, literacy estimates should be used with caution. United Nations Development Programme, Human Development Report 2010. It is also important to note that the Persian Gulf region has had an oil boom, enabling more schools and universities to be set up., 118492=The Arab Parliament recommended the suspension of member states Syria and Yemen on 20 September 2011, over persistent reports of disproportionate violence against regime opponents and activists during the Arab Spring.[18] A vote on 12 November agreed to formally suspend Syria four days after the vote, giving Assad a last chance to avoid suspension. Syria, Lebanon and Yemen voted against the motion, while Iraq abstained.[19] There was a large amount of criticism as the Arab League sent in December 2011 a commission \"monitoring\" violence on people protesting against the regime. The commission was headed by Mohammad Ahmed Mustafa al-Dabi, who served as head of Omar al-Bashir's military intelligence, while war crimes including genocide were allegedly committed on his watch.[20][21][22] On 6 March 2013, the Arab League granted the Syrian National Coalition Syria's seat in the Arab League.[1] On 9 March 2014, pan-Arab group's secretary general Nabil al-Arabi said that Syria's seat at the Arab League will remain vacant until the opposition completes the formation of its institutions.[23], 87504=Through institutions such as the Arab League Educational, Cultural and Scientific Organization (ALECSO) and the Economic and Social Council of the Arab League's Council of Arab Economic Unity (CAEU), the Arab League facilitates political, economic, cultural, scientific and social programmes designed to promote the interests of the Arab world.[7][8] It has served as a forum for the member states to coordinate their policy positions, to deliberate on matters of common concern, to settle some Arab disputes and to limit conflicts such as the 1958 Lebanon crisis. The League has served as a platform for the drafting and conclusion of many landmark documents promoting economic integration. One example is the Joint Arab Economic Action Charter, which outlines the principles for economic activities in the region., 89003=Each member state has one vote in the League Council, while decisions are binding only for those states that have voted for them. The aims of the league in 1945 were to strengthen and coordinate the political, cultural, economic and social programs of its members, and to mediate disputes among them or between them and third parties. Furthermore, the signing of an agreement on Joint Defence and Economic Cooperation on 13 April 1950 committed the signatories to coordination of military defence measures. In March 2015 the Arab League General Secretary announced the establishment of a Joint Arab Force with the aim of counteracting extremism and other threats to the Arab States. The decision was reached while Operation Decisive Storm was intensifying in Yemen. The participation in the project is voluntary and the army intervenes only at the request of one of the member states. The growing militarization of the region and the increase in violent civil wars as well as terrorist movements are the reason behind the creation of the JAF, financed by the rich Gulf countries.[9], 83=1945 establishments in Egypt > Arab League, 102179=Starting with only six members in 1945, the Arab League today occupies an area spanning around 14 million km² and counts 22 members, and 4 observer states. The 22 members today include 3 of the largest African countries (Sudan, Algeria and Libya) and the largest country in the Middle East (Saudi Arabia)., 102742=There has been a continual increase in membership during the second half of the 20th century, with an additional 15 Arab states being admitted. Syria was suspended following the 2011 uprising, but its seat was later given to Syrian opposition. As of 2015, there are a total of 22 member states. The Arab League member states are as follows:, 90220=In the early 1970s, the Economic Council of the League of Arab States put forward a proposal to create the Joint Arab Chambers of Commerce across the European states. This led, under the decree of the League of Arab States no. K1175/D52/G, to the decision by the Arab governments to set up the Arab British Chamber of Commerce which was mandated to: \"promote, encourage and facilitate bilateral trade\" between the Arab world and its major trading partner, the United Kingdom., 84691=The Arab League (Arabic: الجامعة العربية‎ al-Jāmiʻah al-ʻArabīyah), formally, the League of Arab States (Arabic: جامعة الدول العربية‎ Jāmiʻat ad-Duwal al-ʻArabīyah), is a regional organization of Arab countries in and around North Africa, the Horn of Africa and Arabia. It was formed in Cairo on 22 March 1945 with six members: Kingdom of Egypt, Kingdom of Iraq, Transjordan (renamed Jordan in 1949), Lebanon, Saudi Arabia and Syria.[4] Yemen joined as a member on 5 May 1945. Currently, the League has 22 members, although Syria's participation has been suspended since November 2011, as a consequence of government repression during the ongoing uprising and civil war.[5], 174932=Economical achievements within members have been low in the league's history, other smaller Arab Organizations have achieved more than the league has, such as the GCC, but lately several major economic projects that are promising are to be completed, the Arab Gas Pipeline is to end by the year 2010, Connecting Egyptian and Iraqi Gas to Jordan, Syria and Lebanon, and then to Turkey thus Europe, a free trade Agreement (GAFTA) is to be completed by 1 January 2008, making 95% of all Arab Products tax free of customs.}",
    "lastModified": "Tue, 04 Aug 2015 21:56:03 GMT",
    "textBeforeTable": "The Arab League is a culturally and ethnically one association of 22 member states, with the overwhelming majority of the League's population identified as Arab (either on a cultural basis, or on an ethno-racial basis). As of July 1, 2013, about 359,000,000 people live in the states of the Arab League. Its population grows faster than in most other global regions. The most populous member state is Egypt, with a population of about 91 million.[37] The least populated is the Comoros, with over 0.6 million inhabitants. Population Density of the Arab World in 2008 Demographics of the Arab League Main article: Demographics of Arab League countries[edit] 65.3[35]  Yemen 21 70.0[36]  Djibouti 20 71.0[35]  Morocco 19",
    "textAfterTable": "Syrian demographics are prior to the Syrian civil war. Religion[edit] The vast majority of the Arab League's citizens adhere to Islam, with Christianity being the second largest religion. Over 15 million Christians combined live in Egypt, Iraq, Jordan, Lebanon, Palestine, Sudan and Syria. In addition, there are smaller but significant numbers of Druze, Yezidis, Shabaks and Mandaeans. Numbers for non-religious Arabs are generally not available but research by the Pew Forum suggests around 1% of people in the MENA region are 'unaffiliated'.[47] Linguistics[edit] The official language of the Arab League is Literary Arabic, which is based on Classical Arabic. However, several Arab League member states also have other co-official or national languages. Among the latter are Berber, Somali, Kurdish, Assyrian, Nubian and Armenian. Additionally, various different Arabic dialects are spoken such as Egyptian Arabic, Levantine Arabic and Moroccan Arabic. Culture[",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}