{
    "relation": [
        [
            "Year",
            "1910",
            "1920",
            "1930"
        ],
        [
            "Location",
            "Harper Co, Kansas4",
            "Ness Co, Kansas5",
            "Washington Co, Oklahoma2"
        ]
    ],
    "pageTitle": "Stoy Family Genealogy - Person Page",
    "title": "",
    "url": "http://www.robertstoy.com/database-PhilipStoy/StoyFamily-o/g0/p8.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 667014171,
    "recordOffset": 666892000,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 28 Jun 2015 17:59:10 GMT",
    "textBeforeTable": "1 Alice E Knaggs. Luther Edward Carmean and 1 He was the son of Kansas. Carmean was born between 1904 and 1905 in      Elmo E Descendant Chart for Peter Oatyar of Loudoun County, Virginia Charts 10 Jul 2005 Last Edited= Elmo E Carmean1 Database Images Charts Place Index Surname Index Master Index Changes Since Last Update Search Database Page Person Page Stoy Family Genealogy",
    "textAfterTable": "     Elmo E Carmean appeared on the 1910 federal census of Bourbon Co, Kansas, in his parent's household. 1 He appeared on the 1920 federal census of Bourbon Co, Kansas, in his parent's household. 2 He appeared on the 1930 federal census of Allen Co, Kansas, in his parent's household; he was a farm laborer. 3 Citations 1910 U. S. Census, Bourbon County, Kansas, population schedule, Franklin Township, Xenia town, enumeration district (ED) 47, page/sheet 160A/9A, dwelling 169, family 171, Luther E Carmean household; digital image, Ancestry.com (http://www.ancestry.com : accessed on various dates); citing National Archives microfilm publication T624, roll 432. 1920 U. S. Census, Bourbon County, Kansas, population schedule, Franklin Township, enumeration district (ED) 47, page/sheet 134A/9A, dwelling 190, family 193, Luther Carmean household; digital image, Ancestry.com (http://www.ancestry.com : accessed on various dates); citing National Archives microfilm publication T625, roll 525. 1930 U. S. Census, Allen County, Kansas, population schedule, Marmaton Township, enumeration district (ED) 1-23, page/sheet 219B/2B, dwelling 37, family 37, Luther E Carmean household; digital image, Ancestry.com (http://www.ancestry.com : accessed on various dates); citing National Archives microfilm publication T626, roll 692. Emmaetta Carmean1 Last Edited= 1 Aug 2007",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}