{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "SUPERB ORIGINAL DAVID ALDUS OIL ON CANVAS TRAFALGAR SQUARE LONDON PAINTING | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/SUPERB-ORIGINAL-DAVID-ALDUS-OIL-CANVAS-TRAFALGAR-SQUARE-PAINTING-/130509590310?pt=UK_art_Paintings_GL&hash=item1e62fa4f26",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430438011,
    "recordOffset": 430379616,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64357=Invest in one of our paintings, rather than risky bank investments, where you can actually touch your investment. Take pleasure in looking at it and watch it appreciate in value over the years!! Remember we guarantee every painting sold is unique, original e.g only one of it's kind in the world!!!  Scarcity alone guarantees the investment  !!!! Asgard Arts offers works of art which will not only look fantastic in your home or offices (One Investment Bank in particular has purchased paintings from us for their offices see Bull paintings) but will also be a sound financial investment for the future.  Art has long been regarded as a strong and safe investment.  Investment in paintings was discussed recently on Bloomberg television as a sound investment as a hard asset like Gold, Platinum Silver etc. Also Ellen Kelleher a personal finance journalist for The Financial Times recently wrote an article recommending the purchase of Art, particularly in the $500 - $50,000 range as a sound long term investment with an impressive current average annual increase of 9.7 percent.  Go to Latest Art news on Asgard Arts and see Hang your investments on the wall by Ellen Kelleher Published October 22 2010 in the Financial Times.}",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually dispatch within 1 working day of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Wed. 5 Aug. and Fri. 7 Aug. Estimated between Parcelforce Global Priority United States £45.00",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}