{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "In three sentences"
        ],
        [
            "Comments",
            "there are 8 sororities and 7 fraternities social sororities/fraternities and multiple honors and multicultural ones, so there is a fit for everyone :)",
            "clubs, sports, greek life, there is a great variety :)",
            "it's good, sometimes repeating so it can be boring.",
            "not too bad, they are remodeling now so it will be even nicer :)",
            "it is a great school for education. the students are friendly and always seem to be involved! everything is pretty close together so you don't get lost!"
        ]
    ],
    "pageTitle": "Shippensburg University of Pennsylvania Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Shippensburg-University-of-Pennsylvania/reviews?_escaped_fragment_=/show/60297",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901476471,
    "recordOffset": 901410435,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{280212=© 2015, Cappex.com, LLC, 47161=Reisner's food is pretty good given that it is buffet style. Sometimes the food is bland but I honestly like majority of the food they serve. They have many options to choose from: pizza, pasta, salad, soup, make-your-own-sandwiches, a hot buffet menu that changes daily, the Wok, the grill, ice cream year round and cereal at any time of the day. The CUB is ok. It is definitely not worth it's price. It is way too overpriced. The management doesn't listen to the students input when it comes to prices. However, it is the dining hall that is open the latest (11:30 in one part and 1am in another) and the convenience store is right there. Kriner is the diner everyone says it is better. A quote my friends and I say whenever we tend to eat there: Kriner, the finer diner. It is true, too! Their food is more fresh because not as many people eat there and therefore they don't make as much at once. It's pretty limited but the quality is good. They also have a sub shop and a Greek place in there that you can use your meals on. There's a little eating place in Old Main, too. It is called Century Cafe. They have good food, I really like to eat there. If/when you eat there, you'll notice that it is usually pretty empty. When it isn't empty, it is generally professors and other faculty as well as the non-traditional students or grad students (students that are older than the normal age you would expect, students that are 3rd year seniors, etc.)., 39021=dorms at ship are fairly nice. they are well maintained and for the most part the resident assistants (ra's) are nice and helpful. don't be loud in the middle of the night or cause problems for other students and you should have any trouble with the ra's. also, new suite style dorms are being built across the campus, with dorms opening in 2013 and 2015., 26824=while i do not live on campus, i will occasionally spend the night with a few friends on campus. the dorms are clean, but the rooms in most buildings are very small. this will be changing somewhat soon, however, because the campus will be welcoming many new dorm buildings by the fall semester of 2012. unfortunately, this means prices for housing are going up., 48897=The current dorms are really old. Mowrey Hall, in my opinion, is the best dorm; it is right by the main dining hall and the take out food place, it is close to the library and it is near the parking lot. The dorms tend to get stifling hot in the winter when the heat is on but if you keep your window cracked, it cools it down without freezing you out. They are currently in the process of a new dorm project, the first open in the spring 2013 semester. They look really nice and are generally suite style! The RA's are pretty cool, they can become your friend very easily. Everything is explained and they make sure that you understand it. They have activities at least 2 or 3 nights a week. The activities can range from study sessions with one of the RA's who is a major in that subject, to watching TV shows down in the rec room (on the big screen TV), to extra credit activities and to random free food at a random hour of the night. I enjoyed it! I am actually a little sad to have my own apartment next year., 19587=Shippensburg is great for all majors but it is really good for business majors because Shippensburg received the AACSB accreditation which is the highest a college can receive. The college of business was also the only university in the Pennsylvania State System of Higher Education to make the 2011 list of nationally ranked business programs. That's right we beat PENN STATE. Shippensburg also has a great education major program. Shippensburg is great for everyone., 163481=The dorms at Ship are the one smudge on an otherwise perfect university. However, I am excited, as many of my fellow students are, to be the first class to take up residence in the new state-of-the-art dorms that will be ready in January of 2013., 192332=As of Fall 2013 all dorms will be demolished and students will live in the new suite-style dorms. Students have the option of living in a half or full suite with all the added amenities. Both suite buildings are conveniently located within a 10 minute walk (at the most) of any campus building., 253244=The food isn't too bad, but come November, it gets old as it does at every college. Kriner is called the finer diner and I believe that's true, but it's a hike across campus if you don't live in Presidents Hall. Also, this is kind of gross, but my friends and I agree that right after you eat anywhere on campus, you need to find a bathroom right away., 189342=The campus police station is open 24 hours a day. The are blue emergency buttons located sporadically at all parts of campus. Dorms cannot be opened without an ID card of a student who lives in that dorm, and desk assistants are on duty in the buildings until 1:00 AM weekdays and 3:00 AM weekends.}",
    "textBeforeTable": "12/02/2009 Reviewer is A current student here. 5 out of 7 people found this review useful. 1 of 63 Rachel from Johnstown, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Shippensburg University of Pennsylvania Reviews Shippensburg University of Pennsylvania › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Ashlie from Waynesboro, PA 07/12/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 63 Categories Comments Great for these types of students This school is great for any student but especially to those that would like feeling like part of a community. Ship is small enough to feel like a home rather than a school; yet large enough to meet new people everyday. They have activities to fit every personality and it's a great time there everyday. It's for every student that's ready to get a good start to their life and career, without feeling like they are in an ocean. Tips for prospective students They have an awesome sight called Ship Underground that gives you a heads up on profs. It tells you how difficult they are, what they teach, and the average course load if you have them. It also provides student's oppinions and gives each teacher an overall rank. You can't choose your fall semester classes for your freshman year",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}