{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Black Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "41,066",
            "29,097",
            "18,133",
            "5,567",
            "1,498",
            "84,342"
        ],
        [
            "Congregations",
            "115",
            "20",
            "53",
            "12",
            "12",
            "-"
        ]
    ],
    "pageTitle": "Darmstadt, Indiana (IN) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Darmstadt-Indiana.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00095-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 377517691,
    "recordOffset": 377392610,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1187=2008 Presidential Elections Results, 12595=Ozone [ppb] level in 2001 was 25.3. This is better than average. Closest monitor was 2.7 miles away from the city center., 14797=Carbon Monoxide (CO) [ppm] level in 2012 was 0.859. This is significantly worse than average. Closest monitor was 4.8 miles away from the city center., 10392=Lead (Pb) [µg/m3] level in 2008 was 0.00481. This is significantly better than average. Closest monitor was 8.3 miles away from the city center., 11141=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.4. This is about average. Closest monitor was 4.8 miles away from the city center., 15447=Air Quality Index (AQI) level in 2012 was 99.9. This is worse than average., 26350=On 1/7/1989, a category F4 tornado 29.1 miles away from the town center injured 55 people and caused between $5,000,000 and $50,000,000 in damages., 617=Graphs represent county-level data. Detailed 2008 Election Results, 11890=Particulate Matter (PM10) [µg/m3] level in 2012 was 17.3. This is about average. Closest monitor was 4.8 miles away from the city center., 2045=1996 Presidential Elections Results, 5263=Educational Attainment (%) in 2013, 13339=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.13. This is significantly better than average. Closest monitor was 4.8 miles away from the city center., 14064=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 6.91. This is about average. Closest monitor was 4.8 miles away from the city center., 1473=2004 Presidential Elections Results, 4865=School Enrollment by Level of School (%) in 2013, 159731=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 26669=On 6/2/1990, a category F4 (max. wind speeds 207-260 mph) tornado 26.7 miles away from the Darmstadt town center killed 6 people and injured 60 people and caused between $5,000,000 and $50,000,000 in damages., 901=2012 Presidential Elections Results, 1759=2000 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{63788=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 9248=5.29% of this county's 2010 resident taxpayers moved to other counties in 2011 ($40,854 average adjusted gross income), 7039=5.27% of this county's 2011 resident taxpayers lived in other counties in 2010 ($36,883 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Darmstadt town (based on Vanderburgh County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (4%) Electricity (20%) Utility gas (75%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 29 Vanderburgh County: 1.66 / 10,000 pop. Indiana: 1.73 / 10,000 pop. Number of supercenters and club stores: 2 This county: 0.11 / 10,000 pop. State: 0.21 / 10,000 pop. Number of convenience stores (no gas): 9 Vanderburgh County: 0.51 / 10,000 pop. Indiana: 0.50 / 10,000 pop. Number of convenience stores (with gas): 55 Vanderburgh County: 3.15 / 10,000 pop. State: 3.57 / 10,000 pop. Number of full-service restaurants: 137 Here: 7.84 / 10,000 pop. State: 6.78 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}