{
    "relation": [
        [
            "",
            "Consumer Portal Site",
            "",
            "www.webmd.com",
            "www.medicinenet.com",
            "www.rxlist.com",
            "www.emedicinehealth.com",
            "Professional Portal Site",
            "www.medscape.com",
            "www.medscapecme.com",
            "www.theheart.org"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Description",
            "",
            "WebMD Health, our flagship consumer portal.",
            "A health information site for consumers offering content that is written and edited by practicing physicians, including an online medical dictionary with thousands of medical terms.",
            "An online drug directory with over 2,000 drug monographs, which are comprehensive descriptions of pharmaceutical products (including chemical name, brand names, molecular structure, clinical pharmacology, directions and dosage, side effects, drug interactions and precautions).",
            "A health information site for consumers offering articles written and edited by physicians for consumers, including first aid and emergency information that is also accessible at firstaid.webmd.com.",
            "",
            "Medscape from WebMD, our flagship Web site for physicians and other healthcare professionals.",
            "The Web site through which Medscape, LLC distributes online CME and CE to physicians and other healthcare professionals.",
            "One of the leading cardiology Web sites, known for its depth and breadth of content in this area."
        ]
    ],
    "pageTitle": "e10vk",
    "title": "",
    "url": "http://www.wikinvest.com/stock/WebMD_Health_(WBMD)/Filing/10-K/2010/F47084885",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 833928815,
    "recordOffset": 833763399,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  (Exact name of registrant as specified in its charter) WebMD Health Corp.         Commission file number: 0-51547   For the transition period from          to               TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934   o or",
    "textAfterTable": "Name of each exchange on which registered   Common Stock, par value $0.01 per share   The Nasdaq Stock Market LLC (Global Select Market)   Securities registered pursuant to Section 12(g) of the Act: Not Applicable   Indicate by check mark if the registrant is a well-known seasoned issuer, as defined in Rule 405 of the Securities Act.  Yes  þ     No  o   Indicate by check mark if the registrant is not required to file reports pursuant to Section 13 or Section 15(d) of the Exchange Act.  Yes  o     No  þ  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}