{
    "relation": [
        [
            "Citing Patent",
            "US5666956 *",
            "US6067463 *",
            "US6084676 *",
            "US6147749 *",
            "US6559655",
            "US6657717 *",
            "US7333186",
            "US7560686",
            "US7722562",
            "US7722573",
            "US7758551",
            "US7763005",
            "US7846131",
            "US7927304",
            "US8021336",
            "US8052642",
            "US8052643",
            "US8053721",
            "US8142399",
            "US8142404",
            "US8154274",
            "US8529511",
            "US8760146",
            "EP0917854A2 *",
            "WO2000022980A1 *",
            "WO2000040144A1"
        ],
        [
            "Filing date",
            "May 20, 1996",
            "Jan 5, 1999",
            "Oct 29, 1998",
            "Aug 7, 1996",
            "Apr 30, 2001",
            "Feb 28, 2002",
            "Mar 16, 2005",
            "Dec 11, 2006",
            "Jan 5, 2007",
            "Mar 2, 2006",
            "Mar 2, 2006",
            "Mar 2, 2006",
            "Sep 30, 2005",
            "Mar 2, 2006",
            "Jan 5, 2007",
            "Nov 11, 2009",
            "Sep 29, 2010",
            "Jun 29, 2009",
            "Apr 9, 2010",
            "Apr 9, 2010",
            "May 11, 2010",
            "Aug 17, 2011",
            "Mar 9, 2012",
            "Oct 29, 1998",
            "Oct 8, 1999",
            "Dec 16, 1999"
        ],
        [
            "Publication date",
            "Sep 16, 1997",
            "May 23, 2000",
            "Jul 4, 2000",
            "Nov 14, 2000",
            "May 6, 2003",
            "Dec 2, 2003",
            "Feb 19, 2008",
            "Jul 14, 2009",
            "May 25, 2010",
            "May 25, 2010",
            "Jul 20, 2010",
            "Jul 27, 2010",
            "Dec 7, 2010",
            "Apr 19, 2011",
            "Sep 20, 2011",
            "Nov 8, 2011",
            "Nov 8, 2011",
            "Nov 8, 2011",
            "Mar 27, 2012",
            "Mar 27, 2012",
            "Apr 10, 2012",
            "Sep 10, 2013",
            "Jun 24, 2014",
            "May 26, 1999",
            "Apr 27, 2000",
            "Jul 13, 2000"
        ],
        [
            "Applicant",
            "Buchert; Janusz Michal",
            "Abbott Laboratories",
            "Kyoto Dai-Ichi Kagaku Co., Ltd.",
            "Kyoto Daiichi Kagaku Co., Ltd",
            "Zeltex, Inc.",
            "Cme Telemetrix Inc.",
            "Matsushita Electric Industrial Co., Ltd.",
            "Tyco Healthcare Group Lp",
            "Tyco Healthcare Group Lp",
            "Covidien Ag",
            "Covidien Ag",
            "Covidien Ag",
            "Covidien Ag",
            "Tyco Healthcare Group Lp",
            "Tyco Healthcare Group Lp",
            "Covidien Ag",
            "Tyco Healthcare Group Lp",
            "Tyco Healthcare Group Lp",
            "Tyco Healthcare Group Lp",
            "Covidien Ag",
            "Tyco Healthcare Group Lp",
            "Covidien Lp",
            "Covidien Lp",
            "Kurashiki Boseki Kabushiki Kaisha",
            "Palco Labs Inc",
            "Abbott Lab"
        ],
        [
            "Title",
            "Instrument and method for non-invasive monitoring of human tissue analyte by measuring the body's infrared radiation",
            "Method and apparatus for non-invasively measuring the amount of glucose in blood",
            "Non-contact non-invasive measuring method and apparatus",
            "Method and apparatus for measuring concentration by light projection",
            "System and method for analyzing agricultural products on harvesting equipment",
            "Device for verifying the accuracy of a spectral analyzer",
            "Method and device for measuring biological information",
            "Pump set and pump with electromagnetic radiation operated interlock",
            "Pump set with safety interlock",
            "Pumping apparatus with secure loading features",
            "Pump set with secure loading features",
            "Method for using a pump set having secure loading features",
            "Administration feeding set and flow control apparatus with secure loading features",
            "Enteral feeding pump and feeding set therefor",
            "Pump set for administering fluid with secure loading features and manufacture of component therefor",
            "Pumping apparatus with secure loading features",
            "Enteral feeding set and interlock device therefor",
            "Pump set and pump with electromagnetic radiation operated interlock",
            "Pump set with safety interlock",
            "Controller for pumping apparatus",
            "Safety interlock",
            "Pump set with secure loading features and related methods therefor",
            "Safety interlock",
            "Non-contact non-invasive measuring method and apparatus",
            "Cordless pulse oximeter",
            "Method and apparatus for non-invasively measuring glucose"
        ]
    ],
    "pageTitle": "Patent US5436455 - Non-invasive near-infrared quantitative measurement instrument - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5436455?ie=ISO-8859-1&dq=821,393",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481073163,
    "recordOffset": 481049884,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22708=This application is a continuation-in-part of application Ser. No. 07/813,739, filed Dec. 30, 1991, which is a continuation-in-part of Ser. No. 07/565,302, filed Aug. 10, 1990, now U.S. Pat. 5,077,476, which is a continuation-in-part of application Ser. No. 07/544,580, filed Jun. 27, 1990, now U.S. Pat. No. 5,086,229., 31880=FIG. 1 illustrates a noninvasive near-infrared quantitative analysis instrument 1 which is designed to measure a blood analyte using near-infrared transmission through a test subject's body part, such as a finger. The analytical instrument 1 contains an introducing means including at least one near-infrared energy source for introducing near-infrared energy into the test subject's finger. In one embodiment of the present invention, the introducing means comprises up to six or more near-infrared point sources (nearinfrared emitting diodes or \"IREDs\"). IREDs 5 and 6 are shown for illustrative purposes in FIG. 1. In a preferred embodiment, the IREDs emit energy in the range of approximately 600 nanometers to approximately 1100 nanometers.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in connection with preferred embodiments, it is not limited to them. Modifications within the scope of the following claims will be apparent to those skilled in the art. In the ideal situation of perfect light collimation and diffusion, the position of aperture 54 of sliding baffle 40 relative to the light source and detector is irrelevant to a finger measurement. However, under non-ideal circumstances, the light pattern impinging upon the detector will change as a function of the position of the aperture 54. As a result, under these conditions the position of the aperture 54 must remain fixed during the finger reading and during the standard reading. Thus, whatever position the aperture 54 is in during finger measurement must be maintained during the standard reading. Under such conditions where the light source is not perfectly collimated and the emitted light is not perfectly diffused, the springs 42 may be omitted and replaced by another mechanism such as a small pressure sensitive motor or the like, or the sliding baffle 40 may be provided with external locking means to lock it in position after finger insertion so that a standard reading may be taken with the aperture 54 in a constant position. As shown in FIG. 8, according to one embodiment, when a subject inserts their finger into the chamber, the sliding baffle 40 is caused to slide upward towards the",
    "textAfterTable": "US8142404 Apr 9, 2010 Mar 27, 2012 Covidien Ag Controller for pumping apparatus US8154274 May 11, 2010 Apr 10, 2012 Tyco Healthcare Group Lp Safety interlock US8529511 Aug 17, 2011 Sep 10, 2013 Covidien Lp Pump set with secure loading features and related methods therefor US8760146 Mar 9, 2012 Jun 24, 2014 Covidien Lp Safety interlock EP0917854A2 * Oct 29, 1998 May 26, 1999 Kurashiki Boseki Kabushiki Kaisha Non-contact non-invasive measuring method and apparatus WO2000022980A1 * Oct 8, 1999 Apr 27, 2000 Palco Labs Inc Cordless pulse oximeter WO2000040144A1 Dec 16, 1999 Jul 13, 2000 Abbott Lab Method and apparatus for non-invasively measuring glucose * Cited by examiner Classifications U.S. Classification 250/339.12",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}