{
    "relation": [
        [
            "Date",
            "Jun 5, 2006",
            "Jan 5, 2010",
            "Dec 21, 2010",
            "Apr 10, 2012",
            "May 16, 2013",
            "Sep 3, 2013",
            "May 20, 2014",
            "Dec 23, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "CC",
            "AS",
            "FPAY",
            "IPR",
            "IPR",
            "IPR"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Certificate of correction",
            "Assignment",
            "Fee payment",
            "Aia trial proceeding filed before the patent and appeal board: inter partes review",
            "Aia trial proceeding filed before the patent and appeal board: inter partes review",
            "Aia trial proceeding filed before the patent and appeal board: inter partes review"
        ],
        [
            "Description",
            "Owner name: AUTOMOTIVE TECHNOLOGIES INTERNATIONAL, INC., NEW J Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BREED, DAVID S.;REEL/FRAME:017736/0596 Effective date: 20060601",
            "",
            "",
            "Owner name: AMERICAN VEHICULAR SCIENCES LLC, TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AUTOMOTIVE TECHNOLOGIES INTERNATIONAL, INC.;REEL/FRAME:028023/0087 Effective date: 20120405",
            "Year of fee payment: 4",
            "Free format text: TRIAL NO: IPR2013-00414 Opponent name: TOYOTA MOTOR CORPORATION Effective date: 20130708",
            "Free format text: TRIAL NO: IPR2014-00637 Opponent name: AMERICAN HONDA MOTOR CO., INC. HONDA OF AMERICA Effective date: 20140415 Free format text: TRIAL NO: IPR2014-00643 Opponent name: MERCEDES-BENZ USA, LLC MERCEDES-BENZ U.S. INTERN Effective date: 20140416 Free format text: TRIAL NO: IPR2014-00638 Opponent name: AMERICAN HONDA MOTOR CO., INC. HONDA OF AMERICA Effective date: 20140415",
            "Free format text: TRIAL NO: IPR2015-00174 Opponent name: HYUNDAI MOTOR COMPANY,HYUNDAI MOTOR AMERICA,HYUNDA Effective date: 20141028"
        ]
    ],
    "pageTitle": "Patent US7630802 - Information management and monitoring system and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7630802?ie=ISO-8859-1&dq=oakley+5,387,949",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491952691,
    "recordOffset": 491761187,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6633=As one example of the implementation of this concept consider the following description used in conjunction with FIGS. 71A-72. FIG. 71A is a front view of a steering wheel having two generalized switches located at 3 and 9 o'clock on the steering wheel rim. FIG. 71B is a view similar to FIG. 71A with the addition of a thumb switch option and FIG. 71C is a rear view of the steering wheel of FIG. 71B with a finger trigger option.}",
    "TableContextTimeStampAfterTable": "{395997=The ability to monitor a variety of tires from a single location in or on a vehicle has been discussed above as being important for keeping the cost of the system low. The need to run a wire to each wheel well, and especially if this wire must be a coax cable, can add substantially to the installed system cost. One method of increasing the range of RFID is described in Karthaus, U. et al. “Fully integrated passive UHF RFID transponder IC with 16.7 microwatt Input Power” IEEE Journal of Solid-State Circuits, Vol. 38, No. 10, October 2003 and is applicable to the inventions disclosed herein. Another approach is to make use of the intermittent part of FCC Rule 15 wherein the transmissions per hour are limited to 2 seconds. In that case, the transmitted power can be increased substantially which can result in an 80 db gain which can very substantially increase the distance permitted from the antenna to the SAW or RFID device. Also, Niekerk describes an extended-range RFID that is useable with at least one invention disclosed herein as described in U.S. Pat. No. 6,463,798, U.S. Pat. No. 6,571,617 and U.S. patent application publication Nos. 20020092346 and 20020092347., 42258=5. a CIP of U.S. patent application Ser. No. 11/381,609 filed May 4, 2006, now U.S. Pat. No. 7,408,453; and, 608935=Menus can easily be traversed with three buttons, one to move the selection up, one to move it down, and one to select. Since the driver should keep his/her hands on the steering wheel at all times, these buttons, 801, 802 and 803 should be placed so they can be accessed at the standard 3 o'clock and 9 o'clock hand positions., 42398=6. a CIP of U.S. patent application Ser. No. 11/382,091 filed May 8, 2006, now U.S. Pat. No. 7,549,327., 687729=The wireless communication within a vehicle can be accomplished in several ways. The communication can be through the same path that supplies power to the device, or it can involve the transmission of waves that are received by another device in the vehicle. These waves can be either electromagnetic (radio frequency, microwave, infrared, etc) or ultrasonic. If electromagnetic, they can be sent using a variety of protocols such as CDMA, FDMA, TDMA or ultrawideband (see, e.g., Hiawatha Bray, “The next big thing is actually ultrawide”, Boston Globe, Jun. 25, 2004)., 162836=The discussion above has centered mainly on the blind training of a pattern recognition system, such as a neural network, so that faults can be discovered and failures forecast before they happen. Naturally, the diagnostic algorithms do not have to start out being totally dumb and in fact, the physics or structure of the systems being monitored can be appropriately used to help structure or derive the diagnostic algorithms. Such a system is described in a recent article “Immobots Take Control”, MIT Technology Review December, 2002. Also, of course, it is contemplated that once a potential failure has been diagnosed, the diagnostic system can in some cases act to change the operation of various systems in the vehicle to prolong the time of a failing component before the failure or in some rare cases, the situation causing the failure might be corrected. An example of the first case is where the alternator is failing and various systems or components can be turned off to conserve battery power and an example of the second case is rollover of a vehicle may be preventable through the proper application of steering torque and wheel braking force. Such algorithms can be based on pattern recognition or on models, as described in the Immobot article referenced above, or a combination thereof and all such systems are contemplated by the invention described herein., 207160=Electronic RFID tags are also suitable for lateral and longitudinal positioning purposes, however, the range available for current electronic RFID systems can be less than that of SAW-based systems unless either are powered. On the other hand, as disclosed in U.S. Pat. No. 6,748,797, the time-of-flight of the RFID system can be used to determine the distance from the vehicle to the RFID tag. Because of the inherent delay in the SAW devices and its variation with temperature, accurate distance measurement is probably not practical based on time-of-flight but somewhat less accurate distance measurements based on relative time-of-arrival can be made. Even if the exact delay imposed by the SAW device was accurately known at one temperature, such devices are usually reasonably sensitive to changes in temperature, hence they make good temperature sensors, and thus the accuracy of the delay in the SAW device is more difficult to maintain. An interesting variation of an electronic RFID that is particularly applicable to this and other applications of this invention is described in A. Pohl, L. Reindl, “New passive sensors”, Proc. 16th IEEE Instrumentation and Measurement Technology Conf., IMTC/99, 1999, pp. 1251-1255., 314583=Tires can fail for a variety of reasons including low pressure, high temperature, delamination of the tread, excessive flexing of the sidewall, and wear (see, e.g., Summary Root Cause Analysis Bridgestone/Firestone, Inc.” http://www.bridgestone-firestone.com/homeimgs/rootcause.htm, Printed March, 2001). Most tire failures can be predicted based on tire pressure alone and the TREAD Act thus addresses the monitoring of tire pressure. However, some failures, such as the Firestone tire failures, can result from substandard materials especially those that are in contact with a steel-reinforcing belt. If the rubber adjacent the steel belt begins to move relative to the belt, then heat will be generated and the temperature of the tire will rise until the tire fails catastrophically. This can happen even in properly inflated tires., 187776=Although the sensitivity of measurement is considerably greater than that obtained with conventional piezoelectric or micromachined accelerometers, the frequency deviation of SAW devices remains low (in absolute value). Accordingly, the frequency drift of thermal origin should be made as low as possible by selecting a suitable cut of the piezoelectric material. The resulting accuracy is impressive as presented in U.S. Pat. No. 4,549,436, which discloses an angular accelerometer with a dynamic a range of 1 million, temperature coefficient of 0.005%/deg F., an accuracy of 1 microradian/sec2, a power consumption of 1 milliwatt, a drift of 0.01% per year, a volume of 1 cc/axis and a frequency response of 0 to 1000 Hz. The subject matter of the '436 patent is hereby included in the invention to constitute a part of the invention. A similar design can be used for acceleration sensing., 120177=Important to some embodiments of the inventions herein is the manner in which the diagnostic module 51 determines a normal pattern from an abnormal pattern and the manner in which it decides what data to use from the vast amount of data available. This can be accomplished using pattern recognition technologies such as artificial neural networks and training and in particular, combination neural networks as described in U.S. patent application Ser. No. 10/413,426 (Publication 20030209893). The theory of neural networks including many examples can be found in several books on the subject including: (1) Techniques And Application Of Neural Networks, edited by Taylor, M. and Lisboa, P., Ellis Horwood, West Sussex, England, 1993; (2) Naturally Intelligent Systems, by Caudill, M. and Butler, C., MIT Press, Cambridge Mass., 1990; (3) J. M. Zaruda, Introduction to Artificial Neural Systems, West Publishing Co., N.Y., 1992, (4) Digital Neural Networks, by Kung, S. Y., PTR Prentice Hall, Englewood Cliffs, N.J., 1993, Eberhart, R., Simpson, P., (5) Dobbins, R., Computational Intelligence PC Tools, Academic Press, Inc., 1996, Orlando, Fla., (6) Cristianini, N. and Shawe-Taylor, J. An Introduction to Support Vector Machines and other kernal-based learning methods, Cambridge University Press, Cambridge England, 2000; (7) Proceedings of the 2000 6th IEEE International Workshop on Cellular Neural Networks and their Applications (CNNA 2000), IEEE, Piscataway N.J.; and (8) Sinha, N. K. and Gupta, M. M. Soft Computing & Intelligent Systems, Academic Press 2000 San Diego, Calif. The neural network pattern recognition technology is one of the most developed of pattern recognition technologies. The invention described herein frequently uses combinations of neural networks to improve the pattern recognition process, as discussed in detail in U.S. patent application Ser. No. 10/413,426., 410194=The switching component that accompanies the RFID switch can be a FET, MEMS, PIN diode or CMOS device or equivalent (see, e.g., Prophet, G “MEMS flex their tiny muscles” pp. 63-72, EDN Magazine, Feb. 7, 2002). RF switches are designed to switch Radio Frequency signals, usually from the antenna. They must have low losses and be able to match the impedances to keep the standing ware ratio low. Some are designed to switch specific impedances e.g. 50 ohm, or 75 ohms and others are wide band and can switch from DC to GH signals. The three common types are:, 40304=2. a CIP of U.S. patent application Ser. No. 11/082,739 filed Mar. 17, 2005, now U.S. Pat. No. 7,421,321, which is a CIP of U.S. patent application Ser. No. 10/701,361, filed Nov. 4, 2003 now U.S. Pat. No. 6,988,026, which is:, 689214=A discussion of RFID technology including its use for distance measurement is included in the RFID Handbook, by Klaus Finkenzeller, John Wiley & Sons, New York 1999., 397950=When a box, for example, contains 100 RFID tags (which may be passive tags), the RFID industry has developed methods to read and write to all 100 tags without data collision problems. This is partially due to the digital nature of the RFID communication protocols. See, for example GB2259227, WO9835327, WO0241650, U.S. Pat. No. 3,860,922, U.S. Pat. No. 4,471,345, U.S. Pat. No. 5,521,601, U.S. Pat. No. 5,266,925, U.S. Pat. No. 5,550,547, U.S. Pat. No. 5,521,601, U.S. Pat. No. 5,673,037, U.S. Pat. No. 5,515,053, U.S. Pat. No. 6,377,203, and U.S. patent application publication Nos. 20020063622 and 20030001009. When communicating with a SAW device, analogue information is received from each SAW making it more difficult to separate the transmissions from the four tires using a single, centrally mounted antenna system. Thus if the signals were purely RFID-based, then this separation can be achieved but with SAW systems, even thought they have a greater range than RFID systems, this separation is more difficult. Discussions above have addressed this problem using smart antennas, multiple antennas and other mechanisms that use information related to tire rotation etc. Others in the industry have solved the problem by putting an antenna in each wheel well which significantly increases the installation costs since the wires to each wheel well should be coax cables. The solution described below is thus a significant breakthrough in this field., 42009=4. a CIP of U.S. patent application Ser. No. 11/379,078 filed Apr. 18, 2006, now U.S. Pat. No. 7,379,800, which is a CIP of U.S. patent application Ser. No. 11/220,139 filed Sep. 6, 2005, now U.S. Pat. No. 7,103,460;, 289596=A method of separating signals from multiple tires, for example, is to use a smart antenna such as that manufactured by Motia. This particular Motia device is designed to operate at 433 MHz and to mitigate multipath signals at that frequency. The signals returning to the antennas from tires, for example, contain some multipath effects that, especially if the antennas are offset somewhat from the vehicle center, are different for each wheel. Since the adaptive formula will differ for each wheel, the signals can be separated (see “enhancing 802.11 WLANs through Smart Antennas”, January 2004 available at motia.com). The following is taken from that paper., 345228=The SAW devices 167, 168 and 169 are electrically attached to the valve stem 144 which again serves as an antenna to transmit radio frequency information to an interrogator. This electrical connection can be made by a wired connection; however, the impedance between the SAW devices and the antenna may not be properly matched. An alternate approach as described in Varadan, V. K. et al., “Fabrication, characterization and testing of wireless MEMS-IDT based micro accelerometers”, Sensors and Actuators A 90 (2001) p. 7-19, 2001 Elsevier Netherlands, is to inductively couple the SAW devices to the brass tube., 41664=3. a CIP of U.S. patent application Ser. No. 11/220,139 filed Sep. 6, 2005, now U.S. Pat. No. 7,103,460, which is a CIP of U.S. patent application Ser. No. 11/120,065 filed May 2, 2005, now abandoned, which is a CIP of U.S. patent application Ser. No. 11/082,739 filed Mar. 17, 2005, now U.S. Pat. No. 7,421,321;, 391840=An alternate approach is to make use of a nuclear microbattery as described in, A. Amit and J. Blanchard “The Daintiest Dynamos”, (http://www.spectrum,ieee.org./WEBONLY/publicfeature/sep04/0904nuc.html#t1) IEEE Spectrum online 2004. Other energy harvesting devices include an inductive based technology from Ferro Solutions Inc. These innovative ideas and more to come are applicable for powering the devices described herein including tire pressure and temperature monitors, for example., 215863=If a vehicle is being guided by a DGPS and an accurate map system such as disclosed in U.S. Pat. No. 6,405,132 is used, a problem arises when the GPS receiver system looses satellite lock as would happen when the vehicle enters a tunnel, for example. If a precise location system as described above is placed at the exit of the tunnel, then the vehicle will know exactly where it is and can re-establish satellite lock in as little as one second rather than typically 15 seconds as might otherwise be required. Other methods making use of the cell phone system can be used to establish an approximate location of the vehicle suitable for rapid acquisition of satellite lock as described in G. M. Djuknic, R. E. Richton “Geolocation and Assisted GPS”, Computer Magazine, February 2001, IEEE Computer Society, which is incorporated by reference herein in its entirety. An alternate location system is described in U.S. Pat. No. 6,480,788., 603594=Although previously not implemented, a steering can also be an output device by causing various locations on the steering wheel to provide a vibration, electrical shock or other output to the driver. This is in contrast to vibrating the entire steering wheel which has been proposed for an artificial rumble strip application when a vehicle departs from its lane. Such a local feedback can be used to identify for the driver which button he or she should press to complete an action such as dialing a phone number, for example (see H Kajimoto et al., SmartTouch: Electric Skin to Touch the Untouchable” IEEE Computer Graphics and Applications, pp 36-43, January-February, 2004, IEEE)., 230312=Note, the use of PVDF as a piezoelectric material for wired and wireless SAW transducers or sensors is an important disclosure of at least one of the inventions disclosed herein. Such PVDF SAW devices can be used as chemical, biological, temperature, pressure and other SAW sensors as well as for switches. Such devices are very inexpensive to manufacture and are suitable for many vehicle-mounted devices as well as for other non-vehicle-mounted sensors. Disadvantages of PVDF stem from the lower piezoelectric constant (compared with lithium niobate) and the low acoustic wave velocity thus limiting the operating frequency. The key advantage is very low cost. When coupled with plastic electronics (plastic chips), it now becomes very economical to place sensors throughout the vehicle for monitoring a wide range of parameters such as temperature, pressure, chemical concentration etc. In particular implementations, an electronic nose based on SAW or RFID technology and neural networks can be implemented in either a wired or wireless manner for the monitoring of cargo containers or other vehicle interiors (or building interiors) for anti-terrorist or security purposes. See, for example, Reznik, A. M. “Associative Memories for Chemical Sensing”, IEEE 2002 ICONIP, p. 2630-2634, vol. 5. In this manner, other sensors can be combined with the temperature sensors 85, or used separately, to measure carbon dioxide, carbon monoxide, alcohol, biological agents, radiation, humidity or other desired chemicals or agents as discussed above. Note, although the examples generally used herein are from the automotive industry, many of the devices disclosed herein can be advantageously used with other vehicles including trucks, boats, airplanes and shipping containers., 40005=1. a continuation-in-part (CIP) of U.S. patent application Ser. No. 10/642,028 filed Aug. 15, 2003, now U.S. Pat. No. 7,253,725, which claims priority under 35 U.S.C. �119(e) of U.S. provisional patent application Ser. No. 60/415,862 filed Oct. 3, 2002, now expired;, 417946=In addition to SAW devices for temperature and pressure measurement, other low power devices exist such as capacitive, inductive or resistive-based temperature and pressure sensors and their use in conjunction with an RFID tag is contemplated by the invention disclosed herein. For a similar application of a combined passive RFID tag and a sensor see D. Watters “Wireless Sensors Will Monitor Bridge Decks”, Better Roads Magazine, February 2003. Previously, combined RFID tags and sensors that are passive have not been used on vehicles for tire temperature and pressure monitoring or for any other purpose. With the exception of the bridge deck monitor, when sensors have been used with passive RFID tags, only the tag has obtained its power from the RF signal while the sensor has been separately battery or otherwise powered (see, e.g., U.S. Pat. No. 6,377,203)., 281983=This condition is outrageous. If to execute ITU frequency rules, the band of correct temperature measuring will be reduced five times: (125� C.−(−40� C.)*194 ns)/1000 ns=32� C.=58� F., 572412=Other people could also determine the location of a person carrying the PID, if such a service is authorized by the PID owner. In this manner, parents can locate their children or friends can locate each other in a crowded restaurant or airport. The location or tracking information can be made available on the Internet through the Skybitz or similar low power tracking system. Also, the batteries that operate the PID can be recharged in a variety of ways including fuel cells and vibration-based power generators, solar power, induction charging systems etc. For further background, see N. Tredennick “031201 Go Reconfigure”, IEEE Spectrum Magazine, p. 37-40, December 2003 and D. Verkest “Machine Cameleon” ibid p. 41-46, which describe some of the non-vehicle related properties envisioned here for the PID. Also for some automotive applications see P. Hansen “Portable electronics threaten embedded electronics”, Automotive Industries Magazine, December 2004. Such a device could also rely heavily on whatever network it had access to when it is connected to a network such as the Internet. It could use the connected network for many processing tasks which exceed the capability of the PID or which require information that is not PID-resident. In a sense, the network can become the computer for these more demanding tasks. Using the Internet as the computer gives the automobile companies more control over the software and permits a pricing model based on use rather than a one time sale. Such a device can be based on microprocessors, FPGAs or programmable logical devices or a combination thereof. This is the first disclosure of vehicular uses of such a device to solve the mismatched lifetimes of the vehicle and its electronic hardware and software as discussed above., 218694=Since an AGPS server can obtain the vehicle's position from the mobile switching center, at least to the level of cell and sector, and at the same time monitor signals from GPS satellites seen by mobile stations, it can predict the signals received by the vehicle for any given time. Specifically, the server can predict the Doppler shift due to satellite motion of GPS signals received by the vehicle, as well as other signal parameters that are a function of the vehicle's location. In a typical sector, uncertainty in a satellite signal's predicted time of arrival at the vehicle is about �5 μs, which corresponds to �5 chips of the GPS coarse acquisition (C/A) code. Therefore, an AGPS server can predict the phase of the pseudorandom noise (PRN) sequence that the receiver should use to despread the C/A signal from a particular satellite (each GPS satellite transmits a unique PRN sequence used for range measurements) and communicate that prediction to the vehicle. The search space for the actual Doppler shift and PRN phase is thus greatly reduced, and the AGPS receiver can accomplish the task in a fraction of the time required by conventional GPS receivers. Further, the AGPS server maintains a connection with the vehicle receiver over the wireless link, so the requirement of asking the communication unit to make specific measurements, collect the results and communicate them back is easily met. After despreading and some additional signal processing, an AGPS receiver returns back “pseudoranges” (that is, ranges measured without taking into account the discrepancy between satellite and receiver clocks) to the AGPS server, which then calculates the vehicle's location. The vehicle can even complete the location fix itself without returning any data to the server. Further discussion of cellular location-based systems can be found in Caffery, J. J. Wireless Location in CDMA Cellular Radio Systems, Kluwer Academic Publishers, 1999, ISBN: 0792377036., 44944=A detailed background of the invention is found in the parent application, U.S. patent application Ser. No. 11/220,139, filed Sep. 6, 2005, now U.S. Pat. No. 7,103,460, incorporated by reference herein, in particular sections 1.1, 1.2 and 2.0.}",
    "textBeforeTable": "Patent Citations Although several preferred embodiments are illustrated and described above, there are possible combinations using other geometries, sensors, materials and different dimensions for the components that perform the same functions. This invention is not limited to the above embodiments and should be determined by the following claims. The inventions described above are, of course, susceptible to many variations, combinations of disclosed components, modifications and changes, all of which are within the skill of the art. It should be understood that all such variations, modifications and changes are within the spirit and scope of the inventions and of the appended claims. Similarly, it will be understood that applicant intends to cover and claim all changes, modifications and variations of the examples of the preferred embodiments of the invention herein disclosed for the purpose of illustration which do not constitute departures from the spirit and scope of the present invention as claimed. As stated at the beginning this application is one in a series of applications covering safety and other systems for vehicles and other uses. The disclosure herein goes beyond that needed to support the claims of the particular invention that is being claimed herein. This is not to be construed that the inventor is thereby releasing the unclaimed disclosure and subject matter into the public domain. Rather, it is intended that patent applications have been or will be filed to cover all of the",
    "textAfterTable": "Mar 21, 1995 Caterpillar Inc. Method of relaying information relating to the status of a vehicle US5408411 Jan 17, 1992 Apr 18, 1995 Hitachi, Ltd. System for predicting behavior of automotive vehicle and for controlling vehicular behavior based thereon US5411289 Oct 29, 1993 May 2, 1995 Morton International, Inc. Air bag system for a motor vehicle US5413378 Dec 2, 1993 May 9, 1995 Trw Vehicle Safety Systems Inc. Method and apparatus for controlling an actuatable restraining device in response to discrete control zones US5439249 Dec 5, 1994 Aug 8, 1995 Trw Vehicle Safety Systems Inc. Vehicle occupant restraint system including occupant position sensor mounted in seat back US5442553 Nov 16, 1992 Aug 15, 1995 Motorola Wireless motor vehicle diagnostic and software upgrade system US5445347 May 13, 1993 Aug 29, 1995 Hughes Aircraft Company Automated wireless preventive maintenance monitoring system for magnetic levitation (MAGLEV) trains and other vehicles US5450321 Jul 29, 1993 Sep 12, 1995 Crane;",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}