{
    "relation": [
        [
            "Date",
            "Oct 8, 2003",
            "Dec 23, 2003",
            "Feb 2, 2007",
            "Aug 7, 2007",
            "Jan 22, 2010",
            "May 13, 2010",
            "Jun 18, 2013",
            "Nov 6, 2013",
            "Feb 10, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: XTREMESPECTRUM, INC., VIRGINIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SHVODIAN, WILLIAM M.;REEL/FRAME:014631/0560 Effective date: 20031008",
            "Owner name: MOTOROLA, INC.,ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:XTREMESPECTRUM, INC.;REEL/FRAME:014815/0242 Effective date: 20031113",
            "Owner name: CITIBANK, N.A. AS COLLATERAL AGENT,NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNORS:FREESCALE SEMICONDUCTOR, INC.;FREESCALE ACQUISITION CORPORATION;FREESCALE ACQUISITION HOLDINGS CORP.;AND OTHERS;REEL/FRAME:018855/0129 Effective date: 20061201",
            "",
            "Year of fee payment: 4",
            "Owner name: CITIBANK, N.A., AS COLLATERAL AGENT,NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:FREESCALE SEMICONDUCTOR, INC.;REEL/FRAME:024397/0001 Effective date: 20100413 Owner name: CITIBANK, N.A., AS COLLATERAL AGENT, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:FREESCALE SEMICONDUCTOR, INC.;REEL/FRAME:024397/0001 Effective date: 20100413",
            "Owner name: CITIBANK, N.A., AS NOTES COLLATERAL AGENT, NEW YOR Free format text: SECURITY AGREEMENT;ASSIGNOR:FREESCALE SEMICONDUCTOR, INC.;REEL/FRAME:030633/0424 Effective date: 20130521",
            "Owner name: CITIBANK, N.A., AS NOTES COLLATERAL AGENT, NEW YOR Free format text: SECURITY AGREEMENT;ASSIGNOR:FREESCALE SEMICONDUCTOR, INC.;REEL/FRAME:031591/0266 Effective date: 20131101",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7088702 - Method for controlling a data stream in a wireless network - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7088702?ie=ISO-8859-1&dq=inassignee:google",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465728643,
    "recordOffset": 465697065,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6661=As shown in FIG. 10, the transmission scheme 1000 involves dividing the available transmission time into a plurality of superframes 1010. This embodiment uses the MAC header 624 disclosed in FIG. 7B. The payloads 640 used are preferably those used in the IEEE 802.15.3 standard.}",
    "TableContextTimeStampAfterTable": "{104854=Once the assigned source device sends data (whether to the assigned destination device in step 1115 or to a secondary destination device in step 1130), the assigned source device determines whether there is any remaining time in the CTA. (Step 1135), 87218=Management time slots 1050 can be downlink management time slots (DMTSs) in which information is sent from the coordinator 310 to a non-coordinator device 321–325, or uplink management time slots (UMTSs) in which information is sent from a non-coordinator device 321–325 to the coordinator 310., 105157=If there is remaining time, then the assigned source device proceeds to step 1120 to determine whether it has any data it needs to send to any other secondary destination devices. If there is no remaining time, then the assigned source device proceeds to step 1140 and the CTA ends., 92193=During transmission, each device 310, 321–325 must hear the beacon 1020 so that it will know what time slots 1050, 1060 have been assigned to it as either a transmitter or receiver. If the device misses the beacon 1020, it may listen to the entire superframe 1010 just in case it is receiving data. Furthermore, in some implementations it may not be allowed to transmit for the duration of the superframe 1010 because it does not know when it is permitted to transmit. This is detrimental to the system because it may lead to interruptions in data transmission., 89705=In the second preferred embodiment the coordinator 310 uses the beacon 1020 (in whatever format it is) and the MTSs to coordinate the scheduling of the individual devices 310, 321–325 into their respective guaranteed time slots 1060. All devices 310, 321–325 listen to the coordinator 310 during the beacon period 1020. Each device 321–325 will receive zero or more time slots 1050, 1060, being notified of each start time and duration from the coordinator 310 during the beacon period 1020. The coordinator 310 automatically allocates management time slots 1050 to each device 321–325. However, guaranteed time slots 1060 are only assigned when the device 321–325 requests them., 91217=The coordinator 310 sends the beacon 1020 to all of the non-coordinator devices 321–325 at the beginning of each superframe 1010. the beacon 1020 tells each non-coordinator device 321–325 the duration or superframe 1010 as well as other information about its MAC address. Each beacon 1020 will also contain information that is not precisely a CTA. One piece of information will define the beacon period 1020 and describe the start time and the duration for the beacon period 1020. Another will define the contention access period 1030 (if any) and describe the start time and the duration for the contention access period 1030. Each beacon can also have multiple CTAs. There will be a CTA for each of the time slot 1050,1060 (whether MTS or GTS). Using dynamic time slots, the slot assignments can change the CTAs every superframe., 86705=In this embodiment the data transmission scheme 1000 includes transmitting successive superframes 1010 in time across the network 300. Each superframe 1010 includes a beacon 1020, an optional contention access period (CAP) 1030, and a contention free period (CFP) 1040. The contention free period 1040 may include one or more management time slots (MTSs) 1050 and one or more guaranteed time slots (GTSs) 1060., 87594=In this preferred embodiment two management time slots 1050 are used per superframe 1010, one uplink and one downlink, though alternate embodiments could choose different numbers of management time slots 1050 and mixtures of uplink and downlink. MTSs can also be shared among multiple devices 321–325. In this case a convention resolution method, such as slotted Aloha, must be used. In addition, if a CAP 1030 is used to pass administrative information, the use of MTSs 1050 may be reduced or eliminated., 90585=Channel time allocation (CTA) fields in the beacon 1020 include start times, packet duration, source device ID, destination device ID, and a stream index. This beacon information uses what is often called TLV format, which stands for type, length, and value. As a result, each device knows when to transmit and when to receive. In all other times devices 310, 321–325 may cease listening and go into a power conservation mode. The beacon period 1020, therefore, is used to coordinate the transmitting and receiving of the devices 310, 321–325., 94030=As noted above, guard times 1080 are preferably provided between frames to account for errors in clock accuracies and differences in propagation delays based on spatial positions of the devices 310, 321–325., 104596=If, however, the secondary device is not listening to the current CTA, then the source device proceeds back to step 1120 to determine whether it has data that it needs to send to any other secondary destination device., 26929=This application is a continuation-in-part of U.S. application Ser. No. 10/262,946, filed Oct. 3, 2002, entitled “METHOD OF OPERATING A MEDIA ACCESS CONTROLLER”, which benefits from the priority of a provisional application No. 60/326,425, filed Oct. 3, 2001, entitled “MiniMAC TDMA Protocol,” the disclosure of both of which are incorporated by reference in its entirety. This application also relies for priority on U.S. provisional application Ser. No. 60/416,520, by William M. Shvodian, filed Oct. 8, 2002, entitled “METHOD FOR CONTROLLING A DATA STREAM,” the contents of which are hereby incorporated by reference in their entirety., 88181=In the second preferred embodiment there are as many guaranteed time slots 1060 as there are active primary and secondary wireless links 330 and 340. However, this may change in alternate embodiments. In any given superframe 500 there may be greater or fewer guaranteed time slots 1060 than there are active primary and secondary wireless links 330 and 340. In this case the coordinator 310 will designate how the devices 310, 321–325 should use the available guaranteed time slots 1060., 92850=The network can pass control and administrative information between the coordinator 310 and the various devices 321–325 through the optional contention access period 1030, the management time slots 1050, or both. For example, this can involve information about new devices that want to join the network 300. The particular implementation will determine what particular option is used: it could include a contention access period 1030, one or more management time slots 1050, or some combination of both., 88785=The guaranteed time slots 1060 in this embodiment are preferably dynamic in size. Each transmitter-receiver pair that is allocated a GTS 1060 is also told the duration of the GTS 1060 that the pair is assigned to the beacon. These durations may be of different sizes for different GTSs within a single superframe 1010. Furthermore, the length and position of a given GTS 1060 may change across different superframes 1010, limited only by the ability of the coordinator 310 to successfully inform the non-coordinator devices 321–325 of the change. The starting times and durations of the guaranteed time slots 1060 are determined by the coordinator 310 and sent to the devices 321–325 during the contention access period 1030 or one of the management time slots 1050, as implemented., 52962=Independent of any network it is in, each device 310, 321–325 has a unique MAC address that can be used to identify it,. This MAC address is generally assigned by the manufacturer so that no two devices 310, 321–325 have the same MAC address. One set of standards that is used in preferred embodiments of the present invention to govern MAC addresses can be found in IEEE Std. 802-1990, “IEEE Standards for Local and Metropolitan Area Networks: Overview and Architecture.”, 93442=Individual devices 310, 321–325 transmit frames during the contention free period 1040 according to the schedule set forth in the beacon 1020. The pair of devices 310, 321–325 assigned to a given guaranteed time slots 1060 use that GTS 1060 assigned to them to transmit frames 1070 between each other. These may be data frames from the designated transmitter to the designated receiver, or acknowledgement (ACK) frames from the designated receiver to the designated transmitter.}",
    "textBeforeTable": "Patent Citations Obviously, numerous modifications and variations of the present invention are possible in light of the above teachings. It is therefore to be understood that within the scope of the appended claims, the invention may be practiced otherwise than as specifically described herein. Thus, one preferred embodiment of the present invention is used in an ultrawide bandwidth network. However, it is applicable to other sorts of networks as well. The present invention can be used with the IEEE 803.15.3 standard for high-rate WPANs, which is currently under development by the IEEE 802.15 WPAN™ Task Group 3 (TG3). The details of the current draft 802.15.3 standard, including archives of the 802.15.3 working group can be found at: http://www.ieee802.org/15/pub/TG3.html. Nothing in this disclosure should be considered to be incompatible with the draft 802.15.3 standard, as set forth on the IEEE 802 LAN/MAN Standards Committee web page. Conclusion If there is remaining time, then the assigned source device proceeds to step 1120 to determine whether it has any data it needs to send to any other secondary destination devices. If there is no remaining time, then the assigned source device proceeds to step 1140 and the CTA ends. Once the assigned source device sends data (whether to the assigned destination device in step 1115 or to a secondary destination device in step 1130), the assigned source device determines whether there is any remaining time",
    "textAfterTable": "Citing Patent Filing date Publication date Applicant Title US7304975 * Aug 16, 2004 Dec 4, 2007 Freescale Semiconductor, Inc. Method for providing rapid delayed frame acknowledgement in a wireless transceiver US7417996 * Apr 29, 2005 Aug 26, 2008 Samsung Electronics Co., Ltd. Method and apparatus for communication between coordinator-based wireless network and different type of network which are interconnected through a backbone network US7417997 * May 25, 2005 Aug 26, 2008 Samsung Electronics Co., Ltd. Method for communication in coordinator-based wireless network and method for communication between coordinator-based wireless networks connected through backbone network US7434133 * Dec 9, 2004 Oct 7, 2008 Samung Electronics Co., Ltd. Method of retransmitting data frame and network apparatus using the method US7564864 * May 25, 2005 Jul 21, 2009 Oki Electric Industry Co., Ltd. Communication timing control method and apparatus, node, and communication system US7782836 Mar 20, 2007 Aug 24, 2010",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}