{
    "relation": [
        [
            "Cited Patent",
            "US3631843 *",
            "US3911871 *",
            "US3968775 *",
            "US4059078 *",
            "US4122803 *",
            "US4161160 *",
            "US4166435 *"
        ],
        [
            "Filing date",
            "Dec 9, 1969",
            "Jan 23, 1974",
            "Sep 24, 1973",
            "Jul 1, 1976",
            "Oct 14, 1977",
            "Oct 31, 1977",
            "Apr 11, 1978"
        ],
        [
            "Publication date",
            "Jan 4, 1972",
            "Oct 14, 1975",
            "Jul 13, 1976",
            "Nov 22, 1977",
            "Oct 31, 1978",
            "Jul 17, 1979",
            "Sep 4, 1979"
        ],
        [
            "Applicant",
            "Yeiser John O",
            "Rockwell International Corp",
            "Energy Research Inc.",
            "Ramiro De La Rosa Raul",
            "Miller Hugo S",
            "Caterpillar Tractor Co.",
            "Kiang Deh J"
        ],
        [
            "Title",
            "Fluid addition system for internal combustion engines",
            "Fluid injection system for internal combustion engines",
            "Fuel system for internal combustion engines",
            "Steam injection apparatus",
            "Combined internal combustion and steam engine",
            "Fuel additive injection system for diesel engines",
            "Internal combustion engines"
        ]
    ],
    "pageTitle": "Patent US4337731 - Feed system for introducing water vapor into the suction path of an internal ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4337731?dq=5,884,272",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478455319,
    "recordOffset": 478437249,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39308=The pump control circuit 130 comprises a pulse generator 134 which is controlled by the contact breaker 64 of the internal combustion engine. The pulses generated by the pulse generator 134 are transmitted to a pulse former 136. The pulse frequency is reduced in the ratio of 16:1 in a pulse frequency divider 138. In a monostable multi-vibrator 140 following the pulse frequency divider 138, a pulse of a duration of about 20 milliseconds is generated. The output of the monostable multi-vibrator 140 is connected to the base of a power transistor 142 which is switched into conduction by the output signal of the monostable multi-vibrator, whereby the linear motor 110 or the winding 114 of the pump 18 is excited and the latter is thus set in motion.}",
    "textBeforeTable": "Patent Citations The feed system according to the invention ensures adaptation of the quantity of water vapor to be fed in to the particular operating state of the internal combustion engine so that overheating of the mixture before it enters the combustion chamber of the internal combustion engine can be avoided and thus, in particular, the production of nitric oxides can be substantially reduced. Moreover, it should be noted that it would also be possible to use, in place of the vacuum cell 54, a contact on the throttle valve or on the gas linkage of the internal combustion engine, in order to detect overrunning. This does not, however, cover the case of driving at high altitudes or under other conditions which lead to overheating of the internal combustion engine. As can be seen in FIGS. 1 and 2, the water vapor is fed to the suction system via two lines 190 and 192. The line 190 ends in the suction line 40 above the carburetor 34. About 75% of the water vapor are introduced via this line into the suction line 40. The lower line 192 ends in the suction line 40 below the carburetor 34. Via this line, about 25% of the hot vapor are fed in. To prevent air being drawn in via the lines 190 and 192, by-passing the throttle valve 36, when the vapor feed is switched off and when the throttle valve",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4476817 * Jul 14, 1983 Oct 16, 1984 Owen, Wickersham & Erickson, P.C. Combustion and pollution control system US5671701 * Feb 16, 1996 Sep 30, 1997 O'donnell; Thomas F. Apparatus and method for enhancing the efficiency of liquid-fuel-burning systems US6112705 * Jan 21, 1999 Sep 5, 2000 Mitsubishi Jidosha Kogyo Kabushiki Kaisha Water injection amount control system for fuel and water injection engine US6526950 * Feb 8, 2001 Mar 4, 2003 Nissan Motor Co., Ltd. Fuel vapor treatment system US7530349 Aug 3, 2007 May 12, 2009 Rim Julius J Hydrated EGR system, method and apparatus for reducing harmful exhaust emissions and improving fuel economy US20010011539 * Feb 8, 2001 Aug 9, 2001 Nissan",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}