{
    "relation": [
        [
            "Date",
            "Mar 4, 1999",
            "Oct 9, 2001",
            "Mar 1, 2004",
            "Apr 25, 2007",
            "May 7, 2007",
            "May 21, 2007",
            "Sep 6, 2007",
            "Sep 11, 2007",
            "Mar 10, 2008",
            "Mar 21, 2008",
            "Aug 20, 2008",
            "Aug 20, 2008",
            "Feb 28, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "REMI",
            "AS",
            "SULP",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: THEMOCORPS,INC., COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GINSBURG, ROBERT;REEL/FRAME:009796/0694 Effective date: 19980316 Owner name: RADIANT MEDICAL, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:THERMOCORPS, INC.;REEL/FRAME:009796/0688 Effective date: 19980316",
            "",
            "Year of fee payment: 4",
            "Owner name: RADIANT MEDICAL, INC., CALIFORNIA Free format text: TERMINATION OF SECURITY INTEREST IN PATENTS (REEL/FRAME NO. 012232/0327);ASSIGNOR:GATX VENTURES, INC.;REEL/FRAME:019204/0292 Effective date: 20041021",
            "Owner name: BAY CITY CAPITAL FUND IV L.P., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:RADIANT MEDICAL, INC.;REEL/FRAME:019254/0602 Effective date: 20070430",
            "Owner name: HORIZON TECHNOLOGY FUNDING COMPANY LLC,CONNECTICUT Free format text: SECURITY AGREEMENT;ASSIGNOR:RADIANT MEDICAL, INC.;REEL/FRAME:019353/0087 Effective date: 20070430",
            "Owner name: BAY CITY CAPITAL FUND IV, L.P., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HORIZON TECHNOLOGY FUNDING COMPANY LLC;REEL/FRAME:019781/0792 Effective date: 20070906 Owner name: BAY CITY CAPITAL FUND IV, L.P.,CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HORIZON TECHNOLOGY FUNDING COMPANY LLC;REEL/FRAME:019781/0792 Effective date: 20070906",
            "Owner name: BAY CITY CAPITAL FUND IV L.P., CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:RADIANT MEDICAL, INC.;REEL/FRAME:019805/0575 Effective date: 20070907",
            "",
            "Owner name: ZOLL CIRCULATION, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:RADIANT MEDICAL, INC.;BAY CITY CAPITAL FUND IV, L.P.;REEL/FRAME:020679/0246 Effective date: 20070918",
            "Year of fee payment: 7",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6110168 - Method and apparatus for controlling a patient's body temperature by in situ ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6110168?dq=7493558",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482530927,
    "recordOffset": 482491912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49145=Thus, the power required by external blood circulation and warming systems of the type previously known can be used as a rough estimate of the likely upper limit for power required by a system according to the present invention. It is most likely that such a system will best be equipped with a power supply having a capacity somewhere between the two rough estimates described above. It is therefore contemplated that a suitable power supply will be capable of providing peak power somewhere in the range between 100 and 1500 watts, probably being in the range between 300 and 1000 watts. The ranges specified are an estimate of suitable peak power capability. The power supply will most commonly be thermostatically controlled in response to a temperature sensor in the body of the catheter. The actual effective power transmitted to the patient will therefore typically be much less than the peak power capacity of the system power supply., 21270=This is a continuation-in-part of U.S. patent application Ser. No. 08/584,013 filed Jan. 11, 1996 and issued as U.S. Pat. No. 5,837,003 on Nov. 17, 1998, which is a continuation-in part of 08,324,853 filed Oct. 18, 1994 and issued as U.S. Pat. No. 5,486,208, which was a continuation of 08/015,774 filed Feb. 10, 1993, now abandoned., 48142=An alternative estimate can be made by comparing the likely performance of the various embodiments described herein with the power requirements for the external blood warming apparatus presently known. Such external warming apparatus generally requires a supply of power on the order of 1000-1500 watts and sometimes more. A device according to the present invention will most likely require considerably less power than that. First, the present invention requires no external pump to circulate the blood; this function is provided by the patient's own heart. Accordingly, no power is needed to drive such a pump. Secondly, the present invention is considerably less complicated than external blood warming systems. Known systems circulate the blood over a relatively lengthy path from the patient, through the warming element, and back into the patient. It is expected that more heat is lost over this lengthy path than will be lost in any device according to the present invention.}",
    "textBeforeTable": "Patent Citations Broadly stated, the present invention provides a method for modifying a patient's body temperature by controlling the temperature of a catheter inserted into a blood vessel of the patient. Although several illustrative examples of means for practicing the invention are described above, these examples are by no means exhaustive of all possible means for practicing the invention. The scope of the invention should therefore be determined with reference to the appended claims, along with the full range of equivalents to which those claims are entitled. Various embodiments of apparatus suitable for practicing the methods of the present invention have been described. Other embodiments and modifications will occur to those skilled in the art. For example, various means for heat transfer, e.g., resistance, including radio frequency, heating; laser energy; pumped fluids; etc., may be combined with various means for increasing the effective heat transfer surface area, e.g., balloons, fins, ribs, etc., to optimize the function of a device according to the present invention. Also, a temperature sensor will typically be used although for ease of illustration such a sensor is not depicted in all of the embodiments described. Furthermore, although most of the figures depict embodiments in which only a limited portion of the catheter is temperature controlled, no reason exists to prevent warming or cooling substantially the whole length of the catheter. Blood is essentially water containing a number of suspended and dissolved substances. As such,",
    "textAfterTable": "US4857054 * Jul 15, 1988 Aug 15, 1989 Eastman Kodak Company Perfusion angioplasty catheter with pump assist US4892095 * Mar 17, 1987 Jan 9, 1990 Nakhgevany Karim B Endotracheal tube US4892519 * Dec 3, 1987 Jan 9, 1990 Advanced Cardiovascular Systems, Inc. Steerable perfusion dilatation catheter US4899741 * Apr 11, 1988 Feb 13, 1990 Hgm Medical Laser Systems, Inc. Laser heated probe and control system US4909252 * May 26, 1988 Mar 20, 1990 The Regents Of The Univ. Of California Perfusion balloon catheter US4920963 * Apr 4, 1988 May 1, 1990 Brader Eric W Apparatus for preventing brain damage during cardiac arrest, CPR or severe shock US4941475 * Aug 7, 1989 Jul 17, 1990 Spectramed, Inc. Thermodilution by heat exchange US4976691 *",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}