{
    "relation": [
        [
            "Position",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Driver / Passenger",
            "Etienne Bax / Kaspars Stupelis",
            "Valentin Giraud / Nicholas Musset",
            "Jan Hendrickx / Elvijs Mucenieks",
            "Daniël Willemsen / Robbie Bax",
            "Stuart Brown / Josh Chamberlain",
            "Koen Hermans / Kenny van Gaalen",
            "Andy Bürgler / Martin Betschart",
            "Marvin Vanluchene / Eduard Soenens",
            "Jason van Daele / Olivier Valcke",
            "Vaclav Rozehnal / Marek Rozehnal"
        ],
        [
            "Equipment",
            "Zabel-WSP",
            "KTM-WHT",
            "Husqvarna-WSP",
            "Zabel-WSP",
            "Zabel-WSP",
            "Zabel-WSP",
            "KTM-VMC",
            "Zabel-WSP",
            "Husqvarna-WHT",
            "Zabel-VMC"
        ],
        [
            "Bike No.",
            "2",
            "5",
            "4",
            "111",
            "3",
            "15",
            "16",
            "19",
            "7",
            "8"
        ],
        [
            "Points",
            "401",
            "370",
            "336",
            "306",
            "278",
            "225",
            "212",
            "189",
            "173",
            "173"
        ]
    ],
    "pageTitle": "Sidecarcross World Championship - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Sidecarcross_World_Championship",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 875752411,
    "recordOffset": 875715709,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5976=While usually a male-dominated sport the 2014 season saw the participation of a women driver in the competition. Belgian Sabrina van Calster was able to score two points in the first race of the Swiss Grand Prix.[8][9], 4067=The Sidecarcross World Championship, first held in 1980 and organised by the Fédération Internationale de Motocyclisme, is an annual competition. All races, manufacturers and the vast majority of riders in the competition being in and from Europe.[3][4] Sidecarcross is similar to motocross except that the teams consist of two riders, a driver and a passenger. Races are held on the same tracks as solo motocross but the handling of the machines differs as sidecars don't lean. The majority of physical work in the sport is carried out by the passenger, who speeds up the sidecarcross in corners by leaning out. The coordination between the driver and the passenger are therefore of highest importance.[5] Record world champion Daniël Willemsen estimated that the passengers contribution to the success of a team is at least 50%, and that not enough credit is given to the passenger. The balance of a sidecar is reliant on the work of the passenger and passenger-driver coordination is vitale for success.[6], 63389=From 2003 to 2008, Daniël Willemsen to made up for his lost titles and won six in a row, becoming the most successful driver so far. He won two each with passengers Kaspars Stupelis, Sven Verbrugge and Reto Grütter., 58708=The first edition of the world championship in 1980 saw the only German victory to date with the combination Reinhard Böhler / Siegfried Müller taking out the title. The year after, the championship went to the Netherlands with Ton van Heugten / Frits Kiggen. The next eight seasons, the Swiss riders triumphed. Emil Bollhalder / Karl Büsser won the championship in 1982 and 1983, both times with a narrow margin, 11 points in the first year and 28 in the second. Unlucky runner-up in the three seasons from 1981 to 1983 were the Germans Josef Brockhausen / Hubert Rebele, missing out quite narrowly and retiring in 1983 after the third attempt, as did Bollhalder, but as the world champion., 81686=Price money and travel reimbursements in the sport are not large, sidecarcross still qualifying mostly as an amateur sport. In the 2009 season for example, every team received Euro 500 as a travel indemnity per race weekend qualified for. Additionally, price money was paid, with the winner earning €300, the second placed team €250, the third placed team €200. With the prize money gradually dropping off from there, the teams placed twelfth to twentieth still received €50 each.[19] All up, the best possible result would mean a team could take away €1,100 from a race weekend.[7], 199718=1990   B. Janssen - T. Janssen 1991   Timmermans - Verhagen 1992   Timmermans - Verhagen 1993   Fuhrer - Käser 1994   Fuhrer - Käser 1995   Fuhrer - Käser 1996   Fuhrer - Käser 1997   Serģis - Rasmanis 1998   Serģis - Rasmanis 1999   D. Willemsen - M. Willemsen, 3201=The current champions for the 2014 season are the Belgian-Dutch combination Ben Adriaenssen and Ben van den Bogaart, having won their second World Championship this season., 61736=The 1997 season marked the beginning of a new era with all previous World Champions having either retired before, or at the end of, the 1996 season. With Kristers Sergis / Artis Rasmanis the 1997 championship went to Latvia for the first time. The tightest race for the championship so far saw them beat the German/Dutch team of Alois Wenninger / Henry van de Wiel by four points. The year after, they won again, this time with a twenty-point gap to Daniël Willemsen / Marcel Willemsen., 65103=The 2013 season marked, with Ben Adriaenssen, the second time that a Belgian driver won the title. Defending champion Daniël Willemsen missed most of the season with injury while 2012 runners-up Etienne Bax came second once more. Adriaenssen and his Dutch passenger Ben van den Bogaart also won the 2014 championship while Etienne Bax came second for third consecutive time., 75868=The points system in the 2001 season:, 55529=The history of international competition started with the FIM Cup in 1971, a form of an unofficial European championship, organised by the FIM. The first ever race was held on 25 April 1971 at Pernes-les-Fontaines, France., 65943=Every Grand Prix weekend is split into two races, both held on the same day. This means, the 2007 season with its eight Grand Prix had sixteen races. Each race lasts for 30 minutes plus two laps. The two races on a weekend actually get combined to determined an overall winner. In case of a tie the results of the second race are used to determined the winner. While this overall winners receives no extra WC points, they usually are awarded a special trophy. Race start times are set at 13:30 and 16:00.[7], 11866=In the 2014 season, 56 teams finished in the points in the competition, with the drivers hailing from thirteen Europen nations. Of these, the drivers for the Netherlands were the most popolus, having thirteen drivers in the competition, followed by Belgium with nine and Germany with six.[12] In the last four seasons, drivers from the following countries took part in the competition and earned points:, 206277=2010   D. Willemsen - Eggink 2011   D. Willemsen - Verbrugge 2012   D. Willemsen - van Gaalen 2013   Adriaenssen - van den Bogaart 2014   Adriaenssen - van den Bogaart 2015   tbd - tbd, 70195=Historically, the points system has varied and changed over time. In the first three seasons, 1971, 1972 and 1973, points were only awarded for the overall Grand Prix result, after that they were awarded for the individual races. The best ten teams were awarded points with the winner receiving 15 points. This was altered to 15 teams scoring points and the winner receiving 20 from 1984. The current system of 20 teams receiving points and the winner getting 25 was adopted in 2002. Until 1976, only a set number of best results were counted towards the overall standings, since 1977 all results count. Grand Prix were always held in two races except in 1992 and 1993 when three races were held in every Grand Prix. In those two years, races were 20 minutes plus two laps long, after this they reverted to 30 minutes plus two laps again.[18], 63753=In 2009, the title went to a Belgian driver for the first time, Joris Hendrickx winning the championship, with his Latvian passenger Kaspars Liepins. In 2010, the title returned to the Netherlands with Daniël Willemsen taking out his eighth championship, together with Gertie Eggink as his passenger. In the following year, Willemsen took out another world championship, this time with Sven Verbrugge as his passenger once more, the third for the combination., 59995=From 1984 to 1987, four titles went to Hansi Bächtold / Fritz Fuß. Again, there was no luck for the runner-up with the Dutch combination August Muller / Henk van Heek coming second in 1985, 1986 and 1987. In 1986, only 7 points separated winner from second place. Bächtold retired as the new record world champion in 1987., 64426=Willemsen won a historic tenth World Championship in 2012, finishing five points ahead of Etienne Bax, despite having to exchange his passenger twice. Willemsen used Haralds Kurpnieks as his passenger in the first Grand Prix of the season, Kenny van Gaalen in the following five Grand Prix and Lauris Daiders in the remaining. Kurpnieks suffered a broken wrist in the openeing GP while van Gaalen injured his knie in the second French GP, both being thereby sidelined for lengthy periods of time.[17], 195947=1980   Böhler - Müller 1981   van Heugten - Kiggen 1982   Bollhalder - Büsser 1983   Bollhalder - Büsser 1984   Bächtold - Fuß 1985   Bächtold - Fuß 1986   Bächtold - Fuß 1987   Bächtold - Fuß 1988   C. Hüsser - A. Hüsser 1989   C. Hüsser - A. Hüsser, 125999=A sidecarmanufactures championship has been held since 1980 when the World Championship was introduced. Initially, until 1988, the competition was for engine manufactures. After a break of no manufactures championship it returned in 1992, now for frame manufacturers:[21][22], 203336=2000   Serģis - Rasmanis 2001   Serģis - Rasmanis 2002   Serģis - Rasmanis 2003   D. Willemsen - Stupelis 2004   D. Willemsen - Stupelis 2005   D. Willemsen - Verbrugge 2006   D. Willemsen - Verbrugge 2007   D. Willemsen - Grütter 2008   D. Willemsen - Grütter 2009   Hendrickx - Liepiņš, 60473=Christoph Hüsser / Andreas Hüsser won the titles in 1988 and 1989 and continued to race after that until 1996, never coming close to another world championship again. Benny Janssen / Tiny Janssen became the last to win one championship only when the finished on top in 1990, beating the German team Michael Garhammer / Ralf Haas by only 13 points and ending eight years of Swiss domination., 61136=Eimbert Timmermans / Eric Verhagen from the Netherlands beat the Belgian duo Eddy Ramon / Gino Strubbe for the next two titles in 1991 and 92. After this, the world championship returned to Switzerland with Andreas Fuhrer / Adrian Käser equaling the record of four titles in a row from 1993 to 1996 and then retiring from the competition., 158035=The top ten teams in the standings are (as of 14 July 2015):[23][24], 55970=From 1975, the competition was officially called European championship. From the 1980 season onwards, it carried the title World championship, even though, in practice, virtually all drivers and passengers are European, except for a small number of riders from the US and Australia, and all races are held in Europe. In its history, there has never been a race outside Europe and majority of the races are in central Europe. The appearance of strong Latvian drivers however has taken races to the Baltic region in the last few years. As of 2007, 24 European countries have hosted GPs, Germany holding number one spot there. Races have however also been staged at countries with no strong sidecarcross connections, like Greece, Norway and Northern Ireland.[14], 2761=The Sidecar Motocross World Championship is an annual event, first held in 1980. It is organised by the Fédération Internationale de Motocyclisme (FIM). Before 1980, a European competition was held from 1971 onwards., 73337=The points system from 1984 to 2000:, 57276=The competitors in the world championship are mostly amateurs. Apart from racing in the world championship they also compete in their countries' domestic championships. The current world champion Willemsen also won the Dutch national championship this year. Most national championships are actually \"open\" events; non-nationals are permitted to compete, too. Sergis / Rasmanis for example also won the German championship in 1998.[15], 62554=1999, saw the tightest race ever when only one point at the end of the season separated the Willemsen brothers from the Latvian title holders. The final outcome of the season was not clear until the Willemsen brothers were cleared of having received outside assistance in the second-last race which clinched them the world title, since Artis Rasmanis had lodged a formal complaint.[16] In 2000, Kristers Sergis / Artis Rasmanis came back, beating Daniël Willemsen / Sven Verbrugge by 20 points, the last tight race to date. The Latvians became the new record holder after title number four and five in 2001 and 2002, Willemsen coming second all three seasons., 57833=The highest number of championships has been won by Daniël Willemsen with ten, with the last of those coming in 2012. The most successful team however is Kristers Sergis / Artis Rasmanis with five titles together. The two missed out on a sixth title, when in 1999, they lost by only one point to Daniël Willemsen., 9814=The World Championship in sidecar motocross is held annually form the European spring to autumn. The fifteen Grands Prix of the season are to be held in nine countries, Switzerland (two events), Germany (three events), Czech Republic, Netherlands, France (three events), Estonia, Spain and Latvia (two events). In comparison to the 2014 season five extra Grands Prix were added. Germany increased its number of Grands Prix from two to three while Latvia increased theirs from one to two. The Belgian Grand Prix was re-added to the season after having been cancelled in 2014 because of bad weather. Ukraine, who had its 2014 Grand Prix cancelled because of the political situation in the country, originally received a Grand Prix for 2015 but this event was removed from the calendar again. Switzerland also had its number of Grands Prix increased from one to two while Spain had not been on the calendar since 2005.[3][10][11], 71474=The points system from 1971 to 1983:, 18002=The calendar for the 2015 season:[13]}",
    "lastModified": "Sun, 02 Aug 2015 17:06:26 GMT",
    "textBeforeTable": "The top ten teams in the standings are (as of 14 July 2015):[23][24] 2015 Sidecarcross World Championship Main article: The 2015 season[edit] 165 32 KTM-WHT Daniel Millard / Joe Millard 10 179 111 Zabel-WSP Daniel Willemsen / Robbie Bax 9 181 5 Zabel-VMC Vaclav Rozehnal / Jakub Vejchoda 8 190 10 Zabel-WHT Jason van Daele / Tim Smeuninx 7 206 9 Zabel-VMC",
    "textAfterTable": "See also[edit] List of national sidecarcross champions References[edit] ^ Starke Notgemeinschaft (German) .motorsport-aktuell.com, published: 24 November 2009, accessed: 3 April 2011 ^ Auf Abschiedstour (German) Mitteldeutsche Zeitung, published: 9 March 2012, accessed: 7 November 2014 ^ a b 2014 calendar FIM website, accessed: 23 September 2014 ^ a b c FIM SIDECAR MOTOCROSS WORLD CHAMPIONSHIP: Classification 2013 FIM website, accessed: 8 October 2013 ^ a b The World Championship - Other: What is Sidecarcross.com, accessed: 27 July 2011 ^ Sidecar motocross – A team sport FIM website, published: 15 December 2012, accessed: 21 September 2012 ^ a b c d e f g h FIM SIDECAR MOTOCROSS WORLD CHAMPIONSHIP APPENDIX FIM website, accessed: 27 July 2011 ^ Gespann-WM: Rennen der Überraschungen (German) Speedweek, published: 14 April",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}