{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7"
        ],
        [
            "RxCUI",
            "313564",
            "313564",
            "313564",
            "313564",
            "313565",
            "313565",
            "313565"
        ],
        [
            "RxNorm NAME",
            "valACYclovir 1 GM Oral Tablet",
            "valacyclovir 1000 MG Oral Tablet",
            "valacyclovir (as valacyclovir hydrochloride) 1 GM Oral Tablet",
            "valacyclovir 1 GM Oral Tablet",
            "valACYclovir 500 MG Oral Tablet",
            "valacyclovir 500 MG Oral Tablet",
            "valacyclovir (as valacyclovir hydrochloride) 500 MG Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "SY",
            "PSN",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - VALACYCLOVIR- valacyclovir hydrochloride tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=E228913A-8F12-4A4F-BC14-BA44D6E9ECE9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 58598531,
    "recordOffset": 58558486,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{131360=Warnings and Precautions, Central Nervous System Effects (5.3) 3/2010, 1629=© RLI, 2014, 119859=Revised: 7/2014, 3799=You may report side effects to FDA at 1-800-FDA-1088., 1706=10009144/02 Revised July 2014, 71009=A prospective epidemiologic registry of acyclovir use during pregnancy was established in 1984 and completed in April 1999. There were 749 pregnancies followed in women exposed to systemic acyclovir during the first trimester of pregnancy resulting in 756 outcomes. The occurrence rate of birth defects approximates that found in the general population. However, the small size of the registry is insufficient to evaluate the risk for less common defects or to permit reliable or definitive conclusions regarding the safety of acyclovir in pregnant women and their developing fetuses., 120950=To report SUSPECTED ADVERSE REACTIONS, contact Roxane Laboratories, Inc. at 1-800-962-8364 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch. (6)}",
    "textBeforeTable": "Number of versions: 3 VALACYCLOVIR- valacyclovir hydrochloride tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(0054-0114, 0054-0115) 058839929 Boehringer Ingelheim Roxane Inc Business Operations ID/FEI Address Name Establishment Registrant - Roxane Laboratories, Inc (833490464) Labeler - Roxane Laboratories, Inc (833490464) 05/24/2010 ANDA078656 ANDA Marketing End Date",
    "textAfterTable": "2 313564 valacyclovir 1000 MG Oral Tablet SCD 3 313564 valacyclovir (as valacyclovir hydrochloride) 1 GM Oral Tablet SY 4 313564 valacyclovir 1 GM Oral Tablet SY 5 313565 valACYclovir 500 MG Oral Tablet PSN 6 313565 valacyclovir 500 MG Oral Tablet SCD 7 313565 valacyclovir (as valacyclovir hydrochloride) 500 MG Oral Tablet SY Get Label RSS Feed for this Drug VALACYCLOVIR- valacyclovir hydrochloride tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=E228913A-8F12-4A4F-BC14-BA44D6E9ECE9 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS X. How to discontinue the RSS feed If you no longer wish",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}