{
    "relation": [
        [
            "Patent application number",
            "20090190477",
            "20100309919",
            "20120307644"
        ],
        [
            "Description",
            "SELECTIVELY FORWARDING TRAFFIC THROUGH TUNNELS IN A COMPUTER NETWORK - In one embodiment, an autoroute filter list may be configured with a list of traffic identifiers. Accordingly, at a tunnel head-end node, an autoroute operation may be performed to configure the routing of all traffic in a network onto an appropriate tunnel except for traffic identified in the autoroute filter list.",
            "LABEL DISTRIBUTION PROTOCOL LABEL FILTERING - In one embodiment, a device of a particular non-backbone routing domain in a computer network determines whether each of one or more routes is reachable within the particular non-backbone domain. The device may then generate a filtered set of label mappings having only those of the one or more routes reachable within the particular non-backbone domain. Accordingly, the device may advertise label mappings only of the filtered set to one or more neighboring devices.",
            "SYSTEM AND METHOD FOR LINK PROTECTION USING SHARED SRLG ASSOCIATION - In one embodiment, certain SRLGs associated with members of a bundle are deemed to be “risk-free SRLGs”, i.e., SRLGs whose failure may not substantially impact the capacity of the bundle to carry traffic in a computer network. In a bandwidth unaware embodiment a number of active members of the bundle is identified for each SRLG, and a bandwidth aware embodiment further specifies an available bandwidth capacity for each SRLG to determine risk-free SRLGs. A backup path or tunnel may be established and utilized to protect a communication link as long as the SRLGs shared are deemed to be risk-free SRLGs."
        ],
        [
            "Published",
            "07-30-2009",
            "12-09-2010",
            "12-06-2012"
        ]
    ],
    "pageTitle": "Osborne, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/osborne-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439032963,
    "recordOffset": 439001883,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Eric W. Osborne, Sutton, MA US 02-11-2010 Motion Induced Electrical Generator - A motion induced generator is mounted to a vehicle or conveyance to harness the oscillatory motion generated during travel of the vehicle or conveyance, and may be coupled to at least one device or system, such as an external rail car lighting system, a global positioning device, a diagnostic device, or a combination thereof. Once the motion of the vehicle is harnessed and translated into usable and/or storable energy, the current or voltage is transmitted directly to the units for immediate consumption or for storage in a battery, capacitor, or a combination thereof. 20100032946 Published Description Patent application number Donald Warren Osborne, Crawley, WV US 06-07-2012 MOTION INDUCED ELECTRIC GENERATOR - A motion induced electric generator is mounted to a vehicle or conveyance to harness the oscillatory motion generated during travel of the vehicle or conveyance, and may be coupled to at least one device or system, such as an external rail car lighting system, a global positioning device, a diagnostic device, or a combination thereof. Once the motion of the vehicle is harnessed and translated into usable and/or storable energy, the current or voltage is transmitted directly to the units for immediate consumption or for storage in a battery, capacitor, or a combination thereof. 20120139262 Published Description Patent application number Donald W. Osborne, Crawley, WV",
    "textAfterTable": "Patent applications by Eric W. Osborne, Sutton, MA US Eugene E. Osborne, Hebron, KY US Patent application number Description Published 20080201847 PATIENT SUPPORT APPARATUS HAVING A DIAGNOSTIC SYSTEM - A patient support including a frame and a mattress supported by the frame. The frame includes a deck support and a deck supporting the mattress. 08-28-2008 20080201851 LIFT SYSTEM FOR HOSPITAL BED - A lift system for a hospital bed is disclosed. The lift system includes lift arms that support a frame over a base frame. The lift arms are moved to raise and lower the frame relative to the base frame. 08-28-2008 20080289108 LIFT SYSTEM FOR HOSPITAL BED - A lift system for a hospital bed is disclosed. The lift system includes lift arms that support a frame over a base frame. The lift arms are moved to raise and lower the frame relative to the base frame. 11-27-2008 20090313758 HOSPITAL BED - A hospital bed is disclosed. The bed includes at least one tiltable deck section, and a linkage assembly configured to facilitate tilting of the at least one deck section. 12-24-2009 20110037597 BODY POSITION MONITORING",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}