{
    "relation": [
        [
            "Play Type",
            "Single",
            "Single",
            "Out",
            "Walk",
            "Single",
            "Substitution",
            "Out",
            "Walk",
            "Triple",
            "Hit-by-pitch",
            "Out"
        ],
        [
            "Play",
            "Lyle Overbay singled to right. Runner on first with none out and John Buck due up.",
            "John Buck singled to left. Runners on first and second with none out and Jarrett Hoffpauir due up.",
            "Jarrett Hoffpauir sacrifice bunt to third. Runners on second and third with one out and Fred Lewis due up.",
            "Fred Lewis intentionally walked. Bases loaded with one out and Alex Gonzalez due up.",
            "Alex Gonzalez singled to left scoring Lyle Overbay with one out. Bases loaded and Jose Bautista due up.",
            "Chan Ho Park enters the game for the Yankees with the bases loaded and one out.",
            "Jose Bautista struck out looking. Bases loaded with two outs and Vernon Wells due up.",
            "Vernon Wells walk scored Nick Green with two out. Bases loaded and Dewayne Wise due up.",
            "Dewayne Wise tripled to center scoring Fred Lewis, Alex Gonzalez and Vernon Wells with two out. Runner on third and Aaron Hill due up.",
            "Aaron Hill was hit-by-pitch. Runners on first and third with two outs and Lyle Overbay due up.",
            "Lyle Overbay grounded out to first to end the inning."
        ]
    ],
    "pageTitle": "Friday, July 2, 2010 Toronto Blue Jays - New York Yankees Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/BlueJays_Yankees/2010/07/02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 57900773,
    "recordOffset": 57884379,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2357=View all MLB box scores for 7/2/2010}",
    "TableContextTimeStampAfterTable": "{40436=\"I go one (start) at a time and I'll feed off this one. I had a couple walks, but was able to make pitches when I needed to. My focus was there, my mind was better and was able to feel and make the corrections,\" said Burnett, who lost all five of his June starts.}",
    "textBeforeTable": "Top of the 1st Jerry Meals  3B Dale Scott  2B Dan Iassogna  1B Mark Wegner  H Umpires 6.66 13 25 1 1 1 1 1 0.2 Chan Ho Park  6.15 19 31 0 2 4 4 3 1.1 David Robertson (L, 0-3) 0.86 13 21 1 0 0 0 1 1 Mariano Rivera  5.40 11 21 0 1 1 1 2 1 Joba Chamberlain (BS, 2) 4.60 4 7 0 0 0 0 0 0.1 Damaso Marte (H, 9) 4.90 68 106 6 3 0 0 4 6.2 A.J. Burnett  ERA Strikes Pitches SO BB ER R H IP Name 4.06 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Yankees pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/yankees_22t.png 9 13 1 0 0 0 0 1 Kevin Gregg  4.94 8 14 1 0 0 0 0 1 Jason Frasor (W, 3-1) 2.88 9 16 0 0 0 0 0 1.2 Scott Downs  2.32 5 9 0 0 0 0 1 1.1 Shawn Camp  4.19 54 96 5 6 1 1 4 6 Brett Cecil  ERA Strikes Pitches SO BB ER R H IP Name \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Blue Jays pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/bluejays_22t.png",
    "textAfterTable": "Top of the 2nd Play Type Play Out Adam Lind struck out looking. None on with one out and Aaron Hill due up. Out Aaron Hill fouled out to first. None on with two outs and Lyle Overbay due up. Single Lyle Overbay singled to center. Runner on first with two outs and John Buck due up. Single John Buck singled to right. Runners on first and second with two outs and Jarrett Hoffpauir due up. Error-wild-pitch Lyle Overbay advanced to third and John Buck to second on A.J. Burnett wild pitch. Runners on second and third with two outs and Jarrett Hoffpauir at the plate. Out Jarrett Hoffpauir struck out swinging to end the inning. Bottom of the 2nd Play Type Play Out Jorge Posada struck out swinging. None on with one out and Curtis Granderson due up. Out Curtis Granderson grounded out to first. None on with two outs and Francisco Cervelli due up. Single Francisco Cervelli singled to left. Runner on first with two outs and Brett Gardner due up. Out Brett Gardner struck out swinging to end the inning.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}