{
    "relation": [
        [
            "Character",
            "Michel",
            "Ginko",
            "Maya",
            "Tatsuya"
        ],
        [
            "Persona",
            "Rhadamanthus Prime",
            "Eros Prime",
            "Maia Prime",
            "Vulcanus Prime"
        ],
        [
            "Condition",
            "at Zodiac, let Michel beat the boss himself",
            "at the Concert Hall, let Ginko talk it out",
            "at the Aerospace Museum, let Maia jump down to save the girl",
            "obtain all of the above Personas"
        ]
    ],
    "pageTitle": "Shin Megami Tensei: Persona 2 - Innocent Sin Spoiler-Free Walkthrough for PSP by ThatGuy4913 - GameFAQs",
    "title": "",
    "url": "http://www.gamefaqs.com/psp/611279-shin-megami-tensei-persona-2-innocent-sin/faqs/63171",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476751351,
    "recordOffset": 476716773,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21833=IMPORTANT: For Tatsuya's level up bonuses, maintain a 1:3 ratio between Vt and Dx, so Dx is three times as much as Vt. When Dx reaches 99, Vt should be around 33., 150985=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use}",
    "textBeforeTable": "Watch the scene. Welcome to the first dungeon. Seven Sisters High Go to Seven Sisters High. Rengedai Press Square to display the location names. Head left and up to Kameya Alley, then enter Shiraishi Ramen for a scene. Leave and enter Kuzunoha Detective Agency and Chief Todoroki will offer to spread the rumor for you. Talk to him and choose to spread the rumor. Leave and return to Shiraishi Ramen (note the new sword symbol on the selection screen), and you'll receive your first set of weapons. Leave and head to any exit on the edge of Hirasaka, then select Rengedai from the map screen. At this point, I'd like to mention that Persona 2 has a ton of NPC dialogue, and all of it changes after most scene or battle events. I won't mention any of it in this guide, just what you need to do to progress in the story. Now you're free to wander. Hirasaka Watch the scene, then walk to the stairs to trigger a scene, then walk up the stairs and leave. Note that Michel is pronounced \"me-shell\" (closer to Michelle than Michael). Sumaru Prison Next up, Sumaru Prison. Now at the Bike Racks with Ms. Saeko. It doesn't matter what you say. As you find your way around the school, note that you can rotate the screen with the shoulder buttons. Every time you enter a new area,",
    "textAfterTable": "Tatsuya 1 Poltergeist 2 Devil Tatsuya 2 Michel+Maya Nightmare 3 Moon Tatsuya 2 Yukino 1 Xaphan 3 Hanged Man Tatsuya 3 Tatsuya 1 Ratatoskr 4 Hermit Michel 1 Tatsuya 2 Contact example: Tatsuya 4 means Tatsuya's 4th contact option from the top (Death Stare), and Michel+Maya means to select both Michel and Maya for a group contact. Walk around and fight some battles with the demons listed above. Use the fusion spells Hydro Boost (Agi-Magna-Aques), Towering Inferno (Aques-Magna-Agi), Earth Slice EX (Magna-Straight Slash), and Flame Cut EX (Agi-Straight Slash) to easily defeat the demons. IMPORTANT: For Tatsuya's level up bonuses, maintain a 1:3 ratio between Vt and Dx, so Dx is three times as much as Vt. When Dx reaches 99, Vt should be around 33. The caretaker in the NW corner of 1F can heal your party if you need it. It's good to cure poison this way if you don't have Antidotes. Some notes on battle mechanics. You can press Start to toggle the animations on and off. Fusion spells are set to Standby by default, but if you go into the battle menu you can change them to Auto to skip the prompt (or Off if a fusion spell you don't want is happening automatically). You can set turn",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}