{
    "relation": [
        [
            "Lifetime Earnings",
            "All",
            "Low",
            "Middle",
            "High"
        ],
        [
            "Without Scale Economies: 10th Percentile",
            "10.1",
            "7.0",
            "13.1",
            "22.5"
        ],
        [
            "Without Scale Economies: 50th Percentile",
            "34.6",
            "21.5",
            "33.4",
            "62.2"
        ],
        [
            "Without Scale Economies: 90th Percentile",
            "132.9",
            "115.0",
            "112.4",
            "191.1"
        ],
        [
            "With Scale Economies: Mean",
            "65.4",
            "50.9",
            "54.4",
            "114.3"
        ],
        [
            "With Scale Economies: 10th Percentile",
            "11.0",
            "7.4",
            "13.8",
            "26.7"
        ],
        [
            "With Scale Economies: 50th Percentile",
            "45.7",
            "27.1",
            "44.1",
            "88.0"
        ],
        [
            "With Scale Economies: 90th Percentile",
            "194.6",
            "149.5",
            "162.5",
            "352.6"
        ],
        [
            "With Scale Economies: Mean",
            "120.2",
            "99.8",
            "83.9",
            "237.8"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - Do Households Have Enough Wealth for Retirement?",
    "title": "Table 3: continued - Annuitized Comprehensive Wealth, by Age and Lifetime Earnings: Age: 76",
    "url": "http://www.federalreserve.gov/Pubs/feds/2007/200717/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448800615,
    "recordOffset": 448741833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12765=In addition to the replacement-rate approach, the literature inlcudes a collection of papers comparing wealth patterns in the data with optimal accumulation patterns from a stochastic life cycle model (see Engen, Gale, and Uccello, 1999,2005; Scholz, Seshadri, and Khitatrakun, 2006). The advantage of this method is that it derives from theoretical principles: working households save the amount necessary to provide the maximum level of smoothed consumption over their expected lifetimes. The stochastic model recognizes that each household experiences a unique set of shocks to earnings and expected mortality over the life cycle, and thus low levels of observed wealth may be consistent with optimal behavior once we account for individual realizations of life cycle shocks. These papers find that most households prepare adequately for retirement, with actual saving patterns in the neighborhood of what the life cycle model would predict. For example, Scholz, Seshadri, and Khitatrakun (2006) find that more than 80 percent of the households in the HRS saved more than their optimal life-cycle wealth targets, and that the deficits for most of those saving below the target were small., 19787=We find that, by these measures, most older households can expect to have adequate comprehensive wealth throughout retirement, though the households in the bottom 12 percent cannot and the next nine percent are relatively close.9 Across all households with a member aged 51 or older in 2004, we estimate average comprehensive wealth to be about $900,000, with a median value of about $536,000. We find an average expected annuity value of about $51,000 per person per year and a median expected value of $32,000. Accounting for household economies of scale, which allow couples to consume more per person than singles with the same per-capita income, we find $73,000 of single-equivalent consumption per person at the mean, and $40,000 at the median., 26264=Dramatic structural changes in the U.S. pension system, along with the impending wave of retiring baby boomers, have given rise to a broad policy discussion of the adequacy of household retirement wealth. We construct a uniquely comprehensive measure of wealth for households aged 51 and older in 2004 that includes expected wealth from Social Security, defined benefit pensions, life insurance, annuities, welfare payments, and future labor earnings. Abstracting from the uncertainty surrounding asset returns, length of life and medical expenses, we assess the adequacy of wealth using two expected values: an annuitized value of comprehensive wealth and the ratio of comprehensive wealth to the actuarial present value of future poverty lines. We find that most households in these older cohorts can expect to have sufficient total resources to finance adequate consumption throughout retirement, taking as given expected lifetimes and current Social Security benefits. We find a median annuity value of wealth equal to $32,000 per person per year in expected value and a median ratio of comprehensive wealth to poverty-line wealth of 3.56. About 12 percent of households, however, do not have sufficient wealth to finance consumption equal to the poverty line over their expected lifetimes, even after including the value of Social Security and welfare benefits, and an additional 9 percent can expect to be relatively close to the poverty line., 8832=A disadvantage of using the poverty line as a measure of adequacy is that the official poverty thresholds in the U.S. are somewhat imperfect and arbitrary. The thresholds are based on a definition of absolute poverty established in 1964, which were computed as a multiple of (e.g., 3 times) the Department of Agriculture's \"economy food plan\"--the least expensive of several plans that satisfied basic nutritional requirements. Although the thresholds were revised in subsequent years, the core concept of poverty as rooted in the affordability of adequately nutritious food expenditures remains the same.13 This is, by construction, a limited and arbitrary measure of adequate resources, because it excludes a great deal of information about the changing costs of living, such as housing and medical expenses.14 Nonetheless, in addition to being a standard measure that is widely used in public policy, the poverty line also provides a generally accepted method for assessing the absolute adequacy of household resources, a notion conceptually distinct from the issue of optimality. Moreover, the official poverty thresholds are adjusted to account for household economies of scale and age, which enables us to incorporate basic life-cycle and demographic effects in our analysis. However, because the poverty line is likely to be a noisy measure of the subsistence level of consumption, we also report statistics on households that are \"near poverty,\" which we define as a ratio of comprehensive wealth to poverty-line wealth of between 1.0 and 1.5., 6218=We use the 2004 wave of the HRS.15 The HRS is a national panel data set consisting of an initial (1992) sample of 7,600 households aged 51-61, with follow-ups every second year following. In 1998, the HRS was merged with a similar survey covering older households, and younger cohorts were also introduced. The youngest cohort (the \"Early Baby Boomers,\" born 1948-1953) was introduced in the 2004 wave. Our 2004 sample draws on all cohorts of the HRS, but we restrict our analysis to households with a respondent or spouse aged 51 years or older. Our final sample size is 12,861 households.16}",
    "TableContextTimeStampAfterTable": "{75236=A number of income and wealth variables from the 2004 RAND-Enhanced Fat File are missing for some households, but the HRS design includes \"unfolding brackets\" that provide ranges of values for many of the variables that are missing. We use the brackets to assign imputed values for households who indicate that they have a certain type of income or asset, but do not report the actual amount. If we have information indicating that a respondent should have a value for a particular variable but no information on a range for that value then we assign the missing value a zero. Otherwise, we use the range given by the HRS to impute missing values. Our goal is to match the distribution of imputed values to the distribution of actual values given by respondents., 16004=These results are similar to previous studies that have estimated expanded concepts of household wealth.34 For example, using the 2001 SCF, Wolff (2006) finds about a third of households have DB wealth and half have DC wealth, very close to our figures. He also finds that traditional net worth (excluding DC accounts) accounts for about 55 percent of \"augmented wealth.\" Summing our columns (1) and (2), our analogous figure would be 42 percent, but we include forms of wealth in the denominator (such as expected wages, annuities and welfare) that Wolff does not. Similarly, Gustman and Steinmeier (1998) found that pension wealth accounted for about a quarter of total wealth in 1992, while Social Security accounted for another quarter of wealth. Combining DC and DB wealth, we find about 22 percent of comprehensive wealth is accounted for by pensions and 18 percent by Social Security, though again we include additional sources in the denominator that result in lower shares., 74583=Our primary data sources are the RAND HRS Data File and the 2004 RAND-Enhanced Fat Files. These are HRS data files that have been compiled by RAND, and are often easier to use than the raw HRS data files. The RAND HRS Data File is a longitudinal file in which selected variables have been linked across the seven waves of the HRS. This file includes RAND-generated imputations of missing values. Many variables necessary for our analysis, including detailed DB and DC pension information, are not included in the RAND HRS Data File. For these variables, we use the 2004 RAND-Enhanced Fat File, which includes virtually all the raw HRS data., 82560=The conditional survival probabilities are based on the one-year age- and sex-specific conditional death probabilities in the Social Security Administration's 2002 Period Life Table (SSA, 2006c). Period life tables provide a snapshot of the mortality conditions prevailing in a single year, rather than the expected mortality experience of a given cohort over time. For young cohorts (e.g., children born in 2002), one might expect actual longevity to be significantly greater than shown in the 2002 period life table, since longevity generally improves over time. However, since our sample is of Americans aged 51 and older in 2004, we conclude that the 2002 period table (the most recent available) is a reasonable estimate of our sample's expected mortality experience.48, 59610=With regard to some of the trends that motivated our analysis, we conclude that, by our measures, the early wave of the baby boom generation appears to be on track to accumulating adequate retirement wealth. We find a median annuitized value wealth equal to $30,000 per person and a mean of $47,000, with a median ratio of wealth to the present value of poverty lines of 3.35. However, we find that about 27 percent of the early baby-boom cohort's comprehensive wealth is held in the form of expected future wages, and that the financial assets of this cohort is significantly lower than that of older cohorts. This is not entirely surprising, since this cohort was still in its peak earnings and savings years in 2004. But it emphasizes the point that, because the baby boomers are still in their working years, their consumption in retirement will depend crucially on their saving and labor-supply behavior and wage growth over their remaining years of work., 77686=In all calculations, we use the preliminary 2004 weights provided by the HRS., 61244=Overall, our findings show a generally optimistic view of retirement savings adequacy among current older cohorts, though with a notable pocket of inadequacy concentrated among those with the lowest lifetime earnings. However, we should note several caveats about our results. First, our measures of adequacy are based on expected values, and thus do not account for the substantial risks that arise from uncertain lifetimes, medical expenses and asset returns. Thus a risk-averse household with \"adequate\" wealth by our measures may not have enough wealth after accounting for the effect of these risks on utility. Second, our analysis focuses on households aged 51 and older in 2004, which includes the leading edge of baby boomers, but not younger boomers or succeeding generations. Thus our findings do not provide evidence about the adequacy of retirement savings among younger workers. Finally, our results should not be taken to imply that current household savings are necessarily sufficient in the long-run macroeconomic sense. The broad demographic trends at work over the next half century, including declining fertility and increasing longevity, imply that a higher household savings rate could, by increasing the size of the capital stock, significantly reduce the burden of higher taxes or lower spending that will otherwise fall on following generations. Viewed in this context, our findings are encouraging, to the extent that they show wealth accumulations at least do not appear to be declining among older households, but they do not show that household saving behavior is optimal in the intergenerational sense.}",
    "lastModified": "Fri, 04 May 2007 17:25:29 GMT",
    "textBeforeTable": "    --> \\end{equation*} a=\\frac{i}{2-\\delta^{T_{r}}-\\delta^{T_{s}}}. \\begin{equation*} \\end{equation*} C=aCW, \\begin{equation*} \\end{equation*} CW= \\frac{C}{i}\\left[2-\\delta^{T_{r}}-\\delta^{T_{s}}\\right], \\begin{equation*} \\end{equation*} \\frac{C\\delta}{1-\\delta}\\left[2-\\delta^{T_{r}}-\\delta^{T_{s}}\\right] = \\frac{C}{i}\\left[2-\\delta^{T_{r}}-\\delta^{T_{s}}\\right]. \\begin{equation*} \\end{equation*} 2C\\delta\\left(\\frac{1}{1-\\delta}-\\frac{\\delta^{T_{r}}}{1-\\delta}\\right)+C\\delta^{T_{r}+1}\\left(\\frac{1}{1-\\delta}-\\frac{\\delta^{T_{s}-T_{r}}}{1-\\delta}\\right).",
    "textAfterTable": "14.0 899.5 Std. Dev. 344.3 1244.6 775.8 534.9 396.8 126.8 217.7 62.8 1834.5 Pct with asset 31.3 90.5 91.0 50.1 38.2 86.7 38.1 13.1 99.7 Share of Total* 0.15 0.15 0.27 0.10 0.12 0.18 0.03 0.02 1.00 Gini 0.84 0.89 0.71 0.85 0.85 0.44 0.89 0.95 0.56 Cumulative Gini 0.84 0.77 0.67 0.67 0.64 0.57 0.57 0.56 0.56 Table 1: continued - Components of Comprehensive Wealth in 2004 (Thousands of 2004 Dollars): Non-Zero Values Only Statistics Exp. PV of Wages thru 61 (1) Financial Wealth (2) Houses, RE, Veh. & Bus. (3) DCs & IRAs (4) Exp. PV of DB Plans (5) Exp. PV of Soc. Sec. (6) Exp. PV of Annuities & Life Ins. (7) Exp. PV of Vet.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}