{
    "relation": [
        [
            "Patent application number",
            "20110131567",
            "20140067559"
        ],
        [
            "Description",
            "System and method for an application distribution and metrics system enabling the integration of distrubuted applications into host applications and the monetizing of distributed applications - The present invention comprises an application distribution and metrics system as well as an application monetizing system (ADMS). The ADMS incorporates a cross-platform application distribution system and a usage-based and ad-based monetizing system which allows for fine-tuned usage-based pricing schemes to be created based on system-defined metrics and developer-defined metrics, seamless integration of ad-based monetizing, third party participation in monetizing efforts, and a flexible revenue allocation process.",
            "SYSTEM AND METHOD FOR AN APPLICATION DISTRIBUTION AND METRICS SYSTEM ENABLING THE INTEGRATION OF DISTRUBUTED APPLICATIONS INTO HOST APPLICATIONS AND THE MONETIZING OF DISTRIBUTED APPLICATIONS - The present invention comprises an application distribution and metrics system as well as an application monetizing system (ADMS). The ADMS incorporates a cross-platform application distribution system and a usage-based and ad-based monetizing system which allows for fine-tuned usage-based pricing schemes to be created based on system-defined metrics and developer-defined metrics, seamless integration of ad-based monetizing, third party participation in monetizing efforts, and a flexible revenue allocation process."
        ],
        [
            "Published",
            "06-02-2011",
            "03-06-2014"
        ]
    ],
    "pageTitle": "Eric E. - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/eric-e-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436366737,
    "recordOffset": 436351080,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Eric E. Tirk, Spencerport, NY US //]]> BarDraw('3594313',['Patent applications by Eric E. Stangland, Midland, MI US'],[[1,2,2,1]],['2008','2011','2013','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3594313\" align=\"center\"></div> </div> <canvas id=\"bg3594313\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Eric E. Stangland, Midland, MI US</p> <div class=\"bar3594313\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-19-2015</td> <td><a href=\"/patents/app/20150076394\">CATALYSTS AND METHODS FOR ALCOHOL DEHYDRATION</a> - Provided is a process for preparing a diaryl ether compound through the dehydration of an aromatic alcohol compound in the presence of a dehydration catalyst. The dehydration catalyst is an oxide of a light rare earth element, wherein the light earth element is lanthanum, praseodymium, neodymium, or mixtures thereof.</td> <td>20150076394</td> <tr> </tr> <td>03-28-2013</td> <td><a href=\"/patents/app/20130079576\">CONVERSION OF METHYLAMINE TO OLEFIN OR MIXTURE OF OLEFINS</a> - Convert a methylamine (e.g. monomethylamine, dimethylamine and trimethylamine) to a mixture of olefins (e.g. ethylene, propylene and butylene) by placing the methylamine, optionally in a mixture with at least one of ammonia and an inert diluent, in contact with a microporous acidic silicoaluminophosphate catalyst or a microporous aluminosilicate catalyst.</td> <td>20130079576</td> <tr> </tr> <td>01-10-2013</td> <td><a href=\"/patents/app/20130012749\">CATALYTIC COMPOSITION FOR PRODUCTION OF OLEFINS WITH DECREASED OXYGENATE BYPRODUCTS</a> - Catalytic composition for production of olefins and methods of using same to decrease production of oxygenate byproducts. The catalytic composition includes an admixture of an alumina dehydration catalyst and at least one additional metal oxide.</td> <td>20130012749</td> <tr> </tr> <td>11-03-2011</td> <td><a href=\"/patents/app/20110268648\">PROCESS AND SYSTEM FOR PRODUCTION OF DICHLORINE</a> - The present disclosure provides",
    "textAfterTable": "Eric E. Youngblut, Seattle, WA US Patent application number Description Published 20090172774 METHOD AND SYSTEM FOR DISTRIBUTING SECURITY POLICIES - A method and system for distributing and enforcing security policies is provided. A firewall agent executing at a host computer system that is to be protected receives security policies for the enforcement engines responsible for enforcing the security policies on the host computer system. A security policy has rules that each provide a condition and action to be performed when the condition is satisfied. A rule also has a rule type that is used by the distribution system to identify the security components that are responsible for enforcing the rules. To distribute the security policies that have been received at a host computer system, the firewall agent identifies to which enforcement engine a rule applies based in part on rule type. The firewall agent then distributes the rule to the identified enforcement engine, which then enforces the rule. 07-02-2009 Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}