{
    "relation": [
        [
            "Release",
            "Release 2.0",
            "Release 3.2",
            "Release 3.2",
            "Release 3.9.0",
            "Release 4.2.0"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was introduced.",
            "This command was corrected to include the possibility of specifying three protocols simultaneously.",
            "This command was introduced.",
            "This command was supported in the dynamic template configuration mode for BNG."
        ]
    ],
    "pageTitle": "Cisco IOS XR Interface and Hardware Component Command Reference for the Cisco XR 12000 Series Router, Release 4.3.x - PPP Commands onthe Cisco IOS XR Softwarethe Cisco ASR 9000 Series Router [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/xr12000/software/xr12k_r4-3/interfaces/command/reference/b_interfaces_cr43xxr12k/b_interfaces_cr43xxr12k_chapter_01100.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363804803,
    "recordOffset": 363765189,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7285=This module provides command line interface (CLI) commands for configuring Point-to-Point Protocol (PPP) on the Cisco XR 12000 Series RouterCisco CRS RouterCisco ASR 9000 Series Router.}",
    "textBeforeTable": "Syntax Description node-id location interface-path-id | all } { interface state sso ppp clear To clear the replicated Inter-Chassis Stateful Switchover (ICSSO) states for the specified standby interface or for all interfaces on the specified node, use the clear ppp sso state command in EXEC mode. clear ppp sso state ssrp profile ssrp location ssrp group show ppp sso summary show ppp sso state show ppp sso alerts show ppp interfaces security ttl redundancy ppp timeout retry ppp timeout authentication ppp pap sent-username password ppp pap refuse ppp multilink multiclass remote apply ppp multilink multiclass local ppp multilink multiclass ppp ms-chap refuse ppp ms-chap password ppp ms-chap hostname ppp max-terminate ppp max-failure ppp max-configure ppp max-bad-auth ppp ipcp peer-address default ppp ipcp neighbor-route disable ppp ipcp dns ppp chap refuse ppp chap password ppp authentication peer ipv4 address",
    "textAfterTable": "Command Modes EXEC Command History Release Modification Release 3.9.0 This command was introduced. Usage Guidelines This command sets the PPP sessions in the Standby-Up state to the Standby-Down state. All replicated data received from the peer is purged, and SSRP Request messages are re-sent to the peer. Task ID Task ID Operations ppp execute Examples The following example shows how to clear the replicated ICSSO states for the specified standby interface:  RP/0/0RP0RSP0/CPU0:router# clear ppp sso state interface 0/1/0/1 The following example shows how to clear the replicated Inter-Chassis Stateful Switchover (ICSSO) states for all interfaces on the specified node:  RP/0/0RP0RSP0/CPU0:router# clear ppp sso state all location 1/0/1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}