{
    "relation": [
        [
            "School",
            "MBK",
            "Herm",
            "Herm"
        ],
        [
            "Time (Qtr)",
            "7:01 (1)",
            "5:22 (3)",
            "10:14 (4)"
        ],
        [
            "Scoring Play",
            "24-yd field goal Briones",
            "57-yd punt return Gist, PAT Steibel good",
            "Riddick 1-yd run, PAT Steibel good"
        ],
        [
            "Game Score",
            "3-0",
            "7-3",
            "14-3"
        ]
    ],
    "pageTitle": "Warchant.com - Special teams keys No. 78 Hermitage's win",
    "title": "",
    "url": "https://floridastate.rivals.com/content.asp?CID=1127933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00324-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873507377,
    "recordOffset": 873491421,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1934=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 Warchant.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{44814=September 18, 2010}",
    "textBeforeTable": "Photo Feature 3. Domico Phillips, RB, Meadowbrook... From his opening drive 57-yard run through the final whistle, Phillips, who picked up his first DI scholarship offer from Kent State earlier this week, gave the Hermitage defense fits as the senior ran hard, low and quickly both between the tackles and outside the hashes as a potential home run threat on every handoff.  Though the Monarchs never hit paydirt, Phillips had the defense on its heels and tackling air on several runs, leaving a trail of players off balance.  On the night, the workhorse back carried 34 times for 212 yards. 2. Justin Gist, DB / PR, Hermitage... His 57-yard punt return for a touchdown was the game's most electrifying play and signified the moment that the game turned in the Panthers favor as it seemed to light a spark under their collective seats.  But, even without that play, the senior would have easily joined this list as his ability to fill the alley and send Monarch runners tumbling was on display on several plays as his pressure outside kept Meadowbrook bottled up. 1. Curtis Grant, LB, Hermitage... With Rivals.com national analyst Mike Farrell in town to check out the All-American linebacker, Grant did not disappoint, notching 16 tackles by running sideline-to-sideline, stuffing rushes up the middle, overpowering blockers on some plays and running around them on others as the Panthers linebacker seemingly locked down his five-star status and solidified his",
    "textAfterTable": "Rod Johnson is the Football Editor for VirginiaPreps.com, the #1 High School site on the Rivals.com Network.  He also co-hosts the VirginiaPreps.com Hour alongside Matthew Hatfield weekly every Saturday at 11 AM on ESPN Radio 94.1 FM in the Hampton Roads area.  Rod can be reached via e-mail at [email protected] or via Facebook. Talk about it in The Tribal Council FEATURED PRODUCT Nike Florida State Seminoles Maroon 2015 Coaches Sideline Dri-FIT Polo",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}