{
    "relation": [
        [
            "Date",
            "Sep 20, 2005",
            "Dec 14, 2010",
            "Mar 18, 2013",
            "Dec 9, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:DALLETT, NICHOLAS K.;ROBERTS, SCOTT M.;TEUTSCH, BRIAN C.;AND OTHERS;REEL/FRAME:016821/0829;SIGNING DATES FROM 20050812 TO 20050815",
            "",
            "Year of fee payment: 4",
            "Owner name: MICROSOFT TECHNOLOGY LICENSING, LLC, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MICROSOFT CORPORATION;REEL/FRAME:034543/0001 Effective date: 20141014"
        ]
    ],
    "pageTitle": "Patent US7613996 - Enabling selection of an inferred schema part - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7613996?ie=ISO-8859-1&dq=7069184",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00029-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467977731,
    "recordOffset": 467927229,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6444=Block 908 visually indicates a correlation between the indicia and a visual construct associated with the conversion problem for those indicia. FIG. 10 also illustrates this correlation. Here a user selects (here by mousing over) indicia 1006. In response, block 908 highlights the visual construct for that indicia's conversion problem (highlight shown with graphic 1012). Indicia may inform the user about the conversion problem. Indicium 1006 includes text indicating that the drawing could not be imported.}",
    "textBeforeTable": "Patent Citations The above-described systems and methods convert electronic documents, present problems in converting electronic documents, and enable alteration to schemas of electronic documents. These systems and methods may enable significantly improved conversion of electronic documents using non-visual information about the electronic documents. In so doing, these systems and methods may convert documents with fewer errors and generate converted electronic documents having greater functionality. Although the system and method has been described in language specific to structural features and/or methodological acts, it is to be understood that the system and method defined in the appended claims is not necessarily limited to the specific features or acts described. Rather, the specific features and acts are disclosed as exemplary forms of implementing the claimed system and method. CONCLUSION Block 910 presents instructions indicating one or more actions selectable by a user and capable of eliminating a conversion problem. also illustrates this correlation. Here a user selects (here by mousing over) indicia 1006. In response, block 908 highlights the visual construct for that indicia's conversion problem (highlight shown with graphic 1012). Indicia may inform the user about the conversion problem. Indicium 1006 includes text indicating that the drawing could not be imported. FIG. 10 Block 908 visually indicates a correlation between the indicia and a visual construct associated with the conversion problem for those indicia. illustrates an exemplary user interface 1000 having",
    "textAfterTable": "US4739477 Aug 30, 1984 Apr 19, 1988 International Business Machines Corp. Implicit creation of a superblock data structure US4815029 Sep 23, 1985 Mar 21, 1989 International Business Machines Corp. In-line dynamic editor for mixed object documents US4847749 Jun 13, 1986 Jul 11, 1989 International Business Machines Corporation Job interrupt at predetermined boundary for enhanced recovery US4910663 Jul 10, 1987 Mar 20, 1990 Tandem Computers Incorporated System for measuring program execution by replacing an executable instruction with interrupt causing instruction US4926476 Feb 3, 1989 May 15, 1990 Motorola, Inc. Method and apparatus for secure execution of untrusted software US4933880 Jun 15, 1988 Jun 12, 1990 International Business Machines Corp. Method for dynamically processing non-text components in compound documents US4962475 Mar 15, 1988 Oct 9, 1990 International Business Machines Corporation Method for generating a document utilizing a plurality of windows associated with different data objects US5025484 Aug 15, 1988 Jun 18, 1991",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}