{
    "relation": [
        [
            "Parameter",
            "Model Name",
            "Developed By",
            "Model Type",
            "Time Step",
            "Range",
            "Terrain",
            "Building Downwash",
            "Source Types",
            "Input Meteorology",
            "Atmospheric Stability Model",
            "Wind Field",
            "Release Types",
            "Emission Types",
            "Atmospheric Chemistry",
            "Regulatory Status"
        ],
        [
            "Description",
            "ISCST3 - Industrial Source Complex Short Term model (US EPA)",
            "United States Environmental Protection Agency (US EPA)",
            "Steady-state Gaussian plume air dispersion model",
            "1 hour",
            "Up to 50km from the source",
            "Flat and elevated",
            "Modeled by BPIP",
            "Point, area, volume, open pit, line*, flare*",
            "Hourly surface data and mixing height data (through PCRAMMET)",
            "Pasquill-Gifford Stability Classes",
            "Homogeneous",
            "Buoyant or neutrally buoyant plumes",
            "Constant or time-varying, planned or fugitive",
            "NOX to NO2 and SO2 decay",
            "Former US EPA regulatory model for near-field applications"
        ]
    ],
    "pageTitle": "AERMOD - Complete Air Dispersion Modeling Environment for the U.S. EPA AERMOD & ISC-PRIME Models, and the ISCST3 Air Quality Model - Environmental Software",
    "title": "",
    "url": "http://www.scisoftware.com/environmental_software/detailed_description.php?products_id=28",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00055-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 702769512,
    "recordOffset": 702761310,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Aermod View Features Integrated Graphical User Interface Fully integrated interface combining easy to use graphical tools (e.g., sources, buildings, and receptors), seamless model run, and automated contouring and posting of results. Powerful 3D Visualization Complete 3D visualization of your entire modeling area. Sources, buildings, and concentration and/or deposition contour results are displayed in context with the surrounding terrain. Export to Google Earthâ\u0084¢ This exciting feature allows you to export your buildings, sources, receptors and contours into Google Earth giving you a more realistic image of where your pollutants will impact surrounding areas. New Project Wizard The New Project Wizard allows you to quickly and easily set up a new project in AERMOD View. You can setup your project by specifying a reference point in Latitude/Longitude, UTM, or any other local coordinate system. AERMOD Parallel at No Extra Cost Included in the package, at no extra cost, is AERMOD MPI, Lakes Environmental parallel version of AERMOD. This will significantly cut down on model run times, while still giving the high quality results you expect from AERMOD View. Professional Printing Templates Take advantage of the ready-to-use printout template. You can include your company logo, project",
    "textAfterTable": "*Pseudo source types ISCST3 Parameter Description Model Name ISCST3 - Industrial Source Complex Short Term model (US EPA) Developed By United States Environmental Protection Agency (US EPA) Model Type Steady-state Gaussian plume air dispersion model Time Step 1 hour Range Up to 50km from the source Terrain Flat and elevated Building Downwash Modeled by BPIP Source Types Point, area, volume, open pit, line*, flare* Input Meteorology Hourly surface data and mixing height data (through PCRAMMET) Atmospheric Stability Model Pasquill-Gifford Stability Classes Wind Field Homogeneous Release Types Buoyant or neutrally buoyant plumes Emission Types Constant or time-varying, planned or fugitive Atmospheric Chemistry NOX to NO2 and SO2 decay Regulatory Status Former US EPA regulatory model for near-field applications *Pseudo source types ISC-PRIME Parameter",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}