{
    "relation": [
        [
            "Year",
            "2007",
            "2007",
            "2007",
            "2007",
            "2006",
            "2006",
            "2006",
            "2006",
            "2006",
            "2006",
            "2006",
            "2006",
            "2005",
            "2005",
            "2005",
            "2005",
            "2005",
            "Average"
        ],
        [
            "Opponent",
            "at Ole Miss",
            "Georgia",
            "Arkansas",
            "at Vanderbilt",
            "Auburn",
            "at LSU",
            "Miss. State",
            "at Tennessee",
            "Ole Miss",
            "at Florida",
            "at Arkansas",
            "Vanderbilt",
            "at Auburn",
            "LSU",
            "at Miss. State",
            "Tennessee",
            "at Ole Miss",
            ""
        ],
        [
            "Result",
            "W, 27-24",
            "L, 26-23 (OT)",
            "W, 41-38",
            "W, 24-10",
            "L, 22-15",
            "L, 28-14",
            "L, 24-16",
            "L, 16-13",
            "W, 26-23 (OT)",
            "L, 28-13",
            "L, 24-23 (OT)",
            "W, 13-10",
            "L, 28-18",
            "L, 16-13 (OT)",
            "W, 17-0",
            "W, 6-3",
            "W, 13-10",
            "Opp. 19.4, UA 19.3"
        ],
        [
            "Margin",
            "3",
            "3",
            "3",
            "14",
            "7",
            "14",
            "8",
            "3",
            "3",
            "15",
            "1",
            "3",
            "10",
            "3",
            "17",
            "3",
            "3",
            "6.35"
        ]
    ],
    "pageTitle": "Warchant.com - The Sunday Rewind: Alabama 27, Ole Miss 24",
    "title": "",
    "url": "https://floridastate.rivals.com/content.asp?CID=726498",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 862348819,
    "recordOffset": 862334217,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1933=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 Warchant.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{44815=October 14, 2007}",
    "textBeforeTable": "Alabama's penchant for playing close conference games was further galvanized Saturday in a thrilling 27-24 win over Ole Miss that came down to an overturned official ruling in the final seconds. Other than a relatively handy 24-10 win over Vanderbilt, Alabama's has nipped Arkansas by three and lost to Georgia in overtime. But it's certainly not a trend reserved for 2007. This week, we lead off the Sunday Rewind with a look at Alabama's Southeastern Conference results dating back to the 2005 Ole Miss game, and the narrow margins by which most were decided. Remarkably, SEC opponents have averaged 19.4 points per game in that stretch, while Alabama has averaged 19.3. One more nail-biter Alabama 27, Ole Miss 24: John Parker Wilson - 26 of 40, 265 yards \u0085 DJ Hall - 11 catches, 140 yards \u0085 Wallace Gilberry - 5 tackles, 3 TFLs, 2 sacks, 1 PBU. The Sunday Rewind is a weekly collection of notes and quotes from the Alabama football game of the weekend. October 14, 2007 The Sunday Rewind: Alabama 27, Ole Miss 24 Chase Goodbread TideSports.com",
    "textAfterTable": "By the numbers A look at a few numbers from Alabama's 27-24 win over Ole Miss. 7.8 Alabama RB Roy Upchurch averaged 7.8 yards per carry on five attempts Saturday, the game-high among all ball carriers. 824 With Ole Miss' 420-yard effort on offense Saturday, Alabama's defense has now allowed 824 yards over its past two games. Arkansas' 450-yard total remains the most against the Crimson Tide this year. 35.5 Return specialist Javier Arenas averaged 35.5 yards on two punt returns against the Rebels. 43.0 Although he only got two punts off on the day, punter P.J. Fitzgerald's 43.0 yard average represents his best single-game average of the season. 11 DJ Hall's 11 receptions were a season-high for the record-breaking senior. 9 Quarterback John Parker Wilson distributed completions to nine different receivers Saturday. 0 Noseguard Lorenzo Washington was shut out of the tackle column for the first time this season. Shutterbug",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}