{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "ANY KIND! That's the beautiful thing about Berkeley. You can truly be yourself here, no matter what your into, you can be you.",
            "At Berkeley you are getting the #1 public education in the world and if your low income everything is covered. I didn't have to take out any loans, since I got an outside scholarship and so it's definitely doable. It is a little pricey here for anything else though, so I recommend you do your shopping somewhere else.",
            "Berkeley is the most amazing place to live. You're so close to the city. If you don't want to go to SF there are still a million things to do here! There are always events put on by the dorms, like a movie night, or a henna tattoo night, or a hike to the big C. Really great parties, if you're into that sort of thing. A million amazing places to eat that are just in walking distance ( don't bring your car, no point at all). If you want to go exploring, you can take the bus for free to Oakland or SF or you can go get lost, that's always fun.",
            "The food is honestly good. You just get tired of it really quickly if your eating three meals a day of it. So make sure to eat at other places if you can so the cafe food can be tolerable longer.",
            "I HIGHLY recommend you live in the dorms your freshman year. You become super close with your floormates and then you do everything together. It works as a great support system during finals and it makes the college experience even better.",
            "You're never really going to be done with your work and at first it may feel like a lot, but after a while you get into the rhythm of things and you can make time for extracurricular activities and having fun. Make time to study, this is NOT high school. You can't just learn the material by reading the chapter once, you have to go back, re-read it, process it, and understand it.",
            "Cal is an amazing school and if you can imagine yourself here, it's totally possible! You don't have to have a high school GPA of a 4.5 to get into Cal. What you DO need to have would be leadership skills. You need to be involved with clubs and have a true commitment to them. Berkeley admissions wants to know that you're a well rounded person."
        ]
    ],
    "pageTitle": "University of California at Berkeley Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-at-Berkeley/reviews?_escaped_fragment_=/show/125651",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906206831,
    "recordOffset": 906005572,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{368715=It is the most expensive UC, but definitely worth it. A lot of it comes from the fact that it is in the bay area which is usually expensive to live in, but the quality of education here makes it worth it. There is a lot of financial aid available, so it is easy to come up with the money to pay for it. I'm paying about $1000 for the whole year out of pocket and it is definitely worth it, especially for being the number one public university in the world!, 698157=Holi happens every year in April on campus, it is a huge paint fight put on by the Indian Students Association. The lower plaza of campus become plastered with pink and purple. Of course don't forget the huge production of Big Game Week!!, 506096=My dream school since I was thirteen, and I through hard work I was accepted for the Spring 2013, 49183=Living 30 minutes outside of San Francisco certainly has its benefits. Fisherman's Whart, Alcatraz, Union Square, all a short BART trip away. Berkeley itself, however, can be low on the entertainment. There's a lot of places to eat, but not a lot to do. With a few hiking trails, sunny weekends can be put to good use, but considering that it rains most of the time, that option only exists for August/September., 931855=Best Cal tradition is definitely Berkeley Time. Basically, all classes start 10 minutes after the scheduled time. For example, 8 AMs don't actually begin until 8:10 (sometimes even later if you have a pretty chill professor). You could, theoretically, wake up at 8 for your 8 AM. Though I wouldn't suggest doing that for the first few days of class, especially if you don't know the campus very well., 160154=Berkeley offers a great selection of a variety of subjects -- you're sure to find something that you're interested in, and there are a lot of resources available even to people who are undecided. In fact, you're expected to take all sorts of classes! They truly want you to have a full education here, and not just march through a bunch of courses and come out with a diploma. Even in the large classes, professors are friendly and truly want you to be able to succeed., 918577=Get your SAT and GPA scores up! I scored a 2200 and am still nowhere near the top of their prospective class due to a somewhat subpar 3.85 GPA., 1066887=© 2015, Cappex.com, LLC, 83811=Compared to private school tuition, the tuition at UC Berkeley is considerably affordable for in-state students. (Out-of-state pay 3 times as much as in-state.) That being said, tuition has doubled since I started college in 2009. These tuition hikes by the UC Regents have been causing a stir at all the UC campuses. Many of my lectures have 300-500 people and I have been one of 15 or 20 regulars at a professor’s office hours (the average class size of some small liberal arts colleges). Dorm and apartment living is also pretty expensive, but I wouldn’t expect much less living in the bay area. If you are willing to pay to be taught by some of the world’s leading minds but do not necessarily care about a lot of one-on-one interaction with professors, then you won’t be disappointed.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 124 out of 125 people found this review useful. 1 of 235 Karina from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Categories Comments Great for these types of students Students who are open-minded to all different types of people, students who want a large campus atmosphere, students who aren't bothered by crazy people with portable amplifiers talking about religion or global warming, students who want to get an amazing education in an amazing place, students who want great opportunities. But no matter if you are a crazy overachiever or just a normal student, Berkeley has everything for you. Just know that if you come here, you gotta study sometimes. So it's best for the people who know how to keep a balanced schedule. You are going to want to do a lot and being organized in prioritizing things helps keep you balanced. Tips for prospective students There are so many great things to know about Berkeley that you will experience on your own, but here is just a few things: - Your professors care about you. If you are unsure about things, be sure to go to their office hours and ask questions! You will stand out AND know the material better. Also, your professors are usually bored out of their minds in office hours. They HAVE to be there and no one ever walks in for help. - Berkeley is its own culture so there are certain abbreviations and slang that you will discover around the school. Asian Ghetto, Gourmet Ghetto, CARS,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}