{
    "relation": [
        [
            "Explanation",
            "The return is the exact reverse of the outbound trip(s), 7 days after the outbound date or last trip.",
            "The return will be the exact reverse of the outbound trip starting on the 15OCT."
        ],
        [
            "Entry",
            "/M",
            "/M15OCT"
        ]
    ],
    "pageTitle": "Worldspan Agent Assistant - Power Products",
    "title": "",
    "url": "http://globallearningcenter.wspan.com/learningcenter/efg/power_products.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 102349423,
    "recordOffset": 102321912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Last Updated: October 12, 2004  EJ}",
    "TableContextTimeStampAfterTable": "{62800=May use multiple names or range of names. The 4PLIBn prompt does not appear when name select is used., 51349=>4PLIB1( ALTERNATE 1                     >4PLI*F1( 1. #DL 883 L 23JAN FR MCI ATL 800A 1050A 72S S 0 2. #DL 1236 L 30JAN FR ATL MCI 1015A 1123A 72S S 0 BASE FARE- 126.61 TAX- 19.39 TOTAL- 146.00 USD, 48962=>4PLIB1( ALTERNATE 1                    >4PLI*F1( 1. #DL 885 K 30JUL TH JFK MIA 659P 1001P M80 S 0 2. #DL 2008 K 07AUG FR MIA JFK 1235P 317P 72S S 0 BASE FARE- 205.51 TAX- 26.49 TOTAL- 232.00 USD, 97987=Boston is used as the return city. Return date defaults to 7 days after the outbound date. 1:00 p.m. is the return time., 98909=Request flights via Direct Access and the lowest fare on 29JUN from Seattle to San Antonio at 9:00 a.m.. Return on 10JUL from Dallas to Seattle at 9:00 a.m. Entry: $P12OCTEWRLAX7A/R17OCTSFO3P/R20OCTEWR10A, 51687=>4PLIB2( ALTERNATE 2                     >4PLI*F2( 1. #DL 1188 L 23JAN FR MCI ATL 930A 1216P 72S S 0 2. #DL 1236 L 30JAN FR ATL MCI 1015A 1123A 72S S 0 BASE FARE- 126.61 TAX- 19.39 TOTAL- 146.00 USD, 54373=LOWEST FARE ALREADY BOOKED FOR THIS ITINERARY 1. AA 1709 Y 30JUL TH MCI DFW 257P 436P 100 0 2. AA 853 Y 30JUL TH DFW LAS 646P 731P M80 S 0 BASE FARE- 399.08 TAX- 43.92 TOTAL- 443.00 USD, 125542=© 2002 Worldspan L.P.  All Rights Reserved., 99170=Requesting flights and the lowest fare on 12OCT from Newark to Los Angeles at 7:00 a.m. Continuing from Los Angeles to San Francisco on 17OCT at 3:00 p.m. Continuing on a third trip from San Francisco back to Newark on 10OCT at 10:00 a.m., 97721=Assumes same city pairs as the outbound. Return date defaults to 7 days after the outbound date. 9:00 a.m. is assumed as the return time., 60184=LOWER FARE FOUND - TO REBOOK   >4PLFBFNL#S1#PSRC#T15AUG( 1. #UA 1077 M 16SEP WE STL DEN 625A 743A 733 S 0 BASE FARE- 217.15 TAX- 20.54 TOTAL- 237.69 USD, 51046=LOWER FARE FOUND - TO REBOOK             >4PLFB( 1. #DL 1641 L 20JAN TU MCI ATL 600A 849A 72S S 0 2. #DL 1236 L 27JAN TU ATL MCI 1015A 1123A 72S S 0 BASE FARE- 144.95 TAX- 21.05 TOTAL- 166.00 USD, 49303=>4PLIB2( ALTERNATE 2                    >4PLI*F2( 1. #AA 99 M 30JUL TH JFK MIA 256P 605P 757 0 2. #AA 1522 M 07AUG FR MIA JFK 705A 1003A D10 S 0 BASE FARE- 205.51 TAX- 26.49 TOTAL- 232.00 USD, 98241=The return is the 17OCT from San Francisco to Boston at 1:00 p.m., 54603=>4PLIB1( ALTERNATE 1                   >4PLI*F1( 1. #DL 1893 L 30JUL TH MCI SLC 1215P 153P 72S S 0 2. #DL 1077 L 30JUL TH SLC LAS 230P 248P 72S S 0 BASE FARE- 64.22 TAX- 13.78 TOTAL- 78.00 USD, 49640=>4PLIB3( ALTERNATE 3                    >4PLI*F3( 1. #AA 1819 M 30JUL TH JFK MIA 1210P 308P AB3 L 0 2. #AA 1522 M 07AUG FR MIA JFK 705A 1003A D10 S 0 BASE FARE- 207.35 TAX- 26.65 TOTAL- 234.00 USD, 56516=The search goes forward and backward the number of hours indicated. For example, if the original flight departs at 10 a.m., entering 4PLI/W2, searches from 8:00 a.m. to 12:00 noon., 17667=Entry: KGB/841823, 55265=>4PLIB3( ALTERNATE 3                   >4PLI*F3( 1. #DL 1222 L 30JUL TH MCI SLC 655P 834P 733 S 0 2. #DL 2173 L 30JUL TH SLC LAS 1010P 1027P 763 0 BASE FARE- 64.22 TAX- 13.78 TOTAL- 78.00 USD, 98673=Request flights and the lowest fare on 12OCT from Newark to Los Angeles at 7:00 a.m. Return on 17OCT from Los Angeles to Newark at 1:00 p.m., 54935=>4PLIB2( ALTERNATE 2                   >4PLI*F2( 1. #DL 1457 L 30JUL TH MCI SLC 415P 545P 72S S 0 2. #DL 1883 L 30JUL TH SLC LAS 840P 859P 72S 0 BASE FARE- 64.22 TAX- 13.78 TOTAL- 78.00 USD, 83113=>4PLIB1 ALTERNATE 1                   >4PLI*F1 1. #CO   91 B 12OCT SU EWR LAX 800A 1115A 757 B 0 2. #CO 1480 Q 15OCT WE LAX SFO 700A  820A 733 0 3. #CO 1483 Q 22OCT WE SFO LAX 700A  815A 733 0 4. #CO   90 B 25OCT SA LAX EWR 800A  414P 757 B 0 BASE FARE- 496.36 TAX- 52.64 TOTAL- 549.00 USD}",
    "lastModified": "Tue, 12 Oct 2004 12:31:06 GMT",
    "textBeforeTable": "Click here to display a complete list of available online e-Learning courses.   Introduction Power Products consists of three products to find low fare alternatives. These products are Worldspan Power Pricing®, Worldspan Power Shopper®, and Worldspan Power Quote® (applicable to customers in IATA areas Traffic Conference 2 (TC2) and Traffic Conference 3 (TC3). Power Pricing searches for lower fare alternatives in an existing itinerary. Power Shopper performs searches without an itinerary. Each product requires different entries, but produce similar results. There is a monthly fee, per workstation for Power Products. top of page Activation and Deactivation of Power Products Power Products are activated by entries for each workstation requiring access. Power Shopper is automatically activated when Power Pricing is turned on. The terms and conditions for Power Products should be read prior to activation. These are the entries to activate Power Products. Power Products Introduction Activation and Deactivation of Power Products Billing KGB Displays Power Flight Search - Processing   Examples - SecuRate Air   Processing Power Pricing (PP) - Availability   Options   >",
    "textAfterTable": "Power Pricing remains active until the workstation is deactivated. A full month is charged for each workstation with Power Pricing access, regardless of what time of the month it is activated. The entry to deactivate Power Products is shown below. Entry Response 4PLI*DEACTIVATE TO CONFIRM DEACTIVATION      ENTER 4PLI*DEACTIVATION Then reenter the deactivation entry to remove Power Pricing capabilities. Notes about deactivation: Deactivating Power Pricing automatically deactivates Power Shopper. De-installing or disconnecting a workstation does not deactivate Power Pricing or stop the monthly billing charges. If an agency is wanting to deactivate one workstation, then activate another, billing occurs on both workstations for that month. The entries to activate and deactivate the Flex Date and the User Defined Zone options. Entry Response 4PLI*ACTIVATE/FLEX BILLABLE PRODUCT - FLEX ONE DAY PRIOR TO ACTIVATION REVIEW TERMS AND CONDITIONS LOCATED UNDER >INFO FLEX AIRPORTS( TO CONTINUE ACTIVATION ENTER 4PLI*BILLOK/YOUR NAME >4PLI*BILLOK/( 4PLI*BILLOK/XXXXXX XXXXXX is a two to ten character User Name YOU NOW HAVE FLEX DATE BILLING",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}