{
    "relation": [
        [
            "Pane",
            "Graph",
            "Session Statistics",
            "Total Statistics",
            "Station Statistics"
        ],
        [
            "Description",
            "Bar charts of current activity: Percentage of network utilization, frames per second, bytes per second, broadcasts per second, and multicasts per second.",
            "Summarizes host communication including the initiated frame type.",
            "Statistics for traffic on the entire network, captured frames, per second utilization, and network adapter card.",
            "Summarizes frames by host, type, and the total number sent and received."
        ]
    ],
    "pageTitle": "Reviewing Basic Network Traffic Concepts",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/library/cc767905(d=printer).aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890722939,
    "recordOffset": 890686852,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101512=1,1280, 94276=Specifies how frequently a backup browser contacts the master browser. The default is 720 seconds. Setting it to 1800 (30 minutes) reduces the frequency of browse list updates. Adding it as a REG_DWORD requires restarting the computer. This parameter does not effect the WAN because backup browsers always communicate with a local master browser, never with a remote one., 122547=Download file—multiple frames (up to 1514 bytes)}",
    "textBeforeTable": "Reviewing Basic Network Traffic Concepts TechNet Archive Other Microsoft Products and Technologies Windows Server Windows Azure Pack for Windows Server Windows System Center SQL Server Solutions Guidance for IT Professionals Security Guidance and Updates Scripting with Windows PowerShell Online Services Office Products",
    "textAfterTable": "Description of Microsoft Windows NT Server networking services. Explanations of how services impact network traffic. Walkthrough of client initialization traffic. Review of client-to-server network traffic. Detailed look at server-to-server traffic. Tips for optimizing service-based network communications. Warning: This chapter makes recommendations for tuning the Windows NT registry using the Registry Editor. Using the Registry Editor incorrectly can cause serious, system-wide problems that require you to reinstall Windows NT. Microsoft cannot guarantee that any problems resulting from the use of Registry Editor can be solved. Use this tool at your own risk. Top Of Page Windows NT Server and Networking Services Windows NT automatically installs various network services, some providing essential network communication and others providing optional functionality. You must configure them correctly or they can bog down the network. This section describes the Windows NT services covered in this chapter, lists different ways of characterizing them, and describes how the traffic generated by these services varies according to protocol. Windows NT networking services Service Description NetLogon Validates user account logon and synchronizes domain accounts. Also supports the establishment and maintenance of trust relationships. Computer Browser Provides browsing capabilities that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}