{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The University of NC at Greensboro is surrounded by a safe area, so that helps the campus in safety. We have many success factors to our campus safety like 24 hour security and a unanimous want for safety campus wide. Yes we have had a few problems but they have not became a constant problem.",
            "I don't know much about Greek life, but I have witnessed some probates during my term here. As expected it is pretty intense and heart warming at the same time. It seems as if it is a wonderful organization to be apart of with more heart filled joy than pain.",
            "There are many clubs students can join here at UNCG. We have the usual like sororities and fraternities then we have the unusual like the deaf and hearing peoples club (DHCC). As far as activities everything is an open invitation.",
            "This is great for all types of students because it is a way to bring everyone together without using any type of scheme or force. When a student notices that every culture and interest is sitting in this one particular spot then no one feels the need to deny the open invitation.",
            "Well there is this one hang out spot. It used to be the fountain right in the front of the cafeteria but since that is under construction it is the breeze way in the front of the EUC (student union). Every one usually just hang out there to kill time, enjoy the weather, or get some work done.",
            "The University of NC at Greensboro is safe with me mainly because I am comfortable and I notice all of my peers are too. Every student is an individual in one way or another, but no one seems to be out of place. We all, at this point of life, would like to feel excepted and UNCG has a great way of fulfilling that.",
            "During the weekends and the weekdays there are plenty of things to do for fun on campus and off. You can find a lot of activities to engage in that is dealing with your major or you can do things like play in our spades tournament, sit court side at our basketball games, join in our seasonal human versus zombies game, take it back to high school with our wacky tacky prom, etc. We also have a great deal of surrounding activities that go on around or even on campus like cancer races, or concerts.",
            "Food and Dining services are better than the average University. The institute was kind enough to provide students with over 10 restaurants to pick from. There is also a Golden Corral all you can eat buffet style cafeteria. In the cafeteria you have a vegan side then you have the normal side with endless amounts of varieties of foods from soul food to a sandwich bar.",
            "Dorm life is an amazing experience within itself. I would recommend every student to stay in a dorm at least one semester because it brings so many opportunities. You meet new awesome people, and you learn life lesson that you will never forget.",
            "When it comes to the academic rigor UNCG is well placed. We are not some ridiculously easy school neither on the same playing field as an Ivy League like Harvard, but the degrees are well earned and our professions come out labeled as one of the best. What ever it is a student gets at the University of NC at Greensboro is well earned and appreciated.",
            "The first tip I have for any upcoming students is come in with an open mind so you can take every learning experience from every class to every engagement you have dealing with the school. You should also take full advantage of all the different aspects of culture and activities that are presented. Most of all you should make your term at UNCG count so when you engage in the real world you will be established.",
            "The University of North Carolina at Greensboro is the prime definition of a melting pot. There are so many different cultures, majors, and styles of learning that can fit every student's interest. The college itself is a great experience, not only on an educational level, but a life experience level."
        ]
    ],
    "pageTitle": "The University of North Carolina at Greensboro (UNCG) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-North-Carolina-at-Greensboro/reviews?_escaped_fragment_=/show/30724",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907803983,
    "recordOffset": 907668144,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{659600=Make sure to accept your acceptance confirmation as soon as you get it back to be qualified for merit scholarships in January. Complete housing and UNCG Guarantee by beginning of May. Check out the campus and go to every event to make sure it is the right place., 30873=Compared to the tuition at Pfeiffer, UNCG costs less and they have a lot of scholarships that students can apply for. But all students considering UNCG and its scholarships should complete their FAFSA as early as possible; I suggest by March 1st. For many of their scholarships, completing your FAFSA application and an admission application is all you need to apply., 245501=During this economic distress the whole country is experiencing, it is unfortunately effecting our educational institutions. The tuition has increased more than $2,000 for the 2012-2013 year. I recommend students to apply for grants , scholarships and financial aid. Keep your GPA high so that you can qualify for more financial rewards., 526926=People for the most part are nice and will lend you anything you may need. RAs are very understanding and try not meddle within personal affairs unless it is detrimental to your life You can talk to them about anything! Please be nice to the housekeeping staff! They are so sweet and funny and do their job right everyday from August to May, 508498=Tuition at UNCG is extrememly low for how high their academic rigor is. The expenisve part is on campus living, room and board can range anywhere from $5000-12000 a year., 743043=© 2015, Cappex.com, LLC, 376311=Old dorms were just renovated and completed for living in the Fall 2012 semester. An additional suite building was recently built, in the last 2 years. We're also expanding across a main street, adding new dorm buildings, college shops, and academic buildings., 677956=I have applied and been accepted for the fall of 2014. Although there are MANY steps to follow, from applying for housing sending in transcripts and even selecting a meal plan. Throughout the way i have been able to have assistance which makes the whole process a little less stressful., 407273=Security is everywhere on UNCG's campus so you always feel safe, even walking at 12 o'clock in the morning. You cannot enter dorms without a sensor that is given to you when you move in and that sensor is specific to your dorm only so you cannot use yours on another dorm.}",
    "textBeforeTable": "06/12/2009 Reviewer is A current student here. 44 out of 47 people found this review useful. 1 of 165 Javier from High Point, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. The University of North Carolina at Greensboro Reviews The University of North Carolina at Greensboro › North Carolina › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "When you attend the University of North Carolina Greensboro, the first thing that will strike you is the beautiful campus. The second thing is the immense amount of knowledge and care the professors share with the students. UNCG is lucky to have such an amazing staff and excel in educating many fields. The Nursing, Education, and Business programs are especially strong. It is ranked in the Forbes Best 600 Universites in America. Login to rate or flag the reviews Brittany from Welcome, NC 03/31/2011 Reviewer is A current student here. 13 out of 13 people found this review useful. 3 of 165 Categories Comments Great for these types of students Any and all types of students. The diversity of people here is great. Tips for prospective students 1)If you are worried about making friends join a residential college. There are many at UNCG. FYE, Warren-Ashby, Live Learn and many more. They provide opportunties for making friends and also gives you more access to help for classes. 2)If you are having problems with your",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}