{
    "relation": [
        [
            "prefix",
            "les-",
            "ksa-",
            "ŋol-",
            "una-",
            "nos-",
            "ḍoŋ-",
            "um-",
            "bol-",
            "teḷ-",
            "gan-"
        ],
        [
            "meaning",
            "water",
            "heat, light",
            "food",
            "clothing",
            "money",
            "baby",
            "head or face",
            "hair",
            "by hand",
            "by foot"
        ],
        [
            "example",
            "leskeşgut leskuşuga",
            "ksaşodme ksaḍeske",
            "ŋolburusug",
            "unatisipe",
            "nosḍaraḍum",
            "ḍoŋuslritu!",
            "umboŋke",
            "bolbuldei",
            "teḷgenudum",
            "gantarasgut"
        ],
        [
            "",
            "she drowned I greet you (= bring you water)",
            "I’m dizzy from the heat it’s faded (= whitened by light)",
            "I’m hungry (= lack food)",
            "he tore my clothes",
            "I paid for it (= money-took it)",
            "wash the baby!",
            "I have a headache",
            "I’m going to comb my hair",
            "I made it by hand",
            "she was barefoot"
        ]
    ],
    "pageTitle": "Old Skourene",
    "title": "",
    "url": "http://zompist.com/lenani.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00076-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 841684471,
    "recordOffset": 841619184,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{128156=The numbers from 1 to 6 are unanalyzable roots; pisan ‘10’ is a variation of pasn- ‘to be a man’, and 7 to 9 and 11 are formed by subtraction— e.g. 9 = 1 [from] 10. Morg ‘12’ seems to be a contraction of mar + ḍog ‘six-two’., 204738=Aḷde-mnebiştu ḍuis mar neru greṭiḍitsai ameşodi. then-walk-travel-3s day-gen six / move-3s hut-small-gen woman-gen Then he walked the week’s journey back to the woman’s hut., 212315=Aḷde-teḷḍarḍum nilam ḷa-nirranum, aḷde-mindantu ḍuis mar neru greiḍasan; sararkum ŋriuttasan ḷa-maraspum triulla meulmsat. then-gather-3s-3sin gold / and-give-3sf-3sin / then-return-3s day-gen six / go.to-3s house-gen-his / dur-please-3s-3sin sale-his / and-dur-remember-3s-3sin touch lip-gen-pl-her Afterward he gathered up the gold she gave him, and returned the week’s journey to his own home, pleased with his trade, and still feeling the taste of her lips., 225398=By historical accident, from about 700 to 1000 Skouras was dominated by three different cities all using variations of the script of Guṭḷeli: Guṭḷeli itself, Meŋeland, and Kuḷiŋibor. This therefore became the standard script in the littoral; in Skouras proper, the Iṭilik script was the standard (to a somewhat lesser extent)., 198751=Mendu goşpa sepu greiḍasan, de-bakpu ḍus mar aḷ-aibiltum greṭiḍitsai kau-telkum saip. walk-3s far leave-3s house-gen-his / after-wander-3s day six / and-caus-find-3s hut-small-gen / topic-on.top-3sin mountain-gen He walked far from his house, and after a week’s travel he came to a small hut on a mountain peak., 216180=The imperial idea was in the air— the Jeori emperors Toma:un and Suma:un had recently conquered half of the Ezičimi states, and it was not long before Axuna would begin its march to empire. (Toma:un appears in the text in its Old Jeori form Tamon.) The Skourenes knew the Jeori well— they were longtime trading partners and rivals, and were frankly considered a little backward. Skourene ships were bigger, faster, and more powerful; Skourene armies were hardened by centuries of war. The right man in the right city could surely surpass the Jeori achievement.}",
    "lastModified": "Sun, 28 Mar 2010 10:22:17 GMT",
    "textBeforeTable": "",
    "textAfterTable": "Verb sequencing — Changing arguments Antipassive Other options Logical connectors Reported speech Comparatives Locatives — Instrumentals — Time Questions — Negatives Examples 1. Usṭişum Paurṭuti -- Lazybones’s Puzzle 2. Ṭisutrand -- The Ṭisutran 3. Agedor Skourandul -- Protector of the Skourenes Writing Lexicon Lenani-Littoral Lenani-Littoral is one of the major language families of eastern Ereláe. Originally restricted to the Lenani steppe, its speakers invaded Skouras twice, two milennia apart, generating three subfamilies. The first invasion took place around -50 Z.E., displacing the Mei peoples. The invaders gave the country its name, Skouras, and spread first to the littoral, then to the Mnau peninsula, and then across the southern sea to Gurdago. (All the letters in Skouras have their IPA values; so the first syllable rhymes with stow, not with scow or sue.) For more on the history and culture of the Skourenes, see the Historical Atlas of Skouras, or on a lighter note, the Skourene Culture Test. The second invasion was that of the Tžuro, who originally lived in the eastern half of the Lenani plateau. On fire with the new religion of Jippirasti, they invaded Skouras in the 1600s. Around 3000, the Tžuro state of",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}