{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very, Very safe.",
            "Not too big on that.",
            "There is a good choice for clubs.",
            "Great place for all students.",
            "The cost is average compared to other schools in Virginia.",
            "The university has a lot of sporting events to attend, plus concerts.",
            "The food is good.",
            "Rooms at Eagle Landing are beautiful!",
            "Great Professors!",
            "The new Eagle Landing Apartments are great, you need to room there.",
            "The University of Mary Washington is a very nice size campus. It is surrounded by lots and lots of historical past and present happenings. If you like history and visiting historical sights, this is the place for you."
        ]
    ],
    "pageTitle": "University of Mary Washington (UMW) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Mary-Washington/reviews?_escaped_fragment_=/show/73428",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00253-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892030439,
    "recordOffset": 891965099,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{204376=2005-2009 the food was eh. They were beginning to make improvements though., 8396=Although everyone wants to live in Alvey at first, due to its proximity to the gym and the fact that it has air conditioning, I would not recommend it. The rooms are actually very cold, you will wind up wearing sweatshirts in August. The dorm is isolated from the rest of campus, making it difficult to meet the rest of your class. I would recommend making Russell your first choice for dorms, it has the biggest rooms and closets, along with a lot of handy built in storage space. Try to avoid eating weekend meals at Seaco, with the exception of brunch, because the weekend food is worse than usual. The Nest is good to eat at for lunch, but the amount of food that constitutes a meal swipe there is not filling enough to be eaten for dinner. There are a lot of cheap places to eat within walking distance of the school. On campus jobs are great and extremely convenient, although not easy to come by once you are already a student due to the high amount of applicants. If you are offered a job with your admission, I advise that you take it if you think at some later point you would like to have a campus job., 1869=It has been said that Mary Washington is a boring campus with absolutely nothing to do. Not true. College is truly what you make of it. There are tons of things to do at UMW; all you have to do is look around. There are over 100 clubs and organizations on campus ranging from Photography Club to African Hand Percussion Club. There is a club or organization on campus that represents everyone’s interests. Even if UMW does not have an organization on campus that you would like, you can create it. UMW holds several dances on campus throughout the year. There is the Homecoming Dance, and the other dances are normally held be sports teams, the different dance organizations, or community service clubs. There are many places on campus to hangout. There is a place on campus called the Washroom, where everyone comes to watch television, play video games or board games, eat, study, or get on the computer. The school has just completed another area for students called The Underground, which is set to open in the fall of ’09. At the Underground, students can come and eat, hangout, and many events will be held there, such as dances, live music, etc. Cheap Seats, an organization on campus, plays movies on campus that are about to be released on DVD, usually every weekend. It only cost a dollar to go see each movie. There are many other events held on campus. Devil-Goat Day, a carnival event, and The Multicultural Fair are two major events held in April. Fredericksburg is about fifty miles between Washington D.C. and Richmond, so that provides some fun on the weekends. We are near Central Park, an area with a lot of stores, restaurants, the mall, movie theatres, an ice skating rink, and many more. Within walking distance is downtown Fredericksburg. There are antique stores, restaurants, ice-cream stores, and events that are held downtown. It’s a fun place to hangout. Also set to open in the fall is the University Café, located downtown. Students will not only come to eat there, but students will get to experience exhibits of art, literature, and music, a goal of the University Café., 7777=Those who like the small school feel will love it here. It's big enough that it doesn't feel like high school anymore, but you're able to recognize people and the teachers will get to know your name. There is not a high amount of diversity here, but if the 2009 freshman class is any indication, the rate is quickly increasing. The students here have any and all types of interests, making it very easy to connect with others., 22932=Devil/Goat day is a long-lived tradition at Mary Washington. Every year we have a huge festival with many games, lots of food, and free give-aways. The even graduation years (2012) are the Goats, and the odd graduation years (2013) are the devils. The tradition began in 1926., 298541=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/31/2009 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 58 Breon from Stafford, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Mary Washington Reviews University of Mary Washington › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here I love the people here, everyone is very open and friendly. As a freshman it was very easy to get to know people, everyone in my dorm felt like family. When walking to class you are guaranteed to see a few people that you can say hi to, although there are enough students here that every day you will see tons of new people. For a small school there are a surprising amount of things to do. There are a lot of clubs and activities to participate in, when I'm at school I never feel bored. We have several concerts and carnivals a year, which are a great way to relieve the stress of finals and to have fun! Am learning a lot There are a wide variety of classes here, meaning that there is always something appealing to take. The classes get more specific and therefore, more interesting, the higher their level. The class sizes are small enough that you can get to know a lot, or in some cases all, of your classmates, and the teacher will remember your name. The teachers here are all very enthusiastic about their topics, which makes going to class a lot easier! Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}