{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I've never had a problem while staying late for evening classes. I sometimes sleep in the library or anywhere on campus in peace.",
            "I am only in my first year, so I can't really say.",
            "Students who are looking to save money and/or planning to transfer to a uni. Those who are serious about their education and career but may not necessarily want to experience college life which includes cramped dorms, being stuck on campus if you don't have a car, etc.",
            "It is definitely cheaper than universities but still pricey if you are paying out of pocket with no financial aid, which was unfortunately my case last semester. I still owe a few hundred dollars before I can sign up for next semester's classes. Financial aid should be kicking in, though.",
            "I'm only in my first year at HCC but so far I've attended a couple of events. There are no real clubs that I know of but Houston always has something going on, especially in the museum district, which can also be educational.",
            "There are cafes on every HCC campus that I visited, along with plenty of restaurants near-by, especially in downtown Houston. After hours of studying, food availability is a must. Cafe is not gourmet or anything, but it fills you up.",
            "There are no dorms.",
            "Do research on the teachers because some are unnecessarily tough! Most are challenging enough. You will write an essay every two weeks for most, homework is given in all classes, and reading is a must. I learned a lot in my first semester and am going back this fall.",
            "Apply early if you plan on taking core classes, as they fill up fast.",
            "The Houston Community College system has campuses all over houston. The classes vary and students have a lot to choose from."
        ]
    ],
    "pageTitle": "Houston Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Houston-Community-College/reviews?_escaped_fragment_=/show/60525",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907081255,
    "recordOffset": 906952089,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{205756=no costly tuition! HCC is very affordable, the books in the book room are also very cheap. you should not expect to spend over 2000 per semester., 251142=Houston Community College has been very good for me. I started attending part-time from 1980-1983, 1993-1994, and I have returned against in 2012. I am taking online classes now and am very happy with the format and quality of delivery of online classes so far., 708021=Always register for classes on time. Join a learning group to share ideas. Don't forget to get back to your instructors if you have any problem in class. HCC instructors are very supportive in general. It's like a family learning environment. Also try to utilize the mini semester opportunity; it will help you get few of your classes out of the way. The library closes it 10:00 pm; if you are working and you get off at 5:00 pm, using the library till 10:00 pm like I do will help you a lot., 833255=The 2nd story bathroom is haunted (fyi) lol its really just a joke between me and a few girls from my EDU 1300 class but the lights do tend to flicker off and on at weird times, 867362=With its 20:1 student staff ratio each class feels like a small family. The professors are great and flexible. The class are tedious work but if you keep with it then you won't have any problems., 605102=Incredible Greek festival in October here in Houston., 459781=I, as I stated previously, was able to completely pay for my schooling here. Although, the prices were a large amount to anyone that glances, I did find them do-able, if a student were to save hard then the prices would be managable. Online courses are more expensive but towards the end I was taking 5 classes, 2 online and my price for the semester was 2500., 900084=© 2015, Cappex.com, LLC, 13940=Even though, HCC isn't the school I chose to go to, it isn't that bad. The professors will teach you one on one if you need help with something that they're teaching. They have tutoring centers to help students accomplish their work. The classes are about 1:25 student teacher ratio and the professors get personal because they know your name. The professors at HCC are caring and they will try to help you the best that they can., 836020=If you attend the Alief campus, try your best to enroll in Dr.Dino Sandifer's EDU 1300 class. Let me tell you, this class will be such a great icebreaker into the college life...you'll definitely thank me for it!, 135529=They have this tradition for every 5th of May, they have a mini fiesta outside and they provide free food!! and games. They decorate the building according to the month like Black history month, Hispanic Heritage month, and Holidays.}",
    "textBeforeTable": "01/02/2010 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 235 Isabella from Houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Walter from Houston, TX 08/05/2009 Reviewer is A current student here. 6 out of 7 people found this review useful. 3 of 235 Categories Comments Tips for prospective students If you are planning to assist to HCC please visit any HCC Campus. Check on the counselors to give you a tour, explain how schedule works, and what classes are transferable if you are planning to go university, and is really big save up. Am enjoying being here Do I enjoy? I certainly do, Theirs no way I will not enjoy. The instructors of HCC have patience of helping you out just let them know and set up an appointment with them and they sure will help you. Even though we have tutors that help you on your class subjects. Counselors are really nice to students and welling to help you. Am learning a lot Yes, I am really learning a lot, basically we as students. All it requires to pay attention when instructors gives instructions and please take",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}