{
    "relation": [
        [
            "Reasons",
            "Business process/software/web site improvements were helpful",
            "Sales/marketing assistance was helpful",
            "Identifying consultants was helpful",
            "Funding for projects was helpful",
            "Lack of funding for my projects was not helpful",
            "Delays in processing payments to consultants were not helpful"
        ],
        [
            "Count",
            "11",
            "3",
            "2",
            "1",
            "1",
            "1"
        ]
    ],
    "pageTitle": "Questionnaire for Participant Firms of the Trade Adjustment Assistance for Firms (TAAF) Program",
    "title": "",
    "url": "http://www.gao.gov/special.pubs/gao-12-935sp/results.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 453950351,
    "recordOffset": 453942149,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "1. How did you hear about the TAA program? (View question) 1. How did you learn of the Trade Adjustment Assistance for Firms program? (View question) In this section, we would like to ask about how you found out about the Trade Adjustment Assistance Center (TAAC) and about the Adjustment Proposal (AP) that you received. Outreach And TAA Center Services Received (View question) The following survey will ask you to consider your experience working with the Trade Adjustment Assistance Center (TAAC), the consultants that carried out your firm's projects, and the effect that the matching funds and assistance from the TAAC had on your firm. The questions are intended to gauge the impact that the program had on your firm, and to give participating firms an opportunity to give feedback on what is good about the program and what needs improvement. GAO will use the results of this survey to report to Congress about the effectiveness of the TAAF program. When responding, you may consult with others who are also familiar with this topic if you think it will help you give a more accurate answer. To assist you in consulting with others, you may print the survey before completing",
    "textAfterTable": "Through an online/web search 6 Colleague/Business partner/Employee 4 I was referred by the Manufacturing Extension Partnership 3 The TAA Center projects had already started when I arrived 3 Don't recall 1 2.Did the TAAC initiate contact with your firm? (View question) Yes No Don't Know, No Response Number of respondents % % % 24.8 66.7 8.5 117 3. How satisfied or dissatisfied were you with the TAAC's outreach activities? (View question)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}