{
    "relation": [
        [
            "",
            "Number of Participants Analyzed [units: participants]",
            "Part I: Percentage of Patients on Steroids at Study Start Who Reached a Steroid Dose ≤0.2 mg/kg at End of Part Ic [units: Percentage of participants] Number (95% Confidence Interval)",
            "steroid free",
            ">0 and ≤ 0.2 mg/kg/day"
        ],
        [
            "Canakinumab",
            "128",
            "",
            "32.8 (24.8 to 41.7)",
            "18.8 (12.4 to 26.6)"
        ]
    ],
    "pageTitle": "Flare Prevention Study of Canakinumab in Patients With Active Systemic Juvenile Idiopathic Arthritis (SJIA) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00889863?sect=X0125&view=results",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 854805623,
    "recordOffset": 854792068,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Period 1:   Part I: Open Label Participant Flow for 2 periods Participants in Part II received placebo matching canakinumab subcutaneous injection every 4 weeks. At 24 weeks in Part II participants with a >0.2 mg/kg and ≤0.5 mg/kg and no flare could restart steroid tapering. If the steroid dose was ≤0.2 mg/kg participants continued to maintain their current dose for the remainder of Part II. Placebo In Part I participants received open label 4 mg/kg canakinumab subcutaneous injection every 4 weeks for up to 32 weeks. For the first 8 weeks Part Ia (4 weeks) and Ib (4 weeks) patients maintained a stable oral steroid dose (prednisone or equivalent) followed by Ic an up to 20 week steroid tapering period and then Id a 4 week stable steroid dose period. Participants were then randomized to receive either 4 mg/kg canakinumab subcutaneous injection or Placebo comparator in Part II and remained on the stable oral steroid dose for 24 weeks. At 24 weeks in Part II participants with a >0.2 mg/kg and ≤ 0.5 mg/kg and no flare could restart steroid tapering. If the steroid dose was ≤ 0.2 mg/kg participants continued to maintain their current dose for the remainder of Part II. Canakinumab Description  ",
    "textAfterTable": "Entered Part Ic     92 [2]   0   Entered Part 1d     103     0   COMPLETED     100     0   NOT COMPLETED     77     0   Death                 1                 0   Adverse Event                 4                 0   Unsatisfactory therapeutic effect                 72                 0  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}