{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is great. DPS is always open, and they offer services like having someone walk you back to your dorm from a night class if it's across campus.",
            "The greek life is prevalent on campus, but I don't know a whole lot about it.",
            "They have a whole website devoted to clubs, called Stuey. There are literally 100s of different clubs or organizations you can join!",
            "For in-state, it's not that bad, and they do a lot to help with financial aid!",
            "There isn't a whole lot to do in Allendale, but it is a very short commute to downtown Grand Rapids! There's always something fun going on in GR; it's full of shops, venues, museums, bars, clubs, restaurants etc.",
            "There are SO many food options on campus, and some stores are open 24hours. You can use dining dollars almost anywhere.",
            "Dorm life was all right. I chose to do a two-bedroom apartment style, and I wish I would have went a more traditional route..or at least went in blind.",
            "I'm only a Junior, so the classes haven't been terrible hard. With a little effort you can get decent grades in almost everything. I'm just starting to get into the hard classes though!",
            "Definitely do your registration early! The later you wait in the summer to go for orientation, the harder it is to get into classes that you'll need/want.",
            "Grand Valley has some pretty awesome academic programs, and the sports are top notch. The social life, however, is pretty non-existent. You have to find your own things to do."
        ]
    ],
    "pageTitle": "Grand Valley State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Grand-Valley-State-University/reviews?_escaped_fragment_=/show/85474",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903641587,
    "recordOffset": 903475770,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{867161=We are ranked one of the worlds top safest colleges of 2014. The crime that is committed is mainly theft., 159849=1. as a freshmen you will have to have at least a 14 meal pass. definately worth it, especially if you don't have a kitchen in your room. i will be a sophomore in fall of 2012 and still plan to have a pass for 5 meals a week. 2. great food and lots of variety. 3. flex dollars to spend anywhere are great!, 81402=grand valley has a women's chocolate party every january. we have a presidents ball to get dressed up and dance to. we have a ravine where you can go hiking and hang out by the grand river. this also offers enormous hills and we go trekking through them all times of the year and have scavenger hunts., 875806=Grand Valley has some excellent faculty, and be sure to take advantage of resources like office hours and the math lab. Campus can be hectic at times, and parking can be a hassle, but overall I am definitely satisfied with my choice to transfer to GVSU. I will be graduating in 2016, and may look into grad school with GVSU also., 443389=I feel very safe at Grand Valley, even at night when my night classes are done at 9:30. Grand Valley is a safe environment (probably because it is out in the middle of no where)., 425071=Compared to other public universities I feel happy for the quality per dollar. But it still is expensive, for a lower division/undergraduate course it is $412/credit. So a three credit trigonometry course is $1236., 629886=Grand Valley is a very clean, well organized college. It has everything I expected. From great academics, to a brand new library in 2013, and great dining and housing, Grand Valley is a one of a kind college that adds great ratings to Michigan Colleges., 952493=There are many options for dining on campus, and the food is of pretty good quality for college. And as of the 2014-2015 academic year, the university is continuing to add dining options to the campus., 161581=1. make an appointment and definately visit the campus .. you will love it and be prepared to be impressed! 2. apply before december 31 of each school year so that if your act score is 26+ you are eligible for a $1500 scholarship that will be renewed each year for up to four years! sad but true, if you miss the deadline they will not award it to you...even if you apply january 1. 3. some of the dorms are much newer, but i'm in the old jail cell style ... they were made the way they are so that if the college failed they could be used as a jail. they may be small, but you really get to know people because you hang out in the lounge together. i was encouraged to apply for these dorms by previous gvsu students and now i understand why!, 938166=Early in September GV holds Campus Life Night, which is like Pitch Perfect on steroids! This night is all about the different clubs and organizations that are offered on campus, ranging from sports, a cappella singing, Greek life, to belly dancing. Each group has a booth set up for students to gather information on what they might be interested in., 166054=i am an african american student of the sciences. i will be graduating may 2013 with an analytical chemistry bachelors in science and certification in green chemistry. this experience is a promising one for science students who want some of the best teachers who are involved with you on a one to one type of setting. you have no other option but to excel academically, in research, and planing on post graduation. hang in there and you will not graduate and be unemployed., 753861=I would be sure to take a tour. Within my first year I heard a lot of complaints about the campus because it wasn't what people were looking for. Just Like anything else you do in life you really want to make sure you feel comfortable walking around and making this campus your home. During my tour in February of 2012, I had never felt better walking around the campus. I knew it was for me., 878812=There are a lot of different food options for Campus dining. There are some dining areas that are better than others, and you definitely have to change up what you eat or else you will get sick of the same thing all the time. They even have different options for special diets. I am a vegetarian and I never have a problem getting a sufficient meal, and every monday at Fresh Food Company, they have Meatless Mondays as well as having gluten free options every day. Fresh Food Company and The Connection both have different options different days of the week, but most of the other dining areas always have the same thing, but they have plenty of options. There is also a variety of coffee shop type of areas, such as Java City, Einstein's Bagels, and even a Starbucks on the downtown campus, and coming to Allendale Campus in Fall of 2015, as well as a Qdoba coming to the Allendale campus in Fall of 2014. There is a wide range of food selections from pizza, to mexican, to italian, to salad. Most things you would or could want you can find in Campus dining with all the selections available to students., 956822=© 2015, Cappex.com, LLC, 951923=The main campus of Grand Valley is located close to downtown Grand Rapids, a bustling and vibrant city with a thriving arts culture. There are great restaurants, good shopping, and events of all natures, including the city-wide art festival ArtPrize during August and September.}",
    "textBeforeTable": "07/29/2009 Reviewer is A current student here. 45 out of 46 people found this review useful. 1 of 219 Alie from Michigan Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am enjoying being here It was really easy to make friends at Grand Valley. Because of the large number of students, there is many different types of people. This with good food and lots of things to do make it a great place to be. Am learning a lot Although there are a lot of students at Grand Valley, they try to keep the class sizes small for a better learning environment. They also offer free tutoring if you need it, and professors are usually readily available for help if you need it. Login to rate or flag the reviews Lauren from midlothian, IL 08/07/2009 Reviewer is A current student here. 15 out of 15 people found this review useful. 3 of 219 Categories Comments Tips for prospective students Get involved! Between clubs, sports (including intramurals!), events (even dances like the President's Ball!), and a really nice rec-center, there is absolutely no excuse not to get involved. Use the free",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}