{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Every weekend they have something going on. The have trips, adventures and daily dorm activities. I'd say that the biggest on campus activity is Relay for Life.",
            "They have a plentiful plan for dinning at Carrol. If you don't like what they have you can always try some where else. The campus is located near many local restaurants.",
            "The dorms at Carroll are plentiful bigger than an average dorm you'd see on campus today. However there are some dorms on campus that the heater is too loud, or the rooms are really small. The chances of getting into those dorms are slim.",
            "They have excellent teachers at Carroll. If you are someone who might need a little extra help then this would be a school to go to. If the teachers do not help there are higher authority's that will help you.",
            "Carroll Will help you if you are shy to any extend. It will really push your boundaries. Also Waukesha is a small town, so there really is nothing to fear.",
            "Carroll has been a great place to start out in. You really have a lot of opportunities to get out there and explore the world. Carroll is a very sociable place."
        ]
    ],
    "pageTitle": "Carroll University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Carroll-University/reviews?_escaped_fragment_=/show/27479",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894165327,
    "recordOffset": 894099355,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130713=Carroll is the oldest college in the state of Wisconsin. It was established in 1849. The one unusual thing on campus I know of is that there is a haunted building called MacAllister on campus where the professors have their offices. Supposedly a young girl by the name of Lydia Morgan hung herself in the attic of the house. It is said that apparitions have been seen in the house., 302853=© 2015, Cappex.com, LLC, 57872=Carroll University was the first college built in Wisconsin founded by Charles Carroll, an original signer of the Declaration of Independence, in 1846. The campus has a few mysterious locations such as the secret trail that runs from the football field all the way across to the opposite side of campus, the Hartwell Apartments (I found it when I went for a jog!). Main hall has wood from the old building that burnt down built into its walls. There are also many stairwells that provide access to every floor. Maxon Hall's roof can be accessed through a utility closet. Even at good ole Carroll, there are some odd traditions. In MDR there are trays provided, but no one ever uses them. Carroll has a grandmother named Gert who has been here for 50 years (we celebrated with cake at the homecoming football game) and always welcomes prospective students with a huge smile, compliments you, and wishes you a good day. Thanksgiving and Christmas dinner are a big deal at Carroll. Head chef Moe prepares enormous turkeys and hams, homemade mashed potatoes and gravy, green bean casseroles, buns and rolls, pies, cheesecake, and cupcakes. Be prepared to start lining up around 3pm because MDR will be absolutely PACKED by dinner time! Many students hail from Illinois and Minnesota so expect to take part in rowdy rivalries when the Packers play the Bears or Vikings (being a born and raised diehard cheesehead combined with the Packers always destroying, bragging rights are a given). Being that Carroll resides in the frozen tundra, hockey games are huge. The Chicago Blackhawks are watched in the lounges on the flat screens. The day of and/or following day, students will be sporting their Blackhawks jerseys (I know I sport Hossa the day after a win!). My friend family also supports the San Jose Sharks because his brother is now the new signed goal tender, congratulations Troy Grosenick!, 266872=I find the dorms enjoyable to live in. Although I am currently living in a residence hall with no air conditioning, fans will help cool it down as much as possible during those hot days in September. The rooms are a good size, and the furniture can be changed around in to many different, creative ways.}",
    "textBeforeTable": "10/14/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 60 Erin from Appleton, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. Carroll University Reviews Carroll University › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Jesse from New Berlin, WI 02/21/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 60 Categories Comments Great for these types of students Students who like a smaller campus, students who occasionally like to party but are more reserved, students who want to have fun while getting a great education. Tips for prospective students Scholarships! Carroll is very generous with giving out scholarships but I cannot stress enough the importance of applying for outside scholarships to get as much of it paid for as you can. The less loans you have to take the better! Bang for the buck It is expensive! But the education you receive and everything that you end up paying for is worth it! Am enjoying being here The campus size is fairly small for a college. Being only about 3200 people, it becomes it's own community. Everyone is so genuine and nice here and they definitely",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}