{
    "relation": [
        [
            "Responder",
            "Roberto Scano",
            "Alessandro Miele",
            "Jan Richards",
            "Greg Pisocky",
            "Jeanne F Spellman",
            "Frederick Boland",
            "Sueann Nichols"
        ],
        [
            "B.4.2.3 tests",
            "Accept the proposal",
            "Accept the proposal",
            "Accept the proposal",
            "The proposal needs more discussion (see comments field)",
            "Accept the proposal",
            "Accept the proposal",
            "Accept the proposal"
        ],
        [
            "Comments on B.4.2.3",
            "",
            "",
            "TYPO: - tutorials is-->tutorials are - \" ,\"",
            "Does the tool have to point directly to an accessibility tutorial, or is it sufficient to point to the location where tutorials for the product exist and in that location provide tutorials on accessibility as well as other features of the document?",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Results of Questionnaire AUWG Survey for 7 January 2013 - part 4 (B.3 - B.4) - Web-Based Straw-poll and Balloting System",
    "title": "",
    "url": "https://www.w3.org/2002/09/wbs/35520/20130107-3/results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 942106798,
    "recordOffset": 942090840,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{12259=This questionnaire was open from 2013-01-03 to 2013-03-29., 1456=Test0006 Author: Jan, 6471=Test0003 Author: Jan, 4750=Test0004 Author: Jan, 3101=Test0005 Author: Jan, 10067=Test0001 Author: Jan, 8267=Test0002 Author: Jan}",
    "TableContextTimeStampAfterTable": "{40328=Test 0001 Assertion: Content support features are as prominent as features related to either invalid markup, syntax errors, spelling errors or grammar errors., 40093=B.4.1.4 Feature Prominence: All accessible content support features are at least as prominent as features related to either invalid markup, syntax errors, spelling errors or grammar errors. (Level AA)}",
    "lastModified": "Wed, 29 Jul 2015 10:34:11 GMT",
    "textBeforeTable": "Details Neutral - will accept the consensus of the group Disagree with the proposal (see comments field) The proposal needs more discussion (see comments field) Recommend changes (see comments field) 7 Accept the proposal Results All responders Choice Summary If the checker is able to cause all of the accessibility problems to be detected (automatically, semi-automatically, manually or a combination), then select PASS. Otherwise, select FAIL. Run the checker (if the checker is manual, this will entail following ALL checking instructions). If accessibility problems have been added to the content, search the user interface (and documentation) for accessibility checking functionality (which can be automated, semi-automated, manual instructions or a combination). If checking functionality is not present, then select FAIL. Using non-accessible test content file (Level AAA) as a guide, attempt to create accessibility problems using the authoring tool. If this is not possible due to authoring restrictions (such as highly limited editing scope or compulsory fields), then select SKIP. If the authoring tool allows allow authors to open/paste-in pre-existing content, select SKIP. Test0006 Author: Jan Test 0006 Assertion: Checking assistance (WCAG Level AAA) is present in more-restrictive authoring tools. (Note: Only",
    "textAfterTable": "2. B.3.1.2 tests Success Criteria B.3.1.2 Help Authors Decide: If the authoring tool provides checks that require authors to decide whether a potential web content accessibility problem (WCAG) is correctly identified (i.e., manual checking and semi-automated checking), then instructions are provided from the check that describe how to decide. (Level A) Test(s) Test 0001 Assertion: Checking assistance (WCAG Level A) includes help to decide whether potential issues are actual issues, if user judgement is required. Test0001 Author: Jan Examine the checking functionality identified in the WCAG Level A-related tests for B.3.1.1. If no checking functionality exists, then select SKIP. If the checker automatically identifies all of the issues, the select SKIP. If the checker relies on the author to verify any found issues (as semi-automatic checks do) or find issues (as manual instructions do), then check whether support of some kind (e.g. instructions) is provided in each case to help the user make the required decision. If such support is always provided, then select PASS, otherwise select FAIL. Test 0002 Assertion: Checking assistance (WCAG Level AA) includes help to decide whether potential issues are actual issues, if user judgement is required. (Note: Only shown if the user has specified AA or AAA as the target level) Test0002 Author: Jan Examine the checking functionality identified in the WCAG Level AA-related tests for B.3.1.1. If no checking functionality exists, then",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}