{
    "relation": [
        [
            "Code",
            "2",
            "3",
            "4",
            "6",
            "7",
            "8",
            "9",
            "0",
            "0"
        ],
        [
            "Color - Non-Locking",
            "Red",
            "Gray",
            "None",
            "Blue",
            "Orange",
            "White",
            "Brown",
            "Yellow",
            "Black"
        ],
        [
            "Color - Locking",
            "Red & Green",
            "Gray & Green",
            "None",
            "Blue & Green",
            "Orange & Green",
            "White & Green",
            "Brown & Green",
            "Yellow & Green",
            "Black & Green"
        ],
        [
            "Ratio",
            "43-16 = 2.69",
            "41-16 = 2.56",
            "19-10 = 3.90",
            "40-11 = 3.64",
            "43-15 = 2.87",
            "41-12 = 3.42",
            "42-13 = 3.23",
            "40-13 = 3.08",
            "41-10 = 4.10"
        ]
    ],
    "pageTitle": "1961 PONTIAC CATALINA Information Specifications Resources Pictures",
    "title": "",
    "url": "http://www.oldride.com/library/1961_pontiac_catalina.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 629813747,
    "recordOffset": 629801032,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{615=1961 Pontiac Options included: Air-Conditioning - Electric Antenna - Guide Matic Headlamp Control - Power Steering - Power Brakes - Six Way Power Seat - Power Windows - Safeguard Speedometer - Magic Cruise - Aluminum Hubs & Drums - Bucket Seats - EZ Eye Glass - Luggage Carrier - Power Tailgate - 4 Speed Super HydraMatic - 4 Speed Manual - SafeT Track Differential - 4 Barrel Induction System - Tri Power Induction System, 1127=The 1961 Catalina received downsizing along with other makes. The new perimeter frame was what helped Pontiac cut size and weight. Some of the major differences were the return to the twin grille styling theme, sculptured side panels, taller rooflines and horizontal-oval tail lights. Catalinas also came with small tailfins, small hubcaps. Base equipment included turn signals, cigarette lighter, electric windshield wipers, oil filter, sun visors, and five tubeless black sidewall tires}",
    "textBeforeTable": "1961 Pontiac Catalina Specification and Production Numbers   1961 Pontiac Options included: Air-Conditioning - Electric Antenna - Guide Matic Headlamp Control - Power Steering - Power Brakes - Six Way Power Seat - Power Windows - Safeguard Speedometer - Magic Cruise - Aluminum Hubs & Drums - Bucket Seats - EZ Eye Glass - Luggage Carrier - Power Tailgate - 4 Speed Super HydraMatic - 4 Speed Manual - SafeT Track Differential - 4 Barrel Induction System - Tri Power Induction System The 1961 Catalina received downsizing along with other makes. The new perimeter frame was what helped Pontiac cut size and weight. Some of the major differences were the return to the twin grille styling theme, sculptured side panels, taller rooflines and horizontal-oval tail lights. Catalinas also came with small tailfins, small hubcaps. Base equipment included turn signals, cigarette lighter, electric windshield wipers, oil filter, sun visors, and five tubeless black sidewall tires 1961 Pontiac Catalina document.write(''); if(typeof(tile) == \"undefined\"){var tile = 1} else {tile++} if(typeof(dcopt) == \"undefined\"){var dcopt = \"dcopt=ist;\"} else {var dcopt = \"\"} if(typeof(cachebuster) == \"undefined\"){var cachebuster = Math.floor(Math.random()*10000000000)}",
    "textAfterTable": "35 4d Station Wagon - 6P $3,099 4,135 lbs 12,595 NOTES: 113,354 Catalinas Were Built 6,337 had Synchromesh 107,017 had Hydra-Matic Models Series Identification 2369 - 4d Sedan - 6P 2367 - 2d Convertible - 5P 2339 - 4d Vista Hardtop - 6P 2345 - 4d Station Wagon - 9P 2311 - 2d Sport Sedan - 6P 2335 - 4d Station Wagon - 6P 2337 - 2d Hardtop - 6P   Chassis Data Model Wheelbase Overall Length Width Front Tread Rear Tread Tires Catalina 119 in 210 in 78.2 in 62.5 in 62.5 in 8.00 x 14 Catalina Station Wagon 119 in 209.7 in 78.2 in 62.5 in 62.5 in 8.50 x 14   VIN Decoding Vin Number was on the left front door hinge pillar. On",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}