{
    "relation": [
        [
            "Side & Creature",
            "#1: Human male",
            "#2: Human male"
        ],
        [
            "Number",
            "12",
            "12"
        ],
        [
            "Skills",
            "-no skills-",
            "-no skills-"
        ],
        [
            "Items",
            "Silver mace",
            "Silver warhammer"
        ]
    ],
    "pageTitle": "Military testing - Dwarf Fortress Wiki",
    "title": "",
    "url": "http://dwarffortresswiki.org/index.php/Military_testing",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75175535,
    "recordOffset": 75153111,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11340=Notes: I did this test to see if dwarves can survive horses if they've got full iron armor and weapons. The fight was short and it looks like the skeletal horses charge hard and if they hit, they stun and can kill pretty fast if they're not stopped. I tried it 6:3 because I didn't expect the dwarves to survive a 1:1 ratio against the horses anyway. And yes the amount of trials is pathetic :P}",
    "lastModified": "Thu, 30 Jul 2015 04:12:50 GMT",
    "textBeforeTable": "Initial setup: Times run: 1 Here's an example of how to present your test's information. If you're not sure how to make tables and stuff, just copy this from the edit page and fill it with your own information. [edit] Standard format for testing trials 6.3 MASTER-UNARMED vs. Wooden maces + MASTER-UNARMED vs. 2 Cave spiders 6.2 Sword vs. Axe, with leather armor (Tested by: Gitaxias) 6.1 Sword vs. Axe, with iron armor (Tested by: Gitaxias) 6 DF 2014 (v0.40.24) Tests 5.4 Sword vs Axe (tested by: Terranaunt) 5.3 Axe vs. Spear (3) 5.2 Axe vs. Spear (2) 5.1 Axe vs. Spear 5 DF2012 (0.34.11) tests 4.3 Steel vs. Wooden Shield (tested by: apostle602) 4.2 3 v 1 Mail Shirts (tested by: Waladil) 4.1 Iron Spears VS Iron Warhammers (tested by: Naryar) 4 DF2012 (0.34.04) tests 3.2 Single Unarmoured/Untrained Dwarf Weapon Test (tested by: RokRokRok)",
    "textAfterTable": "#3: Tea cup 6 Legendary Absurdist Mustard Results: Side & Creature Survived Injury level Health tags Most common cause of death #1: Dwarves 0 Severed limbs Bruised internal organs Tired Bored Extreme Pain Infection #2: Corinthian Magma Weasel 3 Broken nose Broken toes Nauseous Severed head #3: Tea cup 1 Cracked handle -none- Slippage Notes: The creatures were placed in tight groups, spaced equally apart. The dwarves died fast from injuries caused by the tea cups the magma weasels were throwing. The weasels died from friendly fire. Tester's conclusion: The test was meant to test how 3 different sides interact in combat and if any creature uses other creatures as projectiles. As far as this test goes, it seems to be true. [edit] DF2010 (0.31.16) tests [edit] Dwarves against Skeletal Horses (tested by: plynxis) Times run: 2 Initial setup: Side & Creature Number Skills",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}