{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Dragons' Den",
            "World News Australia",
            "Covert Affairs",
            "Survivor: Philippines",
            "Go Girls"
        ],
        [
            "Time",
            "10:45 pm - 12:16 am",
            "10:30 pm - 11:05 pm",
            "9:30 pm - 11:30 pm",
            "10:30 pm - 11:30 pm",
            "10:30 pm - 11:30 pm"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/pm/2012/12/18/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 704152755,
    "recordOffset": 704079509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5484=MICHAEL PASCOE While ANZ economists predict 100 basis points of cash rate cuts in 2013, there's little in the Reserve Bank board minutes to support that view., 61437=LEE GASKIN ACT Brumbies scrumhalf Nic White needed surgery on a fractured jaw after he was king-hit at the Foreshore music festival on November 24., 18708=The bloody battle of the infamous SS Sixth Panzer Army tank force in 1944., 86525=In first for NSW, Sydney Grammar pupil tops state in French, German and Italian in HSC., 24246=Students who have come first in their subjects in the 2012 Higher School Certificate share their relief, study tips and dreams for life after school. (02:16), 55859=STEPHANIE GARDINER Carla Maria Ruggeri, 30, from Putney, was 22 when she allegedly had sexual intercourse with a 17-year-old year 12 male student in 2005.}",
    "TableContextTimeStampAfterTable": "{122895=January 25 - February 24 Fringe World will venture beyond the CBD., 248198=RocketScientist, Dec 18, 2012, 10:17PM, 239595=Total votes: 12835., 123990=January 1 Club Paradiso is returning to North Fremantle's shore., 125888=January 1 Attendees from last year will be elated to hear that Marquee is back for New Year's day in 2013., 124937=January 1 Gents don your printed slacks and ladies slip on some floral peplum., 249135=Luisa L, Dec 18, 2012, 9:38PM, 261245=December 17 2012}",
    "textBeforeTable": "12am 11:30pm 11pm 10:30pm 10pm 9:30pm Skip to: This second season of the innovative comedy is even darker than the first. This doesn't mean, of course, that it's not funny. Louie What's on TV Tonight We reveal who is most likely to make headlines next year. Who'll make news in 2013 Making news Some of the city's best mind share their expertise. Brisbane's best advice Good advice 7 Let's just accept Friday's impending Mayan apocalypse. Things to do before Doomsday Beat the Reaper This article contains a video",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD My Family 10:03 pm - 10:33 pm SBS ONE Queensland Forensics On Trial 9:30 pm - 10:30 pm Channel Seven Brisbane Covert Affairs 9:30 pm - 11:30 pm Channel Nine Brisbane Two and a Half Men 10 pm - 10:30 pm Network TEN Brisbane NCIS: Los Angeles 9:30 pm - 10:30 pm Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Dragons' Den 10:45 pm - 12:16 am SBS ONE Queensland World News Australia 10:30 pm - 11:05 pm Channel Seven Brisbane Covert Affairs 9:30 pm - 11:30 pm Channel Nine Brisbane",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}