{
    "relation": [
        [
            "Patent application number",
            "20110233875",
            "20130093181"
        ],
        [
            "Description",
            "Exhaust manifold gasket with spring steel embossed metal and graphite insulator - The present invention relates to an exhaust manifold gasket having a metallic core, at least one insulating layer, and an embossed layer. The metallic core has two sides with at least one side having a plurality of projections. The insulating layer has two sides, with the first side contacting the projections of the metallic core and the second side contacting the embossed layer. The embossed layer is a metallic flange having a lower leg, a convex face, and an upper leg.",
            "Stacked Washer Slip Joint Seal - Slip joint having a stacked washer seal, a male part and a female part. The female part has a small and a large inner diameter. The male part has substantially constant inner and outer diameters and a ring on the outer diameter. A gap is located between the male and female part. At least two washers and a flat shim are located in the gap. Each washer and flat shim has a first side, a second side, a first end and a second end. The first side of a first washer abuts an end of the male part. A second side of the washer contacts a first side of a flat shim. The second side of the shim contacts the first side of a second washer. The second side of the second washer contacts a first side of a second flat shim or an end of the female part."
        ],
        [
            "Published",
            "09-29-2011",
            "04-18-2013"
        ]
    ],
    "pageTitle": "Shaver, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/shaver-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435031235,
    "recordOffset": 434996223,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kevin Shaver, Chicago, IL US //]]> BarDraw('3957883',['Patent applications by Joseph B. Shaver, Rochester, NY US'],[[1,2,1]],['2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3957883\" align=\"center\"></div> </div> <canvas id=\"bg3957883\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Joseph B. Shaver, Rochester, NY US</p> <div class=\"bar3957883\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-08-2014</td> <td><a href=\"/patents/app/20140126621\">COMMUNICATIONS RECEIVER WITH CHANNEL IDENTIFICATION USING A-PRIORI GENERATED GAIN VECTORS AND ASSOCIATED METHODS</a> - A communications receiver includes an antenna, and a burst signal acquisition circuit coupled to the antenna to detect a burst signal received over a wireless communications channel. The burst signal has a burst structure that includes channel-corrupted known preamble bits, channel-corrupted known probe bits and channel-corrupted unknown data bits. A channel estimator is coupled to the burst signal acquisition circuit to generate a-priori a gain vector based on uncorrupted known probe bits, and to perform a recursive least squares (RLS) operation to determine an impulse response of the wireless communications channel based on the channel-corrupted known probe bits and the gain vector. A maximum likelihood sequence estimator (MLSE) or equalizer is coupled to the channel estimator and the burst signal acquisition circuit.</td> <td>20140126621</td> <tr> </tr> <td>02-21-2013</td> <td><a href=\"/patents/app/20130044655\">WIRELESS COMMUNICATIONS DEVICE WITH MULTIPLE TRELLIS DECODERS AND RELATED METHODS</a> - A wireless communications device includes a receiver, and a decoder coupled downstream from the receiver. The decoder is configured to alternatively decode a first signal using a first trellis state transition map including first valid transitions, the",
    "textAfterTable": "Kevin T. Shaver, Chicago, IL US Patent application number Description Published 20150204271 GASKET ASSEMBLY - A gasket assembly has a middle layer located between an upper layer and a lower layer. The middle layer includes spacer portions that at least partially surround a gap. The gap, the spacer portions and the layers may have insulating and/or conducting portions as needed. 07-23-2015 Linnea J. Shaver, Maineville, OH US Patent application number Description Published 20080294132 Cellulosic fiber compositions having odor control and methods of making and using the same - The present invention relates to compositions containing stabilized and/or activated urease inhibitors, as well as methods of making and using the same. 11-27-2008 20140349835 COMPOSITIONS AND PARTICLES CONTAINING CELLULOSIC FIBERS AND STABILIZED-AND/OR ACTIVATED-UREASE INHIBITORS, AS WELL AS METHODS OF MAKING AND USING THE SAME - The present invention relates to compositions containing stabilized and/or activated urease inhibitors, as well methods of making and using the same. 11-27-2014 Matthew Shaver, Fremont, CA US Patent application number Description Published 20150193833 Platform Independent System for Context-Related Advertisement Delivery and Display - A video display apparatus including a processor, non-volatile memory coupled to the processor storing binary code segments, an Internet interface coupled to the processor, and a video display coupled to the processor capable of displaying an advertisement received via the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}