{
    "relation": [
        [
            "Ref. CTR",
            "07061903",
            "07062187",
            "07061864",
            "07061866",
            "07061868",
            "07061277",
            "07061279",
            "07061280",
            "07061535",
            "07060774",
            "07060775",
            "07060776",
            "07060777",
            "07060779"
        ],
        [
            "Ref. OEM",
            "NROLI1453FCZ1",
            "NROLI182FCZZ",
            "NROLR0113QSZZ",
            "AR-505HR",
            "NROLI1314FCZZ",
            "NROLR0031QSZZ",
            "NROLI1206FCZZ",
            "NROLI1286FCZZ",
            "NROLI1103FCZZ",
            "NROLT583FCZZ",
            "NROLT1075FCZZ",
            "SD-360LH",
            "NROLT0779FCZZ",
            "NROLR0028QSZZ"
        ],
        [
            "Producto",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR ARM 620 ARM 550/620/700",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR MXM 283 MX-M 283/363/453/503",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR ARM 277 ARM 236/237/276/277",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR AR 507 AR 287/337/407/505/507",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR ARM 208 ARM 280/350/450",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR AR 161 AR 161",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR AR 280 AR 230/250/251/280/281/285/330",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR AR 507 AR 287/337/407/501/507",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR SF 2025/2030/2040",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR SF 2022 2022/7900",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR SF 2050 2050/2052",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR SF 2060 2060/2260/3062",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR SF 2075/3075",
            "COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR AL 1000 AL 1000/1020/1041/1530/1551/1631/2030/2040/2050"
        ]
    ],
    "pageTitle": "Refacciones para copiadoras e impresoras SHARP",
    "title": "",
    "url": "http://www.tonerparacopiadoras.com.mx/productos/refacciones-sharp.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 768776225,
    "recordOffset": 768760277,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{92826=Copyright © 2010 Toner para Copiadoras.Com.Mx All Rights Reserved., 56323=Ref. CTRRef. OEMProducto07040735RLMPU0532FCZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 1000 W SF 2014 2014/211407040737RLMPU0487FCZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 900 W SF 2022 2022/202707040738RLMPU0514FCZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 950 W SF 2035/204007040739RLMPU0498FCZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 1100 W SF 2060 2060/306207040740RLMPU0506FC21COPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 700 W SF 2060 2060/306207040744RLMPU0352FCZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 900 W SF 7300 7300/735007040745RLMPU0010QSZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 800 W AL 1000 AL 1000/1020/1041/1530/1551/1631/2030/2040/205007041481RLMPU0365FCZZCOPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 900W SF 9700 SF 7900/8300/8350/8400/8500}",
    "lastModified": "Tue, 04 Aug 2015 09:39:23 GMT",
    "textBeforeTable": "REVELADOR COPIADORAS SHARP OTRAS PARTES BUJE RODILLO SUPERIOR AL 1000 AL 1000/1020/1041/1530/1551/1631/2030/2040/2050 NBRGP0567FCZ 07341599 COPIADORAS SHARP OTRAS PARTES UÑAS SEPARACION SUP AL 1000 AL 1000/1020/1041/1530/1551/1631/2030/2040/2050 CTME0229FC03 07341352 Producto Ref. OEM Ref. CTR OTRAS PARTES COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 250 SF 7300 7300/7350 RLMPU0359FCZZ 07030734 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 275 SF 2116 2116/2118 N/P/N 07030733 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 170V 400 SF 2075 2075/3075 RLMPU0474FCZZ 07030732 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 220 W SF 2060/3062 RLMPU0519FCZZ 07030731 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 250 SF 2050 2050 RLMPU0564FCZZ 07030730 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 275 SF 2022 2022/2027 RLMPU0494FCZZ 07030729 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 285 W SF 2014/2114 RLMPU0536FCZZ 07030728 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION 85V 260W SF 9500 9500/9800 N/A 07031540 COPIADORAS SHARP LAMPARA DE EXPOSICIÓN LAMPARA DE EXPOSICION SF 8500 8100/8500/8570/8800 RLMPU0321FCZZ 07031539 Producto Ref. OEM Ref. CTR LAMPARA DE EXPOSICIÓN COPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 900W SF 9700 SF 7900/8300/8350/8400/8500 RLMPU0365FCZZ 07041481 COPIADORAS SHARP LAMPARA DE CALOR LAMPARA DE CALOR 120V 800 W AL 1000",
    "textAfterTable": "07080759 SD-365MD COPIADORAS SHARP REVELADOR REVELADOR SF 2260 RODILLO DE LIMPIEZA DEL FUSOR Ref. CTR Ref. OEM Producto 07221411 SF 250 RL COPIADORAS SHARP RODILLO DE LIMPIEZA DEL FUSOR RODILLO DE LIMPIEZA DEL RODILLO INFERIOR SF 2050/2052 07221300 CROLN0935FC33 COPIADORAS SHARP RODILLO DE LIMPIEZA DEL FUSOR RODILLO SUMINISTRADOR ACEITE SF 2025 2025/2030/2040 07221301 CROLN1016FC23 COPIADORAS SHARP RODILLO DE LIMPIEZA DEL FUSOR RODILLO SUMINISTRADOR DE ACEITE SUPERIOR SF 2050 07221302 CROLN0972FC31 COPIADORAS SHARP RODILLO DE LIMPIEZA DEL FUSOR RODILLO SUMINISTRADOR DE ACEITE SUPERIOR SF 2060/3062 07221303 CROLN1181FC31 COPIADORAS SHARP RODILLO DE LIMPIEZA DEL FUSOR RODILLO SUMINISTRADOR DE ACEITE SUPERIOR SF 2260 07221304 CROLN0935FC31 COPIADORAS SHARP RODILLO DE LIMPIEZA DEL FUSOR RODILLO SUMINISTRADOR ACEITE 2022 AR 5125/5132/2022/2027/2035 RODILLO DE TELILLA Ref. CTR Ref. OEM Producto 07092247 NROLR1576FCZZ COPIADORAS SHARP RODILLO DE TELILLA RODILLO DE ACEITE TELILLA MXM 283/363/453/503 RODILLO INFERIOR Ref. CTR Ref. OEM Producto 07061903 NROLI1453FCZ1 COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR ARM 620 ARM 550/620/700 07062187 NROLI182FCZZ COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR MXM 283 MX-M 283/363/453/503 07061864 NROLR0113QSZZ COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR ARM 277 ARM 236/237/276/277 07061866 AR-505HR COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR AR 507 AR 287/337/407/505/507 07061868 NROLI1314FCZZ COPIADORAS SHARP RODILLO INFERIOR RODILLO INFERIOR",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}