{
    "relation": [
        [
            "Patent application number",
            "20080260330",
            "20120033220"
        ],
        [
            "Description",
            "ALIGNMENT WITH THIN BONDING LAYER OF OPTICAL COMPONENTS - An optical component is attached to a mounting block and the mounting block is attached to a carrier. The optical component is actively aligned by adjusting the optical component with respect to the mounting block and the mounting block with respect to the carrier. An adhesive used for the attachments can be in a layer of 5 microns or less to reduce thermal degradation and effects of thermal expansion.",
            "QCL Spectroscopy System and Applications Therefor - A spectroscopy system comprising at least two laser modules, each of the laser modules including a laser cavity, a quantum cascade gain chip for amplifying light within the laser cavity, and a tuning element for controlling a wavelength of light generated by the modules. Combining optics are used to combine the light generated by the at least two laser modules into a single beam and a sample detector detects the single beam returning from a sample."
        ],
        [
            "Published",
            "10-23-2008",
            "02-09-2012"
        ]
    ],
    "pageTitle": "Zhu, MA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/zhu-ma-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434321435,
    "recordOffset": 434284615,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ninghui Zhu, Winchester, MA US 05-07-2009 Novel compounds that are ERK inhibitors - Disclosed are the ERK inhibitors of formula 1.0: 20090118284 Published Description Patent application number Liang Zhu, Somerville, MA US 07-10-2014 AMIDOPYRAZOLE INHIBITORS OF INTERLEUKIN RECEPTOR-ASSOCIATED KINASES - This invention relates to amidopyrazole compounds that are inhibitors of Interleukin receptor-associated kinases, in particular IRAK-4, and are useful in the treatment of cellular proliferative diseases, for example, cancer, hyperplasia, restenosis, cardiac hypertrophy, immune disorders and inflammation. 20140194404 10-03-2013 INDAZOLE DERIVATIVES USEFUL AS ERK INHIBITORS - The present invention provides a compound of the Formula I, or a pharmaceutically acceptable salt, solvate or ester thereof, wherein R, R 20130261125 09-12-2013 NOVEL COMPOUNDS THAT ARE ERK INHIBITORS - Disclosed are the ERK inhibitors of formula (1): and the pharmaceutically acceptable salts thereof, wherein: A is a five membered monocyclic heteroaryl ring; and B is a monocyclic heterocycloalkyl ring, or a monocyclic heterocycloalkenyl ring, or a bridged monocyclic heterocycloalkyl ring, or a fused (monocyclic heterocycloalkyl ring) cyclopropyl ring. Also disclosed are methods of treating cancer using the compounds of formula (1). 20130237518 07-04-2013 FUSED PYRAZOLE DERIVATIVES AS NOVEL ERK INHIBITORS - Disclosed are the ERK inhibitors of Formula (I): (Formula (I)) and the pharmaceutically acceptable salts thereof. All substitutents are as defined herein. Also disclosed are methods of treating cancer using the compounds of Formula (I). 20130172341",
    "textAfterTable": "Patent applications by Ninghui Zhu, Winchester, MA US Ping Zhu, Cambridge, MA US Patent application number Description Published 20120129914 ORGANIC COMPOSITIONS TO TREAT HSF1-RELATED DISEASES - The present disclosure relates to methods of treating heat shock factor 1 (HSF1)-related diseases such as cancer and viral diseases, using a therapeutically effective amount of a RNAi agent to HSF. 05-24-2012 20120129915 ORGANIC COMPOSITIONS TO TREAT HSF1-RELATED DISEASES - The present disclosure relates to methods of treating heat shock factor 1 (HSF1)-related diseases such as cancer and viral diseases, using a therapeutically effective amount of a RNAi agent to HSF. 05-24-2012 20140039039 ORGANIC COMPOSITIONS TO TREAT HSF1-RELATED DISEASES - The present disclosure relates to methods of treating heat shock factor 1 (HSF1)-related diseases such as cancer and viral diseases, using a therapeutically effective amount of a RNAi agent to HSF. 02-06-2014 Ping Zhu, Boxborough, MA US Patent application number Description Published 20110166058 ORGANIC COMPOSITIONS TO TREAT HSF1-RELATED DISEASES - The present disclosure relates to methods of treating heat shock factor 1 (HSF1)-related diseases such as cancer and viral diseases, using a therapeutically effective amount of a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}