{
    "relation": [
        [
            "Enquiries: HarbourVest",
            "Stuart Howard",
            "Laura Thaxter",
            "Fishburn Hedges Jason Nisse / Alastair Fairbrother"
        ],
        [
            "",
            "Tel: +44 (0) 20 7399 8815",
            "Tel: +1 (617) 348 3695",
            "Tel: +44 (0) 20 7839 4321"
        ],
        [
            "",
            "showard@harbourvest.com",
            "lthaxter@harbourvest.com",
            "HVPE@fishburn-hedges.co.uk"
        ]
    ],
    "pageTitle": "HARBOURVEST HVGPE : Notification of Interests of Directors | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/HARBOURVEST-HVGPE-417828/news/HARBOURVEST-HVGPE--Notification-of-Interests-of-Directors-13972176/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 274061947,
    "recordOffset": 274041280,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{67941=17 January 2012, 68056=HarbourVest Global Private Equity Limited (\"HVPE\" or the \"Company\") was advised on 16 January 2012 that on the same date Sir Michael Bunbury, Chairman of HVPE; Keith Corbin, Chairman of the Audit Committee; and Andrew Moore, a Director of HVPE, bought shares in the Company., 72449=1982 and has committed more than $30 billion to investments over its 30-year history. It currently has more than 230 employees in its Boston office and London, Hong Kong,, 72704=This announcement is for information purposes only and does not constitute or form part of any offer to issue or sell, or the solicitation of an offer to acquire, purchase or subscribe for, any securities in any jurisdiction and should not be relied upon in connection with any decision to subscribe for or acquire any Shares. In particular, this announcement does not constitute or form part of any offer to issue or sell, or the solicitation of an offer to acquire, purchase or subscribe for, any securities in the United States or to US Persons (as defined in Regulation S under the US Securities Act of 1933, as amended (\"US Persons\")). Neither this announcement nor any copy of it may be taken, released, published or distributed, directly or indirectly to US Persons or in or into the United States (including its territories and possessions), Canada, Australia or Japan, or any jurisdiction where such action would be unlawful. Accordingly, recipients represent that they are able to receive this announcement without contravention of any applicable legal or regulatory restrictions in the jurisdiction in which they reside or conduct business. No recipient may distribute, or make available, this announcement (directly or indirectly) to any other person. Recipients of this announcement should inform themselves about and observe any applicable legal requirements in their jurisdictions. The Shares have not been and will not be registered under the US Securities Act of 1933, as amended (the \"Securities Act\") or with any securities regulatory authority of any state or other jurisdiction of the United States and, accordingly, may not be offered, sold, resold, transferred, delivered or distributed, directly or indirectly, within the United States or to US Persons. In addition, the Company is not registered under the US Investment Company Act of 1940, as amended (the \"Investment Company Act\") and shareholders of the Company will not have the protections of that act. There will be no public offer of the Shares in the United States or to US Persons. This announcement has been prepared by the Company and its investment manager, HarbourVest Advisers L.P. (the \"Investment Manager\"). No liability whatsoever (whether in negligence or otherwise) arising directly or indirectly from the use of this announcement is accepted and no representation, warranty or undertaking, express or implied, is or will be made by the Company, the Investment Manager or any of their respective directors, officers, employees, advisers, representatives or other agents (\"Agents\") for any information or any of the opinions contained herein or for any errors, omissions or misstatements. None of the Investment Manager nor any of their respective Agents makes or has been authorised to make any representation or warranties (express or implied) in relation to the Company or as to the truth, accuracy or completeness of this announcement, or any other written or oral statement provided. In particular, no representation or warranty is given as to the achievement or reasonableness of, and no reliance should be placed on any projections, targets, estimates or forecasts contained in this announcement and nothing in this announcement is or should be relied on as a promise or representation as to the future. Other than as required by applicable laws, the Company gives no undertaking to update this announcement or any additional information, or to correct any inaccuracies in it which may become apparent and the distribution of this announcement. The information contained in this announcement is given at the date of its publication and is subject to updating, revision and amendment. The contents of this announcement have not been approved by any competent regulatory or supervisory authority. This announcement includes statements that are, or may be deemed to be, \"forward looking statements\". These forward looking statements can be identified by the use of forward looking terminology, including the terms \"believes\", \"projects\", \"estimates\", \"anticipates\", \"expects\", \"intends\", \"plans\", \"goal\", \"target\", \"aim\", \"may\", \"will\", \"would\", \"could\", \"should\" or \"continue\" or, in each case, their negative or other variations or comparable terminology. These forward looking statements include all matters that are not historical facts and include statements regarding the intentions, beliefs or current expectations of the Company. By their nature, forward looking statements involve risks and uncertainties because they relate to events and depend on circumstances that may or may not occur in the future and may be beyond the Company's ability to control or predict. Forward looking statements are not guarantees of future performance. More detailed information on the potential factors which could affect the financial results of the Company is contained in the Company's public filings and reports. HarbourVest Global Private Equity Limited is registered with the Netherlands Authority for the Financial Markets as a collective investment scheme which may offer participations in The Netherlands pursuant to article 2:66 of the Financial Markets Supervision Act (Wet op het financieel toezicht). All investments are subject to risk. Past performance is no guarantee of future returns. Prospective investors are advised to seek expert legal, financial, tax and other professional advice before making any investment decision. The value of investments may fluctuate. Results achieved in the past are no guarantee of future results. This announcement is issued by the Company, which is registered with the Netherlands Authority for the Financial Markets and whose registered address is at Anson Place, Mill Court, La Charroterie, St Peter Port, Guernsey GY1 1EJ. © 2012 HarbourVest Global Private Equity Limited. All rights reserved.}",
    "textBeforeTable": "0.004% of the Company's issued share capital. Following this purchase, Mr. Moore had a total interest of 9,000 shares in the Company representing 0.011% of the Company's issued share capital. Andrew Moore bought 3,000 ordinary shares at a price of $6.10 per share, representing 0.006% of the Company's issued share capital. Following this purchase, Mr. Corbin had a total interest of 20,000 shares in the Company representing 0.024% of the Company's issued share capital. Keith Corbin bought 5,000 ordinary shares at a price of $6.10 per share, representing Sir Michael Bunbury bought 8,500 ordinary shares at a price of $6.10 per share, representing 0.010% of the Company's issued share capital. Following this purchase, Mr. Bunbury had a total interest of 20,000 shares in the Company representing 0.024% of the Company's issued share capital. HarbourVest Global Private Equity Limited (\"HVPE\" or the \"Company\") was advised on 16 January 2012 that on the same date Sir Michael Bunbury, Chairman of HVPE; Keith Corbin, Chairman of the Audit Committee; and Andrew Moore, a Director of HVPE, bought shares in the Company. NOTIFICATION OF INTERESTS OF DIRECTORS 17 January 2012 *Required fields Message : (You can enter multiple email addresses separated by",
    "textAfterTable": "Notes to Editors: About HarbourVest Global Private Equity Limited: HarbourVest Global Private Equity Limited (\"HVPE\") is a Guernsey-incorporated closed-end investment company which has a dual listing on both the London Stock Exchange and Euronext Amsterdam. HVPE is registered as an investment institution with the Netherlands Authority for the Financial Markets. HVPE is designed to offer shareholders long-term capital appreciation by investing in a private equity portfolio diversified by geography, by stage of investment, by vintage year, and by industry. It invests in and alongside HarbourVest-managed funds which focus on primary partnership commitments, secondary investments, and direct investments in operating companies. HVPE is advised by HarbourVest Advisers L.P., an affiliate of HarbourVest Partners, LLC. About HarbourVest Partners, LLC: HarbourVest is an independent global private equity investment firm and an SEC registered investment advisor, providing vehicles for institutional investors to invest in the venture capital and buyout markets in the U.S., Europe, and elsewhere through primary partnerships, secondary purchases, and direct investments. It was formed in 1982 and has committed more than $30 billion to investments over its 30-year history. It currently has more than 230 employees in its Boston office and London, Hong Kong, and Tokyo subsidiaries. This announcement is for information purposes only and does not constitute or form part of any offer to issue or sell, or the solicitation of an offer to acquire, purchase",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}