{
    "relation": [
        [
            "",
            "• Wildcats",
            "Wolverines"
        ],
        [
            "1",
            "7",
            "7"
        ],
        [
            "2",
            "0",
            "7"
        ],
        [
            "3",
            "14",
            "0"
        ],
        [
            "4",
            "0",
            "0"
        ],
        [
            "Total",
            "21",
            "14"
        ]
    ],
    "pageTitle": "2008 Michigan Wolverines football team - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2008_Michigan_Wolverines_football_team",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 866858471,
    "recordOffset": 866823058,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34494=In retrospect, after Utah had finished the season unbeaten, blowing out Alabama 31–17, this could be seen as one of Michigan's best games of 2008., 85052=With the loss, Michigan's season ended with a 3-9 record, officially the worst for the school in the 129 years of the football program. This was their fifth loss in a row to Ohio State, and made the 2008 senior class the second in a row never to beat the Buckeyes., 14389=The 2008 Michigan Wolverines football team represented the University of Michigan in the 2008 NCAA Division I FBS football season. The team's head football coach was Rich Rodriguez. The Wolverines played their home games at Michigan Stadium in Ann Arbor, Michigan. The 2008 season marked Rodriguez's first season as Michigan head coach, having replaced longtime head coach Lloyd Carr following Carr's retirement at the end of the 2007 season. Rodriguez installed a spread option offense, a marked departure from Michigan's prior offensive approaches., 15543=Rodriguez's first season was one of adjustment, with Michigan suffering its first losing season since 1967, and more losses (9) in a single season than in any other in the program's 129-year history. In addition, Michigan's loss to Ohio State on November 22 was the fifth straight, the most consecutive losses by Michigan to the Buckeyes.[1], 60857=Linebacker Navorro Bowman led the defense with 11 tackles. Defensive tackle Jared Odrick made a career-high six stops, with 2.5 tackles for loss, but his biggest play occurred with 4:39 remaining in the third quarter. Odrick sacked Michigan quarterback Nick Sheridan, who was in for the injured Steven Threet, in the end zone for a safety and Penn State's first lead of the game, 19–17. Aaron Maybin finished with four tackles, including a sack of Threet that forced a fumble, recovered by Abe Koroma, and led to a Penn State touchdown.[4], 69656=The scoring continued to see-saw in the fourth quarter. The Wolverines tied it back up when Brandon Minor ran in a TD from 12 yards out. Then Greg Orton put the Boilermakers back up by catching a 4-yard TD pass. The Wolverines re-tied the game when Brandon Minor got his 3rd TD of the game, this time on a 1-yard run. The Boilermakers put the game in the win column with less than 30 seconds left when Desmond Tardy caught a 28-yard TD pass. With the loss, Michigan was disqualified from all bowl games this season, the first time since 1967. Brandon Minor's 154 yards and 3 touchdowns set a school record. Purdue's 48 points was the most the school had ever scored against Michigan, and their first win against Michigan since 2000., 74723=In the third quarter, the Wolverines scored first on a 48-yard field goal. Then the Golden Gophers finally got on the board with a 28-yard field goal from kicker Joel Monroe. Then K.C. Lopata got his fifth and final field goal of the game, this one from 23 yards out. In the fourth quarter, the Golden Gophers managed to score on another field goal, this one from 32 yards out. The final score of the game was when Mark Moundros of the Wolverines ran in a TD from 3 yards out. It was the Wolverines' 12th straight win in the Metrodome. With the Gophers' move to the new TCF Bank Stadium in the 2009 season, the Wolverines could claim to have never lost in the Metrodome., 49341=For their 2008 Homecoming Game, the Wolverines hosted the Illinois Fighting Illini. The Wolverines looked good in the first quarter, scoring a season high 14 points on 2 touchdowns. Michigan's Steven Threet was 18-of-35 for 250 yards and two TDs. Sam McGuffie ran for 70 yards and a touchdown and freshman Martavious Odoms set season highs with seven receptions and 129 yards receiving. However, they were blanked in the second and third quarter. They came back to life in the fourth quarter though, when Mark Moundros caught a 2-yard pass for a touchdown, but kicker K.C. Lopata failed on the PAT attempt. Illinois however had their best game against Michigan in the history of the Michigan / Illinois contests. The Illini set a school record for points against Michigan (45), surpassing the 39 points Red Grange helped them score in 1924 as Memorial Stadium was dedicated, and they scored the most any team has at Michigan Stadium since Florida State had 51 in 1991. It was also the Illini's first victory at the Big House since 1999, and University of Illinois quarterback Isiah \"Juice\" Williams set a Big House record with 431 all-purpose yards, breaking the record previously held by former Illini quarterback Tony Eason (403). Illini quarterback Isiah \"Juice\" Williams connected with Jeff Cumberland for a 77-yard pass, the longest by an Illini quarterback since 1985, and a perfectly lofted screen to running back Daniel Dufrene turned into a 57-yard TD. With the loss, the Wolverines fell to 2–3 on the season and 1–1 in the Big Ten, their worst record after five games since starting 1–4 in 1967, two years before Bo Schembechler arrived., 79474=The second half was all Northwestern. First Ross Lane caught a 17-yard TD pass to tie it up. Then Eric Peterman caught a 53 yard long bomb for another TD, sealing the win for the Wildcats. With this loss, Michigan fell to 3–8, the school's most losses in a single-season in 129 years of football. It was also just Northwestern's second win in Ann Arbor in its past 21 trips. The program's only other win there since 1960 came in the Rose Bowl season of 1995., 59104=In the fourth-largest crowd in Beaver Stadium history, the Penn State Nittany Lions ended a nine-game losing streak to the Wolverines, dating back to 1997. Michigan tallied 204 yards of offense and scored on their first three possessions to take a 17–7 lead early in the second quarter, but the Nittany Lion defense made key halftime adjustments and limited the Wolverines to only 87 yards the remainder of the game. Penn State quarterback Daryll Clark's touchdown pass to Jordan Norwood late in the first half cut Michigan's lead to 17–14, Penn State's first deficit at halftime this season.}",
    "lastModified": "Mon, 03 Aug 2015 02:10:22 GMT",
    "textBeforeTable": "Utah at Michigan vs Utah[edit] Game notes[edit] Radio coverage for all games was on the University of Michigan Football Network and on Sirius Satellite Radio. The radio announcers were Frank Beckmann with play-by-play, Jim Brandstatter with color commentary, and Doug Karsch with sideline reports. Radio[edit] *Non-conference game. Homecoming. #Rankings from AP Poll/Coaches' Poll released prior to game. All times are in Eastern Time. 105,564 L 7–42   ABC Ohio Stadium • Columbus, OH (The Game) at #10/10 Ohio State 12:00 PM November 22 107,856 L 14–21   ESPN2 Michigan Stadium • Ann Arbor, MI Northwestern 12:00 PM November 15 55,040 W 29–6   ESPN Hubert H. Humphrey Metrodome • Minneapolis, MN (Little Brown Jug) at ",
    "textAfterTable": "Date: August 30 Location: Michigan Stadium Ann Arbor, MI Game start: 3:30 PM EST Elapsed time: 3:33 Game attendance: 108,421 Game weather: 85°F, Sunny, SW 5 MPH Referee: Todd Geerlings TV announcers (ABC/ESPN2): Terry Gannon (Play-by-play), David Norrie (Color) & Jeannine Edwards (Sideline) Recap: Week 1 In the season opener in Ann Arbor and Rich Rodriguez's first game as head coach, the Wolverines took on the Utah Utes. The Wolverines scored first with just over 11 minutes to go in the first, when Nick Sheridan threw an 8-yard TD pass to Michael Shaw. Utah struck back a few minutes later when Courbin Louks ran in a TD from 8 yards out. The Wolverines blocked the PAT though. Then with just over 5 minutes to go in the first, K.C. Lopata completed a 50-yard field goal. Utah's Louie Sakoda completed 3 field goals in the second quarter, from 28, 43 and 41 yards out, respectively. Then a few seconds before halftime, Utah's Brian Johnson completed a 19-yard TD pass to Bradon Godfrey. Midway through the third quarter, Louie Sakoda of Utah completed his fourth field goal of the day, this one from 53 yards out. Midway through the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}