{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Stepping onto the Columbia campus is like stepping into a bubble. Even though it's located in NYC, the environment's very different from the city surrounding it. The campus is very safe. The most prevalent crime is theft, and even then it poses a very mild problem. Campus police are readily available, but they're not overbearing. Columbia has a separate ambulance service, which is available 24/7. The priority is for student safety, so there are very few to no penalties for calling an ambulance for a friend even if the both of you were doing something against school policy.",
            "You're in New York City! There's always plenty to do Columbia's in a great place, close enough to the big attractions so that it's convenient to get to them, but far enough away where the noise isn't distracting. The main campus is located between Broadway and Amsterdam, so there are all kinds of stores within walking distance. The 116 Broadway subway stop is right in front the school gates, so transportation's super convenient. Times Square is only a 20 min subway ride away. Museum Mile, on 5th avenue, is only a 30 min bus ride away. The school offers discount tickets to many of the shows, plays, and concerts currently showing, and your student ID lets you get into many museums and similar places for free. There are also lotteries for free tickets to some of these shows. For example, I won a free ticket to see Cinderella on Broadway. If you don't feel like going into the city, there's also frequent shows and events hosted on campus by different student performance groups, like concerts by different singing groups, and cultural festivals hosted by the different cultural associations.",
            "You're in New York City! There's always plenty to do. Columbia's in a great place, close enough to the big attractions so that it's convenient to get to them, but far enough away where the noise isn't distracting. The main campus is located between Broadway and Amsterdam, so there are all kinds of stores within walking distance. The 116 Broadway subway stop is right in front the school gates, so transportation's super convenient. Times Square is only a 20 min subway ride away. Museum Mile, on 5th avenue, is only a 30 min bus ride away. The school offers discount tickets to many of the shows, plays, and concerts currently showing, and your student ID lets you get into many museums and similar places for free. There are also lotteries for free tickets to some of these shows. For example, I won a free ticket to see Cinderella on Broadway. If you don't feel like going into the city, there's also frequent shows and events hosted on campus by different student performance groups, like concerts by different singing groups, and cultural festivals hosted by the different cultural associations.",
            "There are three dining halls: John Jay, JJ's Place, and Ferris Booth. JJ's Place basically serves diner food: burgers, chicken tenders, fries, etc. so I only ever eat at JJ's as an indulgence. There is, however, a Jamba Juice machine, and students are free to take however much they want, so I often go on Jamba Juice runs with some of my friends and load up a couple water bottles with Jamba Juice in order to use up meal swipes. There's also an area where you can use swipe for breakfast food (granola bars, personal cereal packs and orange juice cartons, etc.) so many of the students I know go to JJ's at the end of the week to use up meal swipes. JJâ??s closes at 1:00 am during the week so itâ??s available for late night cravings. I go to John Jay for most of my meals because it's closest to my dorm. John Jay has a greater variety of food than Ferris Booth. Ferris serves pretty much the same thing every single day, but the quality is more consistent at Ferris. There will be days where the food at John Jay is magnificent and then there will be days where it's terrible. John Jay closes on Fridays and Saturdays though, and isn't open until 11:00 am during the other days of the week. So Ferris, which opens at 8:00 am, is best for breakfast. Both Ferris and JJâ??s close at 8:00 pm on Fridays and Saturdays. There are also cafes scattered around the campus, like Cafe 212 and Cafe East in Lerner Hall, which accept dining dollars (every meal plan comes with a certain amount of dining dollars, which rolls over from year to year, and more can be added over the course of the year). Cafe East has bubble tea and sushi, so that's where all my dining dollars have gone. :P Students can also add flex dollars to their accounts, which can be used at all dining locations on campus, the CU bookstore, and a bunch of different restaurants and stores near campus (there's a list online), as well as for the laundry machines and vending machines on campus.",
            "Columbia offers housing to all its undergraduate students for all four years, so you don't have to try and find an apartment in NYC. As a first year, I'm only familiar with the first year dorms, but it seems to me like there's a dorm to suit anyone's personality. Hartley and Wallach are part of the Living Learning Center (LLC) where first year's live with upperclassmen. I live in Hartley, and the upperclassmen on my floor are all very friendly and helpful. I sometimes get homework help from them. Most of my closest friends are from my floor. My RA's great; he's always willing to help you and he organizes really fun floor activities (pumpkin carving, secret santa, etc.). It's worth it to go to the study breaks each week. The lounges and other common areas, like kitchens, are kept very clean. Some floors in different dorms can get mice, but the risks of that are pretty directly proportional to the residents' efforts to clean up after themselves. It's not a problem on my floor. The bathrooms and kitchens vary from dorm to dorm. I hear Furnald has really nice facilities. Wallach has just been renovated, so their facilities are also very nice. Hartley is the oldest dorm and the bathrooms and kitchens are very small, but they're maintained well. Both Hartley and Wallach have kitchens on each floor (and obviously bathrooms, too). I'm not familiar with Carmen and John Jay's facilities, but there is apparently only one kitchen in Carmen and its located in the basement. Carmen's the party dorm and John Jay is also very social. Furnald is quieter, but my friends who live there are also very close with their floor mates.",
            "For reference, my courses for the first semester were: Calculus III, Physics I, Intensive General Chemistry I, Engineering in Medicine, Art of Engineering. All the courses I've taken have been suitably challenging, but the workload hasn't been extreme and I've still had plenty of to hang out with friends. The exams are reasonable and the curves are fair. Columbia doesn't inflate grades, but it's still possible to do really well in your classes if you choose the appropriate difficulty. The last two courses in my schedule last semester were introductory classes, so the workload was light, with just a few projects and papers and no exams, but the lectures were very interesting.",
            "Columbia's got a great student body that's both highly diverse and extremely accepting. The professors are all well-versed in their course material and willing to help you with any problems you have with the coursework; for more immediate and/or nonacademic help, the upperclassmen are very friendly and willing to offer advice and help with difficult homework problems. As a perk, the school's in a great location, with plenty to do and see, and offers discounted tickets for Broadway shows, plays, and concerts and your ID can get you into museums and similar places for free."
        ]
    ],
    "pageTitle": "Columbia University in the City of New York Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Columbia-University-in-the-City-of-New-York/reviews?_escaped_fragment_=/show/63162",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912000131,
    "recordOffset": 911930579,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{228115=One would think that Columbia's academic rigor and sterling reputation as one of the foremost institutions of higher learning in the world would be enough to make it a dream school for any ambitious student. However, its unparalleled cultural diversity and unique location on the upper east side of Manhattan further distinguish it as a university truly apart from those in its cohort. I still cannot believe that I received a letter with the famous light blue crest adorning the header informing me of my admission to the class of 2016 and I will be stepping on campus in the fall following in the footsteps of Presidents Eisenhower and Obama and poets Kerouac and Ginsberg and knowing full well the shoes I must fill., 119307=There are three dining halls: John Jay, JJ's Place, and Ferris Booth. JJ's Place basically serves diner food: burgers, chicken tenders, fries, etc. so I only ever eat at JJ's as an indulgence. There is, however, a Jamba Juice machine, and students are free to take however much they want, so I often go on Jamba Juice runs with some of my friends and load up a couple water bottles with Jamba Juice in order to use up meal swipes. There's also an area where you can use swipe for breakfast food (granola bars, personal cereal packs and orange juice cartons, etc.) so many of the students I know go to JJ's at the end of the week to use up meal swipes. JJâ??s closes at 1:00 am during the week so itâ??s available for late night cravings. I go to John Jay for most of my meals because it's closest to my dorm. John Jay has a greater variety of food than Ferris Booth. Ferris serves pretty much the same thing every single day, but the quality is more consistent at Ferris. There will be days where the food at John Jay is magnificent and then there will be days where it's terrible. John Jay closes on Fridays and Saturdays though, and isn't open until 11:00 am during the other days of the week. So Ferris, which opens at 8:00 am, is best for breakfast. Both Ferris and JJâ??s close at 8:00 pm on Fridays and Saturdays. There are also cafes scattered around the campus, like Cafe 212 and Cafe East in Lerner Hall, which accept dining dollars (every meal plan comes with a certain amount of dining dollars, which rolls over from year to year, and more can be added over the course of the year). Cafe East has bubble tea and sushi, so that's where all my dining dollars have gone. :P Students can also add flex dollars to their accounts, which can be used at all dining locations on campus, the CU bookstore, and a bunch of different restaurants and stores near campus (there's a list online), as well as for the laundry machines and vending machines on campus., 329054=© 2015, Cappex.com, LLC, 81063=World leaders forum takes place in September. Each school gets to have its own Christmas party, and these are fun., 137728=The connections made with professors and instructors are great. The climate (in terms of the resources available) is perfect for the student who is itching to be independent and loves the city. However, it gets cold fast and stays cold for long periods of time - it snowed late April and was cold enough for coats in early May., 104549=New York being New York is expensive. Example: Chiptole Burrito in Maryland $6.30-6.50, in New York $7.10, 132388=Student Organizations throw parties more so at the beginning of the semester and near the end of the semester. Students can go sight-seeing (at the Brooklyn Bridge, in the Met, etc.) or peruse through nearby Harlem (yes in Harlem, but during the daytime, as I did). Students (of legal age) can visit 1020 or Mel's for a drink and hangout.}",
    "textBeforeTable": "01/07/2010 Reviewer is A current student here. 104 out of 105 people found this review useful. 1 of 81 Nina from Baldwin, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({",
    "textAfterTable": "Comments Great for these types of students Anyone who excells both academically and socially. And, it is a perfect match for the urban student looking to live life in the city. Tips for prospective students Take advantage of your environment; there are amazing internship opportunities that aren't available anywhere else in the world. And, try to immerse yourself into the culture of NYC, or even abroad through one of the university's many study-abroad programs. Bang for the buck It's hard to say that any education is worth almost 50k annually, however, an Ivy League is as close as you'll get. Will enjoy being here The university is very unique in that it effectively combines a closed-campus environment in the middle of the country's biggest city. Overall, it's a good balance that any urban student will enjoy. Will learn a lot You can't go wrong academically with an Ivy League. You will get the some of the best education in the entire world at Columbia. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}