{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are plenty of trees and grass around the campus where you can relax with friends before and after class. Also, there is TLC where there are tutors and teachers to help students with homework or any questions. Finally, there is student center and you can just relax there, study do as you please.",
            "There is a cafeteria at this college, and inside it has a Subway and other food like fries, burgers, etc. Also, there are plenty of vending machines around the campus if you want food or a drink. Lastly, there is a coffee shop place and the coffee's are amazing.",
            "There are no dorms here thus it is a community college.",
            "Each teacher has his or her own strictness to her grading scale, but most of the teachers follow a standard grading scale. Also, if you plan to transfer make sure you keep your GPA at a 3.0 or above because that gives you a greater chance to acceptance. Counselors are a great help in finding out what classes to take and also what classes are transferable.",
            "Future Students make sure to register early so you get the best chance to get the classes you need. Also, make sure to buy a parking permit because security constantly goes by and checks all cars. Other than that College of the Canyons is a great community college and the sports teams are awesome.",
            "I like that current students at College of the Canyons always get all the classes they need, and they do not have to fight with others. Most of the teachers that I have had have been great. They all have PH.D's, BA's, and other high level degrees, so it makes it more comforting for the students to know that the teachers are well educated in the subject they teach."
        ]
    ],
    "pageTitle": "College of the Canyons Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-the-Canyons/reviews?_escaped_fragment_=/show/54868",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891429915,
    "recordOffset": 891367447,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{318909=© 2015, Cappex.com, LLC, 117057=60+ clubs as of 2012, and always growing. With an active Inter Club Council to keep clubs productive and on track.}",
    "textBeforeTable": "07/10/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 75 Karla Portillo from Canyon Country, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Tiffany from Saugus, CA 08/15/2011 Reviewer is A past student here. 1 out of 1 people found this review useful. 2 of 75 Categories Comments Great for these types of students If you live in Santa Clarita or close to it I say go to COC. Being able to live at home and commute to school will save you so much money. It is a great school and it is just a stepping stone for those who want to transfer. You can even get an associate's degree while you are finishing all your GE's which students at 4 yrs won't be able to obtain there. Tips for prospective students In order to finish COC in 2 years I say don't be intimidated if all classes are full or you are being weight-listed. Honestly it was that way for me too. I just kept showing up until the teacher was able to add me. If that means showing up for three weeks still not knowing if you are in a class or not that;s what it takes. Several students in my classes would eventually drop out so I just",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}