{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7"
        ],
        [
            "Command or Action",
            "configure terminal Example: Switch# configure terminal",
            "interface {gigabitethernet interface-id} | {vlan vlan-id} | {port-channel port-channel-number} Example: Switch(config)# interface gigabitethernet1/0/2",
            "no switchport Example: Switch(config-if)# no switchport",
            "ip address ip_address subnet_mask Example: Switch(config-if)# ip address 192.20.135.21 255.255.255.0",
            "no shutdown Example: Switch(config-if)# no shutdown",
            "end Example: Switch(config-if)# end",
            "show interfaces [interface-id]"
        ],
        [
            "Purpose",
            "Enters global configuration mode.",
            "Specifies the interface to be configured as a Layer 3 interface, and enter interface configuration mode.",
            "For physical ports only, enters Layer 3 mode.",
            "Configures the IP address and IP subnet.",
            "Enables the interface.",
            "Returns to privileged EXEC mode.",
            "Verifies the configuration."
        ]
    ],
    "pageTitle": "Interface and Hardware Component Configuration Guide, Cisco IOS XE Release 3SE (Catalyst 3850 Switches) - Configuring Interface Characteristics [Cisco Catalyst 3850 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst3850/software/release/3se/int_hw_components/configuration_guide/b_int_3se_3850_cg/b_int_3se_3850_cg_chapter_010.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362546811,
    "recordOffset": 362506455,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48099=The 1000BASE-T SFP module ports support the same speed and duplex options as the 10/100/1000-Mb/s ports., 14291=Although the switch stack or switch supports a total of 1005 VLANs and SVIs, the interrelationship between the number of SVIs and routed ports and the number of other features being configured might impact CPU performance because of hardware limitations., 35995=To configure 10/100/1000 port 4 on a standalone switch, enter this command:, 148646=This example shows how to set the interface speed to 100 Mb/s on a 10/100/1000 Mb/s port:, 86848=3.    speed {10 | 100 | 1000 | auto [10 | 100 | 1000] | nonegotiate}, 90874=Enter 10, 100, or 1000 to set a specific speed for the interface. The 1000 keyword is available only for 10/100/1000 Mb/s ports., 92074=The nonegotiate keyword is available only for SFP module ports. SFP module ports operate only at 1000 Mb/s but can be configured to not negotiate if connected to a device that does not support autonegotiation., 148078=This example shows how to set the interface speed to 100 Mb/s and the duplex mode to half on a 10/100/1000 Mb/s port:, 45876=Switch models include Gigabit Ethernet (10/100/1000-Mb/s) ports, 10-Gigabit Ethernet ports, and small form-factor pluggable (SFP) module slots supporting SFP modules., 45529=Ethernet interfaces on the switch operate at 10, 100, 1000, or 10,000 Mb/s and in either full- or half-duplex mode. In full-duplex mode, two stations can send and receive traffic at the same time. Normally, 10-Mb/s ports operate in half-duplex mode, which means that stations can either receive or send traffic., 93138=Enable half-duplex mode (for interfaces operating only at 10 or 100 Mb/s). You cannot configure half-duplex mode for interfaces operating at 1000 Mb/s., 34596=Port number—The interface number on the switch. The 10/100/1000 port numbers always begin at 1, starting with the far left port when facing the front of the switch, for example, gigabitethernet1/0/1 or gigabitethernet1/0/8., 141616=To configure 10/100/1000 port 4 on a standalone switch, enter this command:, 2146=To configure VLANs, use the vlan vlan-id global configuration command to enter VLAN configuration mode. The VLAN configurations for normal-range VLANs (VLAN IDs 1 to 1005) are saved in the VLAN database. If VTP is version 1 or 2, to configure extended-range VLANs (VLAN IDs 1006 to 4094), you must first set VTP mode to transparent. Extended-range VLANs created in transparent mode are not added to the VLAN database but are saved in the switch running configuration. With VTP version 3, you can create extended-range VLANs in client or server mode. These VLANs are saved in the VLAN database., 46916=Gigabit Ethernet (10/100/1000-Mb/s) ports support all speed options and all duplex options (auto, half, and full). However, Gigabit Ethernet ports operating at 1000 Mb/s do not support half-duplex mode., 34885=On a switch with SFP uplink ports, the module number is 1 and the port numbers restart. For example, if the switch has 24 10/100/1000 ports, the SFP module ports are gigabitethernet1/1/1 through gigabitethernet1/1/4 or tengigabitethernet1/1/1 through tengigabitethernet1/1/4., 91409=Enter auto to enable the interface to autonegotiate speed with the connected device. If you use the 10, 100, or the 1000 keywords with the auto keyword, the port autonegotiates only at the specified speeds., 33017=Type—Gigabit Ethernet (gigabitethernet or gi) for 10/100/1000 Mb/s Ethernet ports, 10-Gigabit Ethernet (tengigabitethernet or te) for 10,000 Mb/s, or small form-factor pluggable (SFP) module Gigabit Ethernet interfaces (gigabitethernet or gi).}",
    "textBeforeTable": "These general instructions apply to all interface configuration processes. Configuring Interfaces Configuring the USB Inactivity Timeout Configuring the Console Media Type Shutting Down and Restarting the Interface Configuring SVI Autostate Exclude Configuring Layer 3 Interfaces Configuring IEEE 802.3x Flow Control Configuring Ethernet Interfaces Configuring and Using Interface Range Macros Configuring a Range of Interfaces Adding a Description for an Interface Configuring Interfaces How to Configure Interface Characteristics If the physical port is in Layer 2 mode (the default), you must enter the no switchport interface configuration command to put the interface into Layer 3 mode. Entering a no switchport command disables and then re-enables the interface, which might generate messages on the device to which the interface is connected. Furthermore, when you put an interface that is in Layer 2 mode into Layer 3 mode, the previous configuration information related to the affected interface might be lost, and the interface is returned to its default configuration Note All Layer 3 interfaces require an IP address to route traffic.",
    "textAfterTable": "Adding a Description for an Interface SUMMARY STEPS 1.    configure terminal 2.    interface interface-id 3.    description string 4.    end 5.    show interfaces interface-id description DETAILED STEPS   Command or Action Purpose Step 1 configure terminal Example:  Switch# configure terminal   Enters global configuration mode.   Step 2 interface interface-id Example:  Switch(config)# interface gigabitethernet1/0/2   Specifies the interface for which you are adding a description, and enter interface configuration mode.   Step 3 description string Example:  Switch(config-if)# description Connects to Marketing   Adds a description (up to 240 characters) for an interface.   Step 4 end Example:  Switch(config-if)# end",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}