{
    "relation": [
        [
            "your name",
            "tg",
            "KREKÁCS László",
            "Kovács Krisztian",
            "Preisinger Áron",
            "Nyos",
            "Radics Áron",
            "Besenyei Tamas (btamas)",
            "Ruskó Péter",
            "Roósz Péter",
            "Kárpáti László",
            "Lendvai Attila",
            "Tóth Antal",
            "Helle Kristóf",
            "your name"
        ],
        [
            "e-mail address",
            "tg x-net hu",
            "laszlo.krekacs.list kukac gmail potty com",
            "kroomagnon at gmail dot com",
            "appa00 kukac gmail pont com",
            "nyos kukac nyos pont homelinux pont net",
            "raronkonektor kukac gmail pont com",
            "tamas besenyei net",
            "peter kukac rusko pont hu",
            "peter kukac roosz pont hu",
            "leslie [at] zenevilag [dot] net",
            "attila.lendvai gmail",
            "toncsi55 kukac hotmail pont com",
            "s8529hel kukac freemail pont hu",
            "e-mail address"
        ],
        [
            "want phone? (yes/N)",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "want phone?"
        ],
        [
            "want case? (yes/yes?/?/no)",
            "yes?",
            "yes",
            "yes",
            "?",
            "yes?",
            "yes",
            "?",
            "yes?",
            "yes",
            "yes?",
            "yes",
            "yes",
            "yes?",
            "want case?"
        ],
        [
            "want headset? (yes/yes?/?/no)",
            "yes",
            "?",
            "yes",
            "?",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes",
            "yes?",
            "want headset?"
        ],
        [
            "prefer 2y warranty? (yes/?)",
            "yes?",
            "?",
            "yes",
            "yes",
            "?",
            "yes?",
            "?",
            "?",
            "yes",
            "yes",
            "no",
            "yes",
            "yes",
            "prefer warranty?"
        ],
        [
            "want devboard? (yes/yes?/no)",
            "yes",
            "yes?",
            "no",
            "yes",
            "no",
            "yes",
            "no",
            "no",
            "no",
            "no",
            "no",
            "no",
            "no",
            "want devboard?"
        ]
    ],
    "pageTitle": "Group sales - Openmoko",
    "title": "",
    "url": "http://wiki.openmoko.org/index.php?title=Group_sales&diff=prev&oldid=42821",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 250394887,
    "recordOffset": 250269126,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{204482=band: GSM 900/1800, 3G 2100, 215992=Figures accurate as of 4th Jun 2008 from UBS: 1EUR = 1.54USD and 1USD = 1.04CHF., 74358=Status 18/07/2007, 193162=As of 2008-07-03 (exchange rate 0.7505), US$369 is worth NZ$492 and US$25.81 is worth NZ$34.39, 181011=Status 10/10 - Buying via http://www.handheld-linux.com/wiki.php?page=Neo%20Freerunner, more slots available as they make discounts for buying 10+ Freerunners. Order will be placed on July 22., 73552=NO OpenMoko FreeRunner 900/1800 available anymore (on July 3, 2008 at 21h) as needed in Europe. Furthermore, confirmation: From Pulster.eu: Our sales price is 299 EUR + shipping 15 EUR in Europe = 314 EUR. The idea of \"open\" is ours. So check our price calculation: if you order the Freerunner from Taiwan, it's 399 USD + 100 USD shipping + c. 90 USD \"import taxes\" inside Europe. Total 589 USD = c.380 EUR. So it will be cheaper and we Europeans have 2 years of warranty when buying from Pulster, instead of a 14 days(?) for imported goods., 213139=François Bianco is trying to create a new group of 10 (will be mostly for French Switzerland). -> The group moved to the EPFL group, which will try to reach 20 persons. --Fbianco 11:42, 11 June 2008 (UTC) Gabriel Ambuehl would volunteer to order the initial 10pack. <- still accurate ? -> Gabriel will not organize the 10packs for Zürich due to not being in Switzerland. We are in contact to find a solution so please wait until we know what to do. Order in Germany (each for himself or as a group, not clear yet) could be as cheap as a 10pack. We are in contact with pulster.de and will be contacted form pulster about the price. We will contact you guys in the Zürich list as soon as we know more --Tuxfux.ch 10:26, 6 June 2008 (UTC) Alexandre Ghisoli will not organize the second 10pack, since the order moved in the Lucca's group., 271042=Status: 16/20 at 2008-05-24, 259458=As of 8 July 2008 we still need five people to pay in order to complete a second batch of ten. Just because there are twenty names on this list doesn't mean you can't join in. PLEASE contact Bert or Michael in addition to adding yourself to the list, 204628=status:GSM 900 variant sold out, new stocks due July 25, 2008, 236154=ALREADY Ordered 18th July (Pulster.de), 235314=ordering 23 July Beware transfers has been done and the group is closed if you don't have enough people to make a 10+ group contact me and we will see if do another one, 226195=There is a problem with the GPS in the currently shipping Freerunners: Mail archive. I already orderd 200 \"10pf NPO 50V 0402\" capacitors for convenient reselling. They will arrive within 10 days from now (2008.07.21)., 183761=After discussion on the talk page, a number of us have decided to place an individual order at Pulster.eu, because they are cheaper than the group sale discount, and they deliver a receipt with VAT. I'd advise the people on this group sale-list to do the same. You can indeed place a group order at Pulster.eu, but that won't lower the price, and would only add extra shipping costs. (from the person who made the group-order to the individual members of the group) MadJo 11:04, 30 June 2008 (UTC), 97529=As it looks right now, it seems that it would be cheaper and easier for us to buy through Pulster in Germany - see the following email: http://lists.openmoko.org/pipermail/community/2008-May/017778.html ~leinir, 212531=1x 10 Pack ordered from pulster for the group Zürich! Read more below --Tuxfux.ch 17:20, 28 June 2008 (UTC), 229475=Ordered from pulster.de on july 18th.}",
    "textBeforeTable": "This group places order at nearest distributor on the cheapest price. You will be contacted before ordering. group #1 - open !  ? = It is not important for me, either to have or not (use this instead of 'no' at least at the warranty) no = I absolutely don't want to have this item yes? = I prefer having one, but it's not a problem if not N = I want this many (2 for two headsets, for example) yes = I definitely want it (one) legend: groups Helle Kristóf Contact Beáta Müller Contact Thomas Otterbein Contact Attila Lendvai, Contact László Vadász, Contact Eduard Iacoboaia, Contact Peter Roosz, Contact Tamas Michalik, Contact Krisztián Kovács, Contact Móker Tamás,Contact KREKACS Laszlo, laszlo {pont} krekacs {pont} list {kukacka} gmail {pont} com Zsolt Pittmann, pittmann dot zsolt at gmail dot com Sütő Zoltán, suto dot zoltan at t dash online dot hu Bolyóczki Zsombor, mogorva kukac tuxworx pont hu Ferenc Szomor",
    "textAfterTable": "group #2 - open (ordering at mid-august)! your name e-mail address want phone? (yes/N) want case? (yes/yes?/?/no) want headset? (yes/yes?/?/no) prefer 2y warranty? (yes/?) want devboard? (yes/yes?/no) Árva T. Mihály lirul at hixsplit dot hu yes yes yes no no Hélei Zoltán heleiz [at] gmail [dot] com yes yes 2 yes no Muller Beata beata [dot] muller [at] gmail [dot] com yes yes yes  ? no Móker Tamás rwind [at] apacheweb [dot] hu yes yes yes yes no Piros Geza geza [dot] piros [at] gmail [dot] com yes yes yes yes yes Otterbein Thomas tommi [at] t-online [dot] hu yes no yes  ? no tr3w tr3w at freemail yes yes? yes yes? no",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}