{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is safe you just need to be careful not to go to the parking lot be yourself when it is late.",
            "There is one sorority and one fraternity and several honor societies.",
            "There are many student clubs and outside companies come and offer discount tickets for paintball, jewelry, cruises, and traveling.",
            "Students who like to get involved will find many opportunities to be engaged with umassboston and the Boston community as well.",
            "The school is located in Dorchester, ma near the water the view is beautiful.",
            "If you want a lot of food for a reasonable price get the pasta and the meatballs or chicken parm.",
            "I go to events hosted by the black student center, the queer center, and the student life department, and attended the jcole concert my freshmen year.",
            "The food is okay but I do get tired if eating on campus. I enjoy eating at the atrium cafe because the line is usually short.",
            "The school does not have dorms.",
            "The academics are rigorous especially as the levels of the courses go up. If you do niot feel challenged then join the honors program.",
            "Be sure to get on campus in advance to see where your classes are, try to join the honors program or extracurricular activities to meet students and faculty, ultitize the free gym instead of paying for a gym membership elsewhere.",
            "The school offers a lot but the classrooms need to be renewed. The intergrated sciences complex will be a great addition to the campus. I hope they will get dorms in the future."
        ]
    ],
    "pageTitle": "University of Massachusetts-Boston (UMass Boston) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Massachusetts-Boston/reviews?_escaped_fragment_=/show/21475",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904469087,
    "recordOffset": 904420705,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{255589=© 2015, Cappex.com, LLC, 5195=near the school is a 24 hour bowling alley and the t runs till 12:30 so all the clubs in boston are at your disposal., 175117=The school is very convenient for commuters and people who don't want to dorm. Plenty of events such as concerts with Kendrick Lamar and Far East Movement awhile back. Everyone there is friendly or most of them are at least!, 90477=University of Massachusetts Boston is an excellent diverse campus. It's a great area to live in. I can not wait to attend in the Fall 2012.}",
    "textBeforeTable": "06/22/2010 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 62 Emily Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "What to do for fun near the school is a 24 hour bowling alley and the t runs till 12:30 so all the clubs in boston are at your disposal. Food and Dining the caf has a lot of options and since there is no dorms the grocery store is right down the road in walking distance of the t and the apartments. Dorm Life their are no dorms but the apartments are right next door and they are really nice apartments. they are also in walking distance of the t. Academic Rigor personally i am in the college of liberal arts so my classes are not too rigorous. a lot of my friends are in the college of math and sciences though and they feel like the work while there being a lot of it they don't feel to overwhelmed. Tips for prospective students apply for scholarships even if you don't think you need it, every cent helps. this school doesn't have dorms so the school helps in finding roommates for the apartment complex next door but sometimes that doesn't always work, i'd suggest to meet people at new-student day and room",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}