{
    "relation": [
        [
            "Variable",
            "Analysis Visit ID",
            "Visit Date",
            "Patient Zip",
            "Patient Age",
            "Patient Gender",
            "Chief Complaint",
            "Diagnosis",
            "Syndrome(s)",
            "Facility",
            "Facility Zip",
            "Place",
            "Source"
        ],
        [
            "Format",
            "Alpha-numeric",
            "YYYYMMDD",
            "5-digit numeric",
            "Numeric (years)",
            "Female, male or unknown",
            "Nominal",
            "ICD-9",
            "Nominal",
            "Nominal",
            "5-digit numeric",
            "",
            "Nominal"
        ],
        [
            "Description",
            "BioSense-generated unique visit identifier. Multiple visits on the same day by a single individual are bundled together.",
            "Date of visit",
            "US Postal Service zone improvement plan number of patient",
            "Patient age at time of visit",
            "Patient sex/gender as recorded by facility",
            "Chief complaint text defined by facility",
            "Diagnosis code defined by facility",
            "BioSense/CDC syndrome name",
            "Hospital or clinic name",
            "Clinic/hospital location US Postal Service zone improvement plan number.",
            "Not currently used",
            "Name of BioSense data source"
        ]
    ],
    "pageTitle": "Posts of Community Forum",
    "title": "",
    "url": "https://sites.google.com/site/biosenseredesign/community-forum/posts.xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891772035,
    "recordOffset": 891749084,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7080=Moving forward, we plan on permanently upgrading to TLS only because the vulnerability is a fundamental weakness in the design of SSL.  According to the National Institutes of Standards and Technology (NIST), this is a medium-risk vulnerability that could allow an attacker to intercept PHINMS data that is being sent to BioSense from a SSL-only sender.  See the NIST vulnerability summary at http://web.nvd.nist.gov/view/vuln/detail?vulnId=CVE-2014-3566 for further information and resources., 3071=We are upgrading the BioSense database servers from MySQL version 5.5.38 to version 5.5.40. This is a bug-fix release, so we expect this to be a transparent upgrade. You should not observe any differences when running routine SQL queries via phpMyAdmin or RStudio. If you do have issues with SQL code following the update, please contact the BioSense technical support team at biosenseprogram@cdc.gov.  , 8182=Please ensure that your PHINMS sender will support TLS by November 28th so that the transition goes smoothly.  Our team is available to assist or support your jurisdiction in getting your PHINMS configuration updated.  Please contact the Biosenseprogram@cdc.gov if you need assistance prior to the TLS upgrade planned for November 28, 2014., 37291=Title: Data Processing in BioSense v2.0 Time/Date: Tuesday, July 22, 2014 from 1:00 – 2:00pm EDT Presenter: Mike Alletto, BioSense Redesign Team Description: Presenter Mike Alletto will describe how data are processed and transformed in BioSense v2.0.  His presentation will include a technical overview of how data are extracted from an HL7 message and a review of the binning process. .  At the conclusion of this Webinar, attendees will be able to:}",
    "lastModified": "Wed, 05 Aug 2015 06:36:38 GMT",
    "textBeforeTable": "Data dictionary If line-level sharing is allowed for the data you are viewing, you will see a green box to the right of the timeline “Export Line Level Data.” You can click this button to download a comma-separated values (CSV) file that can be opened in Excel, SAS, Stata, SPSS, R, JMP, or other statistical software. (If you cannot find the file, go to your Documents folders in Windows or your Internet Downloads folder.) Assembling the requested dataset is a resource-intensive process and can take the system up to a few minutes, during which the system will say “Loading…” and display a spinner. The file name will start with “line_level_export_for_xxxxxx.csv”. Because the data in BioSense 2.0 belong to the organizations in which they originate (including hospitals, HIEs, and local and state health departments), the organization defines the level of data sharing. Information-sharing permissions are set at the organization level, which means that epidemiologist-level users in an organization have the same level of access to view data. Organizations can include a single hospital or a network of hospitals, HIEs, local and state health departments. (In addition, one individual at each organization will be designated as the data custodian with the responsibility to set the level of data sharing for organization and to approve new user",
    "textAfterTable": "Common error messages Could not create the export due to error: the database took too long to respond. We were not able to complete the query. You will receive this message if you do not have permission to download line-level information for all the data sources visualized in your query. Only 3 sources of the 12 sources in your original search allow line-level data export. Exported data will not include all of the data you see in the in the Web display. (Click OK to proceed.) You will receive this message if other jurisdictions included in your query do not allow users in your jurisdiction to download their line-level data. You will still be able to download data from those sources to which you have access. Stephen Brown slb7783@gmail.com biosense20line-leveldata 3 https://sites.google.com/feeds/content/site/biosenseredesign/236245277284376755 2014-01-27T18:38:15.416Z 2014-01-27T18:38:15.422Z 2014-01-27T18:38:15.390Z Webinar Announcement: Using Surveillance to Prepare and Respond to Winter Weather: Extreme Cold, Ice, and Snow",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}