{
    "relation": [
        [
            "Timestamp",
            "2009-08-13",
            "2009-08-13",
            "2009-08-13",
            "2008-05-13",
            "2008-05-12",
            "2008-01-27",
            "2008-01-21",
            "2004-07-09",
            "2003-05-08",
            "2003-03-26"
        ],
        [
            "Action",
            "Deleted",
            "Deleted",
            "Added",
            "Added",
            "Deleted",
            "Updated",
            "Added",
            "Updated",
            "Updated",
            "Added"
        ],
        [
            "Category",
            "SYNONYM",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION",
            "SYNONYM",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION"
        ],
        [
            "Detail",
            "proteasome core complex, beta-subunit complex (sensu Eukaryota)",
            "The proteasome core subcomplex that constitutes the two inner rings of the proteasome core complex.",
            "The proteasome core subcomplex that constitutes the two inner rings of the proteasome core complex. An example of this component is found in Mus musculus.",
            "The proteasome core subcomplex that constitutes the two inner rings of the proteasome core complex.",
            "The proteasome core subcomplex that constitutes the two inner rings of the proteasome core complex.",
            "The proteasome core subcomplex that constitutes the two inner rings of the proteasome core complex.",
            "proteasome core complex, beta-subunit complex (sensu Eukaryota)",
            "Refers to the subunits that constitute the inner rings of the proteasome core complex, as in, but not restricted to, the eukaryotes (Eukaryota, ncbi_taxonomy_id:2759).",
            "Refers to the subunits that constitute the inner rings of the proteasome core complex as seen in eukaryotes.",
            "The beta-subunit segment of the 20S core proteosome. The 20S core proteosome is a barrel-shaped structure which consists of four 'rings', two outer, two inner, each containing seven subunits. The beta-subunits form the two inner rings."
        ]
    ],
    "pageTitle": "GO:0019774 proteasome core complex, beta-subunit complex",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0019774",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419318687,
    "recordOffset": 419294153,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129713=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44, 129846=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use}",
    "textBeforeTable": "The use of this term should conform to the following taxon constraints: Taxon Constraints GO:0019774 Wiki Page GONUTS The proteasome core subcomplex that constitutes the two inner rings of the proteasome core complex. An example of this component is found in Mus musculus. PMID:10854779 Definition Cellular Component Ontology proteasome core complex, beta-subunit complex Name GO:0019774 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Search for terms by keyword or ID: Term Basket",
    "textAfterTable": "ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0019774: Relationship To GO:0019774 Child Term Child Term Name Is a GO:0031607 nuclear proteasome core complex, beta-subunit complex Is a GO:0031609 cytosolic proteasome core complex, beta-subunit complex Protein Annotation Display ID Mapping Filter",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}