{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "Orthodox",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "404,341",
            "82,604",
            "46,888",
            "32,501",
            "9,215",
            "4,144",
            "337,136"
        ],
        [
            "Congregations",
            "94",
            "175",
            "242",
            "95",
            "21",
            "27",
            "-"
        ]
    ],
    "pageTitle": "Norwalk, Connecticut (CT 06850) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Norwalk-Connecticut.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362825327,
    "recordOffset": 362682510,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7061=According to our research of Connecticut and other state lists there were 62 registered sex offenders living in Norwalk, Connecticut as of August 03, 2015. The ratio of number of residents in Norwalk to the number of sex offenders is 1,352 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 127471=Norwalk: CALF PASTURE BEACH, JUNE, 2007, 25927=Incorporated on 09/11/1651}",
    "TableContextTimeStampAfterTable": "{61960=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.92. This is about average. Closest monitor was 0.8 miles away from the city center., 79448=2008 Presidential Elections Results, 202758=Total of 797 patent applications in 2008-2015., 78590=1996 Presidential Elections Results, 78876=2000 Presidential Elections Results, 102788=4.37% of this county's 2011 resident taxpayers lived in other counties in 2010 ($105,654 average adjusted gross income), 61192=Particulate Matter (PM10) [µg/m3] level in 2010 was 12.9. This is significantly better than average. Closest monitor was 4.5 miles away from the city center., 16491=On 7/10/1989, a category F4 (max. wind speeds 207-260 mph) tornado 29.9 miles away from the Norwalk city center injured 40 people and caused between $50,000,000 and $500,000,000 in damages., 57623=Air Quality Index (AQI) level in 2012 was 107. This is significantly worse than average., 59008=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 8.53. This is worse than average. Closest monitor was 0.8 miles away from the city center., 105029=4.61% of this county's 2010 resident taxpayers moved to other counties in 2011 ($86,064 average adjusted gross income), 75278=Educational Attainment (%) in 2013, 79162=2004 Presidential Elections Results, 48404=Hotels: Homestead Studio Suites Hotel (400 Main Avenue) (1), Clarion Hotel (789 Connecticut Avenue) (2), Norwalk Hilton Garden Inn (560 Main Avenue) (3), Doubletree Club (789 Connecticut Avenue) (4), Norwalk Inn & Conference Center (99 East Avenue) (5), Marriott Courtyard (474 Main Avenue) (6), Hamar Inn (360 Westport Avenue) (7), Silvermine Tavern (194 Perry Avenue) (8), Norwalk-Westport Motel (344 Westport Avenue) (9). Display/hide their approximate locations on the map, 59740=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.000. This is significantly better than average. Closest monitor was 0.8 miles away from the city center., 16778=On 7/19/1971, a category F2 (max. wind speeds 113-157 mph) tornado 0.8 miles away from the city center caused between $5000 and $50,000 in damages., 60487=Ozone [ppb] level in 2000 was 25.1. This is better than average. Closest monitor was 4.5 miles away from the city center., 80018=Graphs represent county-level data. Detailed 2008 Election Results, 204101=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 75676=School Enrollment by Level of School (%) in 2013, 79734=2012 Presidential Elections Results, 58285=Carbon Monoxide (CO) [ppm] level in 2012 was 0.234. This is better than average. Closest monitor was 0.8 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Norwalk city (based on Fairfield County data) Woodward neighborhood Woods Pond neighborhood Wolfpit neighborhood West Rocks neighborhood West Norwalk neighborhood West Main neighborhood The Green neighborhood Strawberry Hill neighborhood Springwood neighborhood Spring Hill neighborhood South Norwalk (SoNo) neighborhood Silvermine neighborhood Rowayton neighborhood Oak Hills neighborhood Norwalk Center neighborhood Marvin Beach neighborhood Hospital Hill neighborhood Golden Hill neighborhood East Norwalk neighborhood Cranbury neighborhood Brookside neighborhood Broad River neighborhood Norwalk, Connecticut Neighborhood Map) Neighborhoods in Norwalk:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 223 Fairfield County: 2.50 / 10,000 pop. Connecticut: 2.21 / 10,000 pop. Number of supercenters and club stores: 5 This county: 0.06 / 10,000 pop. State: 0.07 / 10,000 pop. Number of convenience stores (no gas): 76 Fairfield County: 0.85 / 10,000 pop. Connecticut: 1.02 / 10,000 pop. Number of convenience stores (with gas): 151 Fairfield County: 1.70 / 10,000 pop. State: 2.27 / 10,000 pop. Number of full-service restaurants: 861 Here: 9.67 / 10,000 pop. State: 9.19 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}