{
    "relation": [
        [
            "",
            "(2)",
            "(1)",
            "(3)",
            "(3)",
            "(3)"
        ],
        [
            "",
            "CHDV 200A",
            "CHDV 200B",
            "CHDV 242",
            "CHDV 247",
            "CHDV 250*"
        ],
        [
            "",
            "Proseminar in Child Development (Admission to Child Development MA program or instructor permission; Corequisite: CHDV 200B)",
            "Analytical Strategies (Admission to Child Development MA program or instructor permission; Corequisite: CHDV 200A)",
            "Theoretical Approaches to Child Development (Graduate standing or instructor permission)",
            "Theoretical and Applied Perspectives on Cross-cultural Development (CHDV 242; graduate standing or instructor permission)",
            "Research Methods (CHDV 200A and CHDV 200B, admission to the MA program or instructor permission)"
        ]
    ],
    "pageTitle": "Child Development - Sacramento State Catalog",
    "title": "",
    "url": "http://catalog.csus.edu/current/programs/chdv.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 36242395,
    "recordOffset": 36217104,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{52854=Topics in United States History 1600-1900 (HIST 17A) OR, 71870=The approved Master's Thesis/Project format guide is the American Psychological Association (APA) - latest edition. Enrollment in CHDV 504 Project/Thesis course or CHDV 505 Culminating Experience: CHDV Exam require that the student file an Intent to Register form at least one full semester in advance of registration in these courses. The Intent to Register form must be signed by the student's faculty sponsor, and is due by March 15 for fall semester enrollment and by October 15 for spring semester enrollment. For students intending to complete a project or thesis, a petition must be approved prior to beginning the project or thesis. The petition requires approval from the thesis/project sponsor and from the Child Development Department Chair. Please see your list of deadlines or consult with a program advisor., 51671=United States History, 1607-1877, 85480=*May be fulfilled by enrollment in the equivalent course offered through another department in the College of Education. However, students are advised to enroll in the Child Development sections if possible., 52035=World Civilizations, Beginnings -1600}",
    "lastModified": "Wed, 10 Dec 2014 23:08:18 GMT",
    "textBeforeTable": "A. Required Foundation Courses (12 units) Courses in parentheses are prerequisites. Units required for Major: 49-50 Minimum total units required for BA: 120 Requirements - Bachelor of Arts Degree - Child Development: Concentration - Early Development, Care, and Education (EDCE) In addition, the program has at its disposal an excellent selection of books and journals in the Library and many films, video and audio tapes, and other media to implement and support instruction. Students are given opportunities to observe and participate with children in a variety of settings in the community and on campus. Please contact the Department office for information about the service-learning, cooperative education, and other field-based experiences available. The quality of instruction and the varying educational and professional backgrounds of the faculty provide a program which meets the diverse demands of the many career options available in this field. The University's location in the State's capital city provides a variety of unique fieldwork, internship, cooperative learning, and part-time employment opportunities. Special Features Note: Child Development students should check the department Web site (http://edweb.csus.edu/chdv/) for updates to degree requirements and current issues related to child development. To plan for a timely graduation, students should meet with an advisor each semester. Students who wish to pursue an elementary school (multiple subjects) teaching credential should make an appointment with a child development faculty advisor in the Center for Teaching Majors",
    "textAfterTable": "(3) CHDV 131 Language Development (CHDV 133; CHDV 133 may be taken concurrently) (3) CHDV 132 Fieldwork in Child Development (CHDV 30 or CHDV 35 and CHDV 123; CHDV 123 may be taken concurrently; for CHDV-Integrated, CHDV-Pre-credential, or Liberal Studies majors only CHDV 35F) (3) CHDV 135 Crosscultural Child Development (CHDV 133; CHDV 133 may be taken concurrently) (3) CHDV 136 Developmental Experiences, Methods and Curriculum (Junior standing; CHDV 30 or CHDV 35 and CHDV 123; CHDV 123 may be taken concurrently) OR   COMS/ FACS 108 Family Communication (COMS 8, FACS 50, SOC 166, or instructor permission) (3) CHDV 137* Cognitive Development (CHDV 133; Corequisite: CHDV 137L) (1) CHDV 137L* Cognitive Development Research Lab ( CHDV 133; Corequisite; CHDV 137) (3) CHDV",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}