{
    "relation": [
        [
            "#",
            "1",
            "2",
            "3"
        ],
        [
            "Группа A",
            "mTw.dk",
            "munkka",
            "Diagnos"
        ],
        [
            "Игры",
            "2",
            "2",
            "2"
        ],
        [
            "Очки",
            "6",
            "3",
            "0"
        ]
    ],
    "pageTitle": "CYBERFIGHT.RU / Новости / Dreamhack Winter: Na`Vi заканчивают год непобеждёнными!!!!!!! @ Cyberfight.ru",
    "title": "",
    "url": "http://cyberfight.ru/site/news/72794/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62015087,
    "recordOffset": 61989303,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13744=Сегодня в Йёнчёпинге, в месте под названием «Эльмиа» стартует последний европейский ивент в 2010 (если говорить о крупных соревнованиях). Всё готово к началу Dreamhack Winter и его титульной дисциплине — Counter Strike 1.6 Championship. Соревнования традиционно стартуют с группового этапа, причём в первый день сыграют группы «C-F». Уже в 19:00 по московскому времени свою дебютную встречу проведут действующие чемпионы мира NaVi. Команда сыграет с норвежцами Alchemists, а ещё через час — с бельгийцами Antwerp Aces., 15016=[ Горячая линия ] [ Обновление / Воскресенье / 02:09 ] — Всё!!!!!!!! ПОБЕДА!!!!!!!!!!!!!! Na`Vi — победители Dremahack Winter 2010 и заканчивают год непобеждёнными! Брависсимо!!! Красава, парни!!!!!!!!!!! [ Обновление / Воскресенье / 02:09 ] — NAVI в одном раунде от победы!!!!!!! Крутится в своём кресле ceh9!! [ Обновление / Воскресенье / 02:03 ] — 12:10 в пользу NaVi. [ Обновление / Воскресенье / 01:44 ] — 8:7!!! Атака за НаВи, а это уже серьёзная заявка на победу!!! [ Обновление / Воскресенье / 01:27 ] — 5:5 уже, выровнялась игра! Очень важные раунды берут за Т-сторону НаВи. [ Обновление / Воскресенье / 01:27 ] — 5:1, размочили наши! [ Обновление / Воскресенье / 01:21 ] — На train'е NaVi за атаку начинают. Первый раунд остался за соперником. [ Обновление / Воскресенье / 01:07 ] — В одни ворота прошла вторая сторона. 16:6 — итоговый счёт, и впереди de_train. [ Обновление / Воскресенье / 01:00 ] — 13:6, Na`Vi уверенно ведут игру. Между тем, пауза возникла в игре. У зоника с компом снова что-то не то. Подбежал админ, потом ещё один, не кстати эта пауза, ой как не кстати. Только поймали свою игру украинцы... [ Обновление / Воскресенье / 00:47 ] — 9:6 заканчивается сторона в пользу NaVi. Успех starix раздефьюзить бомбу в сложнейшем для команды раунде. [ Обновление / Воскресенье / 00:24 ] — Обалдеть... Na`Vi выиграли пистолетки, однако следующий раунд остался за датчанами. Ну нельзя же так... [ Обновление / Воскресенье / 00:22 ] — Понеслась!!! NAVI — защита, mTw — атакуют. [ Обновление / Воскресенье / 00:13 ] — Кому интересно, стрим отличного качества (правда на шведском). [ Обновление / Воскресенье / 00:13 ] — Игроки появились на сцене. Сейчас всё начнётся!!! [ Обновление / Воскресенье / 00:12 ] — Чёркание карт состоялось: 1) inferno, 2) train и в случае необходимости 3) tuscan.  [ Обновление / Суббота / 23:52 ] — Финал задерживается по техническим причинам. Какие-то неполадки с компами выявились... [ Обновление / Суббота / 23:48 ] — Lions — бронзовые призёры Dreamhack'а. На десерт — финал. NAVI vs MTW. [ Обновление / Суббота / 22:55 ] — Появился HLTV-адрес финального мачта между NaVi и mTw.dk. Проследить за ходом событий можно будет на hltv1.verygames.net:27050. [ Обновление / Суббота / 21:57 ] — Виктор «TaZ» Войтас более сдержан в своих высказываниях и считает, что NaVi не является непобедимой машиной, как их тут расписали после побед над FX и fnatic. «NaVi не остановить? Не думаю. На de_train мы отдали слишком раундов, за CT-сторону мы сыграли одну из наших худших игр. На dust2 мы проиграли нашу лучшую карту. Конечно, они переиграли нас на дасте, но на трейне мы отдавали слишком много ненужных раундов. Не думаю, что они неудержимы, но играют они сейчас действительно здорово». [ Обновление / Суббота / 21:54 ] — Егор «markeloff» Маркелов в интервью HLTV.org признался, что всегда мечтал сыграть на сцене Dreamhack`а: «Я всегда мечтал сыграть на сцене Dreamhack'а. Я был здесь три раза (это третий раз), и все предыдущие разы завершал соревнования в четвертьфинале. Всегда приходилось сидеть у сцены и думать, как же я хочу сыграть в этом финале». Что ж, Марик, теперь твоя мечта осуществилась! [ Обновление / Суббота / 21:53 ] — Только что mTw.dk в финале EPS Nordic обыграл шведов Lions и стал трёхкратным чемпионом Скандинавии. А это означает то, что шведы готовы начать встречу за бронзу Dreamhack Winter, где им будут противостоять экс-чемпионы мира Frag eXecutprs. HLTV встречи: hltv1.verygames.net:27051. [ Обновление / Суббота / 17:55 ] — Через час, стоит напомнить, начнётся финал EPS Nordic, где в матче между mTw.dk и Lions определяет победитель третьего сезона. У датчан есть уникальный шанс выиграть третье золото EPS Nordic кряду, у Lions — возможность отыграться за поражение в полуфинале Dreamhack Winter. [ Обновление / Суббота / 17:54 ] — По информации на данную минуту, матч за бронзу начнётся в 21:00 по Москве. В свою очередь, матч за золото Dreamhack Winter 2010 CS 1.6 Championship начнётся в 23:00. [ Обновление / Суббота / 17:40 ] — NaVi громт оппонента на dust2 и выход в финал Dreamhack'а!!!!!!!!!!! Угадайте, с кем они там сыграют? Прямо в яблочко, римейк финала WCG 2010 неминуем!!!!!!!!!! NAVI AGAINST MTW! [ Обновление / Суббота / 16:48 ] — NaVi выцарапывает первую победу на овертайме и делает большую заявку на выход в финал соревнований. Как видите, в полуфинале пока повторяется история WCG 2010. Более того, на данную минуту велика вероятность того, что золото разыграют финалисты WCG: NaVi и mTw.dk. Датчане также выиграли первую карту полуфинала. Ладно, не будем спешить, смотрим вторые матчи! [ Обновление / Суббота / 15:20 ] — Команда NaVi добралась до полуфинала турнира и сразится за выход в финал с поляками из FX. [ Обновление / Суббота / 01:03 ] — Второй день Dreamhack Winter CS 1.6 Championship практически завершён. Продолжается игра между SK и Millenoum, впрочем вряд ли здесь случится сенсация, и выход шведов в 1/4 финала — это скорее вопрос времени. Не пропустите завтра: NaVi против fnatic! Уже в 11 утра! [ Обновление / Пятница / 22:31 ] — Вслед за NaVi и fnatic в 1/4 пробились mTw.dk и x6tence. Через полчаса начнут свои BO3 четыре другие пары. Отметим, что игры стадии 1/4 финала состоятся завтра утром по Москве. [ Обновление / Пятница / 21:58 ] — Итак, это официально: fnatic обыгрывает RAGE на двух картах и в 1/4 выходит на NaVi! ARE YOU READY? Впрочем, не будем торопить события. Для начала fnatic предстоит сыграть ещё разок с RAGE: на этот раз в матче за третье место EPS Nordic. Встреча, к слову, начнётся уже через полчаса. [ Обновление / Пятница / 21:22 ] — NaVi вышли в 1/4 финала. Присутствовали нервы на первой карте, однако затем всё встало на свои места. Всё идёт к тому, что NaVi и fnatic встретятся в четвертьфинале. [ Обновление / Пятница / 19:35 ] — Стартовала первая игра плей-офф, и первыми доверили начать действующим чемпионам мира NaVi. Команда проводит свою первую встречу с puta на de_train. HLTV игры: hltv1.verygames.net:27052. [ Обновление / Пятница / 19:14 ] — А в это время по-настоящему эпический матч выдают fnatic и mTw.dk в полуфинале EPS Nordic. Команды сыграли шесть овертаймов, и вторая карта завершилась со счётом 36:33 в пользу датчан!!!!!!!!! Звание победителя третьего сезона разыграют mTw.dk и Lions. В матче за бронзу сойдутся fnatic и RAGE. [ Обновление / Пятница / 19:13 ] — Везде, за исключением группы B, определены участники дальнейшей стадии. Украинцы NaVi в первом туре плей-офф сыграют с датчанами puta. Победитель этой пары выходит на победителя fnatic - RAGE. [ Обновление / Пятница / 12:24 ] — К слову, уже определены последние участники, которые, напомним, добывали квоты через BYOC-турнир. Это шведские коллективы Diagnos, Gamingplace и iShop, а также голландцы KaoS. [ Обновление / Пятница / 12:22 ] — Продолжаются игры группового этапа Dreamhack Winter CS 1.6 Championship. По итогам первой посадки участие в плей-офф обеспечили следующие коллективы: x6tence, puta, NaVi, Alchemists, fnatic, .no, Lions и RAGE-Gaming. А вот вторая посадка стартует с небольшой задержкой. Надеемся, что дело не затянется на несколько часов. [ Обновление / Пятница / 01:42 ] — И вновь не получилось интриги в противостоянии между RAGE и Lions. Lions оказались ощутимо сильнее, для них это уже третья победа над одним из главных конкурентов за сегодня. [ Обновление / Пятница / 01:20 ] — Как видим, NaVi потребовалось минимум усилий, чтобы преодолеть групповой барьер Dreamhack Winter. Уверенная поступь украинцев, надеемся в плей-офф они продолжат в том же духе!}",
    "textBeforeTable": "[ Групповой этап ] Electronic Sahara [ 2:0 ] munkka ( 16:6 @ nuke / 16:4 @ inferno ) SK [ 2:0 ] Millenium ( 16:8 @ nuke / 16:10 @ inferno ) Lions [ 2:0 ] .no ( 16:11 @ tuscan / 16:11 @ inferno ) Frag eXecutors [ 2:0 ] Hardwarearena ( 16:2 @ nuke / 16:1 @ tuscan ) Natus Vincere [ 2:0 ] puta ( 16:14 @ train / 16:2 @ dust2 ) fnatic [ 2:0 ] RAGE-Gaming ( 16:9 @ train / 16:3 @ nuke ) x6tence [ 2:0 ]",
    "textAfterTable": "#  Группа D Игры Очки 1  Natus Vincere 2 6 2  Alchemists 2 1 3  Antwerp Aces 2 1 Natus Vincere [ 16:4 ] Alchemists @ de_mirage  Natus Vincere [ 16:3 ] Antwerp Aces @ dust2 Antwerp Aces [ 15:15 ] Alchemists @ train #  Группа E",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}