{
    "relation": [
        [
            "Release",
            "Cisco IOS XE 3.2SE",
            "Cisco IOS XE 3.2SE",
            "Cisco IOS XE 3.2SE",
            "Cisco IOS XE 3.2SE"
        ],
        [
            "Modification",
            "Switch Port Analyzer (SPAN): Allows monitoring of controller traffic on a port or VLAN using a sniffer/analyzer or RMON probe. This feature was introduced.",
            "Flow-based Switch Port Analyzer (SPAN): Provides a method to capture only required data between end hosts by using specified filters. The filters are defined in terms of access lists that limit IPv4, IPv6 or IPv4 + IPv6, or non-IP traffic (MAC) between specified source and destination addresses. This feature was introduced.",
            "SPAN destination port support on EtherChannels: Provides the ability to configure a SPAN destination port on an EtherChannel. This feature was introduced.",
            "Switch Port Analyzer (SPAN) - distributed egress SPAN: Provides distributed egress SPAN functionality onto line cards in conjunction with ingress SPAN already been distributed to line cards. By distributing egress SPAN functionalities onto line cards, the performance of the system is improved. This feature was introduced."
        ]
    ],
    "pageTitle": "Consolidated Platform Configuration Guide, Cisco IOS XE Release 3.3SE (Cisco WLC 5700 Series) - Configuring SPAN and RSPAN [Cisco 5700 Series Wireless LAN Controllers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/wireless/controller/5700/software/release/3se/consolidated_guide/configuration_guide/b_multi_3se_5700_cg/b_multi_3se_5700_cg_chapter_01110001.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363830403,
    "recordOffset": 363777896,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{92999=For VLANs 1 to 1005 that are visible to VLAN Trunking Protocol (VTP), the VLAN ID and its associated RSPAN characteristic are propagated by VTP. If you assign an RSPAN VLAN ID in the extended VLAN range (1006 to 4094), you must manually configure all intermediate controllers.}",
    "textBeforeTable": "Default SPAN and RSPAN Configuration IPv4 and MAC FSPAN ACLs are supported on all feature sets. IPv6 FSPAN ACLs are supported only in the advanced IP Services feature set. When an empty FSPAN ACL is attached, some hardware functions copy all traffic to the SPAN destination ports for that ACL. If sufficient hardware resources are not available, even an empty FSPAN ACL can be unloaded. If a VLAN-based FSPAN session configured on a stack cannot fit in the hardware memory on one or more controllers, it is treated as unloaded on those controllers, and traffic meant for the FSPAN ACL and sourcing on that controller is not copied to the SPAN destination ports. The FSPAN ACL continues to be correctly applied, and traffic is copied to the SPAN destination ports on the controllers where the FSPAN ACL fits in the hardware memory. The security ACLs have higher priority than the FSPAN ACLs on a controller. If FSPAN ACLs are applied, and you later add more security ACLs that cannot fit in the hardware memory, the FSPAN ACLs that you applied are removed from memory to allow space for the security ACLs. A system message notifies you of this action, which is called unloading. When there is again space for the FSPAN ACLs to reside in memory, they are added to the hardware",
    "textAfterTable": "Encapsulation type (destination port) Native form (untagged packets). Ingress forwarding (destination port) Disabled. VLAN filtering On a trunk interface used as a source port, all VLANs are monitored. RSPAN VLANs None configured. Configuration Guidelines SPAN Configuration Guidelines To remove a source or destination port or VLAN from the SPAN session, use the no monitor session session_number source { interface interface-id | vlan vlan-id} global configuration command or the no monitor session session_number destination interface interface-id global configuration command. For destination interfaces, the encapsulation options are ignored with the no",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}