{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always felt safe.",
            "Those who want personal attention. Everyone wants to help.",
            "Second year student. Love it. It is perfect for me. I wanted small class size, personal attention, and red brick buildings covered with ivy.",
            "Band, choir, sports events and a short hike (1 mile) to shopping and restaurants. Car helps but bus system is great.",
            "I have an apartment so I do most of my own cooking but I do love the coffee shop in the library.",
            "Love my apartment!",
            "Yikes! Not that bad but keep up with it.",
            "Get to know the professors. They want to help. Same with staff. Everyone is there to help.",
            "Great help with getting needed courses to graduate. Music program is tops. Everyone is helpful and you will find that this school is a good investment."
        ]
    ],
    "pageTitle": "Concordia University-Portland Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Concordia-University-Portland/reviews?_escaped_fragment_=/show/46765",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896006107,
    "recordOffset": 895961863,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{77910=Each October, Concordia has an event specifically for high school students who are considering going to this campus. What makes this unsual is that the kids get to sleep in the dorms overnight and that an improv-show come to the campus and does a hilarious show for the students., 206039=© 2015, Cappex.com, LLC, 17971=Coming from California the transition from state to state was rough, but Concordia really helped me become involved not only in the school and my community but it also allowed me to quickly get comfortable with the city. Concordia is a small school (roughly 2500-3000 students) so getting to know people was incredibly easy! Though it rains a lot that never stops me or anyone i know from having a great time. Concordia is located in between PSU, UP, PCC, and several other schools within a 25 mile radius so new people are always around and coming up to the school whether it be for sporting events or just to visit. Also the school is a 5-10 minute drive from downtown so even though the school itself is in the suburbs entertainment is never far, plus the school always has discounted events (everything from Halloween Corn Mazes to Portland Trailblazer games) going on with free transportation provided!, 139413=The food is very good, and they strive to make it as healthy and organic as possible. There are multiple places on campus to get food or drinks including the C-store, the dining hall, and Cafe 1905, the coffee shop., 6109=I think this school is great for people who love having a smaller community and truly getting to know your teachers and classmates throughout your whole college experience. This school was just ranked in 2010 as the number one university out of the nation for it's community service! There are many opportunities to give back and this school shows that!}",
    "textBeforeTable": "06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 8 out of 8 people found this review useful. 1 of 52 Megan from Lafayette, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Am learning a lot The professors are always willing to help, and they make lessons understandable so that its easier for students to memorize what they learn that day. Some professors even extend deadlines of assignments that I have had trouble with or need more time working on. Login to rate or flag the reviews Jennifer from Beaverton, OR 10/14/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 52 Categories Comments Great for these types of students I think this school is great for people who love having a smaller community and truly getting to know your teachers and classmates throughout your whole college experience. This school was just ranked in 2010 as the number one university out of the nation for it's community service! There are many opportunities to give back and this school shows that! Tips for prospective students Don't base your future school off of where your boyfriend/girlfriend is going, you'll make friends at",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}