{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I find that the instructors pray before each class and that helps me to become centered before class starts.",
            "There are lots of activities to do for the younger students.",
            "I eat at home.",
            "I live at home.",
            "It is fast paced but worth it totally.",
            "Just to use the help the the staff has available to you",
            "I have found the focus program for adults works for me. I only attend once a week but with my schedule it works great. The staff is truly understanding and helpful."
        ]
    ],
    "pageTitle": "University of Northwestern- St. Paul Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-NorthwesternSt-Paul/reviews?_escaped_fragment_=/show/101720",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889921835,
    "recordOffset": 889866319,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{247734=© 2015, Cappex.com, LLC, 35961=We have a brand new dining facility as of Fall 2011, and it's amazing! There are tons of options for every meal. There is always some sort of meat/potato, pasta dish, burgers, and make your own sub sandwiches. It's delicious!}",
    "textBeforeTable": "12/25/2009 Reviewer is A current student here. 17 out of 17 people found this review useful. 1 of 53 Hannah from St. Paul, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Categories Comments Great for these types of students Northwestern is great for any students that knows that continuing their education is extremely important in finding a secure job. It is also a wonderful place to start a relationship with the Lord, or continue to feed one that has already been started, perhaps for many years prior. Northwestern also has some rules that are important for the students to follow. A prospective students should expect some code of conduct that is expected of the students at Northwestern. These rules are not enforced for the school's benefit, but rather for the student's benefit, therefore, the rules become foundations for a better future. Any student looking to grow immensely in the Lord along with continuing their education for the future would thrive at Northwestern College. Tips for prospective students I was looking for a college that not only would challenge me academically and help me find a career that would fit, but also one that would challenge me spiritually and help me grow in my relationship with the Lord. Northwestern was a perfect fit. Here, I am daily challenged in my walk with the Lord as well as my career path. Although times are tough and earning money is becoming more and more difficult, I think it is of the highest importance to consider Northwestern not only as a key to finding a good",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}