{
    "relation": [
        [
            "Outsourcer name",
            "Into English LLC",
            "Webdunia",
            "PTS Group International Company Limited / PTSGI / Formerly known as President Translation Service Group International / ATS",
            "CSOFT / L10N / CSOFTINTL"
        ],
        [
            "Country",
            "United Kingdom",
            "India",
            "Taiwan",
            "China"
        ],
        [
            "LWA",
            "1",
            "5",
            "5",
            "5"
        ],
        [
            "Comment",
            "Hidden",
            "Hidden",
            "Hidden",
            "Hidden"
        ],
        [
            "Outsourcer feedback",
            "...",
            "...",
            "...",
            "..."
        ]
    ],
    "pageTitle": "English to Malay translator specializing in computer technology, information technology, website localization, online games, telecommunication and user manual for handphone, smartphone, smart phone, electrical appliances",
    "title": "",
    "url": "http://www.proz.com/translator/1132868",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 653379345,
    "recordOffset": 653362951,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Access to Blue Board comments is restricted for non-members. Click the outsourcer name to view the Blue Board record and see options for gaining access to this information. 4 entries Blue Board entries made by this user  Less More Certificates, Diplomas, Licenses, CVs Other Internet, e-Commerce General / Conversation / Greetings / Letters Also works in: Telecom(munications) Media / Multimedia IT (Information Technology) Computers: Systems, Networks Games / Video Games / Gaming / Casino Computers (general) Computers: Hardware Computers: Software Specializes in: Expertise Translation, Editing/proofreading, Website localization, Software localization Services",
    "textAfterTable": "More Less Payment methods accepted Wire transfer Portfolio Sample translations submitted: 2 English to Malay: Telecommunications industry Source text - English The telecommunications industry is responsible for radio, television, voice communications, and broadband services. The growth and innovation of the telecom industry has enabled people to communicate across the globe and access endless amounts of information over the internet. Broadband services are becoming faster and easier to access with fiber optic networks and wireless services. Many of the major telecom companies have merged over the last 10 years in order to offer massive product and service portfolios. These new technologies and growth through mergers are enabling these companies to find new revenue sources and growth opportunities in a mostly mature market. Translation - Malay Industri telekomunikasi bertanggungjawab ke atas perkhidmatan radio, televisyen, komunikasi suara dan jalur lebar. Pertumbuhan dan inovasi industri telekom membolehkan orang ramai berkomunikasi merentasi dunia dan mengakses maklumat tanpa had melalui internet. Perkhidmatan jalur lebar telah menjadi lebih pantas dan lebih mudah untuk diakses dengan adanya rangkaian gentian optik",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}