{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "When Teenage Meets Old Age",
            "World News Australia",
            "2013 Australian Open",
            "Survivor: Philippines",
            "Golden"
        ],
        [
            "Time",
            "10:41 pm - 11:43 pm",
            "10:30 pm - 11 pm",
            "7 pm - 12:30 am",
            "10:30 pm - 11:30 pm",
            "10:30 pm - 11 pm"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/pm/2013/01/15/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 711959719,
    "recordOffset": 711887159,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{18487=Season two starts here. In 1950, the world is caught off guard as North Korea launches a massive armoured assault into South Korea. This is the story of the American tankers who rush to the aid of the South and the bloody battles they fight up and down the Korean Peninsula., 5265=PETER KER Rio Tinto produces a record 250 million tonnes of iron ore in 2012, but fails to meet its annual target for copper.}",
    "TableContextTimeStampAfterTable": "{240776=Poll closed 15 Jan, 2013, 102596=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 126215=February 9 This year delivers an eclectic international line-up that concert lovers have come to expect., 190598=On stage at the 2013 Golden Globe Awards., 264639=January 14 2013, 125288=February 8 This year's program will explode across all art forms., 31662=Kaspersky reveals sophisticated campaign in operation since 2007., 252460=AM, Jan 15, 2013, 9:33PM, 127327=March 23 & 24 The third wave of artists have been added including Jason Mraz., 173138=Images of Marilyn shot by a 15-yr-old boy in 1955 gets new life., 232185=Perth sweats through hottest night since 1989, 22858=SALVADOR RODRIGUEZ If you just bought a new iPad, you won't be happy to learn that Apple may be coming out with new models as early as March., 79753=A special presentation of stories from the devastating 2003 bushfires., 251498=New manager, Jan 15, 2013, 9:43PM}",
    "textBeforeTable": "12am 11:30pm 11pm 10:30pm 10pm 9:30pm Skip to: It's week two for the six Australian actors trying to catch a break in Hollywood. Next Stop Hollywood What's on TV Tonight The Brisbane Powerhouse could be your ticket to France. Win an art adventure in Paris One of Disney.Pixar’s most beloved films ever returns to the big screen. Win 'Monsters, Inc' prize packs Competition Good advice - take it from us. Gathering of the minds Opinion Our tips for who you'll be reading about this year.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Myf Warhurst's Nice 10 pm - 10:30 pm SBS ONE Queensland Coppers 9:30 pm - 10:30 pm Channel Seven Brisbane 2013 Australian Open 7 pm - 11:30 pm Channel Nine Brisbane Two and a Half Men 10 pm - 10:30 pm Network TEN Brisbane NCIS: Los Angeles 9:30 pm - 10:30 pm Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD When Teenage Meets Old Age 10:41 pm - 11:43 pm SBS ONE Queensland World News Australia 10:30 pm - 11 pm Channel Seven Brisbane 2013 Australian Open 7 pm - 11:30 pm",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}