{
    "relation": [
        [
            "Aggie Player",
            "Jelly Woodman",
            "Jorvorskie Lane",
            "Preston Smith",
            "Jorvorskie Lane",
            "Jorvorskie Lane",
            "Leeland McElroy",
            "Uzoma Nwachukwu"
        ],
        [
            "Date",
            "Oct. 16, 1926",
            "Sept. 8, 2007",
            "Sept. 22, 1945",
            "Oct. 20, 2007",
            "Sept. 9, 2006",
            "Sept. 16, 1995",
            "Sept. 19, 2009"
        ],
        [
            "Opponents",
            "New Mexico",
            "Fresno State",
            "Ellington Field",
            "Nebraska",
            "Louisiana-Lafayette",
            "Tulsa",
            "Utah State"
        ],
        [
            "Touchdowns",
            "7 (SWC Record)",
            "4",
            "4",
            "4",
            "4",
            "4",
            "4"
        ],
        [
            "Points",
            "44 (SWC Record)",
            "26",
            "25",
            "24",
            "24",
            "24",
            "24"
        ]
    ],
    "pageTitle": "BulldogBlitz.com - Sunday Rewind: Texas A&M 38, Utah State 30",
    "title": "",
    "url": "https://mississippistate.rivals.com/content.asp?CID=990999",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877389262,
    "recordOffset": 877372868,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1936=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 BulldogBlitz.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40108=September 20, 2009}",
    "textBeforeTable": "Although Nwachukwu's mark is an all-time high for an A&M freshman, it's good enough for a six-way tie in second amongst all-time Aggie games in scoring. Leelane McElroy's 17-year old record when he scored four touchdowns in A&M's 38-30 win over Utah State. By the way, Nwachukwu only touched the ball four times. Uzoma Nwachukwu had the best day in the history of A&M freshmen when it comes to touchdowns Saturday. He broke Texas A&M true freshman receiver Two-minute drill Texas A&M 38, Utah State 30: Jerrod Johnson - 21-41-0-322, 4 TD passing; 11-78 rushing...Uzoma Nwachukwu - 3-101, 3 TD receiving; 1-39, TD rushing\u0085Christine Michael - 17-94 rushing; 2-26 receiving\u0085Von Miller - 6 tackles, 3 sacks, 1 forced fumble...Kyle Mangan - 11 tackles, 1 PBU ... A&M offense - 573 yards, 251 yards rushing, 322 yards passing. The Sunday Rewind is a weekly collection of notes and quotes from the Texas A&M football game of the weekend. September 20, 2009",
    "textAfterTable": "By the numbers A look at a few numbers from A&M's 38-30 win over Utah State. 4A&M true freshman receiver Uzoma Nwachukwu scored four touchdowns on four touches Saturday, three through the air and one on a 39-yard reverse. It broke the freshman record that was previously held by Leeland McElroy who had three in against Missouri on the same date in 1992. 3 Nwachukwu's three receiving touchdowns matched the school record for receiving touchdowns in a game, which is shared by three players. Chris Cole was the last to do it in 1998 against North Texas. 300A&M junior quarterback Jerrod Johnson threw for 322 yards Saturday, which is the fourth 300-yard effort of his career. Johnson is the first Aggie to ever achieve the 300-yard mark four times. He's also just the second to do it in back-to-back games, joining Reggie McNeal who did it against SMU and Texas State in 2005. 400Johnson finished with 400 yards of total offense. He had 406 against New Mexico, putting him into the 400-yard club in back-to-back game with just one other Aggie players - Reggie McNeal - who did it against SMU and Texas State in 2005.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}