{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "I have never experienced any danger on this campus",
            "Students who like the outdoors/nature",
            "For only about $550 per semester, this is a great school to get GE classes and prerequisites out of the way before transferring.",
            "There is a cafeteria with a somewhat limited selection of decent but average food.",
            "I did not stay in the dorms",
            "Many of the instructors also teach classes at the nearby University, so they have impressive credentials. Overall this school offers a good education for a community college.",
            "The classes are small and involved, with about 30 students per 1 teacher, which makes a good learning environment. The administration offers relatively poor service. The prices are reasonable, which is good on a budget."
        ]
    ],
    "pageTitle": "College of the Redwoods Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-the-Redwoods/reviews?_escaped_fragment_=/show/15964",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903219059,
    "recordOffset": 903191114,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75303=One of the biggest and craziest traditions i have seen so far on campus is the 420 event witch is where on April twentieth at the time 4:20 pm people who smoke go outside and blow a huge smoke cloud in the air that covers the Humboldt county., 103323=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/23/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 25 Josie from Alderpoint, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Comments Tips for prospective students Check teachers on ratemyprofessor.com. Although I said that there are good teachers, there are still a couple that do not completely have everything together yet and make it rather difficult at times. Bang for the buck Fairly inexpensive and offers a B.O.G. waiver which waves all tuition. Also, a program called E.O.P.S. provides book vouchers for those who qualify. Am enjoying being here Beautiful campus. Am learning a lot Many of the professors are very helpful and knowledgeable. Login to rate or flag the reviews Reaia from Arcata, CA 07/07/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 25 Categories Comments Campus Safety Sometimes there are mountain lion sightings on campus at night. There",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}