{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Out",
            "Out",
            "Single",
            "Out"
        ],
        [
            "Play",
            "Todd Coffey starts the inning for the Brewers.",
            "Scott Rolen flied out to left. None on with one out and Laynce Nix due up.",
            "Laynce Nix struck out swinging. None on with two outs and Darnell McDonald due up.",
            "Darnell McDonald singled to short. Runner on first with two outs and Corky Miller due up.",
            "Corky Miller struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Tuesday, August 25, 2009 Cincinnati Reds - Milwaukee Brewers Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Reds_Brewers/2009/08/25",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 56558362,
    "recordOffset": 56542747,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2343=View all MLB box scores for 8/25/2009}",
    "TableContextTimeStampAfterTable": "{50765=Jeff Suppan, who was activated from the DL before the game, lasted 4 1/3 frames, giving up four runs on nine hits with five walks. Suppan, who was sidelined with a strained oblique, pitched his first game since getting rocked by Washington on July 27, when he allowed 10 runs and 10 hits in 5 1/3 innings of a 14-6 setback.}",
    "textBeforeTable": "Top of the 1st Angel Campos  3B Derryl Cousins  2B Bill Miller  1B Jim Joyce  H Umpires 2.66 28 46 3 0 2 2 3 3 Todd Coffey (L, 4-3) 1.89 10 10 0 0 0 0 1 1 Trevor Hoffman  6.28 13 22 0 1 0 0 2 1 Chris Narveson  6.04 8 11 1 0 0 0 0 1 Mike Burns  6.10 19 25 4 0 2 2 2 2 Carlos Villanueva  3.40 2 3 0 0 0 0 0 0.2 Mark DiFelice  5.38 50 90 1 5 4 4 9 4.1 Jeff Suppan  ERA Strikes Pitches SO BB ER R H IP Name 2.63 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Brewers pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/brewers_22t.png 21 28 0 0 0 0 1 2 Daniel Ray Herrera (W, 2-4) 3.02 16 21 1 0 0 0 0 2 Carlos Fisher  2.17 8 12 0 0 0 0 3 0.2 Francisco Cordero (BS, 2) 2.76 2 7 0 1 2 2 1 0 Arthur Rhodes  5.48 11 21 1 1 2 3 1 0.1 Jared Burton  2.73 7 10 1 0 0 0 0 1 Nick Masset ",
    "textAfterTable": "Play Type Play Single Felipe Lopez singled to left. Runner on first with none out and Craig Counsell due up. Single Craig Counsell infield single to short. Runners on first and second with none out and Ryan Braun due up. Out Ryan Braun lined into a double play, short to second. Runner on first with two outs and Prince Fielder due up. Out Prince Fielder grounded out short to first to end the inning. Top of the 2nd Play Type Play Double Scott Rolen doubled to left. Runner on second with none out and Laynce Nix due up. Out Laynce Nix lined out to right. Runner on third with one out and Jonny Gomes due up. Walk Jonny Gomes walked. Runners on first and third with one out and Corky Miller due up. Single Corky Miller single to right scored Scott Rolen with one out. Runners on first and second and Bronson Arroyo due up. Out Bronson Arroyo sacrifice bunt to the pitcher. Runners on second and third with two outs and Drew Stubbs due up. Walk Drew Stubbs walked. Bases loaded with two outs and Paul Janish due up. Out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}