{
    "relation": [
        [
            "Duty Role",
            "Administration Link View Duty",
            "Application Deployment Administration Duty",
            "Application Implementation Management Duty",
            "Application Registration Duty",
            "BI Applications Administrator Duty",
            "Functional Setup Objects Provider Duty",
            "Functional Setups UI Customization Duty",
            "Logical Entity Modeling Duty",
            "Setup Data Export Duty",
            "Setup Data Import Duty",
            "Setup Export and Import Monitoring Duty"
        ],
        [
            "Description",
            "Provides access to the Administration Link on the UI Shell.",
            "Manages application instance configurations and enterprise applications.",
            "Manages implementation projects. Also responsible for assigning task owners, but does not perform setup tasks.",
            "Maintains application metadata such as provisioning configurations, enterprise applications, domains, and application components such as pillars, environment types, module types, and middleware components.",
            "Duty Role to administer and manage Business Intelligence Applications. This Duty Role provides access to the BI Applications Configuration Manager and to the BI Data Warehouse Administration Console.",
            "Maintains setup metadata such as offerings, options, features, setup tasks and task lists.",
            "Allows customization of functional setups UI",
            "Manages business objects and related services.",
            "Manages the setup data export process.",
            "Manages the setup data import process.",
            "Manages configuration packages and the setup data export and import process."
        ]
    ],
    "pageTitle": "Security Reference Manual",
    "title": "",
    "url": "http://docs.oracle.com/cd/E37017_01/fusionapps.1115/e23023/toc.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73303663,
    "recordOffset": 73237482,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{16405=Programs, software, databases, and related documentation and technical data delivered to U.S. Government customers are \"commercial computer software\" or \"commercial technical data\" pursuant to the applicable Federal Acquisition Regulation and agency-specific supplemental regulations. As such, the use, duplication, disclosure, modification, and adaptation shall be subject to the restrictions and license terms set forth in the applicable Government contract, and, to the extent applicable by the terms of the Government contract, the additional rights set forth in FAR 52.227-19, Commercial Computer Software License (December 2007). Oracle America, Inc., 500 Oracle Parkway, Redwood City, CA 94065., 18055=Copyright © 2011-2012, Oracle and/or its affiliates. All rights reserved.}",
    "lastModified": "Fri, 07 Dec 2012 12:55:56 GMT",
    "textBeforeTable": "Duties assigned directly and indirectly to the job role Application Administrator Duties Provides enterprise-wide application administration.  Collaborates with specific application administrators to maintain consistent enterprise application setup, architecture, information, rules, and access. Job Role: Application Administrator Privileges granted to Business Intelligence duties are not described in this manual. For information about these privileges, see the My Oracle Support document Oracle Business Intelligence Applications Duty Role Security Assignments for Oracle Fusion Applications (Doc ID 1333454.1). Note: Apart from these common roles, there is a set of roles that are specific to an offering. For information about these roles, see the Oracle Fusion Applications Security Reference Manual for the offering. This manual describes the security reference implementation for the common roles applicable to all offerings. Common Roles for all Offerings As you make changes to the security reference implementation for an Oracle Fusion Applications deployment, the predefined implementation as delivered remains available. Upgrade and maintenance patches to the security reference implementation preserve your changes to the implementation. Important: Review the privacy in effect for a job or abstract role based on its data security policies. Privacy is additionally protected",
    "textAfterTable": "Application Menu Customization Duty Customizes application menus. Application Reference Data Sharing Administration Duty Manage application reference data set and assignments. Application Registration Duty Maintains application metadata such as provisioning configurations, enterprise applications, domains, and application components such as pillars, environment types, module types, and middleware components. Application Tree Administration Duty Manages application trees and tree labels. Application Tree Structure Registration Duty Manages application tree structure. Application User Profile Value Administration Duty Manages my application user profile values. Applications Common Application Attachment Administration Duty Manages Oracle Middleware Extensions for Fusion Applications application attachments. Applications Common Application Attachment Category Administration Duty Manages Oracle Middleware Extensions for Fusion Applications application attachment categories. Applications Common Application Descriptive Flexfield Administration Duty",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}