{
    "relation": [
        [
            "rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Name",
            "Prince Alexander Nevsky",
            "Pyotr Arkadyevich Stolypin",
            "Josef Stalin",
            "Alexander Pushkin",
            "Czar Peter the Great",
            "Vladimir Lenin",
            "Fyodor Dostoyevsky",
            "Alexander Vasilievich Suvorov",
            "Dmitrij Ivanovich Mendeleyev",
            "Ivan the Terrible"
        ],
        [
            "Profession / reputation",
            "Russian ruler during Middle Ages",
            "prime minister during early 20th Century, presided over period of post-feudal modernization",
            "longtime Communist dictator (1924-1953) during World War II and post-war modernization",
            "poet and author",
            "18th Century Czar, credited with establishing Russia as a major world power",
            "Communist revolutionary and intellectual, founder and first head of state of the Soviet Union",
            "author",
            "18th Century general who helped secure Russian military dominance of the region",
            "inventor of the Periodic Table of Elements",
            "16th century ruler, first Czar of united Russian Empire"
        ],
        [
            "Died",
            "1263",
            "1911 X",
            "1953",
            "1837",
            "1725",
            "1924",
            "1811",
            "1800",
            "1968",
            "1907"
        ]
    ],
    "pageTitle": "Greatest People in the World",
    "title": "",
    "url": "http://www.jjmccullough.com/greats.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 533737083,
    "recordOffset": 533708624,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7313=First the countries of the world were trying to decide who their best pop star was. Now they're trying to name their best citizens. Following the lead of Britain, who held a \"Greatest Briton\" survey in 2002, over a dozen countries have so far held popular votes through their national TV network to determine their greatest citizen., 205105=Bulgaria's list is the most \"historical,\" featuring eight people who died before the year 1900, including four who died before 1000 AD. Greece's features seven who died before 1900, and six who died before 1000 AD., 129193=HUNGARY \"Greatest Hungarians\" Official Website Note: The \"Greatest Hungarians\" contest is still ongoing. There is not yet a top 10. The final results will not be known until 2007 sometime., 205814=In 1992 American historian Michael H. Hart wrote a book entitled The 100, which purported to provide \"a ranking of the most influential persons in history.\" I thought it might be interesting to note his top ten picks. Only a couple names appear on the previous lists we've looked at.}",
    "lastModified": "Wed, 01 Sep 2010 18:27:37 GMT",
    "textBeforeTable": "CANADA \"The Greatest Canadian\" Official Website You can view the whole top 100 here. 1890 impressionist painter Vincent van Gogh 10 1669 Renaissance-era painter Rembrandt 9 1945 FB Jewish girl who kept a diary as she hid from the Nazis in Amsterdam Ann Frank 8 1679 naval commander who led Dutch forces to victory in Dutch-Anglo wars Adm. Michiel de Ruyter",
    "textAfterTable": "8 Sir John A. MacDonald Canada's first prime minister 1891 FB 9 Alexander Graham Bell purported inventor of the telephone 1922 FB 10 Wayne Gretzky hockey player FINLAND \"Great Finns\" Official Website rank Name Profession / reputation",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}