{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very secured and kept in close. Lot of police/camera's/detectors/emergency stops all over the campus",
            "Tons and tons of different clubs and Activities to choose from. If there is something you like or have interest in, there's a probable chance there is a club for that at UIC.",
            "Engineering, Business, and Economics Majors",
            "The art institute and the museum of UIC is known to be haunted. Beware!",
            "It was definitely worth coming to UIC to do my undergrad here cause so far I absolutely love the campus, people, and the setting here",
            "Go to the city, Clubs and organizations, Tons of intramural sports and activities. Hang out at the Quad and relax with friends. Many many more options to choose from as the campus is right in the heart of Downtown Chicago.",
            "Typical cafeteria food. Nothing special with traditional menu and items.",
            "Dorm life has been great with many people coming from diverse backgrounds. It was an awesome experience living and share different life stories with them and work together to help each other succeed.",
            "Acadamecially this school has reached beyond my expectations as its very extensive and helped students reach their area of interest after graduation.",
            "Please check out the diversity and campus first before applying or making your decisions, know your major and what to expect from you both academically and socially.",
            "Ethnically and politically diverse institute. Variety of different backgrounds all working together to create a better atmosphere for everyone. Very intellectual professors with high level of education"
        ]
    ],
    "pageTitle": "University of Illinois at Chicago (UIC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Illinois-at-Chicago/reviews?_escaped_fragment_=/show/85233",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00192-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879142019,
    "recordOffset": 879007316,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{759384=© 2015, Cappex.com, LLC, 652382=This year on the 5th of November, a student painted the V for Vendetta symbol on a stone wall near the university's Quad., 338769=The Illinois Sheriff's Department has members working 24/7 on campus to ensure safety. Also, there are 1400 emergency call stations across campus which allow immediate Police assistance with the push of a button., 430279=Due to it being so close to downtown Chicago, UIC campus security is very efficient in the sense that they do the best job possible to keep students safe. You do get the crime alert reports but most of the time it's because a student was being risky and was walking at 3:00 am by himself., 329234=My Freshmen yr in 2010, food was crappy, however returning my sophomore year the CAF was completely redone and the food got alot better. The staff is very friendly and its best to develop close relationships with them!, 295429=The professors are brilliant, campus is nice, it's in the city, and it's right next to the train! I took the summer program offered for incoming freshman and met so many new people, I already feel comfortable going to college and I'll be a freshman this August.}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 65 out of 65 people found this review useful. 1 person found this inaccurate. 1 of 177 Lester from River Grove, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Am enjoying being here There are a lot of great campus activities, and being in the city is sure a plus. There are frequent crime alerts, but if you carefully plan your trips and stay in good areas you will be fine. The cheaper dorms are sub par. There was always something broken in the bathrooms on my floor which caused frequent flooding, but the work staff was usually pretty good about getting it done. The campus scenery isn't something to brag about; most of the buildings are tan with black windows. Am learning a lot The teachers are very knowledgeable. A lot of them encourage everyone to take advantage of their office hours, and they are always there when they say they will be. It is always important to check out your professors on ratemyprofessors.com as some teachers are definitely a lot better than others. Each teacher has his own teaching style and expectations, so make sure you are clear on what exactly those are and you will be fine. Login to rate or flag the reviews Monica from Palos Park, IL 06/09/2009 Reviewer is Accepted here and planning to attend soon.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}