{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is as safe as any school.",
            "There are 33 different clubs available on campus. Trips, discount activities and activities are also offered by student activities.",
            "Student services provides many opportunities for students to participate in a variety of activities outside of the many clubs that ar available to join.",
            "The prices for the healthier choices are a bit pricey for the average college student.",
            "The courses require a commitment from the students to succeed.",
            "Do not be afraid to ask for help if needed. Be prepared to work.",
            "It is a great place to start. They provided all the tools needed to help a student succeed."
        ]
    ],
    "pageTitle": "Dutchess Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Dutchess-Community-College/reviews?_escaped_fragment_=/show/62127",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903964051,
    "recordOffset": 903914841,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59049=Dorms are just being opened the fall semester of 2012., 107173=The dorms that they have just build for Fall 2012 are brand new and spacious., 95774=There are no dorms as of right now. After the summer of 2012 they will be up and students will have access to the on campus housing., 218479=© 2015, Cappex.com, LLC, 176974=Tuition alone is approximately $2000 or even less for a semesters worth of credits. Classes are per credit, and with the quality of the education you'll receive at this school, it's definitely worth it. Especially if you don't know exactly what you want to do in life., 53556=This is a community college so I can not give any comments on dorm life. They are however in the process of building dorms that will open in Fall 2012., 138968=It is considerably cheaper then most schools. Why waste thousands of dollars to take the same classes you could take for $1500 at Dutchess?}",
    "textBeforeTable": "05/15/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 2 out of 3 people found this review useful. 1 of 53 Brian from Wappingers Falls, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Categories Comments Great for these types of students Great if you're unsure of your major because the cost of tuition is so low. Tips for prospective students Great school if you're not sure what you want to be. Also because of the price and location. When in search of help, look for student help desks that are run by students. I suggest that you get to school early...you could be walking a half mile or more to your class otherwise. Bang for the buck Not to sound negative, but from my experience, you get what you pay for in this school. Low tuition=minimal help in this instance. Did enjoy being here I enjoyed the help from a few select teachers in the school. However, the faculty in charge of admissions and the registrars office are not helpful. I was bounced between at least 3-4 different offices regularly when I had a question or was registering for a new class. If you need help, ask fellow students. (especially the student help desk) Did learn a lot In the short time I attended Dutchess I did have a fairly good learning experience.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}