{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "In three sentences"
        ],
        [
            "Comments",
            "religious",
            "hang out with friends",
            "small classes hands on school well known organization"
        ]
    ],
    "pageTitle": "Latter-day Saints Business College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Latter-day-Saints-Business-College/reviews?_escaped_fragment_=/show/57206",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913413755,
    "recordOffset": 913379267,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1697=LDSBC only costs $2800 a year, whereas most colleges are charging five-figures a semester. Then there's the fact that one receives great instruction on a subject, as well as these beneficial career workshops--which I believe that we should pay for, since they seem to give us an edge., 131849=You're in downtown Salt Lake! There are two huge malls that you can visit anytime. There are movie theaters, dances all the time, temple square is beautiful year round, not to mention skiing and snowboarding in the winter. It's an awesome place to run and hike because you're surrounded by mountains. Every Tuesday at 11:20 there is a devotional at the Assembly Hall and they're really great to go to and hear the speakers., 157960=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/12/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 38 Jeff from Homestead, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am enjoying being here I love being here! There is no other school that I would rather be at, right now. I didn't get accepted to Brigham Young University--Provo, but I feel that this school is better suited for me; it has small classes (40 students max), it's in the capital of Utah, offers great career workshops, everyone is friendly, the temple is only a couple of blocks away, and the instructors are willing to go that extra mile for you. Am learning a lot After attending this college my first semester, I've learned a great deal on subjects such as the economy, computers, communicating, just to name a few. These skills make it more likely that I will find a great-paying job, as well as staying up-to-date with this ever-changing world. There are great instructors, along with fellow classmates, that will aid you if you are struggling with a certain concept, as well as the great tutors. I have found myself more educated on what's going on around me and owe it to this school. Login to rate or flag the reviews Allison from Adamstown, MD 07/02/2011 Reviewer is Accepted here and planning",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}