{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Great food choices",
            "Nice rooms",
            "Seems to have a good balance",
            "Sign Up for a tour and have lunch with some one from your program",
            "Nice Campus, Good Food, and Great People"
        ]
    ],
    "pageTitle": "Millikin University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Millikin-University/reviews?_escaped_fragment_=/show/12420",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891449475,
    "recordOffset": 891405853,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{186652=© 2015, Cappex.com, LLC, 67977=Millikin University is a prestigious, small, but beautiful campus with small class sizes, quality one on one instruction, and tight knit community. Most of the university's funds are put towards academic scholarships and students of all social identities and backgrounds are welcome. Millikin graduates are highly successful with 97% of 2010 graduates gaining permanent employment or entering graduate/professional school within 6 months of graduation., 64268=While Decatur doesn't offer much in the way of fun. The University Center Board and other organizations host and co-host many campus events such as bingo nights where you can win prizes, laser tag, salsa dance night, talent shows, and UCB's Big Event which featured Sara Bareilles in 2011 and All Time Low in 2012. There are also a variety of theatrical productions throughout each semester at Pipe Dreams Studio Theatre, Millikin's student-run theatre company., 83922=The fraternity and sorority community at Millikin University currently consists of eleven fraternities and sororities; 5 men's fraternities and 6 women's sororities.The 11 Greek organizations that comprise the Millikin University fraternity and sorority community hold in membership approximately 27% of the Millikin University student body. Additionally, the fraternity/sorority community has maintained a grade point average higher than the all Millikin average since 2005. The main social fraternities are; Delta Sigma Phi, Sigma Alpha Epsilon, Alpha Tau Omega, and Tau Kappa Epsilon. The main social sororities are; Alpha Chi Omega, Delta Delta Delta, and Pi Beta Phi. If you are interested in learning more.. look at the school's website., 136796=I would overall give Millikin a four out of five because everything is great but the cost is expensive. It does have a increase in tuition each year except for 2012-2013 because the president did not raise it. They do help out as much as they can., 87110=I lived in Blackburn Hall, which in 2011-2012 was an all freshman girls dorm. In general, Mills and Blackburn are the two freshman dorms and they are the lower end dorm rooms on campus. Knowing that, I was still very pleased with dorm life. The RA's are very good about building community on the floors. I was always comfortable in my dorm, as you should be.}",
    "textBeforeTable": "08/10/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 40 Kristin from Springfield, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. Millikin University Reviews Millikin University › Illinois › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Hilary from Des Plaines, IL 08/20/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 2 of 40 Categories Comments Great for these types of students Millikin is great if you love a fine arts atmosphere...where you can walk around outside singing and not get looked at like you're a weirdo. If you love to sing, act, or dance, you don't have to be majoring/minoring in those areas to get involved, there are ton of opportunities for non-majors! Tips for prospective students Don't bring a U-Haul on move-in day! The rooms aren't that big! Apply on time and stay in contact with your admission counselor! I was getting a lot of money from a different college, and called up my admin counselor, and while they couldn't match the money I was being offered, they gave me a little extra grant money. Bang for the buck With the small faculty-to-student ratio, it's so easy",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}