{
    "relation": [
        [
            "Part #",
            "CC13279",
            "CC13290",
            "CC13282",
            "CC13284",
            "CC13287",
            "CC13289"
        ],
        [
            "Description",
            "8 3/4\"-wide long 'Slim Jim' for Santee Low Glide Custom or standard Daytec Street Scene",
            "9 1/4\"-wide long 'Slim Jim' for Daytec Street Scene 103/200",
            "8 3/4\"-wide short 'Slim Jim' for Santee Low Glide Custom or standard Daytec CTM Street Scene",
            "9 1/4\"-wide short 'Slim Jim' for Daytec Street Scene 103/200",
            "8 3/4\"-wide 'Sheriff' for Santee Low Glide Custom or standard Daytec Street Scene",
            "9 1/4\"-wide 'Sheriff' for Daytec Street Scene 103/200"
        ],
        [
            "List Price",
            "$519.95",
            "$529.95",
            "$509.95",
            "$519.95",
            "$549.95",
            "$559.95"
        ],
        [
            "Your Price",
            "$469.95",
            "$479.95",
            "$459.95",
            "$469.95",
            "$499.95",
            "$505.95"
        ]
    ],
    "pageTitle": "Rear Fenders for Harley Davidson",
    "title": "",
    "url": "http://www.cas4.com/fenders/rear-fenders.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 356540249,
    "recordOffset": 356526097,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84382=Fat Bob Rear Fender Kit for FXR Models Fits all FXR models from 1982 thru 1986 and 1987 thru 1992 FXRTS. The Fat Bob rear fender is combined with our smooth, chromed steel fender struts that not only improve styling but provide improved fender support over the Original Equipment parts. Uses CCI taillight kits with Fat Bob mounts, or the stock (OEM 59993-80) taillight bracket. This kit and its components are not compatible with Original Equipment or aftermarket sissy bars., 104366=Rigid Rear Fender A replacement rear fender for rigid frame Big Twins from 1949 thru 1957. Includes braces and has holes drilled for the seat clip. Rear section is not drilled to permit choice of taillamp., 102026=Hinged Rear Fender for FL Swingarms These two-piece hinged fenders fit all 4-speed Big Twin FL frames from 1958 thru 1984. One version is smooth with no taillight mount and the other has the 1973-up mount, permitting the use of a variety of taillights. They also fit FX models if FL struts are used and can be adapted to FXWGS. A slight dent must be made in the front right lower corner of the fender to clear the FXE battery box. Sold in a raw steel finish ready for your custom paint job., 108241=Rigid Rear Fender for 1936 thru 1948 Big Twin Models An accurate reproduction of the rigid rear fender used on 1936 thru 1948 overhead valve Big Twins. Perfect in detail and complete with brackets ready to bolt-on. Comes unpainted., 37032=For Dyna Wide Glide® Models For models from 1993 thru 1995., 110121=IMPORTANT: We at CAS are not a representative of any motorcycle manufacturer and the parts we sell are not necessarily recommended by any motorcycle manufacturer. Although our replacement parts are not original factory equipment, our intention is to provide quality replacement parts that meet or exceed standards set by the manufacturer. We are not an authorized Harley® dealer and in no way do we have, or intend to imply any kind of business relationship with Harley-Davidson Motor Company® . Our intention is to provide products that can be used on a Harley-Davidson®  motorcycle.    CAS sells officially licensed Harley-Davidson® products.  However, any products with the trademark, name, word or OEM part number used in this catalog by CAS is intended to be as a reference only to the usage of that particular product. None of the parts and accessories in this catalog were manufactured by or with the permission of the Harley-Davidson® Motor Co. The words, Electra Glide, Evolution, H-D, Harley, Harley-Davidson, Low Glide, Road King, Roadster, Softail,Sportster,Sturgis, Super Glide,Low Rider, and Wide Glide are registered trademarks of Harley-Davidson®,Inc.,Milwaukee Wisconsin, U.S.A.The words, Duo Glide, Dyna Glide,Fat Boy, Hydra Glide and Bad Boy are trademarks of Harley-Davidson®,Inc., Milwaukee, Wisconsin,U.S.A.  The following model designations for Harley-Davidson® motorcycles are used in  this catalog for reference only:EL,FL,FLH,FLHR,FLHS,FLHT,FLHTC,FLHTC-I, FLHTS,Ultra,FLHX,FLST,FLSTC,FLSTF,FLSTN,FLSTS,FLT,FLTC,FLTC Ultra, FXB,FXD,FXDB,FXDC,FXDG,FXDL,FXDSFXDS-Conv.,FXDWG,FXE, FXEF,  FXLR, FXR, FXRC, FXRD,FXRDG,FXRP,FXRS, FXRSE,FXRS-Conv.,FXRS-SP,  FXRT, FXS, FXSB, FXST, FXSTC, FXSTS,FXSTSB,FXWG, GE,K,KH,WL,WLA, XL,XLCH,XLCR,XLH,XLH 883, XLH 1100, XLH 1200, XLR, XLS, XLT, XLX,  AND XR1000. All other brand names or trademarks, or registered trademarks  used in this catalog are the property of their respective holders. Please review our terms and conditions page Thank You, 94169=Rear Fenders for FX Models Detailed reproductions of the Original Equipment 4-speed FX rear fenders from 1973 thru 1985, Available with or without mounting bracket for 1973-up taillight assembly in 'bobbed' and standard styles., 53416=For Stock Softail® Frames Require removal of frame horns on frames from 1984 to present., 92047=Dresser-Style Rear Fenders for FXR Models These steel fenders mount between the stock fender struts of all FXR models from 1982 thru 1994, and are available smooth or with a mount for the late-style taillight. Original Equipment and CCI sissy bar kits may be used with these fenders., 105935=One Piece Rear Fenders for FL Models Accurate reproductions of the one-piece rear fenders on 4-speed FL models from 1980 thru 1984. One version on is smooth with no taillight or turn signal mounts permitting the use of a variety of taillights, and the other has the 1973-up taillight mount (but no turn signal mounts). Fender strut mounting holes are already drilled., 96818=Hinged Rear Fenders for FX Models Narrower versions of the hinged FL rear fenders that bolt between the stock fender struts on 4-speed FX models from 1973 thru 1985. They require no additional hardware or parts, and the narrow fender complements the trim styling of the FX while the hinged portion permits easy access to the rear wheel for servicing. Available smooth with no taillight mount or with the 1973-up mount, permitting the use of a variety of taillight Unpainted,, 34320=    For Dyna Glide® Models For models from 1991 thru 1995 (except FXDWG)., 89385=Flip Rear Fender Kit for FXR Models Flip-up fender fits all FXR models from 1982 thru 1986, and 1987 thru 1992 FXRTS. It's combined with specially-designed chrome struts to smooth the styling and provide improved support. The fender and struts are sold as a kit and are not compatible with Original Equipment or aftermarket sissy bars., 30390='Frenched' Rear Fenders Milwaukee Iron has followed its tradition of innovation with the 'Bandit' series of fenders frenched around the fender struts for a smooth look. Long or short fenders in several widths to accommodate custom fabrication and custom frames or widened rear frame sections. For Softail® Models Contoured for stock-style struts on models from 1984 to present., 75340=Custom Rear Fenders for Softail® Models These steel fenders are sold exclusively by Custom Chrome®, and have an early-style 'reveal' stamped in the rear tips. Installation requires the removal of 5\" from the struts. Two decorative end caps are supplied to finish off the shortened struts. Fit all 5-speed Softail® models from 1986 to present.}",
    "lastModified": "Tue, 29 Mar 2011 15:42:40 GMT",
    "textBeforeTable": "IMAGES CLICK   REAR FENDERS WE HAVE SO MANY MORE FENDERS  THAT ARE NOT LISTED HERE -  - I SUGGEST YOU CALL US -  WE SELL THEM ALL !! High Quality  Parts  from  CAS4",
    "textAfterTable": "'Steeler' Part # Description List Price Your Price CC13785 7.25\"-wide 'Steeler Custom Rear Fenders by Jesse James $325.95 $285.95 CC13786 8.5\"-wide 'Steeler' Custom Rear Fenders by Jesse James $325.95 $285.95 CC13787 9\"-wide 'Steeler Custom Rear Fenders by Jesse James $325.95 $285.95 CC13528 9\"-with license frame 'Steeler' Custom Rear Fenders by Jesse James $519.95 $452.95 'Tombstone' Part #   Description   List Price   Your Price CC13788 7.25\"-wide Tombstone Custom Rear Fenders by Jesse James $325.95 $285.95 CC13789 8.5\"-wide Tombstone Custom Rear Fenders by Jesse James $325.95 $285.95 CC13790 9\"-wide Tombstone Custom Rear Fenders by Jesse James $325.95 $285.95 CC13529 9\"-with license frame Tombstone Custom",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}