{
    "relation": [
        [
            "Symptoms",
            "Only a subset of users in LDAP can log in to Oracle BPM Worklist.",
            "Users and groups seeded only in the first authenticator are visible, but not from the other authenticators."
        ],
        [
            "Possible Cause",
            "The user base DN is not configured properly.",
            "By default, users and groups from the first authenticator are authorized."
        ],
        [
            "Possible Solution",
            "Mention the user base under which all the groups are seeded. This can be performed in two ways: Add the base DN under which all the required groups are seeded. For instance, if users are seeded under: UserDN 1 : cn=users1,dc=us,dc=oracle,dc=com UserDN 2 : cn=users2,dc=us,dc=oracle,dc=com UserDN 3 : cn=users3,dc=us,dc=oracle,dc=com Then mention the group base DN as follows: dc=us,dc=oracle,dc=com This is the common DN. If only some user DNs are required (for example, UserDN1 and UserDN2), then the following property must be added to serviceInstance with the name idstore.ldap in the $DOMAIN_HOME/config/fmwconfig/jps-config.xml file: user.search.bases cn=users1,dc=us,dc=oracle,dc=com cn=users2,dc=us,dc=oracle,dc=com",
            "Starting with 11.1.1.4, you can authorize users and groups from multiple authenticators. Add the following property to the idstore instance in the $DOMAIN_HOME/config/fmwconfig/jps-config.xml file. ............................ .............................."
        ]
    ],
    "pageTitle": "Troubleshooting Oracle SOA Suite and Oracle BPM Suite - 11g Release 1 (11.1.1.6.2)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E28271_01/admin.1111/e10226/appx_trouble.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00035-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70113963,
    "recordOffset": 70066892,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{187791=Use the limit command (for the C shell) or the ulimit command (for the Bash shell) to identify the value for descriptors. A value of 1024 is typically too low, especially for JDK 6., 216347=Note: Replace fdf5:74cc:db0a::0:1 with a value appropriate to your host environment., 104147=By default, ADF has a size limit of 2000 KB for each request. Add the following parameters in web.xml to adjust file size and temporary storage for uploaded files:}",
    "lastModified": "Thu, 20 Sep 2012 07:53:40 GMT",
    "textBeforeTable": "Table B-21 Troubleshooting Identity Service Issues Table B-21 and Table B-22 describe symptoms, possible causes, and possible solutions for identity service issues. B.4.17 Identity Service Issues You can randomly test some operations in these services, and verify that the operation yields results. Similarly, you can log in as a user to Oracle BPM Worklist and see if everything is fine. http://host:port/integration/services/RuntimeConfigService/RuntimeConfigService http://host:port/integration/services/IdentityService/identity http://host:port/integration/services/IdentityService/configuration /TaskQueryService/TaskQueryService http://host:port/integration/services Before performing a test-to-production migration, it is useful to test the health of the server. From a browser, you can test some SOAP services. The following list provides a subset of human workflow services and Oracle BPM Worklist: http://host:port/integration/worklistapp/  N/A   Testing the health of the installed server      Possible Solution Possible Cause Symptom        Table B-20 Troubleshooting Test-to-Production Issues",
    "textAfterTable": "Table B-22 Troubleshooting Identity Service Issues Symptom Possible Cause Possible Solution The following exception appears when myrealm (the default realm in the Oracle WebLogic Server Administration Console configuration) is passed as a parameter to the identity context to the Identity Service APIs. Exception seen : Service\" Unknown macro: {0} \"in configuration\" Unknown macro: {1} \" could not be initialized. Error in initializing service \"Authentication\" in configuration \"myrealm\". The human workflow identity service uses the identity context that is set in the WorkflowIdentityConfig file (by default, it is jazn.com) and not from the Oracle WebLogic Server configuration. Therefore, in the customer code, if jazn.com is passed as the identity context, the authenticate API should work fine. To change the realm name, the WorkflowIdentityConfig file can be edited in the System MBean Browser of Oracle Enterprise Manager Fusion Middleware Control. In the navigator, right-click soa-infra. Select SOA Infrastructure > Administration > System Mbean Browser. Select Application Defined Mbeans >",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}