{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 1250 words Completed: Oct 2011 Languages: English to French",
            "Translation Volume: 8000 words Completed: Sep 2011 Languages: French to English",
            "Translation Volume: 6000 words Completed: Sep 2011 Languages: French to English",
            "Translation Volume: 15000 words Completed: Mar 2011 Languages: French to English",
            "Translation Volume: 21000 words Completed: Mar 2011 Languages: French to English",
            "Translation Volume: 5500 words Completed: Mar 2011 Languages: French to English",
            "Translation Volume: 3800 words Completed: Mar 2011 Languages: French to English",
            "Translation Volume: 2300 words Completed: Mar 2011 Languages: English to French",
            "Translation Volume: 10000 words Completed: Feb 2011 Languages: French to English",
            "Translation Volume: 2500 words Completed: Jan 2011 Languages: English to French",
            "Translation Volume: 3500 words Completed: Jan 2011 Languages: French to English",
            "Translation Volume: 4500 words Completed: Jan 2011 Languages: English to French",
            "Translation Volume: 3300 words Completed: Dec 2010 Languages: English to French",
            "Translation Volume: 3500 words Completed: Dec 2010 Languages: English to French",
            "Translation Volume: 9000 words Completed: Dec 2010 Languages: English to French",
            "Translation Volume: 380 lines Completed: Dec 2010 Languages: English to French",
            "Translation Volume: 3700 words Completed: Dec 2010 Languages: English to French",
            "Translation Volume: 30000 words Completed: Nov 2010 Languages: French to English",
            "Translation Volume: 5800 words Completed: Nov 2010 Languages: French to English",
            "Translation Volume: 1000 words Completed: Oct 2010 Languages: French to English",
            "Translation Volume: 4700 words Completed: Oct 2010 Languages: French to English",
            "Translation Volume: 15000 words Completed: Oct 2010 Languages: English to French French to English",
            "Translation Volume: 6700 words Completed: Aug 2010 Languages: English to French",
            "Translation Volume: 6400 words Completed: Aug 2010 Languages: English to French",
            "Translation Volume: 50 pages Completed: May 2010 Languages: French to English",
            "Translation Volume: 50 pages Completed: May 2010 Languages: French to English",
            "Project management Volume: 213000 words Completed: May 2010 Languages: English to French",
            "Translation Volume: 4000 words Completed: May 2010 Languages: French to English",
            "Translation Volume: 4500 words Completed: Apr 2010 Languages: French to English",
            "Translation Volume: 5000 words Completed: Apr 2010 Languages: French to English",
            "Translation Volume: 9000 words Completed: Apr 2010 Languages: English to French",
            "Translation Volume: 11000 words Completed: Apr 2010 Languages: French to English",
            "Translation Volume: 27000 words Completed: Mar 2010 Languages: French to English",
            "Translation Volume: 800 pages Duration: Mar 2010 to Apr 2010 Languages: English to French",
            "Translation Volume: 4000 words Languages: French to English",
            "Translation Volume: 20000 words Duration: Feb 2011 to Mar 2011 Languages: French to English",
            "Translation Volume: 20000 words Duration: Feb 2011 to Mar 2011 Languages: French to English",
            "Translation Volume: 35000 words Duration: Jun 2010 to Sep 2010 Languages: English to Arabic",
            "Translation Volume: 13000 words Languages: English to Arabic",
            "Translation Volume: 7000 words Languages: English to Arabic",
            "Translation Volume: 85000 words Duration: Nov 2010 to Feb 2011 Languages: English to French",
            "Translation Volume: 50000 words Duration: Nov 2010 to Feb 2011 Languages: English to French French to English",
            "Project management Volume: 315000 words Duration: Sep 2010 to Dec 2010 Languages: English to Arabic",
            "Translation Volume: 1600 words Languages: English to French",
            "Project management Volume: 117000 words Duration: Dec 2010 to Jan 2011 Languages: English to French",
            "Translation Volume: 120000 words Duration: Oct 2010 to Mar 2011 Languages: French to English",
            "Translation Volume: 1000 words Languages: English to French",
            "Translation Volume: 14000 words Completed: Feb 2010 Languages: English to French French to English",
            "Editing/proofreading Volume: 41 pages Completed: Apr 2010 Languages: French to English",
            "Translation Volume: 6000 words Languages: English to French",
            "Translation Volume: 26 pages Completed: Mar 2010 Languages: French to English",
            "Translation Volume: 14 pages Completed: Mar 2010 Languages: Arabic to English",
            "Translation Volume: 5000 words Completed: Mar 2010 Languages: French to English",
            "Translation Volume: 16 pages Completed: Mar 2010 Languages: French to English",
            "Translation Volume: 19 pages Completed: Feb 2010 Languages: French to English",
            "Translation Volume: 64 pages Completed: Feb 2010 Languages: French to English",
            "Translation Volume: 22000 words Completed: Feb 2010 Languages: English to French",
            "Translation Volume: 292 pages Completed: Jan 2010 Languages: English to French",
            "Translation Volume: 7 pages Completed: Mar 2010 Languages: French to English",
            "Translation Volume: 8500 words Completed: Dec 2009 Languages: English to French",
            "Translation Volume: 450 pages Completed: Nov 2009 Languages: English to French",
            "Translation Volume: 43 pages Completed: Nov 2009 Languages: French to English",
            "Translation Volume: 53 pages Completed: Oct 2009 Languages: Arabic to English",
            "Translation Volume: 20 pages Languages: Arabic to English",
            "Translation Volume: 20 pages Completed: Nov 2009 Languages: English to French",
            "Translation Volume: 200 pages Duration: Jun 2009 to Jul 2009 Languages: French to English",
            "Translation Volume: 1200 pages Duration: May 2009 to Jul 2009 Languages: English to French",
            "Translation Volume: 6700 words Completed: Apr 2009 Languages: Arabic to English",
            "Editing/proofreading Volume: 4200 words Completed: Apr 2009 Languages: French to English",
            "Transcription Volume: 2200 words Completed: Apr 2009 Languages: Arabic to English Arabic",
            "Translation Volume: 4000 words Completed: Jun 2009 Languages: Arabic to English",
            "Translation Volume: 2400 words Completed: Mar 2009 Languages: Arabic to English",
            "Translation Volume: 8 pages Languages: Arabic to English",
            "Translation Volume: 3000 words Completed: Mar 2009 Languages: English to French",
            "Editing/proofreading Volume: 40 pages Completed: Oct 2008 Languages: Arabic to English",
            "Translation Volume: 1700 words Completed: Oct 2009 Languages: French to English",
            "Translation Volume: 3600 words Completed: Apr 2009 Languages: French to English",
            "Translation Volume: 2 pages Completed: Sep 2009 Languages: Arabic to English",
            "Translation Volume: 2800 words Completed: Jul 2009 Languages: Arabic to English",
            "Translation Volume: 0 words Completed: May 2009 Languages: English to French",
            "Translation Volume: 7 pages Completed: Aug 2009 Languages: French to English",
            "Translation Volume: 10000 words Completed: Aug 2009 Languages: English to French",
            "Editing/proofreading Volume: 500 pages Completed: Mar 2009 Languages: English",
            "Transcription Volume: 6000 words Completed: Jun 2009 Languages: English to French",
            "Translation Volume: 5500 words Completed: May 2009 Languages: English to French",
            "Translation Volume: 7 pages Completed: May 2009 Languages: English to French",
            "Translation Volume: 1500 words Completed: Aug 2008 Languages: English to French",
            "Translation Volume: 16 pages Completed: Jul 2009 Languages: French to English",
            "Translation Volume: 2 pages Completed: Apr 2009 Languages: Arabic to English",
            "Translation Volume: 180 days Duration: Jan 2008 to Jun 2008 Languages: Arabic to English",
            "Translation Volume: 300 days Duration: Jul 2008 to May 2009 Languages: Arabic to French Arabic to English",
            "Translation Volume: 45000 words Duration: Jan 2009 to Feb 2009 Languages: English to French",
            "Translation Volume: 260 pages Duration: Jul 2007 to Sep 2007 Languages: Arabic to English",
            "Translation Volume: 800 words Completed: Sep 2009 Languages: Arabic to English"
        ],
        [
            "Project Summary",
            "Fermentation broth application bulletin for Pall Corp. Biology (-tech,-chem,micro-), Engineering (general), Engineering: Industrial",
            "Psychometric instrument technical manual Psychometric instrument technical manual: MPO (Mobilization, Performance, Organizations) is a psychometric instrument which assesses the personality and the perception of the behavior required from individuals working in organizations. This technical manual's main objective is to inform the users of the MPO instrument about its fulfillment approach and about its statistical properties, in order to allow them to use the instrument appropriately for the different contexts for which it has been designed. Human Resources, Psychology",
            "Canadian legal documents Translation of six Canadian legal documents, including lease assignments, supplementary leases and other rent agreements. Law (general), Law: Contract(s)",
            "Business and marketing strategy presentations for Total I translated several Word and PPT documents for Total: Campaign, planning, descriptions of promotions and incentives, and all kinds of managerial and marketing instructions. Marketing / Market Research, Management, Business/Commerce (general)",
            "Dock Lyonnais - Comptes sociaux et consolidés 2010 Finance/accounting translation of Dock Lyonnais' balance and financial statements for 2009. Accounting, Finance (general)",
            "M&C SAATCHI.GAD meeting minutes Translation of several M&C SAATCHI.GAD meeting minutes. Business/Commerce (general), Human Resources, Management",
            "Academic research project Translation of a college-level survey. The study aims at gathering data on (1) entrepreneurship as career choice and (2) the real impact of differing modes of formation in the field of entrepreneurship. Certificates, Diplomas, Licenses, CVs, Human Resources, Marketing / Market Research",
            "IT policies and articles Translation of several IT correspondence articles on mail purging, computer modernization plans, and web cookies. Computers (general), Computers: Software, Internet, e-Commerce",
            "Technical project for Mercedes Translation of several files on internal Mercedes procedures: internal control, task separation, electronic drafts, and others. Engineering (general), Mechanics / Mech Engineering, Manufacturing",
            "Business documents for KDC Translation from US English into Canadian French of press releases, case studies, business plans for Knowlton Design Corporation (www.kdccompanies.com). Business/Commerce (general), Management, Marketing / Market Research",
            "AIDSTAR-One case study on HIV treatment in Congo Human Resources, Marketing / Market Research, Medical (general)",
            "Explanatory texts on web services Several explanatory texts on web services: Audio conferencing, iPass, social networking, and others. Computers: Software, IT (Information Technology), Internet, e-Commerce",
            "Market research FAQ for Cargill Product return/product tampering policies, and FAQ about Truvia™ Sweetener, for Cargill. Human Resources, Management, Marketing / Market Research",
            "White paper for a mining company Human Resources, Management, Manufacturing",
            "Quantum Software legal documents Translation of legal documents for Quantum Software: Support and Maintenance Terms and Conditions, and Terms and Conditions of Sale. Business/Commerce (general), Law: Contract(s), Management",
            "Software script translation Translation of 380 software lines. Computers (general), Computers: Software, IT (Information Technology)",
            "E-commerce and IT documents Translation of several documents on the Intranet, RSS feeds, MAC addresses, and other kinds of software and IT services. Computers: Software, IT (Information Technology), Internet, e-Commerce",
            "Translation of clips on navigation Translation of dozens (Canadian French into US English) of transcripts about navigation. Engineering (general), Energy / Power Generation, Ships, Sailing, Maritime",
            "Legal/financial documents for Triangle France Translation of three documents for Triangle France LLC: Share transfer agreement, Minutes of an extraordinary general assembly, and company statutes. Finance (general), Law (general), Law: Contract(s)",
            "Republic of Zaire official document Translation of an official document for the Republic of Zaire - Department of Finance and Budget. The file deals with benefits in kind granted to the personnel: catering services (canteens), supply of food and beverages on site, and supply of other materials. Human Resources, Law (general), Management",
            "USAID case study on Congo USAID Case Study: Support for people living with HIV/AIDS in emergency situations in the Democratic Republic of Congo. Human Resources, Management, Medical (general)",
            "Computer wizard Translation of IT service team documents: PowerPoint wizard, hacking issues, templates, and others. Computers (general), IT (Information Technology), Internet, e-Commerce",
            "IT catalog on telephony services IT (Information Technology), Computers (general), Internet, e-Commerce",
            "28 IT articles Translation of 28 web articles offering service information and troubleshooting guides. Computers (general), Internet, e-Commerce, IT (Information Technology)",
            "Biological description of sea plants and animals Description of exotic sea plants and animals of the Sulawesi Island: periclimenes shrimps, mosura shrimps, neopetrolisthes crabs, clown fish, seaweed, acropora, sea anemones, and others. Botany, Science (general), Zoology",
            "Software backup maintenance document for Scasicomp Translation of software backup maintenance document for Scasicomp: Presentation of Scasicomp's support activity, description of provided IT services, Incident handling, technical scope, and other details. Computers (general), Computers: Systems, Networks, IT (Information Technology)",
            "200K+ project for Mitsubishi Project management: Mitsubishi Instruction Manuals for Steam Turbines, 213,000 words. Automotive / Cars & Trucks, Engineering (general), Mechanics / Mech Engineering",
            "Mining company financial and legal analysis Finance (general), Law (general), Law: Taxation & Customs",
            "Translation of the EasyFiber website for SOGETREL Translation of the EasyFiber website: telecom networking, integration of voice-data-image networks, sanitation pipes, duct cleaning, sewage works, rehabilitation of pipes, telecom cables. Engineering (general), Engineering: Industrial, IT (Information Technology)",
            "Tourism brochure Description of tours in France (Vaucluse, Massif Uchaux, Côtes du Rhône, etc.) Tourism & Travel, Tourism & Travel",
            "Translation of cosmetics brochures for Escopa Translation of cosmetics brochures for Escopa: Organic Mineral Face Cleanser, Organic Mineral Toner, Natural Black Mud Mineral Mask, Organic Mineral Nourishing Night Cream, Organic Mineral Eye Cream, Organic Mineral Shampoo, and other health/beauty products. Cosmetics, Beauty, Science (general)",
            "Description of art education courses for the PSPBB Translation of descriptions of art education courses for the higher arts education centre Paris Boulogne-Billancourt (PSPBB), in the fields of music, dramatic art, vocal and instrumental conducting. The documents also include details on registration, applications, administrative documents, school life, and job opportunities. Art, Arts & Crafts, Painting, Education / Pedagogy, Music",
            "Dock Lyonnais - Comptes sociaux et consolidés 2009 Finance/accounting translation of Dock Lyonnais' balance sheets, financial statements and financial analysis for 2009. Accounting, Finance (general)",
            "Mitsubishi 800-page translation 800-page technical translation for Mitsubishi Heavy Industries. The project includes turbines installation manuals and drawings for steam turbines (including mechanical drive steam turbines), assembly works, lubricant oils, erection spare parts, gland condenser ejectors, and others. Automotive / Cars & Trucks, Engineering (general), Mechanics / Mech Engineering",
            "Company description of Amblard Translation of the business presentation of Amblard Company, the European leader in importation, acclimation and distribution of fish, invertebrates and aquatic plants for aquariums. The project refers to Amblard's business practices, environmental efforts, ecological innovations, and terms of use. Management, Environment & Ecology, Business/Commerce (general)",
            "Generic technical specifications Translation of generic technical specifications: fixed door glass, applicative messaging networks, obstacle proximity detection system, and other devices. Manufacturing, IT (Information Technology), Computers: Systems, Networks",
            "Translation of IT and corporate documents for Logica Logica is a business and technology service company. The documents I worked on included expenditure commitment forms and rules, process descriptions, management rules, and purchase processes. IT (Information Technology), Management, Computers: Systems, Networks",
            "Journal articles on the Arab world History, Journalism",
            "TPC-300 wireless timer interface technical manuals Translation of user manuals and installation guides for the TPC-300 wireless timer interface technical manuals for COCO Technologies: safety instructions, troubleshooting, information on codeswitch receivers, software commands, and others. Computers: Software, Computers: Systems, Networks, IT (Information Technology)",
            "Quick installation guides for COCO Technologies Quick hardware/software installation guides for several COCO Technologies receivers and transmitters. Computers (general), Computers: Hardware, Computers: Software",
            "SAP training materials Translation of SAP training materials for Merck using Wordfast Pro: Supply Chain Management, Stock Management, Job Planning, etc. Human Resources, Management, SAP",
            "Proofreading of 50,000 words French <> English proofreading of about 50,000 words in all kinds of corporate documents: management, IT, HR, legal, business/finance files. Human Resources, IT (Information Technology), Management",
            "Huge medical project I managed a huge medical translation project from English into Arabic. Marketing / Market Research, Medical (general), Medical: Health Care",
            "Technical manuals on locks Translation of three Titan locks installation guides. Engineering (general)",
            "Huge \"Mad Science\" manual translation Translation of 112 files for Mad Science - System 5. This included eight manuals: All about animals, Energy burst, Get connected, Life in the sea, Mix it up, Moving motion, Radical robots, and Super power sources. Engineering (general), Mechanics / Mech Engineering, Science (general)",
            "Medical interviews Translation of several medical interviews over an extended period. Marketing / Market Research, Medical (general)",
            "Global policy for online public groups Information to owners of online mail distribution groups and access groups. Computers (general), Computers: Software, Internet, e-Commerce",
            "Legal documents Translation of a large batch of official documents: court declarations, legal correspondance, company descriptions, medical reports, accident procedures, and others. Medical: Health Care, Law (general)",
            "IT project proofreading Proofreading of 41 pages of IT descriptions for Egomedia Web solutions: web hosting, web marketing, web design, web optimization, IT service platforms, social media, viral marketing... Computers (general), IT (Information Technology), Internet, e-Commerce",
            "SAP project SAP translation for Winjit and Biotrace International PLC. Computers (general), IT (Information Technology), SAP",
            "Management software manual translation Translation of a management software manual: HR, Projects, Sales and Receivables management. Computers: Software, Human Resources, Management",
            "Value and Benefits of Supreme Audit Institutions of the Republic of Iraq Value and Benefits of Supreme Audit Institutions. Paper presented by the Board of Supreme Audit of the Republic of Iraq to the 20th INCOSAI to be held in South Africa, 2010. Finance (general), Finance (general), Government / Politics",
            "Lease agreement and legal correspondance Translation of a lease agreement, lease supplements and other legal correspondance between Canadian and Algerian companies and individuals. General / Conversation / Greetings / Letters, Law (general), Law: Contract(s)",
            "Technical evaluation - business service form Traduction d'un avis technique concernant des joints de chaussée de ponts-routes pour le Ministère de l'Ecologie du Développement et de l'Aménagement Durables. Produit: Viajoint Entreprise: Freyssinet France Business/Commerce (general), Construction / Civil Engineering",
            "Translation of an agency contract Translation of an agency contract. The Agent is granted the exclusive rights to represent the Principal’s services and products aimed at the clientele, in addition to supplying tenancy agreements to establishments situated outside this sector. Law: Contract(s), Law (general)",
            "Tender for the Algerian Ministry of Interior Translation of a 64-page tender from French into English, for the Algerian Ministry of Interior. It includes the financial offer as well as technical and IT specifications. Finance (general), IT (Information Technology), Law (general)",
            "USAID financial documents CRS Partner USAID Funded Subaward - Attachments and agreements. Data sheet, approved budget, project description, GP, FRP , PPP, etc. Finance (general), Government / Politics",
            "292 pages of tourism translation Tourism translation project, mainly Japan but also Europe and the USA. Advertising / Public Relations, Tourism & Travel, Tourism & Travel",
            "Draft assessment notice Translation of a draft assessment notice. Recovery plan by polyvalent tax editors for a Congolese company (TENKE FUNGURUME MINING, TFM). It includes detailed data summary statements, tax calculations, and balance sheets. Accounting, Finance (general), Law: Taxation & Customs",
            "Business, Marketing and HR documents Translation of 21 Business, Marketing and HR documents Human Resources, Management, Marketing / Market Research",
            "Book on Mutual Funds Translation of a 450-page financial course book on mutual funds. Finance (general), Finance (general), Investment / Securities",
            "Services and spare parts supply contract Translation of a contract between the ENTP and a service provider. The contract defines the conditions according to which the latter will execute maintenance services and supply spare parts and technicians. Law: Contract(s)",
            "Social questionnaires Translation of questionnaires on social, economical, and political issues for Algeria and Mauritania. Surveying, Social Science, Sociology, Ethics, etc.",
            "Supplementary witness statement Translation and proofreading of a Supplementary witness statement before the UK High Court of Justice. Law (general)",
            "Master Service Agreement Translation of a Master Service Agreement between a Company and contractors to perform, execute, complete, maintain work and/or provide services, equipment, machinery, materials or supplies related to oil foraging. Business/Commerce (general), Law (general), Law: Contract(s)",
            "Description of sites and monuments (200 pages) Advertising / Public Relations, Tourism & Travel",
            "Translation of 1,200 pages of medical material Medical (general), Other",
            "Translation of two pleadings Law (general)",
            "Proofreading of a financial report Finance (general)",
            "Interview transcription and translation General / Conversation / Greetings / Letters",
            "Investment Representation Agreement An Investment Representation Agreement between the Bank of Kuwait and Al-Mashreq Bank (Mortgage Investor), and Apiar Company for Development (Investment Agent). Law: Contract(s), Law (general)",
            "Translation of a land allotment decree Law: Contract(s), Real Estate, Real Estate",
            "Translation of an Appeal Translation of an Appeal before the Qatari Civil Court of Appeal. Law (general)",
            "Translation of financial and business documents Finance (general), Certificates, Diplomas, Licenses, CVs, Business/Commerce (general)",
            "Proofreading of a TV program episode Media / Multimedia",
            "Analysis of a company's results The document consists of an analysis of GoAdv's business over the first semester of 2009. The Group's financial position, market positioning, choice of investments and partnerships, business strategies and perspectives are detailed and discussed. IT (Information Technology), Finance (general), Business/Commerce (general)",
            "Translation of a film scenario Media / Multimedia",
            "Trademark protection renewal certificates This project consists of two Egyptian trademark protection renewal certificates. Certificates, Diplomas, Licenses, CVs, Law (general), Law: Patents, Trademarks, Copyright",
            "Real Estate Registration Real Estate Registration for the Dar Al-Estethmar Company (Kuwaiti Closed Joint Venture). Law: Contract(s), Law (general)",
            "Business letter Business/Commerce (general), Manufacturing, Materials (Plastics, Ceramics, etc.)",
            "Official documents The project consists of official recommendations and ministerial orders issued by Congolese officials concerning the country's mines. It includes business and legal details regulating activities in the field. Business/Commerce (general), Government / Politics, Law (general)",
            "Annual Report - Pan American Development Association Translation of the PADF (Pan American Development Association) Annual Report for year 2008. The document reports the accomplishments of the Association in South America in collaboration with its corporate partners. It also details its services, infrastructure, alliances with local NGOs, and means of funding. Business/Commerce (general), Management, Media / Multimedia",
            "Analysis of business/financial files Business/Commerce (general), Finance (general), Finance (general)",
            "Transcription and translation of a business interview Advertising / Public Relations, Business/Commerce (general), Management",
            "Translation of General Terms and Conditions Business/Commerce (general), Law (general), Law: Contract(s)",
            "Seven-page rush translation of a Contract Law (general), Law: Contract(s)",
            "Translation of financial descriptions of companies Business/Commerce (general), Finance (general)",
            "Translation of official certificates Certificates, Diplomas, Licenses, CVs",
            "U.A.E official documents Certificates, Diplomas, Licenses, CVs, Law (general), Medical (general)",
            "Translation of large volumes of online news articles Government / Politics",
            "Long-term collaboration on official documents Law: Contract(s), Law: Patents, Trademarks, Copyright, Patents",
            "Translation of SAP files IT (Information Technology), SAP",
            "Translation of the book \"Sculpture in Lebanon\" Art, Arts & Crafts, Painting",
            "Power of Attorney Law: Contract(s), Law (general)"
        ],
        [
            "Corroboration",
            "No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive Verbatim Solutions: No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive deruebersetzer: No comment.",
            "No comment.",
            "No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive deruebersetzer: No comment.",
            "No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive deruebersetzer: No comment.",
            "No comment.",
            "No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive Verbatim Solutions: No comment.",
            "positive deruebersetzer: No comment.",
            "positive deruebersetzer: No comment.",
            "positive deruebersetzer: No comment.",
            "No comment.",
            "No comment.",
            "positive Nicolas Carteron: Very professional and reliable!",
            "positive Verbatim Solutions: No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "positive Nicolas Carteron: No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "positive omegat: No comment.",
            "positive Tim Notari: No comment.",
            "positive Verbatim Solutions: No comment.",
            "No comment. Colleague feedback: Nadim Bayeh: I enjoyed working with Alain on this project!",
            "positive Verbatim Solutions: Professional and accurate",
            "positive deruebersetzer: No comment.",
            "positive Andreea: No comment.",
            "positive Robyn Nelson: Very professional, quick response times",
            "positive Fleur Hopkins: Alain is great to work with - punctual, reliable, helpful - a true professional.",
            "positive Robert Flood: Fantastic collaboration, timely and responsive to requirements",
            "positive Camilla Costa: Accurate, good quality translation, delivered before the deadline. Thank you.",
            "positive Robyn Nelson: No comment.",
            "No comment.",
            "positive QUIETVOX.COM: No comment.",
            "positive Caue: Great Linguist. Very professional",
            "positive Tuba: Extremely reliable translator! Always a pleasure to work with!",
            "positive Tim Notari: Worked ahead of schedule, very communicative, Excellent working Experience.",
            "positive Robyn Nelson: No comment.",
            "No comment.",
            "positive Daniel Riber: Even though the distance was great Alaine did a great job for us.",
            "positive Fabian: Very professional, as always.",
            "positive Anna: Extremely reliable translator! Always a pleasure to worki with!",
            "positive Anna: Thank you Alain for your professionalism and working attitude!",
            "positive KD Technology Corp.: Very professional, as always.",
            "positive ProZ.com member : No comment.",
            "positive Mobile Technologies, LLC: Very dilligent translator, always met deadlines and always good about returning emails",
            "positive Blue Board outsourcer (10 to 20 entries): Nice and punctual work",
            "positive Blue Board outsourcer (50 to 100 entries): Quick turnout, conscious, pays attention to detail.",
            "positive George Aziz: No comment.",
            "positive Anna: Extremely reliable translator! Always a pleasure to worki with!",
            "positive Georg Aziz: No comment.",
            "positive Anna: Thank you again for speedy service Alain!",
            "positive Andromeda Translations: Alain is a highly professional translator since reliable, devoted and accurate.",
            "positive Feature Subtitling & Translation: No comment.",
            "positive Agency ID not registered: A pleasere to work with!",
            "positive Liam Casey: Very quick, good quality",
            "positive ProZ.com member : No comment.",
            "positive Anna: As always - very good quality and on time!",
            "positive Ann Denny: Thank you Alain for this timely/accurate translation.",
            "positive Robyn: No comment.",
            "positive Blue Board outsourcer (10 to 20 entries): No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "French<>English<>Arabic translator specializing in finance/business, IT, technical, marketing",
    "title": "",
    "url": "http://www.proz.com/profile/920939",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 669362691,
    "recordOffset": 669320212,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "94 projects entered    56 positive feedback from outsourcers    1 positive feedback from colleagues Project History PRO-level points: 68, Questions answered: 52, Questions asked: 142 KudoZ activity (PRO) Less More Patents Furniture / Household Appliances Environment & Ecology Engineering: Industrial Energy / Power Generation Electronics / Elect Eng Economics Construction / Civil Engineering Computers: Systems, Networks Computers: Software Computers: Hardware Aerospace / Aviation / Space Automotive / Cars & Trucks Advertising / Public Relations",
    "textAfterTable": "More Less Payment methods accepted Visa, MasterCard, Wire transfer, Western Union Currencies accepted U.A.E. dirhams (aed), Euro (eur), Pounds sterling (gbp), U. S. dollars (usd) Portfolio Sample translations submitted: 7 Arabic to English: Investment Policy General field: Bus/Financial Detailed field: Investment / Securities Source text - Arabic سياسة استثمار صناديق التقاعد والتأمينات الاجتماعية:- أعطى القرار الرئاسي رقم (32) للجنة الاستثمار الحق باستثمار أموال صندوقي المعاشات المدنية والعسكرية في مشاريع تهدف إلى تحقيق عائد مجز وفق سياسة استثمارية واستراتيجية محددة من خلال توظيف أموال صندوقي المعاشات في أصول حقيقية وأدوات استثمارية مختلفة داخل وخارج دولة جيبوتي، وتتميز استراتيجية استثمار أموال صناديق التقاعد بتركيزها على الاستثمارات ذات الأمد الطويل التي تتناسب مع التزامها عبر الزمن في تغطيـة المنافع التقاعديةللمشتركين، وتقوم استثمارات صندوق التقاعد على مبدأ التنويع في أدوات استثمارية متنوعة ومناطق جغرافية مختلفة، ويتم تحديد استراتيجية الاستثمار حسب المعايير التي تحددها السياسة الاستثمارية التي تقررها لجنة استثمار أموال صناديق المعاشات المدنية والعسكرية بما يتناسب مع حجم الصندوق وحجم التزاماته المالية وتتم مراجعة السياسة الاستثمارية سنوياً حسب معطيات السوق المالية العالمية.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}