{
    "relation": [
        [
            "Patent application number",
            "20100108729",
            "20120286548"
        ],
        [
            "Description",
            "Bicycle Pannier Mounting System - A pannier mounting system includes a pair of hooks that are positioned at generally opposite ends of a handle and secure a pannier to a bicycle. A latch and a stop cooperate with each hook to snuggly enclose a rail in a manner that is generally independent of the cross-sectional size/shape of the rail. The latch is connected to the hook by a pivot and extends outward generally under the hook. The stop is pivotably and slidably connected to the hook and cooperates with the hook to generally fix a position of the latch. Translation of the handle toward the hooks closes and locks the latch about a rail member and translation of the handle away from the hooks unlocks the latch so that the mounting system can be removed from a rail.",
            "Adjustable Nose Width Bicycle Seat Assembly - A bicycle seat assembly having an adjustable width nose portion includes an H-shaped base that supports a lateral left side pad and a lateral right side pad. A rail extends under the base and between the left and right side nose portions of the seat assembly. A front rail mount includes a housing, a shuttle, an actuator, and left and right mount supports. Operation of the actuator alters the position of the left and right mount supports relative to the housing and thereby alters a distance between the respective left and right side nose portions of the seat base."
        ],
        [
            "Published",
            "05-06-2010",
            "11-15-2012"
        ]
    ],
    "pageTitle": "Liao, Taichung City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/liao-taichung-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428109351,
    "recordOffset": 428063830,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Po Chin Liao, Taichung City TW //]]> BarDraw('2885074',['Patent applications by Lu-Shih Liao, Taichung City TW'],[[1,1,1,2]],['2007','2010','2011','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2885074\" align=\"center\"></div> </div> <canvas id=\"bg2885074\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Lu-Shih Liao, Taichung City TW</p> <div class=\"bar2885074\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-25-2013</td> <td><a href=\"/patents/app/20130101858\">LOW DIELECTRIC CONSTANT RESIN FORMULATION, PREPOLYMER, COMPOSITION, AND COMPOSITE THEREOF</a> - The present disclosure provides a low dielectric constant resin formulation comprising 20-150 parts by weight of diisocyanate, 20-400 parts by weight of poly(2,6-dialkyl-1,4-phenylene oxide), and 200-650 parts by weight of a solvent. The present disclosure also provides a low dielectric constant resin prepolymer, composition, and composite produced from the above formulation, and a method for preparing the low dielectric constant resin prepolymer solution.</td> <td>20130101858</td> <tr> </tr> <td>03-14-2013</td> <td><a href=\"/patents/app/20130065074\">GRAPHITE OXIDE-CONTAINING RESIN FORMULATION, COMPOSITION, AND COMPOSITE THEREOF</a> - The present disclosure is related to a carbon-nanomaterial-supported catalyst, including: a carbon nanomaterial, and a polymer grafted onto the carbon nanomaterial, wherein the polymer has a repeat unit containing a phosphonium salt and its molecular weight is 1,000-200,000. The disclosure is also related to a method of preparing carbonate, which includes using the carbon nanomaterial-supported catalyst for the cycloaddition reaction of carbon dioxide into the epoxy group.</td> <td>20130065074</td> <tr> </tr> <td>06-23-2011</td> <td><a href=\"/patents/app/20110147646\">MODIFIED BISMALEIMIDE RESINS, PREPARATION METHOD THEREOF AND COMPOSITIONS COMPRISING THE SAME</a> - A modified bismaleimide resin of Formula (I) or (II) is provided.</td> <td>20110147646</td> <tr> </tr> <td>09-02-2010</td> <td><a href=\"/patents/app/20100219369\">COMPOSITION OF",
    "textAfterTable": "Po-Jui Liao, Taichung City TW Patent application number Description Published 20120083090 Method of fabricating an NMOS transistor - A SiC region and a source/drain region are formed such that the SiC region includes a first portion overlapping the source/drain region and a second portion protruding from the source/drain region to a position beneath the LDD region. The concentration of crystalline SiC in the second portion is higher than the concentration of crystalline SiC in the first portion. The SiC region may be formed through a normal implantation before the second spacer is formed, or the SiC region may be formed through a tilt implantation or deposition epitaxially in a recess having a sigma-shape like sidewall after the second spacer is formed. 04-05-2012 20120220113 Method of Manufacturing Semiconductor Device Having Metal Gate - The present invention provides a method of manufacturing semiconductor device having metal gate. First, a substrate is provided. A first conductive type transistor having a first sacrifice gate and a second conductive type transistor having a second sacrifice gate are disposed on the substrate. The first sacrifice gate is removed to form a first trench and then a first metal layer and a first material layer are formed in the first trench. Next, the first metal layer and the first material layer are flattened. The second sacrifice gate is removed to form a second trench and then a second metal layer and a second material layer",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}