{
    "relation": [
        [
            "Aperçu de la référence bibliographique",
            "Propagation of human embryonic stem cells in a microporous membrane-based indirect co-culture system Kelsey Albert, Steven Sheridan, Louise Laurent, Igor Ulitsky, Ron Shamir, Jeanne Loring, & Raj R. Rao Biochemical and Biophysical Research Communications 2010",
            "Effects of cimetidine on the biological behaviors of human gastric cancer cells Jiang CG, Liu FR, Xu HM, Wu T, Gao J. Zhonghua Yi Xue Za Zhi. 2006 Jul 11;86(26):1813-6 2006",
            "Overexpression of TIMP-1 mediated by recombinant adenovirus in hepatocellular carcinoma cells inhibits proliferation and invasion in vitro Xia D, Yan LN, Xie JG, Tong Y, Yan ML, Wang XP, Zhang MM, Zhao LY. Hepatobiliary Pancreat Dis Int. 2006 Aug;5(3):409-15. 2006",
            "Glucose utilization by the retinal pigment epithelium: evidence for rapid uptake and storage in glycogen, followed by glycogen utilization. Senanayake P, Calabro A, Hu JG, Bonilha VL, Darr A, Bok D, Hollyfield JG. Exp Eye Res. 2006 Aug;83(2):235-46. Epub 2006 May 11. 2006",
            "A comparison of polarized and non-polarized human endometrial monolayer culture systems on murine embryo development. Baghaban Eslami Nejad MR, Rezazadeh Valojerdi M, Kazemi Ashtiani S. J Exp Clin Assist Reprod. 2005 Apr 19;2(1):7. 2005"
        ],
        [
            "Application",
            "",
            "",
            "",
            "Cell Culture",
            "Cell Culture"
        ]
    ],
    "pageTitle": "Plaques d'inserts 24 & 96 puits Millicell pour la culture cellulaire - Multiwell Plates",
    "title": "",
    "url": "http://www.emdmillipore.com/INTL/fr/product/,MM_NF-C10584",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426063411,
    "recordOffset": 426002548,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Brochure Documentation Cancel OK Retourner en haut de la page var priceErrorMessage = \"Le prix n\\'a pas pu être récupéré\";",
    "textAfterTable": "Millicell Cell Culture Plate Inserts: For attachment-dependent, suspension cell or organotypic growth with apical and basolateral access Références bibliographiques Aperçu de la référence bibliographique Application Propagation of human embryonic stem cells in a microporous membrane-based indirect co-culture system Kelsey Albert, Steven Sheridan, Louise Laurent, Igor Ulitsky, Ron Shamir, Jeanne Loring, & Raj R. Rao Biochemical and Biophysical Research Communications 2010 Effects of cimetidine on the biological behaviors of human gastric cancer cells Jiang CG, Liu FR, Xu HM, Wu T, Gao J. Zhonghua Yi Xue Za Zhi. 2006 Jul 11;86(26):1813-6 2006 Overexpression of TIMP-1 mediated by recombinant adenovirus in hepatocellular carcinoma cells inhibits proliferation and invasion in vitro Xia D, Yan LN, Xie JG, Tong Y, Yan ML, Wang XP, Zhang MM, Zhao LY. Hepatobiliary Pancreat Dis Int. 2006 Aug;5(3):409-15. 2006 Glucose utilization by the retinal pigment epithelium: evidence for rapid uptake and storage in glycogen, followed by glycogen utilization. Senanayake P, Calabro A, Hu JG, Bonilha VL, Darr A, Bok",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}