{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "What to do for fun",
            "In three sentences"
        ],
        [
            "Comments",
            "None",
            "Activities every weekend, clubs, intramurals, sports",
            "A friendly school with great professors. Love the food, sports complexes and people. Go hounds!"
        ]
    ],
    "pageTitle": "Assumption College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Assumption-College/reviews?_escaped_fragment_=/show/18009",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897993539,
    "recordOffset": 897956003,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{140144=The Valley is where all the sports seniors live and is the biggest party area on campus. However, most parties are broken up by 9pm because of how hectic they get. Every year in April before finals we have something called 'Pup Cup' where freshmen and sophomores compete in sports to see which class is better. Plus there's a mini carnival during the day and good food., 27077=1. Get involved in the various clubs and activities that Assumption provides. 2. Use the tutoring center and you professors office hours, it may be the difference between an A and A-. 3. Make friends with more than one group of people, its nice to have multiple options for plans on the weekends. 4. 8:30 AM classes are worth it if your taking a class with the best professor. 5. Manage your time effectively and efficiently., 162125=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/28/2009 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 34 Giovanna from Billerica, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Am enjoying being here Personally, I had a tough time adjusting because I made the wrong decisions, but I guarantee that AC has something for you. There are many ways to get active on and off campus. For example, there are many nights when Charlie's (one cafeteria at AC) is packed with students waiting for the student- run concert to begin. AC also has many clubs and if you do not find one you like it is very easy to start your own. The campus is in a secluded area and transportation off campus is hard to come buy especially when they offer a bus serivce to the mall only on Friday. There are always taxis, but those are expensive. And finally for those late- night trips to where ever AC has serivce called Safe Ride. Am learning a lot You might think that all you could learn at a Liberal Arts College is art appreciation and how to analyze someone. Assumption College does offer that and much more. At first, I did not want to go here, my mother encouraged me to, but then I got to the classes. They are well rounded, the professors are personable outside the classroom, very knowledgable, make themselves available and definetly in the top of their field. There are required classes every student has to take, but",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}