{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "31,617",
            "11,909",
            "10,861",
            "4,591",
            "317",
            "86,153"
        ],
        [
            "Congregations",
            "76",
            "32",
            "3",
            "11",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Pittsboro, Indiana (IN 46167) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Pittsboro-Indiana.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00197-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367869263,
    "recordOffset": 367736939,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{29803=On 5/14/1972, a category F4 (max. wind speeds 207-260 mph) tornado 21.3 miles away from the Pittsboro town center injured 20 people and caused between $50,000 and $500,000 in damages., 15098=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 10.4. This is significantly worse than average. Closest monitor was 13.2 miles away from the city center., 14353=Sulfur Dioxide (SO2) [ppb] level in 2012 was 3.58. This is significantly worse than average. Closest monitor was 12.5 miles away from the city center., 29522=On 4/11/1965, a category F4 tornado 24.1 miles away from the town center killed 28 people and injured 123 people and caused between $5,000,000 and $50,000,000 in damages., 613=Graphs represent county-level data. Detailed 2008 Election Results, 12904=Particulate Matter (PM10) [µg/m3] level in 2012 was 19.7. This is about average. Closest monitor was 4.4 miles away from the city center., 2041=1996 Presidential Elections Results, 5259=Educational Attainment (%) in 2013, 15816=Carbon Monoxide (CO) [ppm] level in 2012 was 0.307. This is about average. Closest monitor was 16.0 miles away from the city center., 1469=2004 Presidential Elections Results, 12155=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 11.1. This is worse than average. Closest monitor was 14.2 miles away from the city center., 13609=Ozone [ppb] level in 2012 was 26.4. This is better than average. Closest monitor was 8.2 miles away from the city center., 44168=According to our research of Indiana and other state lists there were 6 registered sex offenders living in Pittsboro, Indiana as of August 04, 2015. The ratio of number of residents in Pittsboro to the number of sex offenders is 511 to 1. The number of registered sex offenders compared to the number of residents in this city is near the state average., 4861=School Enrollment by Level of School (%) in 2013, 1755=2000 Presidential Elections Results, 11400=Lead (Pb) [µg/m3] level in 2008 was 0.00840. This is significantly better than average. Closest monitor was 11.4 miles away from the city center., 16476=Air Quality Index (AQI) level in 2012 was 110. This is significantly worse than average., 897=2012 Presidential Elections Results, 1183=2008 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{17033=7.43% of this county's 2010 resident taxpayers moved to other counties in 2011 ($42,507 average adjusted gross income), 95871=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 94548=Total of 114 patent applications in 2008-2015., 14823=8.10% of this county's 2011 resident taxpayers lived in other counties in 2010 ($44,123 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Pittsboro town (based on Hendricks County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Utility gas (45%) Electricity (54%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 9 Hendricks County: 0.67 / 10,000 pop. Indiana: 1.73 / 10,000 pop. Number of supercenters and club stores: 4 This county: 0.30 / 10,000 pop. State: 0.21 / 10,000 pop. Number of convenience stores (no gas): 2 Hendricks County: 0.15 / 10,000 pop. Indiana: 0.50 / 10,000 pop. Number of convenience stores (with gas): 43 Hendricks County: 3.20 / 10,000 pop. State: 3.57 / 10,000 pop. Number of full-service restaurants: 91 Here: 6.78 / 10,000 pop. State: 6.78 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}