{
    "relation": [
        [
            "Revised Section",
            "22501",
            ""
        ],
        [
            "Source (U.S. Code)",
            "36:91.",
            "36:92. 36:95 (words between colon and 1st comma). 36:103. 36:105."
        ],
        [
            "Source (Statutes at Large)",
            "Feb. 24, 1925, ch. 303, §§1, 2, 5 (words between colon and 1st comma), 13, 15, 43 Stat. 966, 967, 968.",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "Historical and Revision Notes",
    "url": "http://uscode.house.gov/download/annualhistoricalarchives/XHTML/1999/1999usc36.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 252971631,
    "recordOffset": 252837059,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{24192=“(a) No Substantive Change.—(1) Section 1 of this Act restates, without substantive change, laws enacted before September 5, 1998, that were replaced by section 1. Section 1 may not be construed as making a substantive change in the laws replaced., 1489=This title was enacted by Pub. L. 105–225, §1, Aug. 12, 1998, 112 Stat. 1253}",
    "TableContextTimeStampAfterTable": "{192258=Proc. No. 4934, Apr. 16, 1982, 47 F.R. 16767, provided:, 452094=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1270; Pub. L. 106–117, title VI, §§602, 604(3), Nov. 30, 1999, 113 Stat. 1578, 1580.), 572955=In subsection (a), authorizations of appropriations for fiscal years 1993–1996 are omitted as obsolete., 875476=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1293.), 518082=(2) In this section, the term “World War II memorial” means the memorial authorized by Public Law 103–32 (40 U.S.C. 1003 note) to be established by the Commission on Federal land in the District of Columbia or its environs to honor members of the Armed Forces who served in World War II and to commemorate the participation of the United States in that war., 192713=NOW, THEREFORE, I, RONALD REAGAN, President of the United States of America and Commander in Chief of the Armed Forces of the United States, continuing the precedent of my seven immediate predecessors in this Office, do hereby proclaim the third Saturday of each May as Armed Forces Day., 1214042=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1315.), 991033=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1300.), 535582=(4) develop a plan for carrying out the recommendations of the President's Commission on the Holocaust in its report to the President of September 27, 1979, to the extent the recommendations are not otherwise provided for in this chapter., 949696=This amends section 21703(1)(A)(iv) of title 36 to reflect changes made by Public Law 105–110 (Nov. 20, 1997, 111 Stat. 2270)., 548932=In this section, the reference to section 5376 of title 5 is substituted for the reference to grade GS–18 of the General Schedule because of section 529 [101(c)(1)] of the Treasury, Postal Service and General Government Appropriations Act, 1991 (Public Law 101–509, 104 Stat. 1442)., 315189=“(1) December 17, 2003, is the 100th anniversary of the first successful manned, free, controlled, and sustained flight by a power-driven, heavier-than-air machine;, 946443=(vi) December 20, 1989, through January 31, 1990; or, 422820=In subsection (b), the text of section 1084(c) of the National Defense Authorization Act for Fiscal Years 1992 and 1993 (Public Law 102–190, 105 Stat. 1483) is omitted as executed., 417971=(C) Flag Day, June 14., 310502=(1) designating October 15 as White Cane Safety Day; and, 229145=(2) urging the people of the United States to observe Flag Day as the anniversary of the adoption on June 14, 1777, by the Continental Congress of the Stars and Stripes as the official flag of the United States., 455904=In subsection (a), before clause (1), the words “or appropriations” are omitted because of 1:1. In clauses (1) and (5), the words “duties and powers” are substituted for “functions” for consistency in the revised title and with other titles of the United States Code. In clause (2), the words “department, agency, or instrumentality” are substituted for “departments” for consistency in the revised title and with other titles of the Code., 577558=This amends section 2501(2) of title 36 to reflect a change made by section 413 of the Workforce Investment Act of 1998 (Public Law 105–220, Aug. 7, 1998, 112 Stat. 1241)., 433807=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1269; Pub. L. 106–117, title VI, §604(1), Nov. 30, 1999, 113 Stat. 1580.), 321000=“(2) plan and develop, in coordination with the First Flight Centennial Commission, the First Flight Centennial Foundation of North Carolina, and the 2003 Committee of Ohio, programs and activities that are appropriate to commemorate the 100th anniversary of powered flight;, 346238=“There is authorized to be appropriated to carry out this Act $250,000 for fiscal year 1999, $600,000 for fiscal year 2000, $750,000 for fiscal year 2001, $900,000 for fiscal year 2002, $900,000 for fiscal year 2003, and $600,000 for fiscal year 2004.”, 308315=(1) calling on officials of the United States Government to display the flag of the United States on all Government buildings on April 13; and, 297948=(1) designating the week in which May 15 occurs as Police Week in recognition of the service given by men and women who stand guard to protect the people of the United States through law enforcement; and, 171238=“(2) Laws enacted after September 4, 1998, that are inconsistent with this Act supersede this Act to the extent of the inconsistency., 757922=Not later than December 1 of each year, the corporation shall submit a report to Congress on the activities of the corporation during the prior calendar year, including a complete statement of its receipts and expenditures. The report may not be printed as a public document., 1174086=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1312.), 210227=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1255.), 906242=Pub. L. 85–83, §2, July 3, 1957, 71 Stat. 277, provided that: “The real property situated in Square 817, in the city of Washington, District of Columbia, described as lot 23, owned, occupied, and used by the American Historical Association, is exempt from all taxation so long as the same is so owned and occupied, and not used for commercial purposes, subject to the provisions of sections 2, 3, and 5 of the Act entitled ‘An Act to define the real property exempt from taxation in the District of Columbia’, approved December 24, 1942 (56 Stat. 1089; D.C. Code, secs. 47–801b, 47–801c, and 47–801e) [47–1005, 47–1007, and 47–1009].”, 300605=(2) inviting the governors and mayors of State and local governments to issue proclamations designating the first week in March as Save Your Vision Week;, 936599=The section is added to except the American Hospital of Paris from the application of section 10101 of the revised title, restating 36:1101–1103, which imposes audit requirements on certain federally chartered corporations. The Hospital is not included in the list of corporations set out in 36:1101 to which the audit requirements apply., 506050=1. All functions of administration pertaining to World War II United States Military Cemeteries located in or near Cambridge, England; Margraten, the Netherlands; Hamm, Luxembourg; Henri-Chapelle, Belgium; Neuvilleen-Condroz, Belgium; St. Laurent, France; St. James, France; Epinal, France; St. Avold, France; Draguignan, France; Nettuno (Anzio), Italy; Florence, Italy; Tunis (Carthage), Tunisia; and Ft. McKinley, Philippine Islands, now vested in or exercised by the Secretary of the Army pursuant to the act of May 16, 1946, c. 261, 60 Stat. 182, as amended by the act of August 5, 1947, c. 497, 61 Stat. 779, together with (a) such supplies, equipment, temporary structures, utilities and facilities pertaining thereto as are located therein or are in depots or other places overseas under the jurisdiction of the American Graves Registration Service and are determined by the American Battle Monuments Commission to be required for the discharge of its responsibilities under this order, and (b) the cemetery records currently maintained for the operation of such cemeteries, including records pertinent to the acquisition of real estate upon which the cemeteries and their appurtenances are situated, are hereby transferred to the American Battle Monuments Commission; such transfer to become effective as to any particular cemetery or group of cemeteries upon the completion of the operational mission of the Department of the Army with respect to such cemetery or group of cemeteries, but in no instance later than December 31, 1951, or at such earlier date as may be determined by the President or the Congress pursuant to the said act of May 16, 1946, as amended by the act of August 5, 1947., 1021955=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1302.), 785610=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1290.), 709239=(Added Pub. L. 105–354, §1(4)(A), Nov. 3, 1998, 112 Stat. 3241.), 456376=In subsection (b), the text of 36:137 is omitted as superseded. The words “which has been or may after June 26, 1946, be” and “Provided, That this subsection shall not be effective until the expiration of the Surplus Property Act of 1944” are omitted as obsolete. Section 38 of the Surplus Property Act of 1944 (ch. 479, 58 Stat. 784) provided that the Act was to expire 3 years after the cessation of hostilities of World War II. The cessation of hostilities was proclaimed on December 31, 1946, by Proclamation No. 2714, 12 Fed. Reg. 1. However, section 602(a)(1) of the Federal Property and Administrative Services Act of 1949 (ch. 288, 63 Stat. 399) [renumbered by section 6(a) and (b) of the Act of September 5, 1950 (ch. 849, 64 Stat. 583)] repealed the Surplus Property Act of 1944 effective July 1, 1949 (except for sections 13(d), (g), and (h), 28, and 32(b)(2)). Section 13(d), concerning power transmission lines, and section 13(g), concerning property for public airports, do not involve the American Battle Monuments Commission. Section 13(h) was repealed by section 2 of the Act of August 4, 1972 (Public Law 92–362, 86 Stat. 504). Section 28 was repealed by section 21 of the Act of June 25, 1948 (ch. 645, 62 Stat. 868). Section 32(b)(2) was repealed by section 111(a)(1) of the Mutual Educational and Cultural Exchange Act of 1961 (Public Law 87–256, 75 Stat. 538)., 526405=(Added Pub. L. 106–117, title VI, §601(a)(1), Nov. 30, 1999, 113 Stat. 1576.), 904654=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1295.), 303972=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1262.), 261755=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1259.), 220966=(1) designating the second Monday in October as Columbus Day;, 290337=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1261.), 418035=(D) Independence Day, July 4., 203263=(1) designating February as American Heart Month;, 1109089=In subsection (b), the words “before July 24, 1947” are substituted for “heretofore” for clarity. The words “and accrue” are omitted as unnecessary., 176163=Pub. L. 105–225, §6(b), Aug. 12, 1998, 112 Stat 1499, repealed specified laws, except for rights and duties that matured, penalties that were incurred, and proceedings that were begun before Aug. 12, 1998., 857000=(Added Pub. L. 105–354, §1(5)(A), Nov. 3, 1998, 112 Stat. 3244.), 401482=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1266.), 678862=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1286.), 953134=In this section, the text of 36:47 is omitted as executed and obsolete., 1124792=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1309.), 802610=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1291.), 946537=(vii) August 2, 1990, through the date of cessation of hostilities, as decided by the United States Government; or, 839703=(Added Pub. L. 105–354, §1(5)(A), Nov. 3, 1998, 112 Stat. 3243.), 287453=(1) designating the week that includes the third Friday of May as National Transportation Week; and, 496745=A claim against the American Battle Monuments Commission that is similar to a claim described in section 2734 of title 10, that is based on damage to, or loss or destruction of, property, or personal injury or death of an individual, and that is caused by the negligent or wrongful act or omission of an officer or civilian employee of the Commission acting within the scope of the officer's or employee's office or employment, may be settled, decided, and paid as provided in section 2734 for the settlement of Army claims. However, the Secretary of the Army may appoint an officer or employee of the Commission to a claims commission or as an officer to approve settlements of claims made by the claims commission. All payments in settlement of a claim shall be made out of appropriations made to carry out this chapter., 314748=Pub. L. 105–389, Nov. 13, 1998, 112 Stat. 3486, as amended by Pub. L. 106–68, §1, Oct. 6, 1999, 113 Stat. 981, provided that:, 773519=The words “and in conformity with the laws of the State or States in which it is incorporated” in 36:1906 and “and in conformity with the laws of the State or States wherein it is incorporated” in 36:1907 are omitted as unnecessary., 194262=Proclamation 4571 of May 15, 1978, is hereby superseded., 209210=(1) to issue each year a proclamation designating April as Cancer Control Month; and, 504385=By virtue of the authority vested in me by section 12 of the act of March 4, 1923, as amended by the act of June 26, 1946, 60 Stat. 318 [now subsec. (b) of this section], and as President of the United States, it is hereby ordered as follows:, 1156703=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1311.), 480097=This section is referred to in section 2103 of this title., 381520=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1265.), 498696=The words “section 2734 of title 10” and “section 2734” are substituted for “the first section of the Act entitled ‘An Act to provide for the prompt settlement of claims for damages occasioned by Army, Navy, and Marine Corps forces in foreign countries’, approved January 2, 1942 (55 Stat. 880, as amended; 31 U.S.C. 224d)” and “such Act”, respectively, in section 12 (4th par.) of the Act of March 4, 1923 (ch. 283), as added by section 4(c)(3) of the Act of July 25, 1956 (ch. 721, 70 Stat. 642), because of section 49(b) of the Act of August 10, 1956 (ch. 1041, 70A Stat. 640). The 1942 law enacted former 31:224d, 224h, and 224i. Those sections subsequently were codified as 10:2734 and repealed by the Act of August 10, 1956 (ch. 1041, 70A Stat. 154, 672). The words “both real and personal” are omitted as unnecessary. The words “on or after July 25, 1956” are omitted as obsolete. The words “or commissions” are omitted because of 1:1. The words “settled, decided” are substituted for “considered, ascertained, adjusted, determined” to eliminate unnecessary words., 985335=Not later than January 1 of each year, the corporation shall submit a report to Congress on the activities of the corporation during the prior calendar year, including a complete report of its receipts and expenditures. The report may not be printed as a public document., 175419=Pub. L. 105–354, §5(a), Nov. 3, 1998, 112 Stat. 3245, provided that: “The repeal of a law by this Act may not be construed as a legislative inference that the provision was or was not in effect before its repeal.”, 173007=Pub. L. 105–225, §5, Aug. 12, 1998, 112 Stat. 1499, provided that:, 547607=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1278.), 1110391=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1308.), 753454=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1288.), 355553=Proc. No. 5574, Nov. 20, 1986, 51 F.R. 42197, provided:, 556836=Pub. L. 101–45, title II, June 30, 1989, 103 Stat. 125, provided that:, 404021=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1267.), 417798=(A) Armed Forces Day, the third Saturday in May., 535257=(3) plan, construct, and operate a permanent living memorial museum to the victims of the Holocaust in cooperation with the Secretary of the Interior and other departments, agencies, and instrumentalities of the United States Government as provided in section 2305 of this title; and, 621426=(2) The report may not be printed as a public document, except as part of proceedings authorized to be printed under section 1332 of title 44., 175912=Pub. L. 105–225, §6(a), Aug. 12, 1998, 112 Stat 1499, provided that: “The repeal of a law by this Act may not be construed as a legislative inference that the provision was or was not in effect before its repeal.”, 628869=This section is referred to in sections 20212, 20307, 20712, 20913, 21012, 21112, 21507, 22912, 23109, 40112, 40707, 50112, 60112, 70112, 70312, 70708, 100112, 110112, 130510, 140712, 150113, 150909, 151108, 151512, 152112, 152913, 153510, 154512, 154713, 170313, 170512, 190313, 200106, 210107, 210313, 220314, 220712, 230513, 240112 of this title; title 16 sections 583j–5, 3706, 5807; title 20 section 5509., 265750=The President may issue each year a proclamation designating February 1 as National Freedom Day to commemorate the signing by Abraham Lincoln on February 1, 1865, of the joint resolution adopted by the Senate and the House of Representatives that proposed the 13th amendment to the Constitution., 234735=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1257.), 482253=The words “Secretary of Veterans Affairs” are substituted for “Secretary of the Army” because of section 6 of the National Cemeteries Act of 1973 (Public Law 93-43, 38 U.S.C. 2404 note), which transferred jurisdiction over and responsibility for the national cemeteries (with certain exceptions) from the Secretary of the Army to the Administrator of Veterans’ Affairs. The words “as may be determined by the Commission” are omitted as unnecessary., 568759=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1280.), 501207=(A) the same administrative duties and powers related to a permanent military cemetery located outside the United States and the territories and possessions of the United States that were transferred to the Commission by Executive Order 6614, February 26, 1934, and Executive Order 10057, May 14, 1949, as amended by Executive Order 10087, December 3, 1949; and, 626702=In this section, the text of 36:1101 is omitted as unnecessary because of the addition of the words “Except as otherwise provided” in subsection (a) of this section. The text of 36:1166, 1213(a), and 5206(a) is omitted as unnecessary because of the restatement of 36:1102 and 1103 as general provisions covering, except as otherwise provided, all federally chartered corporations referred to in part B of subtitle II of the revised title. The text of 36:1084 (less (b) (2d sentence cl. (2))), 4315 (less (b) (2d sentence cl. (2))), 4514 (less (b) (2d sentence cl. (2))), and 4610 (less (b) (2d sentence cl. (2))) is omitted as unnecessary because of the restatement in this section of the general audit provisions of 36:1102 and 1103., 524341=(2) A person providing voluntary services under this subsection shall be considered to be a Federal employee for purposes of chapter 81 of title 5, relating to compensation for work-related injuries, and chapter 171 of title 28, relating to tort claims. A volunteer who is not otherwise employed by the United States shall not be considered to be a Federal employee for any other purpose by reason of the provision of such voluntary service, except that any volunteer given responsibility for the handling of funds or the carrying out of a Federal function is subject to the conflict of interest laws contained in chapter 11 of title 18 and the administrative standards of conduct contained in part 2635 of title 5 of the Code of Federal Regulations., 475667=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1272.), 417888=(B) Memorial Day, the last Monday in May., 253062=The President shall issue each year a proclamation designating the first Thursday in May as a National Day of Prayer on which the people of the United States may turn to God in prayer and meditation at churches, in groups, and as individuals., 250887=(1) designating August 19 as National Aviation Day;, 886655=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1294.), 423183=This amends section 902 of title 36 to reflect changes made by section 1082 of the National Defense Authorization Act for Fiscal Year 1998 (Public Law 105–85, Nov. 18, 1997, 111 Stat. 1917, 36 App. U.S.C. 189a)., 690678=(Added Pub. L. 105–354, §1(4)(A), Nov. 3, 1998, 112 Stat. 3239.), 440389=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1269; Pub. L. 105–354, §1(2), Nov. 3, 1998, 112 Stat. 3239; Pub. L. 106–117, title VI, §604(2), Nov. 30, 1999, 113 Stat. 1580.), 450278=(A) by March 1 of each year (beginning with 1998)—, 497680=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1276.), 441900=Sept. 26, 1996, Pub. L. 104–204, title III, (1st, last provisos in par. under heading “American Battle Monuments Commission”), 110 Stat. 2907., 1067515=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1305.), 735667=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1287.), 508712=By the authority vested in me as President by the Constitution and the laws of the United States of America, including Section 10 of the Act of March 4, 1923 (42 Stat. 1509), as amended (36 U.S.C. 132) [now subsec. (b) of this section], and to implement the intent of the United States Senate (124 Cong. Rec. S3857 of March 16, 1978) as set forth by Reservations (1) and (3) to the Resolution of Ratification of the Treaty Concerning the Permanent Neutrality and Operation of the Panama Canal, it is hereby ordered as follows:, 1005029=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1301.), 530890=This section is referred to in section 2113 of this title., 379801=In subsection (c), the words “illumination or other” are omitted as unnecessary. The words “department, agency, or instrumentality” are substituted for “agency” for consistency in the revised title and with other titles of the United States Code. The words “or agencies” are omitted because of 1:1. The words “in connection with the installation, operation, or removal of a temporary overhead conductor or electrical facility” are added for clarity., 558391=This section is referred to in section 2301 of this title., 209336=(2) to invite each year the chief executive officers of the States, territories, and possessions of the United States to issue proclamations designating April as Cancer Control Month., 278331=(2) all departments, agencies, and instrumentalities of the United States Government, and interested organizations, groups, and individuals, to fly the flag of the United States at halfstaff each December 7 in honor of the individuals who died as a result of their service at Pearl Harbor., 194724=Ex. Ord. No. 13072, Feb. 2, 1998, 63 F.R. 6041, provided:, 768189=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1289.), 520775=(3) to secure, obtain, register, enforce, protect, and license any mark, copyright, or patent that is owned by, assigned to, or licensed to the Commission under section 2114 of this title to aid or facilitate the construction of the World War II memorial., 946184=(iii) June 25, 1950, through January 31, 1955;, 754335=In subsection (a), the words “When requested by the Secretary of the Army, Air Force, or Navy, the corporation” are substituted for “The American Chemical Society shall, whenever called upon by the Army, Air Force, or Navy Department” because under 10:3013, 5013, and 8013 the Secretaries are the heads of the Departments. The Secretary of the Air Force is added because of section 207 of the National Security Act of 1947 (ch. 343, 61 Stat. 502)., 355124=The text of 36:187 (words after comma) is omitted as executed because the proclamation was made on November 20, 1986. See Proclamation No. 5574, 51 Fed. Reg. 42197., 940791=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1297.), 740253=This section is added to except the American Academy of Arts and Letters from the application of section 10101 of the revised title, restating 36:1101–1103, which imposes audit requirements on certain federally chartered corporations. The Academy is not included in the list of corporations set out in 36:1101 to which the audit requirements apply., 198468=(1) Mark the 200th anniversary of the occupancy of the White House by American Presidents, the 200th anniversary of the establishment of the Federal capital city in Washington, D.C., and the 200th anniversary of the first meeting of the Congress in the Capitol, celebrating these events in the year 2000 as milestones in our democratic system of government;, 818891=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1292.), 240336=The President may issue each year a proclamation designating October 9 as Leif Erikson Day., 365405=In this chapter, the word “Mayor” is substituted for “Commissioners” in the Presidential Inaugural Ceremonies Act (ch. 974, 70 Stat. 1049) [subsequently changed to “Commissioner” in 36:ch. 30 because section 401 of Reorganization Plan No. 3 of 1967 (5 App. U.S.C.) transferred the functions of the Board of Commissioners of the District of Columbia to the Commissioner of the District of Columbia and because of 36:730] because of sections 421 and 711 of the District of Columbia Self-Government and Governmental Reorganization Act (Public Law 93–198, 87 Stat. 789, 818), which abolished the office of Commissioner of the District of Columbia and replaced it with the office of Mayor of the District of Columbia., 697521=(Added Pub. L. 105–354, §1(4)(A), Nov. 3, 1998, 112 Stat. 3240.), 780530=The corporation shall maintain its status as an organization exempt from taxation under the Internal Revenue Code of 1986 (26 U.S.C. 1 et seq.). If the corporation does not maintain that status, the charter granted by this chapter expires., 879534=The words “and in conformity with the laws of the State or States in which it is incorporated” in 36:2406 and “and in conformity with the laws of the State or States wherein it is incorporated” in 36:2407 are omitted as unnecessary., 215001=(1) designating the first Monday in October as Child Health Day; and, 1075293=This section is referred to in section 22504 of this title., 949988=1998—Par. (1)(A)(iv). Pub. L. 105–354 substituted “February 28, 1961” for “December 22, 1961”., 508621=Ex. Ord. No. 12115, Jan. 19, 1979, 44 F.R. 4645, provided:, 527118=Pub. L. 106–117, title VI, §601(c), Nov. 30, 1999, 113 Stat. 1578, provided that: “Upon the enactment of this Act [Nov. 30, 1999], the Secretary of the Treasury shall transfer amounts in the fund created by section 4(a) of Public Law 103–32 (40 U.S.C. 1003 note) to the fund created by section 2113(b) of title 36, United States Code, as added by subsection (a).”, 430941=1999—Pub. L. 106–117, title VI, §§601(a)(2), 603(b), Nov. 30, 1999, 113 Stat. 1578, 1579, added items 2113 and 2114., 261431=(1) designating the week in which June 14 falls as National Flag Week; and, 1009506=Pub. L. 86–208, Aug. 25, 1959, 73 Stat. 431, provided: “That the American Society of International Law, incorporated by the Act entitled ‘An Act to incorporate the American Society of International Law, and for other purposes’, approved September 20, 1950 (Public Law 794, ch. 958, Eighty-first Congress, second session (64 Stat. 869)) [now this chapter], is authorized to use the real estate described as lot 805 square 2512, situated in the city of Washington, District of Columbia, as the national headquarters of such society.”, 955358=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1298.), 345036=“(2) The term ‘centennial of powered flight’ means the anniversary year, from December 2002 to December 2003, commemorating the 100-year history of aviation beginning with the First Flight and highlighting the achievements of the Wright brothers in developing the technologies which have led to the development of aviation as it is known today., 510987=1–104. The Secretary of Defense shall, to the extent funds are available, disinter from Corozal Cemetery and transport to the United States for reinterment the remains of United States citizens, and the remains of members of their immediate family buried with them, whose next of kin requests in writing by April 1, 1982, that such remains be transported to the United States for reinterment., 387590=This section is referred to in title 10 section 2543., 295008=(1) designating May 15 as Peace Officers Memorial Day in honor of Federal, State, and local officers killed or disabled in the line of duty;, 516793=The last sentence of the Act of August 13, 1957 (Public Law 85–125, 71 Stat. 344), is omitted as obsolete., 1089273=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1306.), 345523=“(4) The term ‘First Flight’ means the first four successful manned, free, controlled, and sustained flights by a power-driven, heavier-than-air machine, which were accomplished by Orville and Wilbur Wright of Dayton, Ohio on December 17, 1903 at Kitty Hawk, North Carolina., 418185=(F) Veterans Day, November 11., 519250=(E) Any funds received by the Commission under section 2114 of this title in exchange for use of, or the right to use, any mark, copyright or patent., 223564=(1) designating September 17 through September 23 as Constitution Week; and, 508082=3. There shall be transferred to the American Battle Monuments Commission so much of the unexpended balances of appropriations now, or which may become, available to the Department of the Army for the performance of the functions transferred by the provisions of this order as the Director of the Bureau of the Budget may deem necessary for use prior to July 1, 1950, in connection with such functions., 1140451=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1310.), 368734=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1264.), 221604=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1256.), 1096934=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1307.), 481291=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1274.), 947209=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1297; Pub. L. 105–354, §1(6), Nov. 3, 1998, 112 Stat. 3244.), 530549=(Added Pub. L. 106–117, title VI, §603(a), Nov. 30, 1999, 113 Stat. 1579.), 270040=(1) designating September 15 through October 15 as National Hispanic Heritage Month; and, 830483=(Added Pub. L. 105–354, §1(5)(A), Nov. 3, 1998, 112 Stat. 3242.), 267869=(1) designating the first Sunday in September after Labor Day as National Grandparents Day; and, 255208=(1) designating the third Friday in May as National Defense Transportation Day; and, 289652=(1) designating December 17 as Pan American Aviation Day; and, 246948=In subsection (a), the designation is added, and the words “last Monday in May” are substituted for “May 30” in the Act of May 11, 1950 (ch. 182, 64 Stat. 158), because of section 1(b) of the Act of June 28, 1968 (Public Law 90–363, 82 Stat. 250)., 438593=(1) at least 50 individuals in the competitive service (as defined in section 2102 of title 5), of whom at least 43 shall be assigned to duty in foreign countries where the cemeteries, monuments, and memorials are located; and, 512955=(c) The Governor shall also provide notice to the next of kin of such deceased who are buried in Corozal Cemetery that the Government will disinter and transport such deceased to the United States for reinterment in a cemetery or other burial site designated by the next of kin, if the next of kin so requests in writing not later than April 1, 1982., 946093=(ii) December 7, 1941, through December 31, 1946;, 805762=The words “and in conformity with the laws of the State or States in which it is incorporated” in 36:2106 and “and in conformity with the laws of the State or States wherein it is incorporated” in 36:2107 are omitted as unnecessary., 526699=The World War II 50th Anniversary Commemorative Coins Act, referred to in subsec. (b)(1)(C) is Pub. L. 102–414, Oct. 14, 1992, 106 Stat. 2106, which is classified as a note under section 5112 of Title 31, Money and Finance., 308499=(2) inviting the people of the United States to observe April 13 in schools and churches, or other suitable places, with appropriate ceremonies in commemoration of Thomas Jefferson's birthday., 616895=1998—Pub. L. 105–354, §1(4)(B), (5)(B), Nov. 3, 1998, 112 Stat. 3241, 3244, added items for chapters 202 and 210., 248846=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1258.), 276000=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1260.), 505615=Ex. Ord. No. 10057, May 14, 1949, 14 F.R. 2585, as amended Ex. Ord. 10087, Dec. 3, 1949, 14 F.R. 7287, provided:, 946272=(iv) February 28, 1961, through May 7, 1975;, 280879=The President is requested to issue each year a proclamation designating the third week in March as National Poison Prevention Week to aid in encouraging the people of the United States to learn of the dangers of accidental poisoning and to take preventive measures that are warranted by the seriousness of the danger., 566525=In subsection (c), the words “temporary or intermittent” are added for clarity and consistency with 5:3109. The reference to section 5376 of title 5 is substituted for the reference to grade GS–18 of the General Schedule because of section 529 [101(c)(1)] of the Treasury, Postal Service and General Government Appropriations Act, 1991 (Public Law 101–509, 104 Stat. 1442)., 870234=36:2415., 1037687=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1303.), 575713=(1) notwithstanding section 1342 of title 31, may accept voluntary and uncompensated services; and, 461732=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1271.), 436280=Subsection (c) is based on 36:122 which is from the 2d proviso in the paragraph under the heading “American Battle Monuments Commission” in title III of the Departments of Veterans Affairs and Housing and Urban Development, and Independent Agencies Appropriations Act, 1997 (Public Law 104–204, 110 Stat. 2907). The provision has been repeated each year in prior appropriations acts and therefore is restated as a permanent provision. For prior provisions, see citations under 36:122 (1994 ed.). In the restatement, the words “in the same way as” are substituted for “as provided for” for clarity and consistency in the revised title., 667526=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1285.), 535937=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1277.), 559797=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1279.), 459239=This section is referred to in sections 2106, 2113 of this title., 170247=Pub. L. 105–225, §1, Aug. 12, 1998, 112 Stat. 1253, provided in part that: “Certain general and permanent laws of the United States, related to patriotic and national observances, ceremonies, and organizations, are revised, codified, and enacted as title 36, United States Code, ‘Patriotic and National Observances, Ceremonies, and Organizations’ ”., 576060=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1280; Pub. L. 105–354, §1(3), Nov. 3, 1998, 112 Stat. 3239.), 946006=(i) April 6, 1917, through November 11, 1918;, 424079=Section 1082(j), which repealed section 1084 of Public Law 102–190 (previously restated as subsections (b) and (c) of section 902 of title 36), is repealed as executed., 544959=In subsection (f)(1), the reference to section 5376 of title 5 is substituted for the reference to grade GS–18 of the General Schedule because of section 529 [101(c)(1)] of the Treasury, Postal Service and General Government Appropriations Act, 1991 (Public Law 101–509, 104 Stat. 1442). The word “actual” is omitted as unnecessary., 194351=IN WITNESS WHEREOF, I have hereunto set my hand this 16th day of April, in the year of our Lord nineteen hundred and eighty-two and of the Independence of the United States of America the two hundred and sixth., 170801=Pub. L. 105–354, §4, Nov. 3, 1998, 112 Stat. 3245, provided that:, 175670=Pub. L. 105–354, §5(b), Nov. 3, 1998, 112 Stat. 3245, repealed specified laws, except for rights and duties that matured, penalties that were incurred, and proceedings that were begun before Nov. 3, 1998., 317237=“(4) The chairman of the 2003 Committee of Ohio to represent the interests of the 2003 Committee., 375608=In subsection (d), the words “department, agency, or instrumentality” are substituted for “agency” for consistency in the revised title and with other titles of the United States Code. The words “or agencies” are omitted because of 1:1., 972695=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1299.), 222473=In clause (1), the words “the 2d Monday in October” are substituted for “October 12” in the Act of April 30, 1934 (ch. 184, 48 Stat. 657), because of section 1(b) of the Act of June 28, 1968 (Public Law 90–363, 82 Stat. 250)., 1188055=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1313.), 358529=The composition by John Philip Sousa entitled “The Stars and Stripes Forever” is the national march., 203874=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1254.), 946358=(v) August 24, 1982, through July 31, 1984;, 421331=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1268; Pub. L. 105–354, §1(1), Nov. 3, 1998, 112 Stat. 3238.), 272702=(2) all departments, agencies, and instrumentalities of the United States Government, and interested organizations, groups, and individuals, to fly the flag of the United States at halfstaff on July 27 of each year until 2003 in honor of the individuals who died as a result of their service in Korea., 357437=IN WITNESS WHEREOF, I have hereunto set my hand this twentieth day of November, in the year of our Lord nineteen hundred and eighty-six, and of the Independence of the United States of America the two hundred and eleventh., 465998=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1271; Pub. L. 105–368, title IV, §403(d)(1), Nov. 11, 1998, 112 Stat. 3339.), 442889=Subsections (b) and (c) are based in part on 36:121b and 122a, which are from the first and last provisos in the paragraph under the heading “American Battle Monuments Commission” in title III of the Departments of Veterans Affairs and Housing and Urban Development, and Independent Agencies Appropriations Act, 1997 (Public Law 104–204, 110 Stat. 2907). The provisions have been repeated each year in prior appropriations acts and therefore are restated as permanent provisions. For prior provisions, see citations under 36:121b and 122a (1994 ed.)., 505760=By virtue of the authority vested in me by section 12 of the act of March 4, 1923, 42 Stat. 1509, as amended by the act of June 26, 1946, 60 Stat. 318 [now subsec. (b) of this section], and as President of the United States, it is hereby ordered as follows:, 205217=Pub. L. 105–277, div. C, title I, §142(a), Oct. 21, 1998, 112 Stat. 2681–603, provided that: “This section [enacting section 220512 of this title, amending sections 220501, 220503 to 220506, 220509 to 220511, 220521 to 220524, and 220528 of this title, and enacting provisions set out as a note under section 220501 of this title] may be cited as the ‘Olympic and Amateur Sports Act Amendments of 1998’.”, 493600=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1275.), 928712=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1296.), 306201=(1) designating January 13 as Stephen Foster Memorial Day; and, 621681=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1283.), 369804=Aug. 6, 1956, ch. 974, §10, as added Jan. 30, 1968, Pub. L. 90–251, §4, 82 Stat. 4., 504295=Ex. Ord. No. 9873, July 16, 1947, 12 F.R. 4777, provided:, 798607=36:2116., 1049299=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1304.), 300498=(1) designating the first week in March as Save Your Vision Week;, 478681=Pub. L. 103–160, div. A, title III, §369, Nov. 30, 1993, 107 Stat. 1634, provided that:, 1196126=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1314.), 423427=Section 1082(g) of that Act, which defined “POW/MIA flag” as used in section 1082 by reference to section 2 of Public Law 101–355, is unnecessary because the two provisions are restated together in section 902 of title 36., 961665=Not later than January 1 of each year, the corporation shall submit a report to Congress on the activities of the corporation during the prior calendar year. The report may not be printed as a public document., 467962=In subsection (b), the words “Secretatry of Veterans Affairs” are substituted for “Department of Defense”, and the words “the National Cemetery System, as described in section 2400(b) of title 38” are substituted for “cemeteries within the United States, its Territories and possessions”, because of section 6 of the National Cemeteries Act of 1973 (Public Law 93-43, 38 U.S.C. 2404 note), which transferred jurisdiction over and responsibility for the national cemeteries (with certain exceptions) from the Secretary of the Army to the Administrator of Veterans’ Affairs., 350353=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1263.), 203354=(2) inviting the chief executive officers of the States, territories, and possessions of the United States to issue proclamations designating February as American Heart Month; and, 653305=(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1284.)}",
    "textBeforeTable": "(Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1254.) (3) urging the people of the United States to recognize the nationwide problem of heart and blood vessel diseases and to support all essential programs required to solve the problem. (2) inviting the chief executive officers of the States, territories, and possessions of the United States to issue proclamations designating February as American Heart Month; and (1) designating February as American Heart Month; The President is requested to issue each year a proclamation— §101. American Heart Month [For abolition of United States Information Agency (other than Broadcasting Board of Governors and International Broadcasting Bureau), transfer of functions, and treatment of references thereto, see sections 6531, 6532, and 6551 of Title 22, Foreign Relations and Intercourse.] William J. Clinton. . 4. Judicial Review. This order does not create any right or benefit, substantive or procedural, enforceable at law by a party against the United States, its agencies, its officers, or any other person. Sec . 3. Administration. To the",
    "textAfterTable": "Pub. L. 105–277, div. C, title I, §142(a), Oct. 21, 1998, 112 Stat. 2681–603, provided that: “This section [enacting section 220512 of this title, amending sections 220501, 220503 to 220506, 220509 to 220511, 220521 to 220524, and 220528 of this title, and enacting provisions set out as a note under section 220501 of this title] may be cited as the ‘Olympic and Amateur Sports Act Amendments of 1998’.” §102. Asian/Pacific American Heritage Month (a) Designation .—May is Asian/Pacific American Heritage Month. (b) Proclamations .—The President is requested to issue each year a proclamation calling on the people of the United States, and the chief executive officers of each State of the United States, the District of Columbia, the Virgin Islands, Puerto Rico, Guam, American Samoa, the Northern Mariana Islands, the Marshall Islands, Micronesia, and Palau are requested to issue each year proclamations calling on the people of their respective jurisdictions, to observe Asian/Pacific American Heritage Month with appropriate programs, ceremonies, and activities. (Pub. L. 105–225, Aug. 12, 1998, 112 Stat. 1254.)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}