{
    "relation": [
        [
            "",
            "Initial engine start",
            "Engine-off accessory loads",
            "Engine restart loads",
            "One-way battery load",
            "Round-trip battery load"
        ],
        [
            "Conventional",
            "500 Amp Seconds",
            "",
            "",
            "500 Amp Seconds",
            "1,000 Amp Seconds"
        ],
        [
            "Stop-Start",
            "500 Amp Seconds",
            "45,000 Amp Seconds",
            "4,500 Amp Seconds",
            "50,000 Amp Seconds",
            "100,000 Amp Seconds"
        ]
    ],
    "pageTitle": "Alternative Energy Stocks: Batteries Archives",
    "title": "",
    "url": "http://www.altenergystocks.com/archives/energy_storage/batteries/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 289998447,
    "recordOffset": 289680552,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{149461=Posted by John Petersen at 06:51 AM | Permalink | Comments (4), 873051=Posted by Jeff Siegel at 08:59 AM | Permalink | Comments (0), 589703=I think I was right about the stock pop, but I was not the only one to spot Exide as a turnaround story.   Despite the unexpected rise in June, Exide was still a good value at $3, as I wrote in a comment to a reader.  While I was expecting short term market dynamics to propel the stock down, analysts at Wedbush raised their price target and a prominent newsletter upgraded Exide as well (I read about this in an news interview with the newsletter writer a month later, but unfortunately, I can no longer find a copy of the article or recall which newsletter.), 5225=A company with an EBITDA margin of 45% in 2010 must have some uniquely special competitive advantage. Yet ABAT itself recognizes that it has no special technology for its main products. The following is taken from its 2010 10-k (.pdf):, 791995=Axion completed delivery of the 1,080 batteries for the second generation NS 999 in January, generating $475,000 in revenue in the fourth quarter of 2012., 169038=Posted by John Petersen at 10:04 AM | Permalink | Comments (4), 588258=This article was first published on the author's Forbes.com blog, Green Stocks on September 6th., 588740=My decision to trade XIDE on short term market dynamics cost me 12% of the potential 45% gain so far from my June 1 call.  This is why I usually avoid short term trading: it adds to expenses, and new information (in this case the upgrades) can lead to rapid changes in market dynamics.  I’ll try to remember that next time I come up with an equally compelling story explaining short term market dynamics., 746797=Posted by Debra Fiakas at 09:22 AM | Permalink | Comments (0), 802886=In my second scenario, which I consider most likely. the note holders will attempt to drive the share price down in the short term, when there are a lot of convertible payments ahead of them, but ease up in the later months to avoid destroying the value of a company they will own a substantial portion of.  In the scenario I modeled, they succeed in driving the price down below  6 cents in the September-October time frame, after which it begins to recover.  This would result in the issuance of  131 million new shares, more than are currently authorized.  However, as discussed above, it seems likely that shareholders would approve additional share issuance if the only alternative is bankruptcy.  This scenario would result in the note holders  being issued nearly  54% of the company for their $10 million investment, or about 7.6  cents a share., 660674=Posted by John Petersen at 06:36 AM | Permalink | Comments (8), 205160=Posted by John Petersen at 12:48 PM | Permalink | Comments (4), 571016=Posted by John Petersen at 03:53 AM | Permalink | Comments (0), 405189=Posted by John Petersen at 05:50 AM | Permalink | Comments (6), 117545=Posted by John Petersen at 03:06 AM | Permalink | Comments (2), 419875=Posted by John Petersen at 09:20 AM | Permalink | Comments (2), 548558=Posted by John Petersen at 09:18 AM | Permalink | Comments (0), 215331=Posted by John Petersen at 02:54 AM | Permalink | Comments (5), 838795=SolarCity has only existed for eight years, and it has grown in explosions. In the third quarter of 2013, it grabbed a 32 percent share of the solar installation market, and it expected to grow its number of installations by more than 80 percent in 2014. This means it could deploy upwards of 525 Megawatts of photovoltaic cells this year alone., 806288=The reason to reduce the stock price is so that they will get more shares in future payments.  On the other hand, if the stock price remains low at the end of the nine months, most of the new stock issued will go to the company insiders who bought the $1 million subordinated notes.  A low share price at the end of the nine months would also likely mean a low share price in early 2014, when Axion will most likely need to raise additional funds.  If the share price is low then, Axion will likely be forced into another, even less favorable deal, and they will find themselves diluted just like Axion’s long term shareholders are now., 579452=Posted by Tom Konrad at 02:34 PM | Permalink | Comments (0), 8288=Some of our arguments have been discussed in prior Seeking Alpha articles by other authors, including here, here, here, and here. For instance, in our report, we discuss how ABAT’s SAIC filings show that the company’s actual revenue and profit are a fraction of what is reported in SEC filings. We also show that ABAT’s $20 million acquisition of a Shenzhen battery company appears to be a sham, and that ABAT paid $20 million in 2010 for an entity that they had previously bought in 2008 for $1 million, but had not disclosed to public investors., 98366=Posted by John Petersen at 02:58 PM | Permalink | Comments (0), 341866=Posted by John Petersen at 04:58 PM | Permalink | Comments (0), 514=Other Chinese battery manufacturers which are not active in the lithium polymer market can also be compared to ABAT. Examples include the Coslight Technology International Group Limited and Tianneng Power International Limited, with $352m and $330m of revenue respectively in 2009. Gross margins and operating profit margins for all six of these companies, as well as ABAT, have been summarized in the table below for the most recent available fiscal year:, 766924=However, the analyst’s calculations do not include $80 million in cash on hand and $82 million of available credit which Exide had in their revolving in the most recent quarter, ended December 2012.  Furthermore, due to restructuring, Exide ended the quarter with cyclically high levels of inventory, which management intends to draw draw down over the coming quarters.  Total inventory stood at $548 million on December 31st.  With the shut down to two battery recycling operations, they should be able to reduce inventory below the $516 million seen at the end of 2011, freeing up an additional $32 to $50 million.  The approximately $200 million in liquidity from these three sources should be more than sufficient to cover the $96 million cash shortfall identified by the hedge fund analyst in the the Debtwire story., 316409=Posted by John Petersen at 06:30 AM | Permalink | Comments (5), 62457=Posted by John Petersen at 04:00 PM | Permalink | Comments (14), 176225=Posted by John Petersen at 09:57 AM | Permalink | Comments (4), 500519=Posted by John Petersen at 09:37 AM | Permalink | Comments (0), 195882=Posted by John Petersen at 06:09 AM | Permalink | Comments (4), 843431=The State of California Public Utilities Commission has added an important item to its May 15 agenda that will make a huge difference for SolarCity. Utility companies may finally be blocked from imposing big fees on battery-backed solar systems., 832722=Posted by Debra Fiakas at 09:18 AM | Permalink | Comments (0), 282847=Posted by John Petersen at 03:40 AM | Permalink | Comments (0), 761195=This article was first published on the author's Forbes.com blog, Green Stocks on April 9th., 769326=The rally quickly began to fade, with the stock closing up only modestly at $1.57 on Friday.  Over the weekend and Monday I began a more in-depth investigation to re-assess my first impression that the bankruptcy fears were overdone, and to decide what to do with my long term holdings.  I contacted Debtwire to obtain a copy of their story, re-read Exide’s most recent earnings call transcript from February, and read the allegations of the class action lawsuits and news stories which are now coming out in relation to the stock decline., 819185=Posted by Debra Fiakas at 09:28 AM | Permalink | Comments (1), 511787=Posted by Debra Fiakas at 08:56 AM | Permalink | Comments (0), 482598=Insiders seem to think the stock is cheap here.  Although there has only been one buy (at $3.02 in February), they are holding on to almost all of the stock they get from exercising options.   At below half book, and plenty of liquidity ($1.34 cash per share even before the additional $0.58 per share infusion from the sale of the Frisco land, for a total of $1.92 per share), Exide seems ready for a strong rebound on any hint of good news, such as an upside earnings surprise when the company reports on June 8.  It’s hard to see how even an earnings miss could send the stock down much from the current price of $2.31.  After all, the company is profitable, has no need to go to the markets for additional equity funding, and the stock price is closing in on cash on hand., 793186=Norfolk Southern Corporation (NYSE:NSC) released its 2013 corporate sustainability report on July 16th.   The report devoted most of a page (30 of 130) to the NS 999 all-electric switching locomotive, which uses Axion PbC batteries.  The NS 999 was the first of four “Alternative Power” projects mentioned, and was given considerably more space than the other three.  In contrast, Norfolk Southern’s 2012 report only mentioned the NS 999 prototype once, in its environmental timeline, where the prototype was mistakenly said to have been unveiled in 2010, rather than 2009.  The timeline was corrected in the 2013 sustainability report., 582705=Reading the details of the release, $75 million of the investment is to be a short term bridge loan, which does not involve the purchase of A123 stock.  The rest is to consist of $200 million in convertible notes (which can become stock) and $175 million which might be invested with the exercise of warrants.  An exercise of all these warrants and the full conversion of the convertible notes would result in Wanxaing controlling 80% of the company, or about 680 million shares, based on the 170 million shares A123 had outstanding at the end of July.  Doing the math, and assuming that the initial $75 million bridge loan is not used to purchase shares, that’s 55 cents a share., 626263=Posted by Debra Fiakas at 10:09 AM | Permalink | Comments (1), 88433=Posted by John Petersen at 05:31 AM | Permalink | Comments (5), 799218=This article was first published on the author's Forbes.com blog, Green Stocks on July 25th., 762521=Exide Technologies’ stock decline from $2.61 on April third to $1.44 where it is currently trading  seems completely out of proportion to the real chance of bankruptcy and the likely costs posed by arsenic emissions at the Vernon facility., 616850=Posted by Debra Fiakas at 09:17 AM | Permalink | Comments (1), 775190=In the week and a half since this was first published, Exide's 2018 notes have dropped to 65 cents on the dollar, and Exide's stock has fallen from $1.03 when I sold it to $0.75 at the close on May 3rd. So far. getting out looks like a wise, if belated, decision., 356839=Posted by John Petersen at 02:16 PM | Permalink | Comments (0), 587334=Posted by Tom Konrad at 09:45 AM | Permalink | Comments (0), 604678=Posted by Debra Fiakas at 11:19 AM | Permalink | Comments (2), 812040=In my last article, Axion Power’s Potential For Explosive Growth, I outlined a number of near-term business opportunities for Axion Power International, (OTC:AXPW) any one of which could catapult the company into profitability in 2014, and more than one of which could produce significant revenue growth this year.  While I’m quite bullish about Axion’s prospects, I concluded with a skeptical comment about Axion’s stock:, 251266=Posted by John Petersen at 02:15 AM | Permalink | Comments (2), 18096=Posted by John Petersen at 11:44 PM | Permalink | Comments (2), 591807=On June 1st, in the lead up to Exide Technologies’ (NASD:XIDE) first quarter earnings announcement, I made one of my better calls so far this year.  I wrote that the Exide stock was in the “bargain basement” and “ready to pop.” That day, XIDE traded in a range of $2.25 to $2.36, within spitting distance of its 52 week low of $2.22.  Four months later, the stock is up 45% at $3.25, despite two earnings misses in the meantime., 777910=I sold my position in Exide Technologies (NASD:XIDE) on April 25th after the company was forced to shut down its Vernon secondary lead recycling facility by the California Department of Toxic Substances (DTSC.)  In addition to the known arsenic furnace emissions, the DTSC cited the facility’s underground storm water system as not being in compliance with CA requirements., 798249=Posted by Tom Konrad at 11:52 AM | Permalink | Comments (0), 859742=Posted by Jeff Siegel at 03:08 PM | Permalink | Comments (0), 455828=Posted by John Petersen at 04:36 AM | Permalink | Comments (4), 837765=Posted by Jeff Siegel at 12:45 PM | Permalink | Comments (0), 237605=Posted by John Petersen at 10:09 AM | Permalink | Comments (2), 10911=Posted by John Petersen at 07:36 PM | Permalink | Comments (5), 801100=Hence, I think a small investors’ best approach is to sell or stay out of the stock now, and buy back in at the first sign of significant positive news.  If there is not any significant news in the next few months, I expect the stock will be considerably lower in the September-November time frame, at which point I will consider buying the stock., 652608=Posted by Debra Fiakas at 09:54 AM | Permalink | Comments (5), 807732=According to Axion’s CEO, Thomas Granville, Axion has enough cash that it won’t need to return to the markets for additional financing until 2014.  If things go well (I recently argued that they could,) Axion may not need to return to the markets for additional financing any time soon., 764992=In terms of the other apparent investor concern regarding the arsenic emissions from the Vernon facility, these seem to have been primarily the result of the class action lawsuits.  Yet these lawsuits would not have been filed without the Thursday stock decline, triggered in turn by the Debtwire story.  Between the time the Los Angeles Times story was published the morning of April 3rd, and the Debtwire publication at 2 pm April 4th, XIDE declined only 8 cents or 3%.  The magnitude of the emissions has not yet been determined, but it would be extremely premature to take the alarm of local lawmakers an indicitave of the severity of the problem.  Their alarm is much more indicative of their need to be seen to be doing something than of the health risks, or any risks to Exide’s finances., 326926=Posted by John Petersen at 03:53 AM | Permalink | Comments (0), 158794=Posted by John Petersen at 10:40 AM | Permalink | Comments (5), 610189=Posted by Debra Fiakas at 09:30 AM | Permalink | Comments (0), 267596=Posted by John Petersen at 12:29 PM | Permalink | Comments (0), 190442=Posted by John Petersen at 10:23 AM | Permalink | Comments (0), 230409=Posted by John Petersen at 07:11 AM | Permalink | Comments (0), 466651=Posted by John Petersen at 05:29 AM | Permalink | Comments (2), 774841=This article was first published on the author's Forbes.com blog, Green Stocks on April 25th., 516393=Posted by Tom Konrad at 11:55 AM | Permalink | Comments (0), 430822=Posted by John Petersen at 08:45 AM | Permalink | Comments (0), 854757=Back in November, SunEdison and TerraForm announced the $2.4 billion acquisition of wind developer First Wind and its 1.3-GW portfolio, making SunEdison the largest renewable energy developer in the world. It also announced plans for a possible $2 billion polysilicon plant in China, a $30 million module plant in Brazil, and a $4 billion module plant in India to help along its more than 5 GW of potential projects in the region., 760223=Posted by Tom Konrad at 08:23 AM | Permalink | Comments (2), 41979=Posted by John Petersen at 10:12 AM | Permalink | Comments (0), 559489=Posted by John Petersen at 04:18 AM | Permalink | Comments (1), 879137=Posted by Debra Fiakas at 12:14 PM | Permalink | Comments (0), 33463=Posted by John Petersen at 09:28 AM | Permalink | Comments (26), 638130=Posted by Debra Fiakas at 09:47 AM | Permalink | Comments (0), 767529=Exide’s debt consists of a $200 million revolving facility, a $675 million 8.625% bond due in 2018, and a $55.7 million floating rate convertible note due in September.  Concerns about bankruptcy center around Exide’s ability to repay the September convertible note.  A hedge fund analyst anonymously quoted in the Debtwire story was quoted as saying that EBITDA for 2014 is expected to be $130 million, $96 million short of the $80 million of expected capital expenditures, $70 million of interest, $30 million of cash taxes and pension costs, and the $55.7 million maturity., 524270=Posted by Debra Fiakas at 10:01 AM | Permalink | Comments (0), 772159=Intraday, panicked shareholders dumped their shares for as little as $1.16, down 56% from the previous day’s close.  Nasdaq circuit breakers stopped the plunge at 2:17.  I spotted the decline when I checked the market at 2:45, and began hunting for its cause.  The company’s IR contact line was busy, and I found nothing credible in the public newswires or chat boards. I knew the bankruptcy rumors were exaggerated in the absence of an SEC filing, and the fact that Exide has plenty of cash and capacity in its line of credit to meet its short term needs., 764148=Nor did the news break on April 3rd.  Local papers carried stories about the emissions on March 25th and 28th.  The company’s obligation under existing environmental laws seem to be to reduce the emissions as quickly as possible, and to communicate with local communities about the risks and the steps taken to mitigate them., 542689=Posted by Debra Fiakas at 01:09 PM | Permalink | Comments (0), 779217=Posted by John Petersen at 04:49 PM | Permalink | Comments (0), 855484=SunEdison has been in expansion mode for the past year or so. In February 2014, it established a yieldco called TerraForm Power (TERP). This yieldco model allows SunEdison to raise capital by selling its projects to TerraForm and then using the proceeds to purchase additional projects and pay investors. Since yieldcos have very strict criteria, SGS won’t be able to qualify just yet due to a lack of contracted revenue, but it hopes to rectify that by the end of the year, said Leyden., 785724=This article was first published on the author's Forbes.com blog, Green Stocks on July 23rd, 871734=When I first started covering the renewable energy space in 2005, it was like pulling teeth to get investors to pay attention. After all, the renewable energy industry had a long history of great ideas but poor execution., 813106=Posted by Debra Fiakas at 10:43 AM | Permalink | Comments (0), 784762=Posted by Tom Konrad at 09:32 AM | Permalink | Comments (0), 478619=Posted by Tom Konrad at 02:25 PM | Permalink | Comments (0), 867263=Now, the rollout of these new batteries won't happen for another three or four months. And that rollout will be relatively slow until 2017, when more batteries will be pumped out of Tesla's new Gigafactory — which, by the way, will enjoy production levels in 2020 that will exceed all of 2013's global production., 707104=Posted by Doug Young at 07:15 PM | Permalink | Comments (0), 393674=Posted by John Petersen at 04:16 AM | Permalink | Comments (0), 530564=Posted by John Petersen at 08:21 AM | Permalink | Comments (2), 766049=The above calculations also fit with management’s stated intention of repaying the convertible note from available cash.   It seems unlikely that the September convertible maturity would send Exide into bankruptcy, even if Lazard is unsuccessful in restructuring the company’s heavy debt burden.   The current panic is also reducing the price of Exide’s debt in the open market, and may even be strengthening Exide’s position if it allows the company to purchase some convertible notes at a discount on the open market., 306279=Posted by John Petersen at 10:07 AM | Permalink | Comments (0), 842351=In March, SolarCity had had enough. It halted its applications for interconnections to Southern California Edison, Pacific Gas and Electric, and San Diego Gas and Electric., 53506=Posted by John Petersen at 04:20 AM | Permalink | Comments (8), 789194=I, and most of my readers, were introduced to Axion Power by John Petersen, Esq., an attorney and former board chair and general counsel for Axion.    From 2007 to 2012, John wrote prolifically about energy storage and the electrification of transportation for Seeking Alpha and my own website, AltEnergyStocks.com.  While he did write about the NS 999, ePower’s hybrid truck application, a more typical example of his articles was spent critiquing the economics of plug-in vehicles (with special attention to Tesla Motors (NASD:TSLA),) and talking up the economics of PbC batteries for Stop-Start hybrid vehicles.  Given all this background, I will not go into detail on the economics of Stop-Start technology, but simply refer you to Petersen’s article archive on Seeking Alpha., 739438=Posted by Doug Young at 09:19 AM | Permalink | Comments (0), 824428=Posted by Guest Contributor at 09:15 AM | Permalink | Comments (0), 807077=The first convertible payment was made on July 3rd, at a conversion price of approximately $0.136 (by my estimate.)  That means the investors were paid with approximately 7.1 million shares of stock.  The second payment will be on August 3rd, and, given the 40 day look-back, we know that the conversion price will be at most  $0.131, with a minimum of 7.4 million shares issued., 797437=Axion Power International, Inc. (OTC:AXPW) has been developing its patented PbC lead-carbon battery technology, and in 2013 those efforts seem on the verge of paying off.   Unfortunately, Axion’s financing situation makes me unwilling to recommend its stock as an investment in the near term, but I do consider it one to watch.  This article will take a look at Axion’s technology and near term potential markets.  A follow-up article (published here) will discuss the company’s financing situation, and the things which will need to change before I consider the stock an attractive investment., 1433=Perhaps it's ABAT's position in China and access to cheap labor that gives it such an amazing edge in the global arena. We can test this hypothesis by comparing ABAT to a handful of other Chinese battery manufacturers. The independent third party research organization Research in China publishes an annual report titled “Global and China Rechargeable Lithium Battery Industry Report”. In the 184 pages of the 2009-2010 edition, no mention is made of ABAT or its subsidiaries. The report does, however, make mention of China BAK Battery Inc. (BAK), BYD Company (BYDDY.PK), SCUD Group Ltd, and Tianjin Lishen, which generate respective revenue of $222m, $5,805m, $185m, and $295m., 485629=Posted by John Petersen at 03:18 AM | Permalink | Comments (0), 790587=Offshore islands and other remote locations, and military operations have very expensive electricity, since the marginal source of power is almost uniformly diesel generators.  That increases the value of grid stability and power-shifting services from stationary storage.  The fact that these applications are stationary makes PbC’s disadvantage compared to Lithium-Ion (higher weight and volume) much less significant.  Axion has preferred vendor status for a number of offshore island projects, and expects commercial sales to commence this year or in early 2014., 592631=Posted by John Petersen at 02:23 AM | Permalink | Comments (0), 838998=The Gigafactory is not expected to be built until early 2017, and production ramping will not begin until 2020. It may be a long way off, but think of what can be done in the meantime., 865324=Posted by Jeff Siegel at 10:31 AM | Permalink | Comments (0), 441207=Posted by John Petersen at 09:51 AM | Permalink | Comments (0), 773947=Posted by Tom Konrad at 08:57 AM | Permalink | Comments (0), 690637=Posted by Debra Fiakas at 08:14 AM | Permalink | Comments (0), 125568=Posted by John Petersen at 09:31 AM | Permalink | Comments (4), 370571=Posted by John Petersen at 11:30 AM | Permalink | Comments (0), 699068=Posted by John Petersen at 10:49 AM | Permalink | Comments (0), 844765=Posted by Jeff Siegel at 02:04 PM | Permalink | Comments (0), 852265=Posted by Guest Contributor at 10:44 AM | Permalink | Comments (0), 590187=I was wrong.  Over the last five months, XIDE only briefly fell below $3, because of another negative earnings surprise in August and accompanying analyst downgrades.  Yet XIDE resumed its rally, propelled by recent news like a new contract with Pep Boys (NYSE:PBY)., 858527=SunEdison is now able to offer integrated battery storage solutions for its renewable energy project portfolio, and delve into an energy storage market that is set to grow 250 percent in 2015, according to a new report from the Energy Storage Association and GTM Research. The solar plus battery storage market alone is set to reach $1 billion by 2018., 297014=Posted by John Petersen at 09:00 AM | Permalink | Comments (2), 753999=Posted by Debra Fiakas at 09:40 AM | Permalink | Comments (0), 829684=The key to Gigafactory, for either cars or stationary storage applications, is in its sheer scale which is hoped to compress costs right from the start. Tesla says it will reduce battery pack cost/kWh by more than 30 percent by the time its third-generation vehicles ramp in 2017. Battery systems for stationary energy storage applications are a bit different -- air-cooled, a simpler battery management system, and it's all around a lot cheaper. It's not uncommon among Asian manufactures to have multiple variations of a battery cell coming off individual lines, pointed out Sam Jaffe, senior research analyst at Navigant Research. There's also the possibility that the company could tweak its battery chemistry used in Gigafactory, though probably still a variant of lithium-ion. A Tesla spokesperson declined to comment on any Gigafactory specifics., 771466=There was also an April 3rd story in the Los Angeles Times about LA council members irate about arsenic emissions from one of Exide’s lead recycling facilities in nearby Vernon, but the timing of this article did not correspond to the sudden stock drop at 2pm the next day.  Further, Exide seemed to be making best efforts to locate and prevent the emissions at the source, and to keep the public informed.  While possibly exposing as “many as 110,000″ people to unsafe levels of arsenic is clearly bad, it did not seem proportional to the $100 million plus decline in Exide’s valuation., 333814=Posted by John Petersen at 09:42 AM | Permalink | Comments (0), 713945=Posted by John Petersen at 07:07 AM | Permalink | Comments (2), 773142=On Thursday, April 4th, battery manufacturer and recycler Exide Technologies’ (NASD:XIDE) stock plunged, starting around 2pm.  There was no press release or SEC filing from the company, or stories on the public newswires.  Likely short sellers were stoking rumors on the chat boards that the company had filed for bankruptcy, and that the story was on Reuters., 72010=Posted by John Petersen at 12:27 PM | Permalink | Comments (2), 872269=Last Thursday at around 11:00 p.m., the world changed.}",
    "TableContextTimeStampAfterTable": "{11985=Wuxi ZQ mentions additional customers in its February 3, 2010 press release and in this excerpt (.pdf) from ABAT's 2010 10K. We reviewed our diligence with many of these customers in our report., 145701=Posted by John Petersen at 10:36 AM | Permalink | Comments (4), 199906=Posted by John Petersen at 03:58 AM | Permalink | Comments (7), 89286=Posted by John Petersen at 11:50 AM | Permalink | Comments (16), 178745=Posted by John Petersen at 11:27 AM | Permalink | Comments (0), 183585=Posted by Tom Konrad at 09:32 PM | Permalink | Comments (1), 38566=Posted by John Petersen at 06:16 PM | Permalink | Comments (5), 57010=Posted by John Petersen at 08:17 PM | Permalink | Comments (2), 117527=Posted by John Petersen at 10:47 AM | Permalink | Comments (7), 132603=Posted by John Petersen at 05:43 AM | Permalink | Comments (2), 8866=This customer had signed a contract to receive scooters from ABAT’s Wuxi facility in 2009. After receiving a defective product, the customer demanded to visit the Wuxi facility that had supposedly been manufacturing the scooters. During our conversation, the customer indicated that he had visited numerous other Chinese manufacturing facilities to which Wuxi could be compared, and he described the Wuxi facility as a “joke” multiple times. The facility was described as “four empty walls”, the inadequacy of which made him suspect Wuxi was some sort of distributor operation rather than a manufacturing facility. Furthermore, the customer stated that he thought about contacting the SEC to report ABAT for fraudulent claims made in press releases. He said that “none of the stuff they put out was accurate”., 167184=Posted by John Petersen at 08:40 PM | Permalink | Comments (2), 2558=The founder of ABAT, Zhiguo Fu, established it in 2002 despite having experience in construction and real estate, as opposed to battery manufacturing (see here (.pdf)). Furthermore, this company didn't begin manufacturing until 2004 (see here (.pdf))., 17086=Posted by Guest Contributor at 11:30 AM | Permalink | Comments (0), 67355=Posted by Tom Konrad at 03:56 PM | Permalink | Comments (1), 190989=Posted by John Petersen at 05:24 PM | Permalink | Comments (5), 102444=Posted by John Petersen at 11:09 AM | Permalink | Comments (0), 27655=Posted by John Petersen at 01:56 PM | Permalink | Comments (0), 81187=Posted by John Petersen at 08:59 AM | Permalink | Comments (2), 9746=Other customers we’ve been in touch with have voiced similar opinions of ABAT. For example, in 2010, ABAT touted an agreement to re-enter the US market, expecting to deliver 200,000 electric scooter units to All-Power America for $1.1 million. Only half the delivery was taken before serious issues surfaced regarding quality control and licensing. The following comprises one excerpt from the long conversation we had regarding these issues and more with an All-Power executive:, 159299=Posted by John Petersen at 11:04 AM | Permalink | Comments (9)}",
    "textBeforeTable": "The battery problem is easy to understand. In a conventional car the battery starts the engine when you leave for work and it has to recover enough charge during your commute to restart the engine when you head home at night. With a stop-start system, the battery has to start the engine when you leave for work, carry the accessory loads during engine-off intervals, restart the engine on demand, and recover its state of charge as quickly as possible in preparation for the next engine off opportunity. The pattern repeats on the trip home. The following table highlights the differences in battery duty cycles for a 15-mile commute with an average of one engine-off event per mile. Stop-start is a classic disruptive technology; a simple baby step that opens the door to improvements in fuel economy that nobody even considered a few years ago. The only fly in the ointment is the reality that yesterday's automotive batteries are simply not durable or robust enough for the immense electrical loads stop-start systems require them to carry. Regardless of how you judge the merit of an automotive efficiency technology, a production ramp from zero vehicles in 2005 to planned production of 15 to 22 million vehicles a year by 2015 is extraordinary. While most investors don't even know that stop-start exists, the technology has already crossed the chasm",
    "textAfterTable": "Think about the table for a minute. An optimized stop-start system requires 100 times the work from its battery; two full orders of magnitude. This is not a simple problem with an easy fix. Recent studies from BMW and Ford show that flooded lead-acid batteries start to degrade in a matter of weeks and more expensive AGM batteries start to degrade within a couple months, but the batteries don't simply die. Instead, their charge recovery time increases from 30 seconds with a new battery to four minutes or more after a few thousand miles. Since stop-start systems disable themselves until the battery regains an appropriate state of charge, longer charge recovery times make the mechanical systems less efficient and eat into potential fuel savings. In many cases, stop-start systems lose most of their functionality within six months. It's sure to become a huge problem when pollution control inspectors start testing for stop-start functionality. Finding a solution now is a major challenge for both automakers and the battery industry. In an effort to compensate for the shortcomings of conventional lead-acid batteries, automakers are upgrading from flooded batteries to AGM batteries, or to dual battery systems that use flooded batteries for starter loads and AGM batteries for accessory loads. The first big beneficiaries of these battery upgrades will be Johnson Controls and Exide Technologies ( XIDE). Both companies are building new AGM battery manufacturing capacity at a blistering pace",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}