{
    "relation": [
        [
            "Name",
            "Description",
            "Office locations",
            "Hours",
            "Languages",
            "Experience",
            "Contact information"
        ],
        [
            "Innova Computing, L.L.C. (http://www.innovacomputing.com/)",
            "Innova Computing provides PostgreSQL administration and development services as well as system administration services. We focus on providing quality solutions that meet your business needs.",
            "Oklahoma City, OK",
            "9am - 5pm CST",
            "English, Dutch",
            "Innova Computing has over 15 years of experience in application development and over 9 years of database administration and system administration experience.",
            "info@innovacomputing.com (405) 751-0270 (phone) (405) 751-2119 (fax)"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "PostgreSQL: Professional Services - North America",
    "title": "",
    "url": "http://www.postgresql.org/support/professional_support/northamerica/",
    "hasHeader": true,
    "headerPosition": "NONE",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 667239023,
    "recordOffset": 667213161,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The following Professional Services are registered in North America. Professional Services - North America Report a Bug Hosting Solutions Professional Services Security Versioning policy Support Your account Support Developers Community Documentation Download About Home Contact Donate Peripheral Links Search Skip section navigation (2) Skip site navigation (1)",
    "textAfterTable": "Name AcuGIS (https://www.acugis.com/) Provides Provides both support and hosting. Description AcuGIS provides PostgreSQL hosting and PostgreSQL based GIS hosting services to individuals, businesses, and academic and research institutions in over 40 countries worldwide. AcuGIS offers full support for both PostgreSQL 8 and PostgreSQL 9. Our highly knowledgeable support staff is focused on PostgreSQL. Combined with our Enterprise grade hardware and exclusive PostgreSQL tools, you can be assured of reliable, high performance PostgreSQL hosting services. Number of employees 10 Office locations New York, London, Frankfurt Hours 24x7x365 Languages English Experience Providing PostgreSQL hosting and support services since 2005. Clients in over 40 countries worldwide. Contact information info@acugis.com Name Agartha Systems S.C. (http://www.agarthasystems.com/) Provides Provides both support and hosting. Description We are a company dedicated to build web applications, and help our customers to resolve their Technology Information issues through the developing of complete software solutions based on web platforms. For the most critical solutions we use PostgreSQL as our database. Number of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}