{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There's almost something to do every night! In the dorms you can go to the community center and play pool, wii, rent movies, and a ton of other great things. In the dorms each floor has a common room, my floor had a tv that basically anyone could use. On campus, you could join some clubs, hit the gaming lounge right across from the gym, join frats or sororities, talk to some great people, or even go feed the ducks at the duck pond in the orange grove! And there's so much more to discover.",
            "Everything on campus is absolutely delicious! However the dining halls for the dorms (Geronimo's) is not the bee's knees. It's good if you're desperate but if you have the choice to not go there, don;t.",
            "It really depends on where you stay, if you want to stay in a dorm spend the little extra money to get a dorm with a kitchen, its worth it! Or if you're tight on money and are swinging for the suites, take those too. Everyone in those dorms are super close. Floors ultimately become families. If you do have trouble with a roommate talk to your RA they will definitely not hesitate to take action. Do not get the dorm without a kitchen, it's a waste of money.",
            "Just like any other school, classes are going to be difficult if you make them difficult. However if you are finding a class troublesome OFFICE HOURS OFFICE HOURS OFFICE HOURS! I cannot stress this enough and neither will your UNIV 100 professors either. You can personally sit down with your professor and ask him all the questions you want about the trouble you're having in class. For the most part if you apply yourself in your classes you can and will get out of there alive with an A+!",
            "CSUN might sound like a lame school to get into but for those who can't afford much else this is a dream school none the less. CSUN is always booming with free food, fun activities, and free stuff on campus! Almost every class you take at CSUN is extremely interesting and the professors want you to learn. Join clubs! That's one thing you should take advantage of especially in a huge school with no friends.",
            "This school is a magnificent wonderland if you're looking for scenery! Most of the professors and staff are as friendly as the squirrels there! It is a good 8 out of 10 CSU you should really think about."
        ]
    ],
    "pageTitle": "California State University-Northridge Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Northridge/reviews?_escaped_fragment_=/show/38589",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00179-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904079491,
    "recordOffset": 903887135,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{136352=I highly recommend the dorms to the newly incoming freshmen so they can start many new people and have a great sense of community within the dorm life. Also there is events sponsors by the RA (Residental Advisor) with free movie screenings, ice cream parties, and even peer advisement. For exercise, their are volleyball nets, a small field for soccer, and basketball courts. The only downside is that the Matador Patrol closes the gates at 7:30 pm so if you need to enter to the dorms, you have to sign and verify with matador patrol before you enter., 1103142=As an Alumni, class of 2012, i really took advantage of all the opportunities that were offered to me in the School of Sociology. The professors are great and really allow you to learn skills that are practiced in the classroom so that you can immediately start using in the workforce. Professor Morgaine, Hatkoff, and Debose were my mentors, teachers, life coaches, and friends., 56915=I love CSUN,but if I were living on campus I would have a lot more fun.The sports are fun and it is easy to get involved with activities.The campus is beautiful and they are building a new Art center which is suppose to open in 2011.I also love the library because I always can find what I am looking for in there if I can't find it at my local library., 675507=I don't dorm, but I do live across the dorms, there is a curfew for getting inside without having to be checked in, they close the gates at 7:30. Also they are fairly overpriced, but I do still wish I dormed to meet new people., 235458=there are many fun events held at c.su.n. such as concerts by well known artists like b.o.b. and the cataracs, who performed in the fall semester, 2011. they recently built the student recreational center where students can become fit and active. best part it is free for students! during the hot weathers c.s.u.n. has a big pool where students can cool off., 75282=Great school. May not have the prestige of other schools like the UCs but it is one of the best CSUs in the state and has a great business program., 874348=I had no fun time. I tranferred in 2006 Fall semester from Mission College and I Graduated from CSUN in Spring 2008. My goal was to complete my BA as soon as possible because I was having a baby in Sep 2008. I had no time to see or do fun things at school... but study,go to class and take exams., 740882=I've been a student majoring in Civil Engineering here at Cal State Northridge since the Fall of 2007. I have seen the campus grow with student life and expand. CSUN has just finished building a new student recreation center, parking structures, updated technology in classrooms, and improved student life on campus. Overall I have enjoyed my years here and despite the large majority of peers commuting to and from, the student body can connect on campus. Go Matadors!, 714536=CSUN has an entire escort system that guards the library and personally approaches students to walk them either to their car or back to the dorms. Security guards have two shacks on the outskirts of Student Housing and patrol from 7:30 pm- 3:00 am. The guards are pretty cool, they actually like chatting with students and asking what's going on with them. They also patrol inside of Student Housing too., 597215=They are not acceptng new applicants until 2013., 739714=CSUN has updated their dormitory life since 2007 and provided better meals for on campus dining., 122576=This year 2012 the hired various security! Its really good., 987137=It`s no wonder than CSUN is ranked 68th in the 2013 edition of Best Colleges is Regional Universities (West) by US News. This school offers incredibly small class sizes which are ideal for getting the best of lecture time. CSUN`s vast variety of degree programs ensures than just about anyone can attend CSUN and study what he or she wishes.}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 43 out of 44 people found this review useful. 1 of 295 Kirk from Northridge, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students Everyone! :) Tips for prospective students Take advantage of all the opportunities. Volunteer, join a club you find interesting, take a class about something you are unfamiliar with, and don't be shy to talk to people. Make the most of your college experience. Have fun! :) Am enjoying being here CSUN has given me the opportunity to explore my many different interests. I have helped out with student elections, blood drives, etc. I recently joined the New Student Orientation Team and J.A.D.E Program which has been an incredible experience so far. I have met some amazing, caring people through these programs and hope to befriend many more. Am learning a lot Almost all my professors have been extremely helpful, I have learned a lot not just from my professors but also my classmates. I have also learned a lot about the campus as well as myself in and out of the classroom. Login to rate or flag the reviews Travon from Los Angeles, CA 06/06/2009 Reviewer is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}