{
    "relation": [
        [
            "First Name",
            "Scott",
            "Dan",
            "Liz",
            "Dave",
            "Laura",
            "Laura (contd)",
            "Laura (contd)",
            "Laura (contd)",
            "Matt",
            "Matt (cont'd)",
            "Matt (cont'd)",
            "Matt (cont'd)",
            "Matt (cont'd)",
            "Matt (cont'd)",
            "Matt (cont'd)",
            "Matt (cont'd)"
        ],
        [
            "Last Name",
            "DeFife",
            "Roehl",
            "Garner",
            "Koenig",
            "Abshire",
            "Abshire (contd)",
            "Abshire (contd)",
            "Abshire (contd)",
            "Walker",
            "Walker (cont'd)",
            "Walker (cont'd)",
            "Walker (cont'd)",
            "Walker (cont'd)",
            "Walker (cont'd)",
            "Walker (cont'd)",
            "Walker (cont'd)"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "",
            "",
            "Dep. Chief of Staff, Rep. Mike Ross, 09-12",
            "Leg. Dir., Rep. Mike Ross, 07-09",
            "Leg. Asst., Rep. Mike Ross, 06-07",
            "Comm. Dir., Rep. Mike Ross, 06",
            "Dep. Staff Dir. & Chief Counsel,",
            "Sen. Small Bus. Cmte., 11-12;",
            "Dep. Staff Dir. & Counsel,",
            "Sen. Small Bus. Cmte., 07-11;",
            "Oversight Counsel,",
            "Sen. Small Bus. Cmte., 03-07;",
            "State staff, Sen. Olympia Snowe, 96-00;",
            "Staff Asst., Sen. Olympia Snowe, 95-96"
        ],
        [
            "New",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=DC07FB51-BF5E-45B5-AF13-7E0AFBB73D41&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220847131,
    "recordOffset": 220834666,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79826=Monitor legislation and federal issues related to Vocational Education and mentoring. Dept. of Education Proposed Rule regarding Program Integrity: Gainful Employment (ED-2010-OPE-0012)., 45657=Monitor legislation and federal issues related to Comprehensive Immigration Reform. Proposed Rule and Request for Comments regarding wage methodology for the Temporary Non-Agricultural Employment H-2B Program, Labor: RIN 1205-AB61 Executive Order 13563 as it relates to RIN1205-AB69. Notice of Proposed Rule, \"Temporary Non-Agricultural Employment of H-2B Aliens in the United States (RIN 1205-AB58).\", 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 68894=Monitor legislation and federal issues related to FMLA and Sick Leave Reform. Monitor the implementation of Lilly Ledbetter Fair Pay Act, (P.L. 111-2). Proposed Rule and Request for Comments: Proposed Rules Governing Notification of Employee Rights Under the National Labor Relations Act - CRIN 3142 - AAOD. Notice of Proposed Rulemaking, Labor Management Reporting and Disclosure Act; Interpretation of the \"Advice\" Exemption, RIN1245-AA03. Monitor Federal case: the United States Court of Appeals District of Columbia Circuit, National Association of Manufacturers & Coalition for a Democratic Workplace versus National Labor Relations Board. Proposed Rule, RIN 1215-AB79; RIN 1245 - AA03, Labor Management Reporting and Disclosure Act, Interpretation of the \"Advice Exemption.\" EEOC Enforcement Guidance (No. 915.002) Consideration of Arrest and Conviction Records in Employment Decisions Under Title VII of the Civil Rights Act of 1964. Interim Final Rule: Procedures for the Handling of Retaliation Complaints Under Section 1558 of the Affordable Care Act Insurance Issuers Relating to Coverage of Preventive Services [OSHA-2011-0193], [RIN 12158-AC79] H.R. 1120: Preventing Greater Uncertainty in Labor-Management Relations Act H.R. 803, SKILLS ACT H.R. 1406, The Working Families Flexibility Act H.R. 1010, S. 460, Fair Minimum Wage Act of 2013, 93846=Advanced Notice of Proposed Rulemaking, [CRT Docket No. 110] RIN 1190-AA61, Nondiscrimination on the Basis of Disability; Accessibility of Web Information and Services of State and Local Government Entities and Public Accommodations. Advanced Notice of Proposed Rulemaking [CRT Docket No. 113] RIN 1190-AA64, Nondiscrimination on the Basis of Disability by State and Local Governments and Places of Public Accommodations, Equipment and Furniture. Concerns over Patent Troll lawsuits. Monitoring draft legislation related to ADA Advance Notice, 12209=Monitoring draft legislation to amend the Internal Revenue Code of 1986 to permanently extend the 15-year recovery period for qualified leasehold improvement property, qualified restaurant property, and qualified retail improvement quality. Monitoring draft legislation to amend the Internal Revenue Code of 1986 to repeal the reduction in the deductible portion of expenses for business meals and entertainment. IRS Notice 2011-36, Request for comments shared Responsibility For Employer Regarding Health Coverage. Monitored federal issues related to general tax reform. Monitored federal issues related to corporate tax reform. Proposed Rule: Shared Responsibility for Employers Regarding Health Coverage (Department of Treasury, Internal Revenue Service), RIN 1545-BL33 [REG-138006-12]. H.R. 763, S. 603, The Job & Premium Protection Act to repeal the annual fee on health insurance providers enacted by the Patient Protection and Affordable Care Act. H.R. 903, S. 399, The American Job Protection Act Monitor the implementation of the American Taxpayer Relief Act of 2012 (P.L. 112-240). Final Rule: Health Insurance Premium Tax Credit [RIN 1545-BL49] NPRM and Notice of Hearing: Shared Responsibility Payment for Not Maintaining Minimum Essential Coverage [RIN 1545-BL36], [REG-148500-12] Proposed Rule and Notice of Public Hearing: Health Insurance Providers Fee [REG-118315-12], [RIN 1545-BL20] Correction to Notice of Proposed Rulemaking and Notice of Hearing: Shared Responsibility for Employers Regarding Health Coverage; Correction [REG-138006-12], [RIN 1545-BL23] Proposed Rule: Ninety-Day Waiting Period Limitation and Technical Amendments to Certain Health Coverage Requirements Under the Affordable Care Act [REG-122706-12, RIN 1545-BL50], [RIN1210-AB56], [CMS-9952-P, RIN 0938-AR77], 55500=Monitor legislation and federal issues related to Association Health Plans, Small Business Health Plans, Health-Care Related Tax Credits, Health Savings Accounts and Flexible Spending Accounts. Monitor the implementation of the Patient Protection and Affordable Care Act, (P.L. 111-148). Monitor the implementation of the Healthcare and Education Reconciliation Act of 2010, (P.L. 111-152). H.R. 1249, Common Sense Nutrition Disclosure Act. H.R. 903, S. 399, The American Job Protection Act H.R. 763, S. 603 The Job & Premium Protection Act H.R. 1254, Auto Enroll Repeal Act Proposed Rule: Medicaid, Childrens Health Insurance Programs, and Exchanges: Essential Health Benefits in Alternative Benefit Plans, Eligibility Notices, Fair Hearing and Appeal Processes for Medicaid and Exchange Eligibility Appeals and Other Provisions Related to Eligibility and Enrollment for Exchanges, Medicaid and CHIP, and Medicaid Premiums and Cost Sharing [RIN 0938-AR04] [CMS-2334-P] FAQs about Affordable Care Act Implementation Part XI (January 24, 2013) HHS seeks public comment on the new single, streamlined application for health insurance and the SHOP applications, draft dated 1/16/2013. Proposed Rule: Patient Protection and Affordable Care Act; Exchange Functions: Eligibility for Exemptions; Miscellaneous Minimum Essential Coverage Provisions [RIN 0938-AR68] Final Rule: Patient Protection and Affordable Care Act; Standards Related to Essential Health Benefits, Actuarial Value, and Accreditation [RIN 0938-AR03], [CMS-9980-F] Final Rule: Patient Protection and Affordable Care Act; Health Insurance Market Rules; Rate Review [RIN 0938-AR40], [CMS-9972-F] Proposed Rule: Patient Protection and Affordable Care Act; Establishment of Exchanges and Qualified Health Plans; Small Business Health Options Program [CMS-9964-P2], [RIN 0938-AR76] Final Rule: Patient Protection and Affordable Care Act; Establishment of the Multi-State Plan Program for the Affordable Insurance Exchanges [RIN 3206-AM47] Final Rule: Patient Protection and Affordable Care Act; HHS Notice of Benefit and Payment Parameters for 2014 and Amendments to the HHS Notice of Benefit and Payment Parameters for 2014; Proposed Rule: Patient Protection and Affordable Care Act; Establishment of Exchanges and Qualified Health Plans; Small Business Health Options Program [CMS-9964-F], [RIN 0938-AR51] Proposed Rule: Ninety-Day Waiting Period Limitation and Technical Amendments to Certain Health Coverage Requirements Under the Affordable Care Act [REG-122706-12, RIN 1545-BL50], [RIN1210-AB56], [CMS-9952-P, RIN 0938-AR77]}",
    "textBeforeTable": "",
    "textAfterTable": "$5,000 or more $  483,000.00 Provide a good faith estimate, rounded to the nearest $10,000, of all lobbying related income from the client (including all payments to the registrant by any other entity for lobbying activities on behalf of the client). 14. REPORTING Check box to indicate expense accounting method. See instructions for description of options. Method A. Reporting amounts using LDA definitions only Method B. Reporting amounts under section 6033(b)(8) of the Internal Revenue Code Method C. Reporting amounts under section 162(e) of the Internal Revenue Code Signature Digitally Signed By: Scott DeFife, EVP Policy Date 04/18/2013 LOBBYING ACTIVITY. Select as many codes as necessary to reflect the general issue areas in which the registrant engaged in lobbying on behalf of the client during the reporting period. Using a separate page for each code, provide information as requested. Add additional page(s) as needed. 15. General issue area code TAX 16. Specific lobbying issues Monitoring draft legislation to amend the Internal",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}