{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go to the beach, the MAC, read a book by the ocean, go biking, hiking, swimming, etc!",
            "The food is actually surprisingly good, especially at DLG!",
            "People are really nice in the dorms, plus its the best way to meet your classmates! Do it!",
            "It is difficult, I have to put in a lot of effort to pull As and Bs! Don't underestimate UCSB!",
            "Don't get too caught up in the party scene, but do go out there and have fun whether that means going out to a party or going to the beach on a saturday. Take advantage of the fantastic location, you'll never live anywhere this nice again!",
            "UCSB has been amazing so far. The weather is fantastic, the teachers are good, and the people are the nicest. Good balance of academics and partying!"
        ]
    ],
    "pageTitle": "University of California-Santa Barbara (UC Santa Barbara) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Santa-Barbara/reviews?_escaped_fragment_=/show/88775",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894935675,
    "recordOffset": 894723934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40863=There are four different dining commons at UCSB and each has its own specialty. De La Guerra (DLG) specializes in Mexican food, Ortega always has sushi at lunch and dinner, Carillo's specialty is Mongolian barbeque and Portola always has different types of bars (chili bar, burger bar). There are also always vegetarian and vegan options at every meal. Ortega provides take-out sack breakfasts or lunches for students who don't have time to sit down to a full meal in between classes (or if you want to have lunch on the beach after class with friends!). DLG also has late-night dining from 9pm to midnight on weeknights and serves everything that is not very healthy for you like burgers and fries (but that's all you really want at 9 o'clock at night anyway!). It's fun to take a break from cramming for finals to grab a bite to eat. The dining commons post their menus for the week online, which is nice because you can check which dining commons has the best food for that evening. Also, if you have certain allergies (nuts, gluten, milk, etc) or a food lifestyle (vegan or vegetarian) there is an online program where you can see what options fit your needs at each dining commons for that meal. All dining commons have a salad bar, fruit, breads, cereals, stuff to make a peanut butter and jelly sandwich, and pizza. The quality of the food is actually quite good! I was expecting average cafeteria-style food and was pleasantly surprised with how good the food is. As far as meal plans go, students have several options. If you live on campus you are required to have a meal plan. Students can choose from have 10 meals per week, 14 meals per week, 17 meals per week or unlimited meals per week. I would recommend 14 meals per week because it keeps you covered by the dining commons meals, but is flexible enough that you can go out to eat with friends if you want. By meals these are meals you are allowed to use in the campus dining commons. You also have the option of adding $300, $600 or $900 to your ID card to use at the other campus dining locations such as Subway, Panda Express, Wahoo's Fish Tacos, Woodstock's, Root 217, Nicoletti's Coffee, and Jamba Juice. If you do not live on campus, you can get a meal plan if you wish (5 or 10 meals per week). The only thing I don't like about the dining at UCSB is that your leftover meals don't rollover and guest meals are not included in your plan-- you have to pay those separately. Other than that, dining is superb., 650979=Super beautiful school! Definitely hoping to attend UCSB in the fall of 2013 and become a Gaucho!, 568392=The university's average SAT score was 1923 and their average GPA was 4.07. UC Santa Barbara puts a strong emphasis on research, which may potentially allow a student to earn class credit or even money (in the form of grants, scholarships, or an assistant's pay)., 556116=I recently got my classes for Fall 2012, and I can say that I got all of the classes I wanted. It would be harder to do this at a community college., 563653=The average GPA of incoming students is about 3.9 and the average SAT score is 1900. So be prepared to endure that rigor!, 1140323=Duh,the beach. There`s also bowling,drive-in theater,butterflies that visit in February,hiking,social life in IV, and other great things., 896807=The Undie Run: happens once a quarter during finals week. Students donate their clothing and then run the campus in their undies! Beginning of the year and end of the year concerts: sponsored by the university students do not have to pay!! We've had Drake, Snoop Dog, Kendrick Lamar, Dada Life and more, 137167=If you are definitely coming to UCSB then my number one tip would be to attend the Freshman Summer Start Program (FSSP). It's the summer before you freshman year and it's basically summer school. If you're saying to yourself Ptch, yeah right. Why would I take summer school before I'm even in college? I'll just say it again... SIGN UP! I didn't do it and it's a huge regret of mine. It will make your life so much easier. Honestly no matter where you go I'm sure they have programs like this. I come from a really small town and I think I only came in with 8.0 units (the equivalent of two classes). There are kids coming in who are already sophomores because of all the AP classes they took in high school. And summer school is something you should do every year. First of all, it's insanely fun to be in Isla Vista over the summer. And second of all spreading your units over a few extra quarters will make your life immensely easier. It is almost a must if you're going to study abroad and is also essential if you're thinking about graduating early. Summer sessions are either six or three weeks long depending on which ones you choose and you take one or two classes. Classes over summer are WAY easier than they are during the regular school year. Have to take Chemistry or Biology? Finish it in six weeks instead of ten, it'll be easier, and you'll be able to have fun during the regular school year. Speaking of studying abroad, do it. I'm leaving for Thailand in August and I can't wait. I recommend doing it your Junior year which I would have done, except that I didn't do summer school so I had to finish enough units. Out of everyone I know who's graduated already, if any of them say they have regrets it's always that they didn't study abroad. Also, there is NOTHING WRONG with going to a community college for the first two years then transferring as a junior. Seriously. No matter where you go. You save so much money and General Ed classes are the same everywhere. If I had a chance to do it over again I would do that instead.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 73 out of 75 people found this review useful. 1 of 256 Taryn from Granada Hills, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of California-Santa Barbara Reviews University of California-Santa Barbara › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Danielle from Westlake Village, CA 12/02/2009 Reviewer is A current student here. 42 out of 43 people found this review useful. 2 of 256 Categories Comments Great for these types of students This school is perfect for students who want a balance of academics and a social life. There is state street just a bus or car ride away, with tons of restaurants and shopping to entertain any college student. There's also Isla Vista, with cheap, open late restaurants and plenty of places to experience college nightlife. UCSB is for students who are friendly, fun, and self-motivated. Living in such a beautiful place also means that there are many distractions to schoolwork, but if you can stay focused and maintain that balance between work and play, your experience at UCSB will be unrivaled by any other college. Tips for prospective students I highly suggest visiting the campus before making a final decision. Honestly, I was barely considering attending UCSB, but decided to visit the school just to make sure I could cross it off my list. After spending one day on the campus and talking to current students,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}