{
    "relation": [
        [
            "Emma Griffin Simon Edwards",
            "Morgan Stanley (Joint Broker) Andrew Foster",
            "Pelham Bell Pottinger Mark Antelme",
            "Henry Lerwill",
            "Paradox Public Relations Jean-Francois Meilleur"
        ],
        [
            "Partner Partner",
            "Managing Director",
            "Director",
            "Account Director",
            "Consultant"
        ],
        [
            "",
            "+44 (0) 20 7425 8000",
            "+44 (0) 20 7861 3232",
            "",
            "+1 514 341 0408"
        ]
    ],
    "pageTitle": "XCITE ENERGY LIMITED : London, 15 November 2011 Xcite Energy confirms details of additional listing | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/XCITE-ENERGY-LIMITED-4007666/news/XCITE-ENERGY-LIMITED--London-15-November-2011-Xcite-Energy-confirms-details-of-additional-listing-13893960/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 265318519,
    "recordOffset": 265293490,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69958=Further to the announcement in relation to the draw down on the Standby Equity Distribution Agreement issued on 11 November 2011, the Company announces that it has received conditional approval of the share issue by the TSX Venture Exchange and it has therefore made an application for the admission to AIM (\"Admission\") of 2,168,257 ordinary shares of no par value in the capital of the Company (the \"New Ordinary Shares\"). The New Ordinary Shares shall rank pari passu with the Company's existing issued ordinary shares of no par value (\"Ordinary Shares\") and dealings are expected to commence on 18 November 2011. Following Admission, the Company's enlarged issued share capital will comprise 188,996,011 Ordinary Shares with one voting right per share. There are no shares held in treasury. The total number of voting rights in the Company is therefore 188,996,011. This figure of 188,996,011 Ordinary Shares may be used by shareholders in the Company as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change in their interest in, the share capital of the Company under the FSA's Disclosure and Transparency Rules., 69703=15 November 2011}",
    "textBeforeTable": "Oriel Securities (Joint Broker and Nomad) +44 (0) 20 7710 7600 Rupert Cole Chief Financial Officer Richard Smith Chief Executive Officer Xcite Energy Limited +44 (0) 1483 549 063 ENQUIRIES: Further to the announcement in relation to the draw down on the Standby Equity Distribution Agreement issued on 11 November 2011, the Company announces that it has received conditional approval of the share issue by the TSX Venture Exchange and it has therefore made an application for the admission to AIM (\"Admission\") of 2,168,257 ordinary shares of no par value in the capital of the Company (the \"New Ordinary Shares\"). The New Ordinary Shares shall rank pari passu with the Company's existing issued ordinary shares of no par value (\"Ordinary Shares\") and dealings are expected to commence on 18 November 2011. Following Admission, the Company's enlarged issued share capital will comprise 188,996,011 Ordinary Shares with one voting right per share. There are no shares held in treasury. The total number of voting rights in the Company is therefore 188,996,011. This figure of 188,996,011 Ordinary Shares may be used by shareholders in the Company as the denominator for the calculations by which they will determine if they are required to notify their interest in, or a change in their interest in, the share capital of the Company under the FSA's Disclosure and Transparency Rules. Additional Listing and Total Voting Rights",
    "textAfterTable": "Neither the TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release. Oriel Securities which is authorised and regulated in the United Kingdom by the Financial Services Authority, is acting exclusively for Xcite Energy and for no one else in connection with the subject matter of this announcement and will not be responsible to anyone other than Xcite Energy for providing the protections afforded to its clients or for providing advice in connection with the subject matter of this announcement. Morgan Stanley which is authorised and regulated in the United Kingdom by the Financial Services Authority, is acting exclusively for Xcite Energy and for no one else in connection with the subject matter of this announcement and will not be responsible to anyone other than Xcite Energy for providing the protections afforded to its clients or for providing advice in connection with the subject matter of this announcement.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}