{
    "relation": [
        [
            "Officer",
            "Police Officer Stanley Henney",
            "Police Officer Gary Hart"
        ],
        [
            "Date of Death",
            "Tuesday, May 31, 1977",
            "Wednesday, June 1, 1977"
        ],
        [
            "Details",
            "Gunfire",
            "Gunfire"
        ]
    ],
    "pageTitle": "California State University Police Department - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/California_State_University_Police_Department",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871251567,
    "recordOffset": 871225472,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31591=The CSU, Fresno Police Department was founded in 1962. In addition to law enforcement, the Fresno department administers Traffic Operations (parking enforcement & traffic control). CSUPD-Fresno is located at 2311 East Barstow Avenue, MS/PO14, Fresno, CA. Command structure consists of The Chief of Police, two Lieutenants and four Sergeants. In addition to standard patrol operations, the agency staffs two full-time Police Detectives., 46645=The California State University Los Angeles Police Department is located at 5151 State University Drive, Los Angeles, CA. The Police Department has 21 authorized police officer positions. Our sworn officers patrol the campus on foot, bikes, motorcycles, and marked vehicles. Officers are available 24-hours a day, seven days a week to respond to emergencies and serve the campus community. The CSULA University Police department became a nationally accredited agency in November of 2001. This accreditation is received from the Commission on Accreditation for Law Enforcement Agencies, Inc. (CALEA). Since then, the Department has been re-accredited four times (November 2004, November 2007, November 2010, and most recently in November 2013). The CSULA University Police has also been accredited by the International Association of College Law Enforcement Administrators (IACLEA) since June 2008., 38062=In November 2012, in response to an increasing number of traffic collisions and traffic injuries on and near the campus, the department created a Traffic Enforcement Unit with the purchase of a police motorcycle and currently staffs one full-time police officer in the position of motor officer.[5], 25819=The CSU, Dominguez Hills Police Department is located in Welch Hall, room B100. The mailing address for the department is 1000 E Victoria St, WH B100, Carson, CA., 7036=In 1990, the Jeanne Clery Disclosure of Campus Security Policy and Campus Crime Statistics Act became federal law. This law requires all universities to compile and publish data describing the reported crimes that occurred on campus. The data for specific campuses can be found on the websites listed at the end of this article., 28420=The CSU, East Bay Police Department is located at 25800 Carlos Bee Blvd, LI 1063, Hayward, CA., 43776=The CSULB Police Department is located at 1250 Bellflower Blvd. in the City of Long Beach, California. The Police Department is located in the brick building south of the Student Recreation and Wellness Center., 65015=The SDSU Police Department is located at 5500 Campanile Drive, San Diego, CA 92182-4390., 69979=Prior to the establishment of a police department at San José State University, the university employed night watchmen and security guards.[6] The San José Police Department provided law enforcement for the campus during this time. Beginning in the 1970s, the university began to hire sworn police officers. On October 1, 1975, the university established the police department, providing 24-hour law enforcement. In 1975, SJSU-PD was recognized by the California Commission on Police Officers Standards and Training. SJSU-PD currently has 32 sworn members, including the chief of police, 2 captains, 2 lieutenants, 8 sergeants, 6 corporals and 13 officers.[7] SJSU-PD has a Memorandum of Understanding with the San Jose Police Department that outlines geographical boundaries and jurisdictional duties, as well as policies on mutual aid.[8]}",
    "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT",
    "textBeforeTable": "Since the establishment of the California State University Police Department, 2 officers have died in the line of duty. The following officers were from the Hayward Campus.[9] Fallen officers[edit] The California State University, Office of the Chancellor is the Headquarters of the entire CSU System. The Public Safety Department staff has one sworn police officer who is also the System-Wide Chief of Police and Chief Law Enforcement Officer. There are also 4 non-sworn Community Services Specialists (CSS), charged with protecting and safeguarding the grounds of the Chancellor's Office, property, operations, employees, and other individuals on premises. Nate Johnson, System-Wide Chief of Police and Chief Law Enforcement Officer Agency executive 4 Unsworn members 1 Sworn members Operational structure Civilian agency Law enforcement General nature State University Legal jurisdiction Jurisdictional structure Governmental: Government agency Legal personality Agency overview California State University Public Safety Department, Office of the Chancellor CSUCO, Office of the Chancellor[",
    "textAfterTable": "See also[edit] University of California Police Department References[edit] ^ WAIS Document Retrieval ^ CSU | HRAdm | University Police ^ WAIS Document Retrieval ^ http://www.leginfo.ca.gov/cgi-bin/waisgate?WAISdocID=86960729427+0+0+0&WAISaction=retrieve ^ http://www.dailytitan.com/2013/02/motorcycle-program/ ^ SJSUPD ^ Department Overview ^ SJSUPD ^ [1] Significant events[edit] Operation Sudden Fall External links[edit] Police Department Websites CSUPD, Bakersfield CSUPD, Channel Islands CSUPD, Chico CSUPD, Dominguez Hills CSUPD, East Bay CSUPD, Fresno CSUPD, Fullerton CSUPD, Humboldt CSUPD, Long Beach CSUPD, Los Angeles CSUPD, Monterey Bay",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}