{
    "relation": [
        [
            "Sl. No.",
            "4.7",
            "4.8",
            "4.9",
            "4.10",
            "4.11",
            "4.12",
            "4.13",
            "4.14"
        ],
        [
            "Classification",
            "Total consideration relating to works contract (refer Box 4.6)",
            "Value of goods sold other than in the execution of works contract (refer Box 4.4)",
            "Value of goods sold other than in the execution of works contract (refer Box 4.4)",
            "Sale value of goods purchased / obtained from outside the State / Country (refer Box 4.3)",
            "Sale value of goods purchased / obtained from outside the State / Country (refer Box 4.3)",
            "URD purchase liable to tax under section 3(2)",
            "URD purchase liable to tax under section 3(2)",
            "Total"
        ],
        [
            "Rate",
            "4%",
            "4%",
            "12.5%",
            "4%",
            "12.5%",
            "4%",
            "12.5%",
            ""
        ],
        [
            "Amount (Rs.)",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Tax (Rs.)",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Karnataka Value Added Tax Notification",
    "title": "",
    "url": "http://www.saralvat.com/resources/karnoti/vat2007-20.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00197-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 693781839,
    "recordOffset": 693758103,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11718=1. Title and commencement.- (1) These rules may be called the Karnataka Value Added Tax (Amendment) Rules, 2007., 11968=            (2) They shall be deemed to have  come into force with effect from the first day of April, 2007., 34049=“Provided that the statement in Form VAT 240 for the year ending 31st March, 2007 shall be in the form as substituted in the Karnataka Value Added Tax (Amendment) Rules, 2007.”, 162069=(i)Stock of declarations / certificates / delivery notes under the KVAT Act, 2003., 119490=31(4) OF THE KVAT ACT, 2003, 163908=(1)Stock of declarations / certificates under the CST Act, 1956., 12469=2. Amendment of rule 3.- In the Karnataka Value Added Tax Rules, 2005 (hereinafter referred to as the said rules), in rule 3,, 23878=            Provided that where the works contract being executed is not complete  and the  registered dealer is unable to compute correctly the taxable amount as per rule 3 for the purpose of issue of any tax invoice, then such dealer shall immediately after commencement of the works contract or within thirty days from the date of notification of Karnataka Value Added Tax (Amendment) Rules, 2007 whichever is later, file a statement to the jurisdictional Local VAT Office or VAT sub-office declaring the basis on which such taxable amount would be computed till the completion of the works contract.}",
    "textBeforeTable": "    4.6 Balance total consideration   4.5 Amount of tax collected   4.4 Value of goods sold other than in the execution of works contract   yes\"> contract yes\">  / obtained / from outside the State / Country and transferred  in the  execution of works 4.3 Value of goods purchased Particulars             (1)in item 2.1, the words “Total consideration in the period” shall be omitted;             (2)for the entries relating to item 4, the following shall be substituted, namely:-             “4.For works contractors 29.Amendment of Form VAT 115.- In   normal\">30. Amendment of Form VAT 120.- In Form VAT 120 of the said rules,   yes\">   7.4 Taxable turnover of inter-State sales without C Forms at 12.5% tax ” ; yes\">   7.3Taxable turnover of inter-State sales without C Forms at 4% tax",
    "textAfterTable": "  31. Insertion of new Form VAT 127.- After Form VAT 126 of the said rules, the following new form shall be inserted, namely:- “FORM VAT 127 [See rule 44 (2)(a)] Monthly statement of tax deducted at source under section 18-A  for the month of ……….. Name and address of the registered dealer deducting tax    : Registration Certificate No.            (TIN) : Description of the goods purchased in respect of which tax is deducted Total amount payable (on which tax is charged by the seller in the tax invoices) in respect of the above goods by the registered dealer during the month Total amount of tax payable (as charged in th tax invoices by the seller) Amount of tax deducted at source at ……..% Details of remittance Challan No. and date, if remitted to Government Treasury / Bank Or Cheque, DD or Receipt No. and date if remitted to the Local VAT office or VAT Sub-office   DECLARATION I, ……………….. do hereby solemnly declare that to the best of my knowledge and belief,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}