{
    "relation": [
        [
            "Patent application number",
            "20090051487",
            "20090083281",
            "20090202220",
            "20090327712",
            "20110028216",
            "20110137920"
        ],
        [
            "Description",
            "System and Methods for the Remote Measurement of a Person's Biometric Data in a Controlled State by Way of Synchronized Music, Video and Lyrics - A method enabling a user with an electronic communication device to establish and stabilize his mental, emotional and physical condition in respose to stimulation data and then using biometric sensors applied to the user to provide for remote/local gathering of standardized biometric data into a remote database coordinated with remote server software via an electronic network. The method includes initiating a session and selecting a session type by the user. The method also includes loading a track with the stimulation data, establishing links to the biometric sensors, setting the timing tolerances and biometric parameters based on new or existing user rules, stimulating the user with at least one of visual, audio, lyrics, text and vibration tracks to elicit stimulation data from the user, recording time stamps corresponding to key/tap input, deriving sync relationship between the user and the stimulation data, waiting for the variance and biometric parameters to stabilize and displaying a depiction of the stabilized condition on a screen.",
            "SYSTEM AND METHOD FOR REAL TIME LOCAL MUSIC PLAYBACK AND REMOTE SERVER LYRIC TIMING SYNCHRONIZATION UTILIZING SOCIAL NETWORKS AND WIKI TECHNOLOGY - A method enabling a local user having a playback device with a specialized player plug-in device to synchronize a display of song lyrics to a timer clock of hosting playback software and to search a remote computer system. The system includes a database with songs and hosting playback software with an interface to enable the user to locally receive and play back lyrics and timing metadata synchronized to a local music digital file. The method includes the user sending a query to the database via a proprietary software interface, searching in the database for lyrics and associated synchronization information, sending lyrics and associated synchronization information back and synchronizing and displaying the lyrics by the hosting playback software and the specialized player plug-in device, thereby enabling all users to enjoy access to synchronized lyrics.",
            "SYSTEM AND METHOD FOR CREATION OF A CUE SHEET FOR MUSIC AND OTHER ASSET LICENSING USING AN EDIT DECISION LIST REVERSE SEARCH - A method to enable automatic creation of a cue sheet for reporting of digital assets used in production. The method begins by parsing an Edit Decision List having codes containing a digital asset file and the duration of time that file was used in the production process. The method also includes using the codes as a key for searching a database of rights' owners, the search returning owners' and other identifying information. The identifying information includes at least composer name, publisher name, and at least one appropriate authority. The next step provides for using the identifying information to create a legal cue sheet for reporting of the digital assets.",
            "SYSTEM AND METHOD FOR VARIABLE ENCRYPTION - A method for variable encryption of a plurality of files. The method serves a plurality of subscribers. The method includes receiving a request from one of the plurality of subscribers to download at least one of the plurality of files and receiving authorization to download the at least one of the plurality of files. The method also includes accessing the at least one of the plurality of files, encrypting the at least one of the plurality of files and inserting a key into the encrypted at least one of the plurality of files. Finally, the method includes downloading the encrypted at least one of the plurality of files to the one of the plurality of subscribers, extracting the key and deciphering the encrypted at least one of the plurality of files, thereby making available decrypted at least one of the plurality of files to the one of the plurality of subscribers.",
            "METHOD AND SYSTEM FOR A MUSIC-BASED TIMING COMPETITION, LEARNING OR ENTERTAINMENT EXPERIENCE - A method for a timing exercise performed on one of a dedicated player handset with screen and appropriate programming and a PC having appropriate programming and a screen, wherein a song is played, and wherein at least one sensor is provided to monitor activities of at least one participant. The method includes showing representations of the musical elements of the song on the screen of the dedicated player and recognizing at least one of the movements, facial expressions, body language, speech and identity of at least one participant; and as a result causing the representations to be “activated” by the participant, in the right order, at the right time and over the right duration.",
            "METHOD OF MAPPING SONGS BEING LISTENED TO AT A GIVEN LOCATION, AND ADDITIONAL APPLICATIONS ASSOCIATED WITH SYNCHRONIZED LYRICS OR SUBTITLES - The invention pertains to song-related software applications. More specifically, the invention describes mapping songs being listened to in a given area, identifying users listening to those songs, and optionally selecting to follow the songs listened to by a specific second user. The invention allows charting the most popular songs according to geographical location. Additionally, the invention allows a user to select an internet radio station and be provided with the synchronized lyrics of the song playing. The invention allows translation of lyrics into various languages and synchronization of the translation during playback of the song. The invention also allows a user to synchronize subtitles of multimedia presentations, with the playback of the presentation."
        ],
        [
            "Published",
            "02-26-2009",
            "03-26-2009",
            "08-13-2009",
            "12-31-2009",
            "02-03-2011",
            "06-09-2011"
        ]
    ],
    "pageTitle": "Amnon - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/amnon-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444538831,
    "recordOffset": 444507041,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Amnon Sarig, Woodland Hills, CA US 09-20-2012 SONG LYRICS GAME FOR AN ELECTRONIC DEVICE - The present invention is a lyrics game playable on an electronic device. A song is played by the device. The game includes showing the lyrics of the song on the screen of the dedicated player, each word in a different bubble and bursting the bubbles by the player, in the right order, at the right time, when the artist sings them, and over the right duration. 20120238350 Published Description Patent application number Amnon Sarig, Woodland Hills CA 01-23-2014 PORTABLE POWER SYSTEM - A portable self-sustained power system including, a transportable platform, a plurality of solar array racking structures. The system includes a plurality of solar panels securely mounted upon said solar array racking structures thereby supporting the solar panels to form a plurality of planar solar arrays. The system further includes a plurality of hinge posts, each respectively connected near the corners of said transportable platform. The system further includes a plurality of solar array support frames, each of the solar array support frame vertically hinged to respective hinge posts, wherein the respective solar array support frame is capable of rotating at various angles around the vertical axis of the respective hinge post. The system further includes a plurality of horizontal hinges; each horizontal hinge rotatably interconnected between the solar arrays and the plurality support frames respectively, each respective hinge",
    "textAfterTable": "Amnon Shabo, Haifa IL Patent application number Description Published 20100104200 Comparison of Documents Based on Similarity Measures - Techniques for comparing a first document to one or more second documents are provided. At least one weight is assigned to one or more elements in the first document. A weighted document is generated in accordance with the at least one assigned weight. One or more comparison scores are computed by comparing each of the one or more elements in the first document to each of one or more elements in a given second document in accordance with one or more comparison rules. The one or more comparison rules determine if a given element in the first document and a given element in the given second document are compared using one or more language hierarchies and/or one or more similarity ranges. A similarity score is generated in accordance with the generated weighted document and the one or more computed comparison scores. The one or more second documents are retrieved in accordance with the generated similarity score. 04-29-2010 Amnon Shashua, Mevasseret Zion IL Patent application number Description Published 20090143986 Collision Warning System - A method of estimating a time to collision (TTC) of a vehicle with an object comprising: acquiring a plurality of images of the object; and determining a TTC from the images that is responsive to a relative velocity and relative",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}