{
    "relation": [
        [
            "Date",
            "30th",
            "31st",
            "31st",
            "31st",
            "01st",
            "01st",
            "02nd",
            "03rd",
            "03rd",
            "04th",
            "04th",
            "05th",
            "05th"
        ],
        [
            "Club",
            "Manumission",
            "Carry On Manumission",
            "Godskitchen",
            "Miss Moneypennys",
            "Clockwork Orange",
            "Renaissance",
            "Cream",
            "Ministry Of Sound",
            "Trade",
            "Bugged Out",
            "Dance Anthems",
            "Sundissential meets Fantazia",
            "Strawberry Sundae"
        ],
        [
            "Venue",
            "Privilege",
            "Space",
            "Amnesia",
            "El Divino",
            "Es Paradis",
            "Pacha",
            "Amnesia",
            "Pacha",
            "El Divino",
            "Amnesia",
            "Eden",
            "Pacha",
            "Es Paradis"
        ],
        [
            "Line-Up",
            "",
            "",
            "Tall Paul, Brandon Block, Alex P, Judge Jules, Norman Jay, Tony Oneto",
            "John Kelly, Danielle Davioli",
            "Paradis Jeremy Healy, Lisa Loud, Alex P, Graham Gold, Miss Bisto, Andy Manston",
            "Satoshi Tomiee, Danny Rampling, Lord G, DJ Pippi",
            "Seb Fontaine, Dave Seaman, Scott Bond, Les Ryder",
            "Deep Dish, Eddie Amador, Freddy Fresh, The Prodigal Sonz",
            "Guy Williams, Fergie, Steve Thomas, Tasty Tim, Pete Wardman",
            "Roger Sanchez, Junior Sanchez, Rob Bright, James Holroyd, Richard Hector Jones",
            "Dave Pearce, Rob Tissera",
            "Tall Paul, Lisa Lashes, DJ Gee, DJ Pippi",
            "Sharp Boys, Chris Ruff Stuff, Duncan Disorderly, Dan Adams, Miss Bisto, Slipmat, Watford Gary"
        ]
    ],
    "pageTitle": "BBC Radio 1 | Ibiza 99 | Clubbing Calendar",
    "title": "",
    "url": "http://www.bbc.co.uk/radio1/ibiza99/calendar.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 314622927,
    "recordOffset": 314605805,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11006=One of Carl Cox's favorite clubs pops its cherry in Ibiza taking up the Saturday residency at Amnesia. Bugged out has a reputation for being one of the most cutting edge clubs in the world and with the likes of Dave Clarke, Green Velvet, Armand Van Helden and Roger Sanchez playing this summer. The edge is slightly blunted in August when Fatboy Slim joins the Skint lot for a party, still we can forgive them for that.}",
    "lastModified": "Tue, 02 Dec 2014 09:36:47 GMT",
    "textBeforeTable": "Top of Page Jun 21st - Jun 27th Ministry of Sound This club needs no introduction whatsoever. Having firmly established itself as one of the biggest clubs to have come out of the UK, Ministry's Ibiza residency provides that home from home regularity some holiday makers need. What a top summer season they have lined up too, with the Americans really pressing for prominence in Ibiza this year. There is a Azuli Records Party, a Strictly Rhythm Party and an oh so cool Subliminal Records Party to finish off the summer. Renaissance Renaissance in the UK are most notable for their hallmark of quality and excellence in everything they do. When they pack up their super stylish holiday trunks and head off to the Balearics they don't forget to pack the style. This year they return to Pacha with a line up of DJ's and a club deck out worthy of being titled a 'Masterpiece'. Cream Scouse house masters head off to the Balearics for their sixth consecutive year. Highlight of the year for Cream this year must be the booking",
    "textAfterTable": "Date Club Venue Line-Up 28th Manumission Privilege Line-Up 28th UFO Es Paradis Stretch and Vern, Darren Stokes, The Priest 29th Carry On Manumission Space   29th Miss Moneypennys El Divino Divino Danny Rampling, Chris Coco, Jim Shaft Ryan 29th Twice As Nice and Experience Club Summon Spoony, Booker T, DJ Rodrigo 29th Godkitchen Amnesia Tall Paul, Brandon Block, Alex P, Jeremy Healy, Tony Oneto 30th Renaissance Pacha Danny Rampling, Fathers Of Sound, DJ Pippi 30th Clockwork Orange Es Paradis   01st Cream Amnesia",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}