{
    "relation": [
        [
            "Published Date",
            "Sep 6, 2011",
            "Sep 1, 2011"
        ],
        [
            "Version",
            "2 (current)",
            "1"
        ],
        [
            "Files",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - CONZIP- tramadol hydrochloride capsule, extended release",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=51357",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60924087,
    "recordOffset": 60877156,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4319=Revised: 06/2011, 111233=To report SUSPECTED ADVERSE REACTIONS, contact Vertical at (877) 958-3784 or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 76530=ConZip™ capsules were administered to a total of 1987 patients in clinical trials. These included four double-blind and one long-term, open-label study in patients with osteoarthritis of the hip and knee. A total of 812 patients were 65 years or older. Adverse reactions with doses from 100 mg to 300 mg in the four pooled, randomized, double-blind, placebo-controlled studies in patients with chronic non-malignant pain are presented in the following table (see Table 1)., 106653=Revised: 6/2011}",
    "textBeforeTable": "Number of versions: 2 CONZIP- tramadol hydrochloride capsule, extended release View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Vertical Pharmaceuticals Inc. (173169017) 08/31/2011 NDA022370 NDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 30 in 1 BOTTLE, PLASTIC NDC:68025-056-30 1 Marketing End Date",
    "textAfterTable": "RxNorm CONZIP- tramadol hydrochloride capsule, extended release RxCUI RxNorm NAME RxTTY 1 1148478 traMADol HCl 100 MG 24HR Extended Release Oral Capsule PSN 2 1148478 24 HR tramadol hydrochloride 100 MG Extended Release Oral Capsule SCD 3 1148482 ConZip 100 MG 24HR Extended Release Oral Capsule PSN 4 1148482 24 HR tramadol hydrochloride 100 MG Extended Release Oral Capsule [ConZip] SBD 5 1148482 24 HR ConZip 100 MG Extended Release Oral Capsule SY 6 1148482 ConZip 100 MG 24 HR Extended Release Oral Capsule SY 7 1148485 traMADol HCl 200 MG 24HR Extended Release Oral Capsule PSN 8 1148485 24 HR tramadol hydrochloride 200 MG Extended Release Oral Capsule SCD 9 1148485 tramadol hydrochloride 200 MG 24 HR Extended Release Oral Capsule SY 10 1148487 ConZip 200 MG 24HR Extended Release Oral Capsule PSN 11 1148487 24 HR tramadol hydrochloride 200 MG Extended Release Oral Capsule [ConZip] SBD 12 1148487 24 HR ConZip 200 MG Extended Release Oral Capsule SY 13 1148487 ConZip 200 MG 24 HR Extended Release Oral Capsule SY 14 1148489",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}