{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/02/06/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 718078807,
    "recordOffset": 718006923,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10527=TOBY JOHNSTONE February rate cut unnecessary, say Sydney real estate agents.}",
    "TableContextTimeStampAfterTable": "{248585=take it easy, Feb 5, 2013, 11:54AM, 121255=Perth beauties strutted their stuff at the Perth heats 1 & 2 for Miss Universe 2013., 122151=February 17 No, your eyes do not deceive you - David Hasselhoff is coming to Perth., 123095=February 21 The former Beatle is coming to entertain Perth. (With a little help from his friends)., 99604=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 244933=PM announces election for September 14, 247611=take it easy, Feb 5, 2013, 12:00PM, 243290=1375 views, 242425=1671 views, 124119=March 2 A reunion that fans will not want to miss. Neil Young and Crazy Horse are headed for Perth., 119513=February 6 Elvis Costello's love affair with Australia continues., 241570=2204 views, 260797=February 04 2013}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Taking its title from an appalled headline in the Daily Mirror, this two-part survey looks at what has incited the ire of ABC viewers. Shock-Horror Aunty What's on TV Tonight A place to express personal views on local news. Gathering of the minds Our local experts give you the advice you ask for. Good Advice Opinion Book your tickets now and win an art adventure in Paris. Line up your laughs Brisbane Comedy Festival Like the Laneway Festival only with more (prescription) drugs.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}