{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "use the gym, watch basketball games, be innovative",
            "good",
            "no dorms",
            "managable",
            "make good use of the student learning center",
            "has dedicated professors"
        ]
    ],
    "pageTitle": "Essex County College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Essex-County-College/reviews?_escaped_fragment_=/show/34687",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902599003,
    "recordOffset": 902559939,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11667=The tuition compared to other schools is really cheap. My spring and fall semesters were only around $4000 together, and I didn't have to pay for anything except for my $54 bus pass each month. Filling out FAFSA got me a $3900 Pell Grant, $800 from HESAA, and $1000 something from the STEM program here, so my tuition and books were pretty much covered. The books both semesters were about $400-500 each., 124431=I am starting in Fall 2013, so I cannot really speak about the classes as of yet. I will however come back and update at a later date, 166090=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "04/15/2010 Reviewer is Researching this school. Reviewer has been to campus. 4 out of 8 people found this review useful. 1 person found it offensive. 1 of 48 anonymous Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "If you knew my real name chances are you know me. Study and you will see yourself in the media one day or on Forbes ;) 02/17/2011 Reviewer is A past student here. 4 out of 6 people found this review useful. 1 person found this inaccurate. 2 of 48 Categories Comments Great for these types of students Those that want to succeed and are ready to study. Tips for prospective students Study, READ (i cannot emphasize this enough so READ!), network with the professors, join the wonderful engineering club. Bang for the buck Most students here go for free, but for the ones that have to pay (me), it is definitely cost effective. DO well here and you can get a scholarship to the next. When you graduate, while all your high school friends who went to those expensive schools are busy paying their loans, you can buy yourself a nice Porsche. Good Trade off! Did enjoy being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}