{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "Woodlawn Tap: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/WoodlawnTap/WoodlawnTap.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00115-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357609232,
    "recordOffset": 357592838,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35977=Jimmy Wilson ran what he called the \"Woodlawn Tap,\" but no one else did. Following a brief stint working for Drexel Bank and as a bartender at nearby University Tap (now gone), Wilson ran the joint from 1948 until his death on February 22, 1999. During his reign, Jimmy catered to everyone under the sun, and regular patrons have even included Pulitzer Prize winner Saul Bellow (as U of C student and professor), anthropologist Margaret Mead, and the poet Dylan Thomas even ventured forth from the White Horse Tavern in New York City to stop by not once, but three times, between U of C speaking engagements. In the words of House Resolution 91_HR0335, as passed by the State of Illinois State of Illinois 91st General Assembly: \"Jimmy Wilson and the Woodlawn Tap built a tradition of bringing together community residents, workers, and students, faculty, including Nobel Prize winners, and staff from the University of Chicago; crossing divides of race, class, and ethnicity and providing entertainment, humor, and joy to the patrons... Jimmy Wilson provided employment to hundreds of community residents and students, in many cases enabling those students to afford the costs of completing their education with the wages they earned...\" Jimmy was also recognized on his 70th birthday by the University of Chicago itself, with a proclamation naming him an honorary post-doctoral alumnus for providing fond memories to decades of University of Chicago students., 46264=– L.S. (March 6, 2009), 45582=\"On April 25, 1958, I married my husband and we were given our wedding reception at Jimmy's. Since my Father was ill, I asked Jim to \"give me away\" (The wedding was at the small 14th century, side-chapel of the Unitarian Church). Jim was a workaholic, as you may remember, and he agreed initially, but later gave me a happy alternative. He shut off all but the front room for our reception and provided all the food and drink for many hours. (Not a characteristic behavior for Jimmy, but he loved my husband and I and we loved him. We all loved Jimmy. I would never have trusted anyone who didn't love Jimmy.\", 44403=\u0096 Morgan Wascko posting on Metromix (July 30, 2003), 27159=The Woodlawn Tap, better known simply as \"Jimmy's\" because of the legendary barkeep that owned it for a half century, busily caters to students, professors and even Nobel Peace prize winners from the University of Chicago with equal vigor as to neighborhood residents, tradesmen and barstool philosophers from the School of Hard Knocks, of all races and economic solvencies. Even the inebriate poet, Dylan Thomas, is said to have whet his whistle on three separate occasions at the Woodlawn Tap (on the same day). Back then, this strip of 55th was a bustling strip of boozing until the urban decay set in that plagued the city from the time of the riots, following the assassination of Martin Luther King Jr. in 1968, all the way through the mid-1980s. A good bar is hard to find in these parts today, though The Cove and Bar Louie tries hard and both Seven Ten and the New Checkerboard Lounge have moved in. Jimmy's Woodlawn Tap is still the place to go in Hyde Park for conversation, cheap-but-good pub grub and free jazz every Sunday night, even though Jimmy has since gone to tend that Great Tavern in the Sky., 40383=\u0096 excerpt from \"Jimmy Wilson: Owned Woodlawn Tap\" by Diane Struzzi in the Chicago Tribune (February 24, 1999), 32842=The floor, ceiling and faux wood paneling on the walls are all painted black so you can't see over 50 years' worth of accumulated tar from the cigarette smoke, though the off-white portion three-quarters of the way up does. Whether you love or hate the Illinois Smoking Ban, which took effect statewide on January 1, 2008, you can thank the Woodlawn Tap for it. The Environmental Protection Agency conducted a survey of air quality at 25 Chicago businesses and found the Woodlawn Tap to be the worst. Patrons have always claimed that the bar was smoky, but no one realized that the air quality measured was equivalent to breathing after a volcanic eruption and thus labeled \"hazardous\" by the EPA with 195 times more pollutants than the average non-smoking setting. Present ownership installed a new exhaust fan following the study., 37567=\"'Whereas,' began a proclamation read by a university vice president, 'The Woodlawn Tap has served for many years as a center of intellectual ferment enlivened by occasional imprudence in the consumption of fermented beverages, and \"'Whereas Mr. Jimmy Wilson, proprietor of the Woodlawn Tap, has sought to assiduously maintain 'In Vino Veritas' as a scholarly adjunct to 'Crescat Scientia, Vita Excolatur,' and \"'Whereas generations of University of Chicago graduates retain the image of The Woodlawn Tap as a pleasant, sometimes central aspect of campus life, \"'Now therefore do I, Hanna H. Gray, President of the University of Chicago, wishing to make proper observance of April 18, 1982, as Jimmy Wilson's 70th birthday, Declare Mr. Wilson an honorary post-doctoral alumnus of this university and send him greetings.'\", 38491=\u0096 excerpt from \"Pageantry is on Tap at the Woodlawn\" by Jon Anderson in the Chicago Tribune (April 21, 1982), 35902=\u0096 J.S. (January 24, 2003)}",
    "lastModified": "Mon, 15 Nov 2010 20:38:00 GMT",
    "textBeforeTable": "1172 E. 55th St. (5500S, 1100E) Chicago, IL 60615 (773) 643-5516 Woodlawn Tap Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "The Woodlawn Tap, better known simply as \"Jimmy's\" because of the legendary barkeep that owned it for a half century, busily caters to students, professors and even Nobel Peace prize winners from the University of Chicago with equal vigor as to neighborhood residents, tradesmen and barstool philosophers from the School of Hard Knocks, of all races and economic solvencies. Even the inebriate poet, Dylan Thomas, is said to have whet his whistle on three separate occasions at the Woodlawn Tap (on the same day). Back then, this strip of 55th was a bustling strip of boozing until the urban decay set in that plagued the city from the time of the riots, following the assassination of Martin Luther King Jr. in 1968, all the way through the mid-1980s. A good bar is hard to find in these parts today, though The Cove and Bar Louie tries hard and both Seven Ten and the New Checkerboard Lounge have moved in. Jimmy's Woodlawn Tap is still the place to go in Hyde Park for conversation, cheap-but-good pub grub and free jazz every Sunday night, even though Jimmy has since gone to tend that Great Tavern in the Sky. The Woodlawn Tap is located in Hyde Park, just beyond the northeast corner of the University of Chicago campus and next to the corner Starbucks, newly constructed out of the remains",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}