{
    "relation": [
        [
            "Date",
            "Jun 20, 2005",
            "Jan 3, 2011",
            "Aug 20, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: BEIJING JOINN PHARMACEUTICAL CENTER, CHINA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ZHOU, ZHIWEN;FENG, YUXIA;ZUO, CONGLIN;AND OTHERS;REEL/FRAME:017380/0854 Effective date: 20050615",
            "Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BEIJING JOINN PHARMACEUTICAL CENTER;REEL/FRAME:025571/0325 Owner name: BEIJING SOLOBIO GENETECHNOLOGY COMPANY LTD., CHINA Effective date: 20100928",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7906641 - Group of nucleic acid fragments for prevention of HIV infection or AIDS and ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7906641?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473761319,
    "recordOffset": 473738530,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35206=HIV genome sequences published were selected and separated into 70 nt fragments based on functional genes of HIV. Homology of every fragment with more than 140,000 sequences in Genebank (National Center of Biological Information, USA), EMBL (Nucleotide Sequence Database in Europe Molecular Biology Laboratory), DDBJ (Japan nucleotide database) and GDB (gene database) was analyzed by BlastN 2.2.4/2.2.5. The conserved RNA sequences were selected by the following criteria: (1) The sequence is equal or longer than 19 nt; (2) The sequence was 100% homology with at least 1000 HIV sequences in the database; (3) If 100% homology fragments can not be found, The sequences containing 1 mismatched nucleotide were included. The results of the analysis were shown in table 1 and table 2.}",
    "textBeforeTable": "Patent Citations 27 ggauggugcu ucaagcuagu accaguu <400> 9 <213> Lentivirus genera <212> RNA <211> 27 <210> 9 23 acagccgccu agcauuucau cac <400> 8 <213> Lentivirus genera <212> RNA <211> 23 <210> 8 26 accacacaca aggcuacuuc ccugau <400> 7 <213> Lentivirus genera <212> RNA <211> 26",
    "textAfterTable": "Mcswiggen James A. RNA interference mediated inhibition of HIV gene expression using short interfering RNA JP2006502694A Title not available WO2002044321A2 * Nov 29, 2001 Jun 6, 2002 Max Planck Gesellschaft Rna interference mediating small rna molecules WO2003070193A2 Feb 20, 2003 Aug 28, 2003 Sirna Therapeutics Inc RNA INTERFERENCE MEDIATED INHIBITION OF HIV GENE EXPRESSION USING SHORT INTERFERING NUCLEIC ACID (siNA) * Cited by examiner Non-Patent Citations Reference 1 * Agrawal, S. et al., Molecular Med. Today, vol. 6, pp. 72-81 (2000). 2 * Branch, A., Trends in Biochem. Sci., vol. 23, pp. 45-50 (1998). 3 Carl D. Novina et al., \"siRNA-directed inhibition of HIV-1 infection\", Nature Medicine, 2002, 8(7): 681-686. 4 * Chirila, T. et al., Biomaterials, vol. 23, pp. 321-324 (2002).",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}