{
    "relation": [
        [
            "Term",
            "i",
            "y",
            "TOT",
            "FI",
            "CT",
            "Oiy",
            "P(CT/TOT)",
            "P(CT/FI)"
        ],
        [
            "Explanation",
            "Subscript to represent site i",
            "Subscript to represent the year y The first year of the analysis period is considered Year 1 (i.e., y=1) The last year of the analysis period is considered Year Y (i.e., y=Y)",
            "Subscript to denote total crashes",
            "Subscript to denote fatal and injury crashes",
            "Subscript to denote crash type",
            "Observed number of crashes at site i during year y",
            "Calculated proportion of crashes of the crash type of interest for all TOT crashes for all years of available data",
            "Calculated proportion of crashes of the crash type of interest for all FI crashes for all years of available data"
        ]
    ],
    "pageTitle": "Default Data - Applications of ISAT, Interchange Safety Analysis Tool (ISAT): User Manual, June 2007 - FHWA-HRT-07-045",
    "title": "Table 34. Nomenclature for crash distribution calculations.",
    "url": "https://www.fhwa.dot.gov/publications/research/safety/07045/def.cfm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00019-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899720039,
    "recordOffset": 899677465,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{346522=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 186869=Assume that 60 total crashes were observed at these 20 sites during the period from 2001 through 2005., 189128=Five years of crash data were used, from 2001 through 2005., 187976=Having entered all of the input data on the Input-General and Input Mainline Freeways worksheets, the calculations are performed by clicking the Perform Calculations button on the Input-General worksheet. Table 32 shows a portion of the output report generated for this example. In this case the table of interest is the number of predicted crashes by interchange element type which shows the number of predicted crashes for the four interchange element types. In this example data were input only for mainline freeway segments. Table 32 indicates that 55.1 total crashes were predicted to occur on these 20 sites during the 5 year period from 2001 to 2005.}",
    "textBeforeTable": "The ramp SPFs within SafetyAnalyst were developed by combining the data for rural and urban areas; thus, separate ramp SPFs are not necessarily available for rural and urban areas. For consistency purposes the SPFs are presented by area type, but the coefficients and parameters are the same for both area types. Portions of the SPFs Ramps worksheet are protected. The user may only modify the default values for the Log intercept (a), Coeff of ADTramp (b), Coeff of ramp length (e), dispersion parameter, and Max ADT. Severity level. Ramp configuration. Ramp type. Area type. Portions of the SPFs Mainline Freeways worksheet are protected. In other words, if the user tries to modify the value of a protected cell, a message will appear indicating the cell is protected, and the user is restricted from modifying the default value in the given cell. On the SPFs Mainline Freeways worksheet, the cells with column headings for SPF No., Area type, Interchange area, Number of through lanes, and Severity level are protected. The user may only modify the default values for the Log intercept (a), Coeff of log ADT (b), dispersion parameter, and Max ADT. Ramp SPFs Two sets of default SPFs associated with ramps are provided within ISAT. The default SPFs used to predict the safety performance for the ramp proper are located on the SPFs Ramp worksheet and are accessible only through the Go To SPFs for Ramps hyperlink on the Input-General worksheet.",
    "textAfterTable": "DMF9 1 R Y 2 TOT -7.28 0.92 0.45 60,621 2 R Y 3 TOT -10.05 1.14 0.42 197,798 3 U Y 2 TOT -11.23 1.30 0.81 241,255 4 U Y 3 TOT -11.25 1.28 0.60 255,154 5 U Y",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}