{
    "relation": [
        [
            "Name",
            "Akademik Kurchatov",
            "Dmitriy Mendeleyev"
        ],
        [
            "Year",
            "",
            ""
        ],
        [
            "FLT",
            "BALT",
            "PAC"
        ],
        [
            "Homeport",
            "",
            "Vladivostok"
        ],
        [
            "Notes",
            "",
            ""
        ]
    ],
    "pageTitle": "World Navies Today: Russian Civilian Scientific & Support Vessels",
    "title": "",
    "url": "http://www.hazegray.org/worldnav/russia/aux_civ.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492219796,
    "recordOffset": 492203838,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33511=Builders: Mathias Thesen Werft, Wismar, East Germany. Built 1966-1968., 4510=Disposals/Reserve: Arktika and Sibir' have been laid up since 1992, reportedly due to severe hull deterioration; they probably will not return to service., 55410=Concept/Program: Converted from Vytegrales class timber carriers. Operated by the Navy until transferred to the Ministry of Space in 1995. Mostly inactive since 1991., 58924=Disposals/Reserve: Geolog Petr Antropov sold 1995., 19682=Concept/Program: Intended for service on inland rivers and seas. Fitted for towing, salvage and firefighting. Kapitan A. Radzhabov may have been transferred to Azerbaijan., 71835=Concept/Program: Large four-masted bark, originally a German-owned working sailing ship, taken over by the USSR in 1946. Operated by the Kaliningrad Higher Marine Engineering College. Second-largest active sailing ship in the world., 57400=Concept/Program: Large oceanographic research ships; both have operated in commercial cruiseship service since 1994., 6148=Disposals/Reserve: Kapitan Makarov scrapped 1995., 35132=Builders: A. Warski SY, Szczecin, Poland. Built 1969-1970., 40855=Concept/Program: Large oceanographic research ships; resemble small cruise ships in design. Four sisters are weather reporting ships for the Hydromet Service. Mostly inactive since 1991., 39185=Disposals/Reserve: Vasily Lominadze to Azerbaijan., 30948=Disposals/Reserve: Professor Fedinskiy to Azerbaijan., 33331=Concept/Program: Large weather reporting ships; resemble small cruise ships in design. Two sisters assigned to the Academy of Sciences. Mostly inactive since 1991., 70828=Concept/Program: Large four-masted bark, originally a German-owned working sailing ship, taken over by the USSR in 1946. Operated by the Kaliningrad Higher Marine Engineering College. Largest active sailing ship in the world.}",
    "lastModified": "Sun, 09 Oct 2005 18:46:17 GMT",
    "textBeforeTable": "Disposals/Reserve: Arktika and Sibir' have been laid up since 1992, reportedly due to severe hull deterioration; they probably will not return to service. Builders: Baltic SY, St. Petersburg. Concept/Program: Large, highly capable icebreakers intended for service in heavy polar ice conditions. Are the world's most powerful icebreakers; all units have been to the North Pole at least once. Have lavish accommodations and have been used as polar cruise ships in recent years. The final unit is being built to a modified design, with accommodations for 100 passengers, but construction has stalled. Aviation: aft flight deck and hangar for 2 Ka-32 helicopters Radar: MR-760 Fregat-MA/Top Plate 3-D air search in some Crew: 147 + 35 passengers Propulsion: Steam turbine-electric, 2 reactors, 3 shafts, 72,000 shp, 20.5 knots Dimensions: 150 x 30 x 11 meters/492.1 x 98.4 x 36.1 feet (last unit: 159.6 x 30 x 11 meters/523.6 x 98.4 x 36.1 feet) Displacement: 23,625 tons full load (last unit: 25,800 tons full load) Arktika class nuclear powered polar icebreakers (3+1 ships) Ministry of the Merchant Marine Ministry of the Merchant Marine Ministry of the Gas Industry and oil/gas exploration ships Hydrometeorological Service and weather ships Academy of Sciences Ministry",
    "textAfterTable": "Yamal 1992 NOR 50 Let Pobedy suspended [Back To Top] Yermak class polar icebreakers (2 ships) Displacement: 20,241 tons full load Dimensions: 134.83 x 26.07 x 11 meters/442.4 x 85.5 x 36.1 feet Propulsion: Diesel-electric, 9 Sulzer diesels, 3 shafts, 36,000 shp, 19.5 knots Crew: 91 + 55 passengers Aviation: aft helicopter deck Concept/Program: Russia's most powerful non-nuclear icebreakers. Builders: Wartsila, Helsinki, Finland. Disposals/Reserve: Kapitan Makarov scrapped 1995. Name Year FLT Homeport Notes Yermak 1974 PAC Vladivostok Krasin 1976 NOR Murmansk [Back To Top] Discarded Classes: All five Moskva class polar icebreakers stricken by 1997. Taymyr class large nuclear powered coastal icebreakers (2 ships) Displacement: 23,460 tons full load Dimensions: 150.2 x 29.2 x 9 meters/492.8 x 95.8 x 29.5 feet Propulsion: Steam turbine-electric, 1 KLT-40M reactor, 2 turbines, 3 shafts, 48,000 shp, 22 knots Crew: 110 + flight crew + medical personnel Aviation: aft helicopter deck and hangar for 1 Ka-32 helicopter Concept/Program: Very large icebreakers intended for service in Arctic estuaries and other",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}