{
    "relation": [
        [
            "2000 President",
            "Gore 51%",
            "Bush 39%",
            "Nader 7%"
        ],
        [
            "2004 President",
            "Kerry 62%",
            "Bush 34%",
            ""
        ],
        [
            "2008 President",
            "Obama 69%",
            "McCain 29%",
            ""
        ]
    ],
    "pageTitle": "VPR Reports Campaign 2008 : Elections coverage from VPR and NPR",
    "title": "",
    "url": "http://www.vpr.net/news/campaign_2008/index.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 813853127,
    "recordOffset": 813834078,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17552=Newscast: Tuesday, November 20,  2012, 5:50 p.m., 3511=Key elements include a requirement that would cut the power industry's carbon pollution by 32 percent below 2005 levels in the…, 29602=Listen to the profiles of the candidates for office in Vermont in Campaign 2008., 8035=Today the Chicago 2016 delegation made their case to the European Olympic Committees General Assembly, which is taking place in…, 6818=Via the WP, Handshake Man will not be putting in an appearance at the 2009 Inauguration festivities. The Rev. Richard C.…, 19677=The Vermont Senate has overwhelmingly rejected a proposal to move the state's primary elections to early August. The early date…, 590=Hillary Clinton has been in the national spotlight since 1992 and has universal name ID, but her campaign hopes a $2 million ad…, 30306=VPR and NPR will provide a full night of local and national election coverage on Tuesday, November 4th beginning at 7pm. View the complete schedule of coverage and analysis of Vermont and national races., 9778=Well, friends, today marks the swan song for Vox Politics as we close out our election unit until the 2010 midterms. This is our…}",
    "textBeforeTable": "260 of 260 Precincts 100% President Election Results from the Associated Press More Headlines Analysis: Legislative make-up remains largely unchanged VT GOP fails to expand its numbers Interview: Howard Dean VPR Reports Campaign 2008 Election coverage from VPR and NPR News Contributing Listeners Financial & EEO Information Press Releases Achievements VPR Facts and FAQs People Careers at VPR Directions to VPR Studios Contact VPR's Mission History Board of Directors Membership FAQs VPR Goes to Fenway Planned Giving Business Underwriting Volunteer Shop",
    "textAfterTable": "3,071 1.0% Bob Barr Wayne A. Root Libertarian 991 0.3% Chuck Baldwin Darrell L. Castle Constitution 521 0.2% Brian Moore Stewart Alexander Liberty Union 198 0.1% Roger Calero Alyson Kennedy Socialist Workers 145 0.0% Gloria La Riva Eugene Puryear Socialism and Liberation 140 0.0% U.S. House of Representatives 260 of 260 Precincts 100% Candidate Party Affiliation Popular Votes % of Votes Peter Welch Incumbent Democratic 235,375 84.1% Mike Bethel Independent 13,730 4.9% Jerry Trudell Independent 9,997 3.6% Thomas Hermann Progressive 7,919 2.8% Cris Ericson Independent 7,450 2.7% Jane Newton Liberty Union 5,474 2.0% Governor 260 of 260 Precincts 100% Candidate Party Affiliation Popular Votes % of Votes Jim Douglas Incumbent Republican 164,895 54.7%",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}