{
    "relation": [
        [
            "Category",
            "Promoters",
            "Foreign Investors - FIIs, NRIs and others",
            "Domestic institutions/ Banks / Mutual Funds",
            "Indian Public",
            "TOTAL - 1.2 million shareholders"
        ],
        [
            "No. of Shares",
            "132,982,272",
            "50,024,947",
            "13,867,954",
            "48,757,627",
            "24,56,32,800"
        ],
        [
            "Shareholding (%)",
            "54.1%",
            "20.4%",
            "5.6%",
            "19.9%",
            "100.0%"
        ]
    ],
    "pageTitle": "Reliance Capital Limited : Reliance Capital announces results for year ended March 31, 2013 | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/RELIANCE-CAPITAL-LIMITED-9058959/news/Reliance-Capital-Limited--Reliance-Capital-announces-results-for-year-ended-March-31-2013-16866779/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 268778107,
    "recordOffset": 268752973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80888=The business had revenues of Rs. 261 crore (US$ 48 million) for the year ended March 31, 2013, 72529=As on March 31, 2013, the net worth of the Company stood at Rs. 11,991 crore (US$ 2.2 billion) - an increase of 3%., 79234=The total income for the year ended March 31, 2013 was Rs. 2,097 crore (US$ 386 million) as against Rs. 1,945 crore for the corresponding previous period - a YoY increase of 8% RCF achieved a profit before tax of Rs. 342 crore (US$ 63 million) for the year, as against Rs. 254 crore for the corresponding previous period - a YoY increase of 35%, 76994=The loss for the year was Rs. 93 crore (US$ 17 million) as against Rs. 342 crore for the year ended March 31, 2012, 80243=In equity broking, as on March 31, 2013, the business had nearly 7,15,500 broking accounts, an increase of 4%, with an average daily equities turnover of Rs. 2,491 crore (US$ 458 million), an increase of 2% In commodity broking, as on March 31, 2013, the commodity broking accounts increased by 12% to nearly 39,700, with an average daily commodities turnover at Rs. 959 crore (US$ 176 million) In wealth management, the AUMs as on March 31, 2013 increased to Rs. 1,023 crore, 78253=The disbursements for the year ended March 31, 2013 were Rs. 8,745 crore (US$ 1.6 billion) as against Rs. 7,937 crore for the corresponding previous period - a YoY increase of 10%, 78590=was Rs. 16,379 crore (US$ 3.0 billion) as against Rs. 15,078 crore as on March 31, 2012 - a YoY increase of 9% The outstanding loan book as on March 31, 2013 was at Rs. 13,652 crore (US$ 2.5 billion), against Rs. 13,239 crore as on March 31, 2012 - a YoY increase of 3%. This loan book is spread across 74,000 customers from top 20 Indian metros, 82527=Shareholding Pattern as on March 31, 2013:, 81976=Reliance Money, one of the largest private sector partners for Western Union Money Transfer handled nearly 25 lakh money transfer transactions during the year, an increase of 9% The business generated revenues of Rs. 120 crore (US$ 22 million) for the year ended March 31, 2013, as against Rs. 106 crore for the corresponding previous period - a YoY increase of 13%, 78463=As on March 31, 2013, the assets under management (including securitized portfolio), 73696=Reliance Capital Asset Management (RCAM) managed Rs. 1,73,129 crore (US$ 31.8 billion) as on March 31, 2013, across mutual funds, pension funds, managed accounts and hedge funds, 78978=During the year ended March 31, 2013, RCF securitised loans of Rs. 2,172 crore (US$, 71575=Consolidated results - Year ended March 31, 2013, 73120=As on March 31, 2013, the total assets of the Company stood at Rs. 40,588 crore (US$ 7.5 billion) - an increase of 15%. The investment portfolio of listed equities as on March 31, 2013, amounted to Rs. 1,512 crore, 77967=RCF is amongst the leading lenders in the Indian non banking finance space. The focus in this business continues to be on asset backed lending and productive asset creation. As on March 31, 2013, 100% of the loan book was secured, 74977=RCAM's income from its operations was Rs. 735 crore (US$ 135 million) for the year ended March 31, 2013 - a YoY increase of 11% The profit before tax of RCAM was Rs. 290 crore (US$ 53 million) for the year ended March 31, 2013, 75307=Reliance Life Insurance (RLI) is amongst the leading private sector life insurance companies in terms of new business premium with a market share of 5% of the private sector life insurance industry The Total Premium (net of reinsurance) was Rs. 4,015 crore (US$ 738 million) for the year ended March 31, 2013 RLI achieved a profit of Rs. 380 crore (US$ 70 million) for the year ended March 31, 2013. The declared results of Reliance Capital include consolidation of 38% stake in Reliance Life Insurance The NBAP margin for the year ended March 31, 2013 was 20.2% as against 15.6% for the corresponding previous period The total funds under management as on March 31, 2013 stood at Rs. 18,189 crore, 81166=2013 - a YoY increase of 18%, 74043=AUM, with market share of nearly 12% The average assets under management (AAUM) of RMF, for the period ended March 31, 2013 stood at Rs. 94,580 crore (US$ 17.4 billion) - a YoY increase of 21% The Systematic Investment Plan (SIP) and Systematic Transfer Plan (STP) investor accounts stood at 13.1 lakh - the highest in the industry The retail Gold Savings Fund rose by 10% to over Rs. 2,926 crore (US$ 538 million) in AAUMs for the year ended March 31, 2013, capturing a healthy market share of 24% in the gold fund category RMF had a wide distribution network with over 200 branches and more than 40,000 empanelled distributors across India, as on March 31, 2013 As on March 31, 2013, there were total of 49 schemes comprising 22 equity oriented schemes, 23 debt oriented schemes, 3 exchange traded funds and 1 Fund of funds, 77398=At the end of March 31, 2013, the investment book stood at Rs. 3,252 crore (US$ 598 million) - a YoY increase of 20% RGI had a distribution network of 126 branches and nearly 10,700 intermediaries, as on March 31, 2013, 76555=RGI is amongst the leading private sector general insurance companies in India. It has a private sector market share of over 7%, in terms of gross written premium, of the Indian private sector general insurance industry The Gross Written Premium for the year ended March 31, 2013 was Rs. 2,036 crore (US$ 374 million) as against Rs. 1,748 crore for the year ended March 31, 2012 - a YoY increase of 16%}",
    "textBeforeTable": "Shareholding Pattern as on March 31, 2013: Profit before tax achieved for the year ended March 31, 2013 was Rs. 7 crore (US$ 1 million) Reliance Money, one of the largest private sector partners for Western Union Money Transfer handled nearly 25 lakh money transfer transactions during the year, an increase of 9% The business generated revenues of Rs. 120 crore (US$ 22 million) for the year ended March 31, 2013, as against Rs. 106 crore for the corresponding previous period - a YoY increase of 13% nearly 5 tons of gold in FY13, an increase of 123% with a pan India presence with over 6,200 outlets In the gold coin business, through its pan India presence, Reliance Money has sold Reliance Money is amongst the leading domestic distributors of financial products The distribution business of Reliance Capital, branded as 'Reliance Money' is a comprehensive financial services and solutions provider, providing customers with access to mutual funds, insurance products, gold coins, money transfer and currency exchange Distribution business 2013 - a YoY increase of 18% Profit before tax stood at Rs. 38 crore (US$ 7 million) for the year ended March 31, The business had revenues of Rs. 261 crore (US$ 48 million) for the year ended March 31, 2013 Page 4 of 5 (US$ 188 million) - a YoY",
    "textAfterTable": "Background Reliance Capital, a part of the Reliance Group, is one of India's leading private sector financial services companies. It ranks amongst the top private sector financial services and banking groups, in terms of net worth. The company is a constituent of CNX Nifty Junior and MSCI India. Reliance Group is amongst India's leading business houses with over 230 million customers. The Group has a strong presence across a wide array of high growth consumer-facing businesses of financial services, telecom, energy, power, infrastructure and media and entertainment. Reliance Capital has interests in asset management and mutual funds; life and general insurance; commercial and home finance; stock broking; wealth management services; distribution of financial products; exchanges; private equity; asset reconstruction; proprietary investments and other activities in financial services. Page 5 of 5 distributed by",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}