{
    "relation": [
        [
            "TEAM",
            "",
            "",
            "",
            ""
        ],
        [
            "PLAYER/COMPENSATION",
            "Francois Beauchemin, D",
            "Patrick Davis, F Mike Swift, C",
            "Al Montoya, G",
            "Michael Frolik, F Alexander Salak, G"
        ],
        [
            "TEAM",
            "",
            "",
            "",
            ""
        ],
        [
            "PLAYER/COMPENSATION",
            "Joffrey Lupul, F Jake Gardiner, D 2013 conditional pick",
            "Jay Leach, D Steve Zalewski, C",
            "2011 sixth-round pick",
            "Jack Skille, F Hugh Jessiman, F David Pacan, F"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "https://atlanticdivisionhockeyadh.wordpress.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00235-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852257975,
    "recordOffset": 852236972,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{79875=Posted by Tim Brennan  |  July 1, 2011 | Categories: Posts | Tags: 2011 free agency frenzy, Andreas Lilja, Flyers, Jakub Voracek, Philadelphia Flyers | Leave a comment, 73351=The Flyers have chosen Sean Couturier with the 8th overall pick in the 2011 NHL Draft. Couturier played last season with the Drummondville Voltiguers of the Quebec Major Junior Hockey League posting 36 goals and 60 assists for 96 points in 58 games. The 6-4, 195 lbs. center has a great skill set and uses his size to his advantage. His offensive instincts and hockey sense are strong attributes but his forte is his ability to protect the puck while in traffic or under pressure. Scouts project that he will be a second line center who will average 60-70 points per season. It looks like Paul Holmgren found a replacement for Jeff Carter. To see what Couturier can do and will bring to the Flyers in the future, check out this video:, 77479=Posted by Tim Brennan  |  July 1, 2011 | Categories: Posts | Tags: Flyers, Jagr, Jaromir Jagr, Philadelphia Flyers | Leave a comment, 62467=Posted by Tim Brennan  |  June 24, 2011 | Categories: Posts | Tags: big NHL trades, Brayden Schenn, Columbus Blue Jackets, Flyers, Ilya Bryzgalov, Jakub Voracek, Jeff Carter, Los Angeles Kings, Mike Richards, Paul Holmgren, Philadelphia Flyers, Wayne Simmonds | Leave a comment, 75232=Posted by Tim Brennan  |  July 1, 2011 | Categories: Posts | Tags: Andy Greene, Bob McKenzie, Devils, New Jersey, New Jersey Devils | Leave a comment, 68368=Although Holmgren was determined to land Bryzgalov, it comes as a shock that he traded both Carter and Richards. Ever since these two were selected in the first round of the 2003 draft (11th and 24th overall respectively), the Flyers brass have made it clear that these two were going to be their future stars and would become the face of the franchise. The team solidified their position by signing both to long-term deals; Richards to a 12 year deal in 2007 and Carter re-upped for 11 years in 2010., 72195=Posted by Tim Brennan  |  June 25, 2011 | Categories: Posts | Tags: 2011 NHL Draft, 8th overall, center, Couturier highlights, Drummondville, Flyers, Philadelphia Flyers, QMJHL, Sean Couturier | Leave a comment, 82065=Posted by Tim Brennan  |  July 1, 2011 | Categories: Posts | Tags: Flyers, Max Talbot, Maxime Talbot, Philadelphia Flyers, Pittsburgh Penguins | Leave a comment, 39713=Posted by Eric Bancker  |  February 28, 2011 | Categories: Posts | Tags: 2010 fifth-round pick, 2011 first-round pick, 2011 second-round pick, 2011 seventh-round pick, 2011 third-round pick, 2012 second-round pick, 2012 third-round pick, 2013 third-round pick, Aaron Voros, Alexander Sulzer, Anaheim Ducks, Atlanta Thrashers, Boston Bruins, Brad Boyes, Brad Winchester, Brett Festerling, Brian McGrattan, Bryan Allen, Bryan McCabe, Buffalo Sabres, Calgary Flames, Carolina Hurricanes, Chicago Blackhawks, Chris Campoli, Chris Higgins, Colorado Avalanche, Colten Teubert, Columbus Blue Jackets, Conditional draft pick, Dallas Stars, Dane Byers, David Laliberte, David Steckel, Dennis Wideman, Detroit Red Wings, Drew MacIntyre, Dustin Penner, Edmonton Oilers, Evan Oberg, Florida Panthers, Fredrik Modin, Jake Hauswirth, Jason Arnott, Joe Colborne, Joel Perreault, John Mitchell, Kris Versteeg, Los Angeles Kings, MacGregor Sharp, Maxim Lapierre, Minnesota Wild, Montreal Canadiens, Nashville Predators, New Jersey Devils, New York Islanders, New York Rangers, NHL, nhl trade deadline, NHL Trade Rumors, Niclas Bergfors, Ottawa Senators, Patrick Rissmiller, Philadelphia Flyers, Phoenix Coyotes, Pittsburgh Penguins, Radek Dvorak, Rostislav Klesla, Ryan Potulny, Sami Lepisto, San Jose Sharks, Scottie Upshall, Sean Zimmerman, Sergei Samsonov, Seventh-round pick, St. Louis Blues, Stefan Chaput, Tampa Bay Lightning, Third-round pick, Tim Kennedy, Toronto Maple Leafs, Vancouver Canucks, Washington Capitals | 3 Comments, 65537=It came as a surprise that the team traded their team captain and playmaker Mike Richards, but people within the organization might have known this was coming. There were the stories about problems within the locker room between Richards and defenseman Chris Pronger, prior to the firing of head coach John Stevens. There was also the clashing between Richards and the media after they suggested that his partying lifestyle was affecting his performance as well as the team’s performance, which led to his refusal to talk with the media. His captaincy has been called into question numerous times and there were rumors that coach Peter Laviolette and Richards didn’t see eye to eye on how the team should be run. Due to his strong bond with Holmgren, the decision to trade him more than likely came from the top. It wouldn’t surprise me because Ed Snider has always been a critical part to major decisions the organization makes, such as the Lindros debacle in 2000-01., 67841=The two were an important part of the Flyers AHL affiliate, the Phantoms, Calder Cup championship team in 2004 and joined the big club after the lockout. Richards drew comparisons to Flyers legend Bobby Clarke because of his ability to combine skill with a physical edge while Carter was deemed to be one of the team’s purest goal scorers in a long time. Both of them impacted the team immediately and proved the scouts right as Richards accumulated 133 goals and 216 points for 349 points in 453 games as a Flyer, including 23 shorthanded goals and made history by scoring 3 3-on-5 shorthanded goals for his career. Meanwhile Carter posted 181 goals and 343 points in 461 games, including two 30 goal seasons and a 40 goal season while becoming a league leader in shots year after year., 28888=Posted by Eric Bancker  |  February 28, 2011 | Categories: Posts | Leave a comment, 27756=The Florida Panthers trade defenseman Bryan Allen to the Carolina Hurricanes for Sergei Samsonov., 69604=During the early stages of the day, the Flyers traded forward Jeff Carter to the Columbus Blue Jackets in exchange for right wing Jakub Voracek, a 1st round pick (8th overall) in this year’s draft and a 3rd round pick (68th overall). This move was seen as a major salary dump to enable the Flyers to sign goaltender Ilya Bryzgalov, whose rights they acquired June 7th. General Manager Paul Holmgren went ahead with a deal, signing the 31-year-old Russian netminder to a 9 year, $51 million contract that will put an annual cap hit of $5.67 million per season. Holmgren wasn’t finished however as he pulled the trigger on a trade that would send captain and franchise cornerstone Mike Richards to the Los Angeles Kings for hockey’s best prospect center Brayden Schenn, rugged winger Wayne Simmonds and a 2nd round pick in next year’s draft. When the dust settled, the Flyers had traded two centers earning close to $11 million combined and added a top rate goaltender., 27643=Secondly, the Chicago Blackhawks have acquired defenseman Chris Campoli and a conditional seventh round pick in 2011 from the Ottawa Senators for forward Ryan Potulny and conditional second round pick in 2011., 9698=Posted by Eric Bancker  |  February 28, 2011 | Categories: Posts | Tags: Anaheim Ducks, Atlanta Thrashers, Boston Bruins, Bryan McCabe, Buffalo Sabres, Calgary Flames, Carolina Hurricanes, Chicago Blackhawks, Colorado Avalanche, Columbus Blue Jackets, Dallas Stars, Detroit Red Wings, Edmonton Oilers, Florida Panthers, Los Angeles Kings, Minnesota Wild, Montreal Canadiens, Nashville Predators, New Jersey Devils, New York Islanders, New York Rangers, NHL, nhl trade deadline, NHL Trade Rumors, Ottawa Senators, Philadelphia Flyers, Phoenix Coyotes, Pittsburgh Penguins, San Jose Sharks, St. Louis Blues, Tampa Bay Lightning, Toronto Maple Leafs, Vancouver Canucks, Washington Capitals | Leave a comment, 29210=The Oilers get a great return for Penner. They free up over $4 million on the cap, Teubert was the Kings 13th overall choice in 2008, they also receive a 1st round pick this year and a conditional pick in 2012 which will be either a second or third round pick., 27178=Posted by Eric Bancker  |  February 28, 2011 | Categories: Posts | Tags: Chicago Blackhawks, Chris Campoli, Ottawa Senators, Ryan Potulny | Leave a comment, 69741=June 23rd, 2011. This will go down as a historical day in the eyes of people who live and breath Flyers hockey.}",
    "textBeforeTable": "FEB. 28 A final look at the trades from this month: Final Trade Chart Posted by Tim Brennan  |  June 24, 2011 | Categories: Posts | Tags: big NHL trades, Brayden Schenn, Columbus Blue Jackets, Flyers, Ilya Bryzgalov, Jakub Voracek, Jeff Carter, Los Angeles Kings, Mike Richards, Paul Holmgren, Philadelphia Flyers, Wayne Simmonds | Leave a comment Only time will tell whether the moves made on this day will help push the Flyers over the edge to a Stanley Cup championship or just keep them wondering where have we gone wrong. The Flyers in the meantime",
    "textAfterTable": "Chris Campoli, D Ryan Potulny, F Conditional draft pick Scottie Upshall, F Sami Lepisto, D Rostislav Klesla, D Dane Byers, F Dennis Wideman, D Jake Hauswirth, F 2011 third-round pick Radek Dvorak, F 2011 fifth-round pick Niclas Bergfors, F Patrick Rissmiller, F John Mitchell, F 2011 seventh-round pick Fredrik Modin, F Seventh-round pick Chris Higgins, F Evan Oberg, D 2013 third-round pick Maxim Lapierre, F MacGregor Sharp, F Joel Perreault 2012 third-round pick Drew MacIntyre, G Brett Festerling, D FEB. 27 TEAM PLAYER/COMPENSATION TEAM PLAYER/COMPENSATION Brad Boyes, F 2011 second-round pick Brian McGrattan, F; Sean Zimmerman, D Stefan Chaput, F; David Laliberte, F FEB. 26 TEAM PLAYER/COMPENSATION TEAM PLAYER/COMPENSATION",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}