{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus police!",
            "Tons of great food choices!",
            "Spacious and great for meeting new people",
            "Study hard but realize your priorities!",
            "Smile, take a breath, work hard but have fun!",
            "Its a beautiful and green campus that is full of life. It has a variety of people and plants all shapes and sizes. Along with its gracious view, it's located in the heart of Greensboro and has history facts at every corner!"
        ]
    ],
    "pageTitle": "The University of North Carolina at Greensboro (UNCG) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-North-Carolina-at-Greensboro/reviews?_escaped_fragment_=/show/30724",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907803983,
    "recordOffset": 907668144,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{659600=Make sure to accept your acceptance confirmation as soon as you get it back to be qualified for merit scholarships in January. Complete housing and UNCG Guarantee by beginning of May. Check out the campus and go to every event to make sure it is the right place., 30873=Compared to the tuition at Pfeiffer, UNCG costs less and they have a lot of scholarships that students can apply for. But all students considering UNCG and its scholarships should complete their FAFSA as early as possible; I suggest by March 1st. For many of their scholarships, completing your FAFSA application and an admission application is all you need to apply., 245501=During this economic distress the whole country is experiencing, it is unfortunately effecting our educational institutions. The tuition has increased more than $2,000 for the 2012-2013 year. I recommend students to apply for grants , scholarships and financial aid. Keep your GPA high so that you can qualify for more financial rewards., 526926=People for the most part are nice and will lend you anything you may need. RAs are very understanding and try not meddle within personal affairs unless it is detrimental to your life You can talk to them about anything! Please be nice to the housekeeping staff! They are so sweet and funny and do their job right everyday from August to May, 508498=Tuition at UNCG is extrememly low for how high their academic rigor is. The expenisve part is on campus living, room and board can range anywhere from $5000-12000 a year., 743043=© 2015, Cappex.com, LLC, 376311=Old dorms were just renovated and completed for living in the Fall 2012 semester. An additional suite building was recently built, in the last 2 years. We're also expanding across a main street, adding new dorm buildings, college shops, and academic buildings., 677956=I have applied and been accepted for the fall of 2014. Although there are MANY steps to follow, from applying for housing sending in transcripts and even selecting a meal plan. Throughout the way i have been able to have assistance which makes the whole process a little less stressful., 407273=Security is everywhere on UNCG's campus so you always feel safe, even walking at 12 o'clock in the morning. You cannot enter dorms without a sensor that is given to you when you move in and that sensor is specific to your dorm only so you cannot use yours on another dorm.}",
    "textBeforeTable": "06/12/2009 Reviewer is A current student here. 44 out of 47 people found this review useful. 1 of 165 Javier from High Point, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. The University of North Carolina at Greensboro Reviews The University of North Carolina at Greensboro › North Carolina › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Categories Comments Great for these types of students UNCG is great for students who are looking to learn a lot and exert themselves in order to receive a great education. There is everything one could hope for in a college and more. UNCG is a very laid-back yet extremely prestigious university and most who come fall in love with it and couldn't dream of going elsewhere. Tips for prospective students Be prepared to deal with a parking nightmare, one of the first things you will learn should you attend, is that the parking situation here is the only bad thing about UNCG. Bang for the buck A great University education, plus many more opportunities that aren't offered anywhere else in the state, such as the study abroad program and International Student exchange. UNCG has more to offer at a lower cost than any other university in the state. Am enjoying being here Social life and college life around UNCG is great there are many things going on all the time. In between the nationally ranked soccer team and the new UNCG home court located at the Greensboro Coliseum, athletic events are always a site to see. There are many local restaurants and hangouts in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}