{
    "relation": [
        [
            "acheter, to buy",
            "apporter, to bring",
            "apprendre, to learn",
            "demander, to ask",
            "donner, to give",
            "écrire, to write",
            "emprunter, to borrow",
            "envoyer, to send"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "expliquer, to explain",
            "montrer, to show",
            "offrir, to offer (give)",
            "prêter, to lend",
            "promettre, to promise",
            "rendre, to give back",
            "servir, to serve",
            "vendre, to sell"
        ]
    ],
    "pageTitle": "vti1: transitive vs. intransitive",
    "title": "",
    "url": "http://laits.utexas.edu/tex/gr/vti1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 139627915,
    "recordOffset": 139613240,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 01 May 2014 16:17:13 GMT",
    "textBeforeTable": "indirect object pronouns Here are examples of such verbs. These are discussed more fully with indirect objects and . Joe-Bob telephones Tex.   Joe-Bob téléphone à Tex. preposition + object in French / direct object in English There are also several verbs which have a preposition and object in French, whereas the English equivalent takes a direct object. Tex, I hope that you will pay for the ticket.   Tex, j'espère que tu vas payer la contravention! No luck! I'm at the police station and I'm waiting for my lawyer.  ",
    "textAfterTable": "  En voiture, Joe-Bob chante toujours Freebird. (Joe-Bob always sings Freebird in the car.) Il parle fort. (He talks loudly.)   Il parle anglais. (He speaks English.) Il rêve. (He dreams.)   Il rêve de hamburgers et de filles. (He dreams of hamburgers and girls.) Il grignotte tout le temps. (He snacks all the time.)   Il grignotte des cacahouettes. (He snacks on peanuts.) intransitive verbs Perhaps you have already seen verbs which use être to form the passé composé. These être verbs (aller, arriver, partir, sortir, etc.) are the most frequent intransitive verbs and they are summarized in the Alamo d'être. Etre verbs are often described as verbs of motion, but it's important to note that there are many other intransitive verbs of motion which use the auxiliary avoir, for example, 'marcher' (to walk) and 'courir' (to run): 'Tex a marché vite. Les enfants de Rita ont couru.' transitive or intransitive Some verbs may be either transitive or intransitive. Contrast the following verbs. Note that the verb",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}