{
    "relation": [
        [
            "",
            "Placebo",
            "Sildenafil"
        ],
        [
            "Description",
            "placebo 20 mg three tid for 12 weeks followed by 60 mg tid for 12 weeks",
            "sildenafil 20 mg three tid for 12 weeks followed by 60 mg tid for 12 weeks"
        ]
    ],
    "pageTitle": "Evaluating the Effectiveness of Sildenafil at Improving Health Outcomes and Exercise Ability in People With Diastolic Heart Failure (The RELAX Study) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00763867?sect=Xl015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861534327,
    "recordOffset": 861516903,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Placebo Drug: Sildenafil Interventions: Heart Failure Condition: Allocation: Randomized;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Caregiver, Investigator);   Primary Purpose: Treatment Study Design: Interventional Study Type: Results First Received: April 4, 2013  ",
    "textAfterTable": "Participant Flow:   Overall Study     Placebo     Sildenafil   STARTED     103     113   COMPLETED     98     101   NOT COMPLETED     5     12     Baseline Characteristics   Hide Baseline Characteristics Population Description Explanation of how the number of participants for analysis was determined. Includes whether analysis was per protocol, intention to treat, or another method. Also provides relevant details such as imputation technique, as appropriate. No text entered. Reporting Groups",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}