{
    "relation": [
        [
            "Column",
            "AGGREGATE_TARGET_NAME",
            "AGGREGATE_TARGET_TYPE",
            "AGGREGATE_TARGET_GUID",
            "MEMBER_TARGET_NAME",
            "MEMBER_TARGET_TYPE",
            "MEMBER_TARGET_GUID"
        ],
        [
            "Datatype",
            "VARCHAR2(256)",
            "VARCHAR2(64)",
            "RAW(16)",
            "VARCHAR2(256)",
            "VARCHAR2(64)",
            "RAW(16)"
        ],
        [
            "Description",
            "Target name of the aggregate target.",
            "Target type of the aggregate target.",
            "Target GUID of the aggregate target.",
            "Target Name of the member target.",
            "Target type of the member target.",
            "Target GUID of the member target."
        ]
    ],
    "pageTitle": "Management Repository Views",
    "title": "",
    "url": "http://docs.oracle.com/cd/B16240_01/doc/em.102/b40007/views.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76685647,
    "recordOffset": 76603798,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{363813=The name of the composite target. A composite target is a grouping of one or more target name and target types from the target table. May be null if the Web Cache target is not a member of any composite targets., 364323=The type of the composite target. The type defines the set of metrics that are applicable for the target. May be null if the Web Cache target is not a member of any composite target., 371411=The type of the composite target. The type defines the set of metrics that are applicable for the target. May be null if the Web Cache target is not a member of any composite targets., 342843=Identifies the start of the rollup period. For the one-hour rollups, samples that fall within the hourly boundaries from minute 00 through minute 59 inclusive will be combined. For example, samples from 12:00 AM through 12:59 AM would be combined into a single aggregated record with a rollup timestamp of \"date\" 12:00 AM., 128400=The rollup timestamp identifies the start of the rollup period. For the one-hour rollups, samples that fall within the hourly boundaries from minute 00 through minute 59 inclusive will be combined. For example, samples from 12:00 AM through 12:59 AM would be combined into a single aggregated record with a rollup timestamp of \"date\" 12:00 AM.}",
    "lastModified": "Thu, 15 Mar 2012 06:35:11 GMT",
    "textBeforeTable": "Table 9-22 MGMT$TARGET_MEMBERS MGMT$TARGET_MEMBERS displays the list of direct members for a target. MGMT$TARGET_MEMBERS Queries using this view will use an index if either (source_target_name, source_target_type) or (assoc_target_name, assoc_target_type) is specified. Can be used to list the associations defined for a specific target. Usage Notes The type of association. VARCHAR2(64) ASSOCIATION_TYPE The target type for which the association is valid. This applies to non-global associations only. VARCHAR2(64) SCOPE_TARGET_TYPE The target under whose scope the association is valid. This applies to non-global associations only. For example: A database may be part of a composite target only for a particular service. VARCHAR2(256) SCOPE_TARGET_NAME The target type of the associated target. “ANY” can be used to specify that any target type be used. VARCHAR2(64) ASSOC_TARGET_TYPE Target Name of the target which is being associated with the source target.",
    "textAfterTable": "Usage Notes Find the members for a aggregate target. Find the aggregate targets for which a given target is a direct member. Queries, which specify values for (AGGREGATE_TARGET_NAME, AGGREGATE_TARGET_TYPE) or (MEMBER_TARGET_NAME, MEMBER_TARGET_TYPE) will use index. Joins using AGGREGATE_TARGET_GUID and MEMBER_TARGET_GUID will be efficient. MGMT$TARGET_FLAT_MEMBERS MGMT$TARGET_FLAT_MEMBERS displays the list of all direct and indirect members of the target. Table 9-23 MGMT$TARGET_FLAT_MEMBERS Column Datatype Description AGGREGATE_TARGET_NAME VARCHAR2(256) The target name of the aggregate target AGGREGATE_TARGET_TYPE VARCHAR2(64) The target type of the aggregate target AGGREGATE_TARGET_GUID RAW(16) Target GUID of the aggregate target MEMBER_TARGET_NAME VARCHAR2(256) Target Name",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}