{
    "relation": [
        [
            "Patent application number",
            "20130152021",
            "20130179208",
            "20140123038"
        ],
        [
            "Description",
            "STAGE AND STAGE VIEW WITHIN A WORKFLOW - A method for providing workflow stages and integrated workflow stage visualization includes displaying a detailed view of a workflow, including a plurality of customizable stages, in the workflow user interface, wherein at least a first workflow stage of the plurality workflow stages is configured to contain a plurality of customizable workflow components, displaying the plurality of workflow components in the detailed view, receiving a selection of a stage view within the workflow user interface; displaying the stage view of the workflow, wherein the stage view includes the plurality of customizable stages but excludes the workflow components; and sending the workflow to the shared application platform.",
            "WORKFLOW TASKS - A system for providing workflow task customization comprises a workflow design tool communicating with a shared application platform. The workflow design tool is configured to receive a task customization selection, receive an initial task property selection, and upon receiving the initial task property selection, display a task customization user interface within the workflow design tool, the task customization user interface configured to receive one or more task property selections and receive a selection of a workflow item association from one or more workflow items stored by the shared application platform. The workflow design tool is further configured to generate a task including the one or more task property selections and associate the selected workflow item to the task.",
            "METHOD AND SYSTEM FOR SHARING CONTENTS - A method and system for sharing contents includes: forming a communication channel for transmitting a content item when a first and second terminals partially overlaps with each other; and providing a content item of the first terminal to the second terminal, or a content item of the second terminal to the first terminal through the communication channel in response to an input event in a state that the first terminal partially overlaps with the second terminal."
        ],
        [
            "Published",
            "06-13-2013",
            "07-11-2013",
            "05-01-2014"
        ]
    ],
    "pageTitle": "Hana - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hana-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439998811,
    "recordOffset": 439978090,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hana Lee, Seoul KR 11-13-2014 METHOD OF DETERMINATION OF CANCER CELL DRUG SENSITIVITY TOWARDS AURORA KINASE INHIBITORS - A method for determining the sensitivity and/or resistance of a patient suffering from a cancer disease to Aurora kinase inhibitor therapy, which comprises determining in vitro in the cancer cells or body fluids taken from the patient the expression of at least one gene selected from a particular group and/or determining in vitro in the cancer cells or body fluids taken from the patient the level of at least one protein selected from a particular group. 20140336073 11-08-2012 Ovarian Markers of Oocyte Competency and Uses Thereof - The present invention relates to the competence of oocytes to fertilization, uterine implantation and development into a living being. The invention describes ovarian markers whose expression is predicative of oocyte competency that are detected and/or measured in follicular fluid, cumulus cells and/or follicular cells of a mammal. Also described are methods for evaluating competence of mammalian oocytes, methods for selecting a mammalian oocyte for assisted reproduction (AR), and screening methods for identifying stimulatory or inhibitory compounds to mammalian oocyte competence. 20120283125 Published Description Patent application number Hana Kovarova, Pardubice CZ 06-21-2012 METHODS AND MATERIALS FOR TREATING BURN INJURIES - This document provides methods and materials involved in treating burn injuries. For example, methods and materials for using skin grafts (e.g., autologous skin grafts) treated with an autologous",
    "textAfterTable": "Hana Lukinsky, Portland, OR US Patent application number Description Published 20080305557 Novel Applications of Acridinium Compounds and Derivatives in Homogeneous Assays - Chemiluminescent acridinium compounds are used in homogeneous assays to determine the concentration of an analyte in a sample without strong acid or strong base treatment. The chemiluminescent acridinium compounds include acridinium esters with electron donating functional groups at the C2 and/or C7 position on the acridinium nucleus to inhibit pseudo-base formation, or acridinium sulfonamides with or without electron donating functional groups at the C2 and/or C7 position on the acridinium nucleus. 12-11-2008 20090029349 Novel Applications of Acridinium Compounds and Derivatives in Homogeneous Assays - Chemiluminescent acridinium compounds are used in homogeneous assays to determine the concentration of an analyte in a sample without strong acid or strong base treatment. The chemiluminescent acridinium compounds include acridinium esters with electron donating functional groups at the C2 and/or C7 position on the acridinium nucleus to inhibit pseudo-base formation, or acridinium sulfonamides with or without electron donating functional groups at the C2 and/or C7 position on the acridinium nucleus. 01-29-2009 Hana Park, Changwon-Si KR Patent application number Description Published 20140137583 APPARATUS FOR CONTROLLING AN AIR CONDITIONER - An apparatus for controlling an air conditioner is provided. The apparatus may include a control apparatus connected to one of a plurality of component devices to monitor and control the plurality of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}