{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex, Discover"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Control 16 X 10 Lights Appliances With A X10 Palm PAD Remote Control HR12A | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Control-16-X-10-Lights-Appliances-with-a-X10-Palm-Pad-Remote-Control-HR12A/111238129876?hash=item19e64f28d4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416564055,
    "recordOffset": 416514993,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{79700=We are here to help you with everything from product selection and ordering to installation and tech support. Just give us a call at 800-CONTROLS (800-266-8765). We are available 7:00 a.m. - 5:00 p.m. Pacific Time, Monday - Friday.}",
    "textBeforeTable": "Payment details Merchandise returned within 30 days of purchase with the appropriate Return Authorization (RA) number will receive a full product cost refund or credit, provided it is in perfect un-used condition in original undamaged and unmarked packaging, and is complete with all instructions and warranty card. To return a product, simply call our Customer Service Department at 800-266-8765 (Toll free in the U.S.) to obtain the required RA (Return Authorization) number. This number must appear on the outside of the shipment you make to us or it will not be accepted at our receiving dock. We recommend you insure your package, as we cannot be responsible for refund or replacement should your package get lost in shipment. Return policy details The buyer is responsible for return shipping costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within",
    "textAfterTable": "Seller's payment instructions See item description for checkout instructions. time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids Approximately: Current bid amount Approximately: + Shipping amount Approximately:",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}