{
    "relation": [
        [
            "Postage and handling",
            "Free postage",
            "US $4.00",
            "US $28.00"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Postage (USPS First Class Package®)",
            "Express Postage (USPS Priority Mail®)",
            "Express Postage (USPS Priority Mail Express®)"
        ],
        [
            "Delivery*",
            "On or before Wed. 05 Aug. to 07095 per eBay FAST 'N FREE",
            "Estimated between Sat. 1 Aug. and Wed. 5 Aug.",
            "Estimated between Sat. 1 Aug. and Mon. 3 Aug."
        ]
    ],
    "pageTitle": "Neil Diamond Signed Autograph \"Neil Diamond'S Greatest Hits\" Album LP Record | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/NEIL-DIAMOND-Signed-Autograph-Neil-Diamonds-Greatest-Hits-Album-LP-Record-/121357704471?pt=LH_DefaultDomain_0&hash=item1c417b9d17",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428475511,
    "recordOffset": 428423697,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Botswana British Virgin Islands Bulgaria Burkina Faso Burundi Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica Cote d Ivoire (Ivory Coast) Cyprus Czech Republic",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money back or item exchange (buyer's choice) The buyer is responsible for return postage costs. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}