{
    "relation": [
        [
            "Dates",
            "1985–86",
            "1986",
            "1986–87",
            "1987–88",
            "1988",
            "1988–90",
            "1990–91",
            "1991–94",
            "1994–95",
            "1995–97",
            "July 1, 1997–June 30, 1998",
            "July 1, 1998–June 30, 2002",
            "July 1, 2002–Jan 26, 2004",
            "Jan 29, 2004–March 04",
            "March 2004–June 04",
            "July 1, 2004–April 9, 2007",
            "April 11, 2007–Oct 8, 2007",
            "Oct 8, 2007–March 11, 2008",
            "March 12, 2008–May 12, 2008",
            "May 12, 2008–June 30, 2008",
            "July 1, 2008–March 09",
            "March 3, 2009–June 30, 2010",
            "July 1, 2010–Feb 18, 2013",
            "Feb 18, 2013–June 8, 2013",
            "June 9, 2013–May 19, 2014",
            "June 2, 2014–"
        ],
        [
            "Name",
            "José Luis García Traid",
            "Pepe Villar",
            "Colin Addison",
            "José María Maguregui",
            "Pepe Villar",
            "José Manuel Díaz Novoa",
            "José María Maguregui",
            "Txetxu Rojo",
            "Carlos Aimar",
            "Fernando Castro Santos",
            "Javier Irureta",
            "Víctor Fernández",
            "Miguel Ángel Lotina",
            "Radomir Antić",
            "Ramón Carnero",
            "Fernando Vázquez",
            "Hristo Stoichkov",
            "Juan Ramón López Caro",
            "Antonio López",
            "Alejandro Menéndez",
            "Pepe Murcia",
            "Eusebio Sacristán",
            "Paco Herrera",
            "Abel Resino",
            "Luis Enrique",
            "Eduardo Berizzo"
        ]
    ],
    "pageTitle": "Celta de Vigo - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Celta_de_Vigo",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878820351,
    "recordOffset": 878769608,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28038=On 12 July 1923, at the AGMs of Vigo and Fortuna held at the Odeon Theatre and in the Hotel Moderno, respectively, the merger was approved. Thus the \"Team of Galicia\" was born, as it was dubbed. In the last AGM of Fortuna and Vigo to approve the formation of a new club held on 10 August 1923, the members decided upon the team's name. Various names were suggested:, 34608=In the 2006–07 season, Celta finished in 18th position and were relegated to the Segunda División. At the end of June 2007, Celta avoided going into administration. However, if an agreement was not put in place between the club and its creditors within three months, then courts would declare the liquidation of the club's assets., 36626=On 3 June 2012 Celta Vigo returned to La Liga after 5 years in Segunda División.[2] In their first season back in La Liga, Celta Vigo avoided relegation to the Segunda División on the final day, beating Espanyol 1–0 to ensure 17th place. On 8 June 2013 Celta Vigo announced they had signed former Roma and Barcelona B manager Luis Enrique to lead the club for the 2013–14 season. Under Enrique Celta flourished achieving a 9th place finish., 26693=R.C. Celta de Vigo was formed as a result of the ambition of Vigo's teams to achieve more at national level, where the Basque sides had been their bête noire in the Spanish Championship. The idea was to merge both teams to create a more powerful team at national level. The standard-bearer of this movement was Manuel de Castro \"Handicap\", a sports writer for the Faro de Vigo who, from 1915, started to write in his articles about the need for a unitarian movement. The slogan of his movement was \"Todo por y para Vigo\" (All for and to Vigo), which eventually found support among the managers of Real Vigo Sporting and Real Club Fortuna de Vigo. It was backed unanimously when De Castro himself presented the motion at the assembly of the Royal Spanish Football Federation in Madrid, on 22 June 1923., 18969=Real Club Celta de Vigo (Galician pronunciation: [reˈal ˈkluβ ˈθelta ðe ˈβiɣo]), or simply Celta Vigo, is a Spanish professional football club based in Vigo, Galicia, currently playing in the Primera División. It was founded on 23 August 1923 following the merger of Real Vigo Sporting and Real Fortuna Foot-ball Club. Nicknamed Os Celestes (The Sky Blues), they play in sky blue shirts and white shorts. The club's home stadium is Balaídos, which seats 31,800 spectators.[1], 44677=Like many other Galician clubs, such as Compostela and Racing Ferrol, the club badge is based on the red cross of Saint James. On top of the cross sits a sky blue shield with two letter Cs (Club Celta). In 1923, Celta became one of several Spanish football clubs that were granted patronage by the Spanish crown and thus entitled to use Real (Royal) in their names and the royal crown on their badge. This right was granted to Celta by Alfonso XIII and the club subsequently became known as Real Club Celta de Vigo. During the Spanish Second Republic (1931—1936) the title Real was removed from the club's name and the royal crown was taken off the club crest, however it was to return under the Spanish State., 254873=Celta de Vigo B is Celta's youth team. It was founded in 1996 and plays in the Segunda División B., 30137=The late 1990s (1997—2003) saw the best results in Celta's history, in which they managed to consolidate themselves as a top-six league side, culminating in 2001–02, when they did not fall below sixth the whole season. They were dubbed EuroCelta by the Spanish press. In February 2001 the IFFHS declared Celta the best team of the world during that period, as a consequence of the fantastic results. The most important players during that period were Alexander Mostovoi, Valery Karpin and Haim Revivo. The squad counted also with other international players such as the goalkeeper Pablo Cavallero, the midfielders Claude Makélélé and Mazinho, the winger Gustavo López or the strikers Catanha, Luboslav Penev and Benny McCarthy, among others.}",
    "lastModified": "Thu, 30 Jul 2015 11:27:25 GMT",
    "textBeforeTable": "Seasons[edit] Like many other Galician clubs, such as Compostela and Racing Ferrol, the club badge is based on the red cross of Saint James. On top of the cross sits a sky blue shield with two letter Cs (Club Celta). In 1923, Celta became one of several Spanish football clubs that were granted patronage by the Spanish crown and thus entitled to use Real (Royal) in their names and the royal crown on their badge. This right was granted to Celta by Alfonso XIII and the club subsequently became known as Real Club Celta de Vigo. During the Spanish Second Republic (1931—1936) the title Real was removed from the club's name and the royal crown was taken off the club crest, however it was to return under the Spanish State. Crest[edit] Adidas 2013– Li-Ning 2010–13 Peugeot Citroën Automóviles España, S.A. Citroën Umbro 1986–10 Adidas 1982–86 None Meyba 1980–82 Brand Sponsor Kit manufacturer Years Celta Vigo have the longest-running sponsorship",
    "textAfterTable": "Division Place Copa del Rey 1943–44 1ª 14th Round of 16 1944–45 2ª 3rd First Round 1945–46 1ª 10th Round of 16 1946–47 1ª 9th Quarter-finals 1947–48 1ª 4th Final 1948–49 1ª 11th Round of 16 1949–50 1ª 7th Round of 16 1950–51 1ª 8th First Round 1951–52 1ª 9th First Round 1952–53 1ª 13th DNP",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}