{
    "relation": [
        [
            "",
            "Unfamiliar",
            "Very favorable",
            "Somewhat favorable",
            "Somewhat unfavorable",
            "Very unfavorable",
            "Don't know"
        ],
        [
            "General Public",
            "25%",
            "11%",
            "35%",
            "11%",
            "4%",
            "13%"
        ],
        [
            "Elites",
            "16%",
            "17%",
            "48%",
            "12%",
            "1%",
            "7%"
        ],
        [
            "American Jews",
            "8%",
            "14%",
            "44%",
            "14%",
            "8%",
            "12%"
        ],
        [
            "Influential Americans",
            "0%",
            "0%",
            "0%",
            "0%",
            "0%",
            "0%"
        ]
    ],
    "pageTitle": "American Attitudes Toward the Middle East | Jewish Virtual Library",
    "title": "",
    "url": "http://www.jewishvirtuallibrary.org/jsource/US-Israel/pomegen.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00199-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 527827463,
    "recordOffset": 527785100,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{230517=Which side is responsible for the current violence in the Middle East: the Israelis or the Palestinians? (Source: ADL, December 2003), 107539=2000 Nov 13-15, 85339=2012 Feb 2-5, 305303=From what you know about Islam and its religious teachings, do you think the suicide bombings and other violence by some followers of Islam...(Newsweek, December 6-7, 2001), 74783=2003 Feb 3-6, 293162=Please tell me if you think each of the following ha a major influence, a minor influence, or no influence on U.S. policy toward Israel today. (First,) what about... (Newsweek, March 21-22, 2002), 279960=Some have argued that the U.S. should take military action in Iraq against Saddam Hussein -- even if the U.S. has to act alone and even if it takes the lives of thousands of U.S. troops. Others say that the U.S. should not attack Iraq on its own, because an independent U.S. invasion would provoke intense anti-American reaction throughout the Arab world and in much of Europe. They argue that any attack on Iraq must not take place without the support of key European and Arab allies. Still others say we should take no action. Which of these three opinions is closest to your own view? (ADL, April 26-May 6, 2002), 32279=2003 Feb, 237923=U.S. is more likely to be targeted for terrorist attacks because of our support for Israel. (Source: ADL, December 2003), 391206=The United States has a special relationship with Israel because the two countries share many common values, including a commitment to freedom and democracy. Do you strongly agree with this statement, somewhat agree, somewhat disagree or strongly disagree with this statement? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 302024=If Islamic extremists DO win power to run the government in their countries, how likely do you think it is that? (Newsweek, December 6-7, 2001), 153027=Is solving the Israeli-Palestinian conflict important to solving the challenges in Iraq? (POS, January 2007), 315196=Is your overall opinion of ___ very favorable, mostly favorable, mostly unfavorable, or very unfavorable? (Gallup, Feb. 2001), 218590=Now I would like to refer to a few values that people often use to characterize the American people. Please select the one you most appreciate and would be pleased to characterize the people of Israel? (Hudson Institute, June 24, 2004), 407117=What is your main source of information about the situation in Israel? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 231555=In your opinion, how serious is Israel about wanting to reach a peace agreement with the Palestinians -- is it very serious, somewhat serious, not very serious, or not at all serious. (Source: ADL, December 2003), 413479=How important do you think what happens in each of the following areas of the world is to the United States today -- would you say it is vitally important, important but not vital, not too important, or not at all important? How about what happens in the Middle East? (Gallup, May 21, 2000), 210693=Do you agree or disagree with the following statement: It is critical that the next President of the United States support Israel, our democratic ally in the Middle East. (The Israel Project, July 17-19, 2004), 373301=JORDAN Are you familiar with this country?  IF YES: Are you very favorable toward this country, somewhat favorable, somewhat unfavorable, or very unfavorable toward it? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 76759=1996 Mar 8-10, 378299=EGYPT Are you familiar with this country?  IF YES: Are you very favorable toward this country, somewhat favorable, somewhat unfavorable, or very unfavorable toward it? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 309922=Thinking about the Mideast situation these days, do you think the US (United States) should take Israel's side more, less, or about as much as it has in the past? (Pew Research Center, Council on Foreign Relations, Oct. 15-21, 2001), 383302=Have you ever been to Israel? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 273297=Do you have a favorable or unfavorable impression of: (Source: ADL, December 2003), 132181=Do you associate Israeli political leaders or Palestinian political leaders more with each phrase:               (The Israel Project National Survey, January 10-12, 2009), 204748=Now, as you may know, in protest of Israeli Government policy with respect to the Israeli-Palestinian conflict, the General Assembly of the Presbyterian Church here in the United States recently voted by an overwhelming margin to begin a phased divestment to withdraw Church funds from certain companies that do business in Israel. Do you support or oppose the action taken by the Presbyterian Church? (The Israel Project, November 7-8, 2004), 241031=Which statement is closest to your own view? (Source: ADL, December 2003), 78718=1991 Jan 30-Feb 2, 220278=When you think about the world's nations, which country is in your opinion a true friend of Israel that can be trusted to help Israel even through difficult times? (Hudson Institute, June 24, 2004), 301235=Do you think the U.S. should put more pressure on Middle East governments to allow for more democracy - even if it means Islamic extremists might win power? (Newsweek, December 6-7, 2001), 200786=Do you have a favorable or unfavorable impression of Israeli Prime Minister Ariel Sharon? (ADL, March 18-25, 2005), 43163=1989 Feb, 40987=1991 Mar, 288128=In your view, which is more important - relations between the US and Israel or between the US and the Arab Nations? (Zogby International, April 2-4, 2002), 274789=Do you agree or disagree? The US has a moral obligation to combat anti-Semitism in Europe as part of its foreign policy. (Source: ADL, December 2003), 240284=Would you favor or oppose the creation of a Palestinian homeland - and independent state in the West Bank and Gaza Strip? (Source: ADL, December 2003), 403680=In thinking about Israel's relationship with the United States, which of the following is best reason for the U.S. to maintain close relations (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 300394=Do you think that U.S. support for friendly, but dictatorial governments in the region has an important effect in increasing support for Islamic extremists among the common people in these countries, or not? (Newsweek, December 6-7, 2001), 399490=Israel is a small country surrounded by enemies, and the United States should defend the country when it needs us. Do you strongly agree with this statement, somewhat agree, somewhat disagree or strongly disagree with this statement? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 95147=1991 Aug 8-11, 414947=How important are relations with... Israel ...to the US (United States) national interest--extremely important, fairly important, just somewhat important, or not important at all? (Hart And Teeter Research Companies / NBC News, Wall Street Journal, July 24-26, 1999), 326677=In your opinion, what is the most important foreign policy problem that the new U.S. administration will have to deal with? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 313025=Do you think the United States should increase its support for Israel, decrease its support for Israel, or keep it about the same? (ABC News, Oct. 8-9, 2001), 110070=1992 Feb 6-9, 203946=In general, do you believe the American news coverage of the Israeli-Palestinian conflict in the Middle East tends to favor the Israelis, the Palestinians, or is it generally balanced? (ADL, March 18-25, 2005), 314117=Thinking about United States policies in general in the Middle East, should the United States consider changing its policies in the Middle East to try to reducethe violent backlash against the United States or should the United States not consider such changes? (Newsweek, Oct. 4-5, 2001), 156597=Please tell me which statement comes closer to your own view... Solving the Israeli-Palestinian conflict is important to solving issues in Iraq or Challenges in Iraq will not be solved by solving the Israeli-Palestinian conflict. (Public Opinion Strategies, January 18-21, 2007), 97058=1989 Aug 10-13, 238663=In your opinion, should the U.S.: (Source: ADL, December 2003), 325002=Are you familiar toward this country [Israel], somehow favorable, somewhat unfavorable or very unfavorable toward it? (The Mellman Group, August 2001), 276028=Now I would like to know your impression, even if you are not very sure about it. Is it your impression that more countries approve or disapprove of how the US has generally dealt with the Israeli-Palestinian conflict, or is it roughly balanced? (PIPA, May 8, 2002), 158246=Please tell me which statement comes closer to your own view...It is important to create a Palestinian state now or There should not be a Palestinian state until Palestinian leaders end the terror and recognize Israel’s right to exist (Public Opinion Strategies, January 18-21, 2007), 154936=Thinking about the ongoing conflict between Israel and the Palestinians in the Middle East, please tell me whether, in general, you consider yourself to be... (Public Opinion Strategies, January 18-21, 2007), 236252=Which statement is closest to your own view? (Source: ADL, December 2003), 266505=Please tell me whether you think each of the following nations is a friend of the United States, or not? [ROTATE LIST] SCALE: 1. Is a friend of the United States 2. Is not a friend of the United States 3. (Depends on the issue) 4. (Don’t know) (Fox News, February 25-26, 2003), 159920=Please tell me which statement comes closer to your own view...The bigger cause of violence in the Middle East is the conflict between Israel and the Palestinians or bigger cause of violence in the Middle East is the conflict between moderates and extremists, across a number of countries and groups (Public Opinion Strategies, January 18-21, 2007), 323897=Israel. Are you familiar with this country? (The Mellman Group, August 2001), 395378=The U.S. should continue to play a strong role in mediating the conflict in the Middle East. Do you strongly agree with this statement, somewhat agree, somewhat disagree or strongly disagree with this statement? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 261257=How well do you think the U.S. government is handling relations with the following countries? Please answer on a scale of 0 to 10 with 0 being very poorly and 10 being very well. (PIPA, March 2003), 242660=Which statement is closest to your own view? (Source: ADL, December 2003), 141426=Do the following groups or nations generally have more moderate views or more extremist views?                (The Israel Project National Survey, March 18-20, 2008), 243382=For each of the following countries, tell me if in your opinion it presents a threat to peace in the world (except for the Israel question which was asked to the entire sample [1,200], the question was asked to 600). (Source: ADL, December, 2003), 217898=Now, thinking into the future, say 25 years from now in the year 2029, do you believe that Israel will still exist as a Jewish nation? (The Israel Project, July 17-19, 2004), 75455=2002 Feb 4-6, 150403=Please tell me which statement comes closer to your own view... (The Israel Project National Survey, January 2007), 308932=Do you think that a major cause of US (United States) problems in the Middle East today is that the United States has paid too much attention to Israel and not enough attention to the Arab countries, or don't you think so? (CBS/New York Times, Oct. 25-28, 2001), 78064=1991 Mar 14-17, 221548=Some say that the US is helping Israel while others say that it is restricting to Israel. When you sum it up, to what extent do you think Israel should be thankful to the US for its help? (Hudson Institute, June 24, 2004), 289156=Do you agree or disagree that the US is doing enough to improve its image among Arabs and Muslims around the world? (Zogby International, April 2-4, 2002), 170244=Overall, do you agree or disagree that U.S. policy is as fair with the democratic government of Lebanon as it is with the democratic government of Israel? (Zogby International, August 11-15, 2006), 41711=1991 Jan, 312182=Should the United States continue its support of Israel? (New Atlantic Initiative/Chicago Sun Times, Oct. 15, 2001), 35910=1999 May, 76106=2001 Feb 1-4, 290753=Looking ahead, do you think there will still be a state of Israel in the Middle East 50 years from today, or not? Fifty years from today, do you think Israel will still be a Jewish state, OR that Israel will be a MIXED state in which the Palestinians have a major share of power? (Newsweek, March 21-22, 2002), 40262=1991 Aug, 59874=2001 Feb 1-4, 386883=How closely would you say you follow news from the Middle East -  very closely, somewhat closely, not very closely or not at all closely? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 58407=2003 Feb 3-6, 97692=1989 Feb 28-Mar 2, 281538=How likely do you think it is that each of the following will happen in the next? (Gallup/CNN/USA Today, April 5-7), 38085=1992 Feb, 60598=2000 Jan 25-26, 235557=Israel can be counted on as a strong, loyal US ally. (Source: ADL, December 2003), 292173=Whatever you think Israel's future will be, which of the following do you think SHOULD happen? Do you think...(Newsweek, March 21-22, 2002), 108173=1999 May 7-9, 237141=Which statement is closest to your own view? (Source: ADL, December 2003), 342587=ISRAEL Are you familiar with this country?  IF YES: Are you very favorable toward this country, somewhat favorable, somewhat unfavorable, or very unfavorable toward it? (Penn, Schoen & Berland Inc., and First International Resources Inc., January 25 and February 17, 2001), 95782=1991 Mar 14-17, 59151=2002 Feb 4-6, 148524=Which ONE of the following do you believe is the most important reason that Islamic fundamentalists hate the United States?                (Greenberg Quinlan Rosner Research, The Israel Project, December 2007), 223055=I am going to read you a list of possible threats to the vital interests of the United States in the next 10 years. For each one, please tell me if you see this as a critical threat, an important but not critical threat, or not an important threat at all? (Gallup, February 9-12, 2004), 259395=Here are five foreign policy problems that the US is facing these days. Thinking about the long term, please select the one that you feel is the most important. [order randomized; question repeated with remaining problems until all rated. (PIPA, March 2003), 211492=Now, thinking about the ongoing conflict between Israel and the Palestinians in the Middle East, please tell me whether, in general, you consider yourself to be.. (The Israel Project, July 17-19, 2004), 239325=In general, do you believe the American news coverage of the Israeli-Palestinian conflict in the Middle East tends to favor the Israelis, the Palestinians, or is it generally balanced? (Source: ADL, December 2003), 38811=1991 Nov, 198301=We'd now like to rate your feelings toward some organizations and people on a 0-100 scale, where 100 means that you have a very warm, positive feeling toward that particular organization or person, and zero means that you have a very cold, negative feeling. A rating of 50 means that you do not feel particularly warm or cold. You can use any number from zero to 100; the higher the number, the more favorable your feelings are toward that organization or person. (Harris, August 2006), 213594=Now I’d like to read you a list of words and phrases and please tell me for each one whether you believe it describes Israel very well, well, not too well, or not well at all. The (first/next) one is.... (The Israel Project, July 17-19, 2004), 241821=All in all, considering the costs to the United States versus the benefits to the United States, do you think the war with Iraq was worth fighting or not worth fighting? (Note: This question was asked before the capture of Saddam Hussein by U.S. forces) (Source: ADL, December 2003), 77412=1991 Aug 8-11, 96419=1991 Jan 30-Feb 2, 170875=How should the United States treat the Hamas-led Palestinian government? (Wall Street Journal, Online poll Feb. 3, 2006), 296155=Do you associate these statements with the United States and other Western nations?  (USA Today/CNN/Gallup poll, March 1-3, 2002, for U.S. data and 2002 Gallup Poll of the Islamic World for Islamic country data), 277059=I would like to know your impression, even if you are not very sure about it. It is your impression that more countries in the world are more sympathetic to the Israeli or the Palestinian position, or is it roughly balanced? (PIPA, May 8, 2002), 94513=1996 Mar 8-10, 275403=Do you agree or disagree? The US has a moral obligation to combat anti-Semitism throughout the world as part of its foreign policy. (Source: ADL, December 2003), 106905=2001 Feb 1-4 ^, 42436=1989 Aug, 37359=1996 Mar, 108805=1999 Feb 8-9, 289968=Do you agree or disagree that the US's interests and Israel's interests are identical? (Zogby International, April 2-4, 2002), 425863=Copyright © 2015 American-Israeli Cooperative Enterprise; New Site Design: Elie Berman, 203329=Do you agree or disagree with the following statement: Regardless of what they say publicly, most Arab leaders are committed to the destruction of Israel. (ADL, March 18-25, 2005), 278079=Thinking now about American Jewish leaders, when it comes to influencing U.S. policy toward Israel and the Middle East, do you think they have too much influence, too little influence, or about the right amount of influence over U.S. policy? (ADL, April 26-May 6, 2002), 136635=What is the top international threat?* *Not exact question wording               (Pew Research Center, January 7-11, 2009), 6237=Please indicate if you have a very favorable, somewhat favorable, somewhat unfavorable, or very unfavorable opinion of each individual, group, or country listed below (The Israel Project, May 2-4, 2014) All Numbers Reflect %., 299691=What is your opinion of Muslim countries?  (USA Today/CNN/Gallup poll, March 1-3, 2002), 274179=Do you agree or disagree? Throughout the world, anti-Semitism has reached its most dangerous levels since the 1930s. (Source: ADL, December 2003), 39537=1991 Sep, 234918=The United States has a special relationship with Israel because the two countries share many common values, including a commitment to freedom and democracy. (Source: ADL, December 2003), 232705=Which of the following statements is closest to your own view? (Source: ADL, December 2003), 227167=2002 Mar 22-24, 256386=How well do you think the U.S. government is dealing with the following international problems and issues? Please answer on a scale of 0 to 10 with 0 being very poorly and 10 being very well. (PIPA, March 2003), 34458=2000 Mar, 226687=2003 Oct 10-12, 311098=Now, I am going to read you a list of names. Will you please tell me if you have a favorable or unfavorable opinion of each person or organization? If you have no opinion or have never heard of the person, just say so. (New Atlantic Initiative/Chicago Sun Times, Oct. 15, 2001), 33738=2001 Feb, 416391=Many people believe that the United States has a vital interest in certain areas of the world and not in other areas. That is, certain countries of the world are important to the US for political, economic, or security reasons. I am going to read a list of countries. For each, tell me whether you feel the US has a very strong vital interest, a fairly strong vital interest, not much of a vital interest, or no vital interest at all in that country... Israel? (Potomac Associates And Opinion Dynamics / Henry Luce Foundation, June 16-28, 1999), 152157=Please tell me which statement comes closer to your own view...(The Israel Project National Survey, January 2007), 33018=2002 Feb, 35184=2000 Jan, 36634=1999 Feb}",
    "textBeforeTable": "Has the war on terrorism made you think that the United States' relations toward Israel should be closer, more distant, or stay the same? (Wall Street Journal/NBC News) 12% Don't know 18% Reflect an important part of Islam's teachings (or) 70% Represent a perversion of Islam by extremists (or) From what you know about Islam and its religious teachings, do you think the suicide bombings and other violence by some followers of Islam...(Newsweek, December 6-7, 2001) 6% Don't know 5% Not at all 8% Not too 34% Somewhat 47% Very c) Once in power, they would develop or obtain weapons of mass destruction 9% Don't know 6% Not at all 9% Not too 32% Somewhat 44% Very b) This would lead to major reductions in human rights and civil",
    "textAfterTable": "Favorable 56% Unfavorable 20% No opinion/Never heard of 25% Should the United States continue its support of Israel? (New Atlantic Initiative/Chicago Sun Times, Oct. 15, 2001) Yes 73% No 15% DK/Refused 13% Do you think the United States should increase its support for Israel, decrease its support for Israel, or keep it about the same? (ABC News, Oct. 8-9, 2001) Increase 13% Decrease 13% Keep the same 68% DK 6% Thinking about United States policies in general in the Middle East, should the United States consider changing its policies in the Middle East to try to reducethe violent backlash against the United States or should the United States not consider such changes? (Newsweek, Oct. 4-5, 2001) Should consider changing policies 46% Should NOT consider changes 43%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}