{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are many different parties on the weekends, non-alcohol. There are also some great places in Liberty to hang out. Or movie theater's to go to.",
            "The food really isn't all that bad. There are always options.",
            "The dorms are pretty nice, with only a few problems such as the heat being either too hot, or non existent, but overall I love the dorm. I have met some of my closest friends in the dorms.",
            "William Jewell is a tough school academically. There is always a challenge.",
            "Be ready for a challenge, it isn't easy, but it is worth it. Get involved, many students are involved and it's a great way to get to know others at school.",
            "William Jewell College is a wonderful school, not only academically, but also socially. While at Jewell I have been challenged both in and out of the classroom. There are also many different extracurricular activities available for all students."
        ]
    ],
    "pageTitle": "William Jewell College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/William-Jewell-College/reviews?_escaped_fragment_=/show/107639",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910337359,
    "recordOffset": 910303196,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59230=Lighting of the Quad happens every December, where it magically snows in our chapel during carol singing and then we all go outside and light candles and say hello to Santa (who's on the roof of the Student Union with his 'elves') and then countdown to the turning on of the Christmas lights that line all the pillars/columns of the major buildings. Also, Phi Gamma Delta's motorcycle gang shows up at this time to collect the toys for tots the campus has been participating in. We sing our alma mater at every single homecoming event. Without fail., 120224=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/29/2009 Reviewer is A current student here. 5 out of 6 people found this review useful. 1 of 26 William from Springfield, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. William Jewell College Reviews William Jewell College › Missouri › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students If you were one of those freakishly smart students in high school, you know the one that makes a ton of ‘A’s, in every club, band nerd, and still has time for volunteering, this is the place for you! You will no longer feel alone with your intelligence, in fact you will now be just one of the 'normal' kids, and it’s quite nice. Don’t be fooled, we are not mere nerds playing Dungeons & Dragons on the weekend, although it’s there if you want to, we have parties, movie nights, dances, and lots of other activities. I find it to be the perfect college that has balance between fun and education. Tips for prospective students The biggest tip I would suggest is make sure you get a clear dollar amount of what you’ll owe. This was an issue I ran into right after being accepted, the price tag kept jumping up and was not settled until two months into school. Other than that I would say if you have chosen Jewell you don’t need too many tips, you’re already making good decisions. Bang for the buck You are definitely getting what you paid for. Going to William Jewell means you are a student of high intelligence, a leader, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}