{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "MB Docket No.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2015-04337",
            "",
            "15-37",
            "15-21"
        ]
    ],
    "pageTitle": "47 CFR Part 76, Subpart F - Network Non-duplication Protection, Syndicated Exclusivity and Sports Blackout | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/part-76/subpart-F?qt-cfr_tabs=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916182183,
    "recordOffset": 916160635,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1043=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{13094=In this document, the Federal Communications Commission (“Commission” or “we”) respond to Petitions for Reconsideration of the Second Report and Order, interpreting Section 621 of the Communications Act of 1934, which deals with local franchising of cable companies. We clarify the applicability of the Second Report and Order in states that have state-level franchising, grant the request that we reconsider our Final Regulatory Flexibility Analysis to align with the text of the Second Report and Order, and deny the petitions in all other respects., 53747=In this document, the Commission seeks comment on a Petition for Rulemaking filed by the American Cable Association (“ACA”) requesting, among other things, that the Commission extend for an additional three years the exemption from the requirement to carry high definition (“HD”) broadcast signals under the “material degradation” provisions of the Communications Act of 1934, as amended (“the Act”) that it granted to certain small cable systems in the 2012 Fifth Report and Order. This exemption is slated to expire on June 12, 2015 absent further action by the Commission. We tentatively conclude that the public interest would be served by extending the HD carriage exemption for three years, or until June 12, 2018., 48417=In this document, the Commission proposes satellite television market modification rules to implement section 102 of the Satellite Television Extension and Localism Act (STELA) Reauthorization Act of 2014 (“STELAR”). The STELAR amended the Communications Act and the Copyright Act to give the Commission authority to modify a commercial television broadcast station's local television market for purposes of satellite carriage rights. In this document, the Commission proposes to revise the current cable market modification rule to apply also to satellite carriage, while adding provisions to address the unique nature of satellite television service. The document also proposes to make conforming changes to the cable market modification rules and considers whether to make any other changes to the current market modification rules., 17847=The Federal Communications Commission (“Commission”) amends its rules to implement certain provisions of the STELA Reauthorization Act of 2014. Collectively, those provisions: Extend to January 1, 2020 the good faith negotiation requirements applicable to multichannel video programming distributors (“MVPDs”) and television broadcast stations, and the exclusive contract prohibition applicable to such broadcast stations; prohibit same-market television broadcast stations from coordinating negotiations or negotiating on a joint basis for retransmission consent except under certain conditions; prohibit a television broadcast station from limiting the ability of an MVPD to carry into its local market television signals that are deemed “significantly viewed” or that otherwise are permitted to be carried by the MVPD, with certain exceptions; and eliminate the “sweeps prohibition” in the Communications Act of 1934, as amended (“the Act”)., 8289=The Federal Communications Commission (Commission) adopts a proposal filed jointly by the American Cable Association and the National Association of Broadcasters that modifies and extends the exemption from the requirement to carry high definition (“HD”) broadcast signals under “material degradation” provisions of the Communications Act of 1934, as amended (“the Act”) that the Commission granted to certain small cable systems in 2012 (“HD carriage exemption”)., 30082=§ 302 - Repealed. June 5, 1936, ch. 511,, 3346=In this document, the Commission improves and expedites the Effective Competition process by adopting a rebuttable presumption that cable operators are subject to Competing Provider Effective Competition. This action implements section 111 of the STELA Reauthorization Act of 2014, which directs the Commission to adopt a streamlined Effective Competition process for small cable operators., 59042=In this document, the Commission asks whether it should adopt a rebuttable presumption that cable operators are subject to effective competition. A franchising authority is permitted to regulate basic cable rates only if the cable system is not subject to effective competition. This proceeding will also implement section 111 of the STELA Reauthorization Act of 2014, which directs the Commission to adopt a streamlined effective competition process for small cable operators., 74107=In this document, the Commission proposes to expand to cable operators, satellite TV providers, broadcast radio licensees, and satellite radio licensees the requirement that public inspection files be posted to the FCC's online database. In 2012, the Commission adopted online public file rules for broadcast television stations that required them to post public file documents to a central, FCC-hosted online database rather than maintaining the files locally at their main studios. Now that television broadcasters have completed their transition to the online file, the Commission believes it is appropriate to commence the process of expanding the online file to other media entities to extend the benefits of improved public access to public inspection files and, ultimately, reduce the burden of maintaining these files., 34155=Title 47 published on 2014-10-01}",
    "lastModified": "Tue, 28 Jul 2015 03:17:47 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38001 - Concerning Effective Competition; Implementation of Section 111 of the STELA Reauthorization Act 2015-07-02; vol. 80 # 127 - Thursday, July 2, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 65 FR 68101 § 76.130 — Substitutions. § 76.128 — Application of sports blackout rules. § 76.127 — Satellite sports blackout. § 76.125 — Indemnification contracts. § 76.124 — Requirements for invocation of protection. , Nov. 14, 2000, unless otherwise noted. Source:",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Final rule. The FCC will publish a document in the Federal Register announcing the effective date of this final rule after OMB approval. 47 CFR Part 76 Summary In this document, the Commission improves and expedites the Effective Competition process by adopting a rebuttable presumption that cable operators are subject to Competing Provider Effective Competition. This action implements section 111 of the STELA Reauthorization Act of 2014, which directs the Commission to adopt a streamlined Effective Competition process for small cable operators. 2015-06-23; vol. 80 # 120 - Tuesday, June 23, 2015 80 FR 35854 - Carriage of Digital Television Broadcast Signals GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-15251 RIN CS Docket",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}