{
    "relation": [
        [
            "SVG_STITCHTYPE_UNKNOWN",
            "SVG_STITCHTYPE_STITCH",
            "SVG_STITCHTYPE_NOSTITCH"
        ],
        [
            "",
            "",
            ""
        ],
        [
            "The type is not one of predefined types. It is invalid to attempt to define a new value of this type or to attempt to switch an existing value to this type.",
            "Corresponds to value stitch.",
            "Corresponds to value noStitch."
        ]
    ],
    "pageTitle": "W3C SVG 1.0 Specification - Filter Effects - Working Draft 20000629",
    "title": "",
    "url": "http://www.w3.org/TR/2000/WD-SVG-20000629/filters.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 823027251,
    "recordOffset": 822984242,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{167454=This filter primitive creates an image using the Perlin turbulence function. It allows the synthesis of artificial textures like clouds or marble. For a detailed description the of the Perlin turbulence function, see \"Texturing and Modeling\", Ebert et al, AP Professional, 1994. The resulting image will have maximal size in image space.}",
    "lastModified": "Thu, 06 Jul 2000 22:24:03 GMT",
    "textBeforeTable": "Defined constants Definition group Blend Mode Types }; // raises DOMException on setting attribute SVGAnimatedEnumeration mode; // raises DOMException on setting attribute SVGAnimatedString in2; // raises DOMException on setting attribute SVGAnimatedString in1; const unsigned short SVG_FEBLEND_MODE_LIGHTEN = 5; const unsigned short SVG_FEBLEND_MODE_DARKEN = 4; const unsigned short SVG_FEBLEND_MODE_SCREEN = 3; const unsigned short SVG_FEBLEND_MODE_MULTIPLY = 2; const unsigned short SVG_FEBLEND_MODE_NORMAL = 1; const unsigned short SVG_FEBLEND_MODE_UNKNOWN = 0; // Blend Mode Types SVGFilterPrimitiveStandardAttributes { SVGElement, interface SVGFEBlendElement :   IDL Definition The SVGFEBlendElement interface corresponds to the 'feBlend' element. Interface SVGFEBlendElement NO_MODIFICATION_ALLOWED_ERR: Raised when the node is readonly. DOMException Exceptions on setting resultSVGAnimatedString result on the given element. Corresponds to attribute NO_MODIFICATION_ALLOWED_ERR: Raised when the node is readonly. DOMException Exceptions on setting heightSVGAnimatedLength height on the given element. Corresponds to attribute NO_MODIFICATION_ALLOWED_ERR: Raised when the node is readonly.",
    "textAfterTable": "SVG_FEBLEND_MODE_SCREEN Corresponds to value screen. SVG_FEBLEND_MODE_DARKEN Corresponds to value darken. SVG_FEBLEND_MODE_LIGHTEN Corresponds to value lighten. Attributes SVGAnimatedString in1 Corresponds to attribute in on the given 'feBlend' element. Exceptions on setting DOMException NO_MODIFICATION_ALLOWED_ERR: Raised when the node is readonly. SVGAnimatedString in2 Corresponds to attribute in2 on the given 'feBlend' element. Exceptions on setting DOMException NO_MODIFICATION_ALLOWED_ERR: Raised when the node is readonly. SVGAnimatedEnumeration mode Corresponds to attribute mode on the given 'feBlend' element. Takes on one of the Blend Mode Types. Exceptions on setting DOMException NO_MODIFICATION_ALLOWED_ERR: Raised when the node is readonly. Interface SVGFEColorMatrixElement The SVGFEColorMatrixElement interface corresponds to the 'feColorMatrix' element.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}