{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7"
        ],
        [
            "Car Number",
            "54",
            "16",
            "3",
            "23",
            "11",
            "13",
            "69"
        ],
        [
            "Name",
            "Dave Bollis",
            "Mike Ammerman",
            "Rolley Olney",
            "Joe Barnhart",
            "Brian Beckner",
            "Harold Patrick",
            "AL Williams"
        ],
        [
            "Behind Leader",
            "",
            "0.202",
            "2.810",
            "3.123",
            "3.203",
            "6.722",
            "--8 Laps--"
        ],
        [
            "Gap",
            "",
            "0.202",
            "2.608",
            "0.313",
            "0.080",
            "3.519",
            "--8 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap June 9, 2006",
    "title": "",
    "url": "http://www.spartanspeedway.com/numbers/archives/2006/recap0609.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 745066319,
    "recordOffset": 745049925,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1288=After two rainouts earlier in the season, the Andrews Chevrolet Super Late Models took to the track, on Holiday Powersports Night. Doug Finley set the bar high, with a qualifying time of 12.964 and the remainder of the top five qualifiers right on his heels. Sixteen of these pristeen Super Late Models lined up for their 75-lap feature, and by the completion of the 75 laps, many looked like they had been running through a war zone. Everyone one of those drivers wanted to lead that first lap, but Stan Perry grabbed the honor of leading the first lap of the division?s first feature, while Chip Garlock, Chris Place, and John Ledwidge filed in behind him. The remainder of the field opted to run side by side, giving the top four the ability to run away from the pack. By lap 10, Perry had opened up a pretty good lead over Garlock and Place, with McNett, Jeff Hackworth and Doug Finley marching up through the field. McNett got under Ledwidge, bringing Hackworth, Finley, and Jack Landis along with him. As Ledwidge was shuffled back, Jimmy Gallagher motored his way from the rear of the field to catch the leaders. Lap 20 saw McNett, Finley, Gallagher and Landis methodically picking off cars to try to catch Perry. Perry was starting to feel the heat from Finley on lap 30, as Finley jumped to the outside of Perry. Caution on lap 33 set Finley up for his run at Perry, and made the pass on the restart. Finley then proceeded to check out on the field until a lap 44 caution was the break McNett was looking for. McNett, Place, Garlock and Gallagher closed up behind Finley, each one wanting to take a shot at the leader. Gallagher made his way around Garlock on lap 50 and began reeling in Place as well. Gallagher grabbed the third spot from Place on lap 60 and went to work on McNett in second. Caution on lap 64, for a slowing Finley, put McNett up front for the restart. Landis made his bid for third on the high side, but couldn?t make it stick. Lap 70 saw Landis still working on Place for third, while Gallagher stuck a nose under McNett for the lead, with McNett slamming the door. At the line, it was McNett, Gallagher, Place, Landis and Garlock. Stan Perry and Chris Place took their heats. Twenty WMMQ Classic Rock 94.9 MI Modifieds lined up for the start of their 35-lap feature, with a number of hot shoes starting up front by the luck of a roll of the dice. Brian Heeney, Dan Loughan, Nyle Weiler, Perry Davenport, Bill Butler and Earl Miles sat in the first three rows, making for some good, tight racing up front. Heeney was shown as the lap one leader with Loughan, Davenport and Weiler closing in. Davenport went to work on Loughan, but Loughan shut the door each time, as fast qualifier, Leroy Ellis was making his move from mid-pack and was sitting in fourth by lap 12. Miles was caught up in the second groove and Butler made his way into the top five. Two other cautions on lap 15 and lap 24 diminished leads that Loughan built up over the field, while Ellis made his way into third by lap 30. Ellis jumped out to try the high side around Heeney but couldn?t get it done, and at the stripe, it was Loughan, Heeney, Ellis, Butler and Wallace. Dan Fraser and Loughan scored heat wins. The Performance Automotive NW Street Stocks saw some familiar faces return to the division. Bubber Patrick, Joe Barnhart, and Dave Bollis all made their 2006 debut on Friday night. Bollis did it in fine style, scoring the first heat race of the evening, while 2005 division champ, Dane Long, set fast time, won heat two and the feature. Feature time saw Long start from the rear of the field and pick off cars one by one as the front of the field battled for position. The leaders were running in a pack, with Dave Bollis taking the lead on lap one. Bollis continued to lead, with Barnhart making a charge to sit in second ahead of Rolly Olney, Corey Davis and Damon Place on lap ten. Davis made his way around Barnhart, with Long, Jon McNett (who pulled double-duty) and Damon Place playing follow the leader behind him. Long went to the point on lap 20, with he and McNett checking out on Bollis, Place and Davis. McNett issued a challenge to Long for the lead, but Long prevailed. At the line, it was Long, McNett, Place, Bollis and Davis. The Holiday Powersports Pony Stocks put on a whale of a show with the wily, veteran, once again, showing the way. Ward set fast time and stomped the field, coming from the back of the starting grid to win the 20-lap feature. Chaos ruled as the green flag dropped with car three- and four-wide around the track. Ken Dollarhite took the lead, with Wayne Beckner Jr. grabbing the lead on the restart after a lap one caution. Ward galloped to the front around Beckner with George Wyers, Mark Garland and Dallarhite all in tow. Ward opened up a huge lead over Garland by lap 10, as caution closed up the field on lap 15. Garland caught Ward on the restart, with Garland looking high and low for a way around Ward. Garland jumped to the outside on lap 18, but it was too little, too late. Ward came home the victor over Garland, Wyers, Brent McCort and Beckner. Please join us next Friday, June 16th, 2006, for Scout Night. All scouts, in uniform, will be admitted free. Racing will be sponsored by Wolverine Engineering and will feature Super Pros, Street Stocks, Oval Pony Stock and Pony Stock Figure 8. Please check out the website for gate prices and times and we?ll see you at the races!}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague After two rainouts earlier in the season, the Andrews Chevrolet Super Late Models took to the track, on Holiday Powersports Night. Doug Finley set the bar high, with a qualifying time of 12.964 and the remainder of the top five qualifiers right on his heels. Sixteen of these pristeen Super Late Models lined up for their 75-lap feature, and by the completion of the 75 laps, many looked like they had been running through a war zone. Everyone one of those drivers wanted to lead that first lap, but Stan Perry grabbed the honor of leading the first lap of the division?s first feature, while Chip Garlock, Chris Place, and John Ledwidge filed in behind him. The remainder of the field opted to run side by side, giving the top four the ability to run away from the pack. By lap 10, Perry had opened up a pretty good lead over Garlock and Place, with McNett, Jeff Hackworth and Doug Finley marching up through the field. McNett got under Ledwidge, bringing Hackworth, Finley, and Jack Landis along with him. As Ledwidge was shuffled back, Jimmy Gallagher motored his way from the rear of the field to catch the leaders. Lap 20 saw McNett, Finley, Gallagher and Landis methodically picking off cars to try to catch Perry.",
    "textAfterTable": "7 1 Chris Place 13.197 0.233 13.214 8 34 John Ledwidge 13.199 0.235 13.255 9 28 Chip Garlock 13.259 0.295 13.271 10 10. Stan Perry 13.487 0.523 13.490 11 45 Geoge Rangle 13.792 0.828 13.876 12 36 Randy Clear 13.870 0.906 14.049 13 18 Donivon Mathe 14.520 1.556 14.796 14 18. Dean Gassert 14.802 1.838 14.917 15 91 Leonard Cousino 15.287 2.323 -.--- 16 25 Jim Gallagher -.--- -.--- -.--- WMMQ MMA Modifieds",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}