{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security is always present on campus, and a positive presence. The Security Office regularly hold meeting to hear student concerns, they are on-campus 24/7, and completely accessible.",
            "All the Greek houses are here. I love the fund-raisers-- the cupcake sales are phenomenal.",
            "There is every club you can imagine, and the emphasis is in diversity, celebration of culture, acceptance, and respect. They encourage you, the student, to BE the difference, BE the change.",
            "This is a great school for The Arts, for Business, Agriculture and Conservation, and also Equine Studies and Competition.",
            "I don't know yet of any unusual traditions, but this is my first year.",
            "As a tranfer student, I was fortunate to receive a scholarship based on my GPA. The financial aid office is wonderful, and communicates all available scholarships and grants in a timely fashion.",
            "Well, at my age, just being on campus is fun. I do observe a very active student life, there is always something going on every day and weekend, there are a wide variety of diverse and multi-cultural art events,clubs and committees, and yes, there is football. They even have their own country market.",
            "There is a cafe Pub in the Student Center, and a building that houses the cafeteria. A wide variety of healthy, nutritious food and drink is offered. GREAT COFFEE.",
            "I am a commuter student, but what I hear from the residents is all positive.",
            "The courses are intense, the reading load heavy; sincere effort and hard work are expected and acknowledged. There is help and support anywhere and everywhere you look for it. I give DelVal 5 out of 5.",
            "Be open, unafraid, take the challenge offered to you. Nothing is easy that is worthwhile. Learn everything you can, from everyone you can. Be invested in the global community, and in yourself.",
            "Surrounded in a lush country garden setting and intimate atmosphere, the fell and sounds of academia sink in through your skin to your bones. The old agricultural college building are welcoming, comforting. Every person I've interacted with, from Administration to Education, takes a sincere and personal interest in your success as a student."
        ]
    ],
    "pageTitle": "Delaware Valley University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Delaware-Valley-University/reviews?_escaped_fragment_=/show/29572",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899554487,
    "recordOffset": 899511565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{52102=From what I hear thier food is great and they are re-doing this summer 2012., 23830=Doylestown, PA is just a walk away, and in October they have many fun family events that DelVal students are welcome to. There is also a beautiful park a 10 minute walk from campus, complete with a marvelous wooden castle playground! Stop by the farmer's market for fresh ice cream and lunch, or just attend some of the fun-packed events sponsored by the Student Activities Council! If you're looking for more, take the train from our on-campus station to Philadelphia for the day!, 100321=DVC used to be called the National Farm School. It was founded in 1896 as a school for Jewish boys who wanted to learn how to farm. Now it is co-ed and has no religious affiliations, but the original Jewish temple that was built on campus still stands and occasionally special events are held in it. To keep with our roots, the college is closed for all Jewish holidays such as Rosh Hashanah and Yom Kippur., 161367=© 2015, Cappex.com, LLC, 134557=Delaware Valley College may be a small school, but the 18:1 ratio of students to teachers increases the chances of gaining a hands on experience for a future job. Del Val is very good at setting up a schedule for students to make sure they graduate on time and achieve a high level of education proficiency. Also, Del Val is excellent with ensuring a job right out of college as they provide great services at the college for us to obtain help.}",
    "textBeforeTable": "12/05/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 38 Jossette from Erie, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Delaware Valley University Reviews Delaware Valley University › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I have completed my first semester here at Delaware Valley College and have learned so much already. The core classes like English 1 and Chemistry 1 tuned up my skills from high school in each of those areas. My major-specific courses were very interesting and the teachers taught all of the material in a way that we students could absorb it. Login to rate or flag the reviews Erica from Earleville, MD 06/19/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 4 out of 7 people found this review useful. 3 of 38 Categories Comments Great for these types of students Students who love the suburbs will love this school. close to the shopping centers but not in the city. It's a very agricultural school. Small school, around 2,000 kids. People are friendly and the campus is a good size. not to small and not to big. I love the school.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}