{
    "relation": [
        [
            "Code or Value",
            "0 to 229.27",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "144880",
            "823"
        ],
        [
            "Cumulative",
            "144880",
            "145703"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2007 - 2008: Dietary Interview: Individual Foods -- First Day Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/DR1IFF_E.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357716147,
    "recordOffset": 357680490,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{21403=Participants who reported consuming only water, no food or other beverages: Beginning in 2005-2006, information on all waters were collected during the 24-hour recall and reported in the Individual Foods file, including tap water and bottled water. Therefore, records are now included in the Individual Foods file for participants who consumed only water. There are 5 such individuals in the 2007-2008 datasets, all in the Day 2 data. Their dietary recall status variable for the day is coded as \"1\" (complete and reliable) in the Total Nutrients file and the total number of foods is coded based on how many times water was reported. There are 5 nutrients for the tap water and plain bottled water codes that have values greater than zero - calcium, magnesium, sodium, zinc, and copper. Individuals with just water intake and no food intake will have zero energy intake for the day. Depending on the type of analysis, these individuals may need to be excluded from the analysis., 32510=USDA's Food and Nutrient Database for Dietary Studies, 4.1 (FNDDS 4.1), was used for processing the 2007-2008 intakes (http://www.ars.usda.gov/ba/bhnrc/fsrg). The FNDDS includes comprehensive information that can be used to code individual foods and portion sizes reported by participants and also includes nutrient values for calculating nutrient intakes. The underlying nutrient values for FNDDS 4.1 were based on values in the USDA National Nutrient Database for Standard Reference, release 22, produced by USDA’s Nutrient Data Lab (http://www.ars.usda.gov/nutrientdata). FNDDS values are updated for every 2-year WWEIA, NHANES release cycle. FNDDS 4.1 corresponds with WWEIA 2007-2008. Additional information about the FNDDS and related tools is available on the Food Surveys Research Group website (Raper et al., 2004; Anand et al., 2006; Bodner-Montville et al, 2006; Ahuja et al., 2008)., 23705=3 [Code 3 is not included in the current datasets. It was only used for data from the 1999-2000 survey cycle.], 24958=Number of days of intake: Because two days of data are included in the 2007-2008 release, a variable has been included to indicate the number of days of intake available for each participant. The variable name is DRDINT. For 2007-2008, 9,255 respondents provided complete dietary intakes for Day 1 and of those providing the Day 1 data, 7,838 provided complete dietary intakes for Day 2., 51126=What’s New with the 2007-2008 WWEIA Release:, 9997=For the 2007-2008 NHANES, there were 12,943 persons selected; of these 9,762 were considered respondents to the MEC examination and data collection. However, 9,255 of the MEC respondents provided complete dietary intakes for Day 1. Furthermore, of those providing the Day 1 data, 7,838 provided complete dietary intakes for Day 2., 51486=As in previous years, two types of dietary intake data are available for the 2007-2008 survey cycle - Individual Foods files and Total Nutrient Intakes files. Starting with the 2007-2008 data release, data documentation will be published only in HTML format. The document in its new format contains the same information as it has in previous years., 48840=NHANES has been collecting data on study participants’ use of dietary supplements in the past 30 days, during the Dietary Supplements Section (DSQ) in the household interview. In 2007-2008, additional information on supplement and antacid use for the previous 24 hours was collected to provide data of the same timeframe as the food and beverage intake. This will allow researchers to improve the total nutrient intake estimations as well as examine associations by nutrient source such as from foods versus supplements., 34145=For additional information about the dietary interview component and related survey protocols, please go to the Survey Operations Manual, Consent Documents, Brochures site at: http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/current_nhanes_07_08.htm, 11669=Note: A participant could report more than one type of diet, and all the responses were recorded. In 2003-2004 and 2005-2006, the variable DRQSDT1 denotes the type of diet the participant followed specifically for weight loss purposes, including a variety of low calorie diets, low carbohydrate diets, and/or high protein diets. In 2007-2008, 2 new variables have been added to allow participants to report \"low carbohydrate diet (DRQSDT9)\" and \"high protein diet (DRQSDT10)\" individually. The variable \"DRQSDT1\" is now used to denote a weight loss or low calorie diet., 14121=Combination foods: Foods that are eaten in combination with other foods, such as cereal with milk, are identified by a combination food type (DR1CCMTX) and a combination food number (DR1CCMNM). They are located in the Individual Foods file. About half of the foods reported in 2007-2008 were consumed in combination with other foods. The code descriptions for this variable are the following:, 19020=Food source: The source of each food (where it was obtained, e.g., from a store, fast food restaurant, cafeteria) is included with the 2007-2008 release as it was for 2005-2006. The variable names are DR1FS and DR2FS and are located in the Individual Foods file. The code descriptions for this variable are:, 44313=Beginning with the 2005-2006 WWEIA and continued in 2007-2008 WWEIA, the consumption of all types of water (including tap and bottled water, plain and carbonated, sweetened and unsweetened water) has been collected during the 24-hour recall. As a result, each report of water intake throughout the day was collected and coded as a separate food item. These water intake items now appear in the Individual Foods file with food codes designating the type of water. As with other foods, a variable is present to indicate if the water was consumed at home or away. For bottled waters, a variable is present indicating where the water was obtained. For tap water, the variables DR1TWS and DR2TWS in the Total Nutrient Intake files indicate the main source of tap water drunk by the participant. In 2003-2004, only sweetened bottled waters were collected during the 24-hour recall and included in the Individual Foods file. Information on daily intake of non-sweetened waters (total plain water, total tap water and the source of tap water, total bottled water, and plain carbonated water) were collected after the 24-hour dietary recall and included in the Total Nutrient Intake file for 2003-2004. Starting in 2005-2006, summary water variables that are compatible with previous data cycles are included in the Total Nutrient Intake files with the exception of plain carbonated water. These water totals (DR1_320Z, DR2_320Z, DR1_330Z, DR2_330Z, DR1BWATZ and DR2BWATZ) represent total water consumed as a beverage by itself. Therefore, they do not include the moisture content of foods and beverages (such as watermelon, coffee, lettuce) that are available for each food reported in the Individual Foods files., 35224=The AMPM was validated in a large study and shown to be an effective method for collecting accurate group energy intake of adults. Completed in 2004, this extensive research project included 524 healthy, weight-stable volunteers, aged 30-69 years. The accuracy of the AMPM was evaluated by comparing reported energy intake (EI) to total energy expenditure (TEE) using the doubly labeled water technique (Moshfegh et al., 2008). Among the findings were that EI compared to TEE was under-reported by 11% overall, by less than 3% for normal weight subjects with body mass index (BMI) <25 and 16% for overweight subjects with BMI ≥ 25., 47514=Further details about these and other changes for 2007-2008 are provided within this document. Appendix 1 provides a summary of changes among the 3 latest cycles of data collection., 54159=Title: Dietary Interview: Individual Foods -- First Day (DR1IFF_E ) Contact Number: 1-866-441-NCHS Years of Content: 2007 - 2008 First Published: July, 2010 Revised: May, 2013 Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Dietary interview component provides detailed dietary intake information from NHANES participants. Record Source: NHANES 2007 - 2008 Survey Methodology: NHANES 2007 - 2008 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 49776=In 2007-2008, a new sample design was implemented. All Hispanics were oversampled, not just Mexican Americans. In addition, for each of the race/ethnicity domains, the 12-15 and 16-19 year age domains were combined and the 40-59 year age minority domains were split into 10 year age domains 40-49 and 50-59. This has led to an increase in the number of participants aged 40+ and a decrease in 12-19 year olds from previous cycles. Lastly, pregnant women were no longer oversampled. Based on these changes, unweighted frequencies of certain variables may differ slightly in this survey cycle compared to earlier survey cycles. Refer to the NHANES 2007–2008 Public Data General Release File Documentation (http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/generaldoc_e.htm) on the NHANES website for more detail.}",
    "TableContextTimeStampAfterTable": "{149234=Individual fatty acids:     4:0 (gm)     6:0 (gm)     8:0 (gm)     10:0 (gm)     12:0 (gm)     14:0 (gm)     16:0 (gm)     18:0 (gm)     16:1 (gm)     18:1 (gm)     20:1 (gm)     22:1 (gm)     18:2 (gm)     18:3 (gm)     18:4 (gm)     20:4 (gm)     20:5 n-3 (gm)     22:5 n-3 (gm)     22:6 n-3 (gm)}",
    "lastModified": "Fri, 09 May 2014 20:28:55 GMT",
    "textBeforeTable": "Both males and females 0 YEARS - 150 YEARS Target: Dietary day one sample weight English Text: Dietary day one sample weight SAS Label: WTDRD1 Variable Name: WTDRD1 - Dietary day one sample weight Both males and females 0 YEARS - 150 YEARS Target: One of the key variables for the file. The primary key variables are SEQN and DR1ILINE. English Instructions: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Rumpler WV, Kramer M, Rhodes DG, Moshfegh AJ, Paul DR, Kramer M. Identifying sources of reporting error using measured food intake. Eur J Clin Nutr 2008; 62:544-52. http://hdl.handle.net/10113/16546 [Accessed on: 6/14/10] Raper, N., Perloff, B., Ingwersen, L., Steinfeldt, L., Anand, J. An overview of USDA’s dietary intake data system. J. Food Compos. Anal. 2004; 17(3-4):545-55. http://hdl.handle.net/10113/20984 [Accessed on: 6/14/10] Moshfegh AJ, Rhodes DG, Baer DJ, Murayi T, Clemens JC, Rumpler WV, Paul DR, Sebastian RS, Kuczynski KC, Ingwersen LA, Staples RC, Cleveland LC. The USDA Automated Multiple-Pass Method reduces bias in the collection of energy intakes. Am J Clin Nutr 2008; 88:324-332.",
    "textAfterTable": "WTDR2D - Dietary two-day sample weight Variable Name: WTDR2D SAS Label: Dietary two-day sample weight English Text: Dietary two-day sample weight Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1513.0983763 to 419692.00229 Range of Values 124411 124411 . Missing 21292 145703 DR1ILINE - Food/Individual component number Variable Name: DR1ILINE SAS Label: Food/Individual component number English Text: Food/Individual component number English Instructions: One of the key variables for the file. The primary key variables are SEQN and DR1ILINE. Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 to 55 Range of Values 145703 145703 . Missing 0 145703",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}