{
    "relation": [
        [
            "Patent application number",
            "20100097542",
            "20100238373",
            "20110122340"
        ],
        [
            "Description",
            "LIQUID CRYSTAL DISPLAY AND ASSEMBLY THEREOF - The present invention is broadly directed towards a receiving container for an LCD apparatus for securing a lamp and lamp wiring connected to a lamp. The receiving container has features for substantially preventing the lamp wiring from being disconnected from the lamp. For example, a first through-hole for receiving the lamp wiring, a first trench, securing members, and securing projections are utilized to substantially prevent lamp wiring from being disconnected from a lamp. Additionally, the LCD apparatus is easily handled, dissipates heat effectively, and has a light weight.",
            "BACKLIGHT ASSEMBLY, LIQUID CRYSTAL DISPLAY APPARATUS HAVING THE SAME AND DEVICE FOR FORMING A PARTICLE INTERCEPTOR IN THE BACKLIGHT ASSEMBLY - To prevent particles from infiltrating into a display apparatus, a liquid crystal display panel supporting member includes a first particle interceptor and a second interceptor. The first particle interceptor is formed along the top face of the first supporting member frame portion facing a bottom plate of a liquid crystal display panel that is to be mounted on the liquid crystal display panel supporting member. The first particle interceptor has at least two cut portions. The second particle interceptor is disposed between the cut portions to prevent particles from infiltrating into the first particle interceptor. Thus, the liquid crystal display apparatus may prevent deterioration of its display quality.",
            "LIQUID CRYSTAL DISPLAY AND ASSEMBLY THEREOF - The present invention is broadly directed towards a receiving container for an LCD apparatus for securing a lamp and lamp wiring connected to a lamp. The receiving container has features for substantially preventing the lamp wiring from being disconnected from the lamp. For example, a first through-hole for receiving the lamp wiring, a first trench, securing members, and securing projections are utilized to substantially prevent lamp wiring from being disconnected from a lamp. Additionally, the LCD apparatus is easily handled, dissipates heat effectively, and has a light weight."
        ],
        [
            "Published",
            "04-22-2010",
            "09-23-2010",
            "05-26-2011"
        ]
    ],
    "pageTitle": "Ok, KR - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ok-kr-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441297887,
    "recordOffset": 441275398,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jung-Soo Ok, Yongin-Si KR 10-21-2010 DISPLAY APPARATUS - A display apparatus includes a display panel receiving a light to display an image in response to a driving signal, a driving circuit board applying the driving signal to the display panel, a backlight unit disposed under the display panel to provide the light to the display panel, a bottom chassis including a first chassis member and a second chassis member to receive the backlight unit after coupling the first chassis member to the second chassis member, and a top chassis disposed on the display panel and coupled to the bottom chassis in accordance with an embodiment. The driving circuit board is mounted on a rear surface of the bottom chassis, and the first and second chassis members are overlapped with each other in a region in which the driving circuit board is positioned. 20100265426 Published Description Patent application number Jungsoo Ok, Suwon-Si KR 11-26-2009 PURE TONE AUDIOMETER WITH AUTOMATED MASKING - The present invention relates to a pure tone audiometer, and more particularly, to a pure tone audiometer with automated masking which is capable of automatically performing air-conduction and bone-conduction hearing tests and automatically performing a masking test, if necessary, so that a person obtains an accurate pure tone hearing threshold without others' assistance. The pure tone audiometer of the present invention can accurately perform the pure tone hearing test with automated masking without assistance from",
    "textAfterTable": "Patent applications by Jung-Soo Ok, Yongin-Si KR Jung-Soo Ok, Suwon-Si KR Patent application number Description Published 20100188595 BACKLIGHT ASSEMBLY AND LIQUID CRYSTAL DISPLAY - A backlight assembly and a liquid crystal display which may provide improved reliability are disclosed, in accordance with embodiments of the present invention. The backlight assembly includes, in one embodiment, a light guide plate guiding light, and a lamp unit positioned on one side of the light guide plate. The lamp unit includes first and second lamps extending in parallel to each other in a first direction, and a first holder having a body fixing the first and second lamps and a projection part projected from the body and between the first and second lamps. The backlight assembly includes a lower receptacle accommodating the light guide plate and the lamp unit therein. 07-29-2010 Jung-Soo Ok, Asan-Si KR Patent application number Description Published 20110037920 DISPLAY DEVICE - A display device including a display panel which displays images, an intermediate frame on which the display panel is seated, a lower receptacle which includes a first receiving portion including a bottom plate and sidewalls, and a second receiving portion",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}