{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex, Discover",
            "Cash on pickup"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Cadence-CSX-12-Mark-II-Active-Powered-450-Watt-Subwoofer-/221399367663?pt=Speakers_Subwoofers&hash=item338c6e3fef",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410966651,
    "recordOffset": 410925130,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details Any items returned for a refund are subject to a 15% restocking fee. Buyer pays shipping costs to and from. All items must be returned to seller before a replacement or refund will be given. Any parts missing (harness, cables, etc) or damages caused by the purchaser will be deducted from the refund. All merchandise must be in new and sellable condition. The Item will be inspected and/or tested before replacement or refund. Warranty period is active from date of sale. Any Returns after 14 days of Purchase are exchange only. Return policy details The buyer is responsible for return shipping costs. Money back or replacement (buyer's choice) 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions Free shipping USA continental only please contact us to quote price for you Ak, Vi, HI, Puerto Rico, Guam. time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids Approximately: Current bid amount Approximately:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}