{
    "relation": [
        [
            "Patent application number",
            "20120020956",
            "20130310542",
            "20130344566",
            "20130345407",
            "20140221609"
        ],
        [
            "Description",
            "ACTIVATION OF SODIUM POTASSIUM ATPASE - Activation sites on the alpha subunit of sodium potassium ATPase have been discovered. It has also been discovered that certain antibodies that bind to the alpha subunit of sodium potassium ATPase dramatically increase enzyme activity. There has never before been a report of precise activation sites or drug interaction sites for sodium potassium ATPase. Certain methods have also been discovered for treating or preventing diseases associated with low sodium potassium ATPase activity by administering antibodies, antibody fragments and small molecules that bind to the activation sites on the alpha subunit of sodium potassium ATPase.",
            "Inotropic Effects of Antibodies on Cardiac Contraction - The present invention shows that site-specific antibodies to the (Na",
            "Inotropic Antibodies And Therapeutic Uses Thereof - Antibodies binding to sites on the alpha-subunit of the (Na",
            "Activation of Sodium Potassium ATPase - Activation sites on the alpha subunit of sodium potassium ATPase have been discovered. It has also been discovered that certain antibodies that bind to the alpha subunit of sodium potassium ATPase dramatically increase enzyme activity. There has never before been a report of precise activation sites or drug interaction sites for sodium potassium ATPase. Certain methods have also been discovered for treating or preventing diseases associated with low sodium potassium ATPase activity by administering antibodies, antibody fragments and small molecules that bind to the activation sites on the alpha subunit of sodium potassium ATPase.",
            "Activation of Sodium Potassium ATPase - Activation sites on the alpha subunit of sodium potassium ATPase have been discovered. It has also been discovered that certain antibodies that bind to the alpha subunit of sodium potassium ATPase dramatically increase enzyme activity. There has never before been a report of precise activation sites or drug interaction sites for sodium potassium ATPase. Certain methods have also been discovered for treating or preventing diseases associated with low sodium potassium ATPase activity by administering antibodies, antibody fragments and small molecules that bind to the activation sites on the alpha subunit of sodium potassium ATPase."
        ],
        [
            "Published",
            "01-26-2012",
            "11-21-2013",
            "12-26-2013",
            "12-26-2013",
            "08-07-2014"
        ]
    ],
    "pageTitle": "Xu, MD - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/xu-md-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448481231,
    "recordOffset": 448456311,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kai Yuan Xu, Cockeysville, MD US 12-29-2011 INOTROPIC ANTIBODIES AND THERAPEUTIC USES THEREOF - Antibodies binding to sites on the alpha-subunit of the (Na 20110318826 Published Description Patent application number Kai Y. Xu, Cockeysville, MD US 08-02-2012 SODIUM PUMP ANTIBODY AGONISTS AND METHODS OF TREATING HEART DISEASE USING THE SAME - Antibodies that are agonists of sodium pump (Na 20120195886 Published Description Patent application number Kai Xu, Cockeysville, MD US 03-22-2012 Compositions and Methods Using siRNA Molecules and siRNA Cocktails for the Treatment of Breast Cancer - The present invention provides small interfering RNA (siRNA) molecules, compositions containing the molecules, and methods of using the molecules and compositions to treat breast cancer. In one aspect, a multi-targeted siRNAi cocktail is disclosed. The siRNA molecules may be encapsulated in nanoparticles to further enhance their anti-cancer activity. The compositions may also be used in combination with other anti-cancer agents, such as bevacizumab. 20120071540 Published Description Patent application number Jun John Xu, Germantown, MD US 12-26-2013 siRNA Compositions and Methods for Treatment of HPV and Other Infections - The invention provides siRNA compositions that (1) interfere with viral replication of human papillomavirus (HPV), herpes simplex virus (HSV), and human immunodeficiency virus (HIV) in mucosal tissues, such as genital tissues, and (2) treat fungal infections. The compositions",
    "textAfterTable": "Patent applications by Kai Yuan Xu, Cockeysville, MD US Kang Xu, North Potomac, MD US Patent application number Description Published 20100129721 Electrolyte formulations for wide temperature lithium ion batteries - A non-aqueous rechargeable electrochemical cell includes an electrolyte composition produced through the dissolution of a thermally stable lithium salt in a lactone solvent. The resulting cell has stable performance in a wide temperature range between −40° C. and 80° C. The resulting cell operates across this wide temperature range with a commercially acceptable capacity retention, power loss characteristics, and safety characteristics across this temperature range. 05-27-2010 20120009485 ELECTROLYTES IN SUPPORT OF 5V LI ION CHEMISTRY - This invention described the preparation of a series of compounds that can be used as co-solvents, solutes or additives in non-aqueous electrolytes and their test results in various electrochemical devices. The inclusion of these novel compounds in electrolyte systems can enable rechargeable chemistries at high voltages that are otherwise impossible with state-of-the-art electrolyte technologies. These compounds are so chosen because of their beneficial effect on the interphasial chemistries formed at high potentials, such as 5.0 V class cathodes for new Li ion chemistries. The potential application of these compounds goes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}