{
    "relation": [
        [
            "Patent application number",
            "20080230099",
            "20100008824",
            "20100032329",
            "20100116300",
            "20100116841",
            "20110197921",
            "20110220116",
            "20110220118",
            "20110220119",
            "20120117792",
            "20120125377",
            "20120255555"
        ],
        [
            "Description",
            "Stethoscope cleaning assembly - An assembly structured to clean the head portion of a stethoscope comprising a housing including a path of travel along which the head portion passes during cleaning. A supply of cleaning fluid is associated with a dispensing assembly which is cooperatively disposed relative to an activating assembly. The activating assembly is manually operated due to moveable engagement with the head portion as it travels along the path of travel. The activating assembly is thereby operatively positioned to activate the dispenser assembly when engaged by the head portion as it passes along the path of travel. The dispensing assembly delivers the cleaning fluid to an applicator assembly which distributes the cleaning fluid to the head portion and facilitates the cleaning thereof and removal of excess cleaning fluid there from.",
            "Retaining clip for reagent test slides - A retaining clip for retaining reagent test slides in a stacked arrangement is formed as a unitary member and has first, second and third plates, each having an inner surface and an outer surface. The inner surface of the first plate pivots towards the inner surface of the second plate, and the inner surface of the third plate also pivots such that the inner surfaces of the first and third plates at least partially face each other upon pivoting. The inner surfaces of the first and third plates are separated by a distance to accommodate the reagent test slides in a stacked arrangement. Alternatively, the third and second plates can be fixed rigidly to each other with only the first plate pivoting to at least partially face the third plate upon pivoting.",
            "PACKAGING, SHIPPING AND STORAGE DEVICE FOR CAPILLARY TUBES - Capillary tube holder, a storage and shipping container in which a loaded capillary tube holder is securely held, a fixture for loading capillary tubes onto a capillary tube transfer fixture for transferring, removing or replacing individual capillary tubes from a loaded capillary tube holder.",
            "Stethoscope cleaning assembly - An assembly structured to clean the head portion of a stethoscope comprising a housing including a path of travel along which the head portion passes during cleaning. A supply of cleaning fluid is associated with a dispenser assembly which is cooperatively disposed relative to an activating assembly. The activating assembly is manually operated due to moveable engagement with the head portion as it travels along the path of travel. The activating assembly is thereby operatively positioned to activate the dispenser assembly when engaged by the head portion as it passes along the path of travel. The dispenser assembly delivers the cleaning fluid to an applicator assembly which distributes the cleaning fluid to the head portion and facilitates the cleaning thereof and removal of excess cleaning fluid there from. At least one disinfectant agent is dispersed within or comprises a portion of said housing and is formulated to be destructively effective against pathogenic bacteria which is generally not affected by the cleaning fluid.",
            "Stethoscope cleaning assembly - An assembly structured to restrict contamination of individuals from association with the heads of stethoscope comprising a housing including a path of travel along which the head portion passes. Different embodiments include the dispensing of cleaning fluid or the delivery of protective barriers onto predetermined portions of the stethoscope heads, while passing along the path of travel. A dispenser assembly and a cooperatively disposed activating assembly are manually operated by moveable, driving engagement with the head portion passing through the housing. The activating assembly is thereby operatively positioned to activate the dispenser assembly when engaged by a head passing along the path of travel. Differently structured dispenser assemblies function to either deliver the cleaning fluid or individually dispense the barriers onto different heads, so as to either facilitate the cleaning or protective covering of exposed surfaces of the stethoscope heads, dependent on the embodiment utilized.",
            "Stethoscope disinfection monitoring and reporting system - A stethoscope disinfection monitoring and reporting system structured and configured to track, monitor and report the cleaning, disinfecting, and/or sterilizing of the head portion of a stethoscope is presented. The system comprises a stethoscope cleaning assembly cooperatively structured and configured to clean the head portion of the stethoscope, for instance, via the application of a cleaning fluid or solution thereto. The system further comprises a monitoring device and a cooperatively structured and disposed reader assembly. The monitoring device may be unique to, or otherwise serve to identify, the stethoscope. The reader assembly is structured and disposed to detect, identify, and record data pertaining to the monitoring device and/or stethoscope upon cleaning the head portion, or otherwise upon disposition of the head portion into a cleaning relation with the stethoscope cleaning assembly.",
            "Inflation and monitoring assembly for a pressure cuff of an endotracheal tube - An assembly structured to inflate a retaining or pressure cuff associated with an artificial airway tube and concurrently monitor pressure therein. A pump assembly is structured to force fluid flow to the retaining cuff, for inflation, through a pressure chamber within a casing of the assemblies. An indicator member is observable through a casing window and is variably positionable dependent on and indicative of existing pressure within the retaining cuff. Existing pressure within the pressure chamber is substantially equivalent to that within the retaining cuff and is thereby indicative of pressure within the retaining cuff. A junction may be disposed in removable interconnecting relation between the casing and an inflation lumen and be structured to prevent reconnection there between.",
            "Inflation and monitoring assembly for a pressure cuff of an endotracheal tube - An assembly structured to inflate a retaining or pressure cuff of the type associated with an artificial airway tube such as an endotracheal tube and/or tracheostomy tube and concurrently monitor pressure therein including a casing having a pressure chamber on its interior. A pump assembly is movably connected to the casing and structured to force fluid flow to the retaining cuff, for inflation, through said pressure chamber. An indicator member is disposed within the casing and is visually accessible through casing window, wherein the indicator member is variably positionable dependent on and indicative of existing pressure within the retaining cuff. The existing pressure within the pressure chamber is substantially equivalent to that within the retaining cuff thereby facilitating the variable position of the indicator member to be indicative of pressure within the retaining cuff. A junction is disposed in interconnecting relation between the casing and an inflation lumen to the restraining cuff and is structured to allow disconnection between the casing and the lumen but prevent reconnection thereto.",
            "INFLATION AND MONITORING ASSEMBLY FOR A PRESSURE CUFF - An assembly structured to inflate a retaining or pressure cuff of a medical device including of the type associated with an artificial airway tube such as an endotracheal tube and/or tracheostomy tube and concurrently monitor pressure therein including a casing having a pressure chamber on its interior. A pump assembly is movably connected to the casing and structured to force fluid flow to the retaining cuff, for inflation, through said pressure chamber. An indicator member is disposed within the casing and is visually accessible through the casing window, wherein the indicator member is variably positionable dependent on and indicative of existing pressure within the retaining cuff. The existing pressure within the pressure chamber is substantially equivalent to that within the retaining cuff thereby facilitating the variable position of the indicator member to be indicative of pressure within the retaining cuff. A junction may be disposed in interconnecting relation between the casing and an inflation lumen to the retaining cuff and is structured to allow disconnection between the casing and the lumen but prevent reconnection thereto.",
            "ASSEMBLY FOR DELIVERING PROTECTIVE BARRIERS ONTO STETHOSCOPE HEADS - An assembly structured to restrict contamination of individuals from association with the heads of stethoscope comprising a housing including a path of travel along which the head portion passes. Different embodiments include the dispensing of cleaning fluid or the delivery of protective barriers onto predetermined portions of the stethoscope heads, while passing along the path of travel. A dispenser assembly and a cooperatively disposed activating assembly are manually operated by moveable, driving engagement with the head portion passing through the housing. The activating assembly is thereby operatively positioned to activate the dispenser assembly when engaged by a head passing along the path of travel. Differently structured dispenser assemblies function to either deliver the cleaning fluid or individually dispense the barriers onto different heads, so as to either facilitate the cleaning or protective covering of exposed surfaces of the stethoscope heads, dependent on the embodiment utilized.",
            "STETHOSCOPE CLEANING ASSEMBLY - An assembly structured to clean the head portion of a stethoscope comprising a housing including a path of travel along which the head portion passes during cleaning. A supply of cleaning fluid associated with a dispenser assembly is cooperatively disposed relative to an activating assembly. The activating assembly is operated in moveable engagement with the head portion, and activates the dispenser assembly when engaged by the head portion as it passes along the path of travel. The dispenser assembly delivers the cleaning fluid to an applicator assembly which distributes the cleaning fluid to the head portion and facilitates the cleaning thereof and removal of excess cleaning fluid there from. At least one disinfectant agent is dispersed within or comprises a portion of the housing and is formulated to be destructively effective against pathogenic bacteria, such as in the spore form, which is generally not affected by the cleaning fluid.",
            "INFLATION AND MONITORING ASSEMBLY FOR A PRESSURE CUFF - An assembly structured to inflate a retaining or pressure cuff of a medical device of the type associated with artificial airway tube and concurrently monitor pressure therein. A pump assembly is movably connected to a casing and structured to force fluid flow, for inflation of a pressure chamber of the casing. An indicator member is visually accessible through a casing window and is variably positionable dependent on and indicative of existing pressure within the retaining cuff. The existing pressure within the pressure chamber is substantially equivalent to that within the retaining cuff thereby facilitating the variable position of the indicator member being indicative of pressure within the retaining cuff. A junction between the casing and an inflation lumen is structured to allow disconnection and prevent reconnection between the casing and the lumen."
        ],
        [
            "Published",
            "09-25-2008",
            "01-14-2010",
            "02-11-2010",
            "05-13-2010",
            "05-13-2010",
            "08-18-2011",
            "09-15-2011",
            "09-15-2011",
            "09-15-2011",
            "05-17-2012",
            "05-24-2012",
            "10-11-2012"
        ]
    ],
    "pageTitle": "Sellers, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sellers-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436711391,
    "recordOffset": 436679738,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James M. Sellers, Portsmouth, NH US 05-03-2012 HAND OPERATED DEVICE FOR CONTROLLED DEPLOYMENT OF A TISSUE ANCHOR AND METHOD OF USING THE SAME - A tissue anchoring system includes a tissue anchor member that is suitable for anchoring against tissue. The system also includes a tensioning member operatively connected to the anchor member such that the anchor member can slide relative to the tensioning member, the tensioning member capable of being pulled to cause the anchor member to move relative to the tensioning member into a position seated against the tissue. A hand operated deployment catheter is operable to extend and deploy the anchor member therefrom. The deployment catheter includes a rotatable member about which the tensioning member is routed and a clutch assembly for limiting tension within the tensioning member to prevent the deployed anchor from being pulled through the tissue. 20120109155 03-22-2012 ATTACHING A LINE TO A SURFACE - Among other things, a communication line is attached along a target surface of a building by laying out the line from a tool. An outer surface of the line is in a temporarily tacky condition as the line is laid out along the surface. The line is in the temporarily tacky condition based at least in part on an adhesive component having been pre-applied to the outer surface of the line. The line becomes non-tacky after it has been attached. 20120066987 06-11-2009 Stethoscope cleaning assembly - An assembly structured",
    "textAfterTable": "Patent applications by James M. Sellers, Portsmouth, NH US Jayson Sellers, Flower Mound, TX US Patent application number Description Published 20140068486 CONNECTED HOME USER INTERFACE SYSTEMS AND METHODS - Exemplary connected home user interface systems and methods are disclosed. An exemplary method includes a user interface subsystem communicatively coupled to a home monitor and control subsystem providing a graphical user interface view for display on a display screen, the graphical user interface view including a graphical representation of a floor plan of a home associated with the home monitor and control subsystem and a graphic representing an element of the home monitor and control subsystem, wherein the graphic is positioned relative to the graphical representation of the floor plan in the graphical user interface view to visually indicate a location of the element at the home. Corresponding methods and systems are also disclosed. 03-06-2014 Jayson Sellers, Carrollton, TX US Patent application number Description Published 20100274865 TRAVEL TIME DEPENDENT NOTIFICATION SYSTEM - A computer-readable medium may include computer-executable instructions. The computer-executable instructions may include instructions for identifying an event that is scheduled to be attended by a user, determining",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}