{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "512.63",
            "501.81",
            "509.06",
            "529.47"
        ],
        [
            "NSE",
            "513.30",
            "502.67",
            "509.40",
            "529.84"
        ]
    ],
    "pageTitle": "Godfrey Phillips India Stock Price, Share Price, Live BSE/NSE, Godfrey Phillips India Bids Offers. Buy/Sell Godfrey Phillips India news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/cigarettes/godfreyphillipsindia/GPI?sc_did=GPI",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 587618855,
    "recordOffset": 587567589,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135139=JSWSteel Jul Fut, 133921=28 July 2015, 134432=UnitedBrewerie Jul Fut, 214389=Zensar Technologies Recommended on Mar 24th 2015, 215700=Godfrey Phillip is in the Cigarettes sector. The current market capitalisation stands at Rs 2,920.50 crore. The company management includes R A Shah - Chairman, K K Modi - President & Managing Director, R Ramamurthy - Whole Time Director, Samir Kumar Modi - Executive Director, Lalit Bhasin - Director, Anup N Kothari - Director, Bina Modi - Additional Director, AtuI Kumar Gupta - Addnl.Non Exe.Independent Director. It is listed on the BSE with a BSE Code of 500163 and the NSE with an NSE Code of GODFRYPHLP. Its Registered office is at Macropolo Building, Ground Floor, Next to Kala Chowky Post Office,,Dr. Babasaheb Ambedkar Road, Mumbai,Maharashtra - 400033. Their Registrars are Sharepro Services (India) Pvt.Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}