{
    "relation": [
        [
            "Pokemon",
            "Venipede",
            "Sandile",
            "Reward:"
        ],
        [
            "Level",
            "21",
            "21",
            "$504"
        ],
        [
            "Type",
            "Bug/Poison",
            "Ground/Dark",
            ""
        ]
    ],
    "pageTitle": "Pokemon White Version 2 FAQ/Walkthrough for DS by RedIsPoetic - GameFAQs",
    "title": "",
    "url": "http://www.gamefaqs.com/ds/661227-pokemon-white-version-2/faqs/64482?page=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 457279119,
    "recordOffset": 457249008,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132561=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use}",
    "textBeforeTable": "Trainer Battle: Worker Zack Head south until you reach the stairs leading up west. Move up them and grab the X Sp. Def from the platform above. Move back down the stairs and head south, then west. Keep going until you reach the point where there is a path leading north and another south. The south one's a dead end, so head north, moving up the stairs when you come upon them. Near the top of the stairs you'll find a Worker. Head down the steps to your north. Now follow the path west until you come upon two sets of stairs. As you may as well make the most of teaming up with Hugh, it's better to take the south set of stairs first and explore all that you can before heading up the north set. Therfore, move up the southern set. Once you reach the top, you'll see a person to your west who will stop you from moving past him until you defeat the Team Plasma Grunts in the Sewers. Don't worry about him just yet and head south instead. When you see a thin set of stairs leading down to the area below, move down them. Castelia City Sewers - Autumn or Winter Main Walkthrough (Continued) Final Word Credits Contact Me Legal Notice Version History Item List - Key Items Item List - TMs & HMs",
    "textAfterTable": "Trainer Battle: Doctor Heath Pokemon Level Type Sewaddle 17 Bug/Grass Reward: $1020 From now on, anytime that you talk to the Doctor that you just defeated, he will heal your Pokemon. As your Pokemon already automatically heal between battles because you're travelling with Hugh, there's little need for this though. Move right, past the door. You'll notice another item on the ground. Move over and pick it up. It's some Leftovers. Now enter the door that you just moved past. Inside, a scientist will give you a random healing item from a small range of possible ones. You can return here once per day to receive another. Once you're received it, leave the room. Backtrack past the Worker and head down the steps near him. Now continue on north, then east. You'll reach some stairs. Move up them and take on the nearby Scientist. Trainer Battle: Scientist Caroline Pokemon Level Type Grimer 17 Poison Reward: $816 There's nothing in the room next to her, so head back down the steps, then head west, south, east and finally north until you reach the steps that you first came down. Continue south along the path here until you reach the Janitor. Battle",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}