{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have always felt safe at De Anza. Cupertino is generally a safe neighborhood. I do not believe any violent activity has happened at De Anza for the past three years I have been here.",
            "There are many clubs on campus. On club day you will witness multiple clubs circling in front of the library. You will definitely find something you are interested in.",
            "The cafeteria is always filled with an exciting, college atmosphere. There is nothing really unusual about the campus. It is beautiful.",
            "There is a $5 movie theater across the street at The Oaks shopping center, as well as many food vendors around the area.",
            "De Anza has many clubs and activities on campus. There is the flea market the first Saturday of every month, $5 movies across the street at the Oaks, and many food vendors around the block.",
            "The food at De Anza was good. I especially liked the salad and the curly fries. The prices were a bit high, but reasonable.",
            "The courses at De Anza are challenging enough to prepare me for my four year college.",
            "Be sure to leave your house early enough to get parking during the first week of class. Be sure to study throughout the quarter so you do not kill yourself towards the end. Also talk to a counselor so you do not waste your time and money.",
            "De Anza College provided the right education for me for the past three years. The teachers helped me by providing challenging life lessons and the counselors have been a big help by advising what classes to take. De Anza was the perfect community college to prepare me for my next college experience."
        ]
    ],
    "pageTitle": "De Anza College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/De-Anza-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00104-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912988123,
    "recordOffset": 912921123,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{327685=In the past year, there were a few reports of sexual assault on campus. All the students in fall 2013 received emails about the first report, but I'm not sure if the suspects were caught. That obviously does not make me feel safe. However, if you are scared to walk to your class in the evening (or any time), you can call the police station on campus and they can drive you to your classroom via their police golf cart., 64075=If you are an early bird, sign up for 7:30 or 8:30AM classes. You will be able to have your choice of parking spaces. If you wait until 9:30, it will be harder to find parking, and you will end up having to leave the house earlier to get to class on time anyways. Be to your classes (and ON TIME) on the first day. If you aren't you can and probably will be dropped (yes, even if your late they can drop you). If you are waitlisted, still go to class for that week, even if the teacher keeps telling you they aren't adding anyone. Many students don't show up the 1st day, or drop it after a few days, which bumps you up., 66021=There is a ton of school spirit when it comes to current events, fundraisers, clubs, etc. Right now we are having the Walk a Mile in her Shoes march, and almost everyone in my classes is signed up and attending it. The same thing happened for the March on March 4th at the capitol (supporting teachers and school funding)., 329301=On campus food is actually pretty delicious, but at peak lunch hours (11:30 - 1:30pm), there'll be really long lines at the food court. Whether you are on a diet or not, the salads are to die for. There's an Â¡UnaMas! and asian styled food stations if you're looking for some variety and it's located in between the food court and the dining hall. De Anza also has two coffee shops on campus, but I prefer the Le Cafe that's downstairs. It's quieter than the dining area and they supply multiple power strips. Off campus food can be easily be found across from De Anza. There's ToGo's, Quickly, Jamba Juice, Coffee Society, Panda Express, and Hawaiian BBQ. Again, at peak lunch hours, it can get really crowded. Be patient., 339197=Many students at De Anza are eager to learn. I have been to De Anza's on-campus tutoring during the summer quarter of 2014, and the students in my psychology class were very motivated to understand the material., 316822=This California campus located in the heart of Silicon Valley boasts an extremely diverse student population. It is the number one California Community College of 2013, and for good reasons too. Come check us out, and see why our motto is Just what you need!, 357297=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 84 Diana from San Jose, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Tips for prospective students Register early! It's important to register at 5am on your chosen registration date. I know it sounds early but it's really important because it can make the difference between getting a class or not. Make sure to check the availability of the classes you want ahead of time so when registration comes, you won't be freaked out about what class you will take if you can't get the one you want. Also, be sure to sign into the MyDeAnza portal to register at around 4:45am because there are thousands of students signing on at the same time. Don't waste time. Make sure to take at least 15 transferable units a quarter so you don't get behind. There are many students who don't take enough units when they first start and they end up staying an extra year because of it. Don't make the same mistake! Meet with a counselor if you're confused because they are there to help. Do take the time to meet people in your classes. They can help with your coursework and help make the time go by faster when in class. And who knows, maybe they'll turn out to be a new friend! Do apply for financial aid. I qualified for the BOG fee waiver and had all my registration fees paid for me my first year. Definitely worth applying. Don't slack off. This is not anything like high school. If you screw up, your grades",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}