{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $4.99"
        ],
        [
            "Each additional item",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated within 2-7 business days",
            "Estimated within 2-5 business days"
        ]
    ],
    "pageTitle": "www.pristinejewelers.com",
    "title": "",
    "url": "http://www.ebay.ca/itm/Black-Silver-Tungsten-Carbide-Wedding-Band-Promise-Ring-Men-Brushed-Center-NEW-/321263485545?pt=US_Wedding_Bands_without_Stones&var=&hash=item4acccbc269",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427968663,
    "recordOffset": 427914016,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 388 items available. Please enter a number less than or equal to 388. -Select- Australia Austria Belgium Bulgaria Canada Cyprus Denmark Finland Germany Ireland Netherlands New Zealand Norway Sweden United Kingdom United States Change country: Quantity: Excludes: Africa, Asia, Central America and Caribbean, Middle East, Southeast Asia, South America, Bermuda, Greenland, Mexico, Saint Pierre and Miquelon, Albania, Andorra, Belarus, Bosnia and Herzegovina, Croatia, Republic of, Czech Republic, Estonia, France,",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money back or item exchange (buyer's choice) The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}