{
    "relation": [
        [
            "Part #",
            "CR6220-150-5",
            "CR6240-500-20",
            "CR4110S-5",
            "LT 1005-S",
            "2814650"
        ],
        [
            "Distributor",
            "Digi-Key",
            "Digi-Key",
            "Digi-Key",
            "Digi-Key",
            "Digi-Key"
        ],
        [
            "Manufacturer",
            "CR Magnetics Inc",
            "CR Magnetics Inc",
            "CR Magnetics Inc",
            "LEM USA Inc",
            "Phoenix Contact"
        ],
        [
            "Product Category",
            "Sensors, Transducers",
            "Sensors, Transducers",
            "Sensors, Transducers",
            "Sensors, Transducers",
            "Sensors, Transducers"
        ],
        [
            "Description",
            "TRANSDUCER AC 4-20MA OUT 1 PHASE",
            "TRANSDUCER AC 4-20MA OUT 3 PHASE",
            "TRANSDUCER SPLIT CORE 0-5AAC IN",
            "CURRENT TRANSDUCER 1000A",
            "MCR CURRENT TRANSDUCER"
        ]
    ],
    "pageTitle": "Current Transducer | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/current_transducer",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466574991,
    "recordOffset": 466541734,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{108907=Description: The Model 2780 AC Current Transducer is designed to accept an AC current input, and provide a proportional DC voltage output. A linear transformer input is coupled to a solid-state output amplifier. The Model 2780 is powered by a 115 VAC source, and is socket-mounted for ease of use. Model 2780, 60854=Description: Topic(s) : Power, Energy, & Industry Applications Status : Active E-ISBN : 0-7381-4698-6 Print ISBN: 0-7381-4697-8 Digital Object Identifier : 10.1109/IEEESTD.2005.339575 Persistent Link: http://ieeexplore.ieee.org/servlet/opac?punumber= 4140799 More » Year : 2005 Date of Current Version : 04, 24743=Description: Description: The 2469 and 2489 Power Factor transducers have an analog output corresponding to 1-Cosine of the phase angle of the input current relative to the input voltage signal. The analog output will indicate leading or lagging Power Factor by its direction from center which would either be 0, 117837=Description: Features and Applications: 2200 Volt line-to-output isolation DC to 1000 Hertz response Bi-directional operation Availible in split-core configurations, except Model 51 Response time less than 100 microSeconds Output is proportional in direction and magnitude to the current flow through}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top TRUE RMS MEASURING vs. AVERAGE ABSOLUTE MEASURING CURRENT AND VOLTAGE TRANSDUCERS The most popular voltage and current transducers and meters actually measure the average absolute value of the voltage or current and are calibrated for the RMS value for a sine wave. input. Understanding the Importance of Transducer Orientation When monitoring vibration on large gas or steam turbines and generators with fluid-film bearings, the relative movement of the shaft within the bearing is typically measured by a pair of shaft proximity (eddy current) transducers. Data from these transducers is used to produce a variety of plots Should You Use Current or Voltage in Analog Transducer Readings? Several instrumentation monitoring applications including equipment monitoring, quality assurance and others require you to choose among the different signal types for your analog measurement transducer. The most common of these are either voltage (0-5 volts DC, or 0-10 volts DC) or current Understanding Current Sinking, Current Sourcing, and Ground Loops You've just purchased some current to pneumatic transducers and are ready to try them. Each transducer has been carefully installed according to the manufacturer's recommendations and wired to its own 4-20 mA analog",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}