{
    "relation": [
        [
            "Play Type",
            "Walk",
            "Single",
            "Double",
            "Out",
            "Fielders-choice",
            "Out",
            "Substitution",
            "Error-passed-ball",
            "Out"
        ],
        [
            "Play",
            "J.D. Drew walked. Runner on first with none out and Dustin Pedroia due up.",
            "Dustin Pedroia singled to right. Runners on first and second with none out and Adrian Gonzalez due up.",
            "Adrian Gonzalez doubled to right scoring J.D. Drew. Runners on second and third with none out and Marco Scutaro due up.",
            "Marco Scutaro reached first on a fielder's choice. On the play, Adrian Gonzalez was tagged out at third from second. Runners on first and third with one out and Darnell McDonald due up.",
            "Darnell McDonald reached first on a fielder's choice to third. Bases loaded with one out and Jed Lowrie due up.",
            "Jed Lowrie's sacrifice fly to center scored Dustin Pedroia. Runners on first and second and with two outs and Carl Crawford due up.",
            "Jason Bulger enters the game for the Angels with runners on first and second and two outs.",
            "Marco Scutaro advanced to third and Darnell McDonald advanced to second on a passed ball. Runners on second and third and with two outs and Carl Crawford at the plate.",
            "Carl Crawford struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Thursday, April 21, 2011 Boston Red Sox - Los Angeles Angels Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/redsox_angels/2011/04/21",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60211395,
    "recordOffset": 60202517,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2356=View all MLB box scores for 4/21/2011}",
    "textBeforeTable": "Top of the 1st Dan Bellino  3B Tony Randazzo  2B Larry Vanover  1B Brian Gorman  H Umpires 1.23 4 5 1 0 0 0 0 0.1 Jason Bulger  3.48 25 34 3 1 2 2 2 1.2 Rich Thompson (L, 0-1) 0.00 5 12 0 1 0 0 0 1 Jordan Walden  2.08 11 26 1 2 0 0 0 1 Fernando Rodney  4.15 13 24 2 2 0 0 0 1 Hisanori Takahashi  3.50 59 103 3 5 2 2 6 6 Tyler Chatwood  ERA Strikes Pitches SO BB ER R H IP Name 2.45 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Angels pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/angels_22t.png 14 18 1 0 0 0 1 1 Jonathan Papelbon (S, 4) 7.11 8 10 0 0 0 0 0 1 Bobby Jenks (W, 1-1) 4.82 6 9 1 0 0 0 0 1 Daniel Bard  1.93 79 125 5 2 2 2 3 8 Josh Beckett  ERA Strikes Pitches SO BB ER R H IP Name Double plays: Mark Trumbo 1, Erick Aybar 1 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Red Sox pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/redsox_22t.png",
    "textAfterTable": "Top of the 2nd Play Type Play Double David Ortiz doubled to right. Runner on second with none out and Jed Lowrie due up. Out Jed Lowrie grounded out second to first. Runner on third with one out and Carl Crawford due up. Out Carl Crawford grounded out to first. Runner on third with two outs and Jason Varitek due up. Out Jason Varitek struck out swinging to end the inning. Bottom of the 2nd Play Type Play Substitution Marco Scutaro is playing shortstop and batting 4th and Jed Lowrie is playing third base for the Red Sox. Out Torii Hunter grounded out second to first. None on with one out and Vernon Wells due up. Out Vernon Wells lined out to short. None on with two outs and Hank Conger due up. Out Hank Conger grounded out to first to end the inning. Top of the 3rd Play Type Play Out Jacoby Ellsbury grounded out second to first. None on with one out and J.D. Drew due up. Out J.D. Drew popped out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}