{
    "relation": [
        [
            "Home Loan",
            "Online Home Loan",
            "Complete Variable Home Loan (Various rate tiers apply)",
            "Complete Fixed Home Loan 1 year",
            "Complete Fixed Home Loan 2 year (for owner occupiers#)",
            "Complete Fixed Home Loan 2 year (for investment purposes)",
            "Complete Fixed Home Loan 3 year",
            "Complete Fixed Home Loan 4 year",
            "Complete Fixed Home Loan 5 year",
            "Complete Equity Loan (Various rate tiers apply)",
            "Premium Select Home Loan (Various rate tiers apply)",
            "Double Deal Home Loan",
            "Fixed Rate Home Loan 1 year",
            "Fixed Rate Home Loan 2 year (for owner occupiers#)",
            "Fixed Rate Home Loan 2 year (for investment purposes)",
            "Fixed Rate Home Loan 3 year (for owner occupiers#)",
            "Fixed Rate Home Loan 3 year (for investment purposes)",
            "Fixed Rate Home Loan 4 year",
            "Fixed Rate Home Loan 5 year",
            "Regular Saver Home Loan",
            "Seniors Equity Release",
            "Mortgage Shredder Home Loan (This is our standard variable rate^)",
            "Super Start Home Loan Intro rate for 3 years* (for owner occupiers#)",
            "Super Start Home Loan Intro rate for 3 years* (for investment purposes)",
            "Rate Cutter Home Loan",
            "Premium Home Loan",
            "Equity Access Home Loan",
            "Lite Home Loan (Reference Rate only)"
        ],
        [
            "Our rate",
            "4.46% p.a.",
            "4.62% p.a.",
            "4.59% p.a.",
            "4.24% p.a.",
            "4.39% p.a.",
            "4.29% p.a.",
            "4.59% p.a.",
            "4.64% p.a.",
            "4.77% p.a.",
            "4.67% p.a.",
            "4.62% p.a.",
            "4.79% p.a.",
            "4.24% p.a.",
            "4.59% p.a.",
            "4.29% p.a.",
            "4.49% p.a.",
            "4.79% p.a.",
            "4.84% p.a.",
            "4.97% p.a.",
            "6.32% p.a.",
            "5.47% p.a.",
            "4.09% p.a.",
            "4.39% p.a.",
            "5.07% p.a.",
            "4.87% p.a.",
            "5.45% p.a.",
            "5.35% p.a."
        ],
        [
            "Comparison rate ##",
            "4.47% p.a.",
            "5.02% p.a.",
            "5.01% p.a.",
            "4.95% p.a.",
            "4.97% p.a.",
            "4.93% p.a.",
            "5.01% p.a.",
            "5.02% p.a.",
            "N/A",
            "4.68% p.a.",
            "4.91% p.a.",
            "5.44% p.a.",
            "5.28% p.a.",
            "5.35% p.a.",
            "5.20% p.a.",
            "5.26% p.a.",
            "5.29% p.a.",
            "5.27% p.a.",
            "5.00% p.a.",
            "6.36% p.a.",
            "5.52% p.a.",
            "5.02% p.a.",
            "5.10% p.a.",
            "4.81% p.a.",
            "4.92% p.a.",
            "N/A",
            "N/A"
        ]
    ],
    "pageTitle": "Current Interest Rates & Fees - Foreign Exchange - Bankwest",
    "title": "",
    "url": "http://www.bankwest.com.au/rates-fees",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 316791212,
    "recordOffset": 316775239,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{71900=© 2015 Copyright Bankwest, a division of Commonwealth Bank of Australia (Bankwest) ABN 48 123 123 124 AFSL / Australian credit licence 234945. All rights reserved.To use this Website, you are required to read the Financial Services Guide (which you agree to be provided by accessing the link). Bankwest is a division of Commonwealth Bank of Australia, which is the product issuer unless otherwise stated. Rates stated are subject to change without notice. Any advice given does not take into account your objectives, financial situation or needs so please consider whether it is appropriate for you. For deposit and payment products, please ensure you read and consider the Product Disclosure Statement (which you agree to be provided through this link) before making any decision about the product(s). For lending products, lending criteria and fees and charges apply. Terms and conditions apply and are available on request., 62437=# Not payable on Platinum Credit Cards. ^ Payable on reissue of lost Credit Card over the entitled two free reissues per year (not applicable to stolen Credit Cards when Police report is filed). * Payable for each statement period that you exceed your credit limit (excludes all cards activated after the 25th of June 2012 and all cards prior to that date which have opted out of going over the limit)., 21669=Rates current as at 3 July 2015 and subject to change., 58187=Introductory rate on eligible purchases is available to new Bankwest Breeze MasterCard customers only who apply and are approved for a Bankwest Breeze MasterCard from 6 July 2015 to 30 September 2015. Introductory rate on purchases excludes cash advances and balance transfers and applies from the date the card is opened, regardless of when any purchase is processed by us. After the introductory period, the standard purchase rate will apply. Introductory rates on balance transfers applies from the date the card is opened and end after the introductory period regardless of when any balance transfer or purchase is processed by us. After the introductory period, the standard rate will apply to balance transfer. Minimum balance transfer amount $500. Only one non-Bankwest-branded credit cards can be balance transferred to Bankwest MasterCards. A Cash Advance Rate of 21.99% p.a. applies to Zero MasterCard, Breeze MasterCard, More MasterCard and Bankwest Qantas MasterCard credit cards. Rates are subject to change. Fees & charges may apply. * Ongoing interest rate applies to purchases and balance transfers. One More MasterCard per customer. ^ Ongoing interest rate applies to purchases and balance transfers. One Bankwest Qantas MasterCard per customer. # Ongoing interest rate applies to purchases and balance transfers. One Breeze MasterCard per customer. $ Ongoing interest rate applies to purchases and balance transfers. One Zero MasterCard per customer., 60857=** The annual fees for Bankwest Platinum Qantas MasterCard® and More Platinum MasterCard® are waived as part of the Complete Home Loan Package, while you remain eligible for the package. + Annual fee is waived for the first year for new applications received and approved from 6 July 2015 to 30 September 2015. Annual fee will apply to applications received outside these dates. Annual fee will be payable after the first year and in subsequent years after the anniversary of the card opening.}",
    "lastModified": "Fri, 31 Jul 2015 02:59:51 GMT",
    "textBeforeTable": "Everyday accounts    # # # Everyday Accounts # # # Top Other products Personal loans Credit cards Home loans Savings & term deposits Everyday accounts What are you looking for? # Rate is for owner occupiers only. Additional margins apply when the loan purpose is for investment purposes. Investment purpose includes but is not limited to, funds for shares, land, construction or an established dwelling (including re-finance of investment loans) for investment purposes. Where a loan contains multiple purposes if any purpose is for investment then you will not be eligible for this rate. N/A variable Hero rate on balances up to $250,000 p.a. % 3.25 Hero Saver   # # # MOST POPULAR - Complete Variable Home Loan # # # p.a. % 5.28 fixed p.a. % 4.24 Fixed Rate Home Loan",
    "textAfterTable": "All balances         0.01% p.a. view more information about rates & fees for this product   Retirement Advantage Account Balance Rate $0 up to $2,000 0.25% p.a. $2,000 up to $48,000 1.75% p.a. $48,000 or more 3.25% p.a. Interest is calculated at the applicable rate on the portion of the balance which falls within each of the tiers. view more information about rates & fees for this product   Student Account Balance Rate $0 to less than $5,000 0.01% p.a. $5,000 to less than $20,000 0.01% p.a. $20,000 to less than $50,000 0.10% p.a. $50,000 or more 0.20% p.a. Interest is calculated at the applicable rate on the portion of the balance which falls within each of the tiers. view more information about rates & fees for this product   Children's Savings Account",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}