{
    "relation": [
        [
            "",
            "StarCraft 2 (2010)",
            "Deus Ex Human Revolution (2011)",
            "Battlefield 3 (2011)",
            "The Elder Scrolls V: Skyrim (2011)"
        ],
        [
            "low",
            "121.77",
            "105.28",
            "34.86",
            "43.24"
        ],
        [
            "med.",
            "48.69",
            "",
            "28.85",
            "33.19"
        ],
        [
            "high",
            "31.63",
            "56.22",
            "24.76",
            "22.86"
        ],
        [
            "ultra",
            "18.3",
            "25.39",
            "10.11",
            "12.01"
        ],
        [
            "",
            "fps",
            "fps",
            "fps",
            "fps"
        ]
    ],
    "pageTitle": "Review Acer Aspire V3-551G-10468G50Makk Notebook - NotebookCheck.net Reviews",
    "title": "",
    "url": "http://www.notebookcheck.net/Review-Acer-Aspire-V3-551G-10468G50Makk-Notebook.82145.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 631273987,
    "recordOffset": 631209011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{57023=The black value of 1.02 cd/m² is average as well. This applies to the contrast too which comes in at 194:1. Both these values should have been better. The Aspire V3-571G-73614G50Makk is worse at 1.55 cd/m² and 132:1, and the Fujitsu Lifebook AH532 (1.02 cd/m² and 178:1) lies at a similar level as the Aspire V3-551G-10468G50Makk. The sRGB and  AdobeRGB color space coverage is non-existent. However, this should not be a problem as these are only required for professional graphics editing., 68952=McAfee Internet Security Suite (60-day test version) takes care of the security needs of the laptop. The Microsoft Office 2010 Starter version is also installed alongside Windows Live Essentials 2011 (which contains an E-Mail program and video editing software). As mentioned earlier, Skype can also be found on the notebook. The laptop also has Cyberlink Media espresso. This can convert media files into formats supported by Smartphones, tablets and/or gaming consoles. Acer has also installed a plethora of its own tools on the laptop. The buyer can look forward to making an image of their hard disk using the Acer Backup Manager., 82631=The list of V3 notebooks on the Acer homepage includes a lot of models which use Intel hardware. A closer look is required to discern the single AMD model from the crowd - the Aspire V3-551G-10468G50Makk. We previously tested two models from this series: the 15.6-inch Aspire V3-571G-73614G50Makk and the 17.3-inch Aspire V3-771G-7361161.12TBDCakk. Now it's time to take a look at the first model with AMD hardware., 46857=During our stress test (Prime95 and Furmark running simultaneously) the speed of the CPU fluctuated wildly (with the power adapter connected). The speeds ranged from 1800 MHz to 2700 MHz, and the four cores did not run at the same speed as each other. In fact, each core individually fluctuated in the above-mentioned range. The dual-graphics ran at 335 MHz. Now and then, the speed briefly rose to 500 MHz or 685 MHz. On battery mode, all cores ran at a constant 2.3 GHz. The dual-graphics ran permanently at 277 MHz.}",
    "TableContextTimeStampAfterTable": "{157768=During the stress test (Prime95 and Furmark run for one hour) with the power cable connected, the CPU speed dropped heavily. We could measure speeds between 1800 MHz and 2700 MHz. Each CPU core fluctuated individually across this range. The two GPUs operated at 335 MHz, but were known to jump up to 500 MHz/685 MHz for a second. On the battery, the CPU cores stayed constant at 2.3 GHz. The two GPUs ran at a constant 277 MHz. The temperatures peaked at 73/74 degrees Celsius.}",
    "lastModified": "Wed, 29 Jul 2015 08:21:48 GMT",
    "textBeforeTable": "We would expect a laptop with a quad-core CPU and dual-graphics to be able to run games without a problem. The games we tested ran at medium settings at the native resolution of 1366x768 pixels and were mostly fluid. Some games even ran smoothly at high settings. The frame rates were not as high as those of the Aspire V3-571G-73614G50Makk (Intel Core i7-3610QM, NVIDIA GeForce GT 640M). We have provided a table to show the difference in performance between the dual-graphics system and the A10-4600 APU with no additional dedicated GPU. We performed this comparison using the Trinity test platform provided to us by AMD. On average, the Aspire V3-551G-10468G50Makk can deliver 20% higher frame rates. Gaming Performance AMD A10-4600M, AMD Radeon HD 7660G, Samsung SSD 830 Series MZ-7PC0128D/EU AMD Pumori Platform A10-4600M   AMD A10-4600M, AMD Radeon HD 7660G + HD 7670M Dual Graphics, Hitachi Travelstar 5K750 HTS547550A9E384 HP Pavilion g7-2051sg   Intel Core i7-3610QM, NVIDIA GeForce GT 640M, Toshiba MK5059GSXP Acer Aspire V3-571G-73614G50Makk   AMD A10-4600M, AMD Radeon HD 7660G + HD 7670M Dual Graphics, Seagate Momentus 5400.6 ST9500325AS Acer",
    "textAfterTable": "Acer Aspire V3-551G-10468G50Makk Radeon HD 7660G + HD 7670M Dual Graphics, A10-4600M, Seagate Momentus 5400.6 ST9500325AS Acer Aspire V3-571G-73614G50Makk GeForce GT 640M, 3610QM, Toshiba MK5059GSXP Fujitsu Lifebook AH532 GeForce GT 640M LE, 3210M, Toshiba MK7575GSX AMD Pumori Platform A10-4600M Radeon HD 7660G, A10-4600M, Samsung SSD 830 Series MZ-7PC0128D/EU Battlefield 3 18% 1% -21% 1024x768 low AA:- AF:2x 34.86 48 38% 41 18% 32 -8% 1366x768 medium AA:- AF:4x 28.85 33 14% 28 -3% 22 -24% 1366x768 high AA:- AF:16x 24.76 25 1% 22 -11% 17 -31% The Elder Scrolls V: Skyrim 32% 15% -13% 1280x720 Low Preset 43.24 57.6 33% 47 9% 38 -12% 1366x768 Medium Preset",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}