{
    "relation": [
        [
            "Patent application number",
            "20100272535",
            "20100273400"
        ],
        [
            "Description",
            "ARRANGEMENT TO CONNECT A TOOL WHEEL AND A TOOL HOLDING FIXTURE - An arrangement for the non-rotational connection between a toothed tool wheel for the machining of end peripheral areas of tooth flanks, having an axis of rotation, and a tool holding fixture that can be rotationally driven around an axis of rotation. Said arrangement has an elastic means with a restoring force against which the direction of the axis of rotation of the tool wheel can be displaced relative to the direction of the axis of rotation of the tool holding fixture.",
            "METHOD AND DEVICE FOR REMOVING A SECONDARY BURR ON AN END-CUT WORK PIECE WHEEL - A method and a device for removing secondary burrs raised on the tooth flanks of a work piece wheel by a chamfering of the end tooth edges of said work piece wheel provides a tool wheel that rotationally meshes with the work piece wheel. Said tool wheel has cutting edges on its tooth flanks ("
        ],
        [
            "Published",
            "10-28-2010",
            "10-28-2010"
        ]
    ],
    "pageTitle": "Reichert, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/reichert-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438251111,
    "recordOffset": 438222436,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27673=Patent applications by Dietmar Reichert, Eschau DE}",
    "textBeforeTable": "Gerhard Reichert, Maisach DE 09-26-2013 METHOD FOR INCREASING THE CONTENT OF CE3+ IN LASER MATERIALS - The invention relates to a method of making Ce 20130248764 Published Description Patent application number Fabian Reichert, Eindhoven DE 04-18-2013 LASER - The invention relates to a laser ( 20130094533 Published Description Patent application number Fabian Reichert, Ahrensburg DE 07-29-2010 Electric Motor with Cooling Ventilator Effect - The invention relates to an electric motor with a stator and an external rotor, comprised of a rotor bell and a rotor cover that acts as a fan wheel. The rotor bell has several apertures in its bell floor. The rotor cover has several exhaust ports. The rotor cover is shaped like a plate and consists of a plate base and an annular wall. The exhaust ports are preferably evenly distributed in the annular wall. The inside of the plate base of the rotor cover that faces the rotor bell has several radially extending interior blades that are fixedly connected to it. 20100187919 Published Description Patent application number Erik Reichert, Boxberg DE 07-31-2014 Ventilation Device, In Particular For Heating, Cooling, and/or Humidifying Air In Residential Buildings - A ventilation device, in particular for heating, cooling and/or humidifying air in residential buildings, includes a duct-shaped housing ( 20140209275 Published",
    "textAfterTable": "Hans Reichert, Rheinfelden DE Patent application number Description Published 20090012305 2-[[1-[[(2,3-Dihydro-2-Oxo-1H-Benzimidazol-5-Yl)Amino]Carbonyl]-2-Oxopropyl]Azo]-Benzoic Acid and a Process For Its Preparation - The present invention is directed to 2-[[1-[[(2,3-dihydro-2-oxo-1H-benzimidazol-5-yl)amino]carbonyl]-2-oxo-propyl]azo]-benzoic acid (C.I. Pigment Yellow 151): (I), characterized by a ΔE* (black/white) in masstone below 22.0±0.7, a process for its preparation and its use for pigmenting macromolecular organic materials of natural or synthetic origin. The pigment has high opacity and high color strength. 01-08-2009 20090137445 Inorganic Optical Brightener - The invention relates to novel inorganic brighteners, a process for their preparation and their use for brightening substrates. More specifically, the novel inorganic brighteners are phosphors characterized in that they have (i) an absorption maximum in the range of from 350 to 375 nm; (ii) a steep decrease of the absorption band near 400 nm; (iii) a quantum yield of the phosphorescence of at least 0.8; and (iv) a phosphorescence maximum in the range between 415 and 445 nm. 05-28-2009 20100043695 COLOR CHANGING INDICATOR - The present invention relates to an indicator system comprising (a) an indicator system comprising a) a photo- or thermochromic indicator compound and b) a luminescent colorant which increases the color difference of the color change of the reagent by at least 0.5 units. 02-25-2010 20100295287 SECURITY ELEMENT - The present invention is in the field of security documents, more particularly in the field of security elements aimed to protect security documents against copying",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}