{
    "relation": [
        [
            "Citing Patent",
            "US8078555 *",
            "US8181155 *",
            "US8849691",
            "US8954924",
            "US20090222794 *"
        ],
        [
            "Filing date",
            "Dec 14, 2007",
            "Feb 29, 2008",
            "Dec 29, 2005",
            "Aug 10, 2011",
            "Feb 29, 2008"
        ],
        [
            "Publication date",
            "Dec 13, 2011",
            "May 15, 2012",
            "Sep 30, 2014",
            "Feb 10, 2015",
            "Sep 3, 2009"
        ],
        [
            "Applicant",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Technology Licensing, Llc",
            "Microsoft Corporation"
        ],
        [
            "Title",
            "Decoupling static program data and execution data",
            "Unified expression and location framework",
            "Modeling user input and interaction in workflow based applications",
            "Dynamic update of modularized programs in a continuation-based runtime",
            "Unified expression and location framework"
        ]
    ],
    "pageTitle": "Patent US7827127 - Data scoping and data flow in a continuation based runtime - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7827127?dq=6,240,376",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479989359,
    "recordOffset": 479959096,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention is susceptible to various modifications and alternative constructions, certain illustrated embodiments thereof are shown in the drawings and have been described above in detail. It should be understood, however, that there is no intention to limit the invention to the specific forms disclosed, but on the contrary, the intention is to cover all modifications, alternative constructions, and equivalents falling within the spirit and scope of the invention. CONCLUSION An auxiliary subsystem 499 (e.g., for auxiliary display of content) may be connected via the user interface 460 to allow data such as program content, system status and event notifications to be provided to the user, even if the main portions of the computer system are in a low power state. The auxiliary subsystem 499 may be connected to the modem 472 and/or network interface 470 to allow communication between these systems while the main processing unit 420 is in a low power state. illustrates remote application programs 485 as residing on memory device 481. It may be appreciated that the network connections shown are exemplary and other means of establishing a communications link between the computers may be used. FIG. 4 When used in a LAN networking environment, the computer 410 is connected to the LAN 471 through a network interface or adapter 470. When used in a WAN networking environment, the computer 410 typically includes",
    "textAfterTable": "US7197502 * Feb 18, 2004 Mar 27, 2007 Friendly Polynomials, Inc. Machine-implemented activity management system using asynchronously shared activity data objects and journal data items US7209248 Dec 8, 2000 Apr 24, 2007 Hewlett-Packard Development Company, L.P. Managing the lifetime of distributed resource data using temporal scopes US7272820 Oct 1, 2003 Sep 18, 2007 Extrapoles Pty Limited Graphical development of fully executable transactional workflow applications with adaptive high-performance capacity US7451432 * Jan 31, 2005 Nov 11, 2008 Microsoft Corporation Transformation of componentized and extensible workflow to a declarative format US7464366 * Feb 23, 2005 Dec 9, 2008 Microsoft Corporation Programming interface for a componentized and extensible workflow model US7565640 * Jan 31, 2005 Jul 21, 2009 Microsoft Corporation Framework for seamlessly authoring and editing workflows at design and runtime US7624125 * Feb 16, 2007 Nov 24, 2009 Feinsmith Jason B Machine-implemented activity",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}