{
    "relation": [
        [
            "Play Type",
            "Out",
            "Error-reached-base",
            "Out",
            "Stolen-base",
            "Walk",
            "Single",
            "Error-wild-pitch",
            "Walk",
            "Out"
        ],
        [
            "Play",
            "Matt Wieters grounded out pitcher to first. None on with one out and Matt Angle due up.",
            "Matt Angle reached first on Eduardo Nunez' fielding error. Runner on first with one out and Robert Andino due up.",
            "Robert Andino flied out to left. Runner on first with two outs and Nick Markakis due up.",
            "Matt Angle stole second. Runner on second with two outs and Nick Markakis at the plate.",
            "Nick Markakis intentionally walked. Runners on first and second with two outs and Mark Reynolds due up.",
            "Mark Reynolds singled to center scoring Matt Angle. On the play, Nick Markakis advances to second. Runners on first and second with two outs and Nolan Reimold due up.",
            "Mark Reynolds advances to second on a wild pitch. Nick Markakis advances to third on a wild pitch. Runners on second and third and with two outs and Nolan Reimold at the plate.",
            "Nolan Reimold intentionally walked. Bases loaded with two outs and Chris Davis due up.",
            "Chris Davis grounded out second to first to end the inning."
        ]
    ],
    "pageTitle": "Wednesday, September 7, 2011 Baltimore Orioles - New York Yankees Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/orioles_yankees/2011/09/07",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 49441923,
    "recordOffset": 49427085,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2356=View all MLB box scores for 9/7/2011}",
    "TableContextTimeStampAfterTable": "{46166=The extra-inning game came on the heels of the teams' late-night contest, which was delayed by four hours because of rain and didn't finish until about 2:15 a.m. (et) Wednesday morning.}",
    "textBeforeTable": "Top of the 1st Alan Porter  3B Paul Emmel  2B Bruce Dreckman  1B Gary Darling  H Umpires 3.42 27 43 3 3 0 1 1 2 Hector Noesi (L, 2-1) 4.30 9 15 1 1 0 0 0 1 Rafael Soriano  1.23 9 13 3 0 0 0 0 1 David Robertson  1.88 7 10 1 0 0 0 0 0.2 Luis Ayala  4.05 3 6 0 0 0 0 0 0.1 Aaron Laffey  5.27 65 108 7 4 4 4 7 6 A.J. Burnett  ERA Strikes Pitches SO BB ER R H IP Name 2.79 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Yankees pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/yankees_22t.png 14 25 0 1 0 0 1 1 Jim Johnson (S, 3) 2.77 12 21 1 0 0 0 1 1.1 Pedro Strop (W, 1-1) 6.75 5 9 1 0 0 0 0 0.2 Clay Rapada  4.25 13 23 1 0 0 0 1 1 Kevin Gregg  4.15 5 6 1 0 0 0 0 1 Willie Eyre  0.00 6 6 1 0 0 0 1 0.1 Zach Phillips  5.27 9 20 1 1 0 0 0 0.2 Brad Bergesen ",
    "textAfterTable": "Walk Nick Swisher walked. Runners on first and second with one out and Alex Rodriguez due up. Double Alex Rodriguez doubled to center scoring Russell Martin and Nick Swisher. Runner on second with one out and Andruw Jones due up. Out Andruw Jones grounded out short to first. Runner on second with two outs and Jesus Montero due up. Out Jesus Montero struck out swinging to end the inning. Top of the 2nd Play Type Play Walk Nolan Reimold walked. Runner on first with none out and Chris Davis due up. Stolen-base Nolan Reimold stole second. Runner on second with none out and Chris Davis at the plate. Out Chris Davis struck out looking. Runner on second with one out and Ryan Adams due up. Error-wild-pitch Nolan Reimold advances to third on a wild pitch. Runner on third with one out and Ryan Adams at the plate. Walk Ryan Adams walked. Runners on first and third with one out and Kyle Hudson due up. Error-reached-base Kyle Hudson reached first on Brandon Laird's fielding error scoring Nolan Reimold. On the play, Ryan Adams advances to second. Runners on first and second with one out and Craig Tatum due up.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}