{
    "relation": [
        [
            "Fireplace:",
            "Pool:",
            "Hot Tub:",
            "View:"
        ],
        [
            "Wood",
            "Yes",
            "No",
            "Residential and mountain views"
        ],
        [
            "TV in Master Bedroom:",
            "Washer/Dryer:",
            "High Speed Internet:",
            "Unit Code:"
        ],
        [
            "Yes",
            "Unit",
            "Yes",
            "SilGlo306"
        ]
    ],
    "pageTitle": "Silverglo #306 - 4 Bedroom Deluxe Condominium - Aspen Colorado vacation rental",
    "title": "",
    "url": "http://www.friasproperties.com/store/p2details235.php",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461936618,
    "recordOffset": 461921010,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Additional Details: (Passes to the Aspen Club & Spa can be obtained from any Frias front desk during regular business hours.) All Frias Properties of Aspen guest receive complimentary passes to the Aspen Club & Spa, the valley's premier full-service spa and workout facility. During ski season the Silverglo provides shuttle transportation to downtown Aspen and the Silver Queen Gondola. Complex amenities at the Silverglo Condominiums include on-site check-in and front desk services, on-site laundry room, outdoor heated pool, on-site free parking, complimentary Aspen airport transfers, complimentary Wi-Fi and an on-site group gathering room. Unit amenities include an updated kitchen with granite counter tops and stainless steel appliances, a formal dining area, a laundry closet, and flatscreen TVs in the main living area and all bedrooms. This top floor 4-bedroom, 4-bath deluxe condominium features hardwood floors and two wood-burning fireplaces in the main living area, dining area and kitchen, and is only four blocks to the Silver Queen Gondola and downtown Aspen. Silverglo Condo Complex: Contact Us",
    "textAfterTable": "Property Location: Check-in Location: 940 Waters Avenue Reviews for Silver Glo Unit 306 Average Rating: 4 of 5 1 of 1 reviews \"Silver-Glo #306...We'll Take It!!!\" 4 of 5 Newly updated unit with extremely comfortable furnishings. More than adequate for a family of 4-5. fairly centrally located just blocks from Aspen's main ski lift, market and liquor store...provided us with all the comforts of home. Would and will, recommed to all Aspen-interested visitors. Only opportunity with the unit, internet access was spotty with inconsistent signal strength. -Annual September Aspen Visitor on 10/02/2009",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}