{
    "relation": [
        [
            "SURNAME",
            "MERCER",
            "MEWBORN",
            "",
            "MILLER",
            "MOORE",
            "",
            "MORRIS",
            "MOZINGO",
            "",
            ""
        ],
        [
            "RESEARCHED BY",
            "Martha Mewborn Marble",
            "Martha Mewborn Marble",
            "Patty Day",
            "Carol B. Miller",
            "Martha Mewborn Marble",
            "Patty Day",
            "Ruth Westbrook",
            "Gayle",
            "Christine Fuller",
            "Sammie Melton"
        ],
        [
            "WEB SITE LINK OR ADDITIONAL INFO.",
            "Thomas Mercer - b ca 1695 Norfolk Co, Va d Greene Co.",
            "George Mewborn - bc 1730 Bertie County d ca 1766 Dobbs county md before 1764 Mary Parrott",
            "same as Martha",
            "Andrew L. MILLER, b. 3/9/1809, Va. or Tenn. d.8/27/1865, buried in the Cornelius Burke Cem. in Screven Co., Ga. Andrew was listed as a railroad manager in the 1850 Wilkinson Co., Ga. census. May have had ties to Nunn & Phillip MILLER of N.C. and also to the PARKER family. Andrew MILLER had a grandson named Nunn MILLER. A William MILLER from Lenoir/Craven Co., N.C. was in Screven Co., Ga before moving to Ware Co., Ga. Please contact me if you have further info.",
            "William Moore - b unknown - in Craven (now Lenoir Co by 1750) d Dobbs Co",
            "Adam MooreMohr/Moor: daughter Susannah m. William Heritage",
            "Reddick MORRIS, b. 5 Nov 1805, d. 1 Nov 1872, (1st m.) 28 Mar 1837 to Allie Grantham b. 8 Feb 1810, d. ca 1860, Johnston Co., NC. Reddick (2nd m.) Susan Carolina Rich, b. 19 Jan 1834, d. 25 Aug 1854 in Duplin County, NC",
            "MOZINGO, Booth Tax List 1779 MOZINGO,John MOZINGO, Ann MOZINGO, George Tax List 1779",
            "Bryant MOZINGO, b. abt. 1820. Stephen MOZINGO, abt. 1810, m. 1st, Sarah, 2nd, Rachel",
            "MOZINGO family"
        ]
    ],
    "pageTitle": "Common Surnames",
    "title": "",
    "url": "http://freepages.genealogy.rootsweb.ancestry.com/~paday/dobbers/commonsurnames.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105432887,
    "recordOffset": 105414927,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{49706=Sarah ? BUTTS (1815-1899) Dau: Lanie BUTTS (1849-1894) m. William Rasberry BRAND (1848-1936) (Brand Cemetery, Greene Co., N.C.) Requesting info. on lineage., 55124=Benjamin BEST b. abt 1740 in Isle of Wight Co., VA; d. 12 FEB 1805 in Greene County, NC m 1: Celia Hood (no dates) m 2: Margaret Williams married: abt 1760 in Dobbs Co., NC children:1) Henry Best b: 11 APR 1762 2)Ann Best b: ABT 1764 3)Benjamin Best b: 1766 in Wayne Co, NC 4)Elizabeth Best b: ABT 1768 5)Mary Best b: ABT 1770 6)Clarky Best b: ABT 1772 7)Williams Best b: ABT 1774 in NC 8)Theophilus Best b: BEF 1776 9)Margaret Best b: BEF 1778 10)Martha Best b: BEF 1780 11)Robert Best b: BEF 1782, 33719=John EDWARDS, d. 1810 & descendants in Wayne, Lenoir, Duplin Co., NC Marty Grant's Website, 58365=John Barnes, b. 1776, Dobbs County, d. 1831, Wayne County, 62154=Alexander Family Home Page Mrs. Frances Alexander, widow on the 1790 Census migrated to Camden District, S.C. Was William her husband and who was she ?, 32279=Jesse FARMER - BC 1765 Edgecombe Co.- d. 1793 Lenoir Co. - md Winfred? probably in Edgecombe Co., 55462=Francis BENTON b. about 1735 in Dobbs Co., N.C., s/o Francis & Margaret PIPKIN, m. Lucretia PIPKIN d. bef. 1800, Lenoir Co., N.C., 56689=William Barwick BC 1731 Talbot County, MD., d 1810 South Carolina and wife Elizabeth Manning. In between lived in Dobbs County and left children in Dobbs., 22838=My great grandmother, Sarah Florence Heath CARMACK (1862-1934) is buried in the Baker Cem. in Cove City, N.C. She married Thomas CARMACK (1830-1901). Other that her parents' names, I do not have any info. on the HEATH family. Would love to have assistance on this family name. Sarah's parents were Thomas HEATH and Nancy TULL (1839-?)., 41952=William Coward md Anna Griffin/Griffith (see Coward's under Martha' Mewborn ) Wm. & Anna's son  John COWARD  of Dobbs m. Mary SHIPP of Craven, & had dau SALLIE COWARD b.c1774, Dobbs, who m (1) John  PATRICK m (2) Roderick J. POWELL b.c1772 Dobbs Co., 9911=Jacob Sr. married Ann Hooker before 1757 (Bertie) had Jacob, Jr. Nathan, Silas, Jesse, Stephen and Sallie(Sarah) All lived in Greene except Stephen. (My line) who lived in Lenoir. Stephen md Nancy Uzzell 1784 and he d.1820., 34008=Theophilus Edwards 1765-1834, son of Thomas & Mary Edwards, m.Elizabeth Sheppard 1780-1864, 9199=Thomas LOVICK arrived NC abt 1710, George Pheney Lovick md Anna Heritage, (dau of William Heritage and sister to Gov. Caswell's wife Sarah)d. 1778 in Dobbs Co., 47482=Lawrence Parker Carr - bc 1765 Hertford Co, NC d CA 1810 Greene County, NC- married Bef 1790 Martha Ann Hart, 61684=Philamon ARNET in the Battle of Widow Moore's Creek Bridge in 1776, listed as residing in Wayne or Dobbs., 39834=CURLEE, William was in Greene before 1745 as he already had a Mill. CURLEE, James died in Dobbs Oct. 1766, admr to Mary Curlee, and others, 51886=William Bright b ca 1707 Va d 1762 NC, Will in Duplin Co.,NC. Md. ?? other children than 2 dau's listed??, Sarah Bright m Stephen Herring; Ann Bright M John Winders b ca 1729 d ca1805. Dau Sarah Winders m James Grimes; son Stephen Grimes m Bethany Hines; dau. of Joel Hines and Patience Gully of Lenoir Co., NC., 62874=ALBRITTON - James Albritton - b 17 September 1705 York Co, Va d Bef 1774 Pitt Co, NC - md Elizabeth surname unknown, 29566=John GRAY Sr. b. 3 Oct 1786, Dobbs Co. NC, d. 16 Aug 1842 (son of John & Elizabeth GRAY) md Edith MEWBORN b. 7 Sep 1791 NC, d. 12 Aug 1844 in Lenoir Co. NC. (daughter of Parrott Mewboorn and Lidea [Lydia] Mewboorn ), 26387=Thomas/Joseph Hardee - first name not proven - bc 1740 probably in Pitt Co - d by 1790 Lenoir Co - md Sarah Croom, 41469=Stephen CREECH & Benjamin CREECH, wives unknown. Land survey/warrant 300 acres in 1760 for Stephen SCREECH bordering Benjamin SCREECH in Dobbs Co. North side of New River on branch of Falling \"Creeck\" called the White Marsh., 20049=Richard HILL, b. 20 Feb. 1852 in Greene Co. Died March 16, 1927 in Hookerton. Married Hepsie Elizabeth FIELDS b. 10 July 1853 in Lenoir Co. & died 16 March 1927 in Hookerton. Both are burried in Rainbow Cemetery., 44691=Probert Collier(b. 1765-d.1835) m.1800 Elizabeth Green(b.1775-d.1852) both buried Willowdale, Goldsboro, N.C., 27699=John GRIMSLEY - bc 1745 - d in Dobbs Co - md Ida Brown, 24174=Moses Hart, b. abt 1760, father unknown. Moses in 1790 Dobbs Co. census, living next to a Zachriah Hart, 47181=TITUS CARR, 1743 - 1804, Greene Co., married 1770 Winifred STEPHENSON, 37975=My great great grandmother, Nancy Tull HEATH (1839-1901). She married 3 times. The first spouse was Thomas HEATH, 2nd spouse was Stephen JONES, & 3rd spouse Emmanuel JARMAN. I do not have any info. on the TULL, JARMAN, JONES or DANIELS families. Would love to have any assistance on these names. Nancy TULL'S parents were William TULL, Jr. (1775-1840) and Sarah MATHIS? Her sister was Winnifred Frances TULL (1836-?) and she married Arlington N. DANIELS., 60248=Benjamin Aswell, b.1808 NC, md. Pernecie Whitley, b.1825 NC abt 1839 Greene Co. NC, 31736=Brittle Fields - BC 1720 Surry County, Va - dc 1790 Lenoir Co. - md 1st ? Cotton, 2nd Mary Mercer (not proven), 11218=George Kornegay - bc 1705 - d before 22 Nov 1773 Jones Co - md Mary, 38762=Abel DAIL - bc 1714 in Norfolk Co, Va d. Pitt/Dobbs Co, NC, 4334=Bryant MOZINGO, b. abt. 1820. Stephen MOZINGO, abt. 1810, m. 1st, Sarah, 2nd, Rachel, 4672=MOZINGO, Booth  Tax List  1779 MOZINGO,John MOZINGO, Ann MOZINGO, George  Tax List 1779, 23855=James Usel HEATH m. Susan Westbrook in Greene Co., abt 1816; John HEATH m. Sally (Sarah) Edwards in Greene Co. abt. 1816 & moved to Washington Co., GA; Richard HEATH m. Margaret LNU in Speight Bridge abt. 1825; & other HEATHs of Greene Co., 27425=John Thomas GRUBBS - b 1836 Person Co, NC - d 1907 Lenoir Co - md 1st Martha Aldridge 2nd Eliza Fields, 6634=Andrew L. MILLER, b. 3/9/1809, Va. or Tenn. d.8/27/1865, buried in the Cornelius Burke Cem. in Screven Co., Ga. Andrew was listed as a railroad manager in the 1850 Wilkinson Co., Ga. census. May have had ties to Nunn & Phillip MILLER of N.C. and also to the PARKER family. Andrew MILLER had a grandson named Nunn MILLER. A William MILLER from Lenoir/Craven Co., N.C. was in Screven Co., Ga before moving to Ware Co., Ga. Please contact me if you have further info., 53347=John Batcheler BRAND-N.C. tax Dobbs 1769, American Rev. Darnal's Co. 1775, Land Grant1759. Son: Issac BRAND, est. 1780 possible connections to ? RASBERRY, Grandson: Berry BRAND 1811-1854, m. Louisa WILLIAMS, b. 1827?, 29929=Laura Frances GOODING (d/o Andrew GOODING & Patsy DAUGHETY of Lenoir/Craven Co.) b. Lenoir 30 March 1863, m. William Alexander EVANS of Lenoir 31 Jan 1881, 18362=William HOOKER 1725- after 1769, had son Hymerick b. 1753. HOOKER, Ann b. 1735? (sister to William) she married Jacob Lassiter. They moved to Dobbs (Greene) about 1765., 64394=Thomas Jefferson Abbott(1808-1853) - Lucinda May Phillips (1812-1898), 61292=William Arendell (1746-1822) - family moved to Johnston/Dobbs Co. in 1740's or 1750's, probably from north-eastern NC or southeastern VA. Left six daughters but no sons, so name has disappeared. Wife said to have been Persis Garrett, but no proof., 20705=Richard Hill 1763-1833 Greene County, NC married Esther Aldridge and his brother Hardy Hill b abt 1789 married Catherine Freeman, both sons of Robert \"Robin\" Hill and Martha \"Patsy\" Murphrey, 19478=HINES/HINDS, Sarah b. before 1750, said to have been a widow of ____Herring. Father unknown, mother Jeste Trautwine (none proven) and married 2nd to Thomas Uzzell of Dobbs who died in 1772., 12028=Alexander Kilpatrick - bc 1700 - d 1756 in Dobbs Co - md Elizabeth Easley Martin in Goochland Co, Va, 7698=Thomas Mercer - b ca 1695 Norfolk Co, Va d Greene Co., 56027=Seeking 1650 - 1850 Lenoir and Duplin County Area prominent farming family of Robert, George or Hezejiah Bell their wives and descendents., 36991=James DAVIS - bc 1725 d Duplin/Lenoir Co. NC md Catherine, 35552=Furney (Furnifold) C. DUPREE, b. abt. 1815 (possibly Craven Co.) married Theresa; parents of 8 children including William C. DUPREE who married Virginia HOOTEN in 1873. Any help on this family would be appreciated. All living in Lenoir Co. by 1840., 45116=My grandfather was Lamb Henry Clemons b. Mar. 1871 Moseley Hall section of Lenoir Co., married Nannie Hill , lived in Greene Co. most all adult life. Died in Hookerton NC in 1942. Buried at Rainbow Cemetery., 26052=James Hardison - bc 1765 Hyde Co., NC - d. 1792 Greene County - md Lucretia Garris of Va. Children moved to Duplin and then some into Lenoir., 19041=Francis Hodges - moved to Craven/Dobbs ca 1735-40, probably from lower Norfolk Co, VA, or Currituck Co., NC. Married Frances Carruthers, of New Bern. He was an uncle of Capt. Simon Bright, Jr., 43147=William Coward -bc 1710 dc 1780 Dobbs County, NC - md Anna Griffeth/Griffin bc 1710 d Bef 1780 Dobbs County, 21553=Richard Hill Sr- bc 1725 Craven Co, NC - d 1778 Craven Co - md Susannah Linefield in Craven Co - two sons moved to Lenoir Co - Richard Jr and Levi, 28010=Hugh GRIMES, b. ca. 1715 or before ?, d. ca. 1780/1, Duplin Co., NC, son of Walter GRIMES, 15812=INGRAM/ENGRAM - James, James, Jr., Isaac, Isaac, Jr., INGRAM who were in Dobbs/Lenoir from abt. 1776-1810. Also any connection with Charles and Jacob INGRAM or Edward ENGRIM/ENGRAM. I have the information from the Land index, tax records, census, but nothing that shows where they came from or relationship between them other than the Jr. notation. Isaac, Jr. wife was \"Celia\" and I believe she was Cecelia Bruton, b. abt. 1780, they moved from Lenoir Co. to Jefferson Co., GA abt. 1810., 1820=1999 - 2014, 51327=Info. needed William BRITT, dau. Sarah, b. abt. 1804, m. Issac BRAND, b.abt. 1780, Dobbs Co., N.C., 5132=Reddick MORRIS, b. 5 Nov 1805, d. 1 Nov 1872, (1st m.) 28 Mar 1837 to Allie Grantham b. 8 Feb 1810, d. ca 1860, Johnston Co., NC. Reddick (2nd m.) Susan Carolina Rich, b. 19 Jan 1834, d. 25 Aug 1854 in Duplin County, NC, 30705=John GARLAND, BC: abt. 1724 in VA, d: 1804 in Greene Co., NC, left VA abt. 1750. Joined Capt. Robert Spotswood's company on Feb. 1, 1756 & fought in the French & Indian wars as a Private. Fought in the American Revolution as a Captain & was at the Battle of Moore's Creek Bridge, 21904=HERRING, John 1680-1760 & son Benjamin 1720-1789. John 1st noted in Dobbs in 1738. Interested in all other older Herring persons., 33347=Wiley Columbus Evans, born Sept. 15, 1882 in Greene County, NC; died March 1, 1947 in Wilson County, NC. His parents were John Evans and Nancy Whitley Evans, 17718=Council HOOTEN b.1817, Craven Co. married Matilda CLARK. Possible father was Caleb HOOTEN; family was in Lenoir Co. by 1820, 7424=George Mewborn - bc 1730 Bertie County d ca 1766 Dobbs county md before 1764 Mary Parrott, 57786=BARRS Seeking 1700 - 1850 Lenoir County Area of Johnson, Dobbs and Lenoir Counties farming family information of John Barrs, Sr. and his wife, male and female children, and grandchildren: Son John Barrs, Jr. and his wife's name: Males Arthur, Gideon, Dempsey, James and females. Barrs Family, 35901=I am searching for the ancestors of JOHN FERDINAND RUFF b. 1770, Greene Co., NC. I am also researching EASON and DUPREE. Hope someone can help., 48604=Samuel CARLYLE. Samuel, abt. 1810, married 1st, Nancy, 2nd, Sally Mozingo, 48324=My grandfather, Kirby Charles CARMACK (b. 21 Aug. 1895-d.20 Jan. 1980 Colonial Heights, Va.) His father was Thomas CARMACK (b. in Craven Co., N.C. & d. 17 Sept. 1901). He was one of Jesse CARMACK and Patient KENT'S children. Other children included Cordilla CARMACK (m. Amos JONES); lEVI carmack (B. 25 dEC. 1821) & married Penelope ?); Furnifold Kent CARMACK (b. 25 Jan. 1823, Craven Co., N.C.-d. Bef. 1873-1880, Al.) He married Julia Ann HEATH, 9 Dec. 1850 in Craven Co., N.C. She was born 1834; and then married 2) Kesiah CARMACK (b. 6 Aug. 1826). Looking for family connections for Kesiah and Cordillia CARMACK., 8731=John LUCAS family of Dobbs County, NC (circa 1755-1830), 38458=Robert C. DANIEL (abt. 1765-aft. 1830) moved from Greene Co., N.C. to Burke Co., Ga. in 1812. Wife, Penelope (1773-1846), some say LANE. Collaterals: TARVER, WISE, MURPHEY, FLOURANCE, GREEN, RENEAU, PERRY, possibley LOVELESS and others in the Burke and Jefferson Co, Ga. area., 50354=John C.M. Garland became Guardian of Thomas Pinckney BRUTON's children in 1852 in Madison County, TN. Thomas was from Lenoir County, NC., 20935=Matthew HILL bc 1790 - orgins not known, 40341=Major Croom - bc 1715 Goochland Co, Va dc 1790 Lenoir Co, NC - md 1st Olive Avery, 2nd Susannah Hardee, 17344=Charity Ann Elizabeth Cox HUGGINS, Charity's g-grandparents were John, b. abt. 1767 d. 1843, & married Angeline Loftin Parker, abt. 1792. Their daughter Rachel Parker, b. 1800, married Owen Bryant Cox.}",
    "textBeforeTable": "A   Surnames N-ZM L K J I H G F E D C B     Submit your Common Surnames Dobber: Common Surnames   -->",
    "textAfterTable": "  B SURNAME  RESEARCHED BY WEB SITE LINK OR ADDITIONAL INFO. BAKER Stella L. CRIST My BAKER family history says that our ancestors came from Loosing Swamp in Dobbs Co., N.C. My earliest known ancestor is James Walter BAKER who lived in Wise Co., VA. & Letcher Co., KY. BARDIN Marita Clark ** Jean Sedbrook ** BARNES Sammy Anson Pierce John Barnes, b. 1776, Dobbs County, d. 1831, Wayne County BARROW Nancy Pittman Pioneers Portals and Paths BARRS Al Barrs BARRS Seeking 1700 - 1850 Lenoir County Area of Johnson, Dobbs and Lenoir Counties farming family information of John Barrs, Sr. and his wife, male and female children, and grandchildren: Son John Barrs, Jr. and his wife's name: Males Arthur, Gideon, Dempsey, James and females. Barrs",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}