{
    "relation": [
        [
            "#",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7"
        ],
        [
            "Name",
            "EDITORIAL A Very Short Editorial",
            "REVIEW ARTICLE Lead Toxicity, A Review of the Literature. Part I: Exposure, Evaluation, and Treatment",
            "ORIGINAL RESEARCH The Effects of a Sustained-Release L-Arginine Formulation on Blood Pressure and Vascular Compliance in 29 Healthy Individuals",
            "ORIGINAL RESEARCH Naturopathic Medicine and Type 2 Diabetes: A Retrospective Analysis from an Academic Clinic",
            "CASE STUDY Suppression of Adrenal function by Low-dose Prednisone: Assessment with 24-hour Urinary Steroid Hormone Profiles ñ A Review of Five Cases",
            "MONOGRAPHS Coleus forskohlii",
            "MONOGRAPHS L-Tryptophan"
        ],
        [
            "Size",
            "89.47 kB",
            "472.81 kB",
            "304.29 kB",
            "342.55 kB",
            "274.51 kB",
            "215.88 kB",
            "248.55 kB"
        ]
    ],
    "pageTitle": "Archives - Alternative Medicine Review - A Journal of Clinical Therapeutics",
    "title": "",
    "url": "http://altmedrev.com/archives_plus",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 6361711,
    "recordOffset": 6310791,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{414740=Alternative Medicine Review has been in continuous publication since 1996 and is the leading peer-reviewed journal designed for sharing information on the practical use of alternative and complementary medicine. Since its inception, the journal has promoted the practice of alternative therapies in a way that provides for a rational, individualized, and comprehensive approach to health care. }",
    "textBeforeTable": "epub AMR Archives. Must be registered to download files. If you wish to view or print PDF versions of specific articles - click on the title of the article you wish to read. We are providing some of the back issues of the AMR as full digital issues. Click on the link below to access the list of digital issues. Browse Journal Archives by Year & Volume Search Documents Downloads Home If you are looking for an article, monograph, or editorial published in Alternative Medicine Review, enter your search term(s) here. Our search function should deliver only articles relevant to your needs. ",
    "textAfterTable": "4 ORIGINAL RESEARCH A Randomized Controlled Trial of a Multifaceted Integrated Complementary-Alternative Therapy for Chronic Herpes Zoster-Related Pain 2.16 MB 5 REVIEW ARTICLE The Effects of Yoga on Anxiety and Stress 2.34 MB 6 ORIGINAL RESEARCH Nutritional Supplement Therapy Improves Oxidative Stress, Immune Response, Pulmonary Function, and Quality of Life in Allergic Asthma Patients: An Open-Label Pilot Study 2.3 MB 7 ENVIRONMENTAL MEDICINE Do Environmental Toxicants Contribute to Allergy and Asthma? 1.97 MB 2011 v16-4 # Name Size 1",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}