{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "unknown",
            "I receive emails regularly about very interesting clubs, speakers and events. I wish I could go!",
            "Distance Learning",
            "For a very competitive price I will end up with a masters in science in nursing!",
            "unknown",
            "unknown",
            "unknown",
            "Utilize the resources that are available. They are very helpful people if you stay in contact with them. i.e. Academic advisers and guidance counselors.",
            "Sacred Heart University has an amazing support system for their distance learning students. Their academic advisers, instructors and guidance counselors are easy to contact and very professional. I feel I am going to get a very high quality education for a very reasonable price."
        ]
    ],
    "pageTitle": "Sacred Heart University (SHU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Sacred-Heart-University/reviews?_escaped_fragment_=/show/44640",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890374767,
    "recordOffset": 890335623,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10969=One of the most unique aspects of Sacred Heart University is the Chapel of the Holy Spirit. It was formally blessed in 2009 and is a new and beautiful part of campus. The famous artist, Fr. Marko Rupnik and his team created two breathtaking mosaics made with hundreds of thousands of tiles. His team comes from all over the world, places like Italy and Romania, to put together these masterpieces., 158267=© 2015, Cappex.com, LLC, 148987=I am planning on attending Sacred Heart in the fall of 2014 so I have not had any classes, but as an exercise science/pre-physical therapy major I know i will have to buckle down and devote a lot of time to my studies. As long as you put the time and effort you will do great!}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 23 out of 24 people found this review useful. 1 of 38 Jaclyn from wolcott, CT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "juliette from New Britain, CT 05/11/2011 Reviewer is A current student here. 10 out of 10 people found this review useful. 3 of 38 Categories Comments Great for these types of students all types of students. Tips for prospective students don't let the price tag scare you. you will get a great education. sacred heart is a small school. you will definitely have a better chance to graduate. everyone is here to help you graduate. there plenty of scholarships and financial aid. Bang for the buck a little expensive, but your getting a high education. small classes make it so much easier. you get to know your staff. you are not a number, you get to know everyone. Am enjoying being here I enjoy the small school environment, students and staff included. Customer service is wonderful. Academic Rigor the projects and research papers keep me busy.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}