{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "90.08",
            "83.44",
            "85.73",
            "86.35"
        ],
        [
            "NSE",
            "90.17",
            "83.50",
            "85.77",
            "86.35"
        ]
    ],
    "pageTitle": "Mcnally Bharat Engineering Stock Price, Share Price, Live BSE/NSE, Mcnally Bharat Engineering Bids Offers. Buy/Sell Mcnally Bharat Engineering news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/engineering/mcnallybharatengineering/MBE",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 593440243,
    "recordOffset": 593391620,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{213502=Mcnally Bh Engg is in the Engineering sector. The current market capitalisation stands at Rs 394.17 crore. The company management includes Prasanta Kumar Chandra - Whole Time Director & COO, Prabir Ghosh - WholeTime Director & CFO, Aditya Khaitan - Director, Virendra Kumar Verma - Director, Utsav Parekh - Director, Amirtanshu Khaitan - Director, Asim Kumar Barman - Director, Puranam Hayagreeva Ravikumar - Director, Subir Ranjan Dasgupta - Director, Nandini Khaitan - Additional Director. It is listed on the BSE with a BSE Code of 532629 and the NSE with an NSE Code of MBECL. Its Registered office is at 4, Mangoe Lane, 7th Floor, Kolkata,West Bengal - 700001. Their Registrars are Maheshwari Datamatics (P) Ltd., 135058=JSWSteel Jul Fut, 134351=UnitedBrewerie Jul Fut, 133840=28 July 2015, 212191=Zensar Technologies Recommended on Mar 24th 2015}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}