{
    "relation": [
        [
            "Year",
            "1992",
            "1993",
            "1994",
            "1995",
            "1996",
            "1997",
            "",
            "1998",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006"
        ],
        [
            "Player",
            "Jeremy Bates",
            "Andrew Foster",
            "Jeremy Bates",
            "Greg Rusedski",
            "Tim Henman",
            "Tim Henman",
            "Greg Rusedski",
            "Tim Henman",
            "Tim Henman",
            "Tim Henman",
            "Tim Henman",
            "Tim Henman",
            "Tim Henman",
            "Tim Henman",
            "Andy Murray",
            "Andy Murray"
        ],
        [
            "Round reached",
            "R16",
            "R16",
            "R16",
            "R16",
            "QF",
            "QF",
            "QF",
            "SF",
            "SF",
            "R16",
            "SF",
            "SF",
            "QF",
            "QF",
            "3rd",
            "R16"
        ],
        [
            "Opponent",
            "Guy Forget",
            "Pete Sampras",
            "Guy Forget",
            "Pete Sampras",
            "Todd Martin",
            "Michael Stich",
            "Cedric Pioline",
            "Pete Sampras",
            "Pete Sampras",
            "Mark Philippoussis",
            "Goran Ivanisevic",
            "Lleyton Hewitt",
            "Sebastien Grosjean",
            "Mario Ancic",
            "David Nalbandian",
            "Marcos Baghdatis"
        ],
        [
            "Score",
            "67 64 36 76 63",
            "61 62 76",
            "26 61 63 61",
            "64 63 75",
            "76 76 64",
            "63 62 64",
            "64 46 64 63",
            "63 46 75 63",
            "36 64 63 64",
            "61 57 67 63 64",
            "75 67 06 76 63",
            "75 61 75",
            "76 63 36 64",
            "76 64 62",
            "67 16 60 64 61",
            "63 64 76"
        ]
    ],
    "pageTitle": "Bob Larson's Tennis News | <u>Wimbledon</u> Men's Tournament Preview",
    "title": "",
    "url": "http://www.tennisnews.com/exclusive.php?pID=20840",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 735051387,
    "recordOffset": 735023678,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{732=POINTS AND PRIZE MONEY.... The following is a breakdown of the individual prize money and ATP Ranking points for the men\u0092s singles competition at 2007 Wimbledon. The total prize money for the men\u0092s singles is £3,727,400. There is equal prize money in the men\u0092s and women\u0092s events for the first time this year., 1547=Wimbledon 2007 sees the 121st staging of The Lawn Tennis Championships, which began in 1877 with Britain\u0092s Spencer Gore defeating compatriot William Marshall 61 62 64 for the inaugural title. This is the 40th staging of The Championships in the Open Era, the first being in 1968 when Australia\u0092s Rod Laver defeated countryman Tony Roche 63 64 62. Wimbledon 2007 is the 158th Grand Slam tournament of the Open Era., 2246=2007 WIMBLEDON}",
    "TableContextTimeStampAfterTable": "{227232=2004 Roland Garros champion Gaston Gaudio withdrew from this year\u0092s Wimbledon, while three-time Roland Garros champion Gustavo Kuerten, coming back from hip surgery, is not ranked high enough for this year\u0092s tournament., 60269=2001, 277379=Pete Sampras                 7          1993-95,1997-2000, 328312=1984, 193666=1987, 154412=Ken Rosewall, 1971-72, 176194=1973, 279288=John Newcombe             2          1970-71 (also won in 1967), 171211=1969, 158274=Sergi Bruguera, 1993-94, 241545=1983, 63598=2003, 183674=1979, 274158=2004 Roland Garros, 351089=2001, 17034=             Roy Emerson                  Australian championships           1963-67 (5 straight titles)         , 251946=1992, 100793=NADAL ATTEMPTS RARE DOUBLE\u0085. At last year\u0092s Wimbledon, world No. 2 Rafael Nadal became the first Roland Garros champion to reach the final at Wimbledon the same year since Andre Agassi in 1999. The Spaniard\u0092s loss to Federer in the final saw him narrowly miss out on becoming just the third man in the Open Era, after Rod Laver and Bjorn Borg, to hold both the Roland Garros and Wimbledon titles the same year. As reigning Roland Garros champion again in 2007, Nadal has another chance to achieve this rare double., 274718=2002 Australian Open, 121377=Players at 2007 Wimbledon in bold (totals include this event), 166284=Roger Federer, 2003-04-05-06 (three defences), 404703=2006, 393299=2001, 312257=1972, 419574=2003-06, 352428=2002, 181157=1977, 232907=1968, 158724=Jim Courier, 1992-93, 167380=Among all four Grand Slam tournaments, a defending champion has lost in the first round four times. It has happened twice at the Australian Open, in December 1977, when Roscoe Tanner fell to Chris Lewis 36 63 62 16 64, and in 1997, when Boris Becker lost to Carlos Moya 57 76 36 61 64. At the 1999 US Open, 1998 champion Patrick Rafter lost in the first round to Cedric Pioline 46 46 63 75 10 ret. when a shoulder injury forced him to retire after losing the first game of the fifth set., 233440=1976, 156831=Ivan Lendl, 1986-87, 325639=1982, 370521=1992, 221382=2003 Roland Garros, 275244=1998 Roland Garros, 56848=2005, 304400=In 2003, Lleyton Hewitt became the only No. 1 seed at Wimbledon in the Open Era to lose in the first round, when he was defeated by Croatian qualifier Ivo Karlovic 16 76 63 64., 275769=2003 US Open, 227615=There are 49 members of the club of Open Era Grand Slam tournament singles titleists: Andre Agassi (USA), Arthur Ashe (USA), Boris Becker (GER), Bjorn Borg (SWE), Sergi Bruguera (ESP), Pat Cash (AUS), Michael Chang (USA), Jimmy Connors (USA), Albert Costa (ESP), Jim Courier (USA), Stefan Edberg (SWE), Mark Edmondson (AUS), Roger Federer (SUI), Juan Carlos Ferrero (ESP), Gaston Gaudio (ARG), Vitas Gerulaitis (USA), Andres Gimeno (ESP), Andres Gomez (ECU), Lleyton Hewitt (AUS), Goran Ivanisevic (CRO), Thomas Johansson (SWE), Yevgeny Kafelnikov (RUS), Jan Kodes (TCH), Petr Korda (CZE), Richard Krajicek (NED), Johan Kriek (RSA/USA)^, Gustavo Kuerten (BRA), Rod Laver (AUS), Ivan Lendl (TCH), John McEnroe (USA), Carlos Moya (ESP), Thomas Muster (AUT), Rafael Nadal (ESP), Ilie Nastase (ROM), John Newcombe (AUS), Yannick Noah (FRA), Manuel Orantes (ESP), Adriano Panatta (ITA), Patrick Rafter (AUS), Andy Roddick (USA), Ken Rosewall (AUS), Marat Safin (RUS), Pete Sampras (USA), Stan Smith (USA), Michael Stich (GER), Roscoe Tanner (USA), Brian Teacher (USA), Guillermo Vilas (ARG) and Mats Wilander (SWE)., 179955=1976, 357802=2006, 242778=1984, 165636=Pete Sampras, 1997-98-99-2000 (three defences), 163160=Bjorn Borg, 1976-77-78-79-80 (four defences), 386461=1998, 155834=Johan Kriek, 1981-82, 164685=Pete Sampras, 1995-96, 324308=1981, 281135=Pat Cash                         1          1987, 278674=Boris Becker                    3          1985-86, 1989, 16594=             William Larned                US championships                      1907-11 (5 straight titles), 310919=1971, 211334=2001, 343038=1995, 238380=1981, 415701=1976-80, 207528=1998, 149595=1990-2004, 247715=1993, 166890=In 2003, Lleyton Hewitt became the first Wimbledon defending champion in the Open Era to lose in the first round, falling to Ivo Karlovic 16 76 63 64. The defending champion has lost in the Wimbledon first round only twice in history, the first time being in 1967, when 1966 champion Manuel Santana lost to Charlie Pasarell 108 63 26 86., 333667=1988, 422380=COUNTRY COUNTDOWN\u0085. There are 35 countries represented in the men\u0092s singles draw at 2007 Wimbledon, one more than last year. France leads the field with 15 competitors.  , 187430=1982, 160168=Roger Federer, 2006-07, 308243=1969, 330996=1986, 189891=1984, 372801=1993, 203714=1995, 196171=1989, 170010=1968, 41968=Pete Sampras played a grass court warm-up event ahead of all seven of his Wimbledon triumphs. The only year in his entire career that he did not play a warm-up event, in 1996, Sampras failed to win the Wimbledon title, losing in the quarterfinals to eventual champion Richard Krajicek., 13751=Only seven men in history have won five or more consecutive titles at one Grand Slam event, and Bjorn Borg is the only player to have achieved this feat in the Open Era. Borg was also the last man to win five consecutive Wimbledon titles, the Swede collecting all five of his trophies at the All England Club in 1976-80., 17486=             Bjorn Borg                       Wimbledon                                   1976-80 (5 straight titles), 264278=1979, 45765=            John McEnroe             1983 Queen\u0092s Club finalist and Wimbledon champion, 339014=1992, 218979=EIGHT GRAND SLAM CHAMPIONS IN MAIN DRAW\u0085. Eight of the ten active Grand Slam tournament champions appear in the 2007 Wimbledon main draw. Two of these, Roger Federer and Lleyton Hewitt, are former Wimbledon champions., 232207=1974, 278367=John McEnroe                 3          1981,1983-84, 192409=1986, 22340=1881-86, 1889, 320285=1978, 245254=1990, 279586=Jimmy Connors               2          1974, 1982              Stefan Edberg                 2          1988, 1990, 417679=1983, 174947=1972, 281790=Andre Agassi                   1          1992, 340352=1993, 234137=1970, 155121=Guillermo Vilas, 1978-79, 43867=If Federer goes on to win his fifth straight Wimbledon title this year, this pattern will be broken, the world No. 1 having sat out the pre-Wimbledon grass court season this year as detailed above after winning both Halle and Wimbledon 2003-06. Prior to that, in 2002, Lleyton Hewitt won Queen\u0092s Club before triumphing at the All England Club., 272417=THE \u0091ONE SLAM WONDER\u0092 CLUB.... There are 22 players in the Open Era who have won a lone Grand Slam tournament singles title. The five active players who can still add to their career totals are as follows - all but Gaston Gaudio are in action at 2007 Wimbledon., 105016=                                                        1962,1969     Rod Laver, 198677=1991, 280807=Arthur Ashe                      1          1975, 237147=1980, 2569=1000, 222211=2001 US Open; 2002 Wimbledon, 172464=1970, 165307=Patrick Rafter, 1997-98, 101654=Borg achieved the feat for three years in succession 1978-80, while Laver also did it in 1962, one of eight men to achieve this in the pre-Open Era., 239083=1977, 184932=1980, 46784=Between 1985 and 2002, only one player, Pete Sampras, champion at Queen\u0092s Club in 1995 and 1999, won a pre-Wimbledon grass court title and Wimbledon itself in the same year., 68612=2006, 345717=1997, 157277=Stefan Edberg, 1985-87* (*not played in 1986), 105521=1978-80                  Bjorn Borg, 204972=1996, 159438=Andre Agassi, 2000-01, 322967=1980, 317613=1976, 32195=2003-06, 251415=1997, 201194=1993, 280142=Stan Smith                       1          1972, 14598=             Richard Sears                 US championships                      1881-87 (7 straight titles), 45194=            John McEnroe             1981 Queen\u0092s Club and Wimbledon champion, 400139=2004, 162209=John McEnroe, 1979-80-81 (two defences), 178700=1975, 188687=1983, 234669=1977 (Jan), 65256=2004, 239615=1985, 225021=2005/06/07 Roland Garros, 163803=John McEnroe, 1983-84, 25116=1902-06, 16022=             Laurie Doherty                 Wimbledon                                   1902-06 (5 straight titles)         , 279000=Rod Laver                        2          1968-69 (also won in 1961-62), 162832=Jimmy Connors, 1982-83, 348403=1999, 314937=1974, 61948=2002, 381904=1997, 248947=1995, 235376=1972, 146159=1972-1987, 235911=1977 (Dec), 15043=             William Renshaw            Wimbledon                                   1881-86 (6 straight titles), 15531=             Bill Tilden                         US championships                      1920-25 (6 straight titles), 355114=2004, 147874=1982-1996, 366368=2005 marked the only time since 1991 that no British man were present in the second week (round of 16) of The Championships. It was also the first time in ten years that four-time semifinalist Tim Henman did not post the best performance by a British man, as Andy Murray marked his Wimbledon debut by reaching the third round. Murray also outperformed Henman at the 2006 tournament, reaching the round of 16 while Henman fell in the second round, but will not get the opportunity to try to do the same this year, having withdrawn from 2007 Wimbledon on the Sunday before the event due to continuing problems with his right wrist. The last British man to reach the Wimbledon singles final was Henry \u0093Bunny\u0094 Austin in 1938. Austin lost to Don Budge, the American on his way to tennis\u0092s first Grand Slam, 61 60 63., 194920=1988, 158987=Gustavo Kuerten, 2000-01, 58539=2006, 208818=1999, 306903=1968, 197421=1990, 353773=2003, 46363=            Boris Becker               1985 Queen\u0092s Club and Wimbledon champion, 280475=Jan Kodes                       1          1973, 121654=MOST CONSECUTIVE SLAMS PLAYED\u0085. Dominik Hrbaty has the longest streak of consecutive Slams of any active player, and that streak is still alive through 2007 Wimbledon. This will be his 43rd straight major. Rainer Schuettler\u0092s streak ended at 33 when he failed to qualify for this year\u0092s Roland Garros., 42519=Federer won the title in Halle before each of his Wimbledon victories in the last four years. These four back-to-back Halle and Wimbledon titles account for his record 48-match grass court winning streak, still active ahead of the first round here. Federer established his new Open Era record streak on the surface in the first round at 2006 Wimbledon, breaking Bjorn Borg\u0092s previous mark of 41 straight grass court match wins. Federer\u0092s last grass court defeat was in the first round of 2002 Wimbledon, when he lost to qualifier Mario Ancic 63 76 63. (Ancic is missing this year\u0092s Wimbledon due to glandular fever.), 144442=1972-1989, 164408=Boris Becker, 1985-86, 224099=1998 Roland Garros, 12919=FEDERER BIDS FOR FIFTH CONSECUTIVE TITLE\u0085. Top seed Roger Federer is bidding to become the fourth player in Wimbledon history to win the men\u0092s singles title for five successive years. He won the 2003 title as No. 4 seed, defeating Mark Philippoussis 76 62 76 in the final. As No. 1 seed, he has defended his title for the last three years: in 2004 defeating Andy Roddick 46 75 76 64 in the final; in 2005 again defeating Roddick 62 76 64; and in 2006 defeating Rafael Nadal 60 76 67 63., 177449=1974, 156097=Bjorn Borg, 1978-79-80-81 (three defences), 30792=1961-62, 1968-69, 282386=Goran Ivanisevic              1          2001, 27953=1897-1900, 335003=1989, 397857=2003, 416861=1987, 321626=1979, 246481=1991, 156566=Mats Wilander, 1983-84, 277691=Bjorn Borg                       5          1976-80, 223176=2002 Australian Open, 106383=SANTORO PLAYING 60TH SLAM\u0085. Andre Agassi\u0092s record number of Open Era Grand Slam appearances ended at 61 when he retired at last year\u0092s US Open. Chasing that record is Fabrice Santoro, now second on the list for most majors played - the 34-year-old Frenchman will contest his 60th Grand Slam event at 2007 Wimbledon. Santoro is also playing his 36th consecutive Grand Slam event here (see second table below)., 29337=1910-13, 228989=^ -- Johan Kriek was South African when he won the 1981 Australian Open, but he was a naturalized U.S. citizen when he retained the title in 1982., 139560=Players at 2007 Wimbledon in bold, 365944=Andy Roddick, 2003, 158012=Ivan Lendl, 1989-90, 151766=DEFENDING THE TITLE.\u0085 Following Roger Federer\u0092s successful third defence last year, seven players have now successfully defended their Wimbledon crown on a total of 16 occasions. In 2004, Federer became the seventh player to defend his Wimbledon men\u0092s singles title in the Open Era., 363197=Mark Edmondson, 1976, 326972=1983, 303730=TOP SEED SUCCESS STORY.... Of the 39 Wimbledon championships played since 1968, 17 top seeds have held form and gone on to win the title, including eight of the last ten years. Pete Sampras won six of his seven Wimbledon titles as No. 1 seed, with Lleyton Hewitt successful in 2002 and Roger Federer in the last three years., 40877=NO GRASS COURT WARM-UP FOR FEDERER.... Federer arrives at 2007 Wimbledon having not played a grass court tournament ahead of The Championships for the first time in his career (having made his debut here in 1999). The Swiss has not played an official match on grass in 2007 after withdrawing from his usual warm-up event, Halle, citing fatigue., 240845=1998, 337675=1991, 225949=2003 US Open, 151340=1986-2000, 154676=Jan Kodes, 1970-71, 299285=WIMBLEDON ACHIEVERS\u0085.   The leading performers at Wimbledon in the Open Era are as follows (players at 2007 Wimbledon in bold). Henman\u0092s record puts him in 10th place., 89633=Prior to the completion of 2007 Nottingham and \u0092s-Hertogenbosch, 11 players in the men\u0092s singles draw have captured at least one grass court title: Tomas Berdych, Jonas Bjorkman, Roger Federer, Richard Gasquet, Robbie Ginepri, Sebastien Grosjean, Lleyton Hewitt, Thomas Johansson, Nicolas Kiefer, Michael Llodra and Andy Roddick. , 55208=2004, 409218=             1879            John Hartley                  1905              May Sutton, 332327=1987, 26572=1976-80, 240316=1982, 162554=John Newcombe, 1970-71, 53563=2003, 155388=Bjorn Borg, 1974-75, 165938=Roger Federer, 2004-05-06 (two defences), 226864=2000 US Open; 2005 Australian Open, 173697=1971, 210078=2000, 220370=2003/04/05/06 Wimbledon; 2004/06 Australian Open; 2004/05 US Open, 50256=2001, 379632=1996, 329655=1985, 139754=* denotes a streak which is active through 2007 Wimbledon, 375078=1994, 176588=Jan Kodes, 412111=The last Grand Slam tournament champion to win a title on his first appearance at any event was Rafael Nadal at 2005 Roland Garros., 260595=1971, 202454=1994, 391013=2000, 46068=            John McEnroe             1984 Queen\u0092s Club and Wimbledon champion, 313598=1973, 349746=2000, 316279=1975, 283250=GRAND SLAM ACHIEVERS.\u0085 The top Open Era Grand Slam win-loss records are as follows (players at 2007 Wimbledon in bold). Roger Federer has now moved up to 11th place on this list., 186180=1981, 163460=Ivan Lendl, 1985-86-87 (two defences), 182415=1978, 267960=2000, 206232=1997, 415249=1972, 45488=            Jimmy Connors          1982 Queen\u0092s Club and Wimbledon champion, 249474=1987, 347060=1998, 100422=(does not include 2007 Nottingham or \u0092s-Hertogenbosch), 318951=1977, 282671=Lleyton Hewitt                  1          2002, 250180=1996, 278027=Roger Federer                 4          2003-06      , 159702=Rafael Nadal, 2005-06-07 (two defences), 41653=The last man to win Wimbledon without playing a grass court tournament ahead of The Championships was Andre Agassi in 1992., 161935=Rod Laver, 1968-69, 419116=1998, 164080=Stefan Edberg, 1991-92, 66971=2005, 395582=2002, 336339=1990, 23725=1993-95,1997-2000, 360584=BEST OF BRITISH.... While British men have won the title here more times (35) than any other nation, it has been 71 years since a British man won his home championship. The last to do so was Fred Perry in 1936. None of the other three Grand Slam tournaments has gone even half as long without a resident national champion., 152185=The last five Grand Slam tournaments have all seen successful defences, going back to Rafael Nadal winning his second consecutive Roland Garros title in 2006. This represents the longest streak of successful Grand Slam title defences in the Open Era. Previously, the longest streak of defences of major titles was four, which occurred twice: from Guillermo Vilas defending his Australian Open title in 1979 through John McEnroe\u0092s defence of his Wimbledon crown in 1980; and from Boris Becker\u0092s defence at Wimbledon in 1986 through Ivan Lendl\u0092s defence of his Roland Garros title in 1987., 356458=2005, 157565=Jim Courier, 1991-92, 418131=1988, 1990, 416409=1982, 309583=1970, 140218=MOST CONSECUTIVE WIMBLEDON APPEARANCES\u0085. Jimmy Connors has made the most consecutive singles appearances at Wimbledon in the Open Era, appearing here every year from 1972 until 1989. He also hold the record for most total singles appearances at Wimbledon in the Open Era, playing here for the 21st time in 1992. Brit Greg Rusedski\u0092s streak of Wimbledon appearances stopped at 14 in 2006, following his retirement in April this year., 281478=Michael Stich                   1          1991, 388737=1999, 341695=1994, 263051=1975, 282101=Richard Krajicek              1          1996, 364119=Yannick Noah, 1983, 51904=2002, 377355=1995, 402411=2005, 359152=2007, 344376=1996, 199936=1992, 244006=1989, 165012=Pete Sampras, 1993-94-95 (two defences), 191149=1985}",
    "textBeforeTable": "  2005 marked the only time since 1991 that no British man were present in the second week (round of 16) of The Championships. It was also the first time in ten years that four-time semifinalist Tim Henman did not post the best performance by a British man, as Andy Murray marked his Wimbledon debut by reaching the third round. Murray also outperformed Henman at the 2006 tournament, reaching the round of 16 while Henman fell in the second round, but will not get the opportunity to try to do the same this year, having withdrawn from 2007 Wimbledon on the Sunday before the event due to continuing problems with his right wrist. The last British man to reach the Wimbledon singles final was Henry \u0093Bunny\u0094 Austin in 1938. Austin lost to Don Budge, the American on his way to tennis\u0092s first Grand Slam, 61 60 63.   Best of the Brits (1992-2006) Andy Roddick, 2003",
    "textAfterTable": "  FIRST TIMERS.... There are 23 men making their debut appearance at Wimbledon. Of the 23, seven are qualifiers and three are wild cards. While it has never happened in the Open Era, nine men have won the Wimbledon championship in their first appearance. Six women have achieved this feat.                MEN                                                 WOMEN                                                1877            Spencer Gore               1884              Maud Watson              1878            Patrick Hadow              1887              Lottie Dod              1879            John Hartley                  1905              May Sutton              1919            Gerald Patterson          1919              Suzanne Lenglen              1920            Bill Tilden                      1946              Pauline Betz              1932            Ellsworth Vines             1952              Maureen Connolly              1939            Bobby Riggs              1949            Ted Schroeder              1951            Dick Savitt  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}