{
    "relation": [
        [
            "Patent application number",
            "20120252015",
            "20130217071"
        ],
        [
            "Description",
            "METHODS AND COMPOSITIONS FOR DETECTING GENETIC MATERIAL - The present disclosure provides methods and compositions for detecting polynucleotides in a sample and for quantifying polynucleotide load in a sample. The polynucleotides can be associated with a disease, disorder, or condition. In some applications, methylated DNA is quantified, e.g., in order to determine the load of polynucleotides in a sample. The present disclosure also provides methods and compositions for determining the load of fetal polynucleotides in a biological sample, e.g., the load of fetal polynucleotides (e.g., DNA, RNA) in maternal plasma. The present disclosure provides methods and compositions for detecting cellular processes such as cellular viability, growth rates, and infection rates. This disclosure also provides compositions and methods for detecting differences in copy number of a target polynucleotide. In some embodiments, the methods and compositions provided herein are useful for diagnosis of fetal genetic abnormalities, when the starting sample is maternal tissue (e.g., blood, plasma).",
            "METHODS AND COMPOSITIONS FOR PERFORMING NUCLEIC ACID AMPLIFICATION REACTIONS - The present disclosure provides methods and compositions for performing nucleic acid reactions, such as the reverse transcriptase-polymerase chain reaction (RT-PCR)."
        ],
        [
            "Published",
            "10-04-2012",
            "08-22-2013"
        ]
    ],
    "pageTitle": "Wyatt, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/wyatt-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430502451,
    "recordOffset": 430474032,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Paul Wyatt, Pleasanton, CA US 05-23-2013 PREVENTION AND ALLEVIATION OF STERIC HINDRANCE DURING SINGLE MOLECULE SYNTHESIS - The present invention provides compositions and methods for reducing steric hindrance in the product of nucleic acid polymerase reaction. Methods and compositions of the invention encompass application of exonucleases, endonucleases, and uracil-DNA glycosylases to a nucleic acid polymerase reaction such that newly formed nucleic acid strands are modified (e.g., cleaved) while the polymerase reaction continues to proceed. 20130130323 02-11-2010 PREVENTION AND ALLEVIATION OF STERIC HINDRANCE DURING SINGLE MOLECULE SYNTHESIS - The present invention provides compositions and methods for reducing steric hindrance in the product of nucleic acid polymerase reaction. Methods and compositions of the invention encompass application of exonucleases, endonucleases, and uracil-DNA glycosylases to a nucleic acid polymerase reaction such that newly formed nucleic acid strands are modified (e.g., cleaved) while the polymerase reaction continues to proceed. 20100035269 Published Description Patent application number Paul Wyatt, Foster City, CA US //]]> BarDraw('3096470',['Patent applications by Nat Wyatt, San Francisco, CA US'],[[1,1,1]],['2007','2010','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3096470\" align=\"center\"></div> </div> <canvas id=\"bg3096470\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Nat Wyatt, San Francisco, CA US</p> <div class=\"bar3096470\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>07-18-2013</td> <td><a href=\"/patents/app/20130185248\">SYSTEM AND METHOD FOR ANALYZING AND REPORTING EXTENSIBLE DATA FROM MULTIPLE SOURCES IN MULTIPLE FORMATS</a> - A system and method for analyzing and reporting",
    "textAfterTable": "Paul N. Wyatt, San Carlos, CA US Patent application number Description Published 20130085885 SYSTEM AND METHOD FOR A PHOTOVOLTAIC PLANT MARKET EXCHANGE - Systems and methods for providing a photovoltaic market exchange that permits registered users to create a request for quote (RFQ) for photovoltaic plant services, receive current RFQs, or submit a bid on an RFQ are disclosed. In one embodiment, the market exchange provides a contract management system. In one embodiment, the market exchange is integrated with a plant asset management platform that is configured to evaluate various aspects of a photovoltaic plant ecosystem. 04-04-2013 Paul W. Wyatt, Pleasanton, CA US Patent application number Description Published 20120171683 ANALYSIS OF FRAGMENTED GENOMIC DNA IN DROPLETS - Method of analyzing genomic DNA. Genomic DNA including a target may be obtained. The genomic DNA may be fragmented volitionally to produce fragmented DNA. The fragmented DNA may be passed through a droplet generator to generate aqueous droplets containing the fragmented DNA. An assay may be performed on the droplets to determine a level of the target. In some embodiments, the droplets may contain the genomic DNA at a concentration of at least about five nanograms per microliter, the droplets may be generated at a droplet generation frequency of at least about 50 droplets per second, the droplets may have an average volume of less than about 10 nanoliters per droplet, the droplets",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}