{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Things get stolen occasionally, but it's extremely rare for anyone to actually get hurt or really fear for their personal safety. The general vibe of the campus is very laid back and easy-going and that attitude contributes to making UCSC a pretty safe place all in all.",
            "It's actually been getting a lot bigger in recent years. For a long time there was hardly any Greek Life at UCSC but lately a lot of new fraternities and sororities have sprung up and the quality of their activities as well as their membership have both ballooned. Some of them really buckle down and do scholarly stuff and some of them just party stupid hard (my neighbors) but all in all they're definitely on the up and up at UCSC.",
            "Everyone I know has had nothing short of fantastic experiences in this arena. From the campus newspaper, to the various literary publications, to the gardens and environmental internships, to the clubs, to the radio station, to the fraternities and sororities, there's an unbelievable amount of awesome stuff to do and get involved with at UCSC.",
            "Students who like to play instruments, chill and talk, and do 'weird' stuff will love it here. If your favorite song is Rack City and you drive a lifted truck, it might not be the place for you. Although come to think of it I was at my fratboy neighbor's graduation party the other day and they were playing Rack City. And I think he might drive a lifted truck. So who really knows. There's a lot of different types of people in this town and at this school, that's kind of the beauty of it.",
            "Obviously there's the 'first rain' ceremony, where students of all different backgrounds and interests strip butt-naked when the first rain of the school year begins to fall and run through the campus, which is always pretty liberating and a little awkward. Other than that there's plenty of little traditions to find but you'll have to look around a bit or wait to be initiated into them. Let's just say there's lots of huge trees to be climbed and lots of strange/awesome rites of passage that take place at the top of them.",
            "UCSC's tuition is pretty comparable to all the other UC campuses, and I feel like the education I;ve received here so far is entirely comparable to any other UC. When you factor in the location and the faculty, I think it's money well spent.",
            "Where to begin. With plenty of local bars and wineries, great hiking, awesome beaches, all types of local festivals and events, lots of awesome musical acts passing through and a lively party scene, there's a lot to do in this town. If that's not enough San Francisco is only like an hour and a half away. So yeah, keeping yourself entertained is generally not a problem. Staying inside and studying for finals all weekend when your friends are going out, on the other hand, might be.",
            "The dining halls mostly have pretty good food, and they all vary a bit from one to another. Every Friday a different dining hall serves local produce grown at the on-campus farm or a nearby organic farm, which is always pretty good. That being said there's still a fair amount of bland and unhealthy stuff like burgers with fries doused in nacho cheese, but on the whole there's a lot of variety to be had and the dining halls sometimes cook up some pretty good stuff.",
            "I only stayed in the dorms for a year, but the transfer community at Porter was incredible. The people were nice and into plenty of cool stuff, if you like vinyl, musical instruments, moonlit hikes, making art, some mischief and watching a dude unicycle through the quad while playing a guitar, then I think you'll enjoy the dorm life here. That being said, it does kind of suck to share a room and showers, and to not have a kitchen, but, ces la vie.",
            "I've found my classes thus far to be extremely informative and fairly rigorous, I have friends who go to Berkeley and UCLA and with a little added reading on my own I feel like my education is in every way comparable to theirs. That being said, you really get out of it what you put into it. If you never go to class and don't do any of the reading, it's pretty easy to take a few classes and feel like you didn't learn anything. Pick classes that actually sounds interesting to you and keep it manageable if you want that knowledge to stick with you.",
            "Be prepared to meet a lot of people, some you'll click with and others you won't but as long as you keep an open mind you'll soon find a place you're comfortable in. Try some random activities that sound interesting, they always lead to unexpectedly awesome things, trust me.",
            "UCSC is accepting, diverse, academically rigorous, and offers plenty of opportunities for you to get involved in whatever your niche might be. I am constantly impressed by my instructors, both professors and TA's, as they go to great lengths to genuinely communicate with students, make themselves available to talk, and present their material in an interesting and relevant way. Finally, the campus could not be more beautiful and the community couldn't be nicer, I knew I wanted to go to college here ever since I first visited a friend in the dorms during High School."
        ]
    ],
    "pageTitle": "University of California-Santa Cruz (UCSC) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-California-Santa-Cruz/reviews?_escaped_fragment_=/show/85307",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901977039,
    "recordOffset": 901788297,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{224328=As a college freshman who attended a very small high school (with a graduating class of 90 people), this school is very big with some lectures holding 200+ students. One very important thing to consider about attending UCSC is the tuition rate. Tuition is to raise 5% each year after 2014., 665594=If interested in attending this institution, I would advise you to do good in your school. You do not have to be involved in something for your community or play any sports. I graduated the school with a GPA of 3.7 and SAT score of around 1400 and was able to get in. In other words if you are good at your academics, you are good to go., 342802=April 20th will show you the true hippie tradition of UCSC. Porter Hill is packed with pot-smoking students and locals alike., 789213=It was rated #1 in vegan food I think in 2011 which a plus to me because Im a vegetarian so they do have a lot of options compared to others schools. Usually has a good variety of healthly food and unheathly food. But they start to serve the same stuff and it gets old., 788670=Go to Natural Bridges ! Beautiful beach Use a rent a car or a zip car to go on road trips Hiking on beautiful trails Take a trip or class through OPERS Downtown - restaurants, shops and the Del Mar is a cool movie theater Dances on campus or off campus, 864444=I felt safe on campus, the only incidents that occurred in the academic school year 2012-13 were in town., 1043323=© 2015, Cappex.com, LLC, 192333=This year (2013-2014), we do not have guards at the entrances of campus anymore so almost anyone can set foot on campus, however we do have CSO's and escort systems if you're feeling unsafe at night., 491042=First Rain, or the Naked Run, occurs during the first rainfall of the school year. Beginning by the totem pole at Porter College, students gather together in the nude and run throughout campus. In the rain. Naked. While the rules for First Rain are debated each year, in truth, the naked people decide when it happens. 4/20, an unsanctioned event not at all supported by the campus, is a large gathering of students in the meadow and the surrounding trees behind Porter College to smoke marijuana each April. Drum circles abound. A police force is present, though, they are mostly there to ensure that people stay safe., 21156=Every year at the first rain, thousands of students begin from the east side of campus and run naked to the west side of campus, ending in the OPERS pool. There are often full moon drum circles at the Porter Meadows as well. April 20th brings thousands of students and non-affiliates to the Porter Meadows for the day and has fun student-run activities such as slacklining competitions. The Rock Garden and the Garden of Eden are seemingly magical places in Pogonip that gathers nature loving students frequently (if you can find them). The amphitheater by the bookstore is also a really cool place. There are tons of secret places around campus that people have found and there are plenty more to be discovered since the campus is located inside a forest., 551777=Besides the rain run that started in the fall and the 4/20 event that happen as well as the protest on May, no nothing out of the ordinary., 705370=in 2011 UCSC won the best Vegan food on a college campus. The food is good for omnivores too. There is a wide variety of dining locations on campus, 5 dining halls and specialty restaurants on campus. With your housing you will have the option of selecting a 7 day unlimited food plan, which means you can enter and eat at any hall as much as you want and whenever you want. The availability of food is as good as the quality., 179234=The First Rain Run is a run that occurs on the first day of the year that it rains the entire day and is still raining at nighttime. It begins at Porter College and runs a loop around the school. Everyone runs naked, though a small handful only partially naked. The run ends in a drum circle in the Porter Meadow, though the end is even less official and tends to end however the runners end up wanting it to. Tree Nine is a massive tree above College Nine with many branches that many students climb their first year at UC Santa Cruz. It's not so much event based, but it has been referred to as a rite of initiation to be a real UCSC student. April 20th, or 4/20 is, as you probably know, a nationwide and possibly worldwide event that is specifically for smoking marijuana, at 4:20 on the dot, though not everyone follows that rule. One of the largest gatherings in the nation for this unofficial holiday occurs in the Porter Meadow. Lots of precautions are taken by campus security to keep illegal activity to a minimum on this day, as well as visitors to campus. A lot of people go and don't even smoke, but the tradition is to be in the meadow and do whatever you decide to do with your friends on this day. Drum circles happen in the various meadows at Santa Cruz, especially at the full moon. Everyone gets together to dance, play music, and be with friends., 67768=UC Santa Cruz is not only a great place to learn and succeed in a higher education, but also a great place to live. In fact, Santa Cruz was voted best campus for it's cleanliness. surrounded by trees, trees, and more trees the campus is nice and shady on warm sunny days and throughout the whole year great weather. May i add that the beach is within a 5-10 minute drive. If you are someone who loves nature Santa Cruz is right for you. i know it was for me. i love the hills and the trees in Santa Cruz., 614046=1) Tango lessons at the Palomar 2) Natural Bridges Beach 3) Seabright Beach 4 ) Trivia night at Woodstocks, 981671=UCSC had the honor of placing first place in PETA's Most Vegan Friendly College in 2011. The dining halls try something new at least once a week, always finding new ways of mixing up the menu., 5140=The professors are amazingly brilliant, and most teach with excellent clarity and enthusiasm. There are a few duds, but you'll find that at any school. Tuition was increased for the 2009-2010 school year, but where in the country hasn't college tuition gone up, with the way the economy is? The only thing that I don't like is that a lot of classes are hard to get into as a first or second year because enrollment times are issued by the number of credits you have. It is disappointing to try to sign up for a class numerous quarters in a row, and still not get in because the class closes before your enrollment time rolls around.}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 46 out of 47 people found this review useful. 1 of 217 Mary from Carmichael, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Grace from Venice, CA 01/14/2010 Reviewer is A current student here. 21 out of 21 people found this review useful. 3 of 217 Categories Comments Great for these types of students Santa Cruz is great for students who didn't like the structure of high school, and who like going to the beach during the day and taking hikes in the redwoods after class. Active students are at an advantage; the campus terrain is hilly and vast. But, if you're not yet prepared for that, don't worry. In a few days, your legs will be sore, and, in a few more, they will have adjusted to the new environment. Most students at Santa Cruz are very liberal (as well as most teachers) and are activists for what they believe in. Everyone has a place here, though. Once again, it's just a matter of what you make of it. Tips for prospective students I advice future students to plan their classes much earlier than they will enroll in them -- it is very",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}