{
    "relation": [
        [
            "Date of Receipt",
            "11/25/2013",
            "11/25/2013",
            "11/27/2013"
        ],
        [
            "Date of review",
            "11/25/2013",
            "11/25/2013",
            "12/4/2013"
        ],
        [
            "Action Taken",
            "Called Engineer",
            "Called Engineer",
            "Approved Plans 12/05/13 Approval Number: 1316121"
        ]
    ],
    "pageTitle": "ISDH: Decatur County Plan Review Project Status",
    "title": "Plan Status:",
    "url": "http://www.state.in.us/isdh/23063.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 725489531,
    "recordOffset": 725473560,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46996=New Clarksburg Christian Fellowship 6708 N 700 E Project Number: 1612204 Reviewer: Ed Miller, 60445=Standard Fertilizer Co. 2006 S CR SW 60 Project Number: 1614203 Reviewer:, 23907=David Reynolds Gun Shop 1450 ft W of 850 E on SR 46 Project Number: 1610127 Reviewer: Ed Miller, 64425=Pleasant Valley MHP 1624 W SR 46 Project Number: 1608272 Reviewer: Robert Synko, 57685=Sardinia Machine 12337 S SR 3 Project Number: 1608197 Reviewer: Ed Miller, 30038=Greensburg Vet Clinic 365 E 300 N Project Number: 1611038 Reviewer: Ed Miller, 48783=Next Generation, Inc. about 2476 W SR 46 Project Number: 1612248 Reviewer: Ed Miller, 53938=Polebarn & Greenhouse -Cruser 1668 W. CR 400 S Project Number: 1613188 Reviewer: Robert Synko, 28264=Fasbinder Car/Trailer Sales SR 46 1450 ft W of 850E Project Number: 1614116 Reviewer: Ed Miller, 19084=Anderson's Diesel Injection 1174 E SR 46 Project Number: 1610074 Reviewer: Robert Synko, 56760=Sardinia Baptist Church 12642 S SR 3 Project Number: 1609265 Reviewer: Ed Miller, 13157=For information on projects submitted before January 1, 2005, please contact the Environmental Public Health Division., 25452=Decatur County Rural Water NW Corner of State Rd. 421 and CR 300 N Project Number: 1612075 Reviewer: Zach Snively}",
    "textBeforeTable": "Flood-Dosed System Type: Yes Referred to LHD: Technical Data Sheet issued Action Taken: 4/19/2010 Date of Review: 4/16/2010 Soils Survey Received: Soils 2:   System Type: No Referred to LHD: Additional Information Required Action Taken: 4/16/2010 Date of Review: 4/14/2010 Soils Survey Received: Soils 1: Anderson's Diesel Injection 1174 E SR 46 Project Number: 1610074 Reviewer: Robert Synko Commercial On-Site Sewage Disposal Projects Called Engineer 11/3/2008 8/27/2008 Called Engineer 11/3/2008 8/27/2008 Action Taken Date of review Date of Receipt Plan Status: Mound System Type: No Referred to LHD: Additional Information Required Action Taken: Date of Review: Soils Survey Received: Soils 2:   System Type: No Referred to LHD: Action Taken: Date of Review: Soils Survey Received: Soils 1:",
    "textAfterTable": "Date of Review: 5/9/2007 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Flood-Dosed Connie Wright Commercial 4441 W 700 S Project Number: 1615086 Reviewer: Soils: Soils Survey Received: 4/23/2015 Date of Review: 6/18/2015 Action Taken: Site Rejected Referred to LHD: Yes System Type: Gravity Custom Conveyor 4858 E SR 46 Project Number: 1608199 Reviewer: Ed Miller Soils: Soils Survey Received: 7/14/2008 Date of Review: 7/28/2008 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Flood-Dosed David Reynolds Gun Shop 1450 ft W of 850 E on SR 46 Project Number: 1610127 Reviewer: Ed Miller Soils 1: Soils Survey Received: 5/18/2010 Date of Review: 6/18/2010 Action Taken: Technical Data Sheet issued Referred to LHD: No System Type: Flood-Dosed",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}