{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "3465.54",
            "3508.60",
            "3444.42",
            "3249.48"
        ],
        [
            "NSE",
            "3464.58",
            "3509.36",
            "3445.18",
            "3250.29"
        ]
    ],
    "pageTitle": "United Spirits Stock Price, Share Price, Live BSE/NSE, United Spirits Bids Offers. Buy/Sell United Spirits news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/breweries-distilleries/unitedspirits/US",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 586008223,
    "recordOffset": 585958491,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{133729=UnitedBrewerie Jul Fut, 214913=Zensar Technologies Recommended on Mar 24th 2015, 133218=28 July 2015, 216223=United Spirits is in the Breweries & Distilleries sector. The current market capitalisation stands at Rs 53,189.95 crore. The company management includes Vijay Mallya - Chairman, Anand Kripalu - Managing Director & CEO, Indu Shahani - Independent Director, Ravi Rajagopal - Director, Arunkumar Ramanlal Gandhi - Director, D Sivanandhan - Director, G N Bajpai - Director, Sudhakar Rao - Director, Gilbert Ghostine - Director, Paul Steven Walsh - Director, Vikram Singh Mehta - Director, Rajeev Gupta - Additional Director, Mahendra Kumar Sharma - Addnl. & Ind.Director. It is listed on the BSE with a BSE Code of 532432 and the NSE with an NSE Code of MCDOWELL-N. Its Registered office is at UB Tower, No. 24, Vittal Mallya Road, Bangalore,Karnataka - 560001. Their Registrars are Integrated Enterprises (India) Ltd., 134436=JSWSteel Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}