{
    "relation": [
        [
            "Test",
            "Gradation (extracted)",
            "Asphalt content",
            "VMA",
            "TSR",
            "Density",
            "Air voids",
            "Crushed count",
            "MSG",
            "Smoothness",
            "BSG"
        ],
        [
            "Sampling Location",
            "Truck or paver",
            "Truck or paver",
            "Truck or paver",
            "Truck or paver",
            "Roadway",
            "Truck or paver",
            "Cold feed",
            "Truck or paver",
            "Roadway",
            "Truck or paver"
        ],
        [
            "QC Testing by Contractor",
            "One per 2200 tons",
            "One per 1000 tons",
            "Two per day",
            "One per 11,000 tons",
            "Three per lot",
            "Two per day",
            "Two per day for 2 days then one per day",
            "Two per day",
            "One pass per lane segment (0.1 km)",
            "Two per day"
        ],
        [
            "Assurance Testing Frequency by Minnesota DOT",
            "One per 2200 tons",
            "One per day",
            "One per day",
            "Engineer's discretion",
            "One per day",
            "One per day",
            "One per day",
            "One per day",
            "Observation of QC",
            "One per day"
        ],
        [
            "Acceptance by Minnesota DOT",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on assurance test results",
            "Based on QC testing as observed by the engineer",
            "Based on assurance test results"
        ]
    ],
    "pageTitle": "Appendix B: Summaryof AGency Hmac Specifications Received - Evaluation of Procedures for Quality Assurance Specifications, October 2004 - FHWA-HRT-04-046",
    "title": "",
    "url": "http://www.fhwa.dot.gov/publications/research/infrastructure/pavements/pccp/04046/appb.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432439919,
    "recordOffset": 432406574,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{85630=The contractor's control test cannot be used for acceptance. Acceptance is determined by evaluating the QA tests for compliance with the JMF tolerances for gradation, in-place density, and asphalt content. Quality incentives and disincentives are established by determining if the mix is within the allowable tolerances of the JMF. Acceptance is based on a 3000-ton (2720-Mg) lot., 157776=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 19484=The contractor is responsible for QC for the following properties: air voids, VFA, VMA, dust-to-asphalt ratio, density, temperature, and fractured faces. The contractor must cooperate with the engineer to obtain samples for assurance testing. The contractor must perform at least one set of tests per day or one set per 1000 metric tons., 48037=Oregon DOT is responsible for all assurance testing. Assurance testing is conducted on the properties evaluated for QC. All control and assurance tests are conducted on 1000-Mg sublots., 120063=Pay factors are assigned for thickness and smoothness. Smoothness is determined using a California profilograph. The pay factor for smoothness is presented in the price-adjustment table for smoothness. The lot size for thickness testing shall be 1500 meters (m) (single lane). Each lot is divided into 10 sublots. One core will be taken from each sublot. Any pavement found to be less than 10-percent deficient may remain in place with no additional action required. After analyzing the cores, the PWL for the lot is determined. The following equations allow for the calculation of a bonus or penalty for thickness., 98941=Acceptance is based on verification of the contractor's QC tests. If the engineer's tests and the contractor's tests are within allowable tolerances for the job mix formula, the material is considered to be acceptable. Testing is conducted on equal sublot sizes with a maximum size of 1200 tons (1090 Mg). Five consecutive sublots constitute a lot., 28747=The contractor is responsible for providing a QC plan that must be approved by the engineer prior to construction and providing qualified personnel and equipment to conduct QC testing. The contractor must allow the engineer access to the laboratory to observe any and all testing procedures, calculations, test documentation, and plotting of results. To complete the required testing, the contractor must provide technicians certified at levels I through IV, depending on the test being conducted. The standard lot size is 6000 square yards (5000 m2) of surface area of PCC pavement of the same thickness. A sublot is equal to one-fifth of the surface area of a lot. If the final lot is 3000 square yards (2500 m2 ) or greater, it will be considered a full lot. QC must be exercised on all properties contained in the table entitled QC/QA Tests for Texas., 140444=The contractor's control test cannot be used for acceptance. Under the supervision of the engineer, the contractor must conduct acceptance testing on the materials. The sampling locations will be independent of the QC locations. Acceptance of the material is based on verification of the contractor's acceptance testing by the AHDT's assurance tests. Acceptance and adjustment is by lot. Lot size is 3000 tons (2720 Mg) with 750-ton (680 Mg) sublots. In addition, the engineer will check the smoothness of the pavement by using a rolling straightedge. Variations shall not exceed 5 millimeters (mm) for binder courses and 3 mm for surface courses. At least one pass shall be made for the full length of each lane. If the surface test is deficient, the surface must be corrected at the contractor's expense., 107882=Independent tests on split samples, observing contractor's testing, monitoring control charts, additional sampling as deemed necessary by the engineer, and monitoring the contractor's adherence to the QC plan provides acceptance. The lot size for all properties is 3000 tons (2720 Mg) with 1000-ton (910-Mg) sublots, except for density, which is 1000 tons (910 Mg) with 200-ton (180 Mg) sublots., 95468=The contractor is responsible for QC for the following properties: gradation, asphalt content, Marshall BSG, MSG, air voids, VMA, TSR, crushed count, and moisture content. Testing frequency is determined by taking the day's planned production, dividing by 1000, then rounding that figure to the next whole number., 140803=The Arkansas State Highway and Transportation Department (AHDT) is responsible for all assurance sampling and testing. Testing is based on a lot size of 3000 tons (2720 Mg) with 750-ton (680-Mg) sublots. Assurance testing is conducted on gradation, asphalt content, air voids, VMA, Marshall stability, and in-place density., 108434=Maryland DOT is responsible for all assurance testing. Assurance testing is conducted on split samples provided by the contractor. Properties measured include gradation, density, asphalt content, MSG, VTM, VMA, Marshall flow smoothness, and Marshall stability. Additional assurance samples may be taken and tested if deemed necessary by the engineer. The lot size for all properties is 3000 tons (2720 Mg) with 1000-ton (910-Mg) sublots, except for density, which is 1000 tons (910 Mg) with 200-ton (180-Mg) sublots.}",
    "textBeforeTable": "Table 58. Alaska weight factors. Weight Factors where: PAB = price-adjustment base (equal to $33.00/Mg)       (38) After the DPF and CPF are known, the pay adjustment is determined by the following: where: f factors are determined from the Weight Factors table below      (37) Pay factors are assigned for gradation, in-place density, and asphalt content. For density, the density pay factor (DPF) is determined by calculating the quality level of the lot and then selecting a pay factor from a table according to the sample size. The pay factor for gradation and asphalt content (composite pay factor (CPF)) is determined by the following equation: Pay Factors Acceptance is based on the results of the assurance tests. Acceptance is based on a lot size of 5000 tons (4535 Mg), with tests conducted on 500-ton (454 Mg) sublots. Acceptance of the material and any associated pay factors are determined using quality-level analysis. Acceptance The engineer is responsible for all assurance testing. Assurance testing is conducted",
    "textAfterTable": "Density Roadway Determined by contractor One per sublot Based on assurance testing Arkansas Quality Control The contractor is responsible for developing the mix design for the project, providing a QC plan that must be approved by the engineer prior to construction, and providing qualified personnel and equipment to conduct QC testing. The contractor must allow the engineer access to the laboratory to observe any and all testing procedures, calculations, test documentation, and plotting of results. The sampling location and testing frequency are determined by the contractor with the exception of gradation (one per 750 tons (680 Mg) minimum), and must be sufficient for control of the mix. The contractor is responsible for QC for the following properties: gradation, asphalt content, air voids, VMA, Marshall stability, Maximum theoretical density, in-place density, and water sensitivity. Mix design verification is evaluated for the following properties: gradation, Marshall stability, Marshall flow, air voids, VMA, density, asphalt content, dust-to-asphalt ratio, and water sensitivity. Quality Assurance The Arkansas State Highway and Transportation Department (AHDT) is responsible for all assurance sampling and testing. Testing is based on a lot size of 3000 tons (2720 Mg) with 750-ton (680-Mg) sublots. Assurance testing is conducted on gradation, asphalt content, air voids, VMA, Marshall stability, and in-place density. Acceptance The contractor's control test cannot be used for acceptance. Under the supervision of the engineer, the contractor must conduct acceptance testing on the materials. The sampling locations will be independent of the QC locations. Acceptance of the material",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}