{
    "relation": [
        [
            "Patent application number",
            "20090050057",
            "20090061088",
            "20090188776",
            "20100080673",
            "20110108394",
            "20110120682",
            "20110290181",
            "20110290186",
            "20120017833",
            "20120055404",
            "20120118541",
            "20120281975",
            "20120301619",
            "20140076362"
        ],
        [
            "Description",
            "APPARATUS FOR CONTINUOUS COATING - Apparatus for continuous coating has a chamber wall which forms a processing chamber, thermal insulation which forms a processing area within the chamber, a transportation device for substrates located in the processing area with a substrate transportation direction of the substrates lying in the lengthwise extension of the apparatus for continuous coating, and heating equipment which heats the substrates, is designed to minimize unwanted coating, in particular of parts of the apparatus, in order to minimize the expense of maintaining and servicing the apparatus A condensation element is positioned in the processing chamber, which extends into the processing area and binds the arising vapor through condensation.",
            "METHOD AND DEVICE FOR PRODUCING AND PROCESSING LAYERS OF SUBSTRATES UNDER A DEFINED PROCESSING ATMOSPHERE - A method is provided for producing a processing atmosphere for coating substrates, with this method primarily being used in CVD-processes for precipitating an individual layer or a system of individual layers under defined processing atmospheres, in which processing gas is supplied to a coating chamber in a defined manner and exhausted. Via the method and related devices, a variable processing atmosphere is adjustable inside the coating chamber in a flexible, reliable and homogenous manner, and requiring a reduced maintenance and energy expense, even when the substrate is heated. The processing gas is created by at least one gas channel extending perpendicular in reference to the substrate by way of supplying gas flow or exhausting, with a lateral extension being equivalent to the width of the substrate.",
            "Transport Device, Especially for Transporting Flat Substrates Through a Coating Installation - The invention relates to a transport device, especially for transporting flat substrates through a coating installation. Said transport device comprises a plurality of transport rolls (",
            "TRANSPORTING DEVICE FOR A VACUUM PROCESSING APPARATUS, DRIVE DEVICE FOR A COMPONENT OF A VACUUM PROCESSING APPARATUS, AND A VACUUM PROCESSING APPARATUS - A transport device for a vacuum processing system, a drive unit for high temperature processes in vacuum processing systems, and a vacuum processing system employ a drive unit which operates without the polygonal effect, can be connected endlessly, is suitable for high temperatures, is insensitive to radiation heat, does not generate degassing and does not need a lubricant. The drive unit includes a traction element, guided around at least two deflecting rollers. The traction element is a continuous metal strip.",
            "Transport Device, Especially for Transporting Flat Substrates Through a Coating Installation - The transport device especially for transporting flat substrates through a coating installation comprises a plurality of transporting rolls, which are arranged transversely in relation to the transporting direction, and supporting rolls are also provided.",
            "METHOD AND DEVICE FOR THE ABSORPTION OF HEAT IN A VACUUM COATING APPARATUS - An apparatus and method for heat absorption in vacuum coating installations includes an absorber having a line system to supply a coolant. The line system is enclosed by a jacket tight relative to the vacuum chamber, flow spaces are arranged between the line system and the jacket, which are connected to a source of heat exchanger medium so that the line system is flowed around by a heat exchanger medium sealed relative to the vacuum chamber.",
            "METHOD AND DEVICE FOR CLEANING AN OPTICAL POSITION MEASUREMENT SYSTEM FOR SUBSTRATES IN A COATING INSTALLATION - A method and device are provided for cleaning of an optical position measurement system in a coating installation. The optical position measurement system includes a cantilever, and a sensor head having a radiation inlet and/or outlet for the reception and/or emission of an optical signal, at a free end of the cantilever. For tempering of the sensor head, a local thermoregulation is applied using a heater and/or cooling device for heating and/or cooling of the sensor head depending on thermal conductivity of material of at least the sensor head and depending on secondary heat in the coating installation.",
            "METHOD AND DEVICE FOR PRODUCING AND PROCESSING LAYERS OF SUBSTRATES UNDER A DEFINED PROCESSING ATMOSPHERE - A method is provided for producing a processing atmosphere for coating substrates, with this method primarily being used in CVD-processes for precipitating an individual layer or a system of individual layers under defined processing atmospheres, in which processing gas is supplied to a coating chamber in a defined manner and exhausted. Via the method and related devices, a variable processing atmosphere is adjustable inside the coating chamber in a flexible, reliable and homogenous manner, and requiring a reduced maintenance and energy expense, even when the substrate is heated. The processing gas is created by at least one gas channel extending perpendicular in reference to the substrate by way of supplying gas flow or exhausting, with a lateral extension being equivalent to the width of the substrate.",
            "CONVEYOR DEVICE AND SUBSTRATE TREATMENT INSTALLATION - Conveyor devices, in particular for use in substrate treatment devices, and configurations of substrate treatment devices, in particular horizontal coating installations for the mass coating of plate-like substrates during the production of solar cells are provided. The conveyor device comprises a multiplicity of conveyor rollers, each mounted rotatably at both ends thereof. During operation of the conveyor device, at least one conveyor roller is displaceable axially, i.e. parallel to the axis of rotation thereof.",
            "APPARATUS FOR CONTINUOUS COATING - Apparatus for continuous coating has a chamber wall which forms a processing chamber, thermal insulation which forms a processing area within the chamber, a transportation device for substrates located in the processing area with a substrate transportation direction of the substrates lying in the lengthwise extension of the apparatus for continuous coating, and heating equipment which heats the substrates, is designed to minimize unwanted coating, in particular of parts of the apparatus, in order to minimize the expense of maintaining and servicing the apparatus A condensation element is positioned in the processing chamber, which extends into the processing area and binds the arising vapor through condensation.",
            "DEVICE FOR CONTROLLING THE TEMPERATURE OF SUBSTRATES - A device for controlling the temperature of substrates in a substrate-treatment system, in which a substrate can be guided in the longitudinal extension of the substrate-treatment system in a substrate transport plane within a vacuum chamber past a treatment device, solves the problem of dynamically shaping a dynamic change of the thermal insulation to control the heat transfer in the substrate and thereby, reduce, in particular, thermal inertias by providing a heat-absorbing cooler side of the substrate transport plane. The heat-absorbing cooler can be shielded, at least partially from the substrate transport plane, using an insulation member.",
            "SURFACE HEATING DEVICE FOR A SUBSTRATE TREATMENT DEVICE AND SUBSTRATE TREATMENT DEVICE - A surface heating device for a substrate treatment device with increased power density and improved homogeneity of heat radiation includes a jacket tube heater with straight tube sections and bent tube sections in which straight tube sections are arranged parallel to each other in a main plane and straight tube sections are connected to each other by bent tube sections, so that at least part of the bent tube sections are aligned sloped relative to the main plane.",
            "SYSTEM AND METHOD FOR COATING SUBSTRATES - A system and method for coating substrates includes transporting rolls and a collecting container for collecting coating material.",
            "CONTINUOUS SUBSTRATE TREATMENT PLANT AND CLEANING METHOD - A substrate treatment plant includes a process chamber delimited by chamber walls and in the process chamber a substrate conveying unit for the horizontal conveyance of slab-shaped substrates in one conveying plane and in one conveying direction. The substrate conveying unit includes an arrangement of rotatably mounted, cylindrical conveying rollers transversely arranged to the conveying direction, the topmost generatrices of the conveying rollers defining the conveying plane, and at least one substrate treatment unit, which is located above the conveying plane, and at least one gas inlet. In the region of the substrate treatment unit at least one additional heating unit is located below the conveying plane and a condensation unit is located under the substrate conveying unit."
        ],
        [
            "Published",
            "02-26-2009",
            "03-05-2009",
            "07-30-2009",
            "04-01-2010",
            "05-12-2011",
            "05-26-2011",
            "12-01-2011",
            "12-01-2011",
            "01-26-2012",
            "03-08-2012",
            "05-17-2012",
            "11-08-2012",
            "11-29-2012",
            "03-20-2014"
        ]
    ],
    "pageTitle": "Hentschel, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hentschel-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439716463,
    "recordOffset": 439697781,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Michael Hentschel, Dresden DE 11-08-2012 SAW BLADE FOR SAWING HOLLOW PROFILES AND FORM PROFILES - A saw blade ( 20120279372 Published Description Patent application number Martin Hentschel, Spangenberg DE 09-29-2011 Plastic Hollow Part and Method for the Manufacture Thereof - The invention relates to a plastic hollow part ( 20110236613 Published Description Patent application number Maik Hentschel, Bobeck DE 08-11-2011 Hammer and/or Hammer Drill Having Relubricating Device - The invention relates to a hammer and/or hammer drill acting as a breaker, having a drive, a hammer mechanism driven by the drive, and a crank device disposed in the force flow path between the drive and the hammer mechanism and coupled to an element of the hammer mechanism for transforming a rotary motion of the drive into an oscillating translation motion of the element of the hammer mechanism. A collecting device for collecting lubricant is provided above the hammer mechanism relative to a vertical operating position. The collecting device may be a collecting tank open at the top and defined by a partition of the housing and a separating floor. A connecting rod of the crank device may extend through a cutout in the separating floor. Lubricant collects above the separating floor can be delivered again and again into the interior of the housing by a delivery element. 20110192621 Published Description Patent application",
    "textAfterTable": "Patent applications by Michael Hentschel, Dresden DE Reinhard Hentschel, Essen DE Patent application number Description Published 20130068958 DETECTOR AND METHOD FOR DETECTING NEUTRONS - A neutron detector includes a bulk of a neutron moderating material, a first housing consisting of or comprising a gamma ray attenuating material, a second housing consisting of or comprising a gamma ray attenuating material, a first sensor device comprising a gadolinium cover disposed in the first housing, and a second sensor device disposed in the second housing. The first sensor device and the second sensor device are each sensitive to gamma rays. The first housing and the second housing are arranged adjacent to each other in the bulk. 03-21-2013 Stefan Hentschel, Weisendorf DE Patent application number Description Published 20110235276 POWER CONVERTER MODULE WITH COOLED BUSBAR ARRANGEMENT - A power converter module with a liquid-cooled heat sink, a busbar arrangement having at least two busbars, at least two power semiconductor modules, which are mechanically connected to the liquid-cooled heat sink for thermal conduction and are electrically connected to connections of the power converter module by the busbar arrangement has at least one coolant line forming a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}