{
    "relation": [
        [
            "Author",
            "",
            "Xie H.",
            "Xie H.",
            "Xie H."
        ],
        [
            "Abstract",
            "",
            "3075",
            "3200",
            "3368"
        ],
        [
            "Session",
            "",
            "Posters: Mars Polar Science, Thu, Dabney Gardens",
            "Posters: Mars Polar Science, Thu, Dabney Gardens",
            "Posters: Mars Polar Science, Thu, Dabney Gardens"
        ]
    ],
    "pageTitle": "Seventh International Mars Conference: Author Index to Program",
    "title": "",
    "url": "http://www.lpi.usra.edu/meetings/7thmars2007/7thmars2007.authindex.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 569934815,
    "recordOffset": 569902730,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "A   B   C   D   E   F   G   H   I   J   K   L   M   N   O   P   Q   R   S   T   U   V   W   X   Y   Z These pages provide an alphabetical listing of Seventh Mars presentations by author. Session titles provide a link to the program listing. Abstract numbers provide a link to the individual abstracts. * Asterisks denote speakers. SEVENTH INTERNATIONAL MARS CONFERENCE AUTHOR INDEX TO PROGRAM obj.action=\"http://www.lpi.usra.edu/search/\"; var obj=returnObjById(\"navsearchbox_002803415602668413512:cu4craz862y\") } return r; else if(document.layers)var r=document.layers[id]; else if(document.all)var r=document.all[id]; if(document.getElementById)var r=document.getElementById(id); function returnObjById(id){ //get object in a crossbrowser way",
    "textAfterTable": "Adou W. 3252 Modern Mars, Wed, p.m., Beckman Auditorium Aggarwal S. P. 3116 Posters: Mars Water and the Martian Interior, Tue, Dabney Gardens Aghazarian H. 3151 Posters: Mars Polar Science, Thu, Dabney Gardens Agnor C. 3332 Posters: Mars Water and the Martian Interior, Tue, Dabney Gardens Aharonson O. 3354 Posters: Mars Water and the Martian Interior, Tue, Dabney Gardens Aharonson O. 3321 Posters: The Martian Climate and Current Precesses, Wed, Dabney Gardens Aharonson O. 3252 Modern Mars, Wed, p.m., Beckman Auditorium Aharonson O. * 3366 Martian Stratigraphy and Sedimentology, Fri, a.m., Beckman Auditorium Ali M. 3016 Posters: Mars Polar Science, Thu, Dabney Gardens Ali M. 3391 Posters: Mars Polar Science, Thu, Dabney Gardens Allen C. C. 3007 Posters: Mars Geology, Mon, Dabney Gardens Allen C. C. 3065 Posters: Mars Polar Science, Thu, Dabney Gardens Altieri F. 3248 Posters: The Martian Climate and Current Precesses, Wed, Dabney Gardens Amashukeli X. 3379 Posters: Mars Polar Science, Thu, Dabney Gardens Ambard A. 3043 Posters: Mars Water and the Martian Interior, Tue, Dabney Gardens Anderson F. S. 3269 Posters: Mars Geology, Mon, Dabney Gardens Anderson G. T. 3360",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}