{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always feel safe on the Sinclair Campus. The parking garage is well lit and security is always around.",
            "I enjoy sports and politics.",
            "Food and dining are awesome. There are several locations for snacks or dining.",
            "I don't seem to have much of the academic rigor. I have a flexible schedule with a combination of online and on campus classes.",
            "Get in touch with a career counselor to assist with career planning.",
            "Sinclair i easy to enroll. the staff is helpful and friendly. There are a variety of classes and the schedules are flexible."
        ]
    ],
    "pageTitle": "Sinclair Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Sinclair-Community-College/reviews?_escaped_fragment_=/show/63680",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912225735,
    "recordOffset": 912155307,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{304102=In my opinion, I transferred from another college to Sinclair in September of 2011, and have found that Sinclair has exceeded my speculations in terms of scholastic and performance skills. The Professors at Sinclair are dedicated and willing to help you out in any level of your academic achievement, and will g go out of their way to make sure you truly understand what you are expected to learn in your field, and also in the prerequisite courses. If I were to start all over again, I would do it the same way, making Sinclair my first choice in terms of academic achievement, academic counseling and academic performance., 106492=Sinclair is a diverse, well-established community college that offers a multitude of degrees. They are both regionally and nationally accredited in their nursing program. Best of all, they are converting to semesters starting Fall 2012., 354418=Irish dance competition every year. Last weekend in June, 416047=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/02/2011 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 104 Jenna from New Carlisle, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Great for these types of students For those who are undecided, Sinclair is a great, cheap college to attend to take different classes to figure out what you want. Tips for prospective students Be ready to study and do homework! Bang for the buck Sinclair is a Community College, it offers the cheap tuition but with a fantastic curriculum. Am enjoying being here It is small so you get to know your fellow students. With a small population teachers have time for one on one help and are glad to work with you. Am learning a lot Sinclair offers a broad spectrum of all types of classes and is accredited and ranked as one of the best community colleges in the country. Login to rate or flag the reviews Ann from Huber Heights, OH 06/22/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 104",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}