{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "None experienced",
            "None",
            "Student activities",
            "Adult learners, international students, full-time employees returning to school, self-disciplined students",
            "None",
            "My experience here is much better than 5 years on campus at another SUNY school.",
            "There are several student activities and alumni activities available, but you do have to reach out to participate. You can do most of your studies online if you choose, therefore, you can remain connected to your current living/social situation.",
            "Like the dorms, you're on your own.",
            "You live in your own home/apartment. Dorms not available",
            "Since studies are mainly self-driven, you truly get out of it what you put into it. You really can schedule your homework and mentor meetings to work with a full-time job.",
            "Take the time to plan your studies carefully. The variety of studies and mentors in the profession are plentiful and make for excellent networking opportunities.",
            "SUNY Empire State College is the perfect school for any working student. The program of study is designed to be applied immediately to your work life. Courses are mentor-led, not lecture-hall style."
        ]
    ],
    "pageTitle": "SUNY Empire State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-Empire-State-College/reviews?_escaped_fragment_=/show/40833",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887780975,
    "recordOffset": 887747709,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{145658=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/23/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 3 out of 3 people found this review useful. 1 of 37 D from holliswood, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "What to do for fun Well, I find my learning fun and going to church, but for others there is social life around the town, a big lake and lots of woods. Food and Dining There is all kinds of restaurants around the town. We have colleges in our small town. I have recently graduated from the one college and now will be attending the other. Dorm Life There is no dorms with Empire because there is online learning. Academic Rigor I do not know about their academic rigor yet; however, I was warned to ask for someone else for a mentor if I got a certain professor, but it appears I did not get here. Tips for prospective students I was informed that you need to be able to write well and that there is no test there. I do find this appealing, because I suffer from test anxiety. I have learned how to write a paper well so I feel very encouraged about attending. In three sentences I am starting there in the fall, so far out of six people I have spoken",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}