{
    "relation": [
        [
            "Part #",
            "RS422TERMINAL",
            "VW3A3402",
            "VW3A3402",
            "PCD4H311",
            "6FX20012FB50"
        ],
        [
            "Distributor",
            "Radwell",
            "Allied Electronics, Inc.",
            "Radwell",
            "Radwell",
            "Radwell"
        ],
        [
            "Manufacturer",
            "Sick Optic Electronic",
            "TELEMECANIQUE",
            "Square D",
            "Sodeco Maxmar",
            "Siemens Building Technologies"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Servo Products, Servo Drive & Servo Control",
            "Not Provided"
        ],
        [
            "Description",
            "ENCODER SIGNAL MULTIPLER FOR USING MULTIPLE CAMERA",
            "ENCODER CARD RS422 15 VDC out ONLY 5 VDC IN",
            "ENCODER CARD RS422 15 VDC OUT ONLY 5 VDC IN",
            "SERVO CONTROL MODULE 1AXIS ENCODER 5V/RS422",
            "ENCODER RS422/TTL/1500 PULSES,RADIAL CON"
        ]
    ],
    "pageTitle": "Encoder RS422 | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/encoder_rs422",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472312203,
    "recordOffset": 472281535,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{83241=Description: . with RS422. A resolution of up to 1024 pulses per revolution can be selected. Thanks to the line driver and high resolution, it is an excellent choice for high-precision position and speed control applications. The cables of the ENX encoder are configurable in seven lengths, from 50 mm to max. 1000 mm, 102296=Description: Encoder signals transmitter (IF60) and receiver (IF61) through optical fibers Suitable for use with Line Driver (RS-422) and Push-Pull (HTL) incremental encoders and sensors Immune to electromagnetic (EMI) and radio frequency (RFI) interference Safe transmission of encoder signals up to 2000 m, 93616=Description: The TTL outputs of some incremental encoders can sink (pull down) less than 4mA and source (pull up) less than 200uA. The PC5 is a small, plug-in RS-422 cable driver board that drives long cables up to 1000 feet using differential signalling to provide improved noise immunity. The PC5 can be used, 25060=Description: The DMC-1500 stand-alone controller with RS232 is a member of the Legacy Series, a prior generation of general-purpose controllers with a widely installed base. For new applications, Galil recommends the new generation, Optima series DMC-2100 stand-alone controller with RS232/Ethernet connectivity.}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top TA046: Design of a Single Card Telemetry Module for Smart Munitions Testing ). The module is smaller than a standard business card and utilizes both COTS and M/A-COM proprietary technologies. The PCM encoder is designed for eight (8) analog inputs, eight (8) discrete inputs, and one (1) synchronous RS-422 serial interface. Data rates of 300 kbps to 6 Mbps are supported. The module More Information Top Indicates content that may require registration and/or purchase. DGV700 Converters - Installation Manual Encoder signal RS422 A+ . SSI encoder datasheets and application notes, data sheet, circuit, pdf, cross reference, pinout, datasheet | Datasheets.org.uk Tags: sin/cos encoder Texas signal 11ÂµA incremental for TTL GAL16V8R* sharp opto   ENCODER / RS422 *  3641 04   datasheet abstract.. push-pull datasheets and application notes, data sheet, circuit, pdf, cross",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}