{
    "relation": [
        [
            "Scots",
            "1 lippie (or forpet)",
            "1 peck = 4 lippies",
            "1 firlot = 4 pecks",
            "1 boll = 4 firlots",
            "1 chalder = 16 bolls"
        ],
        [
            "Imperial",
            "0.499 gallon",
            "1.996 gallons",
            "3 pecks 1.986 gallons",
            "3 bushels 3 pecks 1.944 gallons",
            "7 quarters 7 bushels 3 pecks 1.07 gallons"
        ],
        [
            "Metric",
            "2.268 litres",
            "9.072 litres",
            "36.286 litres",
            "145.145 litres",
            "2322.324 litres"
        ]
    ],
    "pageTitle": "Scottish Archive Network - Scottish Weights and Measures Guide (Capacity)",
    "title": "",
    "url": "http://www.scan.org.uk/measures/capacity.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 692196597,
    "recordOffset": 692188395,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{16637=Until the middle of the 19th century a wide diversity of weights and measures were used in Scotland. Standardization took place from 1661 onwards, and in 1824 an act of parliament imposed the English versions of Imperial measures and defined the proportions of older measures to Imperial measures.}",
    "textBeforeTable": "Until the middle of the 19th century a wide diversity of weights and measures were used in Scotland. Standardization took place from 1661 onwards, and in 1824 an act of parliament imposed the English versions of Imperial measures and defined the proportions of older measures to Imperial measures. The phrase thrie f[irlottis] beir, as recorded in an inventory, showing the abbreviation for the word firlottis.   DRY CAPACITY The basic unit of dry capacity was the boll (from the word ‘bowl’). A quarter of a boll was a firlot (a ‘fourth lot’). A quarter of this was a peck (possibly from the word ‘pack’ or else from the French picotin, meaning a peck, or the Latin picotus, a liquid measure). A quarter of a peck was a forpet (a corruption of ‘fourth peck’) or lippie (from the Anglo-Saxon leap, meaning a ‘basket’). Sixteen bolls made a chalder or chaldron (from the French chaudron, meaning a ‘kettle’). Lippies, pecks, firlots, bolls and chalders varied depending on what was being measured. According to the standard measure of Linlithgow, adopted in 1661: For wheat, peas, beans, meal etc Scottish Weights and Measures:",
    "textAfterTable": "For barley, oats, malt etc. Scots Imperial Metric 1 lippie (or forpet) 0.728 gallon 3.037 litres 1 peck = 4 lippies 1 peck 0.912 gallons 13.229 litres 1 firlot = 4 pecks 1 bushel 1 peck 1.650 gallons 52.916 litres 1 boll = 4 firlots 5 bushels 3 pecks 0.600 gallons 211.664 litres 1 chalder = 16 bolls 11 quarters 5 bushels 1.615 gallons 3386.624 litres LIQUID CAPACITY The basic unit of liquid capacity was the Scots pint (originally from the Latin, pingo, pinctum meaning ‘to paint’, via various European languages, such as the French pinte and Dutch pint; equating the size of the measure with a painted mark on a measuring jug or bowl). The pint was sometimes referred to as the jug or joug. 8 pints made a gallon (from the old French galon or jalon, meaning a ‘jar’ or ‘bowl’). Half a pint was a chopin (from the French liquid measure, the chopine), and a quarter of a pint was a mutchkin (from the diminutive of a kind of cap, a mutch). A sixteenth of a pint was a gill (from the Old French, gelle, a wine measure or ‘flask’). According to the standard measure of Stirling, adopted in 1661:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}