{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2011-01-01T00:00:00",
            "2011-01-01T00:00:00",
            "2011-01-01T00:00:00",
            "2013-03-01T00:00:00",
            "2013-05-15T00:00:00"
        ],
        [
            "Description",
            "GPS based surveys were utilized to support both processing and testing of LiDAR data within FEMA designated Areas of Interest (AOIs). Geographically distinct ground points were surveyed using GPS technology throughout the AOIs to provide support for three distinct tasks. Task 1 was to provide Vertical Ground Control to support the aerial acquisition and subsequent bare earth model processing. To accomplish this, survey-grade Trimble R-8 GPS receivers were used to collect a series of control points located on open areas, free of excessive or significant slope, and at least 5 meters away from any significant terrain break. Most if not all control points were collected at street/road intersections on bare level pavement. Task 2 was to collect Fundamental Vertical Accuracy (FVA) checkpoints to evaluate the initial quality of the collected point cloud and to ensure that the collected data was satisfactory for further processing to meet FEMA specifications. The FVA points were collected in identical fashion to the Vertical Ground Control Points, but segregated from the point pool to ensure independent quality testing without prior knowledge of FVA locations by the aerial vendor. Task 3 was to collect Consolidated Vertical Accuracy CVA) checkpoints to allow vertical testing of the bare-earth processed LiDAR data in different classes of land cover, including: Open (pavement, open dirt, short grass), High Grass and Crops, Brush and Low Trees, Forest, Urban. CVA points were collected in similar fashion as Control and FVA points with emphasis on establishing point locations within the predominant land cover classes within each AOI or Functional AOI Group. In order to successfully collect the Forest land cover class, it was necessary to establish a Backsight and Initial Point with the R8 receiver, and then employ a Nikon Total Station to observe a retroreflective prism stationed under tree canopy. This was necessary due to the reduced GPS performance and degradation of signal under tree canopy. The R-8 receivers were equipped with cellular modems to receive real-time correction signals from the Keystone Precision Virtual Reference Station (VRS) network encompassing the Region 1 AOIs. Use of the VRS network allowed rapid collection times (~3 minutes/point) at 2.54 cm (1 inch) initial accuracy. All points collected were below the 8cm specification for testing 24cm, Highest category LiDAR data. To ensure valid in-field collections, an NGS monument with suitable vertical reporting was measured using the same equipment and procedures used for Control, FVA and CVA points on a daily basis. The measurement was compared to the NGS published values to ensure that the GPS collection schema was producing valid data and as a physical proof point of quality of collection. Those monument measurements are summarized in the Accuracy report included in the data delivered to FEMA. In order to meet FEMA budgetary requirements, AOIs were consolidated into Functional Groups: if AOIs were contiguous, they were treated as one large AOI to allow collection of 20 FVA points and 15 additional CVA points across the group of AOIs. 20 FVA points are necessary to allow testing to CE95 - 1 point out of 20 may fail vertical testing and still allow the entire dataset to meet 95% accuracy requirements. In similar fashion, 20 CVA points are necessary to test to CE95 as discussed above. 15 CVA points were collected per AOI or per Functional Group with the intention at the outset that 5 of the collected FVAs would perform double-duty as Open-class CVA points, to total 20 CVAs per AOI or Functional Group. The Functional Groups are as follows: Narragansett/Charles/Blackstone(northeast), Nashua, Blackstone(north and west), Quinnipiac, Quincy/Suffolk (while included as part of the FEMA Charles AOI, was physically separated from the Charles AOI polygon and treated as an independent functional area). The following software packages and utilities were used to control the GPS receiver in the field during data collection, and then ingest and export the collected GPS data for all points: Trimble Survey Controller, Trimble Pathfinder Office. The following software utilities were used to translate the collected Latitude/Longitude Decimal Degree HAE GPS data for all points into Latitude/Longitude Degrees/Minutes/Seconds for checking the collected monument data against the published NGS Datasheet Lat/Long DMS values and into UTM NAD83 Northings/Eastings: U.S. Army Corps of Engineers CorpsCon, National Geodetic Survey Geoid09NAVD88. MSL values were determined using the most recent NGS-approved geoid model to generate geoid separation values for each Lat/Long coordinate pair. In this fashion, Orthometric heights were determined for each Control, FVA and CVA point by subtracting the generated Geoid Separation value from the Ellipsoidal Height (HAE) for publication and use as MSL NAVD88 (09).",
            "Using a Leica ALS60 LiDAR system, 101 flight lines of highest density (Nominal Pulse Spacing of 1.0m) were collected over the Quinnipiac area which encompasses 443 square miles. A total of 10 missions were flown on Dec 11, 2010, Dec 16, 2010, Dec 17, 2010, Dec 18, 2010, March 29, 2011, March 30, 2011, May 6, 2011, May 8, 2011, May 10, 2011, and May 27, 2011. One airborne global positioning system (GPS) base station was used to support the LiDAR data acquisition: MMK-A. Additional information can be found in the Post-Flight Aerial Acquisition Report.",
            "Leica proprietary software was used in the post-processing of the airborne GPS and inertial data that is critical to the positioning and orientation of the sensor during all flights. Pairing the aircraft's raw trajectory data with the stationary GPS base station data, this software yields Leica's IPAS TC (\"Inertial Positioning and Attitude Sensor - Tightly Coupled\") smoothed best estimate of trajectory (an \"SBET\", in Leica's .sol file format) that is necessary for Leica's ALSPP post processing software to develop the resulting geo-referenced point cloud from the LiDAR missions. The point cloud is the mathematical three dimensional composite of all returns from all laser pulses as determined from the aerial mission. At this point this data is ready for analysis, classification, and filtering to generate a bare earth surface model in which the above-ground features are removed from the data set. The point cloud was created using Leica's Post Processor software. GeoCue was used in the creation of some of the files needed in downstream processing, as well as in the tiling of the dataset into more manageable file sizes. The TerraScan and TerraModeler software packages are then used for the automated data classification, manual cleanup, and bare earth generation from this data. Project specific macros were used to classify the ground and to remove the side overlap between parallel flight lines. All data was manually reviewed and any remaining artifacts removed using functionality provided by TerraScan and TerraModeler. QT Modeler was used as a final check of the bare earth dataset. GeoCue was then used to create the deliverable industry-standard LAS files for both the All Point Cloud Data and the Bare Earth. In-house software was then used to perform final statistical analysis of the classes in the LAS files.",
            "The NOAA Coastal Services Center (CSC) received the topographic files in LAZ V1.2 format (a compressed LAS format). The files contained lidar elevation measurements. The data were received in NAD83 UTM Zone 18N coordinates and were vertically referenced to NAVD88 using the Geoid09 model. The vertical units of the data were meters. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The topographic las files were converted from a Projected Coordinate System (UTM 18N) to a Geographic Coordinate system (GCS). 2. The topographic las files' horizontal units were converted from meters to decimal degrees. 3. The topographic las files were converted from orthometric (NAVD88) heights to ellipsoidal heights using Geoid09. 4. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/ct2011_fema_quinnipiacriver_m1472.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 612179311,
    "recordOffset": 612165182,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:ct2011_fema_quinnipiacriver_m1472Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "1 None 1 North American Datum 1983 2007-01-19 1 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 DHS/FEMA > Federal Emergency Management Agency, U.S. Department of Homeland Security originator 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher) DOC/NOAA/NOS/OCM >",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}