{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Nursing is very impacted right now, so going to a private school is the way to go for me.",
            "There are many places to hike around the valley.",
            "There are many places to dine around the town.",
            "I plan to live at home.",
            "It is a good school and academically challenging. I would rate it 4 stars.",
            "It has a great Nursing program. It also has an RN to BSN program. It would be close to home."
        ]
    ],
    "pageTitle": "Pacific Union College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pacific-Union-College/reviews?_escaped_fragment_=/show/5909",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908939887,
    "recordOffset": 908890070,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{186301=© 2015, Cappex.com, LLC, 85347=There are two traditions that the college has. One of them is in December the guys pick a night and at midnight they run from dorm to dorm in their underwear singing Christmas carols. Another night the girls do the same to the guys dormitory. The second tradition is on your birthday, you get thrown in the campus fountain. The location is rural with many trees and wild life to admire. The school is on a hill where it is quiet and peaceful. There is a lot of vegetation as well as many wineries with excellent wines., 30321=On someone's birthday, his/her friends often get together and throw them into the fountain in the middle of campus. This can be a welcome cool down in June, or a icy wake up call at midnight in January!}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 1 person found this inaccurate. 1 of 37 Eric from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "10/23/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 37 Categories Comments Great for these types of students Someone looking for friendly peers and knowledgeable faculty. Anyone interested in Nursing, Pre Med, Psychology, Art (of any kind. Music, Fine Art, Film Making), Aviation, or Theology (To name departments I know somewhat personally that I enjoyed being at) would find high after-grad hire rates. Overall, PUC has a good reputation among employers-especially in the Nursing/Pre-Med area. Tips for prospective students Go for it. Even if you end up choosing to transfer to a different school later, PUC is worth the experience. The students are fresh, unique, and the teachers know what they're doing. Even if the school isn't the perfect one for you, I don't see any way to regret spending a year or two here. If you're in doubt, feel free to contact the faculty in the department you're interested in. I can't speak for any other majors, but Kaye Varney (Aviation Director) and Chip Dillon (Assistant Director) are both very easy to contact, and great people. If you can't make up your mind, give the department a call and ask",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}