{
    "relation": [
        [
            "",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "67",
            "44",
            "56"
        ],
        [
            "Inns",
            "116",
            "42",
            "52"
        ],
        [
            "Balls",
            "10793",
            "1528",
            "1002"
        ],
        [
            "Runs",
            "5553",
            "1506",
            "1292"
        ],
        [
            "Wkts",
            "209",
            "48",
            "58"
        ],
        [
            "BBI",
            "6/40",
            "4/33",
            "4/19"
        ],
        [
            "BBM",
            "10/70",
            "4/33",
            "4/19"
        ],
        [
            "Ave",
            "26.56",
            "31.37",
            "22.27"
        ],
        [
            "Econ",
            "3.08",
            "5.91",
            "7.73"
        ],
        [
            "SR",
            "51.6",
            "31.8",
            "17.2"
        ],
        [
            "4w",
            "10",
            "1",
            "2"
        ],
        [
            "5w",
            "10",
            "0",
            "0"
        ],
        [
            "10",
            "1",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Keith Barker | England Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2013/content/player/354441.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428773343,
    "recordOffset": 428741204,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76564=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average, 52277=Barker made his maiden first-class century against a strong Durham attack in 2011 having been called into the game after two days as a substitute for William Porterfield and followed it up with another against Sussex a couple of games later. But it was in 2012 that he really made a breakthrough, taking the new ball and claiming 56 wickets at only 20 apiece, including five five-wicket hauls, in the Championship and helping Warwickshire win the title. While somewhat gentle of pace, his control and ability to swing the ball render him a dangerous proposition and he followed his breakthrough year with 46 first-class wickets in 2013 and 51 in 2014 cementing his reputation as one of the most potent left-arm bowlers in county cricket., 56732=Jun 14, 2015, 72931=4391 runs after 35, and 2354 outside top five, 34967=Born October 21, 1986, Manchester, Lancashire, 58521=May 26, 2014, 53057=His batting remains useful, too. While not completely convincing against the short ball, he produced centuries from the lower-order in 2013 and 2014 to further underline an all-round ability that may yet see him win an opportunity at the highest level. Eligible for England and West Indies, he has made it clear that he would be happy to represent either. Barker is the son of the former British Guiana cricketer, also named Keith, and the godson of former West Indies captain, Clive Lloyd, with whom he shares the distinctive middle name, Hubert. George Dobell, 57670=May 18, 2015, 51453=A former footballer who was signed as a batsman, Keith Barker actually made his name as a left-arm swing bowler. Declining the offer of a Lancashire contract when he was 16, Barker instead pursued a career in football and, as a striker, represented England at U-18, U-19 and U-20 level. But after signing for Blackburn Rovers, he dropped to Rochdale Town and then Northwich Victoria and, by the time he was 21, it became apparent that he was not going to make it as a footballer. With Lancashire initially showing little interest in having him back, he impressed in club cricket with Enfield in the Lancashire League and, having scored a century in a trial match, was offered a contract by Warwickshire in August 2008.}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "15 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 First-class 67 116 10793 5553 209 6/40 10/70 26.56 3.08 51.6 10 10 1 List A 44 42 1528 1506 48 4/33 4/33 31.37 5.91 31.8 1 0 0 Twenty20 56 52 1002 1292 58 4/19 4/19 22.27 7.73 17.2 2 0 0 Career statistics First-class debut Warwickshire v Nottinghamshire at Birmingham, Jun 6-9, 2009 scorecard Last First-class Warwickshire v",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}