{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "The food here is delicious and cheap.",
            "Depending on the professor, the course could be fairly simple or fairly difficult.",
            "It is an amazing school. It is clean and quiet. It has an abundance of educational opportunities to help further your knowledge."
        ]
    ],
    "pageTitle": "San Diego State University (SDSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Diego-State-University/reviews?_escaped_fragment_=/show/23988",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891454075,
    "recordOffset": 891258651,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{941965=It's no Ivy League, but I had a 4.7 weighted GPA in high school and a 2000 on the SAT and I've found most of my classes to be super interesting and hard enough to provide a challenge without being overwhelming., 1056180=Get excellent grades because admissions are getting tougher every year. The average high school GPA for the class of 2017 was a 3.8., 504193=Go to the gym, play bowling at kearny mesa bowl since the aztec center is closed until fall 2013, go to the SDSU men's basketball games at Viejas Arena or concerts, go to the SDSU Football games at Qualcomm Stadium, and watch sports or listen to music/play video games., 360756=not really big here since the drug bust in 2007. many sororities/fraternities were suspended., 245933=There's a lot to do in San Diego! A cultural feast. Get a copy of the local weekly magazine, The Reader, when you arrive. Balboa Park alone has over 20 museums, biking and jogging paths, huge gardens, Spanish Village with an old California feel and artisans' shops, and hospitality houses from many countries. If you're a foreign student, go there for local information and socializing. The Park also hosts the Earth Fair every April. Movie theatres near campus show an eclectic array of films. The beaches are wonderful for surfing, relaxing and playing with your dog., 454032=The school is becoming increasingly difficult to gain acceptance to. For those hoping to transfer, keep in mind that there is a followup application due in January., 399492=food is tasty, but there could be more options. the associated students building which is set to open fall of 2013 will have great dining choices., 313617=I am an incoming freshman, and I will be attending in Fall 2015. I have some friends that go here, and they say that you should be very careful with the party scene here on campus. There are a lot of parties that you can go to, but always make sure to be careful!}",
    "textBeforeTable": "07/11/2009 Reviewer is A current student here. 105 out of 112 people found this review useful. 1 person found this inaccurate. 1 of 278 Jaime from San Diego, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Despite the large classes, the teachers care about your success in class. Login to rate or flag the reviews Hilary from San Diego, CA 08/24/2009 Reviewer is A current student here. 64 out of 66 people found this review useful. 2 of 278 Categories Comments Great for these types of students Active, outdoorsy/adventurous, social, studious Tips for prospective students If you live in the dorms, definitely make use of your free gym membership. Also, check out the plays put on by the theatre department, or go watch the student film festival. Periodically there are also free movie screenings on campus. Bang for the buck The recent increase in cost of registration was kind of a bummer, but it's still affordable. Am enjoying being here There are so many things to do. What with all the clubs, the ARC,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}