{
    "relation": [
        [
            "Number",
            "1",
            "2",
            "3"
        ],
        [
            "Name",
            "doodogi",
            "Ernesto Jeon",
            "lucky789"
        ],
        [
            "Acheive",
            "Day 2228",
            "Day 2229",
            "Day 2231"
        ],
        [
            "Note",
            "He is RL Korean and is only living eSouth Korea",
            "He is RL Korean and lived many e-foreign countries",
            "He is RL Korean and lived many e-foreign counries"
        ]
    ],
    "pageTitle": "South Korea - eRepublik Official Wiki",
    "title": "",
    "url": "http://wiki.erepublik.com/index.php/South_Korea",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 272779459,
    "recordOffset": 272731689,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{243909=Unfortunately, Parrot could not end the bickering with remnants of The Party and his heavy-handed response to criticism started to draw many comparisons to the autocratic system his administration replaced. In March 2009, in the first free elections in the country's history, he was defeated by one vote by Francis DeBoyle, who promised greater visibility, more freedom and continued economic growth., 260532=After waiting five months, Spade's dream came true as he won the February Presidential election over Andrei Vissarionovich by a single vote. His leadership through this transition garnered him wide support, and in March he ran for re-election unopposed., 245658=On the heels of the Goons' arrival, however, came another wave of immigration, this time from Turkey. Among the newcomers was PowerSweden, a man accustomed to the destructive nature of the Goons, and he had come to neutralize their effect on the country. Thanks in part to the efforts of his compatriot, LanceLoTR, a dialogue was established with the Free Koreans. PowerSweden quickly attained their support for the April presidential election., 239153=Not much is known of South Korea's history before the Japan-South Korea War in May 2008 that resulted in the annexation of South Korea into Japan. In November 2008, ATLANTIS-backed freedom fighters alongside richie450 and his efforts launched three successful resistance wars in Gyeonggi-do, Gyeongsangnam-do, and Chungcheongnam-do, putting the country back on the map; if South Korea were to have a Founding Father, richie could certainly be considered., 242573=The Party ran South Korea in classic PTO fashion. They owned several companies which produced plenty of stock and enabled them to manipulate the economy. Their forums were never public, and they proved themselves inaccessible to citizens. Richie450, among others, abandoned his position in Congress and left the country. The Party lost its hold on the nation in the January congressional elections by Parrot due to the support of the Central Intelligence Agency. The CIA's intervention is rumored to have been due to personal grudges of the then American government against the Triumvirate., 248147=In her time as interim president, Yonai oversaw success across the board, in economic, diplomatic, population, and social matters, and she parlayed this into a win in the May 2009 election. Still burdened with a relatively small population, however, political leaders realized the nation's vulnerability to PTO's., 250974=During the merger with Japan, South Korean leadership in exile planned to eventually rejuvenate the country. On August 20, 2009, Yonai Keiko started a resistance war in Gyeongsangnam-do, just in time for the August Congressional Elections. After two months, working with the Japanese, South Korea returned to the map. After this success, Yonai was the defacto president of the nation and was proposing a war with Japan (with Japan's blessing) in the hope to slowly take back old South Korean regions; with no Congress, the proposal met no opposition., 258854=In January 2010, after five months in power, the Theocrats announced they were leaving South Korea. With a lack of battles in the region and a distaste for governance, leadership directed members and resources to Spain and worked with the South Koreans to transfer power as smoothly as possible. To their credit, their departure was much more diplomatic, much more affable, than was their arrival. By the January Congressional elections, the Theocratic Era was over., 253331=Leadership sought to merge with Japan again, and at their request, Japan opened up a battle in Gyeongsangnam-do to take the country back and to undo the Theocratic PTO. This was the beginning of the Theocratic War. The day after the election, the battle commenced, and it concluded successfully, with South Korea retreating from the battle, and Japan retaking the country. The Theocrats, however, were not going to just allow this to happen. Initiated by Cidadao, they started a resistance war in Gyeonggi-do late on September 3 in order to get the country back on the map just in the nick of time for presidential elections on September 5 and to get their candidate on the ballot. The battle was bitterly fought, and with an hour left, the wall stood at 50,000, its highest of the fight; however, thanks to Theocratic expertise in tanking, they quickly brought the wall down to -6000 and won., 254419=With South Korea back on the map and presidential elections the very next day, the Theocrats were much better prepared, and their candidate, Colinar, defeated long-time South Korean resident Alfagrem by a 2-to-1 margin. With the Presidency and Congress in their pocket, they fought a war with Japan to maintain control of the country and to gain regions; despite Japan's best efforts and momentary wins, they ultimately were unable to retake South Korea. In the September Congressional elections, the Theocrats cemented political power with a much more convincing win than in August. Many who were loyal to the indigenous South Korean community left in disgust., 263049=The April Presidential Election would be considered by many Koreans to be the first democratic election since the Theocrats arrived. Peter de LusionisT Bae won the election with just under 43% of the vote., 265326=New president Arjay Phoenician took these new realities as an opportunity to change the course of the country. Among other things, he sought the renewal of the MPP with Russia, guaranteeing the Japanese would not launch another attack. In his two terms, he oversaw a good-sized baby boom, bloating the population from 546 on June 6 to 1003 by August 4, an 84% increase in two months. Many of these newcomers were native Koreans, and he encouraged the growth of Korean-language newspapers. They came from a Korean gaming site, Europa Universalis, and notables from this community include Grease, Philip Park, and Elignis Jinn., 259378=The post-Theocratic era was greeted by the community with enthusiasm and eagerness to rebuild. Facing many of the problems which had always plagued South Korea (weak currency, a turbulent economy, predators and PTO groups looking to take their share of the country), those who stayed were committed to a return to a free-market, democratic society. The newspaper media sprang to life, the national forum buzzed with activity, and positivity replaced the pessimism seen in Theocratic South Korea. The KRW quickly strengthened from 112 KRW/gold to 65 KRW/gold, the food and grain industries were slowly rebuilt, the South Korean Guard and Crimson Tigers were created to fill the military vacuum created when the Theocrats left, the population rose from just over 300 in mid-January to 650 by March, and an MPP was signed with Malaysia for the sake of wargames. The political parties that were vacated by the Theocrats were soon put to use., 250438=With Japan's consent, South Korea declared war on them, and the process of merging began. By the time the June 2009 Congressional elections came around, the process was complete; South Korea was part of Japan. The South Korean community assimilated into Japanese culture and seemed content with the move., 264599=Resistance battles bore fruit, but it was the signing of the MPP with Russia that ended Japanese aggression once and for all. Koreans pushed the Japanese out rather quickly, and with numeric superiority, they regained Jeju, becoming whole for the first time since coming back on the map the previous August., 241573=In mid December The Party arrived in South Korea, led by the Triumvirate of Father (Peregrine), Teacher (ThisGenMedia), and Watcher (Trisk). They kept to themselves and spoke little, only saying they wanted to make Korea \"better\". With a growing population, South Koreans fought off The Party in the December Congressional elections, but in the end, The Party took over Congress, and then, the Presidency., 263625=Peter was reelected on May 5, and the next day, Japan declared war on South Korea, giving a list of reasons for the action, from wanting to eliminate multi's from South Korea to owing it to the country to erase it and let them start over, but no one was fooled, it was for the \"lulz\". The Japanese won the first battle by less than one tank, which forced them to escalate the war with the incorporation of EDEN forces, especially from Croatia. Peter signed an MPP with Germany. The first resistance battle of the war was again a narrow win for Japan, but two days later, they attacked three regions at once, winning all three handily; by the end of the week, they had taken the South Korean capital of Gyeonggi-do and reduce SK to two useless regions., 262531=The Goon/Facepuncher conflict was not the only event marking Spade's second term. During the March Congressional elections, his profile was hacked into, with which the hacker acted with vulgarity and disregard for the country and its president. The hacker proposed a pornographic citizen message and published Spade's private messages. Speaking through an organization, Spade directed the National Assembly to impeach his citizen account in order to halt the hacker's antics, and the Assembly obliged him., 243396=With Parrot winning the February 2009 presidential election, The Party was ultimately defeated. Though he was saddled with a weak economy, low production, and a small and starving population, Parrot rallied the community and, with the help of Japanese and private donations, was able to stave of starvation and refill the treasury. His actions spawned the first immigration wave to South Korea, where new companies were built, wages were competitive, cost were low, and the economy was strengthening., 257805=While the Theocrats held their regions, Russia sought to take control of the peninsula for themselves. They were successful in taking over North Korea and keeping it as a \"colony\" under Shaolin control. The Theocrats were successful in fending off Russian and Japanese threats, and by January 2010, of the nine original South Korean regions, only Jeju-do was not in Theocratic hands., 256670=Not every South Korean folded under Theocratic dominance. In September 2009, as the Theocrats were trying to enjoy their MPP with Malaysia to take advantage of the Sol wargames, Alfagrem took it on himself to start a series of resistance wars in Thailand to try to keep the Theocrats from strengthening their multi's; he funded the RW's himself, but also received criticism for the effort. Also, in the middle of the Theocratic totalitarian regime, Andrei Vissarionovich came and created the Democratic Nationalist Party in the hope of creating a true democratic presence; to his credit, he managed to get several members of his party into Congress, including Herbert Von Bern.}",
    "lastModified": "Thu, 16 Jul 2015 20:59:23 GMT",
    "textBeforeTable": "Active Top 5 Parties: South Korean Parliament building. Parties Last update March 11th, 2015 by SaetByul Didn't know about Chinese War before 2011 ↑ 5.0 5.1 The CP was \"Eat and run\" style. ↑ Still debatable. ↑ Some candidates did not exist in this month ↑ This CP was banned. ↑ 1.0 1.1 1.2 1.3 1.4 The CP was impeached. Shield (Right wing) serzel (RL: ) Mar 2015 Defended directorship against Romanian(FSR) RL Korean Union (Middle wing) jh0825",
    "textAfterTable": "23% Shield SID Center-right, Totalitarian KOR_Sohn 37 8 15% Clover CLO Center, Libertarian Delpus 25 4 12% Sport Party SP Center, Libertarian Park Byeong ho 13 2 5% Last updated: March 11th, 2015 by SaetByul Current Government Position Name President serzel Minister of Foreign Affairs (MoFA) Park Ju Chan Governor (MoF) SaetByul Minister of Education (MoE) Delpus",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}