{
    "relation": [
        [
            "Taxable Income",
            "under $50,000",
            "from $50,000 to $75,000",
            "from $75,000 to $100,000",
            "from $100,000 to $335,000",
            "from $335,000 to $10,000,000",
            "from $10,000,000 to $15,000,000"
        ],
        [
            "Times (X)",
            "x",
            "x",
            "x",
            "x",
            "x",
            "x"
        ],
        [
            "Tax Rate",
            "15%",
            "25% - $5,000",
            "34% - $11,750",
            "39% - $16,750",
            "34%",
            "35% - $100,000"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.12.16 Corporate Income Tax Returns (Cont. 2)",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-012-016r-cont02.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 525376051,
    "recordOffset": 525320238,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150771=Section 101(b) of American Taxpayer Relief Act (ATRA) of 2012 permanently extends the maximum tax rate in effect of 39.6%., 21614=Qualified Cellulosic Biofuel known as \"Black Liquor\" - If Form 6478, Alcohol and Cellulosic Biofuel Fuels Credit, has a significant amount on Line 5* Column (c) and/or Line 8*, *(Line 5(c) and/or Line 7 for 2009, Line 7(c) or Line 9 for 2008), and/or indicates \"Cellulosic Biofuel Refund (CBR),\" with a significant amount on Form 6478 (as indicated above), Code and Edit will edit CCC \"U\" and attach Form 4227 (or other appropriate routing slip) and route to Rejects for a special review. Not applicable for revisions not listed., 120538=If Revenue Procedure (Rev. Proc.) 2006-46, Rev. Proc. 2006-45, Rev. Proc. 82-25 or Treasury Regulations 1.442-1(c) or (d). is stated, Audit Code \"3\" must be present (Forms 1120-FSC, 1120-ND and 1120-SF only)., 8666=See Figure 3.12.16-10, Manually Correct Tax., 148710=The following corporate income tax rates apply toForm 1120-SF:, 141677=Omnibus Budget Reconciliation Act of 1993 (OBRA) made changes to the tax rates and the estimated tax rules that affected tax periods beginning after January 1, 1993., 36294=Field 14-C is transcribed from Form 1120-FSC, Page 2, Additional Information, Question 5., 120049=Statement that the taxpayer is changing the accounting period under Treasury Regulation 1.442-1(c) or (c), Treasury Regulation 1.1502-76, IRC 898(c)(1)(A), IRC 898(c)(2) or IRC Section 444, IRC 1398, Revenue Procedure (Rev. Proc.) 76-10, Rev. Proc. 82-25, Rev. Proc. 85-58, Rev. Proc. 87-32, Rev. Proc. 92-13, Rev. Proc. 2000-11, Rev. Proc. 2002-37, Rev. Proc. 2006-45 or Rev. Proc. 2006-46., 15401=Field 08-C is transcribed from Form 1120-SF, Page 2, Additional Information, the dotted portion Line 4a., 142653=The tax rate for Form 1120-ND decreased to 22% under OBRA for tax period 199401 through 199512. If the taxpayer’s return straddles two tax periods with different rates, the return must be manually verified., 28049=Form 1120-SF is math verified by the computer., 8409=Field 07-Z must be entered on Form 1120-SF if there is a math error in tax. Field 07-A will underprint. Use Action Code 6 to enter correct tax in Field 07-Z. When document loops send TPNC 90., 13968=Field 08-A is transcribed from Form 1120-SF, Page 2, Additional Information, Line 1a., 142372=The tax rate for Form 1120-ND decreased to 20%; under OBRA (Omnibus Budget Reconciliation Act of 1993) for tax period 199601 and subsequent. If the taxpayer’s return straddles two tax periods with different rates, the return must be manually verified., 9778=Fields 08-A through 08-C are valid for Form 1120-SF., 120845=If proof of permission is not attached, initiate research of the Form 1128 file maintained by Entity Control., 22681=These instructions apply to 2009 tax year only, including fiscal years (200901 through 201011)., 493917=No conversion required for tax years after 2001., 32813=Field 14-A (Disregarded Entity) is transcribed from Form 1120-FSC, Page 2, Additional Information, Question 4., 137877=For tax years beginning January 1, 1993, and later, a corporation with Taxable Income over $100,000:, 178909=The Foreign Country Code (FCC) table is valid for all Form 1120 series returns., 7626=See IRM 3.12.16.3.17, Field 01-M, Taxpayer Notice Code (TPNC), for additional information. For a full listing of the programmed TPNC 90 Math Error Codes, see TPNC 90 Math Error Code Job Aid at http://serp.enterprise.irs.gov/databases/portals.dr/sp-portal/bmf.dr/bmf_ers/job_aid.dr/TPNC-90-Math-Error-Code-Job-Aid.doc ., 24015=Math verification of Form 1120-FSC and Form 1120-ND is limited to the following instructions:, 28888=The Form 1120-L and Form 1120-PC moved to the Error Resolution System (ERS). In order to keep the error register in the same format and prevent additional programming, various fields are \"Reserved\" ., 130440=Example - The tax on a single corporation with the taxable income of $115,572.00 for the tax period beginning January 1, 2009, and ending September 30, 2009, is computed as follows:, 29718=The Form 1120-L and Form 1120-PC moved to the Error Resolution System (ERS). In order to keep the error register in the same format and prevent additional programming, Field 14-B (Number of Forms 8865) is \"Reserved\" ., 14685=Field 08-B is transcribed from Form 1120-SF, Page 2, Additional Information, Line 3b., 143289=Form 1120-SF, which replaced Form 1120-DF, was included in OBRA. The Act increased the tax rate for Form 1120-SF to a maximum tax rate of 39.6%. It is also retroactive for tax periods 199301-199311., 132000=Days versus Months - If the taxpayer has used days to compute tax, verify the computation using days. This applies to the short period when a taxpayer is changing to/from a 52-53 week tax year, but not if such change results in a short period of more than 359 days, but less than seven days. The following is an example of a single corporation with a \"change of accounting period\" with 1 tax rate, taxable income of $10,501.00 and tax period from September 1, 2009, to December 31, 2009., 136924=For tax periods 198701 and subsequent, the Regulated Investment Company taxpayers will file Form 1120-RIC, U.S. Income Tax Return for Regulated Investment Companies. Form 1120-RIC is on the Error Resolution System (ERS). See IRM 3.12.251, Error Resolution - Corporation Income Tax Returns., 26643=Math verify tax computation work sheet if attached (Line 13 amount). See IRM 3.12.16.21, Corporate Income Tax Rates, for tax rates., 53748=Verify the CRN and Form 4136 credit amount is claimed for a valid tax period. See Exhibit 3.12.16-16, Form 4136 - Valid Tax Period Chart., 139050=Corporations that are members of a controlled group are instructed to check a particular box on their tax returns. On Form 1120-FSC, the box is on Page 1 of the return (\"Parent-subsidiary controlled group.\" ) and Page 5, Schedule J (\"Check if the FSC is a member of a controlled group...\" ). See IRM 3.12.16.5.12, Field 03-M, Subsidiary Filer Code, for additional information., 40353=See Exhibit 3.12.16-15, Form 4136 - Prior Year Conversion Chart, for prior years 2000 - 1997., 143068=The tax rate for Form 1120-ND increased after the 1992 tax returns were filed, which made the tax for tax period ending in 199301-199311 retroactive., 135632=A \"Y\" coded, Treasury Regulation Section 1.1502, return is computed under normal corporate tax rates. The return is the last return of a subsidiary prior to its inclusion in a consolidated return. The Computer Condition Code \"Y\" must be entered to change the fiscal year ending., 143517=All the rules and regulations that applies to Form 1120-DF, apply to Form 1120-SF., 133624=In the next example, the taxable income is $75,000 for 90 days of business in 2009., 119852=Form 1128 with approval space signed., 22908=Do not reject the record with Action Code 3 for tax period 201012., 8763=Figure 3.12.16-10, 136357=If the return is for a Personal Service Corporation and the tax year begins in 1993 or later, tax will be computed at a flat 35% (percent)., 54244=Send TPNC 90. See Exhibit 3.12.16-14 for the applicable literal., 53457=Verify prior year CRNs (e.g., tax year 2000 and prior) are converted to current year CRNs. See Exhibit 3.12.16-15, Form 4136 - Prior Year Conversion Chart, for prior years 2000 - 1997., 112635=Returns that require manual computations are more frequent in years when the tax rates change as they did in 1982, 1983, 1984 and 1993 (corporations with $1 million or more in Taxable Income), tax periods straddling July 1, 1987, and Control Group Corporations with $100,000 or more in Taxable Income with tax periods 198707-198811., 28624=Form 1120-FSC, Page 2, Additional Information, Questions 5 and 6, are valid for tax periods beginning after 199912. Questions 5 and 6 are identical to questions on Schedule N. Form 1120-FSC filers are not required to file a Schedule N., 98681=Refer to Schedule O (Form 1120), Consent Plan and Apportionment Schedule, for a Controlled Group for returns filed for tax periods beginning January 1, 2007, and subsequent., 152765=The following corporate income tax rates apply to Forms 1120-ND:, 181091=Do not use as a Foreign Country Code when entering the Entity Section. See Exhibit 3.12.16-11, U.S. Possessions/Territories and ZIP Codes., 150938=Beginning in 1993, Form 1120-DF, U.S. Income Tax Return for Designated Settlement Funds (Under Section 468B), became Form 1120-SF. Prior year Form 1120-SF, use the Form 1120-DF rate for that year. The following corporate income tax rates apply to Form 1120-DF:, 142949=The tax rate for Form 1120-ND increased to 35% under OBRA for tax period 199301-199312.}",
    "textBeforeTable": "The chart below shows Section 08: Alpha Field Designator (AFD), Title, Field Length, Dollars and Cents ($ / ¢), and the Location. 3.12.16.8.1  (01-01-2015) Section 08, Error Register Format If a field is asterisked, check to determine if that field is valid for that return and/or document code. Fields 08-A and 08-B are transcribed in dollars only. Fields 08-A through 08-C are valid for Form 1120-SF. Section 08 contains information fields that are variable in length and are money amounts. 3.12.16.8  (01-01-2015) Section 08, Data - Form 1120-SF Please click the link to view the image. This image is too large to be displayed in the current screen. See Figure 3.12.16-10, Manually Correct Tax. Figure 3.12.16-10 Field 07-Z must be entered on Form 1120-SF if there is a math error in tax. Field 07-A will underprint. Use Action Code 6 to enter correct tax in Field 07-Z. When document loops send TPNC 90. Note: When a taxpayer files a consolidated return with a \"Mixed Component Member,\" ensure Audit Code \"3\" has been entered.",
    "textAfterTable": "3.12.16.8.2  (01-01-2015) Field 08-A, Transfer’s Fund Field 08-A is transcribed from Form 1120-SF, Page 2, Additional Information, Line 1a. Field 08-A must be all numeric or blank. Field 08-A must be transcribed in dollars only. Field 08-A must be positive. 3.12.16.8.3  (01-01-2015) Field 08-B, Direct/Indirect Payment Field 08-B is transcribed from Form 1120-SF, Page 2, Additional Information, Line 3b. Field 08-B must be all numeric or blank. Field 08-B must be transcribed in dollars only. Field 08-B must be positive. 3.12.16.8.4  (01-01-2015) Field 08-C, Distribution Indicator Field 08-C is transcribed from Form 1120-SF, Page 2, Additional Information, the dotted portion Line 4a. This is a one-digit numeric field. Code Description",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}