{
    "relation": [
        [
            "Patent application number",
            "20110261823",
            "20110265137",
            "20110265139",
            "20120151537",
            "20120314597",
            "20120314713"
        ],
        [
            "Description",
            "METHOD AND SYSTEM FOR MULTIPLEXING DATA STREAMING IN AUDIO/VIDEO NETWORKS - A method and system for communication in high speed audio/video networks. In one embodiment, communication between AV devices comprises establishing an AV path stream for AV data streaming between a source AV device and a destination AV device. Each AV device includes one or more I/O ports for connecting the AV device to another AV device via a communication link including multiple communication lanes. Asynchronous and isochronous AV data are multiplexed for transmission via one or more fixed length data cells, each data cell capable of carrying one or more of: asynchronous data symbols and isochronous data symbols. Isochronous data is mapped onto isochronous symbols in one or more data cells, Asynchronous symbols are mapped onto one or more data cells. One or more data cells are transmitted from a physical layer the source AV device to the destination AV device via one or more communication lanes.",
            "METHOD AND SYSTEM FOR ISOCHRONOUS DATA STREAM MANAGEMENT IN HIGH SPEED AUDIO/VIDEO NETWORKS - A method and system for isochronous data stream management in high speed audio/video networks. One implementation comprises isochronous communication management between audio/video (AV) devices by maintaining forwarding information for forwarding data between AV devices, wherein each AV device includes multiple I/O ports for connecting the AV device to another AV device via a communication link including multiple communication lanes. The forwarding information is utilized to communicate AV path set-up request and response control messages between a source AV device and a destination AV device via said communication link, and allocating isochronous communication resources for AV data streaming, for establishing AV path streams for bi-directional isochronous AV data streaming between the source and destination AV devices.",
            "METHOD AND SYSTEM FOR ISOCHRONOUS COMMUNICATION IN AUDIO/VIDEO NETWORKS - Method and system for isochronous communication between audio/video (AV) devices. One implementation comprises establishing isochronous connection between a source AV device and a destination AV device. Each AV device includes multiple I/O ports for connecting the AV device to another AV device via a communication link comprising multiple communication lanes. The isochronous connection is established by determining end-to-end temporal and spatial lane availability between the source AV device and the destination AV device to support a target date rate. Communication resources are allocated on the available lanes based on the target date rate for isochronous communication between the source AV device and the destination AV device.",
            "METHOD AND SYSTEM FOR ASYNCHRONOUS AND ISOCHRONOUS DATA TRANSMISSION IN A HIGH SPEED VIDEO NETWORK - A method and system for communication between audio/video (AV) devices. In one embodiment communication between AV devices includes establishing an AV path stream for AV data streaming between a source AV device and a destination AV device, wherein each AV device includes one or more I/O ports for connecting the AV device to another AV device via a communication link including multiple communication lanes. Asynchronous and isochronous AV data is multiplexed for transmission via one or more fixed length data cells, each data cell capable of carrying one or more of: an asynchronous data symbol and an isochronous data symbol. Multiplexing includes selectively mapping asynchronous data onto isochronous symbols for transmission during a video blanking period. One or more data cells are transmitted from a physical layer of the source AV device to the destination AV device, via one or more communication lanes.",
            "ENHANCED STREAM RESERVATION PROTOCOL FOR AUDIO VIDEO NETWORKS - An enhanced stream reservation protocol comprising a Talker device sending a Stream Reservation Protocol (SRP) Talker Advertise message for streaming data to a Listener device, receiving the Talker Advertise message and checking bandwidth availability on an output port thereof for the streaming. In case of insufficient communication bandwidth, sending a failure message that includes information about available bandwidth from the Talker device to the Listener device. A protocol for communication in a bridged network, comprising a Talker device sending an SRP Talker Advertise message for streaming data to a Listener device. The Talker Advertise message includes communication path information from the Talker device to the Listener device. A communication path from the Talker device to the Listener device is selected based on said path metrics, for streaming data between the Talker device and the Listener device.",
            "METHOD AND SYSTEM FOR PROXY ENTITY REPRESENTATION IN AUDIO/VIDEO NETWORKS - Communication in an AV network includes a Talker device initiating communication with a Listener device via a proxy device for data streaming. The proxy device participates in one or more of: content discovery, connection establishment, AV selection and AV streaming between the Talker device initiating communication with a Listener device."
        ],
        [
            "Published",
            "10-27-2011",
            "10-27-2011",
            "10-27-2011",
            "06-14-2012",
            "12-13-2012",
            "12-13-2012"
        ]
    ],
    "pageTitle": "Lee, Suwon - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lee-suwon-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440147279,
    "recordOffset": 440105513,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jae Min Lee, Suwon KR 06-24-2010 PHOTOVOLTAIC AND FUEL CELL HYBRID GENERATION SYSTEM USING SINGLE CONVERTER AND SINGLE INVERTER, AND METHOD OF CONTROLLING THE SAME - There are disclosed a photovoltaic and fuel cell (PV-FC) hybrid generation system using a single converter and a single inverter, and a method of controlling the same. The PV-FC hybrid generation system includes a DC/DC converter unit converting an FC output voltage from a fuel cell, converting chemical energy into electrical energy, into a preset voltage, a DC link unit commonly connecting an output terminal of a photovoltaic cell, converting the sunlight into electrical energy, and an output terminal of the DC/DC converter unit, and linking the converted FC output voltage from the DC/DC converter unit with a PV output voltage from the photovoltaic cell to thereby generate a DC voltage, and a DC/AC inverter unit converting the DC voltage from the DC link unit into a preset AC voltage. Furthermore, a method of controlling the PV-FC hybrid generation system is proposed. 20100156185 Published Description Patent application number Il Woon Lee, Suwon KR 12-22-2011 METHOD OF DETERMINING AUTO-FOCUSING FAILURE - There is provided a method of determining an auto-focusing failure in which the auto-focusing failure may be rapidly determined even in the case that a lens moving for auto-focusing does not detect auto-focusing evaluation values while moving along the entire moving distance. The method includes: sequentially moving a position",
    "textAfterTable": "Jee Sung Lee, Suwon KR Patent application number Description Published 20110062804 Linear vibration motor - A linear vibration motor includes: a top cover; a bracket coupled with the top cover to provide an internal space; a vibration unit having a mass body mounted at the internal space and linearly moving in a horizontal direction; an actuator having a magnet fixed to the mass body and a coil installed within a range of a magnetic field of the magnet and generating electromagnetic force to allow the vibration unit to move linearly in a horizontal direction; and a buffer member disposed in a space between the mass body and the bracket and limiting displacement of the vibration unit. 03-17-2011 20110316361 Horizontal linear vibrator - There is provided a horizontal linear vibrator including a bracket providing an internal space; a vibration unit mounted in the internal space and including a mass body moving horizontally and linearly; and a magnetic field unit including a magnet fixed to the mass body and a coil installed within a magnetic field of the magnet and generating electromagnetic force to allow the vibration unit to move horizontally and linearly, wherein the coil includes a coil line disposed between the bracket and a printed circuit board and extending outside of the internal space of the bracket such that the coil line is connected with the printed circuit board for applying power from an external source to the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}