{
    "relation": [
        [
            "Switch",
            "/?, /h, /help",
            "/quiet",
            "/ norestart"
        ],
        [
            "Description",
            "Displays help on supported switches.",
            "Suppresses the display of status or error messages.",
            "When combined with /quiet, the system will not be restarted after installation even if a restart is required to complete installation."
        ]
    ],
    "pageTitle": "Microsoft Security Bulletin MS13-004 - Important",
    "title": "Supported Security Update Installation Switches",
    "url": "https://technet.microsoft.com/en-us/library/security/ms13-004.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898730151,
    "recordOffset": 898691559,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5672=Note that the KB2756920 update on the Microsoft Download Center has not changed and does not add the KB2637518 update to the chain installer. Customers who manually download and apply the KB2756920 update should consult Microsoft Knowledge Base Article 2801728 if they are experiencing compatibility issues., 7897=Why was this bulletin rereleased on January 22, 2013?  Microsoft rereleased this bulletin to reoffer the KB2756920 update for Windows 7 and Windows Server 2008 R2 to systems that are running in specific configurations known to have potential compatibility issues. The new offering of this update, via automatic updating, addresses compatibility issues introduced by the original version of the update when combined with specific non-security updates. For more information about these compatibility issues, see Microsoft Knowledge Base Article 2801728., 6266=What changed in the reoffered KB2756920 update?  No binaries that were included in the original KB2756920 security update have changed. The reoffered KB2756920 update, available through automatic updating, addresses potential compatibility issues by adding the KB2637518 update to the chain installer. The KB2637518 update only applies to configurations with specific non-security updates installed. For more information about these configurations, see Microsoft Knowledge Base Article 2801728., 570=The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the January bulletin summary. For more information, see Microsoft Exploitability Index., 53826=Published: January 08, 2013 | Updated: December 16, 2013}",
    "TableContextTimeStampAfterTable": "{113041=For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 ITMU, see SMS 2003 Inventory Tool for Microsoft Updates. For more information about SMS scanning tools, see SMS 2003 Software Update Scanning Tools. See also Downloads for Systems Management Server 2003., 142702=Note The update for supported versions of Windows Server 2003 x64 Edition also applies to supported versions of Windows XP Professional x64 Edition., 73544=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2013-0003., 58355=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2013-0002., 112501=Note Microsoft discontinued support for SMS 2.0 on April 12, 2011. For SMS 2003, Microsoft also discontinued support for the Security Update Inventory Tool (SUIT) on April 12, 2011. Customers are encouraged to upgrade to System Center Configuration Manager. For customers remaining on SMS 2003 Service Pack 3, the Inventory Tool for Microsoft Updates (ITMU) is also an option., 88507=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2013-0004., 49566=To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see CVE-2013-0001., 104548=Microsoft provides detection and deployment guidance for security updates. This guidance contains recommendations and information that can help IT professionals understand how to use various tools for detection and deployment of security updates. For more information, see Microsoft Knowledge Base Article 961747., 125645=Note The update for supported versions of Windows XP Professional x64 Edition also applies to supported versions of Windows Server 2003 x64 Edition., 236306=Built at 2014-04-18T13:49:36Z-07:00}",
    "textBeforeTable": "The following severity ratings assume the potential maximum impact of the vulnerability. For information regarding the likelihood, within 30 days of this security bulletin's release, of the exploitability of the vulnerability in relation to its severity rating and security impact, please see the Exploitability Index in the January bulletin summary. For more information, see Microsoft Exploitability Index. Severity Ratings and Vulnerability Identifiers Vulnerability Information Customers who require custom support for older software must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, see the Microsoft Worldwide Information website, select the country in the Contact Information list, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Microsoft Support Lifecycle Policy FAQ. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. To determine the support lifecycle for your software release, see Select a Product for Lifecycle Information. For more information about service packs for these software releases, see Service Pack Lifecycle Support Policy. I",
    "textAfterTable": "Important Microsoft .NET Framework 1.1 Service Pack 1 Microsoft .NET Framework 1.1 Service Pack 1 when installed on Microsoft Windows XP Service Pack 3 (KB2742597) Moderate Information Disclosure Important Elevation of Privilege Not applicable Important Elevation of Privilege Important Microsoft .NET Framework 1.1 Service Pack 1 when installed on Microsoft Windows XP Professional x64 Edition Service Pack 2 (KB2742597) Moderate Information Disclosure Important Elevation of Privilege Not applicable Important Elevation of Privilege Important Microsoft .NET Framework 1.1 Service Pack 1 on Microsoft Windows Server 2003 Service Pack 2 (KB2742604) Moderate Information Disclosure Important Elevation of Privilege Not applicable Important Elevation of Privilege Important Microsoft .NET Framework 1.1 Service Pack 1 when installed on Microsoft Windows Server 2003 x64 Edition Service Pack 2 (KB2742597) Moderate Information Disclosure Important Elevation of Privilege Not applicable Important Elevation of Privilege Important Microsoft .NET Framework 1.1 Service Pack 1 when installed on Microsoft Windows Server 2003 for Itanium-based Systems Service Pack 2 (KB2742597) Moderate Information Disclosure Important Elevation of Privilege Not applicable Important Elevation of Privilege Important Microsoft .NET Framework 1.1 Service Pack 1 when installed on Windows Vista Service Pack 2 (KB2742597) Moderate",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}