{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "not bad",
            "smart that like to have fun but can stay focused.",
            "football is great, and mardi gras in the spring is wild.",
            "go to football and baseball games. go out to tigerland or go to new orleans.",
            "don't party too much.",
            "good college town to live in with lots to do. school work is fairly difficult, but a respected degree once earned. fun party scene and close to new orleans."
        ]
    ],
    "pageTitle": "Louisiana State University and Agricultural & Mechanical College (LSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Louisiana-State-University-and-Agricultural-Mechanical-College/reviews?_escaped_fragment_=/show/96228",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00075-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908874979,
    "recordOffset": 908752554,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{411900=The faculty members are great & LSU is really sensivite to freshmen & making sure they transfer & accomodate well to LSU in their first year. There are many many events to help prospective students before college starts & after, including CAS (Center for Academic Success) named 2004 Outstanding Learning Center in the Nation. Freshmen year classes are big but easy (you don't even need books for most of the classes) !!!, 528303=LSU has the best restaurants! We're surrounded by everything you could possibly think of! You name it: delis, Chinese, burgers, fast food, pizza, frozen yogurt, bars, Cajun, Greek, Mexican, smoothie places, sushi, wings, on-campus dining halls... it is all there, and it is all fabulous. I hardly every get tired of eating near campus because of the wide variety of places we have to choose from., 670973=Apply for housing early, and by early, I mean as soon as you're accepted! If you don't apply before December, there is no guarantee of on campus housing., 380691=My freshman year at LSU was many things: overwhelming, exciting, challenging, fun, etc. I cannot wait until I begin my sophomore year this coming August 2012., 10294=LSU has over 375 student organizations, and there is literally something for everyone. One thing that I would definitely recommend is joining a student organization (or two!) It makes the seemingly large campus very small and gives you a close group of peers to count on. The cajun culture is unique, you won't find friendlier people anywhere else. You can go anywhere around campus on a home football game day and be greeted as friends (as long as you're dressed in purple and gold!) LSU is a thriving community filled with culture and diversity, there is no place like it., 564518=As an entering freshman, they base your English placement on your ACT or SAT score. English/ Composite + English/ SAT 18-25/38 min/450-600 placed in engl 1001 26 or higher/ 53 min/610-720 placed in engl 2000 in sophomore year 65 min /730 or higher exempt from English composition, 688716=The recreational center is under construction at the moment but will be completed by 2016. There they have weight lifting rooms they have a rock wall, basketball corts, tennis courts, and more, they are even putting in a lazy river., 185593=LSU's campus is beautiful. The large oak trees are truly magnificent. The LSU lakes are serene and attract joggers from all over the city. LSU is the only university with a live Tiger on campus, whose habitat is an official tourist attraction! And, then there is Tiger Stadium. We call it Death Valley, where opponents dreams come to die! There is no greater tradition that attending a football game on a Saturday Night in Death Valley. Our game day traditions start by tailgating on campus. Then watching the band, cheerleaders, and football players march down victory hill heading into the stadium. But absolutely nothing compares to 95,000 Tiger fans cheering their team on to victory. Nothing compares to hearing your fight song played by the Tiger Band from Tigerland. It gives me chills just thinking about it. Geaux Tigers!, 409164=LSU has tons of clubs & activities for every type of students including departmental clubs, nationality clubs, workshops, Center of Academic Success which was named 2004 Outstanding Learning Center in the Nation !!!, 11158=LSU is facing financial uncertainty, but the academic core of classes and offerings is kept in tact. Student to faculty ratio is about 21:1, which is great considering the 28,000 students that attend the school. Courses challenge students to learn, and opportunities to engage in service learning and communication intense courses allow students to develop real life skills while learning core curriculum. There are plenty of opportunities to stand out and educate yourself for success, should you choose to take advantage of them., 365396=There are tons and tons of organizations on campus and they hold an organization fair in the fall, usually in September so that incoming students can see what's available., 696183=© 2015, Cappex.com, LLC, 633557=Beautiful. Southern. LSU felt like home to me. I will love to be here Fall 2014.}",
    "textBeforeTable": "12/17/2009 Reviewer is A current student here. 44 out of 44 people found this review useful. 2 people found this inaccurate. 1 of 157 Kaitlynn from Kenner, LA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', });",
    "textAfterTable": "Login to rate or flag the reviews Jordann from Humble, TX 12/01/2009 Reviewer is A current student here. 25 out of 25 people found this review useful. 2 of 157 Categories Comments Great for these types of students LSU is probably best for students that don't mind being in a class of 200 or more. You also have to have thick-skin coming to a school of 32,000 people, your teacher probably won't know you exist, and the campus is huge so you must be ready to walk a lot! Tips for prospective students The best advice I could give a prospective LSU student would be, if you are able to attend a bridge program or simply take classes during the summer before your first fall semester, do so. I had the opportunity to attend a summer bridge program which allowed me to attend two classes, have free room and board, and become familiar with the campus before the fall semester began. Not only do you become familiar with the campus and learn to live on your own, you also learn the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}