{
    "relation": [
        [
            "Tuition",
            "Most undergraduate courses",
            "Autobody Technology courses (ABT)",
            "Automotive Restoration Technology courses (ARST)",
            "Automotive Service Technician courses (AST)",
            "Culinary Arts courses (CUL 151, 152, 153, 161, 201, 222A, 231A) (BPA 111, 112, 121, 151, 152, 153, 221, 222, 223, 251A) (FBM 121, 151, 251, 255, 261, 281, 341)",
            "Dental Hygiene professional track courses (DHY)",
            "Developmental English with e-Labs (ENG091 and ENG098B)",
            "Developmental Math Course with e-Labs (MTH091 and 099E)",
            "Diesel Service Technology courses (DSL), excluding DSL 211",
            "Electronic Health Records (HSC151)",
            "Nursing courses (NURL, PN, and ADN-level NUR)",
            "Orthotic/Prosthetic Technology (OPT) courses",
            "Polysomnographic Technology (PST) courses",
            "Power Sports and Small Engine Technology courses (SET)",
            "Pre-Occupational Therapy (OCC) courses",
            "Truck Driving courses (DSL 211 and TRN101A, 111, 122, 151, 161, and 201A)",
            "Welding courses",
            "Center for Graduate Studies Master courses",
            "Center for Graduate Studies DBA courses"
        ],
        [
            "2015/2016 Academic Year",
            "$240/per credit hour",
            "$265/per credit hour",
            "$265/per credit hour",
            "$245/per credit hour",
            "$365/per credit hour",
            "$300/per credit hour",
            "$250/per credit hour",
            "$260/per credit hour",
            "$275/per credit hour",
            "$253/per credit hour",
            "$285/per credit hour",
            "$255/per credit hour",
            "$255/per credit hour",
            "$245/per credit hour",
            "$285/per credit hour",
            "$315/per credit hour",
            "$265/per credit hour",
            "$435/per credit hour",
            "$590/per credit hour"
        ]
    ],
    "pageTitle": "Financial Aid Resources & Information | Baker College in Michigan & Online",
    "title": "",
    "url": "http://www.baker.edu/student-services/financial-aid/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 316739735,
    "recordOffset": 316583837,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{59693=2014-2015 Financial Aid Recipients, 57357=Fall 2015: September 25, 2015, 77689=Baker College of Flint 1050 West Bristol Road Flint, Ml 48507 Phone: (810) 766-4202 Fax: (810) 766-4293 finaid-fl@baker.edu, 58867=2015-2016 Financial Aid Recipients, 78726=Baker College of Auburn Hills 1500 University Drive Auburn Hills, Ml 48326 Phone: (248) 276-8211 Fax: (248) 276-8271 finaid-ah@baker.edu, 75047=Baker College of Port Huron  3403 Lapeer Road Port Huron, Ml 48060 Toll Free: (888) 262-2442 Phone: (810) 985-7000 Fax: (810) 985-7066 finaid-ph@baker.edu , 57414=Summer 2015: June 26, 2015, 42575=You must apply for financial aid every year. New applications are available after January 1st each year. Always complete your FAFSA as early as possible. , 74693=Baker College Online 1116 West Bristol Road Flint, Ml 48507 Toll Free: (800) 796-7064 Phone: (810) 766-2027 Fax: (810) 766-2107 finaid-ol@baker.edu, 60482=Beginning with the 2013-2014 academic year, the U.S. Department of Education started identifying students with an Unusual Enrollment History in an effort to prevent fraud and abuse in the Federal Pell Grant Program. Students are being notified by the Department of Education that their FAFSA is flagged for Unusual Enrollment History with a comment code (C code) on their Student Aid Report (SAR). Baker College cannot pay Title IV funds to students with Unusual Enrollment History C codes until there is adequate resolution outlined by the Department of Education., 77014=Baker College of Jackson 2800 Springport Road Jackson, Ml 49202 Toll Free: (888) 343-3683 Phone: (517) 788-7800 Fax: (517) 789-6333 finaid-jk@baker.edu , 75397=Baker College of Owosso  1020 South Washington Street Owosso, Ml 48867 Phone: (989) 729-3430 Fax (989) 729-3441 finaid-ow@baker.edu , 76172=Baker College of Muskegon 1903 Marquette Avenue Muskegon, Ml 49442 Toll Free: (800) 937-0337 Phone: (231) 777-5231 Fax: (231) 777-5264 finaid-mu@baker.edu , 57471=Spring 2015: April 3, 2015, 78058=Baker College of Clinton Township 34950 Little Mack Avenue Clinton Township, Ml 48035 Toll Free: (888) 272-2842 Phone: (586) 790-2810 Fax: (586) 791 -8186 finaid-ct@baker.edu, 6849=For 2012 and prior tax transcript requests, please contact the Financial Aid Office for further guidance., 74372=Baker Center for Graduate Studies 1116 West Bristol Road Flint, Ml 48507 Toll Free: 800-796-7064 Phone: (810)-766-2027 Fax: (810) 766-2107 finaid-cg@baker.edu, 72130=1-855-471-1614 - if you are in repayment and have questions or concerns, 57238=Spring 2016: April 1, 2016, 7205=Victims of Identity Theft Beginning with the 2013 tax year, tax filers—who were unable to request an IRS Tax Return Transcript—may authenticate with the IRS Identity Protection Specialized Unit (800-908-4490). Once authenticated, the taxpayer may request that the IRS mail an alternate paper tax return transcript., 57297=Winter 2016: January 8, 2016, 57530=Winter 2015: January 9, 2015}",
    "TableContextTimeStampAfterTable": "{18861=The classes which you are registered for at 11:59 p.m. (EST) on the census date will determine Pell Grant eligibility. The same date is used for second session online classes, so don\"t delay registration. Credit hours added after the census date cannot be used to increase Pell Grant eligibility., 196935=1-888-442-4551 Monday - Friday  7:00 AM - 7:00 PM Central Time (Note: you may experience long hold times), 97657=Note: For all Stafford loans first disbursed on or after July 1, 2006, the interest rate in both the FFEL and Direct Loan Program was fixed at 6.8 percent. That rate continues to apply to all unsubsidized Stafford Loans and to subsidized Stafford Loans for graduate and professional students. Beginning with loans first disbursed between July 1, 2008 and June 30, 2009, the interest rate on subsidized Stafford Loans for undergraduate students was reduced to 6.0 percent, with additional reductions each year through June 30, 2012. , 199911=Montgomery GI Bill Selected Reserves-Chapter 1606, 61822=High school seniors are eligible to apply for a Baker College Career Scholarship. Recipients will be selected by a Scholarship Awards Committee on the basis of academic achievement. The $4,800 scholarships are applied toward each recipient's tuition at the rate of up to $400 per term. The application deadline is May 1., 225535=Pell Grant A Federal grant that provides up to $5,730 in an academic year (2014-2015 maximum amount, based on full-time enrollment). Students qualify for Pell grant based on the Expected Family Contribution from the FAFSA., 153927=Effective as of July 1, 2006, a loan(s) in an in-school status cannot be included in a borrower's consolidation loan. Borrowers with loans in an in-school status can continue to consolidate their other loans that are in grace, repayment, deferment, forbearance, delinquent and default status., 128689=Note: As of July 1, 2010, for the Federal Stafford Loan Program, the William D. Ford Direct Loan Program is the only lender available for all colleges and universities. However, for private student loans, there are many available lenders, and it is your choice which lender you select., 55012=Required Application Materials To be considered for the Adult Education Scholarship, Baker College must receive the following application materials postmarked by May 1:, 211170=Award Year The period for which financial aid is requested; an award year runs from July 1 to June 30., 229669=Tax Transcript IRS form that shows most line items from the Federal tax return (1040, 1040A, or 1040EZ) as it was originally filed, including any additional forms or schedules. This information is available for free from the IRS. Please visit our Tax Transcript website for additional information on how to obtain a copy., 197687=716-857-3196 or 716-857-3197 Monday - Friday 8:00 AM to 4:00 PM Eastern Time. , 57554=Required Application Materials To be considered for the Alternative High School Scholarship, Baker College must receive the following application materials postmarked by May 1:, 201858=Restored Entitlement for Program for Survivors-REPS Benefits Social security benefits are payable to certain survivors of members or former members of the Armed Forces who died while on active duty prior to August 13, 1981, or who died from a disability incurred in or aggravated by active duty prior to August 13, 1981. Service in the Public Health Service or National Oceanic and Atmospheric Administration does not qualify., 17552=Baker Townhouses: $1000/person/quarter, 66846=Michigan Competitive Scholarship awards are available to applicants who have achieved semi-finalist status on their ACT test scores, have been Michigan residents since July 1 of the previous calendar year, and demonstrate financial need. , 230118=Title IV Part of the Higher Education Act of 1965, which covers the administration of Federal student financial aid programs., 153702=Effective as of July 1, 2006, married borrowers no longer may consolidate their education loans into a single new loan consolidation., 136551=Only available if the loans were first distribursed on/after October 7, 1998, and the current balance meets the above-mentioned criteria. For example: If you have $35,000 in outstanding FFELP Loans and $10,000 in FDLP Loans, you can choose extended repayment for the FFELP Loans, but not the FDLP Loans., 96286=Direct Loans and Federal Family Education Loans (FFEL) first disbursed on or after July 1, 2006 offer a fixed interest rate. Note: Effective July 1, 2010, the only available loans are Direct Loans., 560644=© 2015 All rights reserved. Baker College., 242141=© 2015 All rights reserved. Baker College | Disclosure of Consumer Information | Privacy Policy | Site Map Accredited by The Higher Learning Commission | An equal opportunity affirmative action institution., 60642=Required Application Materials Baker College must have the following application materials postmarked by May 1 if the student wishes to be considered for the Board of Regent's Scholarship:, 67108=Scholarship funds are divided equally among quarters. This scholarship is used for tuition only, and should be used before any other financial aid is applied to tuition. The excess (if any) will be returned to the scholarship fund. The financial aid closing date is September 1. , 189857=The interest rate is fixed and is almost always lower than private loans - and much lower than credit card interest rates. For loans first disbursed on or after July 1, 2010, and before July 1, 2011, the interest rate is 4.5% for subsidized loans for undergraduate students and 6.8% for unsubsidized loans for undergraduate and graduate students. The rate for subsidized loans made to graduate students is 6.8%., 218590=Federal Subsidized Loan A loan that the federal government pays the interest on while the student is in school, during the grace period (usually six months grace), and during deferments (postponements of repayment). Students must demonstrate financial need, as determined by federal regulations. Note: Students who have subsidized Stafford loans made on and after July 1, 2012, and prior to July 1, 2014, must temporarily pay interest that accrues during the six months grace period provided the students are no longer enrolled on at least a half-time basis. If not paid, the accrued interest will be capitalized (added to the principal balance on the loan)., 173624=The FSA Ombudsman works with federal student loan borrowers to resolve loan disputes or problems from an impartial, independent viewpoint. If a borrower has a problem with a federal student loan, they should contact the holder of the loan and try to resolve the problem. If the problem can't be resolved with the loan holder, contact FSA Ombudsman at 1-877-557-2575 or visit their website at www.studentaid.ed.gov. If visiting the StudentAid ed gov website to contact Ombudsman office online, the \"Contact the Ombudsman\" link is found under the Repay Your Loans column at the bottom as shown below.}",
    "textBeforeTable": "At Baker College, the tuition per quarter hour of credit is based on the following schedule. Tuition is subject to change at the beginning of any quarter and includes most fees. Tuition & Fees Please Note: Once the tax transcript is received, please send the original to the Financial Aid Office of the campus you plan to attend (keep a copy for your own records). Before submitting a tax transcript (for a student and or parent), be sure to print the student's name and UIN number on all pages so the office can identify the student record to which the transcript belongs. Mail or fax the completed IRS Form 4506T-EZ to the appropriate address (or FAX number) provided on page 2 of Form 4506T-EZ. The tax filer (or spouse, if requesting information from a joint tax return) must sign and date the form and enter their telephone number. Only one signature is required to request a transcript for a joint return. On line 6, enter the appropriate tax year. Line 5 provides tax filers with the option to have their IRS Tax Return Transcript mailed directly to a third party by the IRS. Parents, please skip this line. If the transcript is mailed directly to Baker College, by a parent, we will not be able to match it to the appropriate student record. Complete lines 1 through 4, following the instructions on page 2 of the form. Note that line 3 should",
    "textAfterTable": "  Active-duty and Servicemembers Baker College offers special tuition rates for active duty service members.     Military Tuition Rate* 4 Qtr. Credit Course Rate** 6 Qtr. Credit Course Rate* UNDERGRADUATE             GoArmy Ed Program $165.00 $660.00 $990.00 Active Military $165.00 $660.00 $990.00 Guard & Reserve $165.00 $660.00 $990.00 GRADUATE             GoArmy Ed Program $245.00 $980.00     Active Military $245.00 $980.00     Guard & Reserve $245.00 $980.00       Fees 2015/2016 Academic Year Undergraduate Application Fee—Payable with application $20 Graduate Application Fee—Payable with application $25 Undergraduate/Graduate Late Fee—Applied at time account is sent to collections for nonpayment $50 Undergraduate Graduation Processing Fee—(one-time fee covers both associate and bachelor degrees). $50 Graduate Graduation Processing Fee $75 Undergraduate and Graduate NSF Return Fee (per item returned by the bank). $25 Fingerprinting Fee Varies Immunization Fee Varies Background Check Fee Varies",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}