{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "Free shipping"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Economy Shipping"
        ],
        [
            "Delivery*",
            "Estimated within 2-7 business days",
            "Estimated within 2-11 business days"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/ITP-SS212-ATV-Wheels-Rims-Machined-12-Polaris-Sportsman-RZR-Ranger-4-/151246524251?pt=Motors_ATV_Parts_Accessories&hash=item2336fecf5b&vxp=mtr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417352295,
    "recordOffset": 417299907,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83491=ITP SS212 ATV Wheels/Rims Machined 12\" Polaris Sportsman RZR Ranger (4) This sale includes: (4) ITP SS212 Machined ATV Wheels Front/Rear 12x7 (4/156) - (4+3) [12SS303] + (1) KJM Chrome Lug Kit & Valve Stems - 3/8\" x 24 [Beveled]. These wheels will fit various Polaris machines (RZR, RZR S, RZR XP 900, Ranger 400-800, 2015 Ranger 570 (Midsize), Sportsman ACE, Sportsman NON XP etc.). This kit will NOT work on the Polaris Ranger XP 900, 2015 RZR 900, 2015 RZR 900 S, 2015 RZR 900 XC, 2015 Ranger 570 Fullsize/Crew & RZR XP 1000 EPS (different lug nuts), please see our other listings for that machine. Tire clearance varies by specific machine. Most machines can go at least 1\" larger on the tire diameter. NOTES: If you any questions or concerns about fitment please contact us by email or phone BEFORE you order. All of the wheels we sell include center caps (except Method 401 beadlock wheels). When you buy a set of 4 wheels OR 4 wheels & tires from us we include a Chrome Lug Kit for FREE ($20 Savings). Beware of other companies that do not include lug nuts & valve stems with their wheel sale, some wheels require a special type of lug nut to fit into the wheel and your stock lug nuts may not work. If you wish to substitute the Chrome Lug Kit with a Black Lug Kit you must contact us prior to ordering to verify availability and to ensure the change is made before the product has been packaged/shipped. We stock the majority of what we sell to ensure you get a great price and your order is shipped in a timely fashion. We ship all orders within 1 business day. If you are interested in a mounted setup and don't see what you are looking for on our store please let us know. We can always package any tire we offer on any wheel we offer and they will come to your door mounted and ready to bolt on to your machine. SKU: ITSS212M12x7-5FS}",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 3 items available. Please enter a number less than or equal to 3. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Estimated sales tax Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Seller charges sales tax for items shipped to: NY*(8.0%). * Tax applies to subtotal + S&H for these provinces only Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}