{
    "relation": [
        [
            "VALUES",
            "NNNNN, or",
            "NNNNN–NNNN"
        ],
        [
            "MEANINGS",
            "numeric",
            ""
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.17.46 Automated Non-Master File Accounting",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-017-046r.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 527253103,
    "recordOffset": 527179429,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{228364=Input of the Form 813 information using the Form 813 Block Control screen is the major control for all items entered onto the ANMF System. All blocks of documents that are either pre-journalized or post journalized will be input to the Form 813 Block Control screen. See IRM 3.17.46.13.4 for further instructions. The only exceptions are Even returns, Refund returns, NMF Extensions of Time to File, entity changes, transfer-in and loaded old accounts (ULCs)., 113617=PRIMARY LOCATION CODE— Beginning in 2002, the Primary Location Code will consist of a Universal Location Code and Area Office. ULCAO ( the last two digits will reflect the new AO code associated with the taxpayers ULC and BOD., 251919=For Historical Purpose only-Effective October 2001, Ogden Submission Processing Center began establishing a fact of filing on all Form 8329 and Form 8330., 32045=IRM 3.17.63, Redesign Revenue Accounting Control System, 203163=If the return is out of the campus area, prepare Form 2275 to include name and address of the taxpayer, return DLN and amount of credit applied. Insert Form 2275 in the proper sequence in the block and forward the return to the transfer clerk., 32780=IRM 3.24.37, General Instructions, 298926=The NMF Accounts Maintenance Technician will research both spouse accounts and forward the transcript package to the Adjustment function if all of the following conditions are present. On the routing slip, indicate \"Spousal Assessment—May Need Abatement Action.\", 8138=(35) Revised IRM 3.17.46.11.4 (2) (b) to remove Master File research includes both IDRS and the Microfilm Replacement System (MRS) research., 30841=IRM 2.4.14, Command Code NMFST, 289581=TDAs on either spouse will systemically include all cross reference information. This information should be entered on the second name line on IDRS (limited to 35 characters). See IRM 3.17.46.9 for establishing TDAs via IDRS., 15060=As of September 22, 2006, all NMF processing has been centralized in the Cincinnati Submission Processing Campus (CSPC)., 301308=Effective January 1, 1998 all credit elects will be posted to the ANMF Database. After all credits are applied and if the return still has a remaining tax balance, OSPC will indicate the amount of credit applied to the tax. When the return is forwarded to Accounting, the tax amount will be assessed on ANMF., 200642=The Form 3465 and Memorandum of Authority will be forwarded directly to the Scheduling function without being routed through the Statute function. The Form 3465 will be assigned a DLN with doc. code 54. A Form 2188, Voucher and Schedule of Overpayments and Overassessments, will be prepared to reverse the abatement., 207816=Form 2859, Request of Quick or Prompt Assessment;, 8519=(38) Revised IRM 3.17.46.11.4 (6) (c) to add such as, a check was returned due to an IRS error, e.g., mailing it to the wrong address., 3539=(8) IPU 14U0605 issued 04-02-2014 IRM 3.17.46.5.5.2 (4) Updated to include instructions for the processing of the Form 5310-A assessments., 190350=Attach the photocopy of Form 3465 and the original memorandum to the Accounting Operations Manager in the Cincinnati Submission Processing Campus to the permanent file copy of the Form 2188., 175060=Form 1331/1331B, Notice of Adjustment, (posting copy) will be the posting document for the abatement. It will be received with the following documentation attached:, 179191=The Manual Refund function will forward Form 1331/1331B, a copy of Form 1166, Form 3753 or Form 5792, and the related case files through RACS to the NMF function for simultaneous posting of the abatement and refund to the NMF account per IRM 3.17.79, Accounting Refund Transactions. NMF will input the appropriate transactions for credit, refunds, etc., to the NMF account through the SUBSEQUENT TRANSACTION INPUT screen., 311259=This Section provides instruction for the posting of a 54B Forestry Conservation Bond Refund under Section 15316 of the Food, Conservation, and Energy Act of 2008., 190573=Associate the photocopy of the Accounting Operations Manager memo with the original Form 3465 and forward with the Form 2188 to the Certifying Officer for signature., 26699=Since NMF automation, NMF returns, assessments and adjustments are contained on the database. \"Information Only\" returns, and NMF No-Remit Extensions of Time To File, are not input to the ANMF system. They will require preparation of Index Cards. The database will contain all 1300 accounts (including status 89), 1324 accounts (below Taxpayer Delinquent Account deferral), 1360 (installment agreement) and 1830 accounts (including reactivated 53'd accounts). However, the related Index Cards for the converted ULCs were not loaded onto the database., 260179=The tax period should always be the year and the month that the Commissioner signed the agreement. For example: July 15, 2002 (date) would be 200207., 9071=(42) Revised IRM 3.17.46.13.6 (25) to include TC 605/604., 316597=A one-time project for Form 1120 FSC processing returns and payments occurred prior to 1990 which may have not posted to the BMF or NMF. The NMF Unit in the Cincinnati Submission Processing Campus maintains a listing of these documents for research purposes. Contact the NMF Team Manager for research of the listing., 42255=As of January 2007, an ANMF/SCCF Interface provides for the systemic posting of Good Block Proof Records to clear the NMF SCCF., 3820=(10) Added deceased secondary spouse SSNs to IRM 3.17.46.5.7.1 (1), IRM 3.17.46.5.7.2 (1), and IRM 3.17.46.5.7.3 (1)., 257303=Balance Due – The taxpayer usually remits estimated payments and/or may have a credit elect on the Master File prior to filing the tax return. Master File will cause an Unpostable Condition when a payment/credit results in the total balance of $1 Billion or greater. Rejects will notify Accounting to move the payment/ credit to the NMF Unapplied Advance Payments Account 4610. Upon notification, the NMF Account Specialist must transfer all payments/credits via Form 2424 or Form 3809 as appropriate from the Master File module to Account 4610 pending the filing of the tax return., 8293=(36) Removed IRM 3.17.46.11.4 (5), due to the fact that Forms 3870 are not worked in the NMF team., 279038=Culpable Spouse—During the examination of a joint return, if a culpable party is determined, Examination will prepare a Form 5344 and Form 3177 and the Appeals Office will prepare a Form 5403 to assess the culpable spouse. The Form 3177 or Item A on Form 5403 will cross reference the innocent spouse. This assessment will be made through NMF. Accounts with a notation to \"prepare Form 3177\" on Form 5403, require the input of TC 130 on the Master File. Monitor the account until the TC 130 posts to IDRS. See IRM 3.17.46.7.10., 277712=MFT 31 allows accounts requiring split processing to remain on the Master File. Split processing cases require that a joint IMF account be separated into two and sometimes three accounts. Prior to January 2001, these accounts i.e., bankruptcy, culpable spouse, innocent spouse, non-petitioning/petitioning spouse, offer in compromise, were processed on ANMF., 321597=As of the second Monday of December each year, all open (notice status) accounts which have been assessed that year are identified systemically., 284592=Follow-up of these accounts that are six months old must be made no later than January 31 and June 30 of each year. If the account is not in open status on the AIMS database, prepare a two-way memo from Cincinnati Submission Processing Campus Accounting Operations Manager to Chief, Appeals Office requesting the status of these cases in Tax Court. Appeals will respond by furnishing the open and closed docketed case listing to the Accounting Operations Manager., 184160=All collections, reversals or subsequent re-applications must be identified for reporting purposes by an abstract number. Abstract numbers can be computer generated for some documents, but must be manually determined and input to the system for others. The proper abstract numbers applicable to collections on the various returns and documents are listed in Exhibit 3.17.46-6 and may also be found in Accounting and Operating Reports IRM 3.17.41, Accounting and Operating Reports., 265160=Revenue Procedures: ONLY NMF will process the new EP/EO Determination Letter application fee using procedures in IRM 3.17.46.5.5 Internal Revenue Service Closing Agreements. In the cross-reference section of the ANMF Entity screen annotate REV PROC Number e.g., REV PROC 2003-72., 32304=IRM 3.17.79, Accounting Refund Transactions, 2950=(5) IRM 3.17.46.3.5 (6) added see IRM 20.2.7.8, Combat Zone - IRC 7508, for exact time frame for not charging interest when a taxpayer is in a combat zone., 184765=Returns which report only a single type of tax (e.g., Form 1042 or Form 1040-NR) will have the abstract number generated and need no manual determination. Those returns reporting more than one type of tax (Form 11, Form 5330 or Form 4720), require manual determination of the payment by the specified abstract number., 29415=The duties and responsibilities of the NMF Account Specialist are identified in IRM 3.17.46.14., 125777=UNIVERSAL LOCATION CODE—Beginning in 2002 the ULCs will consist of the Pre-DOS 11 districts or Filing District Offices (FiDO) which was in place prior to District Office consolidation which took place in 1996 (65 District/Area Offices). There will also be a new District/Area Office Code of 78 for Washington D.C., 37141=CALENDAR YEAR: Twelve consecutive months ending December 31., 300594=NMF tax returns processed only in NMF include the following foreign returns: Form 1042 (prior to January 1 1985), Form 8288 (prior to January 1, 2006), and Form 8804 (prior to January 1, 2005). IRC 1446 and the withholding Information Document 8805 are processed to a Tier II Database then transmitted to ECC-MTB for upload to the IRMF (TP 200412 and subsequent)., 7365=(32) Added Note to IRM 3.17.46.11.2 (3) stating the law was repealed in 1989, therefore it only applies to interest on returns starting in 1985 and ends with returns having due dates prior to 1990. See IRM 20.2.5.8, Tax Motivated Transaction (TMT) Interest., 7637=(33) Added Notes to IRM 3.17.46.11.2 (4) stating to see IRM 20.2.8.6, Reasons for Restrictions, for a list of additional reasons interest needs to be manually computed and stating C-corporations owing taxes over $100,000.00 and not full paid within 30-days of the notice (23C date) may get charged an additional 2%. See IRM 20.2.5.8, Large Corporate Underpayment (LCU)., 5209=(18) Updated IRM 3.17.46.5.20.1 (4) (d) to change TC 534/535 to TC 604/605., 282837=Non-Petitioning Spouse—Receive Form 5403 or form 5344 from the Appeals or Exam Office. Item A on Form 5403 will cross reference the petitioning spouse. Accounts with a notation to \"prepare Form 3177\" on Form 5403, require the input of TC 130 on the Master File. Monitor the account until the TC 130 posts on IDRS. See IRM 3.17.46.7.10., 9265=(44) Revised IRM 3.17.46.15.4 (4) (d) to remove instructions to send NMF Accounts for Notice/TDA to CSCO., 5447=(20) Added Note to IRM 3.17.46.5.27 indicating this section is for historical and research purposes., 151735=When the Form 813 is completed, stamp Part 1 with the ANMF processing stamp and initial it when the function is performed. If the Form 813 contains pre-journalized items, be sure to annotate the Form 813 with the journal number, 23C date and NMF status at this time. If the Form 813 contains post journalized items, this information will be included on the various RACS Recaps and will be annotated on Form 813 at the time RACS receives the Recap. See IRM 3.17.46.4.4 (4) and (5) for further information., 322052=All remaining accounts from the prior year hold file and related accounts in delinquent status will be associated systemically. See IRM 3.17.46.7.7 (2) (b) for TDA instructions., 182823=Non-remittance returns and refundable returns with doc. codes that do not appear in the Accounting and Operating Reports IRM 3.17.41, Accounting and Operating Reports, do not need an abstract code or zero money amount entry on Form 813 (part 2)., 201755=See IRM 3.17.46.9 to establish TDA via IDRS., 278162=18,000 accounts previously established on NMF were transferred to MFT 31 in 2005., 250854=Establish and maintain an account for penalty assessments for Failure to File Information Returns (IRC 6652) on Forms 6248, 5500, 1042S and 990 series. For blocking series and doc. code see IRM 3.10.72, Extracting, Sorting, and Numbering., 4674=(15) Added Note to IRM 3.17.46.5.15 indicating this section is for historical and research purposes., 205095=Receive returns from batching under control of Form 2345, Batch Transmittal. Returns will be numbered and blocked as assessable returns., 5912=(24) Added IRM 3.17.46.7.10 (6) (d) Review accounts for an open TC 582. If open TC 582 is identified see IRM 3.17.46.12.5 (2)., 180942=An ANMF/SCCF Interface was implemented on January 5, 2007 for daily systemic posting of the Good Block Proof Records or 0-5 adjustments to the NMF SCCF. ANMF001 File is sent to ECC at MEM for input to the newly created SCF16 output file which produces a Run-to-Run Control Report, Error Report, and ANMF Input Recap Control Listing for use by the Data Control function. This process coincides with the ANMF/RRACS Interface, i.e., ANMF SC RECAP, thereby minimizing reconciling items and manual SCFAJ adjustments., 19478=If the credit is needed, a Debit and Credit Adjustment Voucher, Form 2424 and Form 3809, is prepared to transfer the credit to the account with an outstanding liability., 24086=The tax return or source document (such as a Form 5734, Non-Master File Assessment Voucher or Form 2859, Request for a Quick or Prompt Assessment) reflects all major activity that affects the original assessment. For example, if a tax return is audited by Examination, a Form 2859 will be attached to the return. The return is renumbered to reflect a \"47\" document code. Prior to NMF automation, a Unit Ledger Card would have been established under the manual system for the assessment. An assessment label would also be affixed if the assessment resulted from a DP (Data Processing) tax adjustment., 293710=For each action on an OIC account, NMF will request a transcript of that account and forward the requested transcript to the Brookhaven Campus indicated below: IRS 1040 Waverly Avenue Stop 669 Holtsville, New York 11742, 183836=If a return or remittance should be processed NMF but has been misblocked (numbered in an improper series), process it as NMF following the instructions stated in IRM 3.17.46.2.7 (5) above. See IRM 3.17.46.2.7 (5)., 66842=COLLECTION LOCATION CODE— (CLC) Beginning in 2002 the CLC replaces the TDA/Taxpayer Delinquency Investigation (TDI) or Secondary Location Code and will identify the Small Business and Self-employed (SB/SE) or Wage and Investment (W&I) Area Office (AO) controlling the collection case. The CLC will NEVER reflect a Tax Exempt (TE) or Large Business and International (LB&I) Area Office., 29578=The duties and responsibilities of the NMF Database Administrator (DBA) are identified in IRM 3.17.46.15., 41773=FISCAL YEAR (FY): Twelve consecutive months ending on the last day of any month other than December., 288439=If the non-petitioning spouse tax account is overassessed, a Form 1331 prepared by the Appeals Offices in process. Annotate the History Section of the account \"Form 1331 Pending\" ., 178021=The refund amount will be scheduled on Form 1166, Refund Schedule. Copies of the refund document will be attached to the Form 1166 and to the Form 2188., 23378=If the return was a refund return, verify the refund from the refund schedule, Form 1166 OCR., 24728=If an examination or adjustment to the original assessment on the return results in an abatement of tax a Form 1331/1331B, Notice of Adjustment, is used to abate tax, penalty, and interest. Every Form 1331/1331B, is given a schedule number. The schedule number is a number which identifies and controls an overassessment of tax. The first four digits of the schedule number identifies the year and cycle in which a Form 2188, Voucher and Schedule of Overpayments and Overassessments, was signed by the certifying officer. Form 1331/1331B are filed in schedule number sequence, usually behind the Form 2188 on which it was certified. An Index Card was prepared for each Form 1331/1331B certified. Now that accounts are established on the NMF database, the abatement schedule number can be secured by researching the transaction section of the account., 321211=As of the second Monday of October each year, Form 3967 (2nd notice to the taxpayer) will be generated to include the total due of all accounts outstanding for the current year. The tax due is a single amount but reflects all periods outstanding. The notice includes all accrued penalty and interest. The notice will be included on the Certified Mail List., 146911=The ANMF SC RECAP reflects the Weekly Posting Cycle with a Day portion (DD). The cycle begins on Friday and ends on Thursday. Effective January 1, 2012, Customer Account Data Engine 2 (CADE 2) will transition the IMF Legacy processing cycle from a Saturday - Sunday to a Friday - Thursday cycle, the DD and 23C date will change to coincide with CADE 2. The DD denotes the day of input to the ANMF database as follows:, 211330=Some returns are charged from the blocks with a Form 2275 and routed to Examination or other functions according to instructions elsewhere in this IRM. The folders containing the charged documents should also be associated with the CPL as if the returns were still present., 250607=For Historical Purpose only-Effective December 1, 1989 the Penalty Reference Number (PRN) 600 is processed as IRC 6721 Penalty to Master File., 267377=EP Division Policy provides for the treatment of a late filing penalty from Form 5310-A similar to a Closing Agreement or Sanction Payment. EP, Employee Plans has deemed this to be a \"compliance\" fee similar to the (Revenue Procedure) Rev. Proc. 2003-72., 9000=(41) Revised IRM 3.17.46.13.6 (24) to include TC 604/605., 190771=Forward the Form 2188, original Form 3465 with Form 813, photocopy of the Accounting Operations Manager memo and the original letter to the taxpayer (if a notice is required) to the RACS function., 144765=Post TC 971 AC 501 or 506 upon receipt of Form 3177 or IDRS Form 5147 to ANMF., 288663=RACS will receive Form 1331 with Form 2188 and Form 813. Input the Form 813 information into the ANMF System using the Form 813 Block Control screen and forward Form 1331 and Form 813 to NMF for processing., 16623=Supplemental assessments (IRC 6204) of tax liability plus penalties and interest are determined by Accounts Management, Collection, Appeals, Tax Exempt/Government Entities (TE/GE) or by the Examination function. Returns on which additional assessments have been determined will bear a Form 2859, Request for Quick or Prompt Assessment, or Form 5403, Appeals Closing Record, Form 5344, Examination Closing Record, Form 5599, TE/GE Examined Closing Record, Form 5650, EP Examined Closing Record, Form 5734, Non-Master File Assessment Voucher, Form 8278, Assessment and Abatement of Miscellaneous Civil Penalties, etc. The source document will indicate the tax liability to be assessed plus any interest or penalties to be assessed and will show the assessment document locator number (DLN)., 7150=(31) IPU 14U0782 issued 04-28-2014 IRM 3.17.46.11.1 (1) e. Revised 21 calender day FTP and Interest free period will apply to any payment made on an NMF account with a liability of less than $100,000., 31837=IRM 3.17.30, SC Data Controls, 4446=(13) Added Note to IRM 3.17.46.5.11 indicating this section is for historical and research purposes., 16120=Prior to October 1, 1996, the distinction was made between \"Even Returns,\" \"Refund Returns\" and \"Full Paid Returns.\" The Index Card Database was used to post \"Even\" and \"Refund\" returns. These procedures no longer apply. All NMF assessments are now posted to the ANMF database. The only return information that is now processed to the Index Card System are Non-Remit Extensions of Time to File and Information Only returns., 254105=NMF should no longer input a TC 481 (rejected OIC) or a TC 482 (withdraw OIC) with a TC 550 extending the Collection Expiration Date on the ANMF system. If a request is received, input the TC 481/482 only. Notify the sender that the TC 550 was not input, citing the Community Renewal Act of 2000 Section 6331(k)., 258235=Research Account 4610 for all payments/credits that were transferred from the Master File. See IRM 3.17.46.8.5 (7) c for applying credits to the taxpayer’s NMF account., 258475=Research Master File to ensure that all payments/credits have been transferred to Account 4610. If not, then prepare Form 2424 or Form 3809 accordingly to transfer the credit to the taxpayer’s NMF account., 30744=IRM 2.4.11, Command Code NMFTM, 255429=Form 1040 will be numbered as follows:, 156584=Post-journalized items include all weekly assessments and all other subsequent transactions including payments which are not determined as advanced payments. See IRM 3.17.46.4.2 for further information., 276683=The Form 1331 will be assigned a DLN with doc. code 54., 5688=(22) Updated Note in IRM 3.17.46.5.39 to indicate this section is for historical and research purposes., 177506=The Manual Refund function will prepare Form 2188, Voucher and Schedule of Overpayment and Overassessments, from Section II of Form 1331/1331B—for the net decrease in liability (total of refund elimination plus credit; total of the abatement etc.)—to certify the amounts of overassessment on Form 813. Enter the schedule number and schedule date of Form 2188 on the Form 813, Form 1331/1331B and Overassessment sticker. Enter the schedule number on the posting copy of Form 1331/1331B., 6340=(27) Added Note to IRM 3.17.46.8.1 (4) indicating that Form 1040NR fiduciary estimated tax payments may remain in 4430 Account for 120 days., 275717=Prepare Form 1725 and notate \"pre-assessment 53, no TDA issued\" . Attach it to Form 9494 (part 2). Route part 3 of Form 6335 and Form 9494 (part 2) to the Special Procedures function in the originating Area Office., 207542=Form 1296, Assessment Against Transferee of Fiduciary;, 175842=If credit amounts are to be applied to another Non-Master File or a Master File account, a Form 3809, Miscellaneous Adjustment Voucher, or Form 2424, Account Adjustment Voucher, will be prepared by the originator and attached to the Form 1331/1331B. The credit transfer information will be noted in the appropriate place on the Form 1331/1331B. The Form 3809 and Form 2424, both debit and credit portions, will be forwarded for processing. The NMF account will remain in a credit balance until the debit side of the Form 3809 or Form 2424 is posted. For credits, the 23C date of the assessment or the paid date(s) whichever is later, will be considered the paid date(s) of the credit., 153976=Choose the option NMF Block Control/Correction from the Journal Main menu. Input the following information to the Form 813 Block Control screen: See IRM 3.17.46.13.4 for entry information., 268416=RACS will pre-journalize the initial assessment for the entire amount to Account 1300 in Status 89. RACS will forward the package to ANMF to establish an account through the LOAD Acct/Transfer-In Screen., 237846=Prepare Form 2275 and indicate \"permanent chargeout—documents nullified from NMF processing\" for the posting documents removed from the document folder. Annotate the refile DLN if known., 2547=(2) Revised IRM 3.17.46.1.4 (1) (b) to change the renumbered DLN of the return to the abatement schedule number., 8668=(39) Added Note to IRM 3.17.46.11.5 (5) (a) stating to see IRM 20.2.7.6, Erroneous Refunds - IRC 6404 (e), regarding interest computation and payment grace periods., 32167=IRM 3.17.64, Accounting Control General Ledger Policies and Procedures, 3951=(11) IPU 14U0124 issued 01-15-2014 IRM 3.17.46.5.9 (5) - Revised to remove a correction should also be made to Abstract Number 204 to match the related return. EPMF (Employee Plan Master File) is not longer processed on the ANMF (Automated Non-Master File) system., 31933=IRM 3.17.41, Accounting and Operating Reports, 21603=Refund checks are undeliverable by the Post Office at times. These checks are returned to the Disbursing Office which in turn prepares a Consolidated Listing of NMF Checks (prior to 1986, Form 1664X, Undelivered Refund, were prepared) and a Form 1098 (Schedule of Cancelled Checks) for cancellation. These documents are forwarded to the campuses. A file of all Consolidated Listings are maintained by the Refund Inquiry function., 2315=(1) This transmits revised IRM 3.17.46 Accounting and Data Control, Automated Non-Master File Accounting., 47940=REVENUE RECEIPTS: Monies collected in payment of tax liabilities. The net totals of Accounts 2100 and 2200., 191193=The Form 514-B for the account transfer from MF will be processed following normal Transfer-in procedures. See IRM 3.17.46.5.20., 313802=The refund (Form 3753) will be scheduled in the manual refund function using manual refund procedures in the IRM 3.17.79, Accounting Refund Transactions., 32414=IRM 3.17.80, Working and Monitoring Category D, Erroneous Refund Cases in Accounting Operations, 83569=NMF-ACCOUNT-TRANSCRIPT-RECORD—NMF account transcript used to provide taxpayer account information for case processing by campus and area office personnel. May be requested by IRS employees or generated when specific accounts require accounts maintenance action., 176877=The full amount of the overassessment will be listed as an abatement on both the Form 1331/1331B and overassessment label. If the abatement credit exceeds the balance of the account, the disposition of the credit must be entered in the appropriate portion of Section II of the Form 1331/1331B., 226857=NMF will forward the Recap(s) to RACS for journalization. The related Form 813 (part 2) will be associated and the reverse side worked as instructed in IRM 3.17.46.2.4. This will only occur if manual journalization is required. See IRM 3.17.46.2.4 (4) for the ANMF SC RECAP procedures., 301646=The specific references in IRM 3.17.46.5.27, IRM 3.17.46.5.33, and IRM 3.17.46.5.37 should be followed when processing these returns in Accounting., 209371=If Form 3244A, part 2, Payment Posting Voucher—Examination, is attached to the assessment document, determine if the payment has been assessed or unassessed. See IRM 3.17.46.8.5 for further processing instructions., 6931=(30) IPU 14U0782 issued 04-28-2014 IRM 3.17.46.11.1 (1) d. Revised 10 business day FTP and Interest free period will apply to any payment made on an NMF account with a liability equal to or over $100,000., 3692=(9) IPU 14U0571 issued 03-27-2014 IRM 3.17.46.5.5.2 (4) to reflect the blocking series of 190 198 for Form 5310 A., 287521=NMF will establish an account through the Original Assessment screen which will generate the first notice. After assessment has been entered to ANMF database the account should be Linked. See IRM 3.17.46.13.8., 93343=NMF Non-SCCF Recap—Summary of transactions posted to an NMF taxpayer account which do not affect the Service Center Control File. Includes abatement or reverse abatement transactions posted from NMF audit adjustment documents numbered with an overassessment blocking series per IRM 4.4.22, Non-Master File (NMF) Processing; penalty, interest, abatement or reverse abatement transactions posted from NMF DP adjustment documents; and transactions which write-off an NMF taxpayer account or reverse a write-off transaction, i.e., account uncollectible, statute expired, and underpayment cleared. Used to effect journalization by the RRACS System. The system will generate three separate Non-SCCF Recaps:, 8406=(37) Revised IRM 3.17.46.11.4 (6) to change IRM 20.2, Interest to IRM 20.2.4, Overpayment Interest., 4997=(17) Added Note to IRM 3.17.46.5.20.1 (3) stating a CP 96 that generates for MFT 55 with TC 240, REF-NUM 631 on Master file must be input the to ANMF system using MFT 28, PRN 630, and Abstract 189., 145481=Direct references to specific General Ledger accounts will be minimized. The IRM 3.17.63, Redesign Revenue Accounting Control System, and IRM 3.17.64, Accounting Control General Ledger Policies and Procedures, provides further description of the accounts., 8021=(34) Revised IRM 3.17.46.11.4 (1) (a) to reflect the correct description of the Credit Balance Listing., 257977=Any Form 2424 prepared in the Accounting operation must be reviewed and initialed by the employee's manger or designee before sending to be processed., 73323=IRS-EMPLOYEE-NUMBER—Ten digit number identifying an IRS employee. Includes the organization code and the individual identification number. May also be used to identify transcript requests generated during transaction processing., 6711=(29) Added Note to IRM 3.17.46.8.5 (7) (c) (1) stating any Form 2424 prepared in the Accounting operation must be reviewed and initialed by the employee's manger or designee before sending to be processed., 205261=Prepare Form 813 for the assessable blocks, listing the amounts to be assessed. Use the DLN from the Form 2345 and verify that the item count on the Form 813 equals that of the Form 2345., 185115=If the document is listed in Accounting and Operating Reports IRM 3.17.41, Accounting and Operating Reports, as requiring manual abstracting, entry of the total credit and specified abstract number must be shown in block \"a\" of the NMF Block Summary on the reverse of Form 813 (part 2)., 305113=Transfer full payment amount on the \"extension\" account to the related return via Form 2424., 2101=November 28, 2014, 296860=If the assessment document indicates that this is a Petitioning/Non-Petitioning Spouse case, follow the procedures in IRM 3.17.46.5.7.2., 260599=Appropriate journalization is necessary to ensure the integrity and the balancing of the RRACS and ANMF Systems. RACS will pre-journalize the initial assessment for the entire amount to Account 1300 in Status 89. RACS will forward the package to ANMF to establish an account through the LOAD Acct/Transfer-In Screen., 2817=(4) IRM 3.17.46.3.4 (2) added see IRM 25.6.1, Statue of Limitations Processes and Procedures, for other statute issues., 4230=(12) Added Note to IRM 3.17.46.5.9 (7) (c) stating any Form 2424 prepared in the Accounting operation must be reviewed and initialed by the employee's manger or designee before sending to be processed., 285150=Reasonable research should be completed before preparing this memo. A list of all outstanding accounts will be generated no later than January 15 and June 15 each year. The list will include the following:, 13699=All Split Assessment accounts are now processed on the Individual Master File under MFT 31. A majority of accounts previously established on NMF were transferred to MFT 31 from September 2004 through December 2005., 155330=Pre-journalized items include all daily assessments, embezzlement cases, adjustments (ADJs), Revenue Procedures (Rev. Proc.) and closing agreements. See IRM 3.17.46.4.1 for further information., 254841=Form 1040, Individual Income Tax Return, which cannot be processed to Master File because the module balance is $1 Billion or greater must be routed to the Accounting Function in the Cincinnati Submission Processing Campus. RACS will receive these returns and input Form 813 information through the Form 813 Block Control screen. It is advisable that the NMF Account Specialist review the return for any special handling prior to posting to ANMF. For example, the taxpayer may have a tax deferral which will require coordination with the Adjustment function., 276493=Collection will prepare Form 1331, Notice of Adjustment, requesting an abatement of assessment. This form will be forwarded to Accounting for input to the ANMF., 296359=During the examination of a joint return, the Appeals Office will assess both spouses separately for the same tax issue. Interest and penalty amounts assessed may be different. These spousal assessments will be made through NMF. A \"Linked Account\" field has been added to identify Duplicate Assessments. See IRM 3.17.46.13.8., 4788=(16) IPU 14U0124 issued 01-15-2014 IRM 3.17.46.5.20.1 (3) - Revised note to include instructions to input \"1\" in the NMF statement code, and cross reference EIN of related corporation., 207722=Form 2749, Request for Trust Fund Recovery Penalty Assessment;, 6124=(26) Added Note to IRM 3.17.46.8.1 (3) (a) stating any Form 2424 prepared in the Accounting operation must be reviewed and initialed by the employee's manger or designee before sending to be processed., 204375=If the returns should be processed to a Master File but have been improperly numbered in a Non-Master File block, or if a Non-Master File return is improperly blocked, delete it from the block as instructed in IRM 3.17.46.2.7 (5). See IRM 3.17.46.2.7 (5)., 31729=IRM 3.17.21, Credit and Account Transfers, 46061=PERIOD ENDING: The ending year and month indicating the period covered by a tax return, e.g., 8609 indicates a return for the period ended September 30, 1986. For the ANMF system, an eight digit field in MMDDYYYY format., 31624=IRM 3.11.25, Miscellaneous Tax Returns, 2132=Note:DO NOT REMOVE AND INSERT PAGES OR DISPOSE OF OBSOLETE TRANSMITTALS PRIOR TO 01–01–2015, 2673=(3) Revised IRM 3.17.46.1.4 (4) to read However, the related Index Cards for the converted ULCs were not loaded onto the database., 146527=The ANMF SERVICE CENTER RECAP OF ASSESSMENTS, ABATEMENTS, AND OTHER POST-JOURNALIZED TRANSACTIONS, hereafter referred to as ANMF SC RECAP or ARECAP, was implemented on May 2, 2006. The report mimics the weekly IMF and Business Master File (BMF) SC RECAP with one exception – ANMF SC RECAP is processed daily. However, the 23C Date is the weekly 23C Date., 178203=Part 2 of Form 1331/1331B and the supporting documentation will be attached to the original assessment document and forwarded to RACS for input to the Form 813 Block Control screen. Part 1 of Form 1331/1331B goes to the taxpayer., 239564=Prepare Form 2275 and indicate \"permanent chargeout—documents nullified from NMF processing\" ., 9142=(43) IRM 3.17.46.13.11 (28) updated duplicate transaction codes to include 160, 170, 180, 310, 350, and 360., 5561=(21) Revised IRM 3.17.46.5.37 (2) & (4) to include Form 990T, Exempt Organization Business Income Tax Return., 280721=TDAs— on either spouse will systemically include all cross reference information and should be entered on the second name line on IDRS (limited to 35 characters). See IRM 3.17.46.9 for establishing TDAs via IDRS., 3328=(7) Added Note to IRM 3.17.46.5.4 (7) stating any Form 2424 prepared in the Accounting operation must be reviewed and initialed by the employee's manger or designee before sending to be processed., 188723=General—This section provides instructions for processing non-rebate erroneous abatement cases in which Master File computer programming prevents the reversal of abatement transactions after the Statute of Limitations for Assessment has expired. These cases are limited to situations in which an erroneous abatement occurred due to a clerical error that served to reduce the tax liability of that account or another account, a bankruptcy discharge, or an unauthorized abatement that occurred after referral to the Department of Justice. See IRM 25.6.1.10.2.1.1, Reversal of Erroneous Abatements. The Service will treat the account as any other account where the original tax liability has never been paid. Refer to IRM 3.17.243.2, Miscellaneous Accounting, for additional background information and Credit and Account Transfer procedures., 200192=Collections will prepare Form 12810, Transfer Request Checklist, a Form 3465 and a Memorandum of Authority requesting transfer of the reversal to NMF., 287066=Receive Form 5403 from the Appeals Office. Item A on this form will cross reference the non-petitioning spouse and indicate either; resume notices or Form 1331 in process., 271343=Assessment of the personal liability for excise tax will be processed through NMF until Master File programming is completed. These assessments will be received in NMF on Form 9494, Request for Assessment of Personal Liability for Excise Tax. These assessments will be processed as NMF Daily Assessments. A \"Linked Account\" has been added to identify duplicate assessments. See IRM 3.17.46.13.8., 5298=(19) IPU 14U0124 issued 01-15-2014 IRM 3.17.46.5.20.1 (4) - Added note stating TC 800 should be coded with the due date of the return., 178462=The renumbered original assessment document, Form 813 part 1 and Form 1331/1331B part 2 will be forwarded to NMF for input of the abatement or credit through the SUBSEQUENT TRANSACTION INPUT screen., 140169=In November 2002, ANMF database migrated from the Pyramid system at each campus to the Sun Enterprise platform which is housed at the Enterprise Computing Center in Memphis, Tennessee (ECC-MEM). Disaster Recovery procedures are maintained in the ANMF Service Level Agreement (SLA) for processing at the Enterprise Computing Center in Martinsburg, West Virginia (ECC-MTB) should a disaster occur at the Enterprise Computing Center in Memphis, Tennessee., 35159=ABATEMENTS: To reduce an assessment of tax, penalty, or interest, when determined the assessment is incorrect. Abatements require the signature of the Certifying Officer and are supported by the legal document: Form 2188, Voucher and Schedule of Overpayment and Overassessment., 253859=The Community Renewal Act of 2000 amends the Reform and Restructuring Act of 1998 Section 6331(k) stating that the Service can no longer suspend the Collection Statute of Limitations while certain offers are pending., 207628=Form 2644, Recommendation for Jeopardy/Termination Assessment;, 8847=(40) Removed IRM 3.17.46.11.5 (6) because all Erroneous Refunds are worked in Cincinnati ER function, and updated 510C letter information., 160872=Verify the Run ID (Document #) as in item # 2 above, Cycle/DD (Alternate Document #), and the 23C Date (Prepare Date) from the Source Journal to the ANMF SC RECAP for accuracy. For example, Friday’s input via ANMF dated December 30, 2011 will reflect Cycle and DD as 20120201 with a 23C Date of 01-23-2012., 197787=Forward the Form 3465, memo and NMF transcript to the NMF Scheduling function for preparation of Form 2188 and Form 813 as outline in IRM 3.17.46.2.9 (7), 282328=Where a statutory notice of deficiency was issued on a joint Master File return and only one of the spouses petitioned the U.S. Tax Court, assessments are made against the non-petitioning spouse and processed through NMF. The petitioning spouse may or may not be assessed at a later date, depending on the court decision. A \"Linked Account\" identifies Duplicate Assessments. See IRM 3.17.46.13.8., 3120=(6) Added Note to IRM 3.17.46.5.2 (5), For Historical Purpose only-Effective October 2001, Ogden Submission Processing Center began establishing a fact of filing on all Form 8329 and Form 8330., 5805=(23) Updated IRM 3.17.46.6.10, CSO State Agency Addresses, to include all mailing addresses., 177378=List Form 1331/1331B on Form 813. The Form 3753, or Form 5792, will be listed on separate Form 813., 31412=IRM 21.7.12, Non-Master File (NMF) Adjustments, 4560=(14) Added Note to IRM 3.17.46.5.12 indicating this section is for historical and research purposes., 289278=If a credit posts to either account, a Spousal Assessment Transcript will generate. Abatement action may need to be initiated for the other account. Follow the procedures in IRM 3.17.46.5.7.4. if this type of transcript is generated., 6053=(25) Remove IRM 3.17.46.8 (2) (c), CP 213 (5500 Payments), 19894=Credit to any other outstanding liabilities for the same taxpayer for any taxable periods. The credit would be applied by collection statute expiration date. The oldest 23C date will be paid first. If the credit is needed, a Miscellaneous Adjustment Voucher, Form 3809 or an Account Adjustment Voucher, Form 2424 should be prepared to transfer the credit to the account needing the credit., 43803=Effective May 2006, an ANMF/RRACS (Redesign Revenue Accounting Control System) Interface provides for the internal (batch) journalization via RRACS to the various General Ledger accounts. See IRM 3.17.46.1.10 (20). for ANMF SC RECAP description, 205478=Upon receipt of the various NMF Recaps, complete items (a), Abstract Number and Amount, on the NMF Block Summary of Form 813 (part 2) for all taxable blocks. See IRM 3.17.46.2.7., 6495=(28) Added Note to IRM 3.17.46.8.1 (4) (a) stating any Form 2424 prepared in the Accounting operation must be reviewed and initialed by the employee's manger or designee before sending to be processed., 222822=Affirmative statement that the Area Director has approved Form 2644 for Jeopardy or Termination assessments;, 190078=Prepare Form 2188 reversing the amount of the erroneous abatement by bracketing the amount., 305520=Follow procedures in IRM 3.17.46.11.4, Credit Balances - Refund Returns, for disposition of any credit balance remaining on the account., 44894=MM/DD/YYYY: The eight digit format which identifies the month, day, and year, i.e., January 03, 1986 will be 01/03/1986.}",
    "textBeforeTable": "TAXPAYER IDENTIFICATION NUMBER (TIN): Every taxpayer on the Master File has a permanent number for identification of the tax account. The employer identification number (EIN) is used to identify taxpayers on the Business Master File. The social security number (SSN) is used as the account number of the taxpayer on the Individual Master File. The format of these account numbers is: TAXPAYER DELINQUENT ACCOUNT (TDA): A computer generated printout indicating that the taxpayer's account has reached a delinquent status. TDAs are sent to the Compliance Services Campus Operations (CSCO) for collection action. TAXPAYER ADVOCATE SERVICE PROGRAM: A program established whereby taxpayers' problems can be referred and controlled until the problems are resolved. TAXPAYER: An entity liable for any type of Federal tax. 199912 Example: TAX PERIOD: A six digit number which represents the end of the tax liability year for a return; and is designated by the year and month, TAX CLASS: Revenue Receipts are categorized into seven major tax classes. These are: withholding, individual income, corporation income, excise, estate and gift, carriers tax and Federal Unemployment Tax. SUBSEQUENT PAYMENT: A payment received for an account that has been assessed and the taxpayer has been billed. STATUTE LIMITATIONS: The Internal Revenue Code states that the IRS will assess tax, refund credit, and collect taxes within a specific time frame. This limit is known as",
    "textAfterTable": "TRANSACTION CODE (TC): A three digit number which defines the precise nature of the transaction. For example, TC 150 indicates \"Return Filed and Tax Liability Assessed.\" Refer to Document 6209, IRS Processing Codes and Information, for complete listing of transaction codes. UNIDENTIFIED REMITTANCE (UR): Remittances without the necessary identification to apply to a Master File or a Non-Master File account. UNIDENTIFIED REMITTANCE FILE (URF): A separate file within the Integrated Data Retrieval System containing all remittances received that cannot be immediately identified or applied. Each record within the file contains the URF control number, amount or remittance, type of remittance, received date, taxpayer's name and other identifying information, if known. UNIT LEDGER CARD (ULC) Form 6335: Account cards that were used prior to the ANMF System to record all transactions related to a tax liability maintained manually. USER FRIENDLY TRANSCRIPT: this transcript, similar to a MFTRX, can be sent to the taxpayer. WEEKLY ASSESSMENTS: An assessments which is post journalized. WITH REMITTANCE (W/R): Any document received with cash, check, money order or other forms of payment. 3.17.46.1.10  (01-01-2012) Glossary of Computer Terms Any term in all capital letters is a data element within the system. Any term in lower case letters is the title of screen, field,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}