{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The safety at this school is ok but could be worse. I never see any type of security around, but we are a small town also.",
            "None",
            "Im unexperienced in this area.",
            "Anyone can get there core subjects here but they also have departments such as nursing, cosmetology, drafting, criminal justice and more.",
            "I have not heard of any unusual traditions.",
            "Like i said its a small school but worth it.",
            "Join student life group for fun activities and games.",
            "The food is quite alright and dining isn't bad!",
            "I have never lived in the dorms here, however, I had a cousin that did and she loved it. She even became a dorm monitor.",
            "The Academics at this school are fantastic. Even for a small college, it has a wide range of degree choices.",
            "Its a great place to start because of the size and the great teaching.",
            "NCTC is a great school. The professors here are well educated and know what they are talking about. It's a small junior college but it works well."
        ]
    ],
    "pageTitle": "North Central Texas College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/North-Central-Texas-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897292787,
    "recordOffset": 897252504,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1525=For Fall 2008, Spring 2009, and now Fall 2009, my tuition is under, right at, or a little over $1,000. Used books are recommended if saving money is your goal., 154272=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/06/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 person found this inaccurate. 1 of 40 Corey from Lewisville, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Am learning a lot NCTC is a great place to be. Since the classes are smaller than other universities you are able to get one on one help with your professors which benefits a lot because you are able to learn a lot more and ask questions. The library has lots of resources for students anything from books, newspapers, magazines to computers, printers scanners. Anything you need the library has got it to help the students learning experience more beneficial and fun! Login to rate or flag the reviews Kaytlynn from Valley View, TX 05/18/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 40 Categories Comments Tips for prospective students If you are not positive on your career goal, NCTC is a great place to start your basics and receive an associates degree. Also, they have a great nursing program, if you are interested in a nursing degree. Am learning a lot",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}