{
    "relation": [
        [
            "",
            "Egg Oral Immunotherapy (OIT)",
            "Placebo"
        ],
        [
            "Description",
            "Subjects ingest egg white solid (EWS) on Visit 1 (initial day dose escalation up to 50 mg), followed by a build-up phase (escalating daily egg doses every 2 wks, achieving a maintenance dose by 32-40 wks). Thereafter, subjects are on a maximally tolerated daily egg dose (306 mg to 2 gm) for ≥8 wks. After wk 44, subjects are given a 5 gm Oral Food Challenge (OFC) using EWS to identify desensitized [1] subjects. Subjects/study staff are unblinded following this OFC and either continue on their egg OIT maintenance dose of 2 gm/day or are allowed to attempt escalation up to 2 gm/day for the remainder of the study (1-3 years). A 10 gm OFC to identify desensitized [1] subjects occurs at specified intervals under prescribed conditions (yrs 2 - 4). Subjects who pass this 1st 10 gm OFC stop study therapy for 4-6 wks, then have a 2nd 10 gm OFC. Subjects that pass this 2nd 10 gm OFC are considered tolerant [2], stop EWS dosing and add egg to their diet.",
            "Subjects ingest placebo (cornstarch) during Visit 1 (initial day of dose escalation up to 50 mg), followed by a build-up phase (escalating daily placebo doses every 2 wks, achieving a maintenance dose by 32-40 wks). Thereafter, subjects were on a maximally tolerated daily placebo dose (306 mg to 2 gm) for ≥8 wks. After wk 44, subjects were given a 5 gm Oral Food Challenge (OFC) using egg white solid to identify desensitized [1] subjects. Subjects/study staff were unblinded following this initial 5 gm OFC. After unblinding, subjects discontinued further placebo dosing and continued on an egg-restricted diet. A 10 gm OFC was administered under prescribed conditions to subjects if their egg-specific serum IgE level was below 2 kUA/L. They were followed in the study up to 2 years. [1] Desensitized: Subject does not react to egg during OFC while taking daily doses of therapy. [2] Tolerant: Subject does not react to egg during OFC 4-6 wks after abstinence from egg consumption."
        ]
    ],
    "pageTitle": "Oral Immunotherapy for Childhood Egg Allergy - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00461097?sect=X0125&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861900015,
    "recordOffset": 861880118,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Recruitment took place at five university-based medical centers in the United States (Mt. Sinai School of Medicine, Johns Hopkins University, Duke University, National Jewish Medical Center, University of Arkansas Children's Hospital) from July 2007 to December 2008. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Egg oral immunotherapy Drug: Control Group Interventions: Hypersensitivity Immediate Hypersensitivity Food Hypersensitivity Conditions: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Treatment Study Design:",
    "textAfterTable": "Participant Flow:   Overall Study     Egg Oral Immunotherapy (OIT)     Placebo   STARTED     40     15   Had Month 10 (Wk 44) Oral Food Challenge     35     13   Had Month 22 (Wk 96) Oral Food Challenge     34     1   Had Year 3 (Mnth 36) Oral Food Challenge     16     0   Had Year 4 (Mnth 48) Oral Food Challenge     7     0   COMPLETED     40 [1]   15 [2]",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}