{
    "relation": [
        [
            "",
            "ATV/RTV Switch Arm",
            "PI/RTV Control Arm"
        ],
        [
            "Description",
            "Participants switching their current treatment with a ritonavir (RTV)-boosted protease inhibitor (PI)-containing highly active antiretroviral therapy (HAART) regimen to atazanavir (ATV)/RTV (ATV: 2 x 150 mg capsules once daily (QD) / RTV: 1 x 100 mg capsule QD) while continuing their background nucleoside reverse transcriptase inhibitors (NRTIs).",
            "Participants continued on their current treatment with an RTV-boosted, PI-containing HAART regimen while continuing their background NRTIs."
        ]
    ],
    "pageTitle": "Study of Reyataz in HIV-infected Patients With Lipodystrophy Syndrome - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00135356?sect=X01256&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 870538539,
    "recordOffset": 870512147,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups A total of 219 participants were enrolled and 18 were never randomized (1 poor/noncompliance; 10 no longer met study criteria; 5 withdrew consent). 201 participants were randomized; however, 1 participant was never treated and is not included in the participant flow. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: Atazanavir (ATV) + ritonavir (RTV), continuation of backbone 2 nucleoside reverse transcriptase inhibitor (NRTIs) Drug: continuation of current HAART (boosted protease inhibitor [PI] combination + 2 NRTIs) Interventions: HIV-Associated Lipodystrophy Syndrome Condition:",
    "textAfterTable": "Participant Flow:   Overall Study     ATV/RTV Switch Arm     PI/RTV Control Arm   STARTED     131 [1]   69 [2] Discontinued Prior to Week 96 Visit     16     9   Discontinued on or After Week 96 Visit     1     0   COMPLETED     114     60   NOT COMPLETED     17     9   Adverse Event                 6                 2  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}