{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "195,348",
            "67,781",
            "67,212",
            "23,940",
            "8,423",
            "4,004",
            "438,613"
        ],
        [
            "Congregations",
            "392",
            "12",
            "69",
            "57",
            "10",
            "8",
            "-"
        ]
    ],
    "pageTitle": "Duluth, Georgia (GA) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Duluth-Georgia.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 376168059,
    "recordOffset": 376024601,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7352=According to our research of Georgia and other state lists there were 32 registered sex offenders living in Duluth, Georgia as of July 30, 2015. The ratio of number of residents in Duluth to the number of sex offenders is 873 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 26078=Elevation: 1100 feet}",
    "TableContextTimeStampAfterTable": "{65486=2000 Presidential Elections Results, 187508=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 48180=Particulate Matter (PM10) [µg/m3] level in 2012 was 19.5. This is about average. Closest monitor was 10.4 miles away from the city center., 48930=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.3. This is about average. Closest monitor was 5.3 miles away from the city center., 82621=8.20% of this county's 2010 resident taxpayers moved to other counties in 2011 ($37,275 average adjusted gross income), 46729=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.11. This is significantly better than average. Closest monitor was 21.2 miles away from the city center., 80419=8.69% of this county's 2011 resident taxpayers lived in other counties in 2010 ($35,247 average adjusted gross income), 44605=Air Quality Index (AQI) level in 2012 was 116. This is significantly worse than average., 186204=Total of 1362 patent applications in 2008-2015., 65200=1996 Presidential Elections Results, 39643=Hotels: Amerisuites John's Creek (11505 Medlock Bridge Rd), Gwinnett Conv Visitors Bureau (6500 Sugarloaf Pkwy), Extended Stay America (3430 Venture Parkway), Atlanta Marriott Gwinnett Pl (1775 Pleasant Hill Rd), Caesar's World Marketing Office (2805 Peachtree Industrial), Four Seasons Thrift Shop (3166 Buford Highway), Amerisuites (11505 Medlock Bridge Road), Days Inn Gwinnett Place Mall (1920 Pleasant Hill Road), Days Inn Gwinnett (1920 Pleasant Hill Road)., 66344=2012 Presidential Elections Results, 62438=School Enrollment by Level of School (%) in 2013, 65772=2004 Presidential Elections Results, 16847=On 4/3/1974, a category F4 tornado 27.5 miles away from the city center killed 6 people and injured 30 people and caused between $500,000 and $5,000,000 in damages., 45266=Carbon Monoxide (CO) [ppm] level in 2012 was 0.331. This is about average. Closest monitor was 11.6 miles away from the city center., 62040=Educational Attainment (%) in 2013, 45984=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 11.5. This is significantly worse than average. Closest monitor was 11.6 miles away from the city center., 66628=Graphs represent county-level data. Detailed 2008 Election Results, 16562=On 11/22/1992, a category F4 (max. wind speeds 207-260 mph) tornado 20.0 miles away from the Duluth city center injured 46 people and caused between $5,000,000 and $50,000,000 in damages., 47474=Ozone [ppb] level in 2012 was 26.2. This is better than average. Closest monitor was 11.6 miles away from the city center., 66058=2008 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Duluth city (based on Gwinnett County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Electricity (35%) Utility gas (65%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 125 Gwinnett County: 1.62 / 10,000 pop. Georgia: 1.91 / 10,000 pop. Number of supercenters and club stores: 14 This county: 0.18 / 10,000 pop. State: 0.15 / 10,000 pop. Number of convenience stores (no gas): 51 Gwinnett County: 0.66 / 10,000 pop. Georgia: 0.86 / 10,000 pop. Number of convenience stores (with gas): 304 Gwinnett County: 3.94 / 10,000 pop. State: 5.12 / 10,000 pop. Number of full-service restaurants: 716 Here: 9.28 / 10,000 pop. State: 7.41 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}