{
    "relation": [
        [
            "Citing Patent",
            "US7219226",
            "US7263191",
            "US7272726",
            "US7284135",
            "US7293178 *",
            "US7302586",
            "US7330969 *",
            "US7337328",
            "US7337329",
            "US7386518 *",
            "US7515173",
            "US7599857 *",
            "US7668954 *",
            "US7693279",
            "US7762457",
            "US7805378 *",
            "US8155314",
            "US8191128 *",
            "US8281129 *",
            "US8301753",
            "US8307072",
            "US8341411 *",
            "US8397082 *",
            "US8572386 *",
            "US8738929",
            "US8745395 *",
            "US8751381",
            "US8819792",
            "US20040109563 *",
            "US20040111627 *",
            "US20040172340 *",
            "US20040230593 *",
            "US20040255119 *",
            "US20040260646 *",
            "US20040267578 *",
            "US20050005136 *",
            "US20050033983 *",
            "US20080072048 *",
            "US20100325041 *",
            "US20110022855 *",
            "US20110289322 *",
            "US20120297195 *",
            "WO2010083113A1 *"
        ],
        [
            "Filing date",
            "Oct 11, 2002",
            "Oct 11, 2002",
            "Jan 27, 2005",
            "Jul 30, 2003",
            "Dec 9, 2002",
            "Jan 27, 2005",
            "Oct 11, 2002",
            "Jan 27, 2005",
            "Jan 27, 2005",
            "Dec 16, 2003",
            "May 23, 2002",
            "Dec 4, 2003",
            "Jun 27, 2006",
            "Apr 21, 2004",
            "",
            "Aug 30, 2004",
            "Jun 24, 2002",
            "Nov 26, 2004",
            "Jan 18, 2006",
            "Jun 27, 2006",
            "Feb 22, 2010",
            "Aug 16, 2006",
            "Sep 30, 2010",
            "Aug 4, 2004",
            "Mar 2, 2012",
            "Jul 25, 2012",
            "Feb 23, 2012",
            "Apr 26, 2011",
            "Jul 30, 2003",
            "Dec 9, 2002",
            "Dec 4, 2003",
            "May 3, 2004",
            "Mar 25, 2004",
            "Aug 30, 2004",
            "Apr 2, 2004",
            "Apr 21, 2004",
            "Aug 4, 2004",
            "Aug 16, 2006",
            "Aug 26, 2010",
            "Sep 30, 2010",
            "",
            "",
            "Jan 11, 2010"
        ],
        [
            "Publication date",
            "May 15, 2007",
            "Aug 28, 2007",
            "Sep 18, 2007",
            "Oct 16, 2007",
            "Nov 6, 2007",
            "Nov 27, 2007",
            "Feb 12, 2008",
            "Feb 26, 2008",
            "Feb 26, 2008",
            "Jun 10, 2008",
            "Apr 7, 2009",
            "Oct 6, 2009",
            "Feb 23, 2010",
            "Apr 6, 2010",
            "Jul 27, 2010",
            "Sep 28, 2010",
            "Apr 10, 2012",
            "May 29, 2012",
            "Oct 2, 2012",
            "Oct 30, 2012",
            "Nov 6, 2012",
            "Dec 25, 2012",
            "Mar 12, 2013",
            "Oct 29, 2013",
            "May 27, 2014",
            "Jun 3, 2014",
            "Jun 10, 2014",
            "Aug 26, 2014",
            "Jun 10, 2004",
            "Jun 10, 2004",
            "Sep 2, 2004",
            "Nov 18, 2004",
            "Dec 16, 2004",
            "Dec 23, 2004",
            "Dec 30, 2004",
            "Jan 6, 2005",
            "Feb 10, 2005",
            "Mar 20, 2008",
            "Dec 23, 2010",
            "Jan 27, 2011",
            "Nov 24, 2011",
            "Nov 22, 2012",
            "Jul 22, 2010"
        ],
        [
            "Applicant",
            "Hewlett-Packard Company",
            "Hewlett-Packard Development Company, L.P.",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Hewlett-Packard Development Company, L.P.",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Pitney Bowes Inc.",
            "Microsoft Corporation",
            "American Express Travel Related Services Company, Inc.",
            "Stephen Waller Melvin",
            "Hewlett-Packard Development Company, L.P.",
            "American Express Travel Related Services Company, Inc.",
            "American Express Travel Related Servicex Company, Inc.",
            "Microsoft Corporation",
            "Bce Inc.",
            "Nader Asghari-Kamrani",
            "Nosadia Pass Nv, Limited Liability Company",
            "Nosadia Pass Nv, Limited Liability Company",
            "Research In Motion Limited",
            "Verizon Corporate Services Group Inc.",
            "Panasonic Corporation",
            "Microsoft Corporation",
            "Blackberry Limited",
            "Mastercard International Incorporated",
            "Blackberry Limited",
            "Evans Glenn F.",
            "Evans Glenn F.",
            "American Express Travel Related Services",
            "Rudin Harry R.",
            "Masaharu Ukeda",
            "American Express Travel Related Systems Company, Inc.",
            "Pearson Siani Lynne",
            "Liqun Chen",
            "Hiroshi Takekawa",
            "Research In Motion Limited",
            "American Express Travel Related Services Company, Inc.",
            "Walter Clark Milliken",
            "Rasti Mehran",
            "Research In Motion Limited",
            "American Express Travel Related Services Company, Inc."
        ],
        [
            "Title",
            "Method and apparatus for encrypting data",
            "Method and apparatus for encrypting data",
            "Secure video card methods and systems",
            "Methods and systems for maintaining an encrypted video memory subsystem",
            "Methods and systems for maintaining an encrypted video memory subsystem",
            "Secure video card methods and systems",
            "Method and apparatus for data validation",
            "Secure video card methods and systems",
            "Secure video card methods and systems",
            "Method and system for facilitating transactions",
            "Head pose tracking system",
            "System and method for facilitating interaction between consumer and merchant",
            "Unique identifier validation",
            "Security method and apparatus using biometric data",
            "System and method for dynamic fob synchronization and personalization",
            "System and method for encoding information in magnetic stripe format for use in radio frequency identification transactions",
            "Systems and methods for securing video card output",
            "Systems and methods for controlling access to a public data network from a visited access provider",
            "Direct authentication system and method via trusted authenticators",
            "Endpoint activity logging",
            "Network adapter validation",
            "Enabling use of a certificate stored in a smart card",
            "System and method for thwarting buffer overflow attacks using encrypted process pointers",
            "Secure device, information processing terminal, integrated circuit, terminal application generation apparatus, application authentication method",
            "Auxiliary functionality for pixel data",
            "Enabling use of a certificate stored in a smart card",
            "Demand deposit account payment system",
            "Assignment and distribution of access credentials to mobile communication devices",
            "Methods and systems for maintaning an encrypted video memory subsystem",
            "Methods and systems for maintaining an encrypted video memory subsystem",
            "System and method for facilitating interaction between consumer and merchant",
            "Anonymous advertisement intermediation",
            "Memory device and passcode generator",
            "System and method for encoding information in magnetic stripe format for use in radio frequency identification transactions",
            "Method of purchasing insurance or validating an anonymous transaction",
            "Security method and apparatus using biometric data",
            "Secure device, information processing terminal, integrated circuit, terminal application generation apparatus, application authentication method",
            "Enabling Use of a Certificate Stored in a Smart Card",
            "System and method for encoding information in magnetic stripe format for use in radio frequency identification transactions",
            "System and method for thwarting buffer overflow attacks using encrypted process pointers",
            "Protected use of identity identifier objects",
            "Enabling use of a certificate stored in a smart card",
            "Systems for locating a payment system utilizing a point of sale device"
        ]
    ],
    "pageTitle": "Patent US7096204 - Electronic commerce system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7096204?ie=ISO-8859-1&dq=7586891",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474692943,
    "recordOffset": 474654743,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6122=FIG. 9 is a diagram that illustrates a different model according to an embodiment of the present invention. A consumer 1201 has a trust relationship 1209 with Bank 1 1206. The consumer is a credit card holder and the bank issues the card. In addition, the consumer 1201 has another trust relationship 1219 with an ISP 1202 in this case the consumer holds a trust token (here, smart card 1220) issued by the ISP 1202. With this smart card, the consumer is able to check the integrity of the ISP platform 1202 and the ISP is able to check the identity of the consumer 1201 essentially as described above with reference to FIG. 5 (in particular). The ISP 1201 has a trust relationship 1210 with Bank 1 1206 as it is a client of the bank. The ISP 1202 also has a trust relationship 1221 with a vendor 1203. When the consumer 1201 wants to buy goods from the vendor 1203, he contacts the ISP 1202, 1211, checks the integrity of the ISP platform and gets a temporary identity and session key from the ISP. The consumer then contacts the vendor 1203 by using this temporary identity and session key. Because of the trust relationship with the ISP the vendor is able to verify whether the ISP issued the temporary identity and session key or not. If asked to authorise a transaction, the ISP 1202 contacts Bank 1206 via a gateway 1205, 1214, 1215 to authorise the payment from the consumer's account. If the verification is successful, the vendor will deliver the goods to the consumer 1218.}",
    "TableContextTimeStampAfterTable": "{44991=The other main components of the host computer 100 attached to the PCI bus 225 include: a SCSI (small computer system interface) adaptor connected via a SCSI bus 235 to a hard disk drive 2600 and a CD-ROM drive 2605; a LAN (local area network) adaptor 250 for connecting the host computer 100 to a LAN 125, via which the host computer 100 can communicate with other host computers (not shown), such as file servers, print servers or email servers, and the Internet 130; an 10 input/output) device 225, for attaching the keyboard 110, mouse 115 and smartcard reader 120; and a trusted device 260 (which incorporates the trusted display processor function). The trusted display processor handles all standard display functions plus a number of further tasks, which will be described in detail below. ‘Standard display functions’ are those functions that one would normally expect to find in any standard host computer 100, for example a PC operating under the Windows NT™ operating system, for displaying an image associated with the operating system or application software., 27260=The subject matter of the present application may also be related to the following U.S. patent applications: “Trusted Identities on a Trusted Computing Platform,” Ser. No. 10/208,716, filed Jul. 29, 2002; and “Method and Apparatus for User Profiling,” Ser. No. 10/241,893, filed Sep. 12, 2002., 35681=An embodiment of the present invention will now be described, by way of example. A part of the system of this preferred embodiment is a client platform will be described which contains a trusted component, the trusted component allowing secure and reliable interaction with the client platform by users or other parties communicating with the client platform. Such a trusted component is described below, but is more fully described in the applicant's copending International Patent Application No. PCT/GB 00/00528 entitled “Trusted Computing Platform” filed on 15 Feb. 2000 and incorporated by reference herein. The trusted component in the client platform also controls the client platform display, so the user can be confident that what is seen on the display has not been subverted by an unauthorised process operating on the client platform. This aspect of the trusted component is also described below, but is more fully described in the applicant's copending International Patent Application No. PCT/GB 00/01996 entitled “System for Digitally Signing a Document” filed on 25 May 2000 and incorporated by reference herein. The system also employs in preferred embodiments a trusted token personal to a user—in the embodiment described in detail here, the trusted token is a user smart card. In addition, in the embodiment described, not only the client platform but also the server contains a trusted component (though this does need to have trusted display functionality)., 80309=Additionally, or alternatively, in some embodiments it may be required that the user profile is encrypted and signed to protect privacy and integrity. If so, a secure data transfer protocol may be needed between the trusted device 260 and the smart card 122. There exist many available mechanisms for transferring secure credentials between two entities. A possible implementation, which may be used in the present embodiment, is secure key transport mechanisms from ISO/IEC DIS 11770-3, “Information technology—Security techniques—Key management—Part 3: Mechanisms using asymmetric techniques”, International Organization for Standardization, March 1997.}",
    "textBeforeTable": "Patent Citations Alternative protocols can be employed without deviating from the present invention. The skilled man will appreciate that the use of hardware to ensure confidence in trusted relationships allows for a particularly effective method for brokering transactions as shown above, by allowing trusted relationships to be leveraged without proliferation of exchanges of personal information. Note that during the flow of this protocol, if any verification or check is not successful, the corresponding verifier will make an announcement to let the other entities know what happens and then the protocol aborts. After receiving Message 17 and verifying the signature included, TC1 sends an acknowledgement to TC3. E′SK1(CMD3, N8−TC3, N6−TC1, TC2) 18. TC1 → TC3: The SC signs related information and sends this signature to TC1 in Message 17. SSC(CMD3, N9−TC1, TC1) 17. SC → TC1:",
    "textAfterTable": "Nov 27, 2007 Microsoft Corporation Secure video card methods and systems US7330969 * Oct 11, 2002 Feb 12, 2008 Hewlett-Packard Development Company, L.P. Method and apparatus for data validation US7337328 Jan 27, 2005 Feb 26, 2008 Microsoft Corporation Secure video card methods and systems US7337329 Jan 27, 2005 Feb 26, 2008 Microsoft Corporation Secure video card methods and systems US7386518 * Dec 16, 2003 Jun 10, 2008 Pitney Bowes Inc. Method and system for facilitating transactions US7515173 May 23, 2002 Apr 7, 2009 Microsoft Corporation Head pose tracking system US7599857 * Dec 4, 2003 Oct 6, 2009 American Express Travel Related Services Company, Inc. System and method for facilitating interaction between consumer and merchant US7668954 * Jun 27, 2006 Feb 23, 2010 Stephen Waller Melvin Unique identifier validation US7693279 Apr",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}