{
    "relation": [
        [
            "",
            "• #7 Alabama",
            "Tennessee"
        ],
        [
            "1",
            "3",
            "7"
        ],
        [
            "2",
            "10",
            "3"
        ],
        [
            "3",
            "21",
            "0"
        ],
        [
            "4",
            "7",
            "0"
        ],
        [
            "Total",
            "41",
            "10"
        ]
    ],
    "pageTitle": "2010 Alabama Crimson Tide football team - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2010_Alabama_Crimson_Tide_football_team",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 867179011,
    "recordOffset": 867108344,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{182452=For the game, Julio Jones set a school record with 221 receiving yards, eclipsing the previous mark of 217 yards set by David Palmer against Vanderbilt in 1993.[89][92][93] Ingram and Richardson finished with 88 and 119 yards on the ground respectively.[90] For his performance, left tackle James Carpenter was selected as the SEC Offensive Lineman of the Week.[94] With his 117 yards on 14 carries, Tauren Poole ended Alabama's 41-game streak of not allowing a 100-yard rusher dating back to BenJarvus Green-Ellis's 131 yard performance for Ole Miss in 2007.[92] The game also marked the first between Nick Saban and Derek Dooley who previously worked for Saban as an assistant coach at LSU and with the Miami Dolphins.[95] The victory improved Alabama's all-time record against the Volunteers to 47–38–7 (48–37–8 without NCAA vacations and forfeits).[92], 205949=After he completed 12 of 13 passes, McElroy set a new single-game Alabama record for completion percentage of 92.3 percent to break the previous record he set against North Texas in 2009.[122] The game also marked the first time Alabama played on a Thursday night since defeating Southern Miss in 2001, and the return of both former Alabama head coach Bill Curry as the Panthers' head coach and quarterback Star Jackson who transferred to Georgia State prior to the 2010 season.[116][123] The 63 points were the most scored by an Alabama team since defeating Vanderbilt 63–3 in 1979.[122], 173770=A week after their first regular season loss since the 2007 season, Alabama defeated their long-time rival, the Ole Miss Rebels on homecoming in Tuscaloosa 23–10.[80] The Crimson Tide took a 10–0 lead in the first quarter on a seven-yard Greg McElroy touchdown pass to Preston Dial and a 49-yard Cade Foster field goal.[81] Scoring continued in the second quarter with Alabama's Jeremy Shelley and Foster connecting on field goals of 19 and 44-yards. Mississippi's Bryson Rose connected on a 22-yard field goal to make the halftime score 16–3.[81] In the third quarter, McElroy connected with Trent Richardson for an 85-yard touchdown reception.[81] The catch was the fourth longest touchdown reception in school history.[82] Later in the quarter, Jeremiah Masoli connected with Melvin Harris on a 15-yard touchdown reception to make the final score 23–10.[81], 179053=In the 93rd edition of the Third Saturday in October, the Crimson Tide defeated the Tennessee Volunteers 41–10.[86][87] Tennessee scored first, on a 59-yard Tauren Poole touchdown run to take an early 7–0 lead.[88] Alabama responded by scoring on its next two drives: a 36-yard Jeremy Shelley field goal, and a one-yard Greg McElroy touchdown run to take a 10–7 lead.[88] The second quarter closed with a 42-yard Shelley field goal and a 33-yard field goal by Michael Palardy of Tennessee to make the halftime score 13–10.[88], 99349=The 2010 schedule was officially released on September 2, 2009.[18] In accordance with conference rules, Alabama faced all five Western Division opponents: Arkansas, Auburn, LSU, Mississippi State, and Ole Miss. They also faced three Eastern Division opponents: official SEC rival Tennessee, Florida, and South Carolina.[19] Alabama did not play SEC opponents Georgia, Kentucky and Vanderbilt.[19] The contest against Ole Miss served as the 2010 homecoming game.[20], 13141=The 2010 Alabama Crimson Tide football team (variously \"Alabama\", \"UA\", \"Bama\" or \"The Tide\") represented the University of Alabama in the 2010 NCAA Division I FBS football season. It was the Crimson Tide's 116th overall season, 77th as a member of the Southeastern Conference (SEC) and its 19th within the SEC Western Division. The team was led by head coach Nick Saban, in his fourth year, and played their home games at Bryant–Denny Stadium in Tuscaloosa, Alabama. They finished the season with a record of ten wins and three losses (10–3, 5–3 in the SEC) and defeated Michigan State 49–7 in the Capital One Bowl., 117210=The only change to the coaching staff from the 2009 season was the departure of James Willis, an associate head and outside linebackers coach, to become the defensive coordinator at Texas Tech.[28] Willis was replaced on the staff with Jeremy Pruitt on January 15.[29] Other assistants that declined positions at other programs included Jim McElwain declining an offer to become San Jose State's head coach and Kirby Smart declining an offer to become Georgia's defensive coordinator.[30][31], 180532=Alabama opened the second half by driving 70 yards in four plays, with Julio Jones having receptions of 38 and 19 yards and Mark Ingram punching in the touchdown from one-yard out to extend their lead to 20–10.[88][89] After Palardy missed a 52-yard field goal, Trent Richardson ran the ball 65 yards for a touchdown on the second play of the ensuing drive for a 27–10 Alabama lead.[88][90] Later, Robert Lester intercepted a Matt Simms pass, and Alabama extended its lead to 34–10, after an 80-yard drive with Ingram scoring from one-yard out.[88][90] Alabama scored the final points of the evening in the fourth quarter when AJ McCarron hit Richardson for a five-yard touchdown reception to make the final score 41–10.[88] It was Alabama's most lopsided victory over Tennessee since defeating the Volunteers 35–0 in 1963.[91], 201702=Originally scheduled to be played on November 20, in July 2010 this game was moved to Thursday, November 18 to give the Crimson Tide extra time to prepare for its game against Auburn.[116] In the first ever meeting against the Georgia State Panthers, the Crimson Tide was victorious 63–7.[117][118][119] Alabama scored first on an eight-yard Greg McElroy pass to Julio Jones.[120][121] After a Mark Barron interception ended the first Georgia State drive, Alabama responded with a 71-yard drive capped by a one-yard Mark Ingram touchdown run to take a 14–0 lead.[120][121], 258001=Of all the draft-eligible juniors, Mark Ingram, Julio Jones and Marcell Dareus declared their eligibility for the 2011 NFL Draft on January 7.[165][166] At the time of their announcement, each was projected as a first round pick.[165][166] Five Alabama players, two seniors and three juniors, were invited to the NFL Scouting Combine.[167] The invited players were offensive lineman James Carpenter, quarterback Greg McElroy, defensive end Marcell Dareus, running back Mark Ingram, and wide receiver Julio Jones.[167] In the draft, Alabama set a school record with four players selected in the first round.[168] The first round selections were Dareus (3rd Buffalo Bills), Jones (6th Atlanta Falcons), Carpenter (25th Seattle Seahawks) and Ingram (28th New Orleans Saints).[168] McElroy was selected in the seventh round (208th New York Jets).[169] Preston Dial signed as an undrafted free agent with the Detroit Lions in July 2011 after the NFL labor dispute was resolved.[170], 161760=Although Florida outgained the Crimson Tide in total offense 281 to 273 yards, their three turnovers resulted in 21 Alabama points.[67] In addition to Mosley, Nico Johnson intercepted Trey Burton in the end zone and Dre Kirkpatrick intercepted a John Brantley pass.[67] The game marked the first time Florida had been held without a touchdown since their previous visit to Tuscaloosa in 2005, and resulted in Alabama leading the nation in scoring defense by allowing only 45 points through five games.[68][69] Courtney Upshaw was named the SEC Defensive Player of the Week after making seven total tackles, with four for losses, a fumble recovery and two pass deflections. Chance Warmack was recognized as the SEC's Offensive Lineman of the Week for his performance.[70] The victory improved Alabama's all-time record against the Gators to 21–14 (22–14 without the NCAA vacation of the 2005 victory).[71], 21315=During the 2009 campaign, the Crimson Tide finished the season undefeated, 14–0, with wins over several ranked opponents that included No. 7 Virginia Tech, No. 20 Ole Miss, No. 22 South Carolina, No. 9 LSU, No. 1 Florida in the SEC Championship, and No. 2 Texas in the BCS National Championship Game.[1] They finished the season as the consensus National Champions, being voted No. 1 in the AP and Coaches' Polls in securing Alabama's first national title since 1992.[2] In addition to the national title, sophomore running back Mark Ingram became the first Alabama player to win the Heisman Trophy.[3], 152842=In the first game played between two teams ranked in the top ten at Donald W. Reynolds Razorback Stadium since the 1979 season, Alabama was victorious with a 24–20 come-from-behind victory.[57] After Ryan Mallett connected on an early touchdown to take a 7–0 lead, Alabama responded with a 54-yard Mark Ingram touchdown run to tie the game at 7–7.[58] Arkansas retook the lead with a field goal and a one-yard Mallett run to take a 17–7 lead at the half.[59] Midway through the third, Arkansas extended their lead to 20–7.[58], 240391=Entering the 2010 season, the Crimson Tide was ranked No. 1 in the AP and Coaches' Preseason Polls.[140][141] The No. 1 preseason ranking was the first for Alabama since the 1978 season.[140] In week six, Alabama dropped to the No. 8 ranking in both the AP and Coaches' Poll following their loss to South Carolina.[142] The Tide rebounded in the rankings though week nine, rising to No. 5 before dropping to No. 11 in the AP and No. 12 in the Coaches' Poll following their loss at LSU.[143] After their loss to Auburn, Alabama dropped to No. 15 in the AP, No. 18 in the Coaches' Poll and No. 16 in the final BCS standings.[144] Following the victory over Michigan State in the Capital One Bowl, Alabama finished No. 10 in the final AP, No. 11 in the final Coaches' Polls.[145], 221772=The minus-48 yards rushing allowed by the Alabama defense was the fewest ever allowed in a bowl game and the second fewest allowed all-time only eclipsed by a minus-49 yard performance against Houston in 1962.[138] With his pair of touchdowns, Mark Ingram established a new Alabama record for career rushing touchdowns with 42 to eclipse the previous mark of 41 set by Shaun Alexander.[138] The contest also marked both Nick Saban's and Bobby Williams' first game against the Spartans since their respective terms as Michigan State's head coach between 1995–1999 and 2000–2002.[22], 213701=With his 10 catch, 199 yard performance, Julio Jones set Alabama single-season records for both receptions and receiving yards in eclipsing the previous marks of 67 receptions by D. J. Hall in 2007 and 1,056 yards by Hall in 2006.[129] The loss ended a 20-game home winning streak for the Tide dating back to the 2007 loss to Louisiana–Monroe, and brought Alabama's all-time record against the Tigers to 40–34–1.[129] The CBS telecast of this game earned a 7.5 rating, the highest for any game of the 2010 college football season through week 13.[130], 147395=The game also marked the return of Marcell Dareus following a two-game suspension from the NCAA for receiving improper benefits.[53] After allowing 13 points in the first half, the Alabama defense shut out the Duke offense in the second half.[51] The 62 points scored by the Tide were the most since a 62–0 victory over Tulane during the 1991 season, and the 45 points scored in the first half were the most scored in one half since scoring 45 in the second half of the 1973 victory over California.[54] The 626 yards of total offense were the most amassed by an Alabama team since gaining 644 against LSU in 1989.[54] The victory improved Alabama's all-time record against the Blue Devils to 3–1.[54], 101682=Alabama also played four non-conference games. The game against Penn State was originally scheduled as part of the 2004 season, however the series was moved back at the request of Alabama due to fallout from NCAA sanctions being levied on the program.[21] The non-conference schedule also included games against San Jose State of the Western Athletic Conference, Duke of the Atlantic Coast Conference and Georgia State of the Football Championship Subdivision (FCS).[18] On December 5, it was announced Alabama would face Big Ten co-champion Michigan State in the Capital One Bowl.[22] In what was the first meeting between the programs, the Tide defeated the Spartans 49–7 and secured their third consecutive ten-win season.[22], 14663=Alabama entered the season as defending national champions, and began the 2010 season as the preseason number one team in both the AP and Coaches' Polls. Favored to win a second consecutive SEC championship and be in contention for the national championship, the Crimson Tide opened the season with five consecutive victories over San Jose State, Penn State, Duke, Arkansas and Florida. However, Alabama completed the regular season with only nine victories and losses to South Carolina, LSU and Auburn and finished fourth in the Western Division. After the regular season, the Crimson Tide accepted an invitation to compete in the Capital One Bowl in Orlando. Against Big Ten co-champions Michigan State, Alabama won by a final score of 49–7 and captured both a third straight ten win season and top ten finish., 104125=Alabama played six of its SEC opponents the week following the opponents' bye week. These SEC teams who scheduled a bye week before facing the Crimson Tide included South Carolina, Ole Miss, Tennessee, LSU, Mississippi State and Auburn. Georgia State also had a bye week prior to playing Alabama, for a total of seven consecutive opponents playing Alabama the week following their bye.[23] On July 1, 2010, the game against Georgia State was moved from Saturday, November 20 to Thursday, November 18 to give Alabama additional time to prepare for its game against Auburn.[24] The Sagarin computer ratings calculated Alabama's 2010 strength of schedule to be the fifth most difficult out of the 245 Division I teams.[25] The Cosgrove Computer Rankings calculated it as the 12th most difficult out of the 120 Division I FBS teams in its rankings.[26], 127311=The Crimson Tide began their defense of their 2010 BCS championship at home against the San Jose State Spartans, and before a record crowd in a newly expanded Bryant–Denny Stadium, Alabama was victorious 48–3.[35] Alabama scored a touchdown on their first possession on a one-yard Trent Richardson run to complete an eight-play, 71-yard drive.[36][37] The Spartans responded on the next drive with their only points of the game on a 31-yard Harrison Waid field goal to make the score 7–3.[36] On the ensuing drive the Alabama extended their lead to 14–3 with a 48-yard Greg McElroy touchdown pass to Marquis Maze.[36] Alabama again reached the endzone early in the second quarter on a 39-yard Richardson run and a 29-yard AJ McCarron pass to Julio Jones to make the score 28–3.[36][37] Cade Foster scored the final points of the half as time expired on a 31-yard field goal to bring the halftime score to 31–3.[36], 26182=By August, Alabama had a combined 21 players on 12 different preseason award watch lists.[12] These included both Mark Barron, Marcell Dareus and Dont’a Hightower for the Chuck Bednarik Award; Julio Jones for the Fred Biletnikoff Award; Hightower and Nico Johnson for the Butkus Award; Ingram for the Walter Camp Award; James Carpenter, Dareus and Hightower for the Lombardi Award; Ingram and Greg McElroy for the Maxwell Award; Barron, Dareus and Hightower for the Bronko Nagurski Trophy; McElroy for the Davey O'Brien Award; Carpenter and Barrett Jones for the Outland Trophy; William Vlachos for the Rimington Trophy; Barron for the Jim Thorpe Award; and Ingram for the Doak Walker Award.[12], 246022=As part of the A-Day celebrations on April 16, the 2010 team captains Greg McElroy, Dont'a Hightower and Mark Barron were honored at the Walk of Fame ceremony at the base of Denny Chimes.[146] Later that day, as recognition for becoming the fifth Alabama head coach to win a national championship with the 2009 squad, the University unveiled a statue of coach Saban along the Walk of Champions outside Bryant–Denny Stadium.[147], 169064=For the game, McElroy set a career high in passing for 315 yards on 27 of 34 passes, and Jones had a team high 118 yards on eight catches.[73] Marcell Dareus was recognized as an honorable mention SEC Defensive Player of the Week for his eight tackle performance.[76] The 34 points allowed by the Crimson Tide defense were the most allowed since giving up 41 to LSU in 2007.[77] The loss also marked the end of a 29-game regular season win streak, an overall 19-game win streak, and an 18-game regular season conference winning streak.[77] It was Alabama's first overall loss since being defeated by Utah in the 2009 Sugar Bowl and their first regular season and regular season conference loss since losing to Auburn in 2007.[77] The loss brought Alabama's all-time record against the Gamecocks to 10–4 (12–3 without NCAA vacations and forfeits).[77], 249115=In the weeks following the SEC Championship Game, multiple Alabama players were recognized for their on-field performances with a variety of awards and recognitions. At the team awards banquet on December 6, Mark Barron, Dont'a Hightower, and Greg McElroy were each named the permanent captains of the 2010 squad.[149] At that time Julio Jones was named the 2010 most valuable players with Dont'a Hightower and Mark Barron named defensive players of the year and Greg McElroy and Mark Ingram named the offensive players of the year.[149], 255041=In the week following the Capitol One Bowl victory, several changes were made to the Alabama coaching staff. Defensive line coach Bo Davis resigned his position to serve as the defensive tackles coach for Texas.[159] The following day, Chris Rumph was hired by Coach Saban from Clemson to replace Davis as defensive line coach.[160] On January 12, assistant head coach and offensive line coach Joe Pendry announced his retirement.[161] The following day, former Miami interim head coach Jeff Stoutland was hired to replace Pendry as offensive line coach.[162] On January 21, wide receivers coach and recruiting coordinator Curt Cignetti resigned his position to accept the head coaching job at Indiana University of Pennsylvania.[163] On February 7, Mike Groh was hired a Cignetti's replacement as wide receivers coach and recruiting coordinator.[164], 23415=In February 2010, eighteen players each signed an individual National Letter of Intent to play college football at Alabama.[4] The 2010 recruiting class was ranked nationally in the top five by several recruiting services including Rivals, Scout, ESPNU and CBS College Sports.[5][6][7] Spring practice began on March 12 and concluded with the annual A-Day game on April 17.[8] Televised live by ESPN, the Crimson team of offensive starters defeated the White team of defensive starters by a final score of 23–17 before 91,312 fans in Bryant–Denny Stadium.[9][10] The game was decided after the end of regulation when Brandon Gibson caught a 39-yard touchdown pass from AJ McCarron in sudden death.[10] For their performances, Marcell Dareus earned the Dwight Stephenson Lineman of the A-Day Game Award and Mark Ingram earned the Dixie Howell Memorial Most Valuable Player of the A-Day Game Award.[11], 154118=Alabama brought the score to 20–14 late in the third after a 20-yard Trent Richardson touchdown reception from Greg McElroy.[60] The Arkansas lead was then cut to three after a 36-yard Jeremy Shelley field goal with just over 6:00 remaining in the fourth.[60] After Robert Lester intercepted a Mallett pass and returned it to the 12-yard line, Ingram took the next three snaps that culminated in a one-yard touchdown run to take a 24–20 lead.[58] After a late Dre Kirkpatrick interception, McElroy gained a first down on a fourth and inches quarterback sneak to seal the victory for the Crimson Tide.[56] Ingram led the team with 157 yards rushing on 24 carries and Richardson finished with 85 yards on eight carries.[56] Kirkpatrick led the defense with nine tackles and an interception.[56] For his five-tackle, two-interception performance, Robert Lester was recognized as both the FWAA/Bronko Nagurski National Defensive Player of the Week and the SEC Defensive Player of the Week.[61] The victory improved Alabama's all-time record against the Razorbacks to 11–8 (14–7 without NCAA vacations and forfeits).[62], 140028=Richardson led the team in rushing with 144 yards on 22 carries, and was also the first back to gain over 100 yards on the ground against Penn State since their 2008 game against Iowa.[45][46] The defense also stood out with Mark Barron, Robert Lester and Will Lowery each making an interception and Alabama only allowing 283 yards of total offense.[45] After compiling 207 all-purpose yards and scoring a touchdown, Richardson was named Co-SEC Offensive Player of the Week with South Carolina's Marcus Lattimore.[47] The victory improved Alabama's all-time record against the Nittany Lions to 9–5.[46], 219741=After holding Michigan State to a three-and-out to open the third quarter, Alabama scored its fifth touchdown in six offensive possessions when Marquis Maze scored on a 37-yard Greg McElroy pass.[135] Up by 35 points late in the third, the Crimson Tide pulled many of their starters that resulted in many players seeing action from deep in the depth chart.[136] Eddie Lacy extended the lead to 49–0 with touchdown runs of twelve-yards in the third and 62-yards in the fourth quarter.[135] Michigan State scored their only points late in the fourth on a 49-yard Bennie Fowler touchdown reception from Keith Nichol to make the final score 49–7.[135] The 42-point margin of victory was Alabama's largest in a bowl game since defeating Syracuse 61–6 in the 1953 Orange Bowl.[137][138], 145216=In Alabama's first-ever trip to Duke, the Crimson Tide defeated the Blue Devils by a final score of 62–13 in front of the largest crowd at Wallace Wade Stadium since the 1994 season.[50] Playing in his first game of the 2010 season following knee surgery, Mark Ingram ran for a team high 152 yards on nine carries with two touchdowns.[51], 217735=On December 5, Capital One Bowl officials announced Alabama would face the Big Ten co-champion Michigan State Spartans in the 2011 Capital One Bowl.[22] In a strong defensive performance where the Spartans were held to a total of minus-48 yards rushing, Alabama was victorious 49–7.[133][134] Alabama scored touchdowns on their first four offensive possessions. Mark Ingram scored first on an one-yard touchdown run to complete a 13-play, 79-yard drive on Alabama's first possession.[135] After a Robert Lester interception of a Kirk Cousins pass on the Spartans' opening drive, the Tide scored on an eight-yard Trent Richardson touchdown run.[135] Alabama extended their lead to 28–0 at the half following touchdown runs of six and 35-yards by Ingram and Julio Jones.[135], 37080=Alabama's recruiting class was highlighted by eight players from the \"ESPN 150\": No. 16 DeMarcus Milliner (CB); No. 32 Phillip Sims (QB); No. 36 John Fulton (CB); No. 54 Adrian Hubbard (DE); No. 74 Chad Lindsay (OG); No. 89 Keiwone Malone (WR); No. 99 C.J. Mosley (OLB); and No. 132 Brian Vogler (TE).[17] Alabama signed the No. 5 recruiting class according to Rivals and the No. 4 recruiting class according to Scout.[6][7] The football program received 18 letters of intent on National Signing Day, February 3, 2010.[4]}",
    "lastModified": "Thu, 30 Jul 2015 02:38:40 GMT",
    "textBeforeTable": "2010 San Jose State Spartans football team San Jose State[edit] Game notes[edit] See also: Reference:[32] LSU (2001) 4 Strength and Conditioning Scott Cochran Purdue (1982) 3 Tight Ends, Special Teams Bobby Williams Pittsburgh (1982) 2 Assistant Head Coach, Linebackers Sal Sunseri Georgia (1999) 4 Defensive Coordinator, Linebackers Kirby Smart West Alabama (1999) 1 Secondary Jeremy Pruitt West Virginia (1969) 4 Assistant Head Coach, Offensive Line Joe Pendry Eastern Washington (1984) 3 Offensive Coordinator, Quarterbacks Jim McElwain LSU (1993) 4 Defensive Line Bo Davis",
    "textAfterTable": "Location: Tuscaloosa, Alabama Game start: 6:08 p.m. Elapsed time: 2:50 Game attendance: 101,821 Game weather: 81 °F, Sunny Referee: Penn Wagers TV announcers (CTSN): Chris Stewart (play-by-play), Tyler Watts (color), Barry Krauss (sideline) Sources:[33][34] The Crimson Tide began their defense of their 2010 BCS championship at home against the San Jose State Spartans, and before a record crowd in a newly expanded Bryant–Denny Stadium, Alabama was victorious 48–3.[35] Alabama scored a touchdown on their first possession on a one-yard Trent Richardson run to complete an eight-play, 71-yard drive.[36][37] The Spartans responded on the next drive with their only points of the game on a 31-yard Harrison Waid field goal to make the score 7–3.[36] On the ensuing drive the Alabama extended their lead to 14–3 with a 48-yard Greg McElroy touchdown pass to Marquis Maze.[36] Alabama again reached the endzone early in the second quarter on a 39-yard Richardson run and a 29-yard AJ McCarron pass to Julio Jones to make the score 28–3.[36][37] Cade Foster scored the final points of the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}