{
    "relation": [
        [
            "Patent application number",
            "20120212337",
            "20120215551",
            "20120215557",
            "20120215558",
            "20120215559",
            "20120245926",
            "20130297347",
            "20130297348",
            "20140288974",
            "20140297278"
        ],
        [
            "Description",
            "METHODS AND APPARATUS FOR FORMATTING TEXT FOR CLINICAL FACT EXTRACTION - An original text that is a representation of a narration of a patient encounter provided by a clinician may be received and re-formatted to produce a formatted text. One or more clinical facts may be extracted from the formatted text. A first fact of the clinical facts may be extracted from a first portion of the formatted text, and the first portion of the formatted text may be a formatted version of a first portion of the original text. A linkage may be maintained between the first fact and the first portion of the original text.",
            "METHODS AND APPARATUS FOR IDENTIFYING UNSPECIFIED DIAGNOSES IN CLINICAL DOCUMENTATION - A set of one or more clinical facts may be collected from a clinician's encounter with a patient. It may be determined that an unspecified diagnosis not included in the set of facts may possibly be ascertained from the patient encounter. A user may be alerted that the unspecified diagnosis may possibly be ascertained from the patient encounter.",
            "METHODS AND APPARATUS FOR UPDATING TEXT IN CLINICAL DOCUMENTATION - Based on a free-form narration of a patient encounter provided by a clinician, it may be determined that one or more clinical facts could possibly be ascertained from the patient encounter. One or more options corresponding to the one or more clinical facts may be provided to a user. A selection of a first option of the one or more options may be received from the user. The first option may correspond to a first fact of the one or more clinical facts. A textual representation of the free-form narration may be updated to identify the first fact as having been ascertained from the patient encounter.",
            "METHODS AND APPARATUS FOR ANALYZING SPECIFICITY IN CLINICAL DOCUMENTATION - A set of one or more clinical facts may be collected from a clinician's encounter with a patient. From the set of facts, it may be determined that an additional fact that provides additional specificity to the set of facts may possibly be ascertained from the patient encounter. A user may be alerted that the additional fact may possibly be ascertained from the patient encounter.",
            "METHODS AND APPARATUS FOR LINKING EXTRACTED CLINICAL FACTS TO TEXT - A plurality of clinical facts may be extracted from a free-form narration of a patient encounter provided by a clinician. The plurality of clinical facts may include a first fact and a second fact. The first fact may be extracted from a first portion of the free-form narration, and the second fact may be extracted from a second portion of the free-form narration. A first indicator that indicates a first linkage between the first fact and the first portion of the free-form narration may be provided to a user. A second indicator, different from the first indicator, that indicates a second linkage between the second fact and the second portion of the free-form narration may also be provided to the user.",
            "METHODS AND APPARATUS FOR FORMATTING TEXT FOR CLINICAL FACT EXTRACTION - An original text that is a representation of a narration of a patient encounter provided by a clinician may be received and re-formatted to produce a formatted text. One or more clinical facts may be extracted from the formatted text. A first fact of the clinical facts may be extracted from a first portion of the formatted text, and the first portion of the formatted text may be a formatted version of a first portion of the original text. A linkage may be maintained between the first fact and the first portion of the original text.",
            "PHYSICIAN AND CLINICAL DOCUMENTATION SPECIALIST WORKFLOW INTEGRATION - A medical documentation system and a CDI system may be linked together, or integrated, so there is a tie between the two systems that allows for a much more efficient and effective CDI process. In one disclosed embodiment, a medical documentation system transmits to a CDI system a structured data set including at least some information relating to one or more medical facts the medical documentation system automatically extracted from text documenting a patient encounter.",
            "PHYSICIAN AND CLINICAL DOCUMENTATION SPECIALIST WORKFLOW INTEGRATION - A medical documentation system and a CDI system may be linked together, or integrated, so there is a tie between the two systems that allows for a much more efficient and effective CDI process. In one disclosed embodiment, a CDI system receives from a medical documentation system a structured data set including at least some information relating to one or more medical facts the medical documentation system automatically extracted from text documenting a patient encounter.",
            "METHODS AND APPARATUS FOR ANALYZING SPECIFICITY IN CLINICAL DOCUMENTATION - A set of one or more clinical facts may be collected from a clinician's encounter with a patient. From the set of facts, it may be determined that an additional fact that provides additional specificity to the set of facts may possibly be ascertained from the patient encounter. A user may be alerted that the additional fact may possibly be ascertained from the patient encounter.",
            "METHODS AND APPARATUS FOR LINKING EXTRACTED CLINICAL FACTS TO TEXT - A plurality of clinical facts may be extracted from a free-form narration of a patient encounter provided by a clinician. The plurality of clinical facts may include a first fact and a second fact. The first fact may be extracted from a first portion of the free-form narration, and the second fact may be extracted from a second portion of the free-form narration. A first indicator that indicates a first linkage between the first fact and the first portion of the free-form narration may be provided to a user. A second indicator, different from the first indicator, that indicates a second linkage between the second fact and the second portion of the free-form narration may also be provided to the user."
        ],
        [
            "Published",
            "08-23-2012",
            "08-23-2012",
            "08-23-2012",
            "08-23-2012",
            "08-23-2012",
            "09-27-2012",
            "11-07-2013",
            "11-07-2013",
            "09-25-2014",
            "10-02-2014"
        ]
    ],
    "pageTitle": "Flanagan, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/flanagan-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435949259,
    "recordOffset": 435911758,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "James R. Flanagan, Iowa City, IA US 06-02-2011 HUB AND BRAKE ASSEMBLY - A wheel hub assembly configured to receive and support a brake rotor component in either a fixed or floating arrangement, such that a wheel assembly mounted to the wheel hub abuts directly against the outboard flange of the hub, and not against an entrapped brake rotor surface. 20110127826 Published Description Patent application number James P. Flanagan, Clinton, OH US //]]> BarDraw('3392289',['Patent applications by James Michael Flanagan, Rochester, MN US'],[[5,5,1]],['2007','2008','2009'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3392289\" align=\"center\"></div> </div> <canvas id=\"bg3392289\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by James Michael Flanagan, Rochester, MN US</p> <div class=\"bar3392289\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>06-18-2009</td> <td><a href=\"/patents/app/20090157742\">On Demand Capture of Database Application Environmental Resources</a> - A method and apparatus for tracking a plurality of database resource consumers is provided. A request is received from a job for a database resource of a plurality of resources. Based on the request, a database resource allocation amount for the job is updated. The database resource allocation amount specifies an amount of the database resource allocated to the job. It is determined whether the job is a primary consumer for the resource. A primary consumer is defined according to a consumption of the database resource relative to other database resource consumers. The determining is based on the database resource amount allocated",
    "textAfterTable": "Patent applications by James R. Flanagan, Iowa City, IA US James Scott Flanagan, Simpsonville, SC US Patent application number Description Published 20120304653 LOAD MEMBER FOR TRANSITION DUCT IN TURBINE SYSTEM - A loading assembly for a turbine system is disclosed. The loading assembly includes a transition duct and a load member. The transition duct extends between a fuel nozzle and a turbine section, and has an inlet, an outlet, and a passage extending between the inlet and the outlet and defining a longitudinal axis, a radial axis, and a tangential axis. The outlet of the transition duct is offset from the inlet along the longitudinal axis and the tangential axis. The load member extends from the transition duct and is configured to transfer a load between the transition duct and an adjacent transition duct along at least one of the longitudinal axis, the radial axis, or the tangential axis. 12-06-2012 20120304665 MOUNT DEVICE FOR TRANSITION DUCT IN TURBINE SYSTEM - A mount device and mounting assembly for a turbine system are disclosed. The mounting assembly includes a transition duct extending between a fuel nozzle and a turbine section. The transition duct has an inlet, an",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}