{
    "relation": [
        [
            "",
            "• #5 Texas",
            "#1 Oklahoma"
        ],
        [
            "1",
            "3",
            "7"
        ],
        [
            "2",
            "17",
            "14"
        ],
        [
            "3",
            "10",
            "7"
        ],
        [
            "4",
            "15",
            "7"
        ],
        [
            "Total",
            "45",
            "35"
        ]
    ],
    "pageTitle": "2008 Oklahoma Sooners football team - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/2008_Oklahoma_Sooners_football_team",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878955131,
    "recordOffset": 878906618,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18519=Following the season, Phil Loadholt was selected in the 2nd round of the 2009 NFL Draft, Juaquin Iglesias was drafted in the 3rd, Nic Harris and Duke Robinson were chosen in the 5th, and Manuel Johnson in the 7th., 17246=Conference play began with a win over the Baylor Bears in Waco, Texas on October 4, and ended with a win over the Missouri Tigers in the Big 12 Championship Game on December 9. The Sooners finished the regular season with a 12-1 record (7-1 in Big 12) while winning their sixth Big 12 title and their 42nd conference title overall. They were invited to the BCS National Championship Game, where they lost to the Florida Gators, 14-24. Oklahoma scored 716 points during the course of their entire season, setting an NCAA Division I record (later broken by Florida State in 2013) for most points scored in a single season., 145308=Tech attempted an onside kick to start off the second half, though the Sooners grabbed the ball at the Tech 34. OU ended the next drive on a 33–yard field goal. Tech fumbled on their next possession, and Oklahoma's Keenan Clayton recovered the fumble and returned it 53 yards to the Tech 3. The Sooners added another seven points to extend their lead to 45. Tech cranked up its passing game on its next possession, eventually scoring a touchdown and extra point with 5:39 remaining in the third quarter. On the subsequent drive, the Red Raider defense forced their first sack on QB Sam Bradford, and also forced the Sooners to punt. The Sooner defense countered in the next drive by forcing a three-and-out. The Sooner offense then added another score on a 66-yard reception by Manuel Johnson. The Tech defense blocked the extra point, and the score remained at 58–14., 141210=The Red Raiders opened the game with a kickoff return to their 32-yard line. The Sooners forced a punt, and fielded their offense at their 27. The Sooners scored a touchdown with 8:59 left in the first. DeMarco Murray contributed 48 rushing yards in the drive. Tech returned the ensuing kickoff to their 22, and a Sooner personal foul after the return gave the Red Raiders 15 yards. Texas Tech lost 10 of those yards due to a delay of game and a false start. Starting at their 27, the Red Raiders were stopped at the Oklahoma 48, where they punted again. The Sooners got the ball on their 20. On the second play of the drive, Oklahoma was punished again with a 15–yard penalty. After three failed attempts to pass the ball for a first down, the Sooners elected to make their first punt. On the next Tech possession, Graham Harrell was sacked on two consecutive plays, once by Adrian Taylor and the other by Gerald McCoy. Coming into the game, the Red Raiders ranked second in the nation in sacks allowed, with only 5.[19] The Sooners ended the first quarter with a 42-yard reception by tight end Jermaine Gresham and two rushes by Chris Brown for a combined 12 yards.[20], 189027=The 2009 NFL Draft was held on April 25–26, 2009 at Radio City Music Hall in New York City. The following Oklahoma players were either selected or signed as undrafted free agents following the draft., 16126=The 2008 Oklahoma Sooners football team represented the University of Oklahoma in the 2008 NCAA Division I-FBS football season, the 114th season of Sooner football. The team was led by two-time Walter Camp Coach of the Year Award winner, Bob Stoops, in his 10th season as head coach. They played their homes games at Gaylord Family Oklahoma Memorial Stadium in Norman, Oklahoma. They were a charter member of the Big 12 Conference, 128092=The Sooners scored three touchdowns in the first ten minutes, then never looked back as Sam Bradford passed for four scores to four different receivers and punched one across himself. Chris Brown added three more touchdowns. Aside from the impressive 261 kickoff return yards amassed by Texas A&M running back Cyrus Gray, including a 98-yard return for a touchdown, the hometown Aggie fans had little to cheer about as the Sooners outrushed the Aggies 328–26, and outpassed them 325–252. The Sooner defense frustrated A&M quarterback Jerrod Johnson, sacking him four times and intercepting two of his passes. The win set up a Big 12 showdown against undefeated Texas Tech on November 22, after a bye week., 112135=This game marked the 103rd meeting of the Red River Rivalry, which has been called one of the greatest sports rivalries.[11] It's the longest active rivalry for the Longhorns,[12] and the second longest for the Sooners, behind only the Bedlam Series. Since 1929, the game has been held at the Cotton Bowl in Dallas, Texas, typically in mid-October with the State Fair of Texas occurring adjacent to the stadium.[13], 140201=Texas Tech and Oklahoma first played in 1992.[15] Coming into the game, the Sooners led the series 11-4, though the Red Raiders had won 2 of the last 3, with the last loss coming in Norman in 2006. The only road game Tech had won in the series was during the inaugural season of the Big 12 in 1996.[16] Under head coach Bob Stoops, the Sooners had lost only two games at home.[17] The Sooners were 7-point favorites.[18], 161340=On November 29, 2008, #11 Oklahoma State came into the 103rd Bedlam game ranked the highest they had been coming into the game since the 1984 matchup when they came in at #3, while #3 Oklahoma came in ranked the highest they had been coming into the game since the 2004 game just four years earlier, when they were #2. OSU was trying desperately to break their 5-year Bedlam losing streak and keep one of their best seasons in decades going, while OU was trying to make it into the Big 12 Championship Game, and then possibly the BCS National Championship Game., 166114=Oklahoma QB Sam Bradford went 30–44, his second most completions and attempts of his career, but his two TDs tied for his least of the season, and his passer rating of 148.7 was his second worst of the season.[28] Tight end Jermaine Gresham's nine receptions and 158 yards were the most of his career, his two TDs were tied for the second most of his career, and his 71-yard reception was the longest of his career.[29] The combined score of 102 points is the most points ever scored in a Bedlam game. OSU's 41 points were the most they scored in a Bedlam game since the 1998 matchup when they beat Oklahoma, 41–26. This marked the Sooners' 80th win in the Bedlam Series, which was five times as many as Oklahoma State had at the time., 142887=Once the second quarter began, both Brown and Gresham moved the ball for a touchdown on three different plays. Tech started their next drive at their own 38 and advanced the ball through the air to eventually get to the Oklahoma 15. Two incompletions caused the Red Raiders to face a 4th and 3. Tech decided to go for it. Running back Shannon Woods was unable to catch a pass by Harrell to convert and Tech turned the ball over on downs. Murray rushed the ball for 23 yards on Oklahoma's first play of the drive. Murray followed with a 31–yard reception, which put the ball on the Tech 30. After two rushes by Brown, Gresham scored a touchdown on a 19-yard catch, and the subsequent extra point extended the Sooners lead to 21–0. Oklahoma's defense forced Tech to four plays on the next drive, with the fourth play being a 4th-and-4, Tech's second 4th down conversion attempt. With 9:31 remaining, Oklahoma completed a scoring drive of under two minutes, which was capped by Juaquin Iglesias' 28–yard scoring reception. On the following possession, the Red Raiders reached the end zone, thanks to Harrell's 25–yard throw to Tramain Swindall. Matt Williams' extra point brought the score to 28–7. With 6:28 left in the half, Oklahoma began to drain the clock using their running game. The Sooners eventually scored on the 12th play of the drive. With just a minute left on the clock, Tech got the ball back. On the second play, Harrell was intercepted by Travis Lewis, who returned the ball 47 yards. Tech offensive guard Brandon Carter, who stopped Lewis at the Tech 1, received a personal foul. Murray scored on a 1–yard rush to increase the Sooners' lead to 35 points. Tech got the ball again after the Sooner touchdown with 18 seconds remaining in the half. Harrell threw a shovel pass to Baron Batch, who ran 21 yards to the Tech 28. The half ended with Tech receiving a 15–yard personal foul. The Red Raiders left the field facing their biggest deficit of the season (35 points).[21], 146435=In the fourth quarter, Tech failed to convert another fourth down, giving the ball back to OU. Oklahoma scored immediately afterwards, improving their lead to 51 points. On the next possession, Tech was able to make three pass completions of 10+ yards, though on the final play of the drive, Harrell lost the ball to the Sooners on a sack. With 10:50 left in the game, the Sooners started to run out the clock. The Red Raiders stopped them from scoring on a 4th down from the 1. Tech got the ball back with 4:48 on the clock. After a few plays, Tech faced another 4th down, and this time was able to convert it with a 13–yard throw to Michael Crabtree. Tech later scored their third touchdown with 11 seconds left, and Williams tacked on the extra point to change the score to 65–21. Tech attempted an onside kick and recovered the ball. The final play was a short-yard catch by Woods.[22], 23862=On March 6, 2008, 4-star wide receiver Joshua Jarboe, who was deemed to be one of the recruits who could start playing immediately in the fall,[1] was arrested for receiving stolen property and possessing a weapon at his DeKalb County high school. Jarboe could have faced expulsion under school policy for these felony charges, but did not. Already on thin ice for the weapons possession, he was kicked off the team in June for making a violent rap video on YouTube that described him carrying and using a gun.[2][3], 104638=TCU had beaten Oklahoma the last two times they had met, the most recent being in 2005, where a #7 ranked Oklahoma was upset by an unranked TCU in the season opener, 10–17.}",
    "lastModified": "Thu, 30 Jul 2015 02:38:40 GMT",
    "textBeforeTable": "Chattanooga Mocs at #4 Oklahoma Sooners First Meeting Result Last meeting Overall record Chattanooga Mocs football Chattanooga[edit] Game notes[edit] See also: 4 Defensive Ends Chris Wilson 10 Defensive Line Jackie Shipp 3 Offensive Line James Patton 5 Quarterbacks Josh Heupel 10 Recruiting Coordinator Running Backs Cale Gundy 1 Asst. Offensive Coord. Wide Receivers Jay Norvell 7 Offensive Coordinator Tight Ends/Fullbacks Kevin Wilson 10 Assistant Head Coach Co-Defensive Coordinator Defensive Backs Bobby Jack Wright 10 Associate Head Coach Defensive Coordinator Linebackers Brent Venables 10 Head Coach Bob Stoops Years at OU Position Name Bob Stoops , head coach of Oklahoma.",
    "textAfterTable": "Date: August 30 Location: Gaylord Family Oklahoma Memorial Stadium, Norman, OK Game start: 6:10 PM CST Elapsed time: 4:09 Game attendance: 84,715 Game weather: 91 °F (33 °C) • Wind: SE 12 mph • Weather: Partly Cloudy Referee: Rick Loumiet TV announcers (FSN PPV): Tim Brando (Play-by-play), Spencer Tillman (Color) & Emily Jones (Sideline) Quarterback Sam Bradford returned for his sophomore year. Oklahoma came into the season ranked #4 in both the Coaches' and AP Poll. In the first game between Chattanooga and Oklahoma, Sam Bradford threw for 183 yards and two touchdowns, and RB Chris Brown ran for three scores. Only an hour-long rainstorm could slow down the Sooners in a 57–2 victory against Chattanooga. The Sooners converted their first seven possessions into touchdowns and led 50–0 before a thunderstorm caused a lightning delay that extended halftime by 1 hour and 12 minutes. UTC, which would go on to earn only one win in the entire season, scored only 2 points on a safety from an errant snap on a punt play. Chattanooga was held",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}