{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "In three sentences"
        ],
        [
            "Comments",
            "I enjoy drawing and going fishing in the summer.",
            "The college is very close to my home and my job. I am hoping with my grades I can attend with some assistance from the college. I plan to come here for my first two years then transfer to bowling green."
        ]
    ],
    "pageTitle": "Lorain County Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Lorain-County-Community-College/reviews?_escaped_fragment_=/show/24763",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911434075,
    "recordOffset": 911397027,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129851=© 2015, Cappex.com, LLC, 9462=LCCC does not provide dorms for its students because it is a local college. However there are two apartment complexes, Commodore Arms Apartments and College Park Townhouses, that are located directly across the street from the college. They offer a variety of features, including Internet, washer and dryer, patios, air conditioning, and much more. They also offer a $1000 dollar scholarship for LCCC! They are close to shopping centers and major highways, making them ideal spots to live if you do not or cannot live at home., 17569=For a community college that costs about 1500 a semester it's decent. Especially if you are looking for a place to get your foot in the door. I'm sure plenty of other students had wonderful experiences, I ,unfortunately, did not., 51477=It is rather affordable to go to this school, about 1500 a semester. Plus books, but if you work and live at home it is a nice price. They have a few scholarships and FAFSA normally provides a decent amount of money, i honestly got paid to go to school at one point. I had extra financial aid and got a check for about 500 dollars.}",
    "textBeforeTable": "10/06/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 29 Jessica from Avon Lake, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Bang for the buck For the most part, I would say it's decently priced considering that it's a community school. Am enjoying being here I don't like being there for my own personal reasons, but it's a different experience for everyone. Am learning a lot I think most of the professors are extremely intelligent and know what they are talking about. I've liked all of my professors so far and I've taken a lot of classes. Even your teachers online have a number of helpful tools to get you through the course. Login to rate or flag the reviews Mariah from Lorain, OH 03/22/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 29 Categories Comments Campus Safety Lorain County Community College offers a 24 hour security service that can be accessed",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}