{
    "relation": [
        [
            "Track Name",
            "Problem Areas",
            "Father Sister Berzerker"
        ],
        [
            "Artist",
            "Oneohtrix Point Never",
            "Tobacco"
        ],
        [
            "Album",
            "R Plus Seven",
            "Ultima II Massage"
        ]
    ],
    "pageTitle": "Why Not? With Brett and Ryan | KVRX",
    "title": "",
    "url": "http://www.kvrx.org/schedule/programs/8356",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 541161071,
    "recordOffset": 541137656,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16202=Brett and Ryan return for 2015 with more or less the same thing they've been doing for the last year. Wild!}",
    "textBeforeTable": "Brett and Ryan close out the year basically talking about the same things they always do. Bang! EPISODE 35: THE FINAL WHY 2: ELECTRIC BOOGALOO May 9, 2015 Show Shows Brett and Ryan are two idiots who joked about getting a talkshow on KVRX and took it so far they actually went and got one. Listen in as they pull random topics from a hat and discuss them with a variety of callers and guests. Next show: July 30, 2015 Saturdays at 5:07 PM Why Not? With Brett and Ryan Brett Johnson Ryan McDearmont Hosts // ]]> --> OA_show('OpenX - Button B2'); OA_show('OpenX - Button B1'); OA_show('OpenX - Bottom Rectangle'); OA_show('OpenX - Button A2');",
    "textAfterTable": "May 2, 2015 Show EPISODE 34: NO REST FOR FREDDY A fourth Five Nights At Freddy's? Wow. Brett and Ryan discuss this as well as Free Comic Book Day. They also extensively cover Foodfight! and Wikipedia's list of films considered the worst. Great! Track Name Artist Album Over U Vektroid Neo Cali Let's Make This A Moment To Remember Chromatics Night Drive April 25, 2015 Show EPISODE 33: THE WORST THING EVER What's the worst thing you've ever seen? Trick question. The answer is Jared Leto as The Joker. Disgusting! Track Name Artist Album Title Disasterpeace It Follows Detroit Disasterpeace It Follows April 18, 2015 Show EPISODE 32: ATTACK OF THE TRAILERS Brett and Ryan launch the night's discussion with conversation on the new trailers for 'Star Wars: The Force Awakens' and 'Batman v. Superman: Dawn of Justice'. Hype! Track Name Artist Album Six Royal Vipers Tobacco Maniac Meat Eggs At Night Damaged Bug Hubba Bubba",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}