{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "The University of Washington is great for any type of student planing to study anything. The University of Washington offers many different undergraduate programs. Our undergraduate programs rank high compared to other public universities in the country. Our graduate programs also rank high including our business school, med school, and law school. We also have many clubs and activities offered. Because of this, UW is great for any student.",
            "In high school focus on getting a high gpa preferably a 3.7 or higher. Also participate in extra curricular activities and get high sat or act test scores. Take challenging classes too. If you high school offers ap or ib classes take as many as you can because colleges like to see that applicants are challenging themselves and they do look at the classes you take in high school.",
            "As far as tuition goes, it is pretty affordable for in-state students. Tuition for one year is $8,973. Out of state tuition is $25,601 a year. Room and board is around $8,169 a year. Books and supplies are around $1,008 a year. Food at the dorms is slightly overpriced. You are to choose a meal plan for the quarter and an average meal at one of the dining halls costs about 8 dollars. On the silver meal plan which is the one I picked, I found out that I could only spend around 12 dollars a day on food and I quickly ran out of dining hall money and had to add more. An alternative to the dining halls would be to eat out on the ave. The ave is a large strip of restaurants that are cheep and cater to college students budgets. Overall, tuition is affordable for in-state students and like any public university is more expensive for out of state students. The food is overpriced, but everything else is affordable.",
            "I enjoy being here. The campus is large and there are a lot of different activities offered to people with different interests. The intramural activities building called the IMA is one of the nicest workout facilities I have been to. There are basketball courts, swimming pools, weights, volleyball, and much more. There are also places for people to gather and play video games like at Ian's domain in McCarty hall. Sporting events like basketball and football games are always fun to attend and have great student turnout and attendance. We also have a large greek row and every house has a lot of different social activities going on. There are activities for everyone here and I enjoy everything that this campus has to offer.",
            "The courses that I have taken so far here have been challenging. They challenge you to think and formulate ideas beyond what textbooks tell you. Also, since the university operates on a quarter system, there is less time to learn all the material that is thrown at you so it is necessary to stay on top of the material. I have learned a lot in my time spent here through the challenges presented."
        ]
    ],
    "pageTitle": "University of Washington-Seattle Campus (UW) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Washington-Seattle-Campus/reviews?_escaped_fragment_=/show/19312",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896850543,
    "recordOffset": 896642989,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{751857=Get involved! There are so many things to do: clubs, recreational sports, sporting events (division 1 HUSKIES!), etc. Sign up for your A&O sessions (advising and orientation) early! The early the date, the chances of getting a better class schedule will greatly increase, especially since the freshman class size should range from 2000 to 3000., 17299=Tuition is going up this fall of 2009, and up again in 2010. Times are tight, so there's a definite sense that the increase in tuition coupled with the decrease in professors is a bit of a jip for the students., 667167=I have never felt safer anywhere. Last quarter I had classes until 9:30 at night and had to walk back to my sorority by myself and I felt very safe. There is also a night-ride you can call to drive or walk you from place to place during the night., 637573=I am a 38 year old student and do not live in the dorms. Off campus housing can be more affordable than dorms, depending on what you consider affordable and reasonable. I live in a comfortable, though not luxurious, house. I have three other housemates. We can easily bus, walk and drive to UW, the Avenue, and the grocery stores in the area. Housing moves very fast in July and August so if you found a place you like, or potential housemates, secure it as quickly as possible., 481921=There is a large greek system at UW Seattle. There are thirty three fraternities and seventeen sororities, and we have been adding chapters each year for the past few years. All freshman new members in a chapter live in starting in September when school starts and both sororities and fraternities can be, and usually are cheeper than living in a dorm and having a dining account. The greek system houses are all located across the street from campus in a four block area, and there are about two thousand people in our system which can attest to its strength and offerings., 1083231=The wide range of dorm buildings allows students to live in quite a few locations on campus. There are dorms built in 2012 and others that dated back a century. There is even a new dorm being constructed right now for move in during the second quarter of this school year. The amenities available in the assortment of living choices will satisfy all personality types. This atmosphere promotes new friendships and the potential to find lifetime relationships., 818402=The activity center will be opening for 2012-13 academic year. There are plenty of clubs to join but you are also only a bus ride away from downtown Seattle which has a great night life.}",
    "textBeforeTable": "07/11/2009 Reviewer is A current student here. 84 out of 87 people found this review useful. 1 of 259 Madeline from Seattle, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Login to rate or flag the reviews Laura from Seattle, WA 01/29/2010 Reviewer is A current student here. 69 out of 72 people found this review useful. 2 of 259 Categories Comments Great for these types of students The University of Washington is great for students with independent personalities, and for those, with perseverance, who want to become more independent in their academic and personal lives. This school does not hand-hold you by any means. You are responsible for figuring out how to get that extra financial aid, what classes to register for, and how to manage your schedule. Granted, there are many knowledgeable outlets for help and guidance (Mary Gates Undergraduate Advising, Departmental Advisers, Husky Mentors program to name a few), but an education at this school mainly consists of you alone actively pursuing your goals. This definitely fosters good leadership skills. Tips for prospective students Due to economic pressures this year, the state budget for our school's funding has unfortunately dropped and many of this year's students are planning more for our financial future at this school (my",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}