{
    "relation": [
        [
            "Patent application number",
            "20090080089",
            "20100060992"
        ],
        [
            "Description",
            "Wide-Angle Lens - A wide-angle lens whose angle of view is more than 90 degrees and less than 120 degrees includes, in order from an object side thereof: a first lens having a negative power and including a spherical glass body; a second lens having a positive power and including an aspheric surface; and a third lens having a positive power and including an aspheric surface.",
            "Super Wide-Angle Lens - A small-sized super wide-angle lens for a solid-state image sensor that is suitable for a digital input apparatus such as a monitoring camera and an onboard camera, which is excellent in terms of optical performance and is low in terms of cost. The super wide-angle lens includes, in order from an object side thereof: a first lens with a negative refractive power; a second lens with a negative refractive power; a third lens with a positive refractive power; and a fourth lens with a positive refractive power. The first lens is a meniscus lens including a convex surface facing the object side. Each of the second lens and the fourth lens includes at lest one rotational-asymmetric surface."
        ],
        [
            "Published",
            "03-26-2009",
            "03-11-2010"
        ]
    ],
    "pageTitle": "Hirose, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hirose-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452369603,
    "recordOffset": 452338829,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masatoshi Hirose, Tokyo JP 03-13-2014 KVM SWITCH AND KVM SYSTEM - A KVM (K: Keyboard, V: Video, M: Mouse) switch includes: a plurality of first ports each of which is connected to at least one of a computer and another KVM switch, the another KVM switch having a plurality of third ports connectable to a computer; a second port; a connection unit that selects a first port from the plurality of first ports, and connects the selected first port to the second port; and a control unit that transmits a control signal to the another KVM switch via the selected first port when the first port connected to the computer is connected to the second port, the control signal being a signal for selecting a third port to be connected to the second port from the third ports. 20140075062 Published Description Patent application number Masato Hirose, Tokyo JP //]]> BarDraw('3610936',['Patent applications by Masaru Hirose, Tokyo JP'],[[1,2,1]],['2005','2008','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3610936\" align=\"center\"></div> </div> <canvas id=\"bg3610936\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Masaru Hirose, Tokyo JP</p> <div class=\"bar3610936\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-03-2013</td> <td><a href=\"/patents/app/20130000103\">METHOD OF MANUFACTURING MAGNETORESISTIVE ELEMENT</a> - The method according to the present invention includes the steps of: sequentially applying a plurality of different voltages to an MR element and sequentially detecting output signals from the MR element; and eliminating",
    "textAfterTable": "Masayuki Hirose, Tokyo JP Patent application number Description Published 20090139333 Ultrasonic Probing Method and Apparatus Therefor Utilizing Resonance Phenomenon - A flaw Z with a long probing length inside a probing target is allowed to be probed. The waves other than the probing target waves are removed or reduced, so that the individual difference in the sizing result due to the ability of the measuring personnel is eliminated to improve the precision of the probing. A transmission probe 06-04-2009 20100024556 ULTRASONIC INSPECTION METHOD UTILIZING RESONANT PHENOMENA - A transmission probe and a reception probe for transmitting and receiving a wideband ultrasonic wave are provided. Each time when the locations of the probes and are moved, a received wave G 02-04-2010 Minoru Hirose, Tokyo JP Patent application number Description Published 20090040344 IMAGING APPARATUS AND CONTROL METHOD THEREOF - An imaging apparatus includes a first output unit configured to perform first gain processing on an analog signal corresponding to an electric charge stored in a photoelectric conversion element in a first region and output the processed signal, a second output unit configured to perform second gain processing on an analog signal corresponding to an electric charge stored in a photoelectric conversion element in a second region and output the processed signal, an instruction unit configured to instruct a gain of each gain processing in the first and second",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}