{
    "relation": [
        [
            "Patent application number",
            "20090267614",
            "20110121854",
            "20120242353",
            "20130306839"
        ],
        [
            "Description",
            "Physical Property Measuring Method for TFT Liquid Crystal Panel and Physical Property Measuring Apparatus for TFT Liquid Crystal Panel - There is provided a physical property measuring method for a TFT liquid crystal panel, includes an impedance setting step of setting the impedance between the source and drain of a TFT of the TFT liquid crystal panel to be less than or equal to a predetermined value, a voltage application step of applying a voltage that cyclically varies to a liquid crystal layer of the TFT liquid crystal panel. And the method further includes a physical property measuring step of measuring a transient current flowing through the liquid crystal layer to which the voltage that cyclically varies is applied in the voltage application step to measure physical properties of the liquid crystal layer.",
            "Physical Property Measuring Method for TFT Liquid Crystal Panel and Physical Property Measuring Apparatus for TFT Liquid Crystal Panel - There is provided a physical property measuring method for a TFT liquid crystal panel, includes an impedance setting step of setting the impedance between the source and drain of a TFT of the TFT liquid crystal panel to be less than or equal to a predetermined value, a voltage application step of applying a voltage that cyclically varies to a liquid crystal layer of the TFT liquid crystal panel. And the method further includes a physical property measuring step of measuring a transient current flowing through the liquid crystal layer to which the voltage that cyclically varies is applied in the voltage application step to measure physical properties of the liquid crystal layer.",
            "Physical Property Measuring Method for TFT Liquid Crystal Panel and Physical Property Measuring Apparatus for TFT Liquid Crystal Panel - There is provided a physical property measuring method for a TFT liquid crystal panel, includes an impedance setting step of setting the impedance between the source and drain of a TFT of the TFT liquid crystal panel to be less than or equal to a predetermined value, a voltage application step of applying a voltage that cyclically varies to a liquid crystal layer of the TFT liquid crystal panel. And the method further includes a physical property measuring step of measuring a transient current flowing through the liquid crystal layer to which the voltage that cyclically varies is applied in the voltage application step to measure physical properties of the liquid crystal layer.",
            "PHOTODETECTOR - Provided is a photodetector including a light receiving portion that accumulates and outputs the amount of received observation light as electric charges; an offset portion that adds an offset signal to an output signal from the light receiving portion; an AD conversion portion that AD-converts the sum of the output signal and the offset signal obtained by the offset portion; a control unit that controls the AD conversion portion such that it A-D converts said sum when the light receiving portion is charged and discharged; and an offset correcting portion that corrects the offset signal by adjusting the value of the offset signal contained in the black level value such that the black level value obtained by the AD conversion portion from said sum when the capacitor is discharged becomes equal to a predetermined target value."
        ],
        [
            "Published",
            "10-29-2009",
            "05-26-2011",
            "09-27-2012",
            "11-21-2013"
        ]
    ],
    "pageTitle": "Sasaki, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sasaki-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00340-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452798063,
    "recordOffset": 452756614,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kunihiko Sasaki, Tokyo JP 05-14-2009 X-RAY CT APPARATUS - The present invention provides an X-ray CT apparatus capable of obtaining each tomographic image indicative of X-ray tube voltage dependent information of a subject with the optimum image quality by less reduced exposure. The X-ray CT apparatus includes device for setting a plurality of X-ray tube voltages and sets imaging conditions used in the photography using the respective X-ray tube voltages in such a manner that respective image noise of tomographic images photographed at the X-ray tube voltages become substantially identical to one another. The setting of the imaging conditions is the setting of X-ray tube currents. The X-ray tube currents are set based on geometrical characteristic amounts of the subject determined from each scout image in such a manner that the respective image noise of the tomographic images photographed at the plurality of X-ray tube voltages become substantially identical to one another. 20090122952 Published Description Patent application number Kosuke Sasaki, Tokyo JP 12-30-2010 COMPOSITION FOR COATING AGENT - To provide a composition for a coating agent capable of forming a coating film excellent in the weather resistance, having high uniformity and having favorable gloss on the surface. 20100331482 Published Description Patent application number Koichi Sasaki, Tokyo JP 12-23-2010 PROCESS FOR PRODUCING HIGH-PURITY CHLOROPHOSPHITE - There is provided a process capable of preventing the adhesion",
    "textAfterTable": "Patent applications by Kunihiko Sasaki, Tokyo JP Kunitsuna Sasaki, Tokyo JP Patent application number Description Published 20080276833 INK FOR INK-JET RECORDING - An ink-jet ink comprising at least water and an organic solvent having a boiling point of not less than 150 ° C. in an amount of not less than 50 weight % and not more than 80 weight % based on the total weight of the ink, wherein the organic solvent comprises an alkane diol represented by Formula (1) or (2) in an amount of not less than 45 weight % and not more than 70 weight % based on the total weight of the ink, and a glycol mono-ether represented by Formula (3) in an amount of not less than 5 weight % and not more than 15 weight % based on the total weight of the ink: Formula (1) R 11-13-2008 Manabu Sasaki, Tokyo JP Patent application number Description Published 20080273163 Structure for Installing Bone Conduction Device on Eyeglasses - In order to provide a mounting structure for a bone conduction device to eyeglasses, wherein the bone conduction device in a communication instrument or an acoustic",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}