{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Good, hard working students looking for that medium size school. UD is perfect for that. The school really has a niche for any kind of individual whether it be intellectual, theatrical, or fitness oriented and more. I don't think UD has a 'type' of student that goes to it.",
            "This really applies to any incoming college student: Make sure you make the transition from living at home to living at college. No one is watching over your shoulder anymore. It is up to you to make the choices that will shape you into the person you want to be portrayed as being. Also, make sure you take advantage of all that college has to offer. These years are so great- do NOT waste them!",
            "College is expensive. There is not getting by that fact especially a school such as UD. Fortunately, UD has generous academic scholarships which has helped lessen the burden. I feel compensated for what I am paying for my education. However, it would be obviously best if it were free!",
            "Everyone always talks of the 'community' that exists here. I have to be cliche and agree with that statement. It is true. I value that sense of belonging and companionship that exists at UD. I enjoy everything I am a part of whether it be intramurals, school, or work.",
            "I am in the chemical engineering program at UD. It is a great size program which I enjoy. The professors know their students and that relationship can only help the learning process. I am only starting to get into my upper level classes so I did not give a full five stars. Perhaps in the future of my college career, I would award the full rating."
        ]
    ],
    "pageTitle": "University of Dayton (UD) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Dayton/reviews?_escaped_fragment_=/show/14230",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897442415,
    "recordOffset": 897363194,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{245676=Christmas on Campus is an annual celebration held each December on the University of Dayton campus. It is a hallmark event symbolizing the Catholic and Marianist tradition of the University of Dayton. When Christmas on Campus began, it was a celebration for UD students and faculty. Then UD decided to involve the greater Dayton Community; thus local families were invited to come to the event and share in the Christmas celebration. It came to the attention of UD students that many children may not have the opportunity to fully celebrate the Christmas holiday. Rather than simply inviting children, they created a way to adopt a child. Nearly 1000 children from Dayton City Schools are adopted by UD students the night of Christmas on Campus. In addition to the schools we work with, the event is free and open to the general public. Over the years, the activities of the night have grown and expanded to make Christmas on Campus one of the most signature at the University of Dayton. Christmas on Campus is a unique opportunity to celebrate the true spirit of Christmas with the entire Dayton community- students, faculty, staff, alumni, families, and most of all- the children of Dayton., 307561=The University of Dayton is such a clean, fresh campus that offers friendly and diverse people from all around the world. It is in the midst of expanding right now, so a lot of construction is happening on and around the campus. It has been a wonderful experience attending UD and I cannot wait to enter my fourth and final year there in August., 155501=We have Christmas on Campus every December 8th where we bus in inner city kids and give them a Christmas they'll probably never have again because they're financially struggling., 272051=We never have class on December 8th due to Christmas on Campus, where Dayton area children come and enjoy activities such as live reindeer and Santa Claus. Hundreds of people come to campus to celebrate St. Patrick's Day. The student body is largely Irish Catholic and gets pretty enthusiastic about this holiday., 89165=Get to know your professors and go to their office hours, they just sit there waiting for you, and going to office hours can make or break you between an A or B. Become friends with your RA, they are you guide to your freshman year and even though he or she has their own workload, they are always happy to help you and listen. Also, if you make the fantastic decision to go to UD, I suggest the flex meal plan, it's much easier and you can eat whenever you please! Last one, PLEASE go random for roommates. If you had asked me last April, I would have told you the complete opposite, but truth is, you don't know how someone really is until you live with them., 121524=christmas on campus is a unique ud tradition when the whole campus shuts down for a day in december and kids from inner city dayton are bused in. you can 'adopt' a child for the evening and take them around the beautifully lit-up campus, with activities from carnival games to a live reindeer-petting exhibit. it is a truly unique way to give back and get in the christmas spirit., 247160=Three years ago as I drove home from my visit to the University of Dayton I sat in the car thinking about my recent tour. What the heck was this feeling that I had in my stomach. It was something that I had never felt before in my life. I thought to myself, how is it that I suddenly felt as if something touched me when I was walking around the campus of UD. It was just another college I thought. But I couldn't shake this feeling that was inside of me. I knew that the next four years of my life would be forever changed based on this decision. When on campus at UD, I felt this sense of community that seemed so special and unique compared to any other college I toured. It was the little things that had me thinking of Dayton. When students or professors came up to me and asked me How are you doing? It was like they were looking straight into your heart, truly reaching out there hand saying we are a family here at UD, anything you ever need you come and talk to us. Every other college I went to it felt like they were just trying to pass the time and move on to the next person in line. Everything started to come full circle for me. Here was a school that based itself off the men of the Marianist brothers who established this school in 1850. Community and service is what they stood for, and it has carried through to the present day, with the students carrying on their vision of a body of people working towards a common goal. Not because we want to showboat to other people to show our great we are. But because it is our duty as Flyers to make the world a better place than when we entered into this world. It is over 2 years later and I still have that feeling that beams brightly inside of me. Its that feeling when you walk in between classes and it takes you 10 extra minutes because you run into so many friends who want to know how you are doing. It'Â?s the feeling when you walk through the student neighborhood that very first weekend of freshman year and the upperclassmen are inviting you up to their porch. It's the feeling on an autumn evening as you are apart of Red Scare, cheering on our beloved Flyers to victory both at Baujan and Frericks. It's the feeling when your eyes meet the sea of green of Lowes on St. Paddy's day. It's the feeling when you gather as a community inside the Chapel and everyone thinks to themselves It doesn't get much better than this to wrap the week upÂ?. And lastly, it's the feeling that we will remember forever. The feeling that gives me chills every time I think about it. It's that one moment. And you never know when it'Â?s going to hit you. But when it does you feel as if life stands still and for that very moment everything is right in the world. There are many different kinds of ways for this moment to hit you, but we all share it, every day. It's when you look into your heart and say Â?coming to UD was the best decision of my life. Two years ago I was just another high school kid thinking I was moving on towards the next point of my life. It was that moment in the car when it hit me. It was that feeling again. I always laugh, because when people ask why I love UD so much, it's so hard to put into words because it's just that feeling. Well guys, I hope my story touches you in someway. I know what UD has done for me. What can UD do for you?, 389650=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/11/2009 Reviewer is A current student here. 20 out of 21 people found this review useful. 1 of 82 Jessica from Columbus, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Dayton Reviews University of Dayton › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews James from Cleveland Heights, OH 07/06/2009 Reviewer is A current student here. 9 out of 10 people found this review useful. 2 of 82 Categories Comments Tips for prospective students Take advantage of the professors, as they are there for you. Do not skip classes because you are sick because you are paying for those courses. Its like buying a ticket at an amusement park and not utilizing it to enjoy the park by simply throwing the ticket away (but on a much larger scale, one that will impact your life). Enjoy the wonderful community at UD, but don't take advantage of it and make sure you can balance the socializing with your studies. Login to rate or flag the reviews Marci from Kettering, OH 07/28/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 3 of 82",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}