{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is pretty safe overall.",
            "There are lots of clubs and activities on campus, plus the opportunity to start your own, so there's something for just about everyone.",
            "Carnival is an amazing tradition and is not only a really fun weekend, but it's a great break from school work.",
            "Tuition is very expensive, but the education is worth it.",
            "There are tons of campus events happening all the time that are usually pretty fun, especially Carnival. Also, going down to the Waterfront and seeing a movie or just hanging out with friends is a great way to get away from campus now and then.",
            "Most of the dining locations on campus are great, but some of them have hours that don't make much sense, so I sometimes am unable to eat where I want to eat because I don't know when it's open.",
            "I lived in Morewood E-Tower and am now living in Webster Apartments, and both locations are wonderful.",
            "Especially in computer science, the program is very difficult, but I would not trade it for an easier program. The difficulty is worth it and it is all engaging work.",
            "I sometimes feel like not enough people know much about Carnegie Mellon, so I would encourage prospective students to really look into CMU and see all of the freedom and options that exist at CMU. For prospective students looking to study computer science, I would advise you that the program is wonderful, but don't underestimate how difficult it is. You will have to work very hard, but it is absolutely worth it.",
            "Carnegie Mellon University has such a wonderful energy and truly cares about its students, which makes me feel welcome and happy both academically and socially. I'm a computer science major, and while the computer science program at CMU is very difficult, it's challenging in an exciting way and it motivates me to work harder. I genuinely feel like I have far more opportunities at CMU than I would at any other school."
        ]
    ],
    "pageTitle": "Carnegie Mellon University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Carnegie-Mellon-University/reviews?_escaped_fragment_=/show/101599",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889639031,
    "recordOffset": 889574245,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{290151=Top Computer Science University 2014. Focus on practical rather than theory. Quality of Professors and Curriculum, 296132=They have a fence that they paint between 12:00-6:00 AM and members have to camp out by it to secure it., 319737=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/05/2009 Reviewer is A current student here. 44 out of 44 people found this review useful. 1 of 77 Mathew from Jensen Beach, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. Carnegie Mellon University Reviews Carnegie Mellon University › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck While it is an expensive institution to attend, the prestige and reputation hold true. CMU provides a strong background in any field, but it also provides a variety of diversity and experience that are invaluable and certainly prepare for life after college. Am enjoying being here Even though CMU has a reputation for all work and no play, there is surprisingly always something to do, both academically and socially. In the classroom, many professors are casual and approachable. Outside the classroom, there are many organizations, sports teams, dance troupes, concerts, musicals, and other social events at which to meet people...and that's just on campus! The city of Pittsburgh also has much to offer, including shopping, the arts, and food! Am learning a lot I am a freshman, so a lot of my courses are introductory and relate to courses I took in high school (ie - biology) and I am therefore familiar with the material. But I have learned a lot more detail, especially in my science courses. Login to rate or flag the reviews Jacob from Pittsburgh, PA 12/09/2009",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}