{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel safe on campus. we do at have a lot of crime on campus.",
            "greek life is small but continues to grow. It is not the center like other schools but still has a large part on campus.",
            "there is something for everyone",
            "Awesome school! you learn a lot and have fun at the same time.",
            "Campus is right next to down town! Down town has a great night life and the bear line runs down there during the day and at night. We do have sports teams even though they aren't the best it is still fun to tail gate and go cheer them on! Everyone here has a lot of energy.",
            "The food is okay, I try and stay out of the dining hall, the hours aren't very good either. Our food court is AMAZING though, it has panda express and other great choices. It is also open all the time and you can use your bear bucks there.",
            "All the dorms are good! They are redoing them but keep them all looking nice. They are all in great locations on campus and you cant go wrong no matter which one you pick.",
            "There are some teachers who are really hard and others who are easy. It really depends on.",
            "Look around and visit the campus before you say yes. The campus is beautiful and they keep updating it every year. Don't go where your friends go, ,ake your own choices.",
            "MSU is awesome, everyone is very welcoming and there are so many different student groups for everyone to join. The teachers here are very helpful and the class sizes are nice and small once you get into your major classes. It is very easy to fit in!"
        ]
    ],
    "pageTitle": "Missouri State University-Springfield Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Missouri-State-University-Springfield/reviews?_escaped_fragment_=/show/20017",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899209747,
    "recordOffset": 899092815,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{357918=Id checks at dorms after 7:00 pm, and now a bluw light policy where you can push a button at any blue light stop and a cop will escort you to your destination in you are out at odd hours, or feel unsafe., 150634=My tip for prospective students is to apply early. There are a limited amount of scholarships available early on that you can receive if you apply before January of the year you plan to attend., 649479=Beautiful campus, super excited to move back in June., 325917=The greek life is expanding in the fall of 2013 there will be 7 national sororities and 1 local sorority and there are 15 national fraternities. The community is getting unusually strict though and is no longer allowed to be called Greek there., 164301=The clubs abound here at MSU. If there isn't a club that you wish to join, and you and four of your friends have an idea for a club, you can just march on down to the Office of Student Engagement and start your own club! We have everything from Academic clubs, to Spectrum, the LGBTQ club. There are tons of activities like trips and exercise classes, and we're even finishing up our recreation center which will house a pool, a rock wall, and I even hear a zip line is involved!, 169519=Apply soon! Many of the school scholarships are awarded by December. Be prepared to get involved, on campus and in the community. We're a Public Affairs University, so community service is a must for most, and campus life is purely a blast. You make friends through joining clubs and organizations, and we have a lot of them. Find your niche and jump right in!, 663875=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 25 out of 27 people found this review useful. 1 of 160 Deanne from Fenton, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. Missouri State University-Springfield Reviews Missouri State University-Springfield › Missouri › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Robert from Hollister, MO 01/04/2010 Reviewer is A current student here. 13 out of 13 people found this review useful. 3 of 160 Categories Comments Great for these types of students Small town kids trying to get into a bigger city, but not wanting St. Louis. Art majors of all types. And kids trying to get away from the big city but not wanting to be in the middle of nowhere. Tips for prospective students Enjoy the dorm life, make those lasting friendships, and find your niche. There's always something to do, the trick is knowing what is a good idea to do. Bang for the buck Inexpensive, but you won't get much aid if your GPA and ACT scores aren't up to snuff, regardless of financial need, though this the situation with most colleges. Am enjoying being here There's always plenty to do and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}