{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "It's living in NYC...you literally have an entire city with things to do for fun.",
            "The food sucks but all of the dining hall employees are super nice.",
            "My English class is really easy but my actual art classes are rigorous.",
            "Focus more on your portfolio than your grades - your portfolio is what counts! And apply for outside scholarships, because you can't appeal the scholarship you're given from the school. You can appeal your financial aid, though.",
            "I love it here. The photography program is perfect for me, and I feel completely comfortable here."
        ]
    ],
    "pageTitle": "Pratt Institute (Pratt) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pratt-Institute-Main/reviews?_escaped_fragment_=/show/39567",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902068439,
    "recordOffset": 902015560,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{219321=© 2015, Cappex.com, LLC, 169382=The food is not horrendous but it is extremely expensive. You pay for every item instead of just swiping per time you go into cafeteria like most colleges. As a freshman you must get a meal plan, your options are 1600 or 1800 dollars per semester. If you don't finish your money you can use some of those points at the convenience store on campus or at one of their Starbucks cafes. The food is about standard for a college campus.}",
    "textBeforeTable": "12/15/2010 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 47 Kanisorn from BROOKLYN, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. Pratt Institute-Main Reviews Pratt Institute-Main › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Jeremy from Rochester, NY 02/05/2011 Reviewer is A current student here. 15 out of 15 people found this review useful. 2 of 47 Categories Comments Great for these types of students I think that this is a great place for students who want to learn a lot of technical and basic skills [this is based on the comd department]. It's also good for those who may be more advanced because there are teachers that are very challenging. Most of the professors are still working and have many connections and if you're good enough, they are more than happy to help you out finding opportunities for work life during and after college. Tips for prospective students Visit the campus. It's really a nice place to be. Also, look up all the teachers for the department you're thinking about majoring in and their work. This will be very helpful in determining if there are teachers that can help you grow in the areas that you need. Also look up the instructors in other departments",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}