{
    "relation": [
        [
            "Issue",
            "General Dragon commands do not work",
            "Dragon does not apply form field numbering overlay for PDF forms",
            "Text input is not as accurately recorded in PDF documents as it is with other application"
        ],
        [
            "Cause",
            "AT support",
            "AT support",
            "AT support"
        ],
        [
            "Impact",
            "Moderate",
            "Low",
            "Low"
        ]
    ],
    "pageTitle": "User evaluation test results by assistive technology - Department of Finance and Deregulation",
    "title": "",
    "url": "http://www.finance.gov.au/publications/pdf-accessibility-study/3-user_evaluation_test.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450504231,
    "recordOffset": 450457365,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27550=When interacting with the documents, the experience for the NVDA 2009.1 user was degraded by the lack of core functionality provided by NVDA 2009.1 for PDF files. As a result, the user had to implement alternative strategies on multiple occasions to compensate. However, the user did not find this particularly troublesome and considered the ease and time to accomplish the tasks acceptable., 24148=The NVDA 2009.1 participant attempted all of the tasks in both document sets (twelve tasks), and succeeded in six (50% success rate). The time taken to complete the tasks was deemed acceptable on all tasks and the level of ease by which this was achieved was also very high., 24845=Table 10: Issues encountered with Collection A using NVDA 2009.1, 26333=The NVDA 2009.1 participant experienced several issues caused by a lack of AT support that were not clearly identified in the technical testing:, 23428=Table 9: NVDA 2009.1 test results, 24434=The specific tasks from Collection A that the participant failed were orientating by page number and navigating information in a table structure. As with the moderate and low experienced JAWS users, the NVDA 2009.1 participant experienced a learning curve when interacting with the PDF documents that helped him become more efficient as the tasks progressed., 27953=Table 11: Full test results for user evaluation by task - NVDA 2009.1}",
    "textBeforeTable": "Table 6: JAWS versions 9 & 10 test results Success rates Seven participants attempted the tasks using this assistive technology. JAWS 9 & 10 The Orneta reader failed to open any of the PDF documents used for the evaluations. It did open a pre–installed PAC Mate user guide from Freedom Scientific available on the PAC Mate. However the efficiency of this interaction was very poor and the PDF reader crashed repeatedly. The best experience was when the participant managed to move through the first page using the keyboards up and down arrows. All other reading and navigation commands failed to work. Based on this experience, no evaluations were conducted and the level of technical capability provided by PAC Mate was deemed to be not sufficient for this Study. The one PAC Mate participant was unable to undertake any of the twelve tasks due to technical problems using the PAC Mate and the Orneta PDF Reader Mobile – the PDF reader recommended by PAC Mate’s Australian distributor, Quantum Technology. PAC Mate Detailed test results by assistive technology Low: Irritation faced by user, but goal could be achieved. Medium: Difficulties requiring a change in approach for user to achieve their goal. High: Significant barrier making it impossible for user to achieve their goal. Further, the relative impact of each issue was rated based on the effect it had upon the participant and whether they were able to successfully complete",
    "textAfterTable": "User Evaluation tests were conducted with users describing their experience with using their ATs as low, medium or high level skill. Participants of varying skill level were included – see Table 3: Participant profiles by disability group. There were no significant differences in the success rates (for tasks) between the different experience/skill levels of the participants using JAWS, nor in their acceptance of the time taken to complete the tasks. However, there was an apparent variation across skill levels when users were asked to assign a level of ease to the task they had just completed. For Collection A, the participants with a high level of experience/skill found the tasks very easy overall. In contrast, the participants with moderate and low experience/skill levels acknowledged that there had been a learning curve as they worked their way through the tasks. Specific issues encountered Table 7: Issues encountered with Collection A using JAWS versions 9 & 10 Issue Cause Impact Page number in document is not read aloud by JAWS Document design High Page number of document does not correspond with Adobe Page Navigation toolbar Document design Moderate Users expected table rows for 'item details' to be numbered Document design Low",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}