{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "to be honest, i don't have time for fun activities, i focus on classes and homework.",
            "the food is decent, not bad.",
            "i live off campus.",
            "it depend on the students,",
            "try to stay focus and positive.",
            "there alot of diverse students. there are numerous activities students can do. overall its a decent university, for me personally."
        ]
    ],
    "pageTitle": "New Jersey City University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/New-Jersey-City-University/reviews?_escaped_fragment_=/show/41980",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909990759,
    "recordOffset": 909964623,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101762=© 2015, Cappex.com, LLC, 56115=Dorming in the 2040 apartments is a nightmare from another nightmare. Vodra is always the place to be at. CO-OP has the kitchen in it. They have laundry service, dry dorms [don't bring alcohol], security guards are down to earth but can be serious at times.}",
    "textBeforeTable": "12/26/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 1 of 25 Priya from Jersey City, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Campus Safety The campus is very safe. There is always security patrolling the premises, making you feel at ease. Greek Life The Kapas are really cute. Great for these types of students Students who love to have fun as well as inrich themselves with further education. Bang for the buck I believe NJCU is a school that makes the students' tuition and fees worth while. There is also a very convenient Bank of America ATM machine located right on the campus. What to do for fun Make friends. Meet with them in the student union or Gothic lounge. There is always tons to do. Attend all of the sports games and events such as movie or game night, held by the fraternities and sororities. Most importantly, be sure to spend time in the Library. Dorm Life I do not dorm, but from what I have seen, the dorms are a very comfortable place to live. Tips for prospective students Do not allow your college social life to distract you from maintaining",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}