{
    "relation": [
        [
            "Date",
            "2010-10-06 10:00:00",
            "2009-11-02 17:00:00",
            "2009-10-28 17:00:00"
        ],
        [
            "Roundtable Name",
            "2010 Playoffs Day One",
            "2009 WS Game Five",
            "2009 WS Game One"
        ],
        [
            "Comment",
            "As I wrote over at the Pinstriped Bible, putting Moseley and Mitre on the Yankees roster was an act of supreme pessimism, especially when they also threw A.J. Burnett into the pen. Just how much long relief do they expect to need and still win the series? (Steven Goldman)",
            "A.J. Burnett didn't get hammered tonight because he was starting on three days' rest. He got hammered because he's A.J. Burnett, and sometimes he does this. And, yeah, the Phillies' lineup is really freaking good. The game isn't even over yet and I'm sick of this story. Call for moratorium on \"days rest\". (Joe Sheehan)",
            "Not to oversell it, but this series seems, to me, to change a LOT with a Phillies win. They now get the roulette wheel that is A.J. Burnett, followed by Cole Hamels at home. A lot can happen in those games, of course, but suddenly Phillies in seven seems...long. (Joe Sheehan)"
        ]
    ],
    "pageTitle": "A.J. Burnett | Baseball Prospectus",
    "title": "",
    "url": "http://www.baseballprospectus.com/card/card.php?id=493",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00319-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 307606815,
    "recordOffset": 307551952,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{530476=A.J. Burnett has thrown 26,971 pitches that have been tracked by the PITCHf/x system between 2007 and 2015, including pitches thrown in the MLB Regular Season and the MLB Postseason. In 2015, he has relied primarily on his Sinker (92mph) and Curve (83mph), also mixing in a Fourseam Fastball (92mph). He also rarely throws a Change (86mph)., 63726=Last Update: 12/31/2014 23:59 ET}",
    "lastModified": "Fri, 31 Jul 2015 03:07:17 GMT",
    "textBeforeTable": "BP Roundtables Rich Hill is something like the 25th-best starter in the National League. I have no idea what he did to Lou Piniella, but he can take Zambrano's place with minimal loss in value. (Joe Sheehan) Let's go worst-case scenario and say Big Z is out for the year. Should the Cubs trade for A.J. Burnett (or whoever) or give Hill and/or Marshall another shot? (Stephen from Louisville) 2008-06-20 13:30:00 (link to chat) It shouldn't be a good offense based on its rather limited talent, and it isn't. And that division makes their situation very difficult. I absolutely think that the Blue Jays need to start thinking about whether they could get someone like Matt LaPorta for someone like A.J. Burnett. (Nate Silver) Does the Blue Jays offense have it in them to turn it around and save JP's job? (making Cito the hero of millions once again in the process) Or should they start looking at things like AJ Burnett to the Brewers for a shiny prospect? (Gamel?) (Aaron from YYZ) 2008-06-25 14:00:00 (link to chat)",
    "textAfterTable": "  PITCHf/x Pitcher Profile A Collaboration between BrooksBaseball.net and Baseball Prospectus - Pitch classifications provided by Pitch Info LLC A.J. Burnett has thrown 26,971 pitches that have been tracked by the PITCHf/x system between 2007 and 2015, including pitches thrown in the MLB Regular Season and the MLB Postseason. In 2015, he has relied primarily on his Sinker (92mph) and Curve (83mph), also mixing in a Fourseam Fastball (92mph). He also rarely throws a Change (86mph).   Baseball Prospectus Analysis Blog Radio Events Newsletter Search News Player Cards Player Search Team Audit Statistics Fantasy Player Forecast Manager Depth Charts Team Tracker Hacking Mass Team Health Reports BP.com Terms of Service Customer Service Privacy Policy Contact Us Glossary AMERICAN LEAGUE Baltimore",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}