{
    "relation": [
        [
            "Breed",
            "Standardbred",
            "Thoroughbred",
            "Totals"
        ],
        [
            "Race Dates",
            "85",
            "58",
            "143"
        ],
        [
            "Urine",
            "1351",
            "1003",
            "2354"
        ],
        [
            "Blood",
            "1679",
            "1141",
            "2820"
        ],
        [
            "Positive Tests",
            "2",
            "7",
            "9"
        ]
    ],
    "pageTitle": "HRC: 1997 Annual Report",
    "title": "",
    "url": "http://www.state.in.us/hrc/2350.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 732697139,
    "recordOffset": 732669608,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72812=1997 Riverboat Revenue Allocation to Racing From Admission Tax (65 cents), 13274=The pari-mutuel horse racing industry moved forward at a rapid pace in 1997. Hoosier Park in Anderson was able to attract some of the top equine athletes throughout the Midwest to its live standardbred and thoroughbred meets. The prize money or purses offered to attract these quality horses were greatly increased over prior years. This was primarily due to the revenue generated by the portion of riverboat admission tax that is allocated to the racing industry. This revenue has proved vital to Hoosier Park's success and has propelled the track into the upper echelon of the pari-mutuel horse racing industry in the United States. Hoosier Park now ranks second in the country in average daily purse distribution for standardbred racing., 23262=For the first time in Indiana pari-mutuel history, Quarter Horse racing is held at Hoosier Park on Sunday, October 26. Three $10,000 stake races were carded. The first Quarter Horse race, the Governor's Stakes, is won by Easy Night Beat, which is owned by Mary Jo Renihan of Martinsville, Indiana and piloted by Carter Riley of Walton, Indiana., 20650=On July 11, Hot Lead, with Tony Morgan in the bike, wins the $150,000 Dan Patch Invitational Pace. The 6,023 fans in attendance represent the second largest crowd in track history., 75748=IHRC Approval - December 3, 1997, 68235=The highlight of the 1997 Thoroughbred racing season was \"Indiana Championship Day\" held on September 14. Ten stake races for Indiana owned and foaled horses were contested and purse money totaled in excess of $400,000. Trainer D. Wayne Lucas and jockeys Pat Day and Shane Sellers appeared in conjunction with the festivities for the day's events sponsored by the Thoroughbred Breed Development Program., 66409=The successful county and state fair purse supplement programs were continued as were the purse bonuses for breeders and stallion owners. The stallion owner and breeder awards were expanded in 1997 to include horses who won a heat of the Indiana Sired Stakes. Through these and other efforts, the Standardbred Breed Development Program hopes to develop and promote a high quality Standardbred industry in the state of Indiana., 31716=The direct revenue received by the State of Indiana exceeded the cost of regulation. Indiana Horse Racing Commission expenditures for calandar year 1997 were $1,388,466.15., 65411=Pursuant to IC 4-31-11, breed development funds have been established to promote the breeding of horses while stimulating the agri-business sector of the state's economy. All breakage and unclaimed winning tickets are statutorily earmarked for breed development. In addition, twenty percent (20%) of the riverboat admission tax allocated to the racing industry is distributed to breed development funds. Standardbred and thoroughbred breed development advisory committees make recommendations to the Commission regarding the distribution of these monies., 66016=In 1997 the Standardbred Breed Development Advisory Committee established a new series of Early/Late Closing Events held at Hoosier Park. This series created races for Indiana sired, owned and/or bred horses to compete for over $1.6 million in purse money. The Genesis Series for trotting and pacing fillies also expanded in 1997 to include three-year olds for the first time., 74604=Pursuant to Commission rule, the allocation between breeds for purses and breed development is determined based upon the percentage of pari-mutuel handle on each breed on live racing at all Indiana locations. Based on 1997 handle, 51.35% of available funds were distributed to standardbreds, while 48.65% was distributed to thoroughbreds., 18710=To further assist the Commission with its regulatory responsibilities, the following individuals provided professional or technical service at Hoosier Park during the 1997 racing season., 13051=March 15, 1998, 20911=Extreme Velocity, the winningest horse in Hoosier Park history, puts Indiana in the national spotlight with an explosive stretch rally to win the $282,000 Breeders' Crown final at the Meadowlands. The 1997 ISA Horse of the Year is owned by Dave and Merrill Stohler of Markleville, Indiana and trained by Trent Stohler., 21254=On August 22, Perfect Art driven by George Brennan, captures the inaugural $500,000 Hoosier Cup. The half-million dollar purse is the largest in track history. A total of $676,900 in prize money paid during the night establishes a Hoosier Park record for most purses paid on a single card., 23138=On October 4, Dubai Dust trained by D. Wayne Lucas captures the third running of the Indiana Derby., 23631=Jon Court (65 wins) and Earl Murphy (18 wins) capture the thoroughbred riding and training titles respectively. Court's title is all the more noteworthy as he is unable to compete during the last three weeks of the meet when he suffers a broken leg after the 2nd race on November 10., 72517=The statute permitting riverboat gaming in Indiana earmarks sixty-five (65) cents of the three dollar admission tax to the pari-mutuel horse racing industry. These funds are distributed to various segments of the racing industry in accordance with Commission rule 71 IAC 12-2-15., 22307=National racing icon trainer D. Wayne Lucas and Hall of Fame jockey Pat Day participate in the second Indiana Championship Day held on September 14. Ten races filled with Indiana bred or owned horses are contested and over $400,000 in purse money is awarded.}",
    "textBeforeTable": "Purses Paid Back to the Table of Contents The handle above represents all money wagered at all Indiana locations. 100.0 $146,957,129 90.1 $132,440,404 9.9 $14,516,725 Combined Breeds 79.2 $116,334,351 74.4 $109,272,643 4.8 $7,061,708 Thoroughbred 20.8 $30,622,378 15.7 $23,167,361 5.1 $7,455,017 Standardbred % Total Handle % Simulcast Handle % Live Handle Breed Breakdown of Handle by Breed and Type Back to the Table of Contents The direct revenue received by the State of Indiana exceeded the cost of regulation. Indiana Horse Racing Commission expenditures for calandar year 1997 were $1,388,466.15. $4,305,125.06 Total Revenue 8,000.00 Track Permit and License Fees 27,375.00 Fines and Civil Penalties Paid 32,372.78 Admission Tax 189,201.43 Track Reimbursement for Officials $4,048,175.85 Pari-Mutuel Tax State RevenuesThe following are the direct state revenues collected in accordance with the pari-mutuel statute IC 4-31:",
    "textAfterTable": "Thoroughbred Purses Average Daily Distribution Source: The Jockey Club Back to the Table of Contents Purses Earned by Type Type Amount % Riverboats(*) $8,880,900 48.4% Simulcast - Receiving 6,802,221 37.0% Breakage & Outs (*) 1,235,999 6.7% Live Racing (Intrastate) 885,780 4.8% Simulcast - Host (Interstate) 558,622 3.1% Total $18,363,522 100% (*) Assumes 75% fo breed development funds are allocated to purses. Back to the Table of Contents Simulcast Handle - Hoosier Park as Host Track The following is a breakdown, by breed and track, of monies wagered out-of-state on Hoosier Park's live race meets. Thoroughbred Illinois* $5,888,084 Ohio* 4,793,862 Kentucky* 3,122,563 Penn National 1,735,799 New Jersey Hub 1,525,050 Philadelphia Park 1,422,367 The Meadows 1,442,367 Lone Star Park 1,356,165 Sam Houston 1,227,000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}