{
    "relation": [
        [
            "Bobby Deren scarletnation.com",
            "In spite of Cincinnati's quarterback issues, the Bearcats can still move the football. Cincy ranks 33rd in the nation in total offense while running back George Winn has already compiled 990 rushing yards. The Cincinnati spread offense is capable of putting points up in a hurry and leads the Big East in scoring offense. Rutgers has struggled with bouts of inconsistency on offense and the questionable status of running back Jawan Jamison could hamstring the offensive production as a whole. The edge here goes to the Bearcats.",
            "Jawan Jamison. His right ankle could dictate the ebb and flow of the Rutgers offense. If Jamison can prove effective, it will give the entire offense a jolt. Without Jamison, the RU offense will have to rely on backup running back Savon Huggins, who has yet to start a college game. It could also put more pressure on quarterback Gary Nova to come up with some big plays of his own. If Jamison does not play, his absence will affect the offense and force the Scarlet Knights to play without their top offensive weapon.",
            "Rutgers has relied on its defense through the course of the season and the play of that unit is a major reason why the Scarlet Knights boast an 8-1 record. Khaseem Greene looks to be heading towards his second-straight Big east defensive player of the year award and the unit is laden with upperclassmen. The RU defense ranks 14th in the country in total defense, balancing its attack against both the run and the pass. The Bearcats have registered an impressive 22 sacks on the season, but seem to be allowing a high number of points against quality opponents. Rutgers has the better defense of the two teams.",
            "Steve Beauharnais. Against the hurry-up Bearcat offense, the middle linebacker will be entrusted with lining up the RU defense and calling plays at a much quicker pace. The senior captain will also need to force some plays just as he has done all year. Beauharnais' stats may not be as impressive as his fellow starting linebackers, but he is able to force quite a few plays their way. Look for Beauharnais to again do a lot of the dirty work on Saturday. A big game from him could pay big dividends for the Scarlet Knights.",
            "Rutgers has been masterful in blocking kicks this season and have more than any other team in the nation (7). The kicking and punting game have both been a bit shaky as punter Justin Doerner has struggled all season. RU has been forced to turn to walk-on Nick Borgese in the absence of true freshman Kyle Federico but field goal attempts have been at a minimum in recent weeks. Cincinnati ranks in the top 20 in both kickoff and punt returns while field goal kickerTomy Milano has connected on all his field goal attempts inside the 40-yard line and is 12-16 on the season. UC's Ralph Abernathy and RU's Jeremy Deering are both dangerous kick returners with big play ability. Adding up all the plusses and minuses, this one looks like an even draw.",
            "Cincinnati's offense is built for exactly these situations. The up-tempo spread offense can cover a lot of ground in quite a hurry. However, UC starter Brendon Kay is not the most experienced of quarterbacks with only 34 career pass attempts. Although the offense is suited for this type of situation, he's far from polished when it comes to facing those kind of situations. On the other side of the ball, Rutgers has an abundance of downfield threats and Nova has proven that he can engineer lengthy drives in a short span of time. But the way these offenses are designed, the edge here swings in Cincy's favor.",
            "Start No.2 will be a stiff test for inexperienced fifth-year senior starting quarterback Brendon Kay. The Rutgers defense will prove to be just too much for Kay and company. Rutgers will again rely on the strength of its defense to pull out another win and having a vast surplus of senior leaders will pay off. Offensively, the Scarlet Knights should be able to find a way to put enough points on the board to keep them undefeated in Big East play. Rutgers 24 Cincinnati 17."
        ],
        [
            "",
            "Which team has the more potent offense?",
            "Who is the Offensive 'X Factor,' and why?",
            "Which team has the better defense?",
            "Who is the defensive 'X Factor,' and why?",
            "Who has the edge on special teams?",
            "If the game comes down to a final drive, which team drives the length of the field?",
            "Which team will win?"
        ],
        [
            "Andrew Force bearcatreport.com",
            "Cincinnati. Head Coach Butch Jones has been hesitant to admit it, but this is a completely different team with Brendon Kay at QB, instead of Munchie Legaux. Two things have changed for UC since the QB swap. The deep pass is now a constant option and turnovers are way, way down. Kay accounts for 22.2% of the deep completions by UC even though he has only thrown 10.1% of the team's passes. Before the change, the passing attacks were equal. Now UC runs (228.8 per) and passes (226.8 per) better.",
            "He would not have been labeled such two weeks ago, but Ralph David Abernathy has had a quiet month of November. The sparkling talent out of Westminster High (GA) needs to inject his explosive runs, catches, and returns into this game. When you face a run defense as formidable as Rutgers', it takes a handful of splash plays to overcome. Sure George Winn will carry the ball countless times, but RDA is more apt to break a big one off with his remarkably elusive style.",
            "Rutgers. Though statistically nearby in rush defense, the Bearcats simply don't compare in turnover margin or total defense. The Bearcats are better at disturbing the passer with a 23 team sacks, but DL Coach Steve Stripling wants more from his troops. Continuity makes the RU D consistently great. Six of the defensive starters have started in excess of 20-straight games heading into Saturday.",
            "UC DB Arryn Chenault. Rutgers has more known quantities on defense, while Cincinnati has been plugging in several backups on the back end of their defense. Look for Arryn Chenault and Kevin Brown to provide disruptive challenges to RU receivers. Chenault has not been this healthy for three weeks. Two early season interceptions established the first-year starter as a reliable safety.",
            "Cincinnati. Best Pro Prospect: Punter Patrick O'Donnell. Rehabilitating from a tender leg muscle, \"POD\" has world-class strength and even touch. He places countless punts inside the opposing 20 and routinely changes the complexion of games with his blasts. Highlighting the Virginia Tech win was Munchie Legaux's final pass play, but the game was close because O'Donnell buried VT deep all afternoon. Also watch out for KR Ralph David Abernathy.",
            "Rutgers. The Knights protect their king better than anyone in the Big East. Rarely does RU accept a drive-killing sack. Though he has shown many strengths QB Kay did take two against a feeble Temple defense. Rutgers will have the option of sustaining drives as long as the Bearcats give RU time to survey the field.",
            "Frustrated by an imposing defense, Cincinnati will be embroiled in a muddy battle of wills and grit. For years this game would be a Bearcat loss for sure, but the running game is surprisingly powerful in 2012 thanks in large part to a cohesive offensive line. As long as the back end of UC holds up, the Bearcats win 20-10 and George Winn rushes 25 times."
        ]
    ],
    "pageTitle": "ScarletNation.com - Rutgers vs Cincinnati: Who has the edge?",
    "title": "",
    "url": "https://rutgers.rivals.com/content.asp?CID=1437094",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 883228839,
    "recordOffset": 883212549,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1928=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 ScarletNation.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{41654=November 15, 2012, 58806=Trout a big fish in 2018 class}",
    "textBeforeTable": "Rutgers travels west to Cincinnati on Saturday in a game that has major Big East championship implications for both squads. For Rutgers, it will mark yet another step toward the team's first league crown. For Cincinnati, it is a do-or-die win if the Bearcats hope to remain in the title hunt. Which team has the edge? We asked our resident experts! November 15, 2012 Rutgers vs Cincinnati: Who has the edge? Bobby Deren and Andrew Force Scarlet Knight Shop",
    "textAfterTable": "Talk about it in The Round Table FEATURED PRODUCT Nike Rutgers Scarlet Knights Red Custom Replica Football Jersey Rutgers NEWS [More] Latest Headlines:",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}