{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "With fully capable police officers on duty 24 hours a day you are guaranteed to feel safe. They patrol day and night. Work late? They will pick you up and drop you off at your dorm if you feel unsafe in the dark.",
            "Greek life galore! RMU has many fraternities and sororities established on campus.",
            "Have an idea for a club? You will be able to start your own if it isn't already offered at RMU. We have a wide range of clubs and you're sure to find one that fits your interest.",
            "Detail Oriented Commuter Residential",
            "There is a fire pit that is the site of many campus sponsored events. Bobby Mania occurs at the beginning of each year and includes many kick off festivities including fireworks!",
            "It is a bit pricey but you must remember it is a private institution. The level of attention you will get from professors and the close knit campus life should be things you take into consideration while making your decision.",
            "Outdoor courts for basketball and volleyball are always in action. Our Island Sports Center offers free mini golf for students, and free ice skating on certain nights.",
            "There are two options for dining on campus, in addition to a Starbucks. The cafeteria has a plethora of food choices ranging from Italian to Mexican to Chinese food. Romo's Cafe offers sandwiches, salads, and a grocery store type grab and go options.",
            "The campus is ever expanding and new dorms are popping up everywhere. There are many options of campus housing to choose from.",
            "Professors expect to receive only your best performance. Note that it is because they want to make you the best you can be.",
            "You have to visit the campus. It is a beautiful tour that allows you to get a sense of how it would be while attending.",
            "Robert Morris gives you the small campus experience without sacrificing a quality education. The professors are exceptional and committed to meeting your needs. There is also a great sense of pride among the students, WE ARE BOBBY MO!"
        ]
    ],
    "pageTitle": "Robert Morris University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Robert-Morris-University/reviews?_escaped_fragment_=/show/32553",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904629215,
    "recordOffset": 904578208,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{233084=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "11/13/2009 Reviewer is Researching this school. Reviewer has been to campus. 14 out of 15 people found this review useful. 1 of 51 Stephanie from West Newton, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "My experience may be slightly swayed because I'm a media arts student and my first semester included a communication skills course, a math course, intro to psychology, and an art and a video course. So, the communication skills class was the only traditionally rigorous course (assignments and papers), while the art courses were a drawing per week or the production elements of a project. But, from my experience in my first week of my second semester, I'm seeing that this will be a more rigorous set or courses for me. So, it varies but overall the work can be a challenge, but I don't believe it could ever bury you. And in any such case, we offer free tutoring services. Tips for prospective students Really get involved if you come to RMU - we have a lot of opportunity to be involved in the theatre, tv station, and radio, as well as the newspaper and literary journal. Also, there's a club or organization to suit virtually everyone. In three sentences The courses are not too easy or too strenuous, and the teachers I have had are helpful but do not baby their students by any stretch. The campus is beautiful and easy to navigate, and the residence halls and campus facilities are great. Overall, I love RMU. Login to rate or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}