{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 250000 words Duration: Oct 2005 to Jul 2006 Languages: English to Serbian",
            "Translation Volume: 200000 words Duration: Dec 2005 to Apr 2006 Languages: English to Serbo-Croat"
        ],
        [
            "Project Summary",
            "European and international standards (EN, IEC) Translation of European and international technical standards (EN, IEC) in the fields of electrical engineering, mechanical engineering, agricultural engineering, occupational health and safety. Engineering (general)",
            "Materials, chemicals, pharmaceuticals, pesticides, herbicides, etc. Chemical and physical structure and properties, health effects, environmental assessments and ecological risks, health and safety at work, regulation, legislation, MSDS - for app. 3,300 various materials, chemicals, pharmaceuticals, pesticides, herbicides etc. Medical (general), Environment & Ecology, Chemistry; Chem Sci/Eng"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "Vesna Stankovic - English to Serbian translator. Translation services in Chemistry; Chem Sci/Eng - tech/engineering,contracting,science,law,social sciences,education,sociology,psychology,humanities,marketing,project management,quality management,tourism,pharmacology,technology,industry,pulp&paper,chemistry,food,environment,ecology",
    "title": "",
    "url": "http://www.proz.com/profile/6689",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 667082703,
    "recordOffset": 667057465,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "2 projects entered Project History PRO-level points: 5144, Questions answered: 1596, Questions asked: 73 KudoZ activity (PRO) Less More Automation & Robotics Metallurgy / Casting Medical: Pharmaceuticals Materials (Plastics, Ceramics, etc.) Marketing / Market Research Management",
    "textAfterTable": "More Less Payment methods accepted Wire transfer Portfolio Sample translations submitted: 1 English to Serbian: IEC Source text - English The International Electrotechnical Commission (IEC) is a worldwide organization for standardization comprising all national electrotechnical committees (IEC National Committees). The object of IEC is to promote international co-operation on all questions concerning standardization in the electrical and electronic fields. To this end and in addition to other activities, IEC publishes International Standards, Technical Specifications, Technical Reports, Publicly Available Specifications (PAS) and Guides (hereafter referred to as “IEC Publication(s)”). Their preparation is entrusted to technical committees; any IEC National Committee interested in the subject dealt with may participate in this preparatory work. International, governmental and nongovernmental organizations liaising with the IEC also participate in this preparation. IEC collaborates closely with the International Organization for Standardization (ISO) in accordance with conditions determined by agreement between the two organizations. Translation - Serbian Međunarodna elektrotehnička komisija (IEC) je svetska organizacija za standardizaciju koju čine svi nacionalni elektrotehnički komiteti (nacionalni komiteti",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}