{
    "relation": [
        [
            "Field",
            "Left",
            "Center",
            "Right"
        ],
        [
            "285",
            "54%",
            "11%",
            "35%"
        ],
        [
            "True",
            "395.6",
            "426.8",
            "397.5"
        ],
        [
            "Speed",
            "104.5",
            "108.4",
            "104.5"
        ],
        [
            "Elevation",
            "30.3",
            "27.7",
            "30.9"
        ],
        [
            "Apex",
            "93.5",
            "93.0",
            "96.9"
        ],
        [
            "Wind",
            "0.9",
            "-0.2",
            "1.8"
        ],
        [
            "Temperature",
            "2.5",
            "0.9",
            "2.1"
        ],
        [
            "Altitude",
            "0",
            "0",
            "0"
        ],
        [
            "Standard",
            "392.1",
            "425.8",
            "393.4"
        ],
        [
            "Parks",
            "27.3",
            "26.3",
            "27.8"
        ]
    ],
    "pageTitle": "The Baseball Analysts: Personal Park Effects (Part 1)",
    "title": "",
    "url": "http://baseballanalysts.com/archives/2009/04/home_run_park_f.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 22431435,
    "recordOffset": 22400672,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{618=Here are the averages for all regular season home runs from 2006-2008 for which Hit Tracker has information. Here is the glossary for the terms. I've broken the fields into left, center, and right. I'd love to get more granular if I had more data. The second column refers to how many home runs were hit over the timespan, and the percentage hit to each field. The rest are Hit Tracker terms.}",
    "TableContextTimeStampAfterTable": "{60499=Posted by: Jeremy Greenhouse at April 21, 2009 10:13 PM, 59912=Posted by: Alex at April 21, 2009 9:33 PM, 61573=Posted by: Jeremy Greenhouse at April 21, 2009 11:04 PM, 59386=Posted by: Jeremy Greenhouse at April 21, 2009 1:19 PM, 58473=Posted by: Chris at April 21, 2009 10:19 AM, 60760=Posted by: Brendan Scolari at April 21, 2009 10:50 PM, 60209=Posted by: WonkoTheSane at April 21, 2009 9:50 PM, 58755=Posted by: Dave Allen at April 21, 2009 10:43 AM}",
    "textBeforeTable": "table.tableizer-table Here are the averages for all regular season home runs from 2006-2008 for which Hit Tracker has information. Here is the glossary for the terms. I've broken the fields into left, center, and right. I'd love to get more granular if I had more data. The second column refers to how many home runs were hit over the timespan, and the percentage hit to each field. The rest are Hit Tracker terms.",
    "textAfterTable": "I defined the dimensions so that 12% of balls went out to center, so as to be consistent with the work I did last week. However, Hit Tracker also gives horizontal launch angles, with which you can define your own dimensions rather accurately. As there are more right-handed batters than left-handed batters, there are more left-field home runs than right-field home runs. Other than that, the differences between left and right are negligible. Homers to center are hit harder and farther, but also need more help from atmospheric effects. On to specific ballparks. Click on the ballpark names to view their dimensions. Ameriquest Field Homers in Arlington certainly travel. They have by far the greatest impact from temperature of any ballpark. There have actually been more home runs to right field than left, which would likely mean that it is easier to hit home runs in that direction. Indeed, home runs to right have to travel a lesser distance than those to left. This is likely compounded by the home team, the Texas Rangers, trying to exploit this advantage by stocking up on lefties or switch-hitters. This effect is most prominent with the Yankees and Yankee Stadium, who have been well-known to go after left-handed batters as their production will be enhanced by the short right-field fences. Field 545 True Speed Elevation Apex Wind Temperature Altitude Standard Parks",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}