{
    "relation": [
        [
            "Mkt-Ticker",
            "N-SPY",
            "N-XLY",
            "N-XLP",
            "N-XLE",
            "N-XLF",
            "N-XLV",
            "N-XLI",
            "N-XLB",
            "N-XLK",
            "N-XLU"
        ],
        [
            "Name (MarketVision)",
            "SPDR S&P 500 ETF",
            "SPDR CONS DISCR S&P 500",
            "SPDR CONS STAPLE S&P 500",
            "SPDR ENERGY S&P 500",
            "SPDR FINANCIAL S&P 500",
            "SPDR HEALTH CARE S&P 500",
            "SPDR INDUSTRIAL S&P 500",
            "SPDR MATERIALS S&P 500",
            "SPDR TECHNOLOGY S&P 500",
            "SPDR UTILITIES S&P 500"
        ],
        [
            "Sector",
            "Market",
            "Cons. Discr.",
            "Cons. Staples",
            "Energy",
            "Finance",
            "Health",
            "Industrials",
            "Materials",
            "Tech.",
            "Utilities"
        ],
        [
            "Reference",
            "The Select Sector S&P 500 SPDR ETF Fund - Follows the S&P 500, an index composed of 500 selected stocks, spanning over 24 separate industry groups.",
            "The Consumer Discretionary Select Sector SPDR Fund - Follows the S&P Consumer Discretionary Sector.",
            "The Consumer Staples Select Sector SPDR Fund - Follows the S&P Consumer Staples Sector.",
            "The Energy Select Sector SPDR Fund - Follows the S&P Energy Sector.",
            "The Financial Select Sector SPDR Fund - Follows the S&P Financial Sector.",
            "The Health Care Select Sector SPDR Fund - Follows the S&P Health Care Sector.",
            "The Industrial Select Sector SPDR Fund - Follows the S&P Industrial Sector.",
            "The Materials Select Sector SPDR Fund - Follows the S&P Materials Sector.",
            "The Technology Select Sector SPDR Fund - Follows the S&P Technology Sector.",
            "The Utilities Select Sector SPDR Fund - Follows the S&P Utilities Sector."
        ],
        [
            "Liquidity",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5",
            "5"
        ],
        [
            "Volatility",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ]
    ],
    "pageTitle": "DecisionPlus.com - ETF List",
    "title": "",
    "url": "http://www.decisionplus.com/en/education/etf_list.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 391142211,
    "recordOffset": 391122421,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "RUSSELL Index, U.S. Market DireXion Shares Bond Market International Russell Commodities Dow Jones Index Principal US Markets ProShares ETFs (NYSE) Dow Jones Industrial Average DJI Dow Jones - Diamonds Market Vector / Commodities Vector / Currencies Other Sectors Principal S&P Sectors S&P 500 US Market Select Sector SPDRs ETFs \"SPIDERs\" S&P Global Markets MSCI Global Markets Real Estate Global Real Estate U.S. Commodities Standard and Poor's (S&P) US RUSSELL Prefered, Select, Dividend, Value and Growth DOW JONES iShares US ETF US Ishare trading on TSX International Fixed Income Special Funds Canadian Market Sectors IShare CDN ETF Dow Jones Index and Futures Contracts Canadian Indices Betapro ETF List of Exchange Traded Funds (ETF) FrançaisMy BillsCreate an AliasReal Time Interviews •    |  |  |",
    "textAfterTable": "S&P/TSX 60 Large Cap, tend to correspond to the price and yield of the underlying index (TX60)* 2 2 T-HIX BETAPRO S&P/TSX 60 Invers Index S&P/TSX 60 Large Cap, weighted at 100% of the revers value of the underlying index (TX60)* 2 2             T-HEU BETAPRO Energy Bull Energy S&P/TSX Energy Sector, weighted at 200% of the underlying index (TTEN)* 2 4 T-HED BETAPRO Energy Bear Energy S&P/TSX Energy Sector, weighted at 200% of the reverse value of the underlying index (TTEN)* 2 4 T-HIE BETAPRO TSX ENERGY Invers Energy S&P/TSX Capped Energy Sector Index, weighted at 100% of the reverse value of the underlying index (TTEN) 1 1             T-HFU BETAPRO Finance Bull Finance S&P/TSX Financial Sector, weighted at 200% of the underlying index (TTFS)* 1 3 T-HFD BETAPRO Finance Bear Finance S&P/TSX Financial Sector, weighted at 200% of the reverse value of the underlying index (TTFS)* 1 3 T-HIF BETAPRO TSX FINANCIAL Inv Finance S&P/TSX Capped Financials Sector Index, weighted at 100% of the reverse value of the underlying index (TTFS) 1 1             T-HGU BETAPRO Gold Bull Gold S&P/TSX Gold Sector, weighted at 200% of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}