{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "The Project"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/11/09/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 711242063,
    "recordOffset": 711171404,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5454=ADELE FERGUSON The federal government's 2012 energy white paper, was released on Thursday with great fanfare. Spoiler alert - there is nothing revolutionary in it.}",
    "TableContextTimeStampAfterTable": "{247062=2117 views, 266751=November 08 2012, 7000=RICHARD ACKLAND Rituals in colleges are nothing new. I was there in 1966. The primitive notion was that humiliations would give new boys a sense of belonging. Traditions would keep us all together., 254035=Marco, Nov 8, 2012, 9:32PM, 253088=alicemiranda, Nov 8, 2012, 11:13PM, 167856=Gap-toothed beauty Georgia May Jagger intends to party up a storm in Sydney this weekend., 102891=Entries now open! Event on Sunday, November 11.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: This series, based on Chris O'Dowd's childhood, suffers from a lack of focus. Moone Boy What's on TV Tonight Click here to find out how to win one of three 32GB iPhone 5’s. Win an iPhone 5 Stay Connected Race fans step out in style for the race that stops a nation. Click for more photos Melbourne Cup day in Brisbane Frocks and fillies Your chance to claim exclusive signed Supanova merchandise. Win Supanova merchandise Competitions",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane The Project 5 am - 6 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30 am - 9 am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}