{
    "relation": [
        [
            "Location",
            "Edit Delete Edit localized... View CVT Charleston",
            "Edit Delete Edit localized... View CVT Washington, D.C.",
            "Edit Delete Edit localized... View CVT James Island",
            "Edit Delete Edit localized... View CVT Montclair"
        ],
        [
            "Start date",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "End date",
            "-",
            "-",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Stephen Colbert - Freebase",
    "title": "",
    "url": "http://www.freebase.com/en/stephen_colbert?timestamp=this%20year&type=/music/track?links=",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00183-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463223559,
    "recordOffset": 463162106,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{287087=Stephen Tyrone Colbert is an American political satirist, writer, producer, television host, actor, media critic, and comedian. He is the host of Comedy Central's The Colbert Report, a satirical news show in which Colbert portrays a caricatured version of conservative political pundits. On April 10, 2014, Colbert was chosen to succeed David Letterman as the host of the Late Show on CBS after Letterman retires in 2015. Colbert originally studied to be an actor, but became interested in improvisational theatre when he met famed Second City director Del Close while attending Northwestern University. He first performed professionally as an understudy for Steve Carell at Second City Chicago; among his troupe mates were comedians Paul Dinello and Amy Sedaris, with whom he developed the sketch comedy series Exit 57. Colbert also wrote and performed on the short-lived Dana Carvey Show before collaborating with Sedaris and Dinello again on the cult television series Strangers with Candy. He gained considerable attention for his role on the latter as closeted gay history teacher Chuck Noblet. [undefined] [ - ]}",
    "lastModified": "Thu, 30 Jul 2015 010:55:25 UTC",
    "textBeforeTable": "Web Link(s) (deprecated) /common/topic/webpage View history Query by property Flag as reviewed Flag as having unknown values Flag as having no values Add new value Stephen Tyrone Colbert ( /koʊlˈbɛər/ or /ˈkoʊlbərt/; born May 13, 1964) is an American political... Article (deprecated) /common/topic/article View history Query by property Flag as reviewed -",
    "textAfterTable": "Add new value Flag as having no values Flag as having unknown values Flag as reviewed Query by property View history Clicker.com ID (TV) /common/identity/clicker_tv_id - Add new value Flag as having no values Flag as having unknown values Flag as reviewed Query by property View history Guardian UK Tag /common/identity/guardian_uk_tag -",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}