{
    "relation": [
        [
            "UNDERGRADUATE PROGRAM",
            "Natural Resource Management (Land Surveying)",
            "Natural Resource Management and Ecology (Fisheries & Aquaculture)",
            "Neuroscience",
            "Nuclear Engineering",
            "Nuclear Medicine Technology"
        ],
        [
            "DEGREE",
            "BS",
            "BS",
            "BS",
            "BSNE",
            "BS"
        ],
        [
            "INSTITUTION",
            "Glenville State College",
            "Louisiana State University",
            "University of Alabama at Birmingham",
            "University of Tennessee, Knoxville",
            "Old Dominion University"
        ],
        [
            "INST. STATE",
            "WV",
            "LA",
            "AL",
            "TN",
            "VA"
        ]
    ],
    "pageTitle": "Academic Common Market Undergraduate Programs",
    "title": "",
    "url": "https://www.mhec.state.md.us/higherEd/acadAff/AcademicCommonMarket/commonmarketundergraduateprograms.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988048.90/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 932689123,
    "recordOffset": 932671756,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Return to top SC Coastal Carolina University BFA Musical Theatre GA University of Georgia BMUS Music Therapy KY University of Louisville BMT Music Therapy TN University of Memphis BM Music Industry (Recording Technology) TN University of Memphis BM Music Industry (Music Business) VA Radford University BM Music (Music Therapy Concentration VA Old Dominion University BS Modeling and Simulation Engineering WV West Virginia University BS Mining and Civil Engineering (Dual Degree) WV West Virginia University BS Mining Engineering KY University of Kentucky BS Mining Engineering SC Coastal Carolina University BS Middle Level Education KY Eastern Kentucky University BS Middle Grades Education AL University of South Alabama BS Meteorology KY University of Kentucky, Lexington BS Merchandising, Apparel and Textiles VA Old Dominion University BSET",
    "textAfterTable": "Return to top UNDERGRADUATE PROGRAM DEGREE INSTITUTION INST. STATE Ocean & Earth Science (Geology or Oceanography concentration) BS Old Dominion University VA Occupation and Technical Studies (Fashion Merchandising) BS Old Dominion University VA Occupational Safety BS Fairmont State University WV Optical Engineering BS Norfolk State University VA Return to top UNDERGRADUATE PROGRAM DEGREE INSTITUTION INST. STATE Petroleum Engineering BS Louisiana State University LA Petroleum and Natural Gas Engineering BS West Virginia University WV Photojournalism BA Western Kentucky University KY Physical Education (Athletic Coaching Ed) BS West Virginia University WV Printing Management Technology BS West Virginia University Institute of Technology WV",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}