{
    "relation": [
        [
            "Best Squad",
            "Drew Brees",
            "Alfred Morris",
            "DeAngelo Williams",
            "Michael Crabtree",
            "Greg Jennings",
            "Jimmy Graham",
            "Titans D/ST",
            "Blair Walsh",
            "",
            ""
        ],
        [
            "",
            "29",
            "39",
            "33",
            "29",
            "24",
            "17",
            "36",
            "15",
            "",
            "222"
        ],
        [
            "\"Dream Team\"",
            "Aaron Rodgers",
            "Arian Foster",
            "Ray Rice",
            "Calvin Johnson",
            "Andre Johnson",
            "Ron Gronkowski",
            "49ers D/ST",
            "Stephen Gostkowski",
            "",
            ""
        ],
        [
            "",
            "28",
            "17",
            "0",
            "7",
            "14",
            "10",
            "11",
            "4",
            "",
            "91"
        ],
        [
            "Choke Artists",
            "Cam Newton",
            "Darren McFadden",
            "Ray Rice",
            "Larry Fitzgerald",
            "AJ Green",
            "Vernon Davis",
            "Packers D/ST",
            "Nate Kaeding",
            "",
            ""
        ],
        [
            "",
            "10",
            "5",
            "0",
            "1",
            "2",
            "0",
            "-5",
            "0",
            "",
            "13"
        ]
    ],
    "pageTitle": "The Deadspin 2012-2013 Fantasy Football Awards",
    "title": "",
    "url": "http://deadspin.com/5980239/the-deadspin-2012-2013-fantasy-football-awards",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 64504311,
    "recordOffset": 64462246,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{631=The Brady Award: Given to the quarterback with the highest point total. Named after Tom Brady for his record-breaking 2007 performance., 1325=For records from 1970 to 2002, check out our original post., 4911=A few months ago, we compiled a Fantasy Football Almanac of results from 1970 to 2011. Now we're ready to update the almanac for the 2012 season, with awards for the best players and some new data as well. Take a look, then add your comments, analyses, quibbles, and rants in the discussion below., 401=The 2012 Brady Award goes to Drew Brees, whose 5,177 yards and 43 touchdowns both led the league. His 19 interceptions allowed Tom Brady and Aaron Rodgers to come within just a few points of his 346 total. Those three quarterbacks have won every Brady Award for the last six years, with each winning twice.}",
    "TableContextTimeStampAfterTable": "{10734=The Beuerlein Award: Given to the player who provided the most value with respect to where fantasy owners drafted him. I used My Fantasy League's average draft position (ADP) records, which date back to 1999, to estimate the draft spot, and VBD to estimate value. The award is named after Steve Beuerlein, the first winner., 1776=The 2012 Smith Award goes to Adrian Peterson, who out-rushed his nearest competitor by over 400 yards. His overall point total, 307, would certainly have been higher had the rest of the Vikings offense cooperated. This is Peterson's first Smith Award in his third nomination., 8879=The 2012 Tomlinson Award goes to Adrian Peterson, whose 191 VBD beat out rookie Doug Martin's by 45. The top six players by VBD were all running backs this year, and only one quarterback appears in the top 10., 27614=The Vick Award: Given to the player with the best fantasy performance on Monday Night Football. Named after Michael Vick for his 49-point game in 2010., 16950=The 2012 Cannon Award goes to Doug Martin for his 51-point performance against Oakland. Martin became the ninth player since the merger to put up 50 points in one game, and his total was the highest since Clinton Portis's record 55 against the Chiefs in 2003. Russell Wilson and Dez Bryant put up the best QB and WR totals in Weeks 15 and 16, respectively, which may have won a few fantasy owners the championship., 31346=Now for a closer look at the 2012 season. Here are three hypothetical fantasy teams from the 2012 season. Each has one quarterback, two running backs, two wide receivers, one tight end, and one kicker. The first, \"Best Squad,\" consists of the best possible players from that particular week, giving you the maximum score in ESPN standard leagues. \"Dream Team\" consists of the highest-drafted active players at each position for that week. \"Choke Artists\" consists of the worst possible active players you could start for that particular week who were drafted top 10 at their position., 11332=The 2012 Beuerlein Award goes to Alfred Morris, the Redskins' running back. Early in the year, it looked like Robert Griffin III, Morris's fellow rookie and teammate, would be a shoo-in after being drafted 78th on average. But Morris overtook him in the long haul—he finished with a VBD of 124 (fifth overall) despite an ADP of 132. That means the average 12-team league waited 11 full rounds to pick him., 13923=The 2012 Goodell Award goes to Larry Fitzgerald. Fitzgerald was the second wideout drafted on average, which may have paid off in leagues that award points for running routes well. But neither Arizona nor his fantasy owners got any credit for him because of the vaudeville troupe—John Skelton, Kevin Kolb, Brian Hoyer, a cryogenically frozen Sammy Baugh—that ran the offense this year. He finished 42nd overall among wide receivers despite playing the full season. Fitz gets the Goodell over middling running backs LeSean McCoy and Darren McFadden because of a few spaced-out quality performances that kept him in fantasy lineups. Roger Goodell was another close runner-up, but no one expected anything out of him., 3939=The 2012 Rice Award goes to Calvin Johnson, who becomes the first player since Marvin Harrison to win the award twice in a row. Johnson broke the NFL record with 1,964 yards, but his low touchdown total (five) allowed Brandon Marshall to come within a few points of beating him., 6089=The 2012 Christensen Award goes to Jimmy Graham, who put up 152 points despite struggling with a dislocated finger in the last half of the season. Graham fought off Rob Gronkowski, who came within nine points of a repeat after putting up a record 241 in 2011., 7985=The Tomlinson Award: Given to the player who has the highest value with respect to his position. The award is named after LaDanian Tomlinson for his 2006 season. Value is measured in VBD, which stands for \"Value Based Drafting.\" VBD takes the player's point total and subtracts the point total of the baseline starter at that position. PFR's VBD calculation uses the 12th best QBs and TEs, the 24th best RB, and the 30th best WR as the baseline starters. It also adjusts the totals for years with shorter schedules. While the exact value of VBD can vary depending on the baseline level, the important thing is that it allows us to compare across positions. It's the best stat for a basic MVP award., 27869=The 2012 Vick Award goes to Cam Newton for putting up 37 against Philly in Week 12. Newton compiled 358 total yards and four touchdowns. It was a meaningless game, but Newton's performance probably knocked a number of fantasy teams out of the playoffs.}",
    "textBeforeTable": "The 2012 Brady Award goes to Drew Brees, whose 5,177 yards and 43 touchdowns both led the league. His 19 interceptions allowed Tom Brady and Aaron Rodgers to come within just a few points of his 346 total. Those three quarterbacks have won every Brady Award for the last six years, with each winning twice. The Brady Award: Given to the quarterback with the highest point total. Named after Tom Brady for his record-breaking 2007 performance. Advertisement For records from 1970 to 2002, check out our original post. No fantasy scoring system is more valid than any other, but we used the following, from Pro Football Reference's fantasy stats page: 1 point per 25 yards passing, 1 point per 10 yards rushing/receiving, 6 points per touchdown, and -2 points per interception. The raw stats are also based on PFR's numbers. PFR and Chase Stuart of Football Perspective provided us with some extra stats for this edition, for which we're very grateful. Last week, Drew suggested someone compile a record book for fantasy football. Here's a start:… Read more Read more",
    "textAfterTable": "310 2008 DeAngelo Williams 284 2009 Chris Johnson 347 2010 Arian Foster 330 2011 Ray Rice 303 2012 Adrian Peterson 307 The Rice Award: Given to the wide receiver with the highest point total. Named after Jerry Rice, who won the award eight times in 10 years. The 2012 Rice Award goes to Calvin Johnson, who becomes the first player since Marvin Harrison to win the award twice in a row. Johnson broke the NFL record with 1,964 yards, but his low touchdown total (five) allowed Brandon Marshall to come within a few points of beating him. Year Name Points 2003 Randy Moss 267 2004 Muhsin Muhammad 238 2005 Steve Smith 237 2006 Marvin Harrison 209 2007 Randy Moss 287 2008 Larry Fitzgerald 215 2009 Andre Johnson 212 2010 Brandon Lloyd 209 2011 Calvin Johnson 265 2012 Calvin Johnson 220 The Christensen Award: Given to the tight end with the most points. Named after Todd Christensen, who won the award four years in a row. The 2012 Christensen Award goes to Jimmy Graham, who put up 152 points despite struggling with a dislocated finger in the last half of the season. Graham fought off Rob Gronkowski, who came within nine points of a repeat after",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}