{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe surroundings, emergency post all over the campus, security guards around but out of sight.",
            "All types and ages work well at Polk State College.",
            "Like all schools out of state prices are high, but, overall the school has a way to help out its students with short term loans.",
            "Many school groups to choose from with activities that intertwine with each other.",
            "New updated cafeteria warm and relaxing environment, feels like home.",
            "Some professors are very strict some are not so much but they always have your best interest at heart.",
            "Take advantage of the professor's open door policy and the learning center with tutors in every area.",
            "Outstanding Nursing program who's professors' are well versed in their field of expertise. Polk state college encourages your potential because they see what may not be visible to the individual."
        ]
    ],
    "pageTitle": "Polk State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Polk-State-College/reviews?_escaped_fragment_=/show/68471",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912698699,
    "recordOffset": 912631906,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3880=If you are a Florida resident you will save a lot of money. Financial Aid is great, so please sign up for it on the first of every January. It will help you save from money. Trust me., 374352=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/17/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 98 Faith from Bartow, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students This school is great for any type of student. From the ones that did horrible in high school from the ones that did great in high school. Bang for the buck If you are a Florida resident you will save a lot of money. Financial Aid is great, so please sign up for it on the first of every January. It will help you save from money. Trust me. Am enjoying being here I like the school and all. but everybody is doing something. I don't really have friends. I am pretty much by myself, but then again I am not a bubbly person that just go up to people. Other than that PSC is a enjoyable place. Am learning a lot I am learning a lot it PSC. I am actually learning things that i should learned in high school. The teachers are very patient. I recommend this school. Login to rate or flag the reviews Jenny from Winter Haven, FL 08/02/2012 Reviewer is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}