{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have never felt unsafe anywhere on campus, but there is always a risk especially at night, anywhere you go.",
            "Not a part of.",
            "Join the outdoors club!",
            "If you like frats and sororities, this is your place. Other than that, there are many, many people who do not choose to go greek and you can meet a ton of people in class, at parties, in the dining hall, in the dorms, etc.",
            "Our campus is not all that big, but most students would tell you that all of downtown as the campus.",
            "Charleston is comparitively not as expensive as many other public schools, and I think it's a no brainer.",
            "Discover the city!! Folly beach",
            "It's okay, but not fantastic. Fine for freshman year.",
            "Living in the dorms is the best way to meet your fellow classmates as a freshman.",
            "The classes can be challenging, but if you put in an average amount of time and effort you will succeed.",
            "Do your research because some majors have more to offer than others.",
            "College of Charleston has a plethora of intelligent professors who are willing to help the students reach their goals. It is in a great location, in the heart of downtown historic Charleston. The weather is fantastic, and the student body is a close-knit group of people."
        ]
    ],
    "pageTitle": "College of Charleston (C of C) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-of-Charleston/reviews?_escaped_fragment_=/show/94973",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896682855,
    "recordOffset": 896570873,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{587628=CofC is currently my #1 school and I can't wait to attend in the fall of 2015. The campus is beautiful, the shopping is great, and can you say beach?, 394318=It is amazing, the teachers generally care and are willing to help you learn and understand and enjoy the class. The work load is difficult, but manageable. I have met amazing people here from all over the world and will be sad to graduate in May., 275087=Food is great you can never get tired of it. May need a little old people food but it is not ever bad. Always has different options for food., 34422=Great school, beautiful girls, and awesome weather. its a great college experience. oh and does the ratio 70:30 girls to guys sound good?, 33163=people who like history, partying, or interested in business, hospitality, or Marine BIO. It's primarily a girls school with the 70:30 ratio, works for me :), 625918=© 2015, Cappex.com, LLC, 584270=Living off campus in a house with some friends is ideal for the most fun but they have on campus dorms that are nice as well but get ready to spends 1000 dollars a month or more, 561543=I live is Berry Dorm, which is currently all female. However, in 2014-2015, it will become the Honors Dorm. The rooms are quite long and L shaped. The dorms are nice, the only complaints people have are dependent on their roommate issues. Make sure to fill out the questionnaire and email people, even though it is awkward and like online dating! My room mate and I did it and we are best friends and have never had a single problem or fight! The dorm also has a joining bathroom. The mirror is huge, that is the bonus! The windows do not open in Berry. The walls are drywall, you are not allowed to hammer in or hang things, however, there are holes and everyone hangs pictures anyway. Also the drywall makes it feel homier. Bring plenty of lamps and extension cords because there are no ceiling lights and there are only two 4plug outlets in the corners by the beds. Also bring a shelf for your desk because there is no shelving or drawers connected to the desk. The common room comes with a mini fridge and unless all 4 or 6 people are going to use it, there is really no need to bring another fridge. Other than that, Berry is nice!!, 63928=The graduation ceremony at CofC is quite unusual. Caps and gowns are not worn. Instead, spring graduates wear white dresses / dinner jackets. December graduates wear black dresses / tuxedos.}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 41 out of 41 people found this review useful. 1 of 131 Sophomore Biology Major Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot The professors at CofC are willing to work with their students in any way possible to make sure they are learning the material and understand how to apply it to everyday life. Small class sizes of about 20 students per class are really helpful in providing one on one time with professors if desired. It's also helful that the professors learn every student by name. Professors are readily available via email and set office hours. Also, most of the professors are willing to meet with students outside of office hours if the student is not available to meet with them during the set hours. CofC also has a tutoring center that provides labs in Spanish and French, all mathematics through Calculus, and a writing lab. CofC also provides supplamental courses weekly for the most challeging courses, and private tutors for most other courses free to students. Login to rate or flag the reviews Laura, who is an Astrophysics/Biology major, who is at CofC 01/08/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 3 of 131",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}