{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,115 topics 2,124,899 replies",
            "85,556 topics 1,153,849 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,760 replies",
            "5,996 topics 75,812 replies",
            "50,547 topics 466,215 replies",
            "22,766 topics 196,303 replies",
            "4,270 topics 60,453 replies",
            "1,127 topics 8,216 replies",
            "3,602 topics 115,461 replies"
        ],
        [
            "Last Post Info",
            "Why C*, why? By Startug A minute ago",
            "Revenge or Deal? [POTENTIAL... By lol232 18 minutes ago",
            "Why does this game receive... By Sayuri 8 hours ago",
            "Whats your favourite radio... By LilithAkuma 8 hours ago",
            "Unique Vehicles By Militia 17 hours ago",
            "San Andreas with gamepad help By zmudziak32 An hour ago",
            "Something that has always b... By xNCx 26 minutes ago",
            "How to pronounce his name. By Spadge007 An hour ago",
            "What do you hate of GTA 2? By Cerium 25 minutes ago",
            "F*ck ,Marry,Kill By SuperGTFan 41 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=118&t=280997&p=4282828",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103237231,
    "recordOffset": 103213717,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12304=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 13870=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47253=Pavle, Yahoo, Midnight Hitman, Ritu85, StuTheDude, super_slav, Halal Cyborg, Google, jrl51592, pigeons99, Daniel MCH, UwotMate, sivispacem, Bing, SuperGTFan, Ledorus, RideEmOut2, Procopius, TIMSTER777, josephene123, JCX1992, ant1greeny, universetwisters, Jawz_cod, Startug, REXX93, SeekingAsylum, McH2Oz2, Zello, AcidRunner, Liquid715, A8ul99, Andyzoot, __TheGovernor__, uncaged, Craank_AG, Engman97, THE_ENDRMAN_007, dalerum, Between3and20chars, B Dawg, -Velox, KCYuri, DISTRICT7642, GeneralSteve93, TexasRocks, Jerome, phattoni, TDWP_Adam, Twisted vR, ledzep71, MatthewH, EvilDog77, Teezo, ApexReclaimer, ClareXoBearrx3, Stoned Hillbilly, alexthingy, xTOMMYTROJANx, darthYENIK, Mach1bud, GB981, marshallbslayer, s2n vaniish, zz latios, Speccy, CoCkPuNcH, silverharbinger, SilentSeasons, Electrogypsy, Fuzzknuckles, Rytuklis, SirBurka_, customkingpimp, lydianduck, Trentallica, Ermacs, CarimboHanky, Econobrick, saikolemon, Claude Liberty, TheRealCMPUNKFan, TOOMtheRaccoon, Markuza97, Google Mobile, Juicyfer, Lebowski_RS, JayJay77, OGLuke, Vassago1988, Pooyan Cyrus, AbeTheGreaser, Ganton, Maikou, saintsrow, Tossin Salad, Legomanarthur, elhazard1790000, Th3MaN1, Nightmare3883, GTA_Matt24, Honch777, Matias_Montanna, 2Chains4Bracelets, ~Joseph~, Failure, gtuned, Spaghetti Cat, Richgang, The House Chef, DonSpeedy, Cripto136, TheIceWarrior, Hyde Original, MikeyDLuffy, Turbocharger, TheMcSame, IAmTheWhiteDeath, Dan_Houser_Official, Cognoscenti, xInfamousRYANx, lcordadoro, dewtech_2008, Pat, Voltool16, Andreas, UndyingBubbles, silentkiller44, Bms842, denis1379, Gabriel_175, Pettyium117, AgentExeider, Los Santos citizen, LeopardGecko, MaazS, Yan22, badboykiller, Psylo0, zzACE91zz, Choco Taco, Max Payne, NotTodayyJunior, jdwarfer, jollythecat, Bootels, Fozzie_420, r.lorenzo13, Dufus, BisP, Freeman.BIO, Willplanb_, TimmyM56, Felix_tornado, Bodgetastic, toxluv, Retired Mafia, ap4321, Furry_Monkey, NadoVargas, ThaUglyCupcake, Vice City criminal, CeasarGuy, Omar_DmX, Kiyone_Alien_Cop, Skeve613, Summertime, VRZD, Cjs3315, Prodigy_Rocks_, TomPN, paperbagdude, Haashir911, Vadim M., afrocan, CxmberLyfe, VikDarkbomb, DentureDynamite, Bob_Dole, fajar_abdillah, DavidJamesMathie2013, WinkingSkeever6, CrossPT, levendis, Twin Turbo, DusterGoliath, sh0rtyuk, michael99420, Smooth Longsack, HoleInTheSky, Mastah, Reyks, Anachronistic, Officer Vic, FRArom, RoyalSyndLuke, XCalinX, hotelyankee, M4k3, Darrel, icecoldkilla1467, Stoney0503, Husani, Richardbrown30, DJS, feckyerlife, Miss Malevolent, Rooster1983, TristanAnderson, fac316, Superfrogger, theNGclan, Marwin, Receptor, Hover_Mode, Girish, RmpTebow15, statistic, Spectacus, epoxi, hyperar, MrSaucyZ, Souris, Bondergomme, CCPD, WacoKid614, conedotexe, nehctik, Target13, Cornphlake, Epic., A Siente, Cudwieser, Nerfgoth, Edward Nashton, k2x, psymin, Luucky, BenStone, BlackMilk, DennisStanistan, Craigsters, garza337, GoodTimesAhead, TempleOfLight, Slash3r9, Mrgrandis_HKG, kalle55, Zulxer, Daemian, GrandReaping, Chris Dogg, fazedevil, guster-von, Y_Draig_Bryste, bama764, Stephan90, rockstarfanboy1987, Azazel, MaeSengE, _CP_, Apodiense, PaulDPearl, BeckermannDewitt, Latemodelchild, Madame Choucroute, rea12345, four0nefive, SpreeMurder, XMarqstheSpot, crashrock2, djflashpoint, Faultierspy79, brad476, wildy4444, lol232, J-B, Rusty Balls, Cop_21, ZiggZagg420, Choppers, PaMu1337, doubleg213, ClaudX, Bo Gotti, TG_Stig, Black_MiD, Cool Username, Chloroform, JSnipe135i, TheTechPoTaToCHIP, slashjaw26, Masiku, Chekoloco, funmw2, fabio3, Dan McChill, thebrianmo, xXaerorapidzXx, HipsterHillbilly, kBlaise, SatournFan, henriquedematos, 18412=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16180=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9171=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 127570=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20640=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 9 minutes ago By theNGclan Roman Bellic Enterprises 613,434 replies 15,203 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By CoCkPuNcH [PS3] Vehicle Requests/Duping 2,283,577 replies 113,407 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides & Strategies,",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,464 topics 416,625 replies Fixing the targeting of peds By Hover_Mode 9 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}