{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,113 topics 2,124,886 replies",
            "85,556 topics 1,153,848 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,760 replies",
            "5,996 topics 75,812 replies",
            "50,547 topics 466,215 replies",
            "22,766 topics 196,302 replies",
            "4,270 topics 60,453 replies",
            "1,127 topics 8,215 replies",
            "3,602 topics 115,461 replies"
        ],
        [
            "Last Post Info",
            "[SPOILERS] Anyone felt sad... By thedriver111 5 minutes ago",
            "Where is Roman's Cab De... By Mr. Fahrenheit An hour ago",
            "Why does this game receive... By Sayuri 8 hours ago",
            "Whats your favourite radio... By LilithAkuma 8 hours ago",
            "Unique Vehicles By Militia 17 hours ago",
            "San Andreas with gamepad help By zmudziak32 28 minutes ago",
            "Any Other Setting/Theme The... By Spadge007 4 hours ago",
            "How to pronounce his name. By Spadge007 53 minutes ago",
            "What do you hate of GTA 2? By Jeansowaty 5 hours ago",
            "F*ck ,Marry,Kill By SuperGTFan 8 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=58&t=553272&p=1062531475",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104943579,
    "recordOffset": 104921387,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47471=Bing, rea12345, Google, Pat, ChickenAndBeer, Google Mobile, catcha_rown_brown, GeorgeZhang, carlittoo, Dufus, lolleroz, Legomanarthur, joe grizzly, triplem, Flesh-n-Bone, Niobium, LuizLopezIV, BenStone, Yahoo, Don Maximus Meridius, THE_ENDRMAN_007, Twin Turbo, l25806, whywontyoulisten, Miro, 7nvd, direct_UA, Fuzzknuckles, penguinhero, DiemessGTA, gtasadude, KemikalMbalinsce, Retired Mafia, Husani, del__cielo, Pavle, CMCSAVAGE, BlackMilk, hitman774, Skeve613, A8ul99, Ninja Budgie, TheDominoEffect, stonedpimpso, //XP//, Hyde Original, Jinx., Lebowski_RS, Crimson Flam3s, 1omenzoa, RICHIEB91, Craank_AG, StayTrue, thafablifee46, Laguezmer, TheMcSame, SuperGTFan, DumbForum, StepNaza, s2n vaniish, Malcot, epoxi, ramin728, Blackhailer, RafaeShe, Andreas, marshallbslayer, Darrel, MrManquet, Smooth Longsack, drzayas, Cudwieser, Cool Username, Pettyium117, BiscuitTheCat59, TovarishTony, GipsyDanger MK2, theminted, gtuned, REXX93, fabio3, xNCx, adra12, joe_alker, FowardElement, Captain Sensib1e, iamcornholio, CoCkPuNcH, MrSaucyZ, VercettiGuy, Imposssible, Irisframe, Mega, DentureDynamite, michael99420, elfoam, TheOddGamerYT, Azazel, DerpCat, SpaceJunk, psymin, Dexter_Raminus, Wscratch, Ganton, Nerfgoth, Loves GTA, TyphoonJames, Days Are Gone, ambiency, MRMBF, Superfrogger, MrRyanMcCall, Svip, erkwang, Lc gta, Kahkenbols, obv23, -RONIN-, iBUCKEYE, TacoSmuggler, jdwarfer, statistic, zmudziak32, jollythecat, Nova6754, Remix1994PL, JohnnyCallisto, WWEMichaelB, fear_the_nut70, Edward Nashton, Tossin Salad, xTOMMYTROJANx, Haashir911, Sveittjpong, jrl51592, ZeroSafe5615, pigeons99, frodzet, PokeMasterPablo, blacknambala, Thousand Accent, feckyerlife, emelen, SSJEavan747, Reywas1, CCPD, fazedevil, toxluv, Hello7734, C4R3ON, darthYENIK, Clark., PrisionerPlay503, Shmoopy, GodHatesKittens, VikDarkbomb, Punkdaz, Ya Boi, AzO, Slasherr, Slam_Jones, BeckermannDewitt, CMGreger, RazorRain, Fozzie_420, FicZGB, flyer2359, gta4_player, Edmachine, Max Payne, Failure, DevilfishRAW, XCalinX, flcon02, paperbagdude, Daemian, fluffydude51, Ledorus, Hjaere, madmax4073, U.N.K.N.O.W.N, Thomas BB, scottmacdougall, pinche_mayos, CH14R1, Drunkmoons, -Velox, prodojojo, Stoney0503, Z i X, tepi5512, schafter, TDWP_Adam, x_FRoe__, mrtommygunwhite, ashbashbluesfan, SaL_Leone, knightsgarage, sleepwalk1980, Hunter241, deadx23, Tadzik, Antigenetic, josephene123, meta187, joe1606, Luke juh, Red Lynx 23, ktek01, The Duke35, Furry_Monkey, lord tammerlain, Vinewood Villain, Honker1944, enix, josehatesyou, m2roadwarrior, omerdn1, waters, Weazel__03, shadowkill98, Jeansowaty, Electrogypsy, R.Rezzrax, jazzbone, marhex, Linchpin636, NBAKingzFan10, allinclusive, Zodape, uncaged, Huraldo, badmoon, Vassago1988, K-ROSE, MotelGuy, Forty-Five-Auto, TexasRocks, CrossPT, Kalasky, erased, frequentlyfly, walkingsickness, Vaymasters, AdusPL, Compeast, Th3MaN1, Cheesimus, FUBAR1991, Hades_, soundism, Mach1bud, Black_MiD, ~TKP~, Ermacs, qwerasdzxc, el_charco, Biira99, SuperVeloce, Cognoscenti, Jax765, Shadowfennekin, Viezo, gunziness, MarshallRawR, jp9865, ironMANx956, Alvarez, Fox2Quick, RayBanNeonColors420, gizmo, Killerman29, Wolf of Velka, silverharbinger, cjarvis15, Shaundi., Fireman, Axe_Gaijin, Frantz Fuchs, r.lorenzo13, JeepXJFreak98, MR.V8, TimmyM56, Juicyfer, DonSpeedy, ghilliesuit101, BendingB, Holo fenix, Gantons Most Wanted, Nick1020, Nathan46970, Gamerjman19, laskaland, 12492=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16368=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18603=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 9382=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20723=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14058=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 122458=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 3 minutes ago By thedriver111 Facade Corporation 613,424 replies 15,203 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By KemikalMbalinsce Ugliest Supercar 2,283,532 replies 113,406 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides & Strategies, Gameplay,",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,463 topics 416,625 replies San Andreas Verona beach sa... By ZAZ 40 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}