{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,113 topics 2,124,888 replies",
            "85,556 topics 1,153,848 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,760 replies",
            "5,996 topics 75,812 replies",
            "50,547 topics 466,215 replies",
            "22,766 topics 196,303 replies",
            "4,270 topics 60,453 replies",
            "1,127 topics 8,216 replies",
            "3,602 topics 115,461 replies"
        ],
        [
            "Last Post Info",
            "Trevor Phillips appreciatio... By Midnight Hitman A minute ago",
            "Where is Roman's Cab De... By Mr. Fahrenheit An hour ago",
            "Why does this game receive... By Sayuri 8 hours ago",
            "Whats your favourite radio... By LilithAkuma 8 hours ago",
            "Unique Vehicles By Militia 17 hours ago",
            "San Andreas with gamepad help By zmudziak32 38 minutes ago",
            "Something that has always b... By xNCx 3 minutes ago",
            "How to pronounce his name. By Spadge007 An hour ago",
            "What do you hate of GTA 2? By Cerium 3 minutes ago",
            "F*ck ,Marry,Kill By SuperGTFan 18 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=72&t=407951&p=1059293926",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105417051,
    "recordOffset": 105395266,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13914=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 119996=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47284=Bing, VikDarkbomb, Google, Pavle, Deus Ex, Husani, bama764, Cool Username, Yahoo, GTAandStuff, esato, ralf_s, Anachronistic, The Mysterious One, GodHatesKittens, Zulxer, Earleys, whywontyoulisten, lexustt, KlIIUMlNATl, kBlaise, jrl51592, l25806, gtuned, toxluv, xNCx, CCPD, StuTheDude, Pettyium117, Saintdestroyer, badboykiller, PrE233, Don Maximus Meridius, Speccy, marhex, Google Mobile, Firefly8000, SpreeMurder, GTBunny, joe grizzly, REXX93, Bob_Dole, Ry595, Fuzzknuckles, super_slav, Imposssible, bruvs-mcfc, Blackhailer, oXMidnightSinXo, DrunkenMunkey78, psymin, rea12345, pigeons99, Choco Taco, TOOMtheRaccoon, Ganton, SSJEavan747, missanthropy, josephene123, Smooth Longsack, Max Payne, SuperGTFan, Craigsters, stanky77, A8ul99, dewtech_2008, thatmobster, Vassago1988, The Yokel, iamcornholio, Claude Liberty, Andreas_XTC, SirFiras47, Hover_Mode, FishyDriftGTA, Damiazo, marshallbslayer, RedDagger, dog2mad, RafaelSousaSam, SkittyM, RandomCholo, Drunkmoons, DavidTheThird, RafaeShe, carlittoo, Midnight Hitman, CZGTAmaniac0404, adra12, Nerfgoth, arewenotmen, THE_ENDRMAN_007, Crimson Flam3s, Busta93, Axe_Gaijin, Edmachine, Ieech, xInfamousRYANx, luisniko, nls_whs_2010, saikolemon, fish61324, guster-von, Wybo76, Zondar, Hunter54711, GeorgeZhang, Flesh-n-Bone, Niobium, Tossin Salad, Pat, ClaudX, jollythecat, Quinn_flower, Ledorus, fazedevil, XCalinX, mrtommygunwhite, Apodiense, Markuza97, lolleroz, Wscratch, C06alt, ramin728, doubleg213, mamoac, fabio3, -Velox, UNH1NG3D, p-s-3x, Cognoscenti, gamefriik200, v17, Huraldo, MRMBF, topkek, SKARFACE, //XP//, Lowi, Hello7734, LewisVee, obv23, C4R3ON, darthYENIK, Daemian, WestsideResider, Twin Turbo, FicZGB, Lonely_Screwdriver, Vaniox9, Hyde Original, Jinx., Souris, epoxi, Red Lynx 23, GTA4LIFE9000, Anarckhy, Ivan1997GTA, Epic., feckyerlife, 7nvd, gunziness, yojc, aLucidMind, Legomanarthur, TexasRocks, Malcot, elfoam, VRZD, Ya Boi, Antigenetic, penguinhero, jdwarfer, Slash3r9, Retired Mafia, svanderman, cmp2005, Slasherr, VideoGameJames, s2n vaniish, AtikiN, *Lola, DiemessGTA, Tilley, triplem, MrManquet, SpaceJunk, DonSpeedy, silverharbinger, FrikkenZz, alexguirre, Lebowski_RS, Miro, thafablifee46, I Love Anna Kournikova, stef_92, frodzet, 7 day survivor, Dirty.Hairy, The Intellect, Shabazz916, Kahkenbols, Fozzie_420, 1omenzoa, gtasadude, LuizLopezIV, BlackMilk, tails_prower_2040, ChickenAndBeer, MythAlex, StayTrue, Gtaultimatefanboy, BenStone, WWEMichaelB, Cerium, Ninja Budgie, zmudziak32, direct_UA, catcha_rown_brown, Dufus, KemikalMbalinsce, del__cielo, CMCSAVAGE, hitman774, Skeve613, TheDominoEffect, stonedpimpso, RICHIEB91, Craank_AG, Laguezmer, TheMcSame, DumbForum, StepNaza, Andreas, Darrel, drzayas, Cudwieser, BiscuitTheCat59, TovarishTony, GipsyDanger MK2, theminted, joe_alker, FowardElement, Captain Sensib1e, CoCkPuNcH, MrSaucyZ, VercettiGuy, Irisframe, Mega, DentureDynamite, michael99420, TheOddGamerYT, Azazel, DerpCat, Dexter_Raminus, Loves GTA, TyphoonJames, Days Are Gone, ambiency, Superfrogger, MrRyanMcCall, Svip, erkwang, Lc gta, -RONIN-, iBUCKEYE, TacoSmuggler, statistic, Nova6754, Remix1994PL, JohnnyCallisto, fear_the_nut70, Edward Nashton, xTOMMYTROJANx, Haashir911, Sveittjpong, ZeroSafe5615, PokeMasterPablo, blacknambala, Thousand Accent, emelen, Reywas1, 20686=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16224=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 12348=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9238=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18459=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Pavle Facade Corporation 613,430 replies 15,203 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Skeve613 Getting out of bad sport 2,283,551 replies 113,406 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,463 topics 416,625 replies San Andreas Verona beach sa... By ZAZ 50 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}