{
    "relation": [
        [
            "Forum",
            "Woodworking Skill Share Your woodworking skills are displayed for several lifetimes in each project. Have you had to compromise your project...",
            "Woodturning On the lathe, by the lathe: do you have questions? frustrations? tips? This forum is for all the woodturners out there.",
            "Woodcarving Relief, 3D, chip-carving, whittling; carving knives, chisels, pocket-knives, power tools. If you are a carver or want...",
            "Scrollsawing Intarsia, fretwork, intricate design cutting and more! This forum is for scrollsawers: share your tips, ask questions...",
            "Joinery Have a question? a tip/strategy to share? a challenge, perhaps? Share your \"joinery\" discussion here.",
            "Finishing The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questio...",
            "Designing Woodworking Projects Looking for information on designing your projects? Having difficulties reading project plans? Looking for help with ...",
            "Power Tools, Hardware and Accessories Are you unsure of which tools, or hardware, you need, or which brands to buy? Investing in tools and hardware can be ...",
            "CNC Woodworking Questions and answers about CNC machines, tooling, best practices, and projects.",
            "Hand Tools Wood, your hand tools, you and a little know-how. Share your questions, tips and strategies for the use and maintenan...",
            "Jigs & Fixtures Using a jig is like having a couple extra hands helping out. Show us your jigs, share your tips, strategies and, of c...",
            "Wood & Lumber Different wood requires different woodworking strategies - from cutting to finishing. Share your tips and challenges ...",
            "Safety in the Woodworking Shop Before you pick up those woodworking tools, take the time to ensure your safety in the shop! Eyes, ears, fingers, and...",
            "Focus on the Workspace Are you looking for or do you have tips to share regarding the workshop? Storage, equipment placement, efficiency, an...",
            "Sweating for Bucks Through Woodworking If you are selling your work, then you have entered a woodworking dimension with added complexity and stress. If you...",
            "Woodworking Trade & Swap All of us are holding onto treasure in our shops, that we either don't need, don't want, or could part with if presen...",
            "LumberJocks.com Site Feedback Connect with the Website Gurus and tell us what you are thinking, suggestions, problems, functionality issues, and so...",
            "Coffee Lounge Need a break from all the standing and wood dust? Chat with your Forum Friends about their projects, their life, thei..."
        ],
        [
            "Topics",
            "10485",
            "1085",
            "222",
            "204",
            "691",
            "3224",
            "5099",
            "21942",
            "71",
            "3851",
            "999",
            "4653",
            "1118",
            "1563",
            "1036",
            "3792",
            "1951",
            "7767"
        ]
    ],
    "pageTitle": "Finishing Forum @ LumberJocks.com ~ woodworking community",
    "title": "",
    "url": "http://lumberjocks.com/forums/11?page=55",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988310.3/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 150535131,
    "recordOffset": 150514896,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17336=02-22-2014 02:30 PM by bigblockyeti, 35417=©2015 Verticalscope Inc. All Rights Reserved. | Terms of Service | Privacy Policy, 14050=02-25-2014 03:10 PM by kimosawboy, 10807=02-24-2014 07:15 PM by rowjoe76, 19031=01-27-2014 05:52 PM by Steamboat_Willie, 9179=02-27-2014 07:31 PM by HarveyDunn, 15720=02-24-2014 02:46 PM by GregD, 21514=02-21-2014 12:12 AM by Charlie75, 22358=04-09-2012 12:03 PM by Chris_Smith, 12449=02-26-2014 08:41 PM by JCMeyersIV, 19886=02-22-2014 10:03 PM by Accidentprone315, 12613=I bought a home in October right across from my parents house. Decided to sav..., 20699=02-22-2014 07:52 PM by dunk, 18191=02-21-2014 05:16 PM by TheWoodenOyster, 11611=02-27-2014 04:37 AM by squarehippo, 14917=02-18-2014 04:42 AM by lumberjoe, 23213=06-11-2013 05:25 PM by Eddie, 8338=02-27-2014 09:01 PM by BubingaBill, 13249=02-26-2014 01:25 PM by kooldecker, 7509=03-01-2014 04:09 PM by TheWoodenOyster, 16509=02-24-2014 03:57 AM by Tommy, 9987=02-28-2014 02:40 AM by Betasig588}",
    "textBeforeTable": "Show all forums View unanswered topics Start new topic The finish, whether paint, wax, stain, or something else, can make or break a project. What are your tips and questions regarding finishes? googletag.cmd.push(function() { googletag.display('LumberJocks_com_300x250_TopLeft1_HG_Content'); }); googletag.cmd.push(function() { googletag.display('LumberJocks_com_300x250_TopLeft_HG_Content'); }); googletag.cmd.push(function() { googletag.display('LumberJocks_com_300x250_TopRight3_HG_Content'); }); googletag.cmd.push(function() { googletag.display('LumberJocks_com_300x250_TopRight2_HG_Content'); }); googletag.cmd.push(function() { googletag.display('LumberJocks_com_300x250_TopRight1_HG_Content'); }); googletag.cmd.push(function() { googletag.display('LumberJocks_com_300x250_TopRight_HG_Content'); });",
    "textAfterTable": "Topics Replies Last post Cloudy Wipe-on Poly 03-01-2014 04:09 PM by TheWoodenOyster Hey guys, I need a little help/advice with a finishing issue. Here is t... 3 03-01-2014 04:54 PM Flocking the details 02-27-2014 09:01 PM by BubingaBill Hi again gang,I’m working on my latest cue case and after designing and... 21 02-28-2014 08:05 PM Which kinds of finish sit on the surface without penetrating? 02-27-2014 07:31 PM by HarveyDunn I’m trying to sort through all my options for finishing a project. I wa... 9 02-28-2014 07:01 PM Exterior finish for plywood chair 02-28-2014 02:40 AM by Betasig588 I am trying to put together a few modern adirondack chairs for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}