{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,136 topics 2,125,315 replies",
            "85,560 topics 1,153,955 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,763 replies",
            "5,996 topics 75,815 replies",
            "50,549 topics 466,249 replies",
            "22,767 topics 196,313 replies",
            "4,273 topics 60,488 replies",
            "1,127 topics 8,219 replies",
            "3,605 topics 115,549 replies"
        ],
        [
            "Last Post Info",
            "The Editor Showcase By JANTSUU A minute ago",
            "GTA IV confessions By Doctor Ray 11 minutes ago",
            "Why does this game receive... By Sayuri A day ago",
            "The Ultimate 100% Save File... By Militia An hour ago",
            "Favorite Gang By Mr. Fahrenheit 14 hours ago",
            "Crack dealer killing spree. By Phoenix_Poop 39 minutes ago",
            "Reasons why Vice City is be... By UshaB 3 hours ago",
            "Grand Theft Auto III Chain... By stef_92 46 minutes ago",
            "What are the cops actually... By Cerium 5 hours ago",
            "GTA VI: Satire vs. Realism,... By NightSpectre 14 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=43&t=555780&p=1062498318",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 118081183,
    "recordOffset": 118058519,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12385=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9321=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18444=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 16317=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14103=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47475=Google, UltimateAntic, SCKXX, Jawaty, Bing, CarimboHanky, Yahoo, IIOctaneII, Fenton, LukeMayhem, The Yokel, Owl Man, Craigsters, FourthLegion, unknown57, zakace, Ganton, Fozzie_420, //XP//, Kaber, thebreak, Officer Vic, maskedrobbery, Chipsman, Pavle, crashoverride93, BlackHeartedGovernor, stonedpimpso, SuperGTFan, Schleemil, jgarehart, Cool Username, Nyraider77, robban, uNi, luisniko, B Dawg, digitalclips, cdjen93, Bob_Dole, MyName'sJeff, Ermacs, Jinx., Startug, supanaut, GTA4LIFE9000, Menaced, thehambone, Osho, shadowski, Gtaonlinelegitplayer14, soundism, ZiggZagg420, JANTSUU, A8ul99, SNL, SirBurka_, GTAandStuff, Meista, degas93, jrl51592, Lebowski_RS, Xenome13, CarlitoDorito, Doc302, TJGM, WhitePimp, psymin, gecko_sniper, m2roadwarrior, Google Mobile, AboveAndBeyoncé, BlackMilk, killstreakmx, Starpaul20, LordRaijin, MagellanFall, Mr. Fahrenheit, Death Anghell, Goatman72, Red Lynx 23, Colbydogs, Doomscream, allinclusive, Mona Sax, coachcolbert, The Hero, p-s-3x, Johnny Playert, SidSid, dkluin, Daequil, Nem Wan, Fuzzknuckles, MrKush, PS3KillsThe360, DumbForum, Ivan1997GTA, Capa, Volta Flawless XB1, thatmobster, Wizz man 21, athande, Luke juh, Rafli, Doctor Ray, silentkiller44, DannyMan, Th3MaN1, toxluv, TXCamber, mobe, bite, ZyDevs, Facebook, jollythecat, Intergalactic Pimp, ghoraaa, Above Omnipotence, ash-274, JuniorDosPepsi, Andreas, Gummy , hellfire_cthulhu, shadowkill98, TCMike, GKID7891, waters, Smale45, STEEZYR, wowsux133, T.V. Eye, Fubbick, The_GTA, kuusko, Ledorus, SuperHolySheep, BlackRuiner, zzr, The Duke35, Pyro_Indigo, Bluntnation94, Grizzly322, Smooth Longsack, Marwin, CM-Punk, w-tal, SneakyPenguin91, BengeyBoy, gil62291, Kaito Katsumi, Gridl0k, GTA SIX, DVDFMerlin, Ethenal, vladeisan, Bender.ㅤ, Luvythicus, Icantthinkofonew, Chang, SchoolOfHardKnocks, Payne Killer, thewhitehammer99, quadro09, miles2195, CMCSAVAGE, Earleys, ten-a-penny, MrDashiki, Captain Sensib1e, PhillBellic, StefcioPL, Daniel MCH, ZAZ, lolznc, Jax765, evoluon--720, gfen, Fox2Quick, hannerfall, minhto360, LiangHuBBB, gmwahiid, Otter, NotAHipster, SparkyMark01, MisterEd, Furry_Monkey, BoomBapPoet, SaL_Leone, lol232, JoeFury1997, DragonSpade, Los Santos citizen, Sea Bear, JaegerPilot1, Siegemulacra, Yus, 8888, PrisionerPlay503, Jonsic, REXX93, TexasRocks, Shadowfennekin, Lubas, Thecomrade9, Gabriela_L, TG_Stig, shaz7770, NightSpectre, GypsyBastard, r.lorenzo13, Laguezmer, ZeroSafe5615, John Smith, GTAKid667, Nugsy, hitman774, 104622=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20574=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By maskedrobbery The Paleto Bay Mayors Offic... 613,602 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By JaysonVoorhees 50% off Technical and Mule 2,285,159 replies 113,461 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,649 replies Stunt Plane Smoke improvements By thewhitehammer99 10 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}