{
    "relation": [
        [
            "Citing Patent",
            "US5177507 *",
            "US5237655 *",
            "US5611024 *",
            "US5724086 *",
            "US5796411 *",
            "US5808655 *",
            "US5822656 *",
            "US5828814 *",
            "US5949438 *",
            "US6384928",
            "US6992459 *",
            "US20020067150 *",
            "EP0869428A2 *",
            "WO1998011503A1 *"
        ],
        [
            "Filing date",
            "Mar 28, 1991",
            "Jul 5, 1990",
            "Aug 28, 1992",
            "May 12, 1995",
            "Jul 10, 1995",
            "May 12, 1995",
            "Nov 7, 1997",
            "Sep 10, 1996",
            "Dec 23, 1997",
            "Mar 31, 1998",
            "Nov 20, 2001",
            "Nov 20, 2001",
            "Mar 31, 1998",
            "Sep 2, 1997"
        ],
        [
            "Publication date",
            "Jan 5, 1993",
            "Aug 17, 1993",
            "Mar 11, 1997",
            "Mar 3, 1998",
            "Aug 18, 1998",
            "Sep 15, 1998",
            "Oct 13, 1998",
            "Oct 27, 1998",
            "Sep 7, 1999",
            "May 7, 2002",
            "Jan 31, 2006",
            "Jun 6, 2002",
            "Oct 7, 1998",
            "Mar 19, 1998"
        ],
        [
            "Applicant",
            "Eastman Kodak Company",
            "Eastman Kodak Company",
            "Compaq Computer Corporation",
            "Eastman Kodak Company",
            "Moore Business Forms, Inc.",
            "Eastman Kodak Company",
            "Fujitsu Limited",
            "Moore Business Forms, Inc.",
            "Moore Business Forms, Inc.",
            "Canon Kabushiki Kaisha",
            "Canon Kabushiki Kaisha",
            "Akitoshi Kikuchi",
            "Canon Kabushiki Kaisha",
            "Moore Business Forms Inc"
        ],
        [
            "Title",
            "Small segment electrostatographic image recorder",
            "Raster image processor for all points addressable printer",
            "Data compression of bit map images",
            "Printhead having data channels with revisable addresses for interleaving scan lines",
            "High resolution real time raster image processing system and method",
            "Interleaving thermal printing with discontiguous dye-transfer tracks on an individual multiple-source printhead pass",
            "Image forming apparatus in which a plurality of image segments are integrated into complete image",
            "Reduced cost high resolution real time raster image processing system and method",
            "High resolution real time Raster image processing system and method",
            "Image processing apparatus and system",
            "Stepping motor controlling apparatus and method, and image reading apparatus and method",
            "Stepping motor controlling apparatus and method, and image reading apparatus and method",
            "Image processing apparatus and system",
            "High resolution real time raster image processing system and method"
        ]
    ],
    "pageTitle": "Patent US5109476 - Color printer with synchronous and asynchronous stages - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5109476?dq=5,266,072",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475803599,
    "recordOffset": 475780302,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The invention has been described in detail with particular reference to preferred embodiments thereof, but it will be understood that variations and modifications can be effected within the spirit and scope of the invention. A paper supply 70 holds a number of receiver sheets. Single sheets are fed from the paper supply and passed between four transfer rollers such as roller 72 and the photosensitive drums so that each components color toner image is transferred to the receiver sheet. The receiver sheet then passes through a fuser 74 where the image is fixed. After leaving the fuser, the receiver sheet is fed onto a receiving platform 76. After each band of data is written, the photosensitive drums are indexed to present a new surface for writing. The time interval between indexes is varied as necessary by the data processing from the raster image processor. This procedure of writing and indexing is continued until the page of file is finished and all data for a particular file is transmitted to the marking engine from the raster image processor. FIGS. 4 and 5 illustrate a second embodiment of a four-color marking engine 60 in accordance with the present invention. Four cartridges similar to cartridge 62 contain four different colored toner development stations. Four small printheads such as printhead 64, each with an intrack linear array of L.E.D. elements are moved axially along four photosensitive drums such as drum",
    "textAfterTable": "US5611024 * Aug 28, 1992 Mar 11, 1997 Compaq Computer Corporation Data compression of bit map images US5724086 * May 12, 1995 Mar 3, 1998 Eastman Kodak Company Printhead having data channels with revisable addresses for interleaving scan lines US5796411 * Jul 10, 1995 Aug 18, 1998 Moore Business Forms, Inc. High resolution real time raster image processing system and method US5808655 * May 12, 1995 Sep 15, 1998 Eastman Kodak Company Interleaving thermal printing with discontiguous dye-transfer tracks on an individual multiple-source printhead pass US5822656 * Nov 7, 1997 Oct 13, 1998 Fujitsu Limited Image forming apparatus in which a plurality of image segments are integrated into complete image US5828814 * Sep 10, 1996 Oct 27, 1998 Moore Business Forms, Inc. Reduced cost high resolution real time raster image processing system and method US5949438 * Dec 23,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}