{
    "relation": [
        [
            "Citing Patent",
            "US7627326 *",
            "US8014337",
            "US8055213 *",
            "US8498237",
            "US8504099",
            "US8542658",
            "US8553644",
            "US8595501",
            "US8626062 *",
            "US8743843",
            "US8750261",
            "US8750262",
            "US8750868",
            "US8755362",
            "US8774846",
            "US8787323",
            "US8804677",
            "US8811369",
            "US8848914 *",
            "US8879519",
            "US8879520",
            "US8885572 *",
            "US8902820 *",
            "US8902860",
            "US8902864",
            "US8902865",
            "US8902866",
            "US8923317",
            "US20100080167 *",
            "US20100124331 *",
            "US20110237183 *"
        ],
        [
            "Filing date",
            "Oct 14, 2005",
            "Oct 27, 2008",
            "Nov 6, 2006",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "May 9, 2008",
            "Dec 23, 2008",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Oct 7, 2008",
            "Nov 18, 2008",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jun 27, 2006",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jan 10, 2007",
            "Jun 27, 2006",
            "Nov 18, 2008",
            "Dec 23, 2008"
        ],
        [
            "Publication date",
            "Dec 1, 2009",
            "Sep 6, 2011",
            "Nov 8, 2011",
            "Jul 30, 2013",
            "Aug 6, 2013",
            "Sep 24, 2013",
            "Oct 8, 2013",
            "Nov 26, 2013",
            "Jan 7, 2014",
            "Jun 3, 2014",
            "Jun 10, 2014",
            "Jun 10, 2014",
            "Jun 10, 2014",
            "Jun 17, 2014",
            "Jul 8, 2014",
            "Jul 22, 2014",
            "Aug 12, 2014",
            "Aug 19, 2014",
            "Sep 30, 2014",
            "Nov 4, 2014",
            "Nov 4, 2014",
            "Nov 11, 2014",
            "Dec 2, 2014",
            "Dec 2, 2014",
            "Dec 2, 2014",
            "Dec 2, 2014",
            "Dec 2, 2014",
            "Dec 30, 2014",
            "Apr 1, 2010",
            "May 20, 2010",
            "Sep 29, 2011"
        ],
        [
            "Applicant",
            "At&T Corp.",
            "Motorola Solutions, Inc.",
            "Samsung Electronics Co., Ltd.",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Telefonaktiebolaget L M Ericsson (Publ)",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Koninklijke Philips N.V.",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Koninklijke Philips Electronics, N.V.",
            "Qualcomm Incorprated",
            "Telefonaktiebolaget L M Ericsson (Publ)"
        ],
        [
            "Title",
            "Spectrum management system for municipal spectrum using guided cognitive radio",
            "Method and system for wireless multi-hopping communication",
            "Method for dynamic frequency selection and system supporting the same in a cognitive radio wireless communication system",
            "Methods and apparatus for communicating device capability and/or setup information",
            "Communication methods and apparatus relating to cooperative and non-cooperative modes of operation",
            "Support for wide area networks and local area peer-to-peer networks",
            "Wireless communication methods and apparatus supporting different types of wireless communication approaches",
            "Network helper for authentication between a token and verifiers",
            "Method and an arrangement for determining an admission control threshold",
            "Methods and apparatus relating to timing and/or synchronization including the use of wireless terminals beacon signals",
            "Encoding beacon signals to provide identification in peer-to-peer communication",
            "Communications methods and apparatus related to beacon signals some of which may communicate priority information",
            "Communication methods and apparatus related to wireless terminal monitoring for and use of beacon signals",
            "Wireless communication methods and apparatus supporting paging and peer to peer communications",
            "Methods and apparatus relating to wireless terminal beacon signal generation, transmission, and/or use",
            "Wireless communication methods and apparatus supporting synchronization",
            "Methods and apparatus for establishing communications between devices with differing capabilities",
            "Methods and apparatus for supporting multiple communications modes of operation",
            "Spectrum authorization and related communications methods and apparatus",
            "Wireless communication methods and apparatus supporting peer to peer communications",
            "Wireless communication methods and apparatus supporting wireless terminal mode control signaling",
            "Wireless communication methods and apparatus using beacon signals",
            "Handshaking method and apparatus for OFDM systems with unknown sub-channel availability",
            "Wireless communication methods and apparatus using beacon signals",
            "Choosing parameters in a peer-to-peer communications system",
            "Wireless communication methods and apparatus supporting multiple modes",
            "Communication methods and apparatus which may be used in the absence or presence of beacon signals",
            "Wireless device discovery in a wireless peer-to-peer network",
            "Handshaking method and apparatus for ofdm systems with unknown sub-channel availability",
            "Spectrum authorization and related communications methods and apparatus",
            "Method and an arrangement for determining an admission control threshold"
        ]
    ],
    "pageTitle": "Patent US7167463 - System and method for creating a spectrum agile wireless multi-hopping network - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7167463?dq=6,243,373",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465724027,
    "recordOffset": 465693370,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26595=More sophisticated ad-hoc networks are also being developed which, in addition to enabling mobile nodes to communicate with each other as in a conventional ad-hoc network, further enable the mobile nodes to access a fixed network and thus communicate with other mobile nodes, such as those on the public switched telephone network (PSTN), and on other networks such as the Internet. Details of these advanced types of ad-hoc networks are described in U.S. Pat. No. 7,072,650 entitled “Ad Hoc Peer-to-Peer Mobile Radio Access System Interfaced to the PSTN and Cellular Networks”, granted on Jul. 4, 2006, in U.S. Pat. No. 6,807,165 entitled “Time Division Protocol for an Ad-Hoc, Peer-to-Peer Radio Network Having Coordinating Channel Access to Shared Parallel Data Channels with Separate Reservation Channel”, granted on Oct. 19, 2004, and in U.S. Pat. No. 6,873,839 entitled “Prioritized-Routing for an Ad-Hoc, Peer-to-Peer, Mobile Radio Access System”, granted on Mar. 29, 2005, the entire content of each being incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Although only a few exemplary embodiments of the present invention have been described in detail above, those skilled in the art will readily appreciate that many modifications are possible in the exemplary embodiments without materially departing from the novel teachings and advantages of this invention. Accordingly, all such modifications are intended to be included within the scope of this invention as defined in the following claims. Furthermore, the cost associated to spectrum information can be used also to avoid using resources that are financially expensive to the user, operator or some other entity. Additionally, a fast spectrum license revocation technique can be performed using a beacon signal or by flooding a data packet indicating resource revocation through the network 100 as soon as one node 102, 106 or 107 receives information about the revocation. For example, if one node (e.g., a node 102) receives revocation information from an IAP 106, for example, the node 102 propagates this revocation information through the network 100 using a data packet flood or beacon signal. This ability is useful, for example, in emergency situations when the purpose of the spectrum usage changes abruptly. In addition, in a multi hopping network 100, the beacon can be used to enable nodes, such as mobile nodes 102 or wireless routers 107, to indicate the availability of the rule data to other neighboring nodes 102 or 107. This capability is beneficial",
    "textAfterTable": "US5687194 Apr 22, 1993 Nov 11, 1997 Interdigital Technology Corporation Subscriber RF telephone system for providing multiple speech and/or data signals simultaneously over either a single or a plurality of RF channels US5696903 Apr 29, 1994 Dec 9, 1997 Norand Corporation Hierarchical communications system using microlink, data rate switching, frequency hopping and vehicular local area networking US5701294 Oct 2, 1995 Dec 23, 1997 Telefonaktiebolaget Lm Ericsson System and method for flexible coding, modulation, and time slot allocation in a radio telecommunications network US5706428 Mar 14, 1996 Jan 6, 1998 Lucent Technologies Inc. Multirate wireless data communication system US5717689 Oct 10, 1995 Feb 10, 1998 Lucent Technologies Inc. Data link layer protocol for transport of ATM cells over a wireless link US5745483 Sep 29, 1995 Apr 28, 1998 Ricoh Company, Ltd. Wireless computer network communication system and method having at least two groups of wireless terminals US5774876 Jun 26, 1996 Jun 30, 1998 Par Government Systems Corporation Managing assets with active electronic",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}