{
    "relation": [
        [
            "Citing Patent",
            "US7792860",
            "US7949647",
            "US7970791",
            "US8005828 *",
            "US8082278",
            "US8214394",
            "US8423195",
            "US8484184",
            "US8595255",
            "US8626692 *",
            "US8661012 *",
            "US8667004",
            "US8819052 *",
            "US8977644",
            "US9037567 *",
            "US9081816",
            "US20100268702 *",
            "US20110238645 *",
            "US20120095949 *",
            "US20140337312 *",
            "EP2725515A1 *"
        ],
        [
            "Filing date",
            "Mar 25, 2005",
            "Nov 26, 2008",
            "Mar 31, 2010",
            "Feb 5, 2008",
            "Jun 13, 2008",
            "",
            "Oct 29, 2009",
            "Apr 27, 2011",
            "May 30, 2012",
            "Oct 14, 2010",
            "Dec 29, 2006",
            "Nov 30, 2007",
            "Oct 29, 2010",
            "Jan 16, 2014",
            "Apr 14, 2010",
            "Oct 23, 2013",
            "",
            "Oct 29, 2010",
            "Oct 14, 2010",
            "Jul 23, 2014",
            "Oct 23, 2013"
        ],
        [
            "Publication date",
            "Sep 7, 2010",
            "May 24, 2011",
            "Jun 28, 2011",
            "Aug 23, 2011",
            "Dec 20, 2011",
            "Jul 3, 2012",
            "Apr 16, 2013",
            "Jul 9, 2013",
            "Nov 26, 2013",
            "Jan 7, 2014",
            "Feb 25, 2014",
            "Mar 4, 2014",
            "Aug 26, 2014",
            "Mar 10, 2015",
            "May 19, 2015",
            "Jul 14, 2015",
            "Oct 21, 2010",
            "Sep 29, 2011",
            "Apr 19, 2012",
            "Nov 13, 2014",
            "Apr 30, 2014"
        ],
        [
            "Applicant",
            "Oracle International Corporation",
            "Yahoo! Inc.",
            "Oracle International Corporation",
            "Yahoo! Inc.",
            "Microsoft Corporation",
            "Oracle International Corporation",
            "International Business Machines Corporation",
            "Yahoo! Inc.",
            "Oracle International Corporation",
            "Brilliant Arc",
            "Google Inc.",
            "Microsoft Corporation",
            "Ebay Inc.",
            "Google Inc.",
            "Vcvc Iii Llc",
            "Oracle International Corporation",
            "Evri, Inc.",
            "Ebay Inc.",
            "Brilliant Arc",
            "Ebay Inc.",
            "VeriSign, Inc."
        ],
        [
            "Title",
            "System for change notification and persistent caching of dynamically computed membership of rules-based lists in LDAP",
            "Navigation assistance for search engines",
            "Re-ranking search results from an enterprise system",
            "Learning query rewrite policies",
            "Generating query suggestions from semantic relationships in content",
            "Propagating user identities in a secure federated search system",
            "Power consumption projection",
            "Navigation assistance for search engines",
            "Propagating user identities in a secure federated search system",
            "Knowledge based method and system for local commerce",
            "Ensuring that a synonym for a query phrase does not drop information present in the query phrase",
            "Providing suggestions during formation of a search query",
            "Traffic driver for suggesting stores",
            "Collaborative search results",
            "Generating user-customized search results and building a semantics-enhanced search engine",
            "Propagating user identities in a secure federated search system",
            "Generating user-customized search results and building a semantics-enhanced search engine",
            "Traffic driver for suggesting stores",
            "Knowledge based method and system for local commerce",
            "Traffic driver for suggesting stores",
            "Privacy preserving data querying"
        ]
    ],
    "pageTitle": "Patent US20070208714 - Method for Suggesting Web Links and Alternate Terms for Matching Search Queries - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20070208714?dq=5,222,134",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00151-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479411319,
    "recordOffset": 479340275,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6504=FIG. 15 shows steps of an exemplary method 1500 for authenticating a user in accordance with one embodiment. In such a method, identity information is received for a user attempting to log into the system 1502. This can be any arbitrary information used by any identity management system to validate a user. The identity information is provided to a set of authentication APIs that each are operable to act as an interface for a respective identity management system 1504. The user is then validated for at least one identity management system 1506, else denied access to the secure enterprise system. For a valid user, a call back is made into the appropriate identity management system(s) to obtain security roles, groups, and other information associated with the user 1508. It is understood that this information can change over time and may need to be refreshed as discussed elsewhere herein.}",
    "TableContextTimeStampAfterTable": "{31167=This application claims priority to U.S. Provisional Patent Application Ser. No. 60/778,151 and U.S. Provisional Patent Application Ser. No. 60/777,988, both filed Mar. 1, 2006, as well as U.S. Provisional Patent Application Ser. No. 60/800,737, filed May 16, 2006, each of which is hereby incorporated herein by reference., 32841=U.S. patent application No. ______, filed ______, entitled “LINK ANALYSIS FOR ENTERPRISE ENVIRONMENT,” [ATTY DOCKET 021756-034800US];, 31889=U.S. patent application Ser. No. ______, filed ______, entitled “FLEXIBLE AUTHORIZATION MODEL FOR SECURE SEARCH,” [ATTY DOCKET 021756-034300US];, 32465=U.S. patent application No. ______, filed ______, entitled “PROPAGATING USER IDENTITIES IN A SECURE FEDERATED SEARCH SYSTEM,” [ATTY DOCKET 021756-034600US];, 242008=In most embodiments, the system 4200 includes some type of network 4210. The network may can be any type of network familiar to those skilled in the art that can support data communications using any of a variety of commercially-available protocols, including without limitation TCP/IP, SNA, IPX, AppleTalk, and the like. Merely by way of example, the network 4210 can be a local area network (“LAN”), such as an Ethernet network, a Token-Ring network and/or the like; a wide-area network; a virtual network, including without limitation a virtual private network (“VPN”); the Internet; an intranet; an extranet; a public switched telephone network (“PSTN”); an infra-red network; a wireless network (e.g., a network operating under any of the IEEE 802.11 suite of protocols, GRPS, GSM, UMTS, EDGE, 2G, 2.5G, 3G, 4G, Wimax, WiFi, CDMA 2000, WCDMA, the Bluetooth protocol known in the art, and/or any other wireless protocol); and/or any combination of these and/or other networks., 32078=U.S. patent application No. ______, filed ______, entitled “SEARCH HIT URL MODIFICATION FOR SECURE APPLICATION INTEGRATION,” [ATTY DOCKET 021756-034400US];, 33195=U.S. patent application No. ______, filed ______, entitled “MINIMUM LIFESPAN CREDENTIALS FOR CRAWLING DATA REPOSITORIES,” [ATTY DOCKET 021756-035000US]; and, 103807=When a crawl of this source is initiated in this example, SES will first call the agent to start crawling and fetch URLs. At this time, the crawler plug-in fetches the first valid email user from OID 1208 and uses an API such as the OCSEmailWSClient API 1212 to get all the email folders and download all messages in the folder. The SES crawler will add one DocumentMetaData object which contains the URL for each message or folder to its queue. The DocumentMetaData is returned through the fetch call later when the plug-in checks for the next message in the current user. It then processes the message by downloading the body. The email body is submitted through DocumentContainer object by the crawler plug-in. The crawler framework can handle the email parsing including extracting the attributes like “author”, “from”, “to” and process the attachments. This process is repeated until all the messages under all folders under the user are fetched, then is repeated for the next user obtained from the OID 1208. Once all users and all events are processed, a null is returned for the fetch call, which instructs the SES crawler plug-in to start processing the documents for indexing purposes., 32666=U.S. patent application No. ______, filed ______, entitled “SECURE SEARCH PERFORMANCE IMPROVEMENT,” [ATTY DOCKET 021756-034700US];, 32278=U.S. patent application No. ______, filed ______, entitled “SUGGESTED CONTENT WITH ATTRIBUTE PARAMETERIZATION,” [ATTY DOCKET 021756-034500US];, 33019=U.S. patent application No. ______, filed ______, entitled “SELF-SERVICE SOURCES FOR SECURE SEARCH,” [ATTY DOCKET 021756-034900US];, 31713=U.S. patent application Ser. No. ______, filed ______, entitled “FLEXIBLE AUTHENTICATION FRAMEWORK,” [ATTY DOCKET 021756-034200US];, 33396=U.S. patent application No. ______, filed ______, entitled “AUTO GENERATION OF SUGGESTED LINKS IN A SEARCH SYSTEM,” [ATTY DOCKET 021756-035300US].}",
    "textBeforeTable": "Patent Citations The specification and drawings are, accordingly, to be regarded in an illustrative rather than a restrictive sense. It will, however, be evident that various modifications and changes may be made thereunto without departing from the broader spirit and scope of the invention as set forth in the claims. Storage media and computer readable media for containing code, or portions of code, can include any appropriate media known or used in the art, including storage media and communication media, such as but not limited to volatile and non-volatile, removable and non-removable media implemented in any method or technology for storage and/or transmission of information such as computer readable instructions, data structures, program modules, or other data, including RAM, ROM, EEPROM, flash memory or other memory technology, CD-ROM, digital versatile disk (DVD) or other optical storage, magnetic cassettes, magnetic tape, magnetic disk storage or other magnetic storage devices, data signals, data transmissions, or any other medium which can be used to store or transmit the desired information and which can be accessed by the computer. Based on the disclosure and teachings provided herein, a person of ordinary skill in the art will appreciate other ways and/or methods to implement the various embodiments. The computer system 4300 may also comprise software elements, shown as being currently located within a working memory 4318, including an operating system 4320 and/or",
    "textAfterTable": "US7949647 Nov 26, 2008 May 24, 2011 Yahoo! Inc. Navigation assistance for search engines US7970791 Mar 31, 2010 Jun 28, 2011 Oracle International Corporation Re-ranking search results from an enterprise system US8005828 * Feb 5, 2008 Aug 23, 2011 Yahoo! Inc. Learning query rewrite policies US8082278 Jun 13, 2008 Dec 20, 2011 Microsoft Corporation Generating query suggestions from semantic relationships in content US8214394 Jul 3, 2012 Oracle International Corporation Propagating user identities in a secure federated search system US8423195 Oct 29, 2009 Apr 16, 2013 International Business Machines Corporation Power consumption projection US8484184 Apr 27, 2011 Jul 9, 2013 Yahoo! Inc. Navigation assistance for search engines US8595255 May 30, 2012 Nov 26, 2013 Oracle International Corporation Propagating user identities in a secure federated search system US8626692 * Oct 14, 2010",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}