{
    "relation": [
        [
            "Citing Patent",
            "US6490486 *",
            "US6519490 *",
            "US6721598",
            "US6745081",
            "US6748268",
            "US6748277",
            "US6760619 *",
            "US7020514",
            "US7037273 *",
            "US7130681",
            "US7133718",
            "US7364550",
            "US7479107",
            "US7680532",
            "US7738964",
            "US7903043 *",
            "US7909769",
            "US8046080",
            "US8073540",
            "US8326424",
            "US8540643",
            "US8545435 *",
            "US8619002",
            "US20040260348 *",
            "EP1858407A2 *"
        ],
        [
            "Filing date",
            "Nov 9, 2000",
            "Dec 20, 1999",
            "Aug 31, 2001",
            "Aug 31, 2001",
            "Aug 31, 2001",
            "Oct 11, 2001",
            "Aug 31, 2001",
            "Nov 27, 2002",
            "May 22, 2002",
            "May 9, 2003",
            "Jun 19, 2003",
            "Jun 17, 2004",
            "Oct 25, 2005",
            "Feb 15, 2006",
            "Jan 4, 2006",
            "Dec 22, 2003",
            "Jan 12, 2009",
            "Feb 26, 2010",
            "Jun 21, 2006",
            "Aug 26, 2011",
            "Feb 29, 2008",
            "Mar 11, 2005",
            "Feb 10, 2011",
            "Jun 19, 2003",
            "Feb 17, 2006"
        ],
        [
            "Publication date",
            "Dec 3, 2002",
            "Feb 11, 2003",
            "Apr 13, 2004",
            "Jun 1, 2004",
            "Jun 8, 2004",
            "Jun 8, 2004",
            "Jul 6, 2004",
            "Mar 28, 2006",
            "May 2, 2006",
            "Oct 31, 2006",
            "Nov 7, 2006",
            "Apr 29, 2008",
            "Jan 20, 2009",
            "Mar 16, 2010",
            "Jun 15, 2010",
            "Mar 8, 2011",
            "Mar 22, 2011",
            "Oct 25, 2011",
            "Dec 6, 2011",
            "Dec 4, 2012",
            "Sep 24, 2013",
            "Oct 1, 2013",
            "Dec 31, 2013",
            "Dec 23, 2004",
            "Nov 28, 2007"
        ],
        [
            "Applicant",
            "Pacesetter, Inc.",
            "Joseph Wiesel",
            "Pacesetter, Inc.",
            "Pacesetter, Inc.",
            "Pacesetter, Inc.",
            "Pacesetter, Inc.",
            "Pacesetter, Inc.",
            "Joseph Wiesel",
            "Cardiac Pacemakers, Inc.",
            "Medtronic, Inc.",
            "Medtronic, Inc.",
            "Pacesetter, Inc.",
            "Cardiac Pacemakers, Inc.",
            "Joseph Wiesel",
            "Cardiac Pacemakers, Inc.",
            "Cardiac Pacemakers, Inc.",
            "Cardiac Pacemakers, Inc.",
            "Cardiac Pacemakers, Inc.",
            "St. Jude Medical Ab",
            "Cardiac Pacemakers, Inc.",
            "Pacesetter, Inc.",
            "Baxter International, Inc.",
            "Cardiac Pacemakers, Inc.",
            "Bakken Earl E.",
            "Joseph Wiesel"
        ],
        [
            "Title",
            "Implantable cardiac stimulation device and method that monitors displacement of an implanted lead",
            "Method of and apparatus for detecting arrhythmia and fibrillation",
            "Coronary sinus cardiac lead for stimulating and sensing in the right and left heart and system",
            "Coronary Sinus Cardiac Lead For Stimulating and Sensing The Atria of the Right and Left Heart and System",
            "Three lead universal pacing and shocking system",
            "Medical catheter/lead body design and means of manufacture thereof",
            "Two lead universal defibrillation, pacing and sensing system",
            "Method of and apparatus for detecting atrial fibrillation",
            "Core body temperature monitoring in heart failure patients",
            "Use of accelerometer signal to augment ventricular arrhythmia detection",
            "Method and apparatus for temporarily varying a parameter in an implantable medical device",
            "Method and device for motion and noise immunity in hemodynamic measurement",
            "Core body temperature monitoring in heart failure patients",
            "Detecting atrial fibrillation, method of and apparatus for",
            "Telemetry duty cycle management system for an implantable medical device",
            "Radio frequency antenna in a header of an implantable medical device",
            "Carbon dioxide and activity monitoring",
            "Telemetry duty cycle management system for an implantable medical device",
            "Implantable heart stimulating device with stimulation rate optimization",
            "System and method for RF wake-up of implantable medical device",
            "Method and device for motion and noise immunity in hemodynamic measurement",
            "Method and apparatus for providing medical treatment therapy based on calculated demand",
            "Radio frequency antenna in a header of an implantable medical device",
            "Method and apparatus for temporarily varying a parameter in an implantable medical device",
            "Detecting atrial fibrillation, method of and apparatus for"
        ]
    ],
    "pageTitle": "Patent US6249700 - Defibrillator with improved hemodynamic response and enhanced myocardial ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6249700?dq=Xerox+%2B+%22centroid",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484006575,
    "recordOffset": 483975877,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26716=This application is a continuation-in-part of application Ser. No. 08/874,032, filed Jun. 12, 1997, in the name of the same applicant now U.S. Pat. No. 6,096,061.}",
    "textBeforeTable": "Patent Citations Although a best mode currently contemplated for practicing the invention has been described herein, in terms of certain preferred methods and embodiments, it will be recognized by those skilled in the art of the invention that variations and modifications of the disclosed methods and embodiments may be made without departing from the true spirit and scope of the invention. Accordingly, it is intended that the invention shall be limited only by the appended claims and the rules and principles of the applicable law. Stated somewhat differently, the apparatus of the invention constitutes an implantable medical interventional device for responding to detection of any of a plurality of cardiac dysrhythmias in a human patient by performing an appropriate therapy including cardiac pacing, cardioversion or defibrillation according to the nature of the detected dysrhythmia. The device includes a first sensor for detecting any of the plurality of cardiac dysrhythmias, and a generator for developing pulses and shocks for delivery to the patient's heart according to whether the detected dysrhythmia is bradycardia or a relatively slow pathologic tachycardia on the one hand, or a relatively fast tachycardia or fibrillation on the other hand. Optimizing means of the device seeks to maintain at all times a substantial match of the patient's heart rate to the normal rate for a healthy person under like conditions of physical exercise, including relatively minor activity, and rest experienced by the patient. The optimizing means",
    "textAfterTable": "US6760619 * Aug 31, 2001 Jul 6, 2004 Pacesetter, Inc. Two lead universal defibrillation, pacing and sensing system US7020514 Nov 27, 2002 Mar 28, 2006 Joseph Wiesel Method of and apparatus for detecting atrial fibrillation US7037273 * May 22, 2002 May 2, 2006 Cardiac Pacemakers, Inc. Core body temperature monitoring in heart failure patients US7130681 May 9, 2003 Oct 31, 2006 Medtronic, Inc. Use of accelerometer signal to augment ventricular arrhythmia detection US7133718 Jun 19, 2003 Nov 7, 2006 Medtronic, Inc. Method and apparatus for temporarily varying a parameter in an implantable medical device US7364550 Jun 17, 2004 Apr 29, 2008 Pacesetter, Inc. Method and device for motion and noise immunity in hemodynamic measurement US7479107 Oct 25, 2005 Jan 20, 2009 Cardiac Pacemakers, Inc. Core body temperature monitoring in heart failure patients US7680532 Feb 15, 2006 Mar 16, 2010 Joseph Wiesel",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}