{
    "relation": [
        [
            "Citing Patent",
            "US8375307 *",
            "US8823767 *",
            "US8838169 *",
            "US8949283",
            "US8971957",
            "US9015192",
            "US20110177797 *",
            "US20110280383 *"
        ],
        [
            "Filing date",
            "Jun 10, 2010",
            "May 12, 2011",
            "Jan 19, 2010",
            "Dec 23, 2013",
            "Aug 1, 2014",
            "Mar 19, 2014",
            "Jan 19, 2010",
            ""
        ],
        [
            "Publication date",
            "Feb 12, 2013",
            "Sep 2, 2014",
            "Sep 16, 2014",
            "Feb 3, 2015",
            "Mar 3, 2015",
            "Apr 21, 2015",
            "Jul 21, 2011",
            "Nov 17, 2011"
        ],
        [
            "Applicant",
            "Lg Electronics Inc.",
            "Nokia Siemens Networks Oy",
            "Ringcentral, Inc.",
            "Google Inc.",
            "Ringcentral, Inc.",
            "Google Inc.",
            "Ringcentral, Inc.",
            "Nokia Siemens Networks Oy"
        ],
        [
            "Title",
            "Mobile terminal and method for managing e-mail thereof",
            "Delivery of short messages",
            "Provisioning interfaces for accessing virtual private branch exchange services through a mobile device",
            "Systems and methods for clustering electronic messages",
            "Provisioning interfaces for accessing virtual private branch exchange services through a mobile device",
            "Systems and methods for improved processing of personalized message queries",
            "Provisioning interfaces for accessing virtual private branch exchange services through a mobile device",
            "Delivery of short messages"
        ]
    ],
    "pageTitle": "Patent US7958099 - Unified management method of various types of messages of a personal ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7958099?dq=7,177,838",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488130239,
    "recordOffset": 488101447,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31341=This application is a Continuation of U.S. patent application Ser. No. 10/118,943 filed Apr. 10, 2002, now U.S. Pat. No. 7,603,379 which claims the benefit of the Korean Application Nos. 01-19389 and 01-19390 filed Apr. 11, 2001, and Korean Patent Application No. 01-21910 filed Apr. 24, 2001, whose entire disclosure is hereby incorporated by reference.}",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art that various modifications and variations can be made in the present invention without departing from the spirit or scope of the invention. Thus, it is intended that the present invention cover the modifications and variations of this invention provided they come within the scope of the appended claims and their equivalents. The above-explained unified message management method of a personal information terminal makes a user confirm all types of received messages at a time and removes user's inconvenience that a message type to write should be distinguished in advance prior to choosing a message input screen. Owing to the above-explained method, there is no need that a user should choose a message input screen suitable for a message type to transmit. After the user completes a message by filling in necessary information as well as a body message in fields of the message input screen (S84, S89) he or she requests for transmission of the completed message (S85, S90). Then, the message type converting unit 22 delivers the completed message to the POPS/SMTP unit 23 or the SMS format adapting unit 25 which will transmit the received message to a remote side in accordance with a protocol intended by ‘New Mail’ or ‘New Memo’ (S86, S91). or 8. FIG. 7 if identified as SMS message (S83, S88). At",
    "textAfterTable": "US6072862 * Jul 2, 1996 Jun 6, 2000 Srinivasan; Thiru Adaptable method and system for message delivery US6081703 * Oct 23, 1997 Jun 27, 2000 Telia Research Ab Communication system including debiting provisions for communicating with a subsystem that charges a fee US6134432 * Jun 17, 1998 Oct 17, 2000 Bulletin.Net, Inc. System and process for allowing wireless messaging US6151507 * Nov 7, 1997 Nov 21, 2000 Nokia Mobile Phones Ltd. Individual short message service (SMS) options US6175858 * Jul 13, 1998 Jan 16, 2001 At&T Corp. Intelligent network messaging agent and method US6178331 * Jun 17, 1998 Jan 23, 2001 Bulletin.Net, Inc. System and process for allowing wireless messaging US6212550 * Jan 21, 1997 Apr 3, 2001 Motorola, Inc. Method and system in a client-server for automatically converting messages from a first",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}