{
    "relation": [
        [
            "Cited Patent",
            "US3050907 *",
            "US3722981 *",
            "US3980390 *",
            "US4072400 *",
            "US4113350 *"
        ],
        [
            "Filing date",
            "Jun 27, 1958",
            "May 17, 1971",
            "Mar 20, 1975",
            "Jun 4, 1976",
            "Mar 8, 1976"
        ],
        [
            "Publication date",
            "Aug 28, 1962",
            "Mar 27, 1973",
            "Sep 14, 1976",
            "Feb 7, 1978",
            "Sep 12, 1978"
        ],
        [
            "Applicant",
            "American Optical Corp",
            "Bell Telephone Labor Inc",
            "Sumitomo Electric Industries, Ltd.",
            "Corning Glass Works",
            "Telephone Cables Limited"
        ],
        [
            "Title",
            "Method for shaping a fiber optical device",
            "Low melting point optical transmission line",
            "Optical transmission fiber",
            "Buffered optical waveguide fiber",
            "Optical fibre waveguides"
        ]
    ],
    "pageTitle": "Patent US4183621 - Water resistant high strength fibers - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4183621?dq=6437692",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476902251,
    "recordOffset": 476885857,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the water impervious graphite coated fibers of this invention are described specifically for optical communication purposes, this is by way of example only. The water impervious graphite coated fibers of this invention find application wherever high strength fibers may be employed. Other methods such as plasma coating, chemical vapor deposition or vacuum evaporation can also be used when pinhole-free films are to be employed. Carbon is used for the embodiment of this invention because of its light-opacity and lubricating properties. Other forms of graphite-like materials having a carbon or hydrocarbon base can also be employed. One relatively inexpensive method for applying the impervious carbon layer to optical fibers is to employ the pyrolysis in a reducing or inert atmosphere, of a hydrocarbon such as, for example, methane. Various methods can be used to apply the water impervious carbon coatings to optical fibers. A simple method is to direct the optical fibers, during the drawing process and immediately after drawing, into a suspension of colloidal carbon particles in either an alcohol or water suspension to deposit the material and then heating the deposited material to conform the material to the fiber surface. In an attempt to determine whether the chemistry of the water at the surface of the fiber greatly affected the fiber failure rate the following mechanical test was performed. A plurality of pure silica optical fibers were drawn to a diameter of 5 thousandths",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4306897 * Apr 16, 1980 Dec 22, 1981 International Telephone And Telegraph Corporation Method of fabricating fatigue resistant optical fibers US4372792 * Oct 15, 1981 Feb 8, 1983 Bicc Limited Manufacture of a flexible stranded optical fiber body US4410567 * Apr 15, 1982 Oct 18, 1983 Post Office Optical fibres and coatings therefor US4473599 * May 27, 1982 Sep 25, 1984 Aetna Telecommunications Laboratories Process for providing optical fibers conditioned for hostile environments and fibers thus formed US4735856 * Mar 31, 1986 Apr 5, 1988 Spectran Corporation Hermetic coatings for optical fiber and product US4863760 * Oct 26, 1988 Sep 5, 1989 Hewlett-Packard Company High speed chemical",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}