{
    "relation": [
        [
            "Date",
            "Sep 8, 2003",
            "Mar 14, 2005",
            "Mar 13, 2007",
            "Feb 24, 2010",
            "Apr 5, 2010",
            "Mar 5, 2014",
            "Apr 22, 2014",
            "Jul 24, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: WORLDCOM INC., MISSISSIPPI Free format text: CORRECTED COVER SHEET, PREVIOUSLY RECORDED AT REEL/FRAME 013571/0298 (CHANGE OF NAME);ASSIGNOR:MCI WORLDCOM INC .;REEL/FRAME:014481/0771 Effective date: 20000501",
            "Owner name: MCI, INC., VIRGINIA Free format text: CHANGE OF NAME;ASSIGNOR:WORLDCOM, INC.;REEL/FRAME:015769/0571 Effective date: 20040419",
            "Owner name: MCI, LLC, NEW JERSEY Free format text: MERGER;ASSIGNOR:MCI, INC.;REEL/FRAME:019000/0815 Effective date: 20061120",
            "Owner name: MCI, INC.,VIRGINIA Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE NATURE OF CONVEYANCE FROM \"CHANGE OF NAME\" TO \"MERGER\" PREVIOUSLY RECORDED ON REEL 019000 FRAME 0787. ASSIGNOR(S) HEREBY CONFIRMS THE MERGER;ASSIGNOR:WORLDCOM, INC.;REEL/FRAME:023973/0945 Effective date: 20040419",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: VERIZON PATENT AND LICENSING INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCI COMMUNICATIONS CORPORATION;REEL/FRAME:032725/0001 Effective date: 20140409",
            "Owner name: VERIZON PATENT AND LICENSING INC., NEW JERSEY Free format text: CORRECTIVE ASSIGNMENT TO REMOVE THE PATENT NUMBER 5,835,907 PREVIOUSLY RECORDED ON REEL 032725 FRAME 0001. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNMENT;ASSIGNOR:MCI COMMUNICATIONS CORPORATION;REEL/FRAME:033408/0235 Effective date: 20140409"
        ]
    ],
    "pageTitle": "Patent US7117191 - System, method and computer program product for processing event records - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7117191?dq=5,973,252",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988312.76/warc/CC-MAIN-20150728002308-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475577899,
    "recordOffset": 475523657,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6436=Referring back to FIG. 5A, thresholding engine 126 preferably employs a core infrastructure 1310 and a domain-specific implementation 1312. Core infrastructure 1310 includes an enhancer and threshold detection component 509 for applying configurable rules to network event records 506 a and for generating alarms 526 in the event that one or more network event records 506 a violate one or more configurable rules.}",
    "TableContextTimeStampAfterTable": "{188938=Presentation interface 1210 uses enforcer 1218 for performing actions. This is not automatic, as it was in the expert system layer 139. Rather, enforcer 1218 performs actions based on commands from analysts. For example, an analyst can decide that a switch block on an ANI is needed. The analyst, via a workstation 152 a- 152 n, sends a command to presentation interface 1210 requesting a switch-based ANI block. Presentation interface 1210 then instructs enforcer 1218 to execute the command. Enforcer 1218 interfaces with an external action, switch interface system 1220 to implement the ANI switch block. Other external action systems 1220 can be similar to those employed by expert system layer 239., 179170=Prioritization rules may employ suppression techniques to improve the efficiency of fraud identification. Essentially, suppression techniques may be utilized to better filter and separate fraudulent/non-fraudulent cases. Prioritizer 1102 may utilize prioritization rules that consider previous experienced analysts' rulings, or customer behavior as verified by experienced fraud analysts. An example of how a fraud analyst ruling may influence a case priority score is where the fraud analyst decides the information presented in the case indicates non-fraudulent usage. Though the customer behavior as indicated in the case may match a normally fraudulent pattern, by verifying that customer behavior is legitimate, future analysis of that case should reflect that information and prevent re-occurrence of alarming. In this situation, subsequent prioritizations may result in a reduced case priority score for such associated case information. New information will then contribute to an adjusted priority score that considers all case related information, i.e. previously ruled and new information. This type of suppression improves case prioritization and overall false positive rates. An example of how a normal customer behavior can influence a case priority score is where a fraud analyst verifies the case represents a legitimate Dial-1, for example, commercial customer behavior. This case may then be designated as a non-fraudulent or legitimate case, thereby influencing current and subsequent prioritizations by the prioritizer., 130053=Domain-specific implementation 1310 includes enhancement rules and configuration database 512 and a threshold detection rules database 522. Databases 512 and 522 include rules that may be created, deleted or modified according to the evolving needs of a user. Changes to thresholding rules 522 may even be executed while the system is running. When a thresholding rule is created or modified, it will be applied to new events that arrive at the system., 119268=In step 408, network event records 501 are received by normalizer and dispatcher 124. Normalizer and dispatcher 124 preferably includes a core infrastructure 1310 and a user-specific or domain-specific implementation 1312. A normalizer 502 converts network event records 501 from the various formats of the data management layer into standardized formats required by the detection layer., 180748=In step 1016, prioritized fraud cases are analyzed and appropriate actions are specified based on action rules. In determining whether to initiate action on a case, prioritizer 1102 uses action rules which are kept as part of configuration data 1104. An action is a response to suspected fraud and involves an external system. Examples of actions include card deactivation or activation, or use-range privilege modifications. Actions are categorized as automatic, semi-automatic, user initiated, mail initiated or manual. Automatic and semi-automatic actions are initiated by an expert system, following predefined rules. Other actions are typically initiated by human analysts., 63344=As the telecommunications industry rapidly grows, telecommunications fraud also grows. In the United States alone, telecommunication fraud is estimated to have cost three billion dollars in 1995. Telecommunications service providers have experienced difficulty in keeping up with new methods of fraud. As soon as service providers implement new systems to detect current methods of fraud, criminals devise new methods., 177325=In step 1010, fraud cases 916 are sent from analysis layer 133 and received by a prioritizer 1102. Prioritizer 1102 enhances fraud cases 916, assigns priority to them and determines whether any actions should be automatically executed., 119744=In step 410, normalizer 502 uses configuration data 504 to convert the network event records 501 into normalized event records 506. Configuration data 504 is user-dependent and thus is part of domain-specific implementation 1312. Normalized network event records 506 are then sent to dispatcher 508 which employs user-specific dispatching rules to pass normalized network event records 506 to appropriate detection-layer engines 126, 128 and 132. In one embodiment, dispatcher 508 provides normalized network event records 506 a, which are sent to rules-based thresholding engine 126, normalized network event records 506 b, which are sent to profiling engine 128, and normalized network event records 506 c, which are sent to pattern recognition engine 132., 183835=In step 1018, an enforcer 1110 executes actions specified in step 1016 interfacing with various external action systems 1112. External action systems may include switch interface systems for switch-based ANI blocks, order entry systems for account deactivations, network control systems for calling card deactivations, electronic mail system for e-mail notices to customers or internal personnel, customer service centers, print centers for mailing dunning letters and various other systems. Enforcer 1110 preferably resides on servers 310 a . . . 310 n., 89502=Domain-specific implementation 1312 also includes configurable values. These can include, but are not limited to, one or more of the following:, 186289=Fraud cases 1114, including those which warrant automatic action in the expert system layer 139 and those which do not, are sent to presentation layer 143 for examination and potential action by a human analyst at workstations 152 a- 152 n., 86894=Core infrastructure 1310 includes elements that are required, regardless of the actual implementation environment. Domain-specific implementation 1310 includes user-specific data and functions such as thresholding rules, profiles, pattern recognition rules, alarm correlation and reduction rules, fraud case prioritization and action rules, presentation parameters and external system interacting parameters. Core infrastructure 1310 may be used in a variety of applications without redesign. Domain-specific implementation 1312 permits substantial tailoring of the system to user-specific situations., 184488=In operation, enforcer 1110 receives a request for action from prioritizer 1102 and interfaces with an appropriate external action system 1112 to execute the action. External action systems 1112 may include switch interface systems for switch-based ANI blocks, order entry systems for account deactivations, network control systems for calling card deactivations, electronic mail system for e-mail notices to customers or internal personnel, customer service centers, print centers for mailing dunning letters, or various other systems., 187368=Enhanced fraud cases 1114 from expert system layer 139 are received by case enhancer 1202. Similar to data enhancers of the upper layers, case enhancer 1202 uses configuration data 1204, an informant 1206, and external systems 1208 to augment enhanced fraud cases 1114 with additional information relevant for presentation to an analyst., 86491=Domain-specific implementation 1312 permits the present invention to be configured for use in a variety of applications such as telecommunications fraud, credit card and debit card fraud, data mining, etc. Core infrastructure 1310 and domain-specific implementation 1312 may be implemented as software, firmware, hardware or any combination thereof., 178491=In step 1014, enhanced fraud cases are prioritized. To assign priority to cases, prioritizer 1102 employs prioritization rules which are kept as part of configuration data 1104. Prioritization rules are based on experienced analysts' rules for determining and prioritizing fraud cases. These rules are programmed into configuration data 404 as logical algorithms. Prioritization rules can also employ parameters retrieved from external systems such as a customer's billing and payment history. Such parameters are useful for determining the potential cost of a fraud case, which is influential in determining priority., 62074=This patent application is a Continuation of U.S. patent application Ser. No. 09/212,045, filed Dec. 15, 1998, entitled System, Method and Computer Program Product for Processing Event Records, now U.S. Pat. No. 6,732,082, which is a Continuation-In-Part of U.S. patent application Ser. No. 08/928,851 filed on Sep. 12, 1997, which issued as U.S. Pat. No. 6,601,048 B1 on Jul. 29, 2003, the contents of which are relied upon and incorporated herein by reference in their entirety, and the benefit of priority under 35 U.S.C. 120 is hereby claimed., 183466=Action rules are programmed into configuration data 404 as logical algorithms to be applied to enhanced cases. These actions may be based on priority e.g., “for any case over priority level N, deactivate account”, type of service e.g., cellular, calling card, dial 1, or enhanced data retrieved from external systems 1108., 185085=Since these actions are performed automatically, the action rules that trigger them are preferably applied only to cases where a high probability of fraud exists or where the potential cost of the fraud is significant. Prioritizer 1102, along with the prioritization rules and action rule that are kept as configuration data 1104, perform as an expert system, applying expert rules to data records to determine what actions to perform. An off-the-shelf expert system can be used. However, it is preferable to program a customized expert system using a log-based language appropriate for expert systems, such as CLIPS., 172521=In step 812, these alarms are enhanced. Alarm enhancer 902 is similar to the detection layer enhancers 510, 624, and 740. Enhancer 902 augments alarms 526 and 638 to produce enhanced alarms 910. Configuration data 904 specifies additional information which may be needed and how that information should be added, based on the type of alarm received. Additional information may be retrieved from billing, accounts receivable, order entry or various other external systems 908. For example, informant 906 can access an accounts receivable system to determine that “this ANI has a past due account of $1000.” Similarly, informant 906 can access an order entry system to determine that “this calling card number was deactivated two months ago.” Informant 906 communicates with various external systems 908 to retrieve the requested information. Alarm enhancer 902 then adds this information to alarms 526 and 638 and produces enhanced alarms 910., 87556=Domain-specific implementation 1312 includes configurable rules to provide flexibility. Configurable rules include event recognition rules, event normalization rules, enhancement rules, detection rules, analysis rules, prioritization rules, presentation rules and dispatching rules, including provisioning rules., 62799=“Network Information Concentrator,” Ser. No. 08/426,256, filed Apr. 21, 1995, now U.S. Pat. No. 5,854,834, incorporated herein by reference., 187794=A presentation interface 1210 serves as an interface to workstations 152 a- 152 n, providing data for graphical presentation to the analyst. Fraud cases are presented according to presentation rules 1212, which are programmed as logical algorithms into a database and are configurable. Presentation interface 1210 employs an informant 1214 and external systems 1216 to retrieve additional information. However this is not automatic, as in the upper layers. Rather informant 1214 retrieves data from external systems 1216 based on commands from analysts at work stations 152 a- 152 n. For example, an analyst can view a case and decide that a customer's payment history is needed prior to taking any action. The analyst, via a workstation 152 a- 152 n, sends a command to presentation interface 1210 requesting this data. Presentation interface 1210 then instructs informant 1214 to retrieve this data from an external accounts receivable system 1216., 177635=In step 1012, fraud cases 916 are enhanced. To enhance cases, prioritizer 1102 uses configuration data 1104, an informant 1106, and external systems 1108. Configuration data 1104 specifies any additional information which can be needed for fraud cases 916, where to find the data and how to add the data to a fraud case. Informant 1106 serves as a communication interface to external systems 1108. Informant 1106 sends a query to an appropriate external system 1108 using a communications protocol of the external system 1108. Informant 1106 receives the requested data and supplies it to prioritizer 1102. Prioritizer 1102 then adds the information to a fraud case, creating an enhanced fraud case 1114.}",
    "textBeforeTable": "Patent Citations While various embodiments of the present invention have been described above, it should be understood that they have been presented by way of example only, and not limitation. Thus, the breadth and scope of the present invention should not be limited by any of the above-described exemplary embodiments, but should be defined only in accordance with the following claims and their equivalents. Presentation interface 1210 uses enforcer 1218 for performing actions. This is not automatic, as it was in the expert system layer 139. Rather, enforcer 1218 performs actions based on commands from analysts. For example, an analyst can decide that a switch block on an ANI is needed. The analyst, via a workstation 152 a- 152 n, sends a command to presentation interface 1210 requesting a switch-based ANI block. Presentation interface 1210 then instructs enforcer 1218 to execute the command. Enforcer 1218 interfaces with an external action, switch interface system 1220 to implement the ANI switch block. Other external action systems 1220 can be similar to those employed by expert system layer 239. A presentation interface 1210 serves as an interface to workstations 152 a- 152 n, providing data for graphical presentation to the analyst. Fraud cases are presented according to presentation rules 1212, which are programmed as logical algorithms into a database and are configurable. Presentation interface 1210 employs an informant 1214 and external systems 1216 to retrieve additional information. However",
    "textAfterTable": "Dec 21, 1992 Jul 11, 1995 At&T Corp. Post answer telephone call redirection or rerouting US5463681 Dec 29, 1993 Oct 31, 1995 At&T Corp. Security system for terminating fraudulent telephone calls US5475746 Aug 17, 1994 Dec 12, 1995 At&T Corp. Method for permitting subscribers to change call features in real time US5495521 Nov 12, 1993 Feb 27, 1996 At&T Corp. Method and means for preventing fraudulent use of telephone network US5504810 Sep 22, 1993 Apr 2, 1996 At&T Corp. Telecommunications fraud detection scheme US5506893 Nov 29, 1994 Apr 9, 1996 At&T Corp. Telecommunication network arrangement for providing real time access to call records US5515425 Jan 19, 1993 May 7, 1996 At&T Corp. Telecommunications system with active database US5515427 Jul 19, 1994 May 7, 1996 At&T Corp. Completion of intelligent network telephone calls US5517555 Sep 21, 1994 May 14, 1996 Cellular",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}