{
    "relation": [
        [
            "Citing Patent",
            "US4642039 *",
            "US4840554 *",
            "US4859166 *",
            "US4890996 *",
            "US4986745 *",
            "US5006056 *",
            "US5122049 *",
            "US5167894 *",
            "US5225208 *",
            "US5472332 *",
            "US5542836 *",
            "US5817346 *",
            "US6129539 *",
            "US6273703 *",
            "US20120318439 *",
            "CN1061290C *",
            "EP0593885A1 *",
            "EP0748682A1 *",
            "WO1988006515A1 *"
        ],
        [
            "Filing date",
            "Jun 12, 1985",
            "Apr 11, 1988",
            "Aug 5, 1988",
            "Nov 18, 1982",
            "Jul 13, 1989",
            "Jul 5, 1990",
            "Nov 5, 1991",
            "Mar 27, 1991",
            "Feb 6, 1992",
            "Oct 8, 1993",
            "Jun 23, 1993",
            "Jun 12, 1996",
            "Jul 23, 1998",
            "Jan 26, 1999",
            "Dec 16, 2010",
            "Jun 14, 1996",
            "Sep 2, 1993",
            "Jun 13, 1996",
            "Mar 3, 1988"
        ],
        [
            "Publication date",
            "Feb 10, 1987",
            "Jun 20, 1989",
            "Aug 22, 1989",
            "Jan 2, 1990",
            "Jan 22, 1991",
            "Apr 9, 1991",
            "Jun 16, 1992",
            "Dec 1, 1992",
            "Jul 6, 1993",
            "Dec 5, 1995",
            "Aug 6, 1996",
            "Oct 6, 1998",
            "Oct 10, 2000",
            "Aug 14, 2001",
            "Dec 20, 2012",
            "Jan 31, 2001",
            "Apr 27, 1994",
            "Dec 18, 1996",
            "Sep 7, 1988"
        ],
        [
            "Applicant",
            "Hermann Berstorff Maschinenbau Gmbh",
            "Fried. Krupp Gesellschaft Mit Beschrankter Haftung",
            "Kabushiki Kaisha Kobe Seiko Sho",
            "The Japan Steel Works, Ltd.",
            "Kabushiki Kaisha Kobe Seiko Sho",
            "The Black Clawson Company",
            "Paul Troester Maschinenfabrik",
            "Paul Troester Maschinenfabrik",
            "Bridgestone/Firestone, Inc.",
            "Paul Troester Maschinenfabrik",
            "Heinz Gross",
            "Kabushiki Kaisha Kobe Seiko Sho",
            "Materials Research Innovations Corporation",
            "Thyssenkrupp Ag",
            "Stefano Testi",
            "株式会社神户制钢所",
            "Paul Troester Maschinenfabrik",
            "KABUSHIKI KAISHA KOBE SEIKO SHO also known as Kobe Steel Ltd.",
            "Wavin Bv"
        ],
        [
            "Title",
            "Apparatus for producing profiles or webs such as tread strips for vehicle tires",
            "Extrusion head equipped with a clamping device for the tool components",
            "Screw extruding machine",
            "Continuous granulating machine",
            "Roller head opening and closing apparatus in roller head extruder",
            "Film extrusion apparatus including a quickly replaceable chill roll",
            "Extruder-calender combination",
            "Apparatus comprising an extruder and a calender for producing sheets and/or foils from plastic or rubber mixtures",
            "Extrusion device for producing tire tread plies",
            "Extruder head for an extruder",
            "Device for extruding and smoothing plastic films",
            "Sheet width adjusting apparatus for rolling head extruder",
            "Double doctor blades",
            "Extruder head with pivotal parts",
            "Extrusion process and device for producing elastomeric compounds",
            "Rolling head sheet extruder",
            "Extrusion head for an extruder",
            "Sheet width adjusting apparatus for rolling head extruder",
            "Construction of an extruder body which adsorbs thermal expansion"
        ]
    ],
    "pageTitle": "Patent US4354814 - Extruder with a sheet extrusion head and an associated calender - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4354814?dq=Frischling",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987866.61/warc/CC-MAIN-20150728002307-00160-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483698423,
    "recordOffset": 483678893,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The foregoing description of the specific embodiments will so fully reveal the general nature of the invention that others can, by applying current knowledge, readily modify and/or adapt for various applications such specific embodiments without departing from the generic concept, and, therefore such adaptations and modifications should and are intended to be comprehended within the meaning and range of equivalents of the disclosed embodiments. It is to be understood that the phraseology or terminology employed herein is for the purpose of description and not of limitation. To enable the extruder with the sheet extrusion head to be moved away from the calender rolls 34, 35, the pressure loading of the drive unit 49 is reversed so that the cylinder 50 with the thrust box 51 and the upper bearing 54 with the bearing support 55 is moved slightly away upwards. Subsequently, after the bolt 42 has been released by the drive unit 44, the extruder with the wide extrusion head can be moved away corresponding to the direction of the arrow 2. In this moved-away position, the upper extrusion head part 12 with the associated extrusion head insert can then be tilted up by means of the tilting drive 22, whereby the sheet extrusion ejector die 16 is opened. In this position, the latter can be cleaned. Since the bearings 54 are designed as spherical ball-and-socket joints and since the clamping device 60 is guided with",
    "textAfterTable": "US5006056 * Jul 5, 1990 Apr 9, 1991 The Black Clawson Company Film extrusion apparatus including a quickly replaceable chill roll US5122049 * Nov 5, 1991 Jun 16, 1992 Paul Troester Maschinenfabrik Extruder-calender combination US5167894 * Mar 27, 1991 Dec 1, 1992 Paul Troester Maschinenfabrik Apparatus comprising an extruder and a calender for producing sheets and/or foils from plastic or rubber mixtures US5225208 * Feb 6, 1992 Jul 6, 1993 Bridgestone/Firestone, Inc. Extrusion device for producing tire tread plies US5472332 * Oct 8, 1993 Dec 5, 1995 Paul Troester Maschinenfabrik Extruder head for an extruder US5542836 * Jun 23, 1993 Aug 6, 1996 Heinz Gross Device for extruding and smoothing plastic films US5817346 * Jun 12, 1996 Oct 6, 1998 Kabushiki Kaisha Kobe Seiko Sho Sheet width adjusting apparatus for rolling head",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}