{
    "relation": [
        [
            "Date",
            "Aug 3, 1999",
            "Mar 25, 2004",
            "Mar 18, 2008",
            "May 7, 2012",
            "Sep 26, 2012",
            "Nov 13, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: HON HAI PRECISION IND. CO., LTD., TAIWAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MACDOUGALL, ALAN R.;REEL/FRAME:010156/0941 Effective date: 19990525",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20120926"
        ]
    ],
    "pageTitle": "Patent US6123586 - Modular connector - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6123586?ie=ISO-8859-1&dq=7,446,777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474570387,
    "recordOffset": 474554442,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the present invention has been described with reference to a specific embodiment, the description is illustrative of the invention and is not to be construed as limiting the invention. Therefore, various modifications to the present invention can be made to the preferred embodiment by those skilled in the art without departing from the true spirit and scope of the invention as defined by the appended claims. Referring to FIG. 7, a dowel 7 having a hollow cylinder structure is used to engage with at least two adjacent modules by the reception holes 122 thereof. The dowel 7 defines a hole 70 along an axis thereof and a longitudinal cutout 72 communicating with the hole 70. The cutout 72 of the dowel 7 allows the dowel 7 to be minimized in its radius thereby facilitating insertion thereof into the reception holes 122 of adjacent modules. The lengths of the dowel 7 may be made different so the shorter dowel may link two modules while the longer dowel may link three or more modules. For example, the length of the dowel 7 shown in FIG. 7 may link three modules. Referring to FIG. 5, a plurality of the modules of FIG. 2 may be connected to a mother housing 5 to constitute a modular connector. For clarity, herein only one module is shown. The mother housing 5 defines a matrix of passageways 50, and only a row",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US6343771 * Jun 27, 2000 Feb 5, 2002 Mavil Rung or upright for cable ladder cable ladder and process for assembling same US6375478 * Jun 19, 2000 Apr 23, 2002 Nec Corporation Connector well fit with printed circuit board US6386924 * Mar 31, 2000 May 14, 2002 Tyco Electronics Corporation Connector assembly with stabilized modules US6461202 * Jan 30, 2001 Oct 8, 2002 Tyco Electronics Corporation Terminal module having open side for enhanced electrical performance US6592381 * Jan 25, 2001 Jul 15, 2003 Teradyne, Inc. Waferized power connector US6638079 * Aug 29, 2002 Oct 28, 2003 Hon Hai Precision Ind. Co., Ltd. Customizable electrical connector US6776649",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}