{
    "relation": [
        [
            "Date",
            "Jul 22, 1994",
            "Mar 10, 1995",
            "Aug 20, 1996",
            "Dec 31, 1997",
            "Jan 17, 1998",
            "Feb 6, 1998",
            "Dec 6, 1999",
            "Dec 7, 1999",
            "Nov 16, 2000",
            "Aug 1, 2003",
            "Aug 12, 2003",
            "Aug 14, 2003",
            "Sep 29, 2004",
            "Sep 18, 2008"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: LARPAROMED CORPORATION 9272 JERONIMO ROAD, UNIT 1 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BUELNA, TERRY;REEL/FRAME:007096/0910 Effective date: 19940715",
            "Owner name: ADVANCED SURGICAL, INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LAPAROMED CORPORATION;REEL/FRAME:007376/0646 Effective date: 19950306",
            "Owner name: UROHEALTH SYSTEMS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ADVANCED SURGICAL, INC.;REEL/FRAME:008110/0215 Effective date: 19960625",
            "Owner name: IMAGYN MEDICAL TECHNOLOGIES, INC., CALIFORNIA Free format text: CHANGE OF NAME;ASSIGNOR:UROHEALTH SYSTEMS, INC.;REEL/FRAME:008876/0078 Effective date: 19970929",
            "Owner name: BT COMMERCIAL CORPORATION, ILLINOIS Free format text: SECURITY AGREEMENT;ASSIGNOR:IMAGYN MEDICAL TECHNOLOGIES, INC.;REEL/FRAME:008886/0680 Effective date: 19971230",
            "Owner name: UROHEALTH OF KENTUCKY, INC., KENTUCKY Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT AGRICOLE INDOSUEZ;REEL/FRAME:008920/0448 Effective date: 19971219 Owner name: GATES PLASTICS, CALIFORNIA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT AGRICOLE INDOSUEZ;REEL/FRAME:008920/0448 Effective date: 19971219 Owner name: ALLSTATE MEDICAL PRODUCTS, INC., MINNESOTA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT AGRICOLE INDOSUEZ;REEL/FRAME:008920/0448 Effective date: 19971219 Owner name: DACOMED INTERNATIONAL INC., MINNESOTA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT AGRICOLE INDOSUEZ;REEL/FRAME:008920/0448 Effective date: 19971219 Owner name: UROHEALTH, INC., CALIFORNIA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT AGRICOLE INDOSUEZ;REEL/FRAME:008920/0448 Effective date: 19971219 Owner name: DACOMED CORPORATION, MINNESOTA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CREDIT AGRICOLE INDOSUEZ;REEL/FRAME:008920/0448 Effective date: 19971219",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5632752 - Surgical suturing device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5632752?dq=4316055",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466811515,
    "recordOffset": 466776647,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31505=This application is a continuation-in-part application of patent application Ser. No. 08/134,561 filed on Oct. 22, 1993 now U.S. Pat. 5,468,251. (Attorney Docket No. 14523-48)., 36868=A surgical needle having a curved distal end is disclosed in U.S. Pat. No. 818,152. Curved and bent surgical needles are described in the following patents and published applications: U.S. Pat. Nos. 5,152,769; 5,037,433; 4,527,564; and 2,516,710; German Patentschrift 628038 and Offenlegungsschrift 36 39 489; French Patent 455640; and Russian patent publications 1572613, 1319836, and 166102. The Remo-Medizintechnik discussed above is described in a brochure entitled REMA-Innovation through Progress.}",
    "textBeforeTable": "Patent Citations The present invention has been described in detail. However, modifications and variations may occur to those skilled in the art without departing from the principles of the claimed invention. Therefore, the scope of the invention should be determined primarily with reference to the appended claims, along with the full scope of equivalents to which those claims are entitled by law. The device 280 is then redirected towards the patient to remove the needle 210 from the fascia 246. The needle 210 is then placed in the closed position by rotating the knob 212 and retracting the device 280 from the patient. The suture 244 is then secured with a standard surgeon's knot. Once the needle 210 is outside the wound, one end of the suture 244 is directed through the aperture 222 and the suture 244 is adjusted so that both ends are approximately equal in length. One end of the suture 244 is then secured with a clamp 250 as shown in FIG. 20. The device 280 is then directed back towards the patient to remove the needle 210 from the fascia 246. Preferably, this is done under direct visualization. The device 280 is then rotated to the opposite side of the incision and the needle 210 is advanced through the fascia 246 and the subcutaneous tissue 248 as shown in FIG. 21. The remaining free end of the suture 244 is then removed from",
    "textAfterTable": "US6004332 * May 1, 1997 Dec 21, 1999 Yoon; Inbae Suturing instrument with multiple rotatably mounted offset needle holders and method of using the same US6017358 * May 1, 1997 Jan 25, 2000 Inbae Yoon Surgical instrument with multiple rotatably mounted offset end effectors US6080180 * May 1, 1997 Jun 27, 2000 Yoon; Inbae Surgical instrument with rotatably mounted offset end effector and method of using the same US6086601 * Apr 28, 1999 Jul 11, 2000 Yoon; Inbae Instrument and method for suturing anatomical tissue and tying suture material US6126665 * Jul 23, 1997 Oct 3, 2000 Yoon; Inbae Surgical instrument with arcuately movable offset end effectors and method of using the same US6143005 * May 1, 1997 Nov 7, 2000 Yoon; Inbae Suturing instrument with rotatably mounted offset needle holder and method of using the same US6214028 Aug 5, 1999",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}