{
    "relation": [
        [
            "Date",
            "Sep 1, 2005",
            "Dec 22, 2009",
            "Jan 31, 2014",
            "Jun 25, 2014",
            "Aug 12, 2014"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20140625"
        ]
    ],
    "pageTitle": "Patent US6411289 - Music visualization system utilizing three dimensional graphical ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6411289?dq=5,579,517",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476852355,
    "recordOffset": 476825819,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33100=This application claims the benefit of the filing date of U.S. Provisional Application No. 60/023,511, filed Aug. 7, 1996., 33634=Development of the new art and science of harmonic progression and tonal modulation during the evolution of Western musical culture from the Renaissance to the Baroque stylistic era introduced a third dimension into music, in much the same way that perspective was introduced in the history of visual art-works shortly before the time in question. Thus, there is a direct parallel between the musical achievements of composers Like da Rore, Marenzio, Gesualdo and Monteverdi on the one hand, and those of painters and architects such as Leon Battista Alberti, Brunelleschi, Leonardo and Piero delia Francesca on the other. The art of music which held sway from Monteverdi to Wagner is called “tonal music,” “tonality” being the quality which distinguishes it from earlier compositions, or from some of those of the present century. Tonality relates to loyalty to a tonic note and “home key.” The art of changing from one tonality to another is called “modulation.” The present invention visually illustrates the ways in which tonality serves as a third dimension in music, which had tended to seem two-dimensional until about the end of the Renaissance. Similarly, paintings and drawings had been mainly two-dimensional until the appearance of Alberti's treatises, De picture praestantissima, in 1435, and Della pittura (1436). In music, as in painting and drawing, the new dimension added depth and a sense of reality to the art-form.}",
    "textBeforeTable": "Patent Citations The preferred embodiments described herein are illustrative only and, although the examples given include many specificities, they are intended as illustrative of only one possible embodiment of the invention. Other embodiments and modifications will, no doubt, occur to those skilled in the art. Thus, the examples given should only be interpreted as illustrations of some of the preferred embodiments of the invention, and the full scope of the invention should be determined by the appended claims and their legal equivalents. This invention may also be used with the Internet by storing the computer code corresponding to a musical work at a web site. Through a computer browser or like device, the web site may be accessed and the computer code can then be down loaded. This computer code can then use one of the graphing programs, such as Performer, mentioned above to graph the musical work. Alternatively, the computer code can be stored in a computer and a graphing program can be placed on a web site. Similarly, the web site can be accessed and the graphing program can use the stored computer data to graphically display the musical work. Of course, both the computer code of a musical work, and the graphical program can be contained on a single web site and used to graphically depict a musical work. The present invention aids the user in appreciating and understanding musical works. A colorful, graphic musical",
    "textAfterTable": "US5525749 * Feb 4, 1993 Jun 11, 1996 Yamaha Corporation Music composition and music arrangement generation apparatus US5663517 * Sep 1, 1995 Sep 2, 1997 International Business Machines Corporation Interactive system for compositional morphing of music in real-time US5728960 * Jul 10, 1996 Mar 17, 1998 Sitrick; David H. Multi-dimensional transformation systems and display communication architecture for musical compositions * Cited by examiner Non-Patent Citations Reference 1 * Alec Nisbett, The Sound Studio-6th Edition, Butterworth-Heinemann Ltd, Oxford England, pp. 14-16, 1995.* 2 Graphical Depiction of G. F. Handel's \"Messiah 1 Sinfony\", 1 colored sheet of drawing. 3 * Pennycook, Bruce W., Computer-Music Interfaces: a Survey, ACM Computing Surveys, vol. 17, Issue 2, pp. 267-289, 1985.* 4 * Stephen Malinowski, Music Animation Machine User Guide, pp.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}