{
    "relation": [
        [
            "Citing Patent",
            "US7985221 *",
            "US8192468 *",
            "US8231529 *",
            "US8852281 *",
            "US8858555",
            "US8906020",
            "US8951253 *",
            "US8979902",
            "US20100292542 *",
            "US20110172664 *",
            "US20110245885 *",
            "US20120185048 *",
            "US20130218216 *",
            "US20140257287 *"
        ],
        [
            "Filing date",
            "Apr 20, 2007",
            "Dec 21, 2006",
            "Jan 26, 2010",
            "Jan 18, 2012",
            "Oct 5, 2009",
            "Mar 7, 2013",
            "Sep 14, 2009",
            "May 22, 2012",
            "",
            "Sep 14, 2009",
            "Oct 6, 2010",
            "Jan 18, 2012",
            "Mar 21, 2013",
            "Mar 8, 2013"
        ],
        [
            "Publication date",
            "Jul 26, 2011",
            "Jun 5, 2012",
            "Jul 31, 2012",
            "Oct 7, 2014",
            "Oct 14, 2014",
            "Dec 9, 2014",
            "Feb 10, 2015",
            "Mar 17, 2015",
            "Nov 18, 2010",
            "Jul 14, 2011",
            "Oct 6, 2011",
            "Jul 19, 2012",
            "Aug 22, 2013",
            "Sep 11, 2014"
        ],
        [
            "Applicant",
            "Millennium Medical Technologies, Inc.",
            "Biedermann Technologies Gmbh & Co. Kg",
            "Coco Inc.",
            "Globus Medical, Inc.",
            "Stryker Trauma Sa",
            "Stryker Trauma Sa",
            "Orthofix S.R.L.",
            "Biedermann Technologies Gmbh & Co. Kg",
            "Koshiya Co., Ltd.",
            "Orthofix S.R.L.",
            "Sean Powell",
            "Jeff Phelps",
            "Synthes Usa, Llc",
            "Stryker Trauma Sa"
        ],
        [
            "Title",
            "External fixator",
            "Dynamic stabilization device for bones or vertebrae",
            "Arm structure and holding device for surgical instrument",
            "Artificial spinal disk prosthesis",
            "Dynamic external fixator and methods for use",
            "Dynamic external fixator and methods for use",
            "Orthopaedic device for correcting deformities of long bones",
            "Dynamic stabilization device for bones or vertebrae",
            "Arm structure and holding device for surgical instrument",
            "Orthopaedic device for correcting deformities of long bones",
            "Protection Sleeve Retention Device",
            "Artificial spinal disk prosthesis",
            "Robotic arms",
            "Rose gear for external fixation clamp"
        ]
    ],
    "pageTitle": "Patent US7507240 - Adjustable splint for osteosynthesis - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7507240?dq=5166694",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472726175,
    "recordOffset": 472688935,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6301=Cylindrical body 210 is received in mating relationship within chamber 150 and enables convenient 360 rotation with respect to the main body 12. Cylindrical body 210 is configured to be positioned and received within receiving chamber 150 of engaging member 140, and is selectively coupled thereto through the use of screw 164 or another connector. Screw 164 selectively extends through aperture 152 (FIG. 4A) and into annular groove 212 (FIGS. 5A-C), thereby retaining cylindrical body 210 in a desired position within receiving chamber 150 of engaging member 140. In order to rotate holder 180 in either direction in a 360 degree range of motion, set screw 164 is loosened, and mount 16 is then rotated in the direction of arrow 54 or 55 (FIG. 1), then the set screw 164 is tightened again, thereby securing the position of holder 180 with respect to engaging member 140.}",
    "TableContextTimeStampAfterTable": "{129631=Additional disclosure relating to the embodiments of the present invention is available in the U.S. patent applications filed on Mar. 18, 2005 and entitled “Adjustable Splint for Osteosynthesis with Modular Joint,” and “Adjustable Splint for Osteosynthesis with Modular Components,” each of which are incorporated herein by reference in their entirety., 105223=As illustrated in FIGS. 2 and 10A-C, second joint member 302 comprises: (i) a cylindrical body 350 having a first end 352 and a second end 354 and an annular groove 356 therebetween; (ii) an extension member 358 extending from the cylindrical body 350, the extension member 358 having a first end 360 that is coupled to the second end 354 of the cylindrical body 350 and a second end 362 having an aperture 364 therein; and (iii) a circular array of teeth 370 on the second end 362 of member 358 extending concentrically about the aperture 364, such that the aperture extends through the teeth 370 and the second end 362 of extension member 358. Cylindrical body 350 is received in mating relationship within chamber 112′ and enables convenient 360 degree rotation with respect to the main body 14 selectively connected thereto. Extension member 358 extends away from cylindrical body 350 such that the longitudinal axis of extension member 358 is aligned with the longitudinal axis 372 (e.g., parallel to, or along the same axis) of cylindrical body 350. Hence, teeth 370 are oriented transversely to the longitudinal axis 372 of cylindrical body 350. Aperture 364 defines a threaded passageway 374 through which the body 342 of bolt 304 extends during assembly. Second joint member 302 thus has (i) a cylindrical body 350 at a first end of joint member 302 which adjustably couples to second main body 14; and (ii) an aperture 364 at a second end of second joint member 302 about which teeth 370 extend., 103133=As illustrated in FIGS. 2 and 9A-C, first joint member 300 comprises: (i) a cylindrical body 310 having a first end 312 and a second end 314 and an annular groove 316 therebetween; (ii) an extension member 318 extending from the cylindrical body 310, the extension member 318 having a first end 320 that is coupled to the second end 314 of the cylindrical body 310 and a second end 322 having an aperture 324 therein; and (iii) a circular array of teeth 330 on the second end 322 of member 318 extending concentrically about the aperture 324 such that the aperture extends through the teeth 330 and the second end 322 of extension member 318. Cylindrical body 310 is received in mating relationship within chamber 112 and enables convenient 360 degree rotation with respect to the main body 12 selectively connected thereto. Extension member 318 extends away from cylindrical body 310 such that the longitudinal axis of extension member 318 is aligned with the longitudinal axis 332 (e.g., parallel to, or along the same axis) of cylindrical body 310. Hence, teeth 330 are oriented transversely to the longitudinal axis 332 of cylindrical body 310.}",
    "textBeforeTable": "Patent Citations The present invention may be embodied in other specific forms without departing from its spirit or essential characteristics. The described embodiments are to be considered in all respects only as illustrative and not restrictive. The scope of the invention is, therefore, indicated by the appended claims rather than by the foregoing description. All changes which come within the meaning and range of equivalency of the claims are to be embraced within their scope. Additional disclosure relating to the embodiments of the present invention is available in the U.S. patent applications filed on Mar. 18, 2005 and entitled “Adjustable Splint for Osteosynthesis with Modular Joint,” and “Adjustable Splint for Osteosynthesis with Modular Components,” each of which are incorporated herein by reference in their entirety. Although mounts such as mounts 16, 18, and 20 are identified as possible mounts of the present invention, a variety of different mounts may be employed to connect a bone connector to a main body. Thus, a “mount ” as referenced in this specification or the appended claims may be any material or structure that connects a bone connector to a splint main body. illustrate optional grooves of the two-part collars of the present invention. Each groove can be used for a differently shaped bone connector, such as a screw. For example, collar member 242 b features a pair of elongated ovoid grooves 580 a-b which can be used",
    "textAfterTable": "US2435850 Jul 16, 1945 Feb 10, 1948 Siebrandt John R Splint and guard construction US2439995 Apr 11, 1944 Apr 20, 1948 Thrailkill Orville W Securing device US3877424 Nov 14, 1972 Apr 15, 1975 Murray William M Methods and apparatus for external fixation of bone fractures US3976060 * Apr 1, 1975 Aug 24, 1976 Messerschmitt-Bolkow-Blohm Gmbh Extension apparatus, especially for osteotomic surgery US4098269 * Mar 24, 1977 Jul 4, 1978 Robert Judet Articulated fixation device to hold unaligned bony parts in a fixed relative position US4258708 Jul 17, 1978 Mar 31, 1981 Giulio Gentile Articulated positioning system for devices adapted to externally exert a holding action on bone tissues US4273116 Jun 26, 1979 Jun 16, 1981 Claude Chiquet Device for external fixation of bone fragments US4312336 Nov 13, 1979 Jan 26, 1982 Orthofix S.R.1. External axial fixation unit",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}