{
    "relation": [
        [
            "Date",
            "Aug 1, 2006",
            "Jun 29, 2010",
            "Aug 14, 2013",
            "Feb 16, 2014",
            "Nov 25, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: JUMPTAP, INC,MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:RAMER, JOREY;DOUGHTY, DENNIS;SOROCCA, ADAM;REEL/FRAME:018037/0560 Effective date: 20060714",
            "",
            "Year of fee payment: 4",
            "Owner name: MILLENNIAL MEDIA, INC., MARYLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:JUMPTAP, INC.;REEL/FRAME:032226/0299 Effective date: 20140107",
            "Owner name: SILICON VALLEY BANK, MASSACHUSETTS Free format text: SECURITY AGREEMENT;ASSIGNOR:MILLENNIAL MEDIA, INC.;REEL/FRAME:034455/0867 Effective date: 20141121"
        ]
    ],
    "pageTitle": "Patent US7676394 - Dynamic bidding and expected value - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7676394?dq=6,188,988",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00305-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478405231,
    "recordOffset": 478272823,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6322=An explicit search scenario associated with the illustration of FIG. 11 could be as follows. The person 1104 is walking down the street at 7:00 p.m. The location of the mobile communication facility 102 is assessed using a GPS system (i.e. In association with the location facility 110). The location is then stored. An explicit search is initiated by the user 1104. Once the search is initiated, the stored location information may be transmitted to a mobile search host facility. The mobile host search facility 142 may also collect information from other associated sources (e.g. The mobile subscriber characteristics database 112, the sponsor information database 128, or carrier rules 130). The mobile search host facility is now prepared to perform a search based on the personal filter in the mobile search host facility 114 in conjunction with the user's location, time of day, and other information relating to the several data sources available to the mobile search host facility 114 (e.g. The mobile subscriber characteristics 112 database 112, the sponsor data base 128, the content 132, the carrier rules 130, and the open web content 1138). The search may be performed in conjunction with the personal filter and other relevant filtering information to obtain results. In these results, a sponsor may have participated in a search marketing auction in an attempt to get his information onto the user's mobile communication facility 102. For example, the restaurant located in a building 1102C may be the high bidder on a keyword auction related to dinners within five miles of the building 1102C, so the information the restaurant wanted sponsored and displayed on the mobile communication facility 102 will be displayed if the user 1104 interacts with the restaurant information presented. If the user does not interact with the sponsored result that was downloaded to the mobile communication facility 102, the sponsor may or may not have to pay a fee to the wireless provider 108 for the right to post. If the user 1104 does interact with the restaurant information that was downloaded on the mobile communication facility 102, the restaurant may or may not have to pay a fee to the wireless provider 108.}",
    "TableContextTimeStampAfterTable": "{635713=In embodiments, at least one advertisement 2004 may be associated with at least one webpage at least in part based on the information relating to a mobile subscriber characteristic 112 and mobile communication facility 102 characteristic combination. This information may provide an indication as to what the user may be looking for at a given time and location. For example, a user may be looking for transportation, food, a theater, sports, entertainment, movies, corporations, work, a bank, post office, mail facility, gas, directions, locations, location, navigation, taxi, bus, train, car, airport, baby sitter, service provider, goods provider, drug store, drive through, bar, club, movie times, entertainment times, news, and local information., 104093=By way of another example, the mobile subscriber information stored in the mobile subscriber characteristics database 112 may be used in an implicit search as described in further detail herein. The wireless provider may gain information pertaining to the user's location, time of day, likes and dislikes (e.g. through interpretation of other transactions [e.g., phone activity or web activity] related to the mobile communication facility 102), and the wireless provider may facilitate the downloading of apparently relevant information to the mobile communication facility in anticipation of the user's desire for such information. For example, a location facility 110 may locate the mobile communication facility. The location may be associated with the time of day at which the location was obtained. The location information may be associated with the other mobile subscriber characteristic information through a phone number associated with the mobile communication facility. The location may be Harvard Square in Cambridge, Mass. The time may be 6:30 p.m. and the user may have called Chinese restaurants ten times over the past two months at about this same time. This may be determined based on previous queries or by history of phone calls that may then be reverse-searched to check for relevance to future queries., 614489=A sponsor may present the mobile communication facility 102 with purchasable content and a user may purchase the content through the mobile communication facility 102 and make payment for the content through the wireless provider 108. For example, the content may be a downloadable ringtone, music file, video file, wall paper, or the like. The sponsor may elect to provide billing for such content through the wireless provider billing facility 1810. This may provide a convenient, secure, and/or trusted user transaction. The user may be comfortable in purchasing the content through his wireless provider as it may provide more of an appearance that it is provided from a known source. This may generate more of a ‘walled garden’ feel from the user's perspective while allowing the user to search for and/or receive such content on the open web. When the sponsor allows for payment of the content through the wireless provider payment facility 1810, the wireless provider 108 may receive a portion of the user's payment (or some other compensation) in return for the billing service., 630557=In embodiments, an implicit query may be received from a user of a mobile communication facility 102 and used at least in part to derive associations with advertisements 2004. For example, mobile subscriber characteristics 112, carrier business rules 130, or mobile communication facility 102 information, in conjunction with time, location, or similar situation, may suggest relevant advertisement-webpage 2008 pairing recommendations for the user. The recommended advertisements 2002 may be paired with webpages presented prior to, during, or following, the display of the advertisement 2002 results. A content request may be made by an implicit query request based at least in part on a mobile subscriber characteristic 112. For example, a user's mobile subscriber characteristics 112 may include the user's date of birth. Thus, an implicit query may be generated on the user's birthday in order to cull advertisements 2004 related to celebration of a birthday, discounts for customers on their birthdays, etc. A content request may be made an implicit query request based at least in part on a characteristic of a user's mobile communication facility 102. For example, if a mobile communication facility 102 type is associated with a demographic (e.g., age), an implicit query may be initiated to cull advertisements 2004 of probable relevance to the user of that mobile communication facility 102 type., 598472=In embodiments, a process for searching for information relating to misinformation entered into an address bar 174 of a mobile communication facility may involve the steps of producing a search query from the text entered in the address bar 174 1302 after receiving an indication 1212 that no site exists or responds to the misinformation. The search query 1302 may involve correction, disambiguation or other such techniques as described herein. For example, the development of the search query may involve using information related to the mobile communication facility (e.g. mobile subscriber characteristic information) to assist the disambiguation or correction of the misinformation. Once a search query is made, search results and or suggestions and or recommendations or other information relating to the text entered in the address bar 174 may be presented to the user on the mobile communication facility., 613277=In embodiments, the sponsor may enter a bidding process to provide certain sponsored content to a mobile communication facility 102 through a sponsor entry facility 1804. The sponsor may provide bid information (such as max bids for certain keyword matches), content information, compatibility information and the like. Once the sponsor has entered the sponsor process through the sponsor entry facility 1804, it may be in a position to display the sponsored content on a mobile communication facility in exchange for a bid amount. A user may enter a search query on the mobile communication facility 102, the query may be transmitted to a bidding facility 1812 where a bidding process may take place to determine which sponsor's content is going to be provided to the mobile communication facility 102. The bidding process may result in the award of certain sponsored content 128 as identified in the awardees information it originally indicated during the entry process. For example, the sponsor may have indicated that upon an award, a link or other content 1808 should be presented to the mobile communication facility., 26286=This application is also a continuation-in-part of each of the following commonly owned U.S. Patent Applications: U.S. application Ser. No. 11/267,940 filed on Nov. 5, 2005 and entitled “MANAGING SPONSORED CONTENT FOR DELIVERY TO MOBILE COMMUNICATION FACILITIES”, U.S. application Ser. No. 11/268,671 filed on Nov. 5, 2005 and entitled “MANAGING PAYMENT FOR SPONSORED CONTENT PRESENTED TO MOBILE COMMUNICATION FACILITIES”, U.S. application Ser. No. 11/271,164 filed on Nov. 11, 2005 and entitled “MANAGING SPONSORED CONTENT BASED ON DEVICE CHARACTERISTICS”, U.S. application Ser. No. 11/274,993 filed on Nov. 14, 2005 and entitled “PRESENTATION OF SPONSORED CONTENT ON MOBILE COMMUNICATION FACILITIES”, U.S. application Ser. No. 11/274,905 filed on Nov. 14, 2005 and entitled “MANAGING SPONSORED CONTENT BASED ON GEOGRAPHIC REGION”, U.S. application Ser. No. 11/274,884 filed on Nov. 14, 2005 and entitled “MANAGING SPONSORED CONTENT BASED ON TRANSACTION HISTORY”, U.S. application Ser. No. 11/282,120 filed on Nov. 16, 2005 and entitled “MANAGING SPONSORED CONTENT BASED ON USAGE HISTORY”, U.S. application Ser. No. 11/281,902 filed on Nov. 16, 2005 and entitled “MANAGING SPONSORED CONTENT BASED ON USER CHARACTERISTICS,” U.S. application Ser. No. 11/335,900 filed on Jan. 18, 2006 and entitled “MOBILE ADVERTISEMENT SYNDICATION,” U.S. application Ser. No. 11/335,904 filed on Jan. 19, 2006 and entitled “PRESENTING SPONSORED CONTENT ON A MOBILE COMMUNICATION FACILITY,” U.S. application Ser. No. 11/337,233 filed on Jan. 19, 2006 and entitled “LOCATION INFLUENCED SEARCH RESULTS,” U.S. application Ser. No. 11/337,234 filed on Jan. 19, 2006 and entitled “MOBILE COMMUNICATION FACILITY CHARACTERISTIC INFLUENCED SEARCH RESULTS,” U.S. application Ser. No. 11/336,432 filed on Jan. 19, 2006 and entitled “USER HISTORY INFLUENCED SEARCH RESULTS,” U.S. application Ser. No. 11/337,180 filed on Jan. 19, 2006 and entitled “USER CHARACTERISTIC INFLUENCED SEARCH RESULTS,” U.S. application Ser. No. 11/337,112 filed on Jan. 19, 2006 and entitled “USER TRANSACTION HISTORY INFLUENCED SEARCH RESULTS,” U.S. application Ser. No. 11/347,826 filed on Feb. 3, 2006 and entitled “PREVENTING MOBILE COMMUNICATION FACILITY CLICK FRAUD,” U.S. application Ser. No. 11/347,825 filed on Feb. 3, 2006 and entitled “SEARCH QUERY ADDRESS REDIRECTION ON A MOBILE COMMUNICATION FACILITY,” U.S. application Ser. No. 11/347,842 filed on Feb. 3, 2006 and entitled “MULTIMODAL SEARCH QUERY,” U.S. application Ser. No. 11/355,915 filed on Feb. 16, 2006 and entitled “PRESENTATION OF SPONSORED CONTENT BASED ON MOBILE TRANSACTION EVENT,” and U.S application Ser. No. 11/387,147 filed on Mar. 21, 2006 and entitled “INTERACTION ANALYSIS AND PRIORITIZATION OF MOBILE CONTENT.” Each of these applications is incorporated herein by reference in its entirety., 617494=The user interface 1900 may also include a bid entry facility 1904. The bid entry facility may provide a sponsor with the ability to enter bid amounts and corresponding bid criteria. For example, a maximum bid amount may be associated with criteria such as keyword relevancy match. In embodiments the maximum bid may be associated with simple matching criteria (e.g. such as matching a keyword) or it may be associated with a more complicated sting or weighted string of terms, events, or characteristics. For example, while a sponsor may provide a maximum bid of $0.10 for a keyword match, it may provide a bid of $0.15 for a combination of keyword and location, or $0.20 for a combination of keyword, location and phone type. As another example, the sponsor may bid $0.15 for a bid associated with a location and time of day if the search is an implicit search. While certain illustrations of bid criteria associated with bid amounts have been provided, it should be understood that the criteria matching may be any type of matching including without limitation weighted function matching, algorithm-based matching or any other type of rule-based, algorithmic, heuristic, or other matching., 255962=An interactive process between the mobile communication facility 102 and the disambiguation step 210 may be used for unambiguous query formation 2400. Once a user submits a query entry 120 to the mobile communication facility 102, a process of correction 244 may be necessary or helpful for unambiguous query formation 2400 that is sufficient to yield intelligible and useful result set(s). As part of the correction 244 process, information specific to the type of mobile communication facility 102 may be used; for example, if the device has unique delivery capabilities, the query may need correction in order to derive a result set compatible with these capabilities. Information stored in the mobile subscriber characteristics database 112 or parental controls facility 150 may also be integral to the correction 244 process. In embodiments, the search engine may automatically suggest corrections for common misspellings, including those which are unique to the mobile experience (e.g., “2nite”), 253494=In embodiments, mobile search host facilities 114 may be used for providing mobile communications facility 102 users additional relevant result set(s) based upon a query entry 120. For example, the mobile communication facility 102 may have a cache 2300 of memory wherein salient information is stored, such as aspects of the mobile communication facility 102, the user's profile, and a user behavioral history (e.g., phone calls, websites visited, search queries, frequency of queries, frequency of downloading content, rate changes in the frequency of events, and frequency of purchases)., 639599=In embodiments, an advertisement 2004 may be associated with at least one webpage based at least in part on information relating to a mobile communication provider. The information relating to a mobile communication provider may include, but is not limited to, a graphical trademark, audible signal, a recording of a person reading the slogan trademark of a mobile communication provider, a distinctive audio tone or combinations of tones associated with a mobile communication provider, or a video stream, such as an audio-visual commercial., 594904=In embodiments, a process for predicting the desired site from misinformation entered into an address bar 174 of a mobile communication facility may involve the steps of predicting the desired site 1218 after receiving an indication 1212 that no site exists or responds to the misinformation. The prediction 1218 may involve correction, disambiguation or other such techniques as described herein. For example, the prediction may involve using information related to the mobile communication facility (e.g. mobile subscriber characteristic information) to assist the disambiguation or correction of the misinformation. Once a prediction is made, the prediction may be tested 1224 (e.g. a search for a related URL may be conducted), the prediction may be presented to the user as a suggestion 1222, or the site associated with the prediction may be entered and presented 1220, for example., 602072=Following the error, or other indication that the site is unavailable, 1212, a redirected site may be chosen 1502. The redirection 1502 may be based on a table, algorithm, or information relating to the originally unavailable site indicating the correct site. For example, the unavailable site may produce information indicating there is a related site. A referenced URL may be provided for example. Given this redirection information, the mobile communication facility may be redirected to the new site., 594253=Once a site is predicted through step 1218, the predicted site may be entered 1220 and presented on the mobile communication facility 102. The process of predicting the desired site 1218 may also involve predicting and then searching for the predicted site 1224. If the predicted site does not exist or respond, a prediction facility associated with the prediction step 1218 may refine the prediction and search again. This process may be undertaken several times until a predicted site is located or until the process times out due to some preset timeout period, for example., 238923=The downloaded results presented may include a sponsored link from the restaurant, and the user may activate the sponsored link (e.g. by clicking on it). Once activated, or clicked or interacted with, the link may present the user with information relating to the restaurant. The information may include contact information (e.g. phone, address, email, URL) as well as a description of the restaurant. In one embodiment, the information may include a form or active control (such as a button) for making reservations. The user may be presented with a general section of the restaurant's website or a space tailored for the user 1104. For example, the restaurant may present the user with a coupon or other sale if he or she arrives at the restaurant within a predetermined time. Knowing they are in the area and knowing the volume of restaurant traffic, the restaurant may be able to offer a more targeted sale offer., 234137=The previously downloaded results presented may include a sponsored link from the restaurant, and the user may activate the sponsored link (e.g. by clicking on it). Once activated, or clicked or interacted with, the user may be presented with information relating to the restaurant. The information may include contact information (e.g. phone, address, email, URL) as well as a description of the restaurant. The user may be presented with a general section of the restaurant's website or a space tailored for the user 1104. For example, the restaurant may present users with a coupon or other sale if they arrive at the restaurant within a predetermined time. Knowing they are in the area and knowing the volume of restaurant traffic, the restaurant may be able to offer a more targeted sale offer., 234976=Likewise, the bookstore in a building 1102B may want to advertise to the user 1104 because he is in the area and has some history of searching amazon.com and the like. The restaurant may have signed up to participate in an auction for mobile communication facility 102 advertising space relating to people in the area of the building 1102B, within the hours the store is open, where the people have a history of activities related to the purchase of books (e.g. searching amazon.com, purchasing books on-line, or are frequent travelers)., 600482=The text entered from the address bar 174 may be processed 1402 through a disambiguation facility, correction facility, or other facility adapted to modify the text into a form more appropriate for a search on the mobile communication facility. The processed query may then be used as a search query 1404 and a search may be performed. Results, suggestions, and or other information pertaining to the processed query may be produced and displayed on a display associated with the mobile communication facility 102., 25660=This application claims the benefit of the following commonly owned U.S. Provisional Patent Applications, each of which is incorporated herein by reference in its entirety: App. No. 60/717,151 filed on Sep. 14, 2005 and entitled “SEARCH CAPABILITIES FOR MOBILE COMMUNICATIONS DEVICES,” App. No. 60/720,193 filed on Sep. 23, 2005 and entitled “MANAGING WEB INTERACTIONS ON A MOBILE COMMUNICATION FACILITY”, and App. No. 60/731,991 filed on Nov. 1, 2005 and entitled “MOBILE SEARCH,” and U.S. App. No. 60/785,242 filed on Mar. 22, 2006 and entitled “AUTOMATED SYNDICATION OF MOBILE INFORMATION.”, 239880=Likewise, the bookstore in a building 11 02B may want to advertise to the user 1104 because he is in the area and has some history of searching amazon.com and the like. The restaurant may have signed up to participate in an auction for mobile communication facility 102 advertising space relating to people in the area of the building 1102B, within the hours the store is open, where the people have a history of activities related to the purchase of books (e.g. searching amazon.com, purchasing books on-line, is a frequent traveler)., 149053=Various aspects of the assisted query formulation 2400 may be activated or de-activated under user or provider control. For example, a user with a particular search, such as a phone number for a particular individual, may wish to suppress corrections or suggestions that might be generated with assisted query formulation 2400, which might otherwise try to replace a correct, but unusual, name spelling with more conventional or popular subject matter. Thus in one aspect, a user interface for an assisted query formation system may include controls for selectively activating various ones of the tools available to the system. The tools may include, for example, the recommendations, predictions, disambiguations, categorizations, and the like discussed above. In another aspect, a service provider such as the wireless provider 108 or mobile communication facility 102 described above may offer selected ones of the tools as value-added services that may be provided to select customers, such as full-service or premium customers, or offered on an a la carte basis individually or in packages. In such embodiments, query assistance may be requested by a customer using, e.g., a web site, cellular phone data access, or telephone voice access, and may be requested on a subscription basis, such as recurring monthly, or on a daily or per search basis., 633362=In embodiments, an advertisement 2002 may be presented to a mobile communication facility 102 based at least in part on information relating to mobile subscriber characteristics 112. This information may include a user's individual demographic variables contained in the mobile subscriber characteristics database 112, such be age, sex, race, religion, an area code, zip code, a home address, a work address, a billing address, credit information, family information, income range, birth date range, birthplace, employer, job title, length of employment, an affiliation or other such information as described herein. The mobile subscriber characteristic 112 may associated with a personal filter. The mobile subscriber characteristic may be used in conjunction with a collaborative filter. The mobile subscriber characteristic 112 may include an aggregate of user characteristics or include a range of values. The range of values of a user characteristic may be a range of a user demographic. The range of values of a user characteristic may be a range of behaviors, or a range of age., 77220=In addition to the description of collaborative filtering summarized above, the following text may be referenced for more information relating to collaborative filtering and is incorporated herein by reference: Nakamura, A. and Abe, N., 1998. Collaborative Filtering using Weighted Majority Prediction Algorithms in: Proceedings of ICML'98, 395-403. Morgan Kaufman Eds. (see Appendix A)., 240483=In embodiments, search results are presented to the user 1104 on the mobile communication facility 102 that are targeted to the user based on information relating to the user, the mobile communication facility 102, the location, and/or other information as described herein in conjunction with a personal filter. In embodiments, the information is also used to better target advertising, and sponsored advertisements may be provided to the mobile communication facility 102 through a pay for auction advertisement scheme. Such a scheme could be similar to the desktop featured Google AdWords and AdSense by Google, Inc. of Mountain View, Calif., 615650=In embodiments, the sponsor payment facility 1802 may be used to pay for sponsored links that were awarded and/or presented to a mobile communication facility 102. For example, once sponsored content is awarded and/or presented to the mobile communication facility 102, the bidding facility 1812 may request payment for the bid amount from the sponsor payment facility 1802. The sponsor payment facility 1802 may then process payment to the wireless provider payment facility 1810, for example., 634522=In embodiments, mobile subscriber characteristics 112 may form parameters that limit the advertisement 2002 search results to those relevant to a mobile subscriber characteristic 112 or profile of multiple characteristics. The display of advertisement 2002 result set(s) may, thus, omit information, prioritize information (e.g., presenting sponsor links prior to all others), highlight a subset of the search result set, or order the display of information based upon the presence or absence of mobile subscriber characteristics 112. Examples of representative elements that may be stored within the mobile subscriber characteristics database 112 include location, personal information relating to a user, web interactions, email interactions, messaging interactions, billing history, payment history, typical bill amount, time of day, duration of on-line interactions, number of on-line interactions, family status, occupation, transactions, previous search queries entered, history of locations, phone number, device identifier, type of content previously downloaded, content previously viewed, and sites visited., 636518=In embodiments, an advertisement 2004 may be presented to a mobile communication facility 102 based at least in part on information relating to a mobile communication facility 102. This information may form parameters that limit the advertisement 2002 search results to those compatible with, relevant to, or preferred for presentation on a given type of mobile communication facility 102. The display of advertisement 2002 result set(s) may, thus, omit information, prioritize information (e.g., presenting sponsor links prior to all others), highlight a subset of the search result set, or order the display of information based upon the presence or absence of a mobile communication facility 102 or a feature of a mobile communication facility 102. Examples of representative elements that may be stored within the mobile subscriber characteristics database 112 include search history, a parental control, or a carrier business rule 130, display resolution, processing speed, audio capability, visual capability, and other technical characteristics. For example, an advertisement 2004 may be associated with only the subset of mobile communication facility 102 models that are best suited for presentation of the advertisement's 2004 content due to technological requirements for the content to optimally present. For example, an advertisement 2004 may have content that requires a Java-enabled device. Therefore, it may be desirable for the advertisement 2004 to present its content only on those mobile communication facilities that are Java-enabled., 254159=This information may be automatically refreshed and transferred, at set temporal intervals, from the mobile communication facility 102 to the wireless communication facility 104, and then on to either the user's wireless provider 108 or directly to the mobile search host facilities 114. Within the mobile search host facilities 114, the query content may be filtered by an algorithm facility 144 that scrutinizes the query content for the purpose of providing the user additional suggestions in the result set(s). For example, the frequency of terms used by the user in the query entry 120 may be used by the algorithm facility 144 to suggest related results based upon similar frequency indexing of key words or upon the popularity of query terms and results. As the user amends his query entry 120, the cache 2300 may implicitly transfer the content to the mobile search host facilities 114 for real time processing within the disambiguation facility 140, search facility 142, or other facility within the mobile host search facilities 114.}",
    "textBeforeTable": "Patent Citations While the invention has been disclosed in connection with certain preferred embodiments, other embodiments will be recognized by those of ordinary skill in the art, and all such variations, modifications, and substitutions are intended to fall within the scope of this disclosure. Thus, the invention is to be understood with reference to the following claims, which are to be interpreted in the broadest sense allowable by law. As was described above for the process of bidding on the presentation of content based at least in part on the anticipated expected value associated with the content's display, so too may a bidding process present an opportunity to bid based upon an anticipated yield associated with the display of a given content. A yield estimation facility may be based on an yield calculation associated with a variable selected from the group consisting of the amount of the bid, the location of the media item in the user interface, the duration of the presentation of the media item in the user interface, the probability that a user will view the media item if placed in the user interface, the probability that the user will interact with the media item if placed in the user interface, and the probability that the user will execute a transaction associated with the media item. In embodiments, a bidder may be able to enter an item of data associated with one",
    "textAfterTable": "US6078314 Apr 10, 1998 Jun 20, 2000 Samsung Electronics Co., Ltd. Mobile information terminal and operating method thereof US6092100 Nov 21, 1997 Jul 18, 2000 International Business Machines Corporation Method for intelligently resolving entry of an incorrect uniform resource locator (URL) US6097939 Jul 11, 1997 Aug 1, 2000 Compaq Computer Corporation Method and apparatus for event data maintenance per MIN/ESN pair in a mobile telephone system US6135349 Feb 1, 1999 Oct 24, 2000 First Data Corporation System and method for enabling a merchant to apply for a credit card processing account using the internet US6141341 Sep 9, 1998 Oct 31, 2000 Motorola, Inc. Voice over internet protocol telephone system and method US6178407 Apr 19, 1999 Jan 23, 2001 Mikhail Lotvin Computer apparatus and methods supporting different categories of users US6182050 May 28, 1998 Jan 30, 2001 Acceleration Software International Corporation Advertisements distributed on-line using target criteria screening with method for maintaining end user privacy US6199099",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}