{
    "relation": [
        [
            "Cited Patent",
            "US2252424 *",
            "US2400507 *",
            "US2689647 *",
            "US2900596 *",
            "US3206025 *",
            "US3206027 *"
        ],
        [
            "Filing date",
            "Jul 30, 1937",
            "Jan 2, 1943",
            "Sep 2, 1952",
            "Dec 31, 1956",
            "May 16, 1963",
            "May 27, 1963"
        ],
        [
            "Publication date",
            "Aug 12, 1941",
            "May 21, 1946",
            "Sep 21, 1954",
            "Aug 18, 1959",
            "Sep 14, 1965",
            "Sep 14, 1965"
        ],
        [
            "Applicant",
            "Sperry Prod Inc",
            "Carnation Co",
            "Purex Corp Ltd",
            "Sperry Prod Inc",
            "Anchor Hocking Glass Corp",
            "Continental Can Co"
        ],
        [
            "Title",
            "Rail flaw detector mechanism",
            "Method and apparatus for detecting defects in filled cans",
            "Bottle cap position detector",
            "Method and means for detecting flaws in magnetic material",
            "Detecting mechanism",
            "Apparatus for detecting loss of vacuum in sealed containers"
        ]
    ],
    "pageTitle": "Patent US3295676 - Detecting mechanism - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3295676?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990123.20/warc/CC-MAIN-20150728002310-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473704050,
    "recordOffset": 473688094,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8533=DETECTING MECHANI SM Filed Sept. 2, 1964 5 Sheets-Sheet 2 y we Jan. 3, 1967 c. s. OCHS DETECTING MECHANISM I5 Sheets-Sheet 5 Filed Sept. 2, 1964 4 20! Y v w 5 mmm 57 $7 1 M W M7 W 1 \\i United States Patent Office 3,295,676 Patented? Jan. 3, 1967 3,295,676 DETECTING MECHANISM Charles S. Ochs, Lancaster, Ohio, assignor to Anchor Hocking Glass Corporation, Lancaster, 01110, a corporation of Delaware Filed Sept. 2, 1964, Ser. No. 393,952 6 Claims. (Cl. 209-1113) The present invention relates to an automatic inspection device for sealed containers and more particularly to an improved device for sensing the absence of a vacuum in sealed packages and for rejecting packages with insufficient vacuum., 8381=DETECTING MECHANI SM Filed Sept. 2, 1964 5 SheetsSheet l INWENTOR., 8468=' Am/e/vcy Jan. 3, 1967 c. s. OCHS 3,295,676, 26642=References Cited by the Examiner UNITED STATES PATENTS 2,252,424 8/1941 Bigelow 32437 2,400,507 5/1946 Hensley 20988 X 2,689,647 9/ 1954 Hofstet'ter 209 2,900,596 8/1959 Drake 324-37 3,206,025 9/1965 Ochs 20988 3,206,027 9/1965 Bailey 209111.8, 8326=Jan. 3, 1967 c. s. ocHs- 3,295,676}",
    "textBeforeTable": "Patent Citations R. A. SCHACHER, Assistant Examiner. ROBERT B. REEVES, Examiner. M. HENSON WOOD, JR., Primary Examiner. References Cited by the Examiner UNITED STATES PATENTS 2,252,424 8/1941 Bigelow 32437 2,400,507 5/1946 Hensley 20988 X 2,689,647 9/ 1954 Hofstet'ter 209 2,900,596 8/1959 Drake 324-37 3,206,025 9/1965 Ochs 20988 3,206,027 9/1965 Bailey 209111.8 6. A sensing device for a dud detector for sealed packages sealed with closure caps having a flexible vacuum indicating panel surrounded by a raised rim comprising the combination of a conveyor for sealed packages, a panel position sensor, means for ejecting container from said conveyor coupled to said sensor, support means for said sensor, first cap engaging means on said sensor support means positioned for engaging the closure cap rim for raising the sensor a predetermined distance above the rim as the rim passes beneath the sensor and positioned inwardly of the rim when the sensor is centered above the cap, and second cap engaging means positioned at a predetermined level above said first cap engaging means and outwardly thereof and positioned above the cap rim when the sensor is centered above the cap. 5. The combination as claimed in claim 4 in which said sensor comprises a metal sensitive proximity detector. 4. A sensing device for a dud detector for sealed packages sealed with closure caps having a flexible vacuum indicating panel surrounded by a panel",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3392829 * Jan 10, 1966 Jul 16, 1968 Continental Can Co Container locating and vacuum sensing system US3416360 * Oct 19, 1966 Dec 17, 1968 Anchor Hocking Glass Corp Dud detector for small diameter caps US3469689 * Apr 28, 1966 Sep 30, 1969 Bron Electronics Inc Improperly-sealed-container rejector US3863349 * Jun 11, 1973 Feb 4, 1975 Perry Ind Inc Gaging apparatus US4355724 * Jun 18, 1980 Oct 26, 1982 Tropicana Products, Inc. Apparatus for sensing depressions in top panels of containers US5033287 * Sep 25, 1990 Jul 23, 1991 Ajinomoto Co., Inc. Method for inspecting a sealing property of a plastic container",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}