{
    "relation": [
        [
            "Date",
            "Jun 4, 1985",
            "Jul 1, 1991",
            "Aug 22, 1995",
            "Jan 14, 1996",
            "Mar 19, 1996"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: TIF INSTRUMENTS, INC., 9101 NORTHWEST SEVENTH AVEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:LIEBERMANN, LEONARD;REEL/FRAME:004414/0211 Effective date: 19850521",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 19960117"
        ]
    ],
    "pageTitle": "Patent US4719428 - Storage battery condition tester utilizing low load current - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4719428?dq=4,923,986",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468505731,
    "recordOffset": 468484602,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In view of the above description, it is likely that modifications and improvements will occur to those skilled in the art which are within the scope of the appended claims. It should now be apparent that the operator can quickly get a rough idea of the amount of drain on the battery that is due to terminal corrosion. A first reading can be made with the dual probe directly in contact with the battery posts. A second reading can be taken with the dual probe in contact with the clamp connecting the battery to the electrical system of the vehicle. It is possible that a battery which is actually good will lose so much due to corroded contacts at its terminals that the second reading would indicate that the battery should be replaced. This invention permits direct access, even to the posts of installed batteries. Pointed element 61 can make contact at any point on the top of a battery post, connecting the detecting circuitry to the battery. Connection of the switching circuit is accomplished by depressing sleeve 62 until it contacts the post. The present invention has another practical advantage in testing batteries. Usually heavy clamps connect to the posts of an installed battery, leaving only the circular top of the posts accessible. Typically prior art battery testers are fitted with heavy alligator clips. Because the posts of an installed battery are not accessible for",
    "textAfterTable": "1 Willihnganz et al, \"Battery Impedance\", vol. 78, Electrical Engineering, 9/1959. pp. 922-925. 2 * Willihnganz et al, Battery Impedance , vol. 78, Electrical Engineering, 9/1959. pp. 922 925. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4825170 * May 25, 1988 Apr 25, 1989 Champlin Keith S Electronic battery testing device with automatic voltage scaling US5047722 * Apr 17, 1989 Sep 10, 1991 Ssmc Inc. Apparatus for measuring internal resistance of wet cell storage batteries having non-removable cell caps US5530361 * Feb 14, 1995 Jun 25, 1996 Alcatel Nv Method and apparatus for measuring the state of charge of an electrochemical cell pulse producing a high discharge current US5572136 * Jun 7, 1995 Nov 5, 1996 Champlin; Keith S. Electronic battery",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}