{
    "relation": [
        [
            "Date",
            "May 24, 2007",
            "Nov 26, 2007",
            "Nov 29, 2007",
            "Nov 9, 2010",
            "Oct 24, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: HEWLETT-PACKARD DEVELOPMENT COMPANY, L.P.,TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COLNICK, ERIK C.;REEL/FRAME:019367/0042 Effective date: 20070522",
            "Owner name: HEWLETT-PACKARD DEVELOPMENT COMPANY, L.P.,TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SCARPELLO, JR., SAMUEL L.;REEL/FRAME:020190/0384 Effective date: 20071119",
            "Owner name: HEWLETT-PACKARD DEVELOPMENT COMPANY, L.P.,TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:COLNICK, ERIC C.;REEL/FRAME:020190/0678 Effective date: 20070522",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7711980 - Computer system failure management with topology-based failure impact ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7711980?ie=ISO-8859-1&dq=6,957,233",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481608667,
    "recordOffset": 481584260,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Alternative embodiments use different labels and to distinguish devices that have actually failed completely, actually failed partially, appear to have failed completely due to a dependency, and appear to have failed partially due to a dependency, and devices that appear to be functioning properly but are impacted by a failure of a device on which is depends. In addition, some embodiments limit impacted designations when sufficient redundancy remains despite a failure. For example, if one of three connections fails, and redundant connections remain, some embodiments do not mark the redundantly connected device as “impacted”. These and other variations upon and modification to the illustrated embodiments are provided for by the present invention, the scope of which is defined by the following claims. Herein, “allocation” involves matching workloads to resources, e.g., software programs to servers. Herein, an allocation planner gives a higher priority to a first resource than to another if, all else being equal, it allocates a workload to the first resource. Thus, in the present context, an allocation planner will assign a workload to a non-impacted server instead of an impacted server, even though the capabilities of the two servers are the same. In some cases, some overriding consideration might result in an allocation of a workload to an impacted server instead of a non-impacted server. E.g., where the workload is already running on the impacted server or where an impacted server is",
    "textAfterTable": "US20050268151 * Apr 28, 2004 Dec 1, 2005 Nokia, Inc. System and method for maximizing connectivity during network failures in a cluster system US20050268156 * Jul 25, 2005 Dec 1, 2005 Dell Products L.P. Failover system and method for cluster environment * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US8505020 Aug 29, 2010 Aug 6, 2013 Hewlett-Packard Development Company, L.P. Computer workload migration using processor pooling US8566823 Feb 5, 2010 Oct 22, 2013 Tripwire, Inc. Systems and methods for triggering scripts based upon an alert within a virtual infrastructure US8589728 Sep 20, 2010 Nov 19, 2013 International Business Machines Corporation Job migration in response to loss or degradation of a semi-redundant component US8694827 Jul 3, 2012 Apr 8, 2014 International Business Machines Corporation Job migration in response to loss or",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}