{
    "relation": [
        [
            "Citing Patent",
            "US5943406 *",
            "US6016340 *",
            "US6317490 *",
            "US7415431",
            "US7564959 *",
            "US7876239",
            "US8068037",
            "US8232899",
            "US8242935",
            "US8284076",
            "US8362927",
            "US8368562",
            "US8531317",
            "US8564459",
            "US8711010",
            "US9013334",
            "US9019130",
            "EP1356389A1 *",
            "WO2000031955A1 *"
        ],
        [
            "Filing date",
            "Sep 30, 1997",
            "Dec 11, 1997",
            "Dec 30, 1997",
            "Feb 22, 2001",
            "Nov 15, 2004",
            "Oct 26, 2007",
            "Jan 13, 2011",
            "Oct 4, 2011",
            "Oct 7, 2011",
            "May 23, 2012",
            "May 23, 2012",
            "May 23, 2012",
            "Jan 2, 2013",
            "Jan 2, 2013",
            "Jan 2, 2013",
            "Mar 5, 2014",
            "Mar 5, 2014",
            "Feb 22, 2001",
            "Nov 18, 1999"
        ],
        [
            "Publication date",
            "Aug 24, 1999",
            "Jan 18, 2000",
            "Nov 13, 2001",
            "Aug 19, 2008",
            "Jul 21, 2009",
            "Jan 25, 2011",
            "Nov 29, 2011",
            "Jul 31, 2012",
            "Aug 14, 2012",
            "Oct 9, 2012",
            "Jan 29, 2013",
            "Feb 5, 2013",
            "Sep 10, 2013",
            "Oct 22, 2013",
            "Apr 29, 2014",
            "Apr 21, 2015",
            "Apr 28, 2015",
            "Oct 29, 2003",
            "Jun 2, 2000"
        ],
        [
            "Applicant",
            "Leta; John T.",
            "Northern Telecom Limited",
            "Nortel Networks Limited",
            "Pintsov Leon A",
            "Microsoft Corporation",
            "Horstemeyer Scott A",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse Ip, Llc",
            "Eclipse, LLC",
            "Eclipse Ip, Llc",
            "Daniel Lanin",
            "Protel Inc"
        ],
        [
            "Title",
            "Telephone call tracking and billing system and method",
            "Billing scheme for a telecommunications network",
            "Method and apparatus for real-time billing account query",
            "System and method for trusted self-billing and payment for utilities including audit, verification, reconciliation and dispute resolution",
            "Billable activity processing",
            "Secure notification messaging systems and methods using authentication indicia",
            "Advertisement systems and methods for notification systems",
            "Notification systems and methods enabling selection of arrival or departure times of tracked mobile things in relation to locations",
            "Notification systems and methods where a notified PCD causes implementation of a task(s) based upon failure to receive a notification",
            "Systems and methods for a notification system that enable user changes to quantity of goods and/or services for delivery and/or pickup",
            "Advertisement systems and methods for notification systems",
            "Systems and methods for a notification system that enable user changes to stop location for delivery and/or pickup of good and/or service",
            "Notification systems and methods enabling selection of arrival or departure times of tracked mobile things in relation to locations",
            "Systems and methods for a notification system that enable user changes to purchase order information for delivery and/or pickup of goods and/or services",
            "Notification systems and methods that consider traffic flow predicament data",
            "Notification systems and methods that permit change of quantity for delivery and/or pickup of goods and/or services",
            "Notification systems and methods that permit change of time information for delivery and/or pickup of goods and/or services",
            "System and method for trusted self-billing and payment for utilities including audit, verification, reconciliation and dispute resolution",
            "Billing system"
        ]
    ],
    "pageTitle": "Patent US5841847 - Billing system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5841847?dq=6,360,693",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474340975,
    "recordOffset": 474318245,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The above described embodiment is set forth by way of example and is not for the purpose of limiting the present invention. It will be readily apparent to those skilled in the art that obvious modifications, derivations and variations can be made to the embodiment without departing from the scope of the invention. Accordingly, the claims appended hereto should be read in their full scope including any such modifications, derivations and variations. Another aspect of the invention includes second cpu 100 operably associated with the first cpu 18 via, for example, the service source 26 and conventional cpu modem links or a network. The cpu 100 likewise includes operably associated memory and operating system, clock, monitor and keyboard and is provided with complimentary billing software means 158 resident in the memory of the cpu 100 and has means 165 for de-encrypting the data 63. The billing software means 58 and 158 include means 64 and 164, respectively, for communicating with one another in a manner such that the data in the data file 63 may be transmitted, preferably in an encrypted form, and de-encrypted by the receiving cpu, here cpu 100, for purposes of generating a bill to the client. In this regard, the communication means 64 is equipped to perform one of automatically transmitting the data at a predetermined time of each month or manually transmitting the data at the service provider's initiation. In the",
    "textAfterTable": "US8531317 Jan 2, 2013 Sep 10, 2013 Eclipse Ip, Llc Notification systems and methods enabling selection of arrival or departure times of tracked mobile things in relation to locations US8564459 Jan 2, 2013 Oct 22, 2013 Eclipse Ip, Llc Systems and methods for a notification system that enable user changes to purchase order information for delivery and/or pickup of goods and/or services US8711010 Jan 2, 2013 Apr 29, 2014 Eclipse Ip, Llc Notification systems and methods that consider traffic flow predicament data US9013334 Mar 5, 2014 Apr 21, 2015 Eclipse, LLC Notification systems and methods that permit change of quantity for delivery and/or pickup of goods and/or services US9019130 Mar 5, 2014 Apr 28, 2015 Eclipse Ip, Llc Notification systems and methods that permit change of time information for delivery and/or pickup of goods and/or services EP1356389A1 * Feb 22, 2001 Oct 29, 2003 Daniel Lanin System and method for trusted self-billing and payment for utilities including audit, verification, reconciliation and dispute resolution WO2000031955A1",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}