{
    "relation": [
        [
            "Date",
            "Apr 15, 2002",
            "Jan 23, 2003",
            "Mar 7, 2007",
            "Aug 17, 2007",
            "Oct 9, 2007"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20070817"
        ]
    ],
    "pageTitle": "Patent US5938532 - Baton - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5938532?ie=ISO-8859-1&dq=inventor:%22Arthur+R.+Hair%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481051247,
    "recordOffset": 481026113,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13067=This is a continuation-in-part of application Ser No. 08/725,967, filed on Oct. 4, 1996, now U.S. Pat. No. 5,733,195.}",
    "textBeforeTable": "Patent Citations Accordingly, I claim all such changes and modifications that come within the scope and purview of the appended claims: Of course, it should be understood that various changes and modifications to the preferred embodiments described herein will be apparent to those skilled in the art. For example, it is apparent to one skilled in the art that the shape of the generally cylindrical shaft 22 includes the overall shape of a traditional club, baseball bat, police officer's night stick, and similarly shaped objects. Similarly, the band 42 may be secured between the shaft ends 24 & 24' by a variety of other known methods including machining the shaft to have the specified larger outer diameter at or near one or both of its ends. Also, the baton may be equipped with the band 42 without the flexible material 46 attached thereto. In such case, the baton may still be concealed and used as previously described. However, the lack of flexible material encircling the wrist may prevent a user from retaining control of the baton if the user loses hold of the band 42 or shaft 22. Should the user need to quickly use the baton 20 as a weapon, he or she simply loosens their grip on the shaft 22 while still retaining hold of the band 42. As a result, the band 42 will slide down the shaft 22 ultimately coming to rest on one",
    "textAfterTable": "Feb 9, 1926 William Hogan Holder for beet-toppers' knives US2625764 * Dec 27, 1949 Jan 20, 1953 Victor B O'brien Combination flashlight, gun, and billy US3307754 * Oct 19, 1965 Mar 7, 1967 John E Anketell Belt-attached article carrier US3944226 * Nov 21, 1973 Mar 16, 1976 Monadnock Lifetime Products, Inc. Police club US4020985 * Aug 9, 1974 May 3, 1977 Kenneth Lowder Halterman Equipment holder US4098503 * Oct 15, 1976 Jul 4, 1978 Antone Howard J One-hand bat US4203599 * Jun 8, 1978 May 20, 1980 Monadnock Lifetime Products, Inc. Police stick US4355804 * Jul 13, 1981 Oct 26, 1982 Bingham D Michael Club and club holder US4424923 * Sep 29, 1982",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}