{
    "relation": [
        [
            "Cited Patent",
            "US3316912 *",
            "US4000743 *",
            "US4190042 *",
            "US4654028 *",
            "US4909789 *",
            "EP0246086A2 *",
            "SU1333316A1 *"
        ],
        [
            "Filing date",
            "Sep 20, 1963",
            "Jul 9, 1975",
            "Mar 16, 1978",
            "Jan 29, 1986",
            "Mar 24, 1987",
            "May 13, 1987",
            ""
        ],
        [
            "Publication date",
            "May 2, 1967",
            "Jan 4, 1977",
            "Feb 26, 1980",
            "Mar 31, 1987",
            "Mar 20, 1990",
            "Nov 19, 1987",
            ""
        ],
        [
            "Applicant",
            "Gene C Wilkins",
            "Kenneth Weaver",
            "Manfred Sinnreich",
            "Hisayoshi Suma",
            "Olympus Optical Co., Ltd.",
            "Aldo Sergio Kleiman",
            ""
        ],
        [
            "Title",
            "Fecal impaction remover",
            "Uterine anteverter",
            "Surgical retractor for endoscopes",
            "Incision opening expansion holder for inosculation",
            "Observation assisting forceps",
            "A procedure for carrying out a surgical operation and a retracting laparoscope for separating organs in surgery",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US5195506 - Surgical retractor for puncture operation - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5195506?dq=6,272,646",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989443.69/warc/CC-MAIN-20150728002309-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478923907,
    "recordOffset": 478901160,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Those who are skilled in the art will readily perceive how to modify the invention. Therefore, the appended claims are to be construed to cover all equivalent structures which fall within the true scope and spirit of the invention. FIG. 7 is an end view of the retractor when the inner retractor tube 44 is being inserted into or withdrawn from the outer retractor tube 38. The angles of the wire springs 54 are such that the four fingers 46-52 automatically come together into a compressed and stacked condition. To assemble the parts shown in FIG. 6, the inner retractor tube 44 is extended through a hole 106 in inner chuck part 92 and then through passageway 90 in outer tube 38. The locking nut or cap 40 is fitted onto and threaded over threaded end 104 of the outer chuck 88. Thus, the two tubes 38, 44 are locked together when cap 40 is tightened and released from each other when the cap is loosened. A threaded locking nut or cap 40 fits onto threads 104 on the outer chuck 88. Thus, when locking nut or cap 40 is tightened, the jaws of inner chuck part 92 are squeezed together to lock the telescoping tubes 38, 44 relative to each other. When the cap 40 is loosened, the resilient of the member 92 acting upon tapered surface 100, causes the inner chuck part to back",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5293863 * May 8, 1992 Mar 15, 1994 Loma Linda University Medical Center Bladed endoscopic retractor US5351679 * Aug 17, 1992 Oct 4, 1994 Ilya Mayzels Surgical endoscopic retractor instrument US5352237 * Feb 8, 1993 Oct 4, 1994 United States Surgical Corporation Endoscopic instrument including a handle having a flywheel mechanism US5353784 * Apr 2, 1993 Oct 11, 1994 The Research Foundation Of Suny Endoscopic device and method of use US5381788 * Apr 27, 1992 Jan 17, 1995 United States Surgical Corporation Surgical retractor US5383888 * Feb 12, 1992 Jan 24, 1995 United States Surgical Corporation Articulating endoscopic surgical apparatus US5391180",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}