{
    "relation": [
        [
            "Date",
            "Jun 28, 1985",
            "Jul 2, 1987",
            "Oct 1, 1987",
            "Oct 9, 1990",
            "Mar 3, 1992",
            "Jun 12, 1992",
            "Jan 6, 1995",
            "Feb 2, 1995",
            "Feb 23, 1999",
            "Aug 1, 1999",
            "Oct 12, 1999"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: ALLIED CORPORATION COLUMBIA ROAD AND PARK AVE., M Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:HUTTER, HAROLD G.;REEL/FRAME:004426/0127 Effective date: 19850621",
            "Owner name: CANADIAN IMPERIAL BANK OF COMMERCE, NEW YORK AGENC Free format text: SECURITY INTEREST;ASSIGNOR:AMPHENOL CORPORATION;REEL/FRAME:004879/0030 Effective date: 19870515",
            "Owner name: AMPHENOL CORPORATION, LISLE, ILLINOIS A CORP. OF D Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:ALLIED CORPORATION, A CORP. OF NY;REEL/FRAME:004844/0850 Effective date: 19870602 Owner name: AMPHENOL CORPORATION, A CORP. OF DE, ILLINOIS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ALLIED CORPORATION, A CORP. OF NY;REEL/FRAME:004844/0850 Effective date: 19870602",
            "Year of fee payment: 4",
            "Owner name: BANKERS TRUST COMPANY, AS AGENT Free format text: SECURITY INTEREST;ASSIGNOR:AMPHENOL CORPORATION, A CORPORATION OF DE;REEL/FRAME:006035/0283 Effective date: 19911118",
            "Owner name: AMPHENOL CORPORATION A CORP. OF DELAWARE Free format text: RELEASED BY SECURED PARTY;ASSIGNOR:CANADIAN IMPERIAL BANK OF COMMERCE;REEL/FRAME:006147/0887 Effective date: 19911114",
            "Owner name: AMPHENOL CORPORATION, CONNECTICUT Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:BANKERS TRUST COMPANY;REEL/FRAME:007317/0148 Effective date: 19950104",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 19990804"
        ]
    ],
    "pageTitle": "Patent US4684201 - One-piece crimp-type connector and method for terminating a coaxial cable - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4684201?dq=7,346,539",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477909627,
    "recordOffset": 477892367,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations FIG. 5 shows the sleeve 28 crimped about the cable end portion and enlarges detail of the deformed sleeve and the outer periphery of the first rib 46 relative to the outer periphery of the undeformed sleeve (to the right of the rib 46), this being typical for each of the three ribs. FIG. 4 shows a completed crimping. The first rib 46 is engaged with the outer insulator jacket, the second (i.e., center ) rib 48 is pressing down about the cable braid, and the third rib 50 is pressing down about the cable braid adjacent the end wall. The sleeve 28, so crimped, provides a gripping mechanical retention about the cable at three locations, two electrical circuit paths which will shield the center conductor, and a moisture seal. The first rib 46 grips the cable and moisture seals the area around the entrance to the cavity. The second and third rib, in addition to gripping the cable, also engage the braid conductor to complete a circuit path between the braid and sleeve. The braid end face 22, by abutting the end wall 42 of the cavity, also enhances the conductive path between the braid and sleeve. The ribs 46, 48 and 50 each extend radially outward from the outer periphery 44 of the sleeve by an amount which defines the inward compression. In particular, as result of the inward compression (or crimping) of the",
    "textAfterTable": "Citing Patent Filing date Publication date Applicant Title US5073129 * Jan 30, 1991 Dec 17, 1991 John Mezzalingua Assoc. Inc. Coaxial cable end connector US5083943 * Nov 16, 1989 Jan 28, 1992 Amphenol Corporation Catv environmental f-connector US5141451 * May 22, 1991 Aug 25, 1992 Gilbert Engineering Company, Inc. Securement means for coaxial cable connector US5217393 * Sep 23, 1992 Jun 8, 1993 Augat Inc. Multi-fit coaxial cable connector US5338225 * May 27, 1993 Aug 16, 1994 Cabel-Con, Inc. Hexagonal crimp connector US5499934 * Jul 7, 1994 Mar 19, 1996 Cabel-Con, Inc. Hexagonal crimp connector US5501616 * Mar 21, 1994 Mar 26, 1996 Holliday; Randall A. End connector for coaxial cable US5651699",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}