{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,149 topics 2,125,927 replies",
            "85,560 topics 1,154,082 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,767 replies",
            "5,996 topics 75,824 replies",
            "50,548 topics 466,285 replies",
            "22,767 topics 196,328 replies",
            "4,274 topics 60,510 replies",
            "1,127 topics 8,221 replies",
            "3,608 topics 115,718 replies"
        ],
        [
            "Last Post Info",
            "Settings resetting fixed. T... By Nick930930 A minute ago",
            "Reasons why GTA IV is bette... By Canadian Badass A minute ago",
            "6 Star Wanted Level Survival? By Militia 21 hours ago",
            "Is Victor Vance the most hu... By crashrock2 4 hours ago",
            "Unique Vehicles By Militia 5 hours ago",
            "GTA San Andreas Windows 8.1... By Tomasak 7 minutes ago",
            "In what order did you do th... By Raiel 3 hours ago",
            "Cool Things You Didn't... By Canadian Badass 5 hours ago",
            "The incredible Arachnid By Sektor 3 hours ago",
            "F*ck ,Marry,Kill By svanderman 10 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=42&t=539726&p=1062090738",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113391799,
    "recordOffset": 113369583,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9377=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12615=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16520=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14211=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 20799=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 116115=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47396=Yahoo, Google, deadx23, A Paradox from 94, Jon3s, Legomanarthur, Bing, RoyalSyndLuke, moveslikejabba, Daemian, Lay, SSJEavan747, CML99, menny, Tomasak, Big-_-t0ny, TexasRocks, miclin, Midnight Hitman, Stidge uk, Miss Blossom, lukeskateboards, STEEZYR, US Marshal1911, Ledorus, Nathan46970, Johnny Alpha, HilArius999, Sugar Free Nos, GTAKid667, Zello, GTAV112, Cheatz_N_Trickz, Hyde Original, toxluv, Pyroshox, AztecaEh, dewtech_2008, 65536, Crimson Flam3s, Mona Sax, TheZoidBurger, ghoraaa, Slam_Jones, quadro09, jrl51592, Testarossa, Andreas, Jvaz615, TheMcSame, Drunkmoons, FiS!!HeR, smokingndriving, Rebel, Fozzie_420, acalmocean, lol232, Carface80, JaegerPilot1, Verlotsky, Wolftickets, Matttheking2015, shadowkill98, BengeyBoy, Chief Ryze, am30, Nick930930, VODKAH, AcidRunner, Superfrogger, zkroll, Elfsarecoming, axel4200, bloodonfire3, gizz01, Hollis2Hollywood, BUTTER MAN 13, s2n vaniish, Th3MaN1, SirBurka_, D9fred95, ChickenAndBeer, GipsyDanger MK2, Svip, Khaisz, jason148, epoxi, hitman774, juarez, Econobrick, Flesh-n-Bone, CaptainDowntown, Officer Vic, NikkoCharger, JimmyFantastic, RevelationRoleplay, josephene123, Jeansowaty, Daz, ViciousSpirit, MatthewH, Pettyium117, blacknambala, Stafish, missanthropy, Slasherr, catmandoza, Irviding, Eram, Captain Sensib1e, MyName'sJeff, JaySeaThree, Cripto136, SuzukiBlaze, TheRealCMPUNKFan, Miss Malevolent, Jinx., The_Anti-tragedy, DavidTheThird, HumanRacehorse, TomVDC, VercettiGuy, Deasy, I3IackMamba-__-, Lobitoxdmm, DemolitionMan, raburs, emelen, yopitstank, Icantthinkofonew, BlackMilk, BoeserBengel83, jollythecat, IJWLCNM, Colbydogs, Cognoscenti, Xing of Virtue, Bocknoi, RedDagger, Los Santos citizen, JMer23, Oddtester, Marwin, Choppers, OrionSR, crashrock2, cjarvis15, sooty1, laskaland, Kurosawa91, TempAccount, Marticus, josehatesyou, Mr. Jago, svanderman, Alec Skorpio, yojc, Deathdime89, Freddy1Krueger, Halal Cyborg, Cico555, AR700SAW, WindowsExPee, customkingpimp, REXX93, marhex, Katsumi82, Avenged Sevenfold, _Douglas_, BeckermannDewitt, Jacob_Rivera_11232, starblind94, M.K.N., XJpostman, Prywatne, beretta-gt88, Rented, Uncle Marston, diamond-optic, BlackHeartedGovernor, BassicalyDrunK, Shiest Bubble, benasro, Ieech, Husani, Google Mobile, Bender.ㅤ, smiffy84, Videogames888, King Rossey, kalle55, TNxxDELTA, Facebook, RustyShackleford, TJGM, xAxWilliams, ten-a-penny, MKKJ, SuperHolySheep, CHIEFSTA, shivix, gingap75, Carbonox, Trash99, Quinn_flower, mirthless, RmpTebow15, Copeinho, RJSanModder, LoA-Phantom, aksisisdead, Ayr utd 1910, ZANTHERA, A Maned Wolf, Player360, jake-dk, Chris Partlow, Mach1bud, Juicyfer, Tekno_Gecko, lord tammerlain, Kikato, kulomet333, CReaper210, Red Lynx 23, Kaleeb42, Rokussi, ChaosIKI, Aqua97, Stripes1981, Ker Juice, Twin Turbo, HipsterHillbilly, ProSniperLSV, Billiam301, Josh, dlflow84, velkan2010, soundism, Bob_Dole, Mastah, T-rellz2324, ProfTesla, FedoraTheExplora, Sanchez14, Sigma_yo, ceaton88, SAVILLAIN, Axe_Gaijin, Caffe1ne, RockstarsPlayer, StoneCold-Y2J, TheGamester101, hamizzzz, Nem Wan, RealGroovyMotion, *Lola, hoopz71, LZoleee, SilverWolfie, Y_Draig_Bryste, XB36Hazard, TheMariusz700_PL, Electrogypsy, SSKYZX, 18677=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 13 minutes ago By Bob_Dole [Y] The Yardies 613,948 replies 15,209 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By TexasRocks [PS4] Vehicle Requests/Duping 2,287,228 replies 113,549 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides & Strategies,",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,486 topics 416,712 replies [C#|.NET] Player Health pro... By GeorgeZhang 14 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}