{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,135 topics 2,125,279 replies",
            "85,560 topics 1,153,947 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,763 replies",
            "5,996 topics 75,815 replies",
            "50,549 topics 466,248 replies",
            "22,767 topics 196,313 replies",
            "4,273 topics 60,487 replies",
            "1,127 topics 8,219 replies",
            "3,605 topics 115,539 replies"
        ],
        [
            "Last Post Info",
            "Are blood pools bugged? By Mr. Fahrenheit A minute ago",
            "Bored? Try these... By Masketta Man 19 minutes ago",
            "Why does this game receive... By Sayuri A day ago",
            "The Ultimate 100% Save File... By Militia 23 minutes ago",
            "Favorite Gang By Mr. Fahrenheit 13 hours ago",
            "Crack dealer killing spree. By Militia 3 minutes ago",
            "Reasons why Vice City is be... By UshaB 2 hours ago",
            "Cool Things You Didn't... By stef_92 43 minutes ago",
            "What are the cops actually... By Cerium 4 hours ago",
            "Lets play a game of \"Wo... By thedriver111 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=239&t=561196&p=1062652285",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110311271,
    "recordOffset": 110286201,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47672=Lilscotton, Google, Yahoo, Bing, Alexander Blade, Jinx., CMCSAVAGE, Winning001, StepNaza, Slasherr, HulioG, starblind94, RightfulTrickyy, monkb4skunk, Crunch McThornbody, Emxndd, Marwin, Bender.ㅤ, Jax765, Sea Bear, Mr. Fahrenheit, Seemly, Mc Erinxxx, Days Are Gone, VercettiGuy, whiteskin, JoeFury1997, Gridl0k, BlackHeartedGovernor, m3tal z_DKI, TheUnholy, Walkinglynx5548, RageJenB, SuperGTFan, AERS, Sentinel Driver, Lay, a1dopeman, RayBanNeonColors420, CaptainMarvel, stonemaggot666, Furry_Monkey, hezus123, emiliumium, Itzreality, Claude Liberty, Doktor Gott, Craigsters, GTA SIX, Google Mobile, Total Failure, Nuggets, CarimboHanky, cav79, Chang, X12-1992, Broken Condom Kid, We Are Ninja, ChrissyBoi87, GerryM, Rykjeklut, Swoorup, Sky_Light12, theNGclan, zakace, GeneralSteve93, //XP//, Captain Sensib1e, AzelfandQuilava, Masketta Man, olegfadeev, HexagoN, jrl51592, Pigwick, moostered, stef_92, Gummy , NoSignal666, ZCAB, Corndog93, Osho, DatGtaGamer, VeraVanderpump, old fart, SatournFan, miclin, KornbreadMaf1a, PhillBellic, SomeDBKid, CjLosSantos, r.lorenzo13, Bennui, ++tachyon, WinkingSkeever6, allgaguzzi, Vaniox9, Vandous, Shadowfennekin, DeadpoolX, ZODIAC 4 v2, TG_Stig, Ethenal, the nameless, Squire100, TheMcSame, toxluv, blah265, TWOGUN, TovarishTony, 8888, xXepicjasaXx, sh0rtyuk, MitchMaljers, meta187, REXX93, ~TKP~, TacoSmuggler, SparkyMark01, zerGoot, Parikshit Singh, SouthLand, Ocelot., Halal Cyborg, JakeR96, kane-wwe, DavidTheThird, Fenton, Warlord., dkluin, crashoverride93, ThirteenAG, cjarvis15, EiF0hn, kulomet333, evinaz, SneakyPenguin91, TJGM, TwisterVictor1, SidSid, zmudziak32, ZombieRambo, Citron_XY, JuanG12, TexasRocks, fastman92, Kurosawa91, CalicoApricot, GVJLIMA, A Siente, missanthropy, shadowkill98, BlackMilk, Opzeker, Heisenberg_GR, Procopius, Daequil, Tacts_21, paperbagdude, Owl Man, PeppersGhost08, Pidge, Menaced, Phoenix_Poop, Kaito Katsumi, redeyejedi, Alexa, DJROWIENZ, CrookByDaBook4, TalkingPear, PavelOs, SaL_Leone, U.N.K.N.O.W.N, Craank_AG, Deus Ex, ZEST, Matttheking2015, SkynetOnlineID, Quejki, Khaisz, fefenc, Black_MiD, uncut751, minhto360, BeckermannDewitt, DumbForum, OfficialRedNinja, MatthewH, The Made Man, Doctor Ray, Goukou, Nick930930, Zook, zSaintX, xink, GTAKid667, MarBev, lpgunit, aka_senior_84, kaasje, Lukasdk, Forty-Five-Auto, Gammoudicj, Shmoopy, 12430=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9364=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18581=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 101776=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20711=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14151=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16365=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 23 minutes ago By HC271CA Merryweather Security - Rec... 613,588 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By AzelfandQuilava When do you think R* will u... 2,285,109 replies 113,457 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,646 replies Adding contacts to iFruit (... By TuckerW2001 29 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}