{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,104 topics 2,124,195 replies",
            "85,555 topics 1,153,723 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,540 topics 466,172 replies",
            "22,766 topics 196,290 replies",
            "4,270 topics 60,441 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,237 replies"
        ],
        [
            "Last Post Info",
            "Cannot buy safehouses in SP... By Fuzzknuckles 2 minutes ago",
            "Characters who needed more... By SuperGTFan 13 minutes ago",
            "The Ultimate 100% Save File... By Militia 2 days ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "Whats your favorite/hated r... By Kristian. 23 hours ago",
            "CJ's father? By thedriver111 40 minutes ago",
            "I am not able to run gta vi... By Issik 56 minutes ago",
            "Grand Theft Auto III Pre-Re... By RWWPL 4 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By Claptrap NL 12 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Msg&CODE=04&MID=675089",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987228.91/warc/CC-MAIN-20150728002307-00309-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110531183,
    "recordOffset": 110502348,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16888=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 9482=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18938=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 47930=Bing, Google, thatmobster, jaykillcee, Yahoo, We Are Ninja, FourthLegion, m3tal z_DKI, Blankerz, Nugsy, thehambone, Damiazo, AshManGTA, MotelGuy, RiseAgainBH, Drunkmoons, TiberiusMcQueen, Juan 16, lulzmodder, Heists, rockstarfanboy1987, Osho, The_darkest_side, Whitedodge00, Starpaul20, xTOMMYTROJANx, XenoxX, menny, hezus123, zanesix, Jon3s, Saint_Jackie, Ivibezz, TJtheS2000fan, Nicinator16, Car meets ps4, CarimboHanky, Craank_AG, TalkingPear, BeckermannDewitt, CarlitoDorito, ainsz, HulioG, Eram, gtaguy95, Tylerhasswagz, GTA Master, dan bull, VercettiGuy, Cracka.Brew, Chang, toolateaxeincar, GtaFanatik, TheTechPoTaToCHIP, whywontyoulisten, REXX93, K-ROSE, SuperGTFan, Mockingbae, WalterS_LV, Phthalate, kuusko, Slasherr, Dirtbag101, Jossgtaf, s2n vaniish, GTA717, Tomern11, Nik., Fuzzknuckles, size_m, Jon Snow, arziben, MIGta, RevengeOfSpartacus, A8ul99, BlackMilk, HeySlickThatsMe, Mika_0013, D3ADSH0T, Furry_Monkey, Arachne, smokingndriving, sanctum613, kassiano7, Brayla316, jukebox, jeanrjm, RayB_ThrowaStack, BoeserBengel83, jdwarfer, SalvatoreCJ1903, GTA_Matt24, Sigurd, LordMarvel, ShiviSRT-10, Eggobites90, Sentinel Driver, Icantthinkofonew, TacoSmuggler, CM-Punk, Dan McChill, FlexPiTo, marshallbslayer, Warliss, baru94, Ledorus, Stafish, Dr. MAR!O, cj2000, CMCSAVAGE, Therocksterisawesome, Quintenr95, Gigs84, Tomboy869, NBAKingzFan10, miclin, RmpTebow15, D1RTY®, xAxWilliams, SeekingAsylum, GTAandStuff, dyons, TwisterVictor1, AhmadMJamal, Verstappen, Google Mobile, SirJohnnyStark, Andreas, Claptrap NL, MyName'sJeff, Tadzik, TrevorAngry, JohnnyCallisto, DrunkenMunkey78, Black_MiD, J's Bonds, B Dawg, Ermacs, Mrgrandis_HKG, Craig Kostelecky, GTA@ddict13, Zonnex, rapidwiz, Indignation, Cancerslug, Screwe45, Pavle, Darrel, ManikB141, Receptor, LeopardGecko, garza337, BoomBapPoet, ninjaontour, Zyo, oCrapaCreeper, gorskiegangsta, GoodTimesAhead, knightsgarage, jrl51592, marvinviray, Piperka, Richgang, WhyDoINeedAName, joaopauliris, Ezekeil2Ofive17, Corndog93, Claude , Fast5 Torreto, Xevontheus, em1b16a2, Stoney0503, Kahkenbols, 018361, jgarehart, TG_Stig, Lay, Chuck Finley, ImBurkalicious, evGTA, markusizr, -Velox, 12thmanfirefighter, ZEST, dkluin, Lebowski_RS, SSKYZX, Retired Mafia, chinchin007, wowsux133, SuzukiBlaze, Heysuse, MC., bizwhippin666, Cornphlake, boppa_, Karanveer Singh, DumbForum, SmellyFishBarrel, DonSkidEsko, DuPz0r, TJGM, adra12, ten-a-penny, erwinnwijaya_, TrickyTrifecta, Apex., Niobium, xtrakill101, PSNSammy1, Chipsman, sivispacem, camo_boy67, Mastah, pizzapuff1990, Sky_Light12, Dan_Houser_Official, Hjaere, Mattallic, Payne Killer, stretchx9, alkaline_, CalibratedShots, hoopz71, blitz, Brazil301, KingLouieThaXIII, ChickenAndBeer, supanaut, Jvaz615, SatournFan, lazlow555, JoeFury1997, GamesBoy316, Xie Deathangelz, ChunkyP, fazedevil, Nutduster, BlaineCountyRoleplays, Strymon84, Guad, FlossyDSM, Teflon don, Frito-Man, ScarySKRILLEX, Tikhung, acalmocean, Demetri_FTO_1., slipstream87, RoiRasmus, steve_blue5, Prywatne, kingcs, Beckerbrasil, BlackRuiner, ice_phoenix_66, Gtaman_92, hellfire_cthulhu, ClippedWings, MLNVSKY, PeppersGhost08, Wanderer800, StangOne50, InJ3cT3Dwarrior, terminalnapkin, ShadowCola, GhostRiderPL, darktytanus, BLOOD-MOND, CoCkPuNcH, Romanotype, MadeBrazen, UltraGizmo64, CMGreger, fluffydude51, CrossPT, TaazR, Non Fiction, El-Gaddafii, Kiyone_Alien_Cop, Lost Legend, WhitTe_MamBa, 12863=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 121788=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 21159=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14579=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 9 minutes ago By Mattallic QUEENS of the DAMNED | Est... 613,690 replies 15,196 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By CarimboHanky What's it like in a bad... 2,281,256 replies 113,317 topics This is a general discussion forum",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,457 topics 416,596 replies Call thread from main.SCM By CrossPT 50 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}