{
    "relation": [
        [
            "Citing Patent",
            "US7461023 *",
            "US7496531",
            "US7552083",
            "US7580872 *",
            "US7613650",
            "US7653588",
            "US7676421",
            "US7689501",
            "US7809629",
            "US7865423",
            "US7945505",
            "US8027901 *",
            "US8027904",
            "US8131621",
            "US8140425",
            "US8165953",
            "US8195553",
            "US8209255",
            "US8210425 *",
            "US8249972",
            "US8296218",
            "US8321322",
            "US8326715",
            "US8326716",
            "US8341054",
            "US8346652",
            "US8346653",
            "US8370231 *",
            "US8423447 *",
            "US8452682",
            "US8484125",
            "US8489489 *",
            "US8515857",
            "US8533091",
            "US8566213",
            "US8577787",
            "US8612334",
            "US8655765",
            "US8671043",
            "US8694407",
            "US8719145",
            "US8751362",
            "US8788381",
            "US20040138983 *",
            "US20040215538 *",
            "US20040236664 *",
            "US20050222938 *",
            "US20090271301 *",
            "US20130282553 *"
        ],
        [
            "Filing date",
            "Mar 24, 2000",
            "Mar 7, 2007",
            "Nov 30, 2005",
            "Oct 5, 2001",
            "Apr 24, 2003",
            "Dec 29, 2005",
            "Oct 11, 2005",
            "Mar 7, 2007",
            "Apr 7, 2005",
            "Aug 3, 2006",
            "Mar 12, 2008",
            "May 23, 2003",
            "Apr 21, 2006",
            "Mar 27, 2008",
            "Oct 19, 2007",
            "Sep 4, 2007",
            "Nov 18, 2008",
            "Jul 14, 2010",
            "Apr 22, 2009",
            "Nov 7, 2008",
            "Dec 29, 2009",
            "Sep 28, 2010",
            "May 4, 2005",
            "Oct 10, 2006",
            "Jul 2, 2010",
            "Sep 16, 2009",
            "Oct 23, 2009",
            "Dec 17, 2003",
            "Nov 23, 2004",
            "Jan 27, 2012",
            "Jun 25, 2012",
            "May 3, 2006",
            "Dec 19, 2011",
            "Feb 17, 2012",
            "May 20, 2005",
            "Oct 10, 2012",
            "May 31, 2012",
            "Mar 27, 2008",
            "Jan 2, 2013",
            "Jul 19, 2012",
            "Mar 16, 2012",
            "Jun 3, 2009",
            "Oct 7, 2009",
            "Dec 17, 2003",
            "Apr 24, 2003",
            "May 23, 2003",
            "Nov 23, 2004",
            "Apr 22, 2009",
            "Jun 14, 2013"
        ],
        [
            "Publication date",
            "Dec 2, 2008",
            "Feb 24, 2009",
            "Jun 23, 2009",
            "Aug 25, 2009",
            "Nov 3, 2009",
            "Jan 26, 2010",
            "Mar 9, 2010",
            "Mar 30, 2010",
            "Oct 5, 2010",
            "Jan 4, 2011",
            "May 17, 2011",
            "Sep 27, 2011",
            "Sep 27, 2011",
            "Mar 6, 2012",
            "Mar 20, 2012",
            "Apr 24, 2012",
            "Jun 5, 2012",
            "Jun 26, 2012",
            "Jul 3, 2012",
            "Aug 21, 2012",
            "Oct 23, 2012",
            "Nov 27, 2012",
            "Dec 4, 2012",
            "Dec 4, 2012",
            "Dec 25, 2012",
            "Jan 1, 2013",
            "Jan 1, 2013",
            "Feb 5, 2013",
            "Apr 16, 2013",
            "May 28, 2013",
            "Jul 9, 2013",
            "Jul 16, 2013",
            "Aug 20, 2013",
            "Sep 10, 2013",
            "Oct 22, 2013",
            "Nov 5, 2013",
            "Dec 17, 2013",
            "Feb 18, 2014",
            "Mar 11, 2014",
            "Apr 8, 2014",
            "May 6, 2014",
            "Jun 10, 2014",
            "Jul 22, 2014",
            "Jul 15, 2004",
            "Oct 28, 2004",
            "Nov 25, 2004",
            "Oct 6, 2005",
            "Oct 29, 2009",
            "Oct 24, 2013"
        ],
        [
            "Applicant",
            "Mark Web Helweg",
            "Managed Etfs Llc",
            "Chicago Board Options Exchange, Incorporated",
            "Lic Development Llc",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Managed Etfs Llc",
            "Chicago Board Options Exchange, Incorporated",
            "Bridgetech Capital, Inc.",
            "Liquidity Development, Llc",
            "Omx Technology Ab",
            "Chicago Board Options Exchange, Incorporated",
            "Navigate Fund Solutions LLC",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "MicroQuant, LLC",
            "Chicago Board Options Exchange, Incorporated",
            "Netsuite, Inc.",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Operations Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Cdt Global Soft, Inc.",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Ip Strategy Incorporated",
            "Jp Morgan Chase Bank",
            "Navigate Fund Solutions LLC",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Cfph, Llc",
            "Chicago Board Options Exchange, Incorporated",
            "Bgc Partners, Inc.",
            "Navigate Fund Solutions LLC",
            "MicroQuant, LLC",
            "Navigate Fund Solutions LLC",
            "Ip Strategy Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Cfph, Llc",
            "Chicago Board Options Exchange, Incorporated",
            "Ip Strategy Incorporated",
            "Chicago Board Options Exchange, Incorporated",
            "Om Technology Ab",
            "Treacy Paul A",
            "Netsuite, Inc.",
            "Chicago Board Options Exchange, Incorporated"
        ],
        [
            "Title",
            "Price charting system and technique",
            "Methods, systems, and computer program products for trading financial instruments on an exchange",
            "Hybrid trading system for concurrently trading through both electronic and open-outcry trading mechanisms",
            "Liquid insurance contracts",
            "Hybrid trading system for concurrently trading securities or derivatives through both electronic and open-outcry trading mechanisms",
            "Method and system for providing order routing to a virtual crowd in a hybrid trading system",
            "Method and system for providing an automated auction for internalization and complex orders in a hybrid trading system",
            "Methods, systems, and computer program products for managing multiple investment funds and accounts using a common investment process",
            "Market participant issue selection system and method",
            "Systems and methods for providing investment opportunities",
            "Methods and systems for trading contracts and operating exchanges",
            "Automatic generation of an order in an instrument in a specified currency",
            "Method and system for creating and trading corporate debt security derivative investment instruments",
            "Methods, systems, and computer program products for providing risk management information and tools to traders in fund shares",
            "Method and system for generating and trading derivative investment instruments based on a volatility arbitrage benchmark index",
            "System and method for creating and trading a derivative investment instrument over a range of index values",
            "Price charting system and technique",
            "Market participant issue selection system and method",
            "Multiple rate currency consolidator",
            "Method and system for creating a volatility benchmark index",
            "Method and system for providing an automated auction for internalization and complex orders in a hybrid trading system",
            "Method and system for creating a spot price tracker index",
            "Method of creating and trading derivative investment products based on a statistical property reflecting the variance of an underlying asset",
            "Method and system for creating and trading derivative investment products based on a statistical property reflecting the variance of an underlying asset",
            "System and method for bank account management and currency investment",
            "Hybrid trading system for concurrently trading securities or derivatives through both electronic and open-outcry trading mechanisms",
            "Automated trading system for routing and matching orders",
            "Method for supporting an exchange transaction",
            "System and method for allocating nominal and cash amounts to trades in a netted trade",
            "Methods, systems, and computer program products for facilitating non-transparent exchange-traded fund share creations and redemptions with optional early cutoff times",
            "Market participant issue selection system and method",
            "System and method for trading derivatives in penny increments while disseminating quotes for derivatives in nickel/dime increments",
            "Electronic securities marketplace having integration with order management systems",
            "Method and system for generating and trading derivative investment instruments based on a volatility arbitrage benchmark index",
            "System and method for automatically distributing a trading order over a range of prices",
            "Methods, systems, and computer program products for obtaining best execution of orders to buy or sell a financial instrument for which a net asset value is periodically calculated",
            "Systems and methods for price evaluation of articles of commerce",
            "Methods, systems and computer program products for automated incorporation of traded fund shares in qualified retirement plans",
            "Server for supporting an exchange transaction",
            "Method and system for creating a volatility benchmark index",
            "System and method for creating and trading a derivative investment instrument over a range of index values",
            "Products and processes for generating a plurality of orders",
            "System and method for creating and trading a digital derivative investment instrument",
            "Storage medium storing an exchange transaction program for financial and related instruments, exhange transaction system for financial and related instruments and exchange transaction method for products",
            "Hybrid trading system for concurrently trading securities or derivatives through both electronic and open-outcry trading mechanisms",
            "Automatic generation of an order in an instrument in a specified currency",
            "System and method for allocating nominal and cash amounts to trades in a netted trade",
            "Multiple rate currency consolidator",
            "System and Method for Trading Derivatives in Penny Increments While Disseminating Quotes for Derivatives in Nickel/Dime Increments"
        ]
    ],
    "pageTitle": "Patent US7047218 - Method and apparatus for trading securities or other instruments on behalf ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7047218?dq=6,418,462",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476571123,
    "recordOffset": 476529986,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{252760=if P=10 then buy 1100 shares of X;, 251653=For example, assume the system receives orders to buy 2000 shares of X at the market price (share-based orders); orders to buy $2000 dollars worth of shares in X at the market price (dollar-based orders); orders to sell 1000 shares of X at the market price (share-based orders); and orders to sell $1000 dollars worth of shares in X at the market price (dollar-based orders). The exemplary embodiment first yields a two-part aggregated and netted order to buy 1000 shares of security X plus $1000 dollars worth of shares of security X., 252548=if P=9.8125 then buy 1102 shares of X;, 252689=if P=9.9375 then buy 1101 shares of X;, 218877=If the price of X were $10 per share, the brokerage would send an order to buy 1100 shares. If the price of X were to move from $10 to $11 between when the brokerage sent the order and when the market maker executed the order, this order would result in the brokerage owning too much stock. The brokerage would use 1000 shares to cover the share-based orders. The brokerage would then use the next 90.91 shares to cover the dollar-based orders. The brokerage would be left owning 9.091 shares for which it had no customer orders. This would expose the brokerage to risk that it might not wish to accept. Multiplied by thousands of orders and, potentially, thousands of shares, this risk adds up and could put millions of dollars of the brokerage's assets at risk., 252408=if P=9.6875 then buy 1104 shares of X;, 252827=if P=10.0625 then buy 1100 shares of X;, 252619=if P=9.875 then buy 1102 shares of X;, 252970=if P=10.1875 then buy 1099 shares of X;, 253222=The end result is that only one trade in the schedule of contingent trades occurs, depending upon the price at the time of execution. For example, if the price of security X is 10.3125, then the market maker purchases 1097 shares of security X on behalf of the brokerage that transmitted the schedule of orders. Alternatively, if the price of security X is 10.000, then the market maker purchases 1100 shares of security X. In all cases, at most only one extra share is purchased of each security in which the brokerage trades that day. Obviously, any succeeding trades can be used to attempt to trade the extra share., 253042=if P=10.25 then buy 1098 shares of X;, 253112=if P=10.3125 then buy 1097 shares of X;, 252899=if P=10.125 then buy 1099 shares of X;, 252479=if P=9.75 then buy 1103 shares of X;, 212971=This application is a continuation-in-part Ser. No. 09/038,158 filed on Mar. 11, 1998 now U.S. Pat. No. 6,996,539., 247677=The first part (Ns b−Ns s) of Equation (1) represents the number of shares resulting from the combination (e.g., aggregation and netting) of share-based orders, which is simply the difference between the number of shares being requested in all buy orders and the number of shares being requested in all sell orders in each security. For example, if all received share-based orders for security X when aggregated total 10,000 shares to be purchased and 11,000 shares to be sold, this part (Ns b−Ns s) equals −1000 shares, the negative sign indicating that the net result is a sell order for 1000 shares of security X., 299601=For example, assume that the brokerage receives orders from investors to buy and sell security Y, which aggregate to an order to buy 2000 shares, an aggregate order to buy $20,000 worth of shares, an aggregate order to sell 100 shares, and an aggregate order to sell $10,000 worth of shares. This order nets to an order to buy 1900 shares and $10,000 worth of shares. Assume further that the bid and ask prices are Pb=90, Pa=90.0625; yielding a mid-price of Pm=90.03125. Using the formulas above,, 229956=Value-based orders are particularly convenient when the amount of the trade is small relative to a price of the security. When implementing a diverse portfolio of investments for a small investor making small monetary investments, but on a periodic basis, it is more intuitive to the small investor to request a trade in terms of value (e.g., dollars) rather than in a number of fractional shares to be purchased (e.g., 0.01356 shares). Moreover, the actual numbers of shares being purchased is usually not particularly relevant to such an investor, but rather the relevant issue is how much the investor is trading or investing. Particularly for novice investors, specifying trades in terms of value is more intuitive than shares, the precise value of which is often difficult to determine for novice investors as it depends on the number of outstanding shares which fluctuate and the value of the issuer, which even sophisticated investors have difficulty determining.}",
    "textBeforeTable": "Patent Citations It should be noted that the above method for aggregating and netting a collection of trading orders to trade instruments, such as securities, some of which are expressed in dollar amounts and some of which are expressed in share amounts, is applicable to many types of brokerages, including, but not limited to a 401(k) plan that is administered by the brokerage, a trust, an Individual Retirement Account, a Keogh Plan, a Pension Plan, a Qualified Plan, or any other account holding tradable assets or liabilities. According to one possible implementation of the above method, an apparatus for calculating the schedule of prices includes a hand-held computer, such as a palm pilot, programmed to perform the schedule of prices calculation set forth above. The brokerage provides the market maker with this hand-held computer, and transmits the information about its customers' orders and into the hand-held computer, either by Internet link or otherwise. The market maker feeds information about current prices. The hand-held computer then calculates the amount of shares the market maker should buy at current prices in accordance with one of the above methods. Apparatus for Calculating Buy Order by Market Maker One possible implementation of an apparatus for determining the schedule of orders includes a central processor coupled to a computer network, such as the Internet, that receives customer orders electronically, aggregates and nets the orders, calculates the schedule of orders",
    "textAfterTable": "US5794219 Feb 20, 1996 Aug 11, 1998 Health Hero Network, Inc. Method of conducting an on-line auction with bid pooling US5799287 May 30, 1997 Aug 25, 1998 Dembo; Ron S. Method and apparatus for optimal portfolio replication US5806047 Sep 25, 1995 Sep 8, 1998 Metlife Life Insurance Company System for combined pool portfolio US5806049 Sep 30, 1996 Sep 8, 1998 Petruzzi; Christopher R. Data processing system for global assessment of investment opportunity and cost US5812987 Mar 13, 1995 Sep 22, 1998 Barclays Global Investors, National Association Investment fund management method and system with dynamic risk adjusted allocation of assets US5918218 Sep 1, 1994 Jun 29, 1999 First Data Investor Services Group, Inc. Method and apparatus for automated trade transactions processing US5930774 Jan 29, 1996 Jul 27, 1999 Overlap, Inc. Method and computer program for evaluating mutual fund portfolios US5946666 May 21, 1996 Aug 31, 1999 Albert Einstein Healthcare Network",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}