{
    "relation": [
        [
            "Citing Patent",
            "US8112407",
            "US8117197 *",
            "US8126867",
            "US8234262",
            "US8296383",
            "US8442973",
            "US8543570 *",
            "US8676904",
            "US8713119",
            "US8762469",
            "US8775400",
            "US8924378 *",
            "US8996376",
            "US9053089",
            "US9075783",
            "US20130238612 *",
            "US20140047335 *"
        ],
        [
            "Filing date",
            "Oct 26, 2007",
            "Jun 10, 2009",
            "Oct 27, 2007",
            "Oct 29, 2007",
            "May 24, 2012",
            "May 1, 2007",
            "Jan 20, 2012",
            "Oct 2, 2008",
            "Sep 13, 2012",
            "Sep 5, 2012",
            "Jun 30, 2010",
            "Sep 5, 2013",
            "Apr 5, 2008",
            "Oct 2, 2007",
            "Jul 22, 2013",
            "Mar 8, 2012",
            "Jan 7, 2013"
        ],
        [
            "Publication date",
            "Feb 7, 2012",
            "Feb 14, 2012",
            "Feb 28, 2012",
            "Jul 31, 2012",
            "Oct 23, 2012",
            "May 14, 2013",
            "Sep 24, 2013",
            "Mar 18, 2014",
            "Apr 29, 2014",
            "Jun 24, 2014",
            "Jul 8, 2014",
            "Dec 30, 2014",
            "Mar 31, 2015",
            "Jun 9, 2015",
            "Jul 7, 2015",
            "Sep 12, 2013",
            "Feb 13, 2014"
        ],
        [
            "Applicant",
            "The Invention Science Fund I, Llc",
            "Surf Canyon, Inc.",
            "The Invention Science Fund I, Llc",
            "The Invention Science Fund I, Llc",
            "Apple Inc.",
            "Surf Canyon, Inc.",
            "Surf Canyon Incorporated",
            "Apple Inc.",
            "Apple Inc.",
            "Apple Inc.",
            "Microsoft Corporation",
            "Surf Canyon Incorporated",
            "Apple Inc.",
            "Apple Inc.",
            "Apple Inc.",
            "Xerox Corporation",
            "Gabriel A. LEWIS"
        ],
        [
            "Title",
            "Selecting a second content based on a user's reaction to a first content",
            "Adaptive user interface for real-time search relevance feedback",
            "Returning a second content based on a user's reaction to a first content",
            "Method of selecting a second content based on a user's reaction to a first content of at least two instances of displayed content",
            "Electronic devices with voice command and contextual data processing capabilities",
            "Real time implicit user modeling for personalized search",
            "Adaptive user interface for real-time search relevance feedback",
            "Electronic devices with voice command and contextual data processing capabilities",
            "Electronic devices with voice command and contextual data processing capabilities",
            "Electronic devices with voice command and contextual data processing capabilities",
            "Extracting facts from social network messages",
            "Adaptive user interface for real-time search relevance feedback",
            "Intelligent text-to-speech conversion",
            "Part-of-speech tagging using latent analogy",
            "Electronic device with text error correction based on voice recognition data",
            "Method and apparatus for providing refined search results for a query based on one or more user interactions",
            "Systems and methods for providing and updating live-streaming online content in an interactive web platform"
        ]
    ],
    "pageTitle": "Patent US7599918 - Dynamic search with implicit user intention mining - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7599918?dq=5,884,272",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482204767,
    "recordOffset": 482161034,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations shows that engine 110 resides within search application 206, UIM engine 110 may also reside outside of search application 206. For example, UIM engine 110 may be included within an operating system. Alternately, UIM engine 110 may exist as a separate application. Accordingly, the specific features and acts are disclosed as exemplary forms of implementing the claimed invention. FIG. 2 Although the subject matter has been described in language specific to structural features and/or methodological acts, it is to be understood that the subject matter defined in the appended claims is not necessarily limited to the specific features or acts described. Rather, the specific features and acts are disclosed as exemplary forms of implementing the claimed invention. For example, although CONCLUSION illustrates remote application programs 785 as residing on memory device 781. The network connections shown are exemplary and other means of establishing a communications link between the computers may be used. FIG. 7 When used in a LAN networking environment, the computer 710 is connected to the LAN 771 through a network interface or adapter 770. When used in a WAN networking environment, the computer 710 typically includes a modem 772 or other means for establishing communications over the WAN 773, such as the Internet. The modem 772, which may be internal or external, may be connected to the system bus 721 via the user",
    "textAfterTable": "US5835163 Dec 21, 1995 Nov 10, 1998 Siemens Corporate Research, Inc. Apparatus for detecting a cut in a video US5884056 Dec 28, 1995 Mar 16, 1999 International Business Machines Corporation Method and system for video browsing on the world wide web US5900919 Dec 2, 1996 May 4, 1999 Industrial Technology Research Institute Efficient shot change detection on compressed video data US5901245 Jan 23, 1997 May 4, 1999 Eastman Kodak Company Method and system for detection and characterization of open space in digital images US5911008 Apr 29, 1997 Jun 8, 1999 Nippon Telegraph And Telephone Corporation Scheme for detecting shot boundaries in compressed video data using inter-frame/inter-field prediction coding and intra-frame/intra-field coding US5920360 Jun 7, 1996 Jul 6, 1999 Electronic Data Systems Corporation Method and system for detecting fade transitions in a video signal US5952993 Aug 22, 1996 Sep 14, 1999 Kabushiki Kaisha Toshiba Virtual object display apparatus and method US5956026 Dec 19, 1997",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}