{
    "relation": [
        [
            "Citing Patent",
            "US6855969 *",
            "US6946696 *",
            "US6972448 *",
            "US6992358 *",
            "US7018873 *",
            "US7087475",
            "US7091069",
            "US7091089",
            "US7091566 *",
            "US7141476 *",
            "US7202117",
            "US7259049",
            "US7372086 *",
            "US7432158",
            "US7445984",
            "US7459752",
            "US7538000 *",
            "US7563681 *",
            "US7679125",
            "US7704811",
            "US7719033 *",
            "US7799657",
            "US7888742 *",
            "US8106449 *",
            "US8373221",
            "US8421156 *",
            "US8557665 *",
            "US20040119102 *",
            "US20040222471 *",
            "US20040256693 *",
            "US20100047984 *",
            "US20110316083 *",
            "CN100568535C",
            "CN102054703B",
            "WO2005017976A2 *"
        ],
        [
            "Filing date",
            "May 29, 2002",
            "Dec 23, 2002",
            "Nov 8, 2001",
            "Jun 24, 2004",
            "Aug 13, 2003",
            "Jan 4, 2005",
            "Jun 30, 2004",
            "Jun 25, 2004",
            "Nov 20, 2003",
            "Jun 18, 2004",
            "Jan 31, 2005",
            "Jun 7, 2005",
            "Apr 8, 2004",
            "Jul 25, 2006",
            "Jul 25, 2006",
            "Jun 23, 2006",
            "Jul 28, 2005",
            "Jan 27, 2006",
            "Dec 14, 2005",
            "Feb 21, 2008",
            "Feb 28, 2006",
            "May 19, 2008",
            "Jan 10, 2007",
            "Jul 27, 2006",
            "Dec 26, 2007",
            "Jun 25, 2010",
            "Nov 3, 2009",
            "Dec 23, 2002",
            "May 29, 2002",
            "Apr 8, 2004",
            "",
            "Jun 25, 2010",
            "Aug 11, 2004",
            "Oct 28, 2009",
            "Aug 11, 2004"
        ],
        [
            "Publication date",
            "Feb 15, 2005",
            "Sep 20, 2005",
            "Dec 6, 2005",
            "Jan 31, 2006",
            "Mar 28, 2006",
            "Aug 8, 2006",
            "Aug 15, 2006",
            "Aug 15, 2006",
            "Aug 15, 2006",
            "Nov 28, 2006",
            "Apr 10, 2007",
            "Aug 21, 2007",
            "May 13, 2008",
            "Oct 7, 2008",
            "Nov 4, 2008",
            "Dec 2, 2008",
            "May 26, 2009",
            "Jul 21, 2009",
            "Mar 16, 2010",
            "Apr 27, 2010",
            "May 18, 2010",
            "Sep 21, 2010",
            "Feb 15, 2011",
            "Jan 31, 2012",
            "Feb 12, 2013",
            "Apr 16, 2013",
            "Oct 15, 2013",
            "Jun 24, 2004",
            "Nov 11, 2004",
            "Dec 23, 2004",
            "Feb 25, 2010",
            "Dec 29, 2011",
            "Dec 9, 2009",
            "Feb 22, 2012",
            "Feb 24, 2005"
        ],
        [
            "Applicant",
            "Kabushiki Kaisha Toshiba",
            "International Business Machines Corporation",
            "Texas Instruments Incorporated",
            "Kabushiki Kaisha Toshiba",
            "International Business Machines Corporation",
            "Kabushiki Kaisha Toshiba",
            "International Business Machines Corporation",
            "Freescale Semiconductor, Inc.",
            "International Business Machines Corp.",
            "Freescale Semiconductor, Inc.",
            "Freescale Semiconductor, Inc.",
            "International Business Machines Corporation",
            "Kabushiki Kaisha Toshiba",
            "Freescale Semiconductor, Inc.",
            "Freescale Semiconductor, Inc.",
            "International Business Machines Corporation",
            "Freescale Semiconductor, Inc.",
            "Freescale Semiconductor, Inc.",
            "Freescale Semiconductor, Inc.",
            "Texas Instruments Incorporated",
            "Samsung Electronics Co., Ltd.",
            "Freescale Semiconductor, Inc.",
            "International Business Machines Corporation",
            "Renesas Electronics Corporation",
            "Freescale Semiconductor, Inc.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Chan Kevin K.",
            "Kazumi Inoh",
            "Tsutomu Sato",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "国际商业机器公司",
            "中国科学院微电子研究所",
            "Ibm"
        ],
        [
            "Title",
            "Semiconductor device having a plurality of gate electrodes and manufacturing method thereof",
            "Self-aligned isolation double-gate FET",
            "Sub-lithographics opening for back contact or back gate",
            "Semiconductor device and method for manufacturing the same",
            "Method of making a device threshold control of front-gate silicon-on-insulator MOSFET using a self-aligned back-gate",
            "Semiconductor device having a plurality of gate electrodes and manufacturing method thereof",
            "Ultra thin body fully-depleted SOI MOSFETs",
            "Method of forming a nanocluster charge storage device",
            "Dual gate FinFet",
            "Method of forming a transistor with a bottom gate",
            "Method of making a planar double-gated transistor",
            "Self-aligned isolation double-gate FET",
            "Semiconductor device including MOSFET and isolation region for isolating the MOSFET",
            "Method for retaining nanocluster size and electrical characteristics during processing",
            "Method for removing nanoclusters from selected regions",
            "Ultra thin body fully-depleted SOI MOSFETs",
            "Method of forming double gate transistors having varying gate dielectric thicknesses",
            "Double-gated non-volatile memory and methods for forming thereof",
            "Back-gated semiconductor device with a storage layer and methods for forming thereof",
            "Sub-lithographics opening for back contact or back gate",
            "Semiconductor devices having thin film transistors and methods of fabricating the same",
            "Method of fabricating a substrate for a planar, double-gated, transistor process",
            "Self-aligned metal-semiconductor alloy and metallization for sub-lithographic source and drain contacts",
            "Semiconductor device",
            "Nanocluster charge storage device",
            "FET with self-aligned back gate",
            "Self-aligned metal-semiconductor alloy and metallization for sub-lithographic source and drain contacts",
            "Self-aligned isolation double-gate FET",
            "Semiconductor device having a plurality of gate electrodes and manufacturing method thereof",
            "Semiconductor device and method of manufacturing the same",
            "Self-aligned metal-semiconductor alloy and metallization for sub-lithographic source and drain contacts",
            "FET with Self-Aligned Back Gate",
            "Device threshold for controlling front-gate silicon-on-insulator MOSFET using a self-aligned back-gate",
            "一种无cmp的适用于后栅工艺的平坦化制备工艺",
            "Device threshold control of front-gate silicon-on-insulator mosfet using a self-aligned back-gate"
        ]
    ],
    "pageTitle": "Patent US6580132 - Damascene double-gate FET - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6580132?dq=6,910,205",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465417075,
    "recordOffset": 465394832,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22869=This application was sponsored by the United States Government under Contract No. N66001-97-1-8908, which was awarded by DARPA (Department of Advanced Research Projects Agency); therefore, the United States Government has certain rights and privileges to the present application., 24321=An evolution beyond the standard single gate metal oxide semiconductor field effect transistor (MOSFET) is the double-gate MOSFET, where the device channel is confined between top and bottom gate dielectric layers. This structure, with a symmetrical gate structure, can be scaled to about half of the channel length as compared to a conventional single gate MOSFET structure. It is well known that a dual gate or double gate MOSFET device has several advantages over conventional single gate MOSFET devices. Specifically, the advantages for dual gate MOSFET devices over their single gate counterparts include: a higher transconductance, lower parasitic capacitance, and improved short-channel effects. For instance, Monte-Carlo simulation has been previously carried out on a 30 nm channel dual gate MOSFET device and has shown that the dual gate device has a very high transconductance (2300 mS/mm) and fast switching speeds (1.1 ps for nMOSFET).}",
    "textBeforeTable": "Patent Citations While this invention has been particularly shown and described with respect to preferred embodiments thereof, it will be understood by those skilled in the art that the foregoing and other changes in forms and details may be made without departing from the spirit and scope of the present invention. It is therefore intended that the present invention not be limited to the exact forms and details described and illustrated, but fall within the scope of the appended claims. The process flow described above, together with the listed materials represent a preferred embodiment of the present invention. In principle, other materials may be substituted which serve the same purpose, and other details of the process may change accordingly. It is noted however that any changes made to the above description must be capable of building the top gate inside a trench such that sidewall source/drain regions and oxide spacers are formed prior to formation of the gate. As indicated previous herein, the inventive process achieves the following advantages: (i) The inside-out geometry enable one to form a tapered body region with a thicker body under the contacts to reduce access resistance; (ii) since lithography defines the largest dimensions, the top gate length may be much smaller than the minimum lithographic feature; (iii) the bottom gate is referenced to the lithographic top gate stencil, resulting in better line width control; and (iv) allows the formation of double-gate field",
    "textAfterTable": "Method of fabricating a substrate for a planar, double-gated, transistor process US7888742 * Jan 10, 2007 Feb 15, 2011 International Business Machines Corporation Self-aligned metal-semiconductor alloy and metallization for sub-lithographic source and drain contacts US8106449 * Jul 27, 2006 Jan 31, 2012 Renesas Electronics Corporation Semiconductor device US8373221 Dec 26, 2007 Feb 12, 2013 Freescale Semiconductor, Inc. Nanocluster charge storage device US8421156 * Jun 25, 2010 Apr 16, 2013 International Business Machines Corporation FET with self-aligned back gate US8557665 * Nov 3, 2009 Oct 15, 2013 International Business Machines Corporation Self-aligned metal-semiconductor alloy and metallization for sub-lithographic source and drain contacts US20040119102 * Dec 23, 2002 Jun 24, 2004 Chan Kevin K. Self-aligned isolation double-gate FET US20040222471 * May 29, 2002 Nov 11, 2004 Kazumi Inoh Semiconductor device having a plurality of gate",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}