{
    "relation": [
        [
            "Citing Patent",
            "US8021331",
            "US8281737",
            "US8287940 *",
            "US8430055",
            "US8658239",
            "US8739727",
            "US8816021 *",
            "US9056152",
            "US20040243158 *",
            "US20050015142 *",
            "US20050021071 *",
            "US20090054837 *",
            "US20120065336 *",
            "EP2285443A2 *"
        ],
        [
            "Filing date",
            "Oct 14, 2005",
            "Mar 9, 2004",
            "Feb 9, 2007",
            "",
            "Sep 4, 2012",
            "Oct 8, 2012",
            "Sep 9, 2011",
            "Sep 23, 2011",
            "Mar 25, 2004",
            "Mar 9, 2004",
            "Aug 13, 2004",
            "Feb 9, 2007",
            "Sep 9, 2011",
            "May 1, 2009"
        ],
        [
            "Publication date",
            "Sep 20, 2011",
            "Oct 9, 2012",
            "Oct 16, 2012",
            "Apr 30, 2013",
            "Feb 25, 2014",
            "Jun 3, 2014",
            "Aug 26, 2014",
            "Jun 16, 2015",
            "Dec 2, 2004",
            "Jan 20, 2005",
            "Jan 27, 2005",
            "Feb 26, 2009",
            "Mar 15, 2012",
            "Feb 23, 2011"
        ],
        [
            "Applicant",
            "Atrium Medical Corporation",
            "Boston Scientific Scimed, Inc.",
            "B. Braun Melsungen Ag",
            "Lutonix, Inc.",
            "B. Braun Melsungen Ag",
            "Boston Scientific Scimed, Inc.",
            "Designer Molecules, Inc.",
            "Boston Scientific Scimed, Inc.",
            "Angioscore, Inc., A Delaware Corporation",
            "Michael Austin",
            "Angioscore, Inc.",
            "B. Braun Melsungen Ag",
            "Designer Molecules, Inc.",
            "Bayer Schering Pharma AG"
        ],
        [
            "Title",
            "Method of coating a folded medical device",
            "Coated medical device and method for manufacturing the same",
            "Coating method for a folded balloon",
            "Methods and apparatuses for coating balloon catheters",
            "Coating method for a folded balloon",
            "Coated medical device and method for manufacturing the same",
            "Curable composition with rubber-like properties",
            "Medical device with crystalline drug coating",
            "Apparatus and methods for treating hardened vascular lesions",
            "Coated medical device and method for manufacturing the same",
            "Apparatus and methods for treating hardened vascular lesions",
            "Coating Method for a Folded Balloon",
            "Curable composition with rubber-like properties",
            "Catheter balloon drug adherence techniques and methods"
        ]
    ],
    "pageTitle": "Patent US20060112536 - Method of coating a folded medical device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20060112536?dq=4182933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00328-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472948807,
    "recordOffset": 472914548,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83703=Specifically, viscosity variations of the same coating materials were utilized in the example implementations. Rapamycin was mixed together with a mixture of 70% vitamin E and 30% Epax 3000TG Fish oil. The rapamycin, dissolved in nMp solvent, was mixed together with the vitamin E/fish oil mixture at a ratio of 50:50. Once the solvent was removed, the final drug concentration in the therapeutic coating was about 32%., 111570=Some specific examples of therapeutic agents useful in the anti-restenosis realm include cerivastatin, cilostazol, fluvastatin, lovastatin, paclitaxel, pravastatin, rapamycin, a rapamycin carbohydrate derivative (for example, as described in US Patent Application Publication 2004/0235762), a rapamycin derivative (for example, as described in U.S. Pat. No. 6,200,985), everolimus, seco-rapamycin, seco-everolimus, and simvastatin. With systemic administration, the therapeutic agent is administered orally or intravenously to be systemically processed by the patient. However, there are drawbacks to a systemic delivery of a therapeutic agent, one of which is that the therapeutic agent travels to all portions of the patient's body and can have undesired effects at areas not targeted for treatment by the therapeutic agent. Furthermore, large doses of the therapeutic agent only amplify the undesired effects at non-target areas. As a result, the amount of therapeutic agent that results in application to a specific targeted location in a patient may have to be reduced when administered systemically to reduce complications from toxicity resulting from a higher dosage of the therapeutic agent., 27526=This application claims priority to, and the benefit of, and is a continuation-in-part application of co-pending U.S. patent application Ser. No. 10/943,075, filed Sep. 15, 2004, which claims priority to U.S. Provisional Application No. 60/503,357, filed Sep. 15, 2003, for all subject matter common to said applications. The disclosures of all of the above-mentioned applications are hereby incorporated by reference herein in their entirety.}",
    "textBeforeTable": "Referenced by Numerous modifications and alternative embodiments of the present invention will be apparent to those skilled in the art in view of the foregoing description. Accordingly, this description is to be construed as illustrative only and is for the purpose of teaching those skilled in the art the best mode for carrying out the present invention. Details of the structure may vary substantially without departing from the spirit of the invention, and exclusive use of all modifications that come within the scope of the disclosed invention is reserved. The present invention relates to a plurality of combinations involving some form of therapeutic application of a therapeutic coating onto and into the targeted tissue location during use of a medical device supporting the therapeutic coating. Such combinations can include implantation procedures, such as a radial stent deployment procedure, to the same area location (within or partially within the same treatment location). The technique and device technology allows a multiple application step means to deliver more coating, medicated or therapeutic agent, or biological, over a larger surface area than can be applied solely by a single catheter step means, or by a single step means using solely a drug eluting stent means. Typically, a drug eluting stent has a surface area equal to no more than 20% of the vessel wall, and therefore cannot deliver a coating, medicated agent, or biological to",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 29/592 International Classification A61B5/05, B23P17/04 Cooperative Classification A61L2300/606, A61L29/16, A61M25/1038, A61M2025/1031, B05D2259/00, A61F2/82, B05D1/00, A61L29/08, A61F2/958, Y10T29/49, A61M25/1027, A61F2250/0067 European Classification A61F2/958, A61L29/16, A61M25/10G, A61L29/08, B05D1/00, A61F2/82 Legal Events Date Code Event Description Feb 3, 2006 AS Assignment Owner name: ATRIUM MEDICAL CORPORATION, NEW HAMPSHIRE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HERWECK, STEVE A.;MARTAKOS, PAUL;MOODIE, GEOFFREY;AND OTHERS;SIGNING DATES FROM 20060119 TO 20060125;REEL/FRAME:017233/0597 Feb 25, 2015 FPAY Fee payment Year of fee payment: 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}