{
    "relation": [
        [
            "Cited Patent",
            "US1026081 *",
            "US1833305 *",
            "US2319346 *",
            "US2433483 *",
            "US3233820 *",
            "US3337086 *",
            "US3352520 *",
            "US3355088 *",
            "US3416655 *",
            "US3477091 *",
            "US3606072 *",
            "GB390233A *",
            "GB1120973A *"
        ],
        [
            "Filing date",
            "Feb 27, 1911",
            "Mar 3, 1931",
            "Jul 3, 1939",
            "Feb 9, 1944",
            "Jun 10, 1964",
            "Jul 12, 1965",
            "Apr 22, 1965",
            "Mar 6, 1967",
            "Jun 30, 1966",
            "Apr 6, 1967",
            "Jul 25, 1969",
            "",
            ""
        ],
        [
            "Publication date",
            "May 14, 1912",
            "Nov 24, 1931",
            "May 18, 1943",
            "Dec 30, 1947",
            "Feb 8, 1966",
            "Aug 22, 1967",
            "Nov 14, 1967",
            "Nov 28, 1967",
            "Dec 17, 1968",
            "Nov 11, 1969",
            "Sep 20, 1971",
            "",
            ""
        ],
        [
            "Applicant",
            "Louis P Dorais",
            "Merrill L Rathbun",
            "Rathbun Merrill L",
            "Shuron Optical Co Inc",
            "Douglas Young Inc",
            "Jenks Carl W",
            "Homeline Corp",
            "Douglas Young Inc",
            "Jerome Shiffman",
            "Great Lakes Aluminum Fabricato",
            "Willmotts Ltd",
            "",
            ""
        ],
        [
            "Title",
            "Waste-cotton container.",
            "Box or case",
            "Closure",
            "Spectacle case",
            "Reinforced spring hinge box",
            "Plating and general utility tank of the knockdown type",
            "Bag holder",
            "Box with sections of contrasting material hinged together",
            "Tray-enclosed jewelry box",
            "Invisible hinge",
            "Boxes,cases and the like",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4452373 - Jewelry box hinge structure - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4452373?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483134891,
    "recordOffset": 483118934,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although it is apparent from the foregoing that the present invention provides significant advantages in the construction of boxes, it is understood that the various changes and modifications may be made without departing from the spirit and scope of the present invention as recited in the appended claims and their legal equivalents. In producing the box 10 according to the present invention, only one plastic mold or die is required to produce both frames 12 for the box. In addition, the hinge for the box 10 is defined by protrusions 26 integral with the frames 12 and only a separate spring clip 16 must be added. Furthermore, identical shells 14 may be attached to each of the frames 12 of a pair, or shells of various depths, colors and surface finishes can be applied to a given pair of frames in a wide number of combinations. Among the surface finishes contemplated are smooth finishes, dull finishes, embossments, and coatings of flocking material like felt. Most of the area of the body member and the cover member of the box 10 is defined by the shells 14. Each shell 14 comprises a body portion 38 having a configuration complementary to the configuration of the frame 12 with which the shell 14 is to be used. As is illustrated in FIGS. 2, 5 and 6, the body portion 38 includes an outwardly directed flange 40 which is received",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4732269 * Mar 3, 1985 Mar 22, 1988 Royal Hinge & Die Co., Inc. Jewelry display box US4773530 * Dec 23, 1987 Sep 27, 1988 Jewelcor, Inc. Package containing a booklet or folder insert US4896786 * Aug 1, 1988 Jan 30, 1990 Comprehensive Health Education Foundation Shipping container for educational materials and the like US4925059 * Mar 20, 1989 May 15, 1990 International Packaging Corporation Hinged box construction US4932521 * Jul 25, 1989 Jun 12, 1990 Hover Force Industries Limited Watch case with device for holding booklet US4971220 * Dec 11, 1989 Nov 20, 1990 Kimberly-Clark Corporation Container with \"stay open\" lid",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}