{
    "relation": [
        [
            "Cited Patent",
            "US3046887 *",
            "US3046888 *",
            "US3111437 *",
            "US3305414 *",
            "US3394038 *",
            "US3534685 *",
            "US3760728 *",
            "US3781180 *"
        ],
        [
            "Filing date",
            "Jul 7, 1958",
            "May 28, 1959",
            "Sep 6, 1960",
            "Mar 18, 1964",
            "Apr 25, 1967",
            "Oct 11, 1968",
            "Mar 1, 1972",
            "May 4, 1971"
        ],
        [
            "Publication date",
            "Jul 31, 1962",
            "Jul 31, 1962",
            "Nov 19, 1963",
            "Feb 21, 1967",
            "Jul 23, 1968",
            "Oct 20, 1970",
            "Sep 25, 1973",
            "Dec 25, 1973"
        ],
        [
            "Applicant",
            "Consolidation Coal Co",
            "Consolidation Coal Co",
            "Nippon Kayaku Kk",
            "Cominco Ltd",
            "Commercial Solvents Corp",
            "Canadian Ind",
            "Canadian Ind",
            "Ici Australia Ltd"
        ],
        [
            "Title",
            "Explosive system containing ammonium nitrate",
            "Explosive compositions containing ammonium nitrate",
            "Cap sensitive ammonium nitrate-fuel oil explosive and a method of manufacturing the same",
            "Method of comminuting ammonium nitrate prills mixed with hydrocarbon",
            "Method of producing ammonium nitrate explosive compositions having high package densities",
            "Explosive package",
            "Explosive cartridge",
            "Ammonium nitrate-fuel oil composition containing ammonium nitrate prills of different porosity,hardness,and density"
        ]
    ],
    "pageTitle": "Patent US4161142 - Blasting booster and methods - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4161142?dq=inventor:%22Arthur+R.+Hair%22&ei=VAy0Tsa4NYTl0QGQiqWiBA",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480573039,
    "recordOffset": 480546536,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49471=Tests have shown that AN-FO, as previously described, does not reach its maximum detonation velocity or pressure until the reaction travels a distance Z-3 from the primer, and usually about 2 feet. The graph of FIG. 7, taken from the periodical entitled \"Emphasis on Blasting\", published January 1975, Vol. 10, No. 4, illustrates this \"slow burn\" effect in AN-FO detonated by both one and five pound cast primers. Other primers in greater weights, such as 50 lbs of either aluminized dry mix primer, dynamite primer, or aluminized or emulsion slurry primer have somewhat similar effects, but have been omitted from the graph, since no meaningful data within two feet from such high energy primers was included., 38754=Another factor detracting from the efficiency of the blasting agent AN-FO is that of moisture. Moisture frequently present in at least the bottom and on the sides of a bore hole retards the detonation reaction of the AN-FO and if excessive, may even cause a mis-fire. The degrading effect of moisture on AN-FO is illustrated in a publication by Ensign Bickford entitled \"Emphasis on Blasting\", Vol. 10, No. 1, April 1975. In that publication, 9-10% of water results in detonation failure, while 2-8% of water reduce detonation velocity from 11,000 ft./sec. to about 8,000 ft./sec., 61912=Also, it should be noted that each booster 20 is approximately three feet long and from 4 to 6 inches in diameter. Thus, each booster does not weigh 1000 plus pounds, but is filled with booster material from a mixture batch including 800 pounds of ground prills and 200 pounds of whole prills. The poundage recitations in the examples are included merely to illustrate the ground to whole prill ratios, and the batch weight of the mixture. The total of mixture in the actual booster is only a homogeneous portion of the batch., 60780=The following are specific examples of rigid package boosters 20 according to this invention. Each of these examples, 1 through 7 is based on a booster mixture batch including about 800 pounds of ground ammonium nitrate prills formed by grinding through a 1/16\" screen, as described herein, and about 200 pounds of whole ammonium nitrate prills, plus additives as will be described, and in the weight percentages shown dictated by the combined 1000 pounds of prills and additional additive weight. The components are ground, mixed and packed into a rigid booster package 20 as described herein. The ratio of ground prills to whole prills, by weight, is maintained as close as possible to 80/20 since we have discovered that the size of the ground prills compared to the whole prills and the ratio of ground prills to whole prills is important to the booster mixture and the results obtained when such a mixture is packed in a rigid package as taught herein. The grind size and ratio taught herein provides a maximum pack density in the rigid package enclosed and promotes increased velocities and pressures.}",
    "textBeforeTable": "Patent Citations While these and other modifications and advantages will become readily apparent to those of ordinary skill in the art, without departing from the scope of the invention, and we desire to be bound only by the claims appended hereto. From the foregoing, it should thus be appreciated that the combination of the specific booster 20, in rigid package form, when coupled with the booster mixtures described herein, provides substantially increased detonation velocities and pressures at the bottom of bore-holes. This permits expanded drilling patterns, thus substantially reduced drilling costs, and resulting reductions in overall blasting operation costs. Further, as illustrated herein, it should also be appreciated that the mixtures, including the particular grind size and prill ratio, when taken in combination with the booster package disclosed herein, produce a complete booster which significantly improves the efficiency of a blasting operation over the capabilities of either booster formula or package alone. Improved preferred results of the present invention have only been achieved wherein the ground prills are ground through a 1/16 inch screen and are in a ratio in an approximate range of from about 90 to 10, ground to whole prills, to about 60 to 40, ground to whole prills. Although mixtures within these ratios may be useful for particular booster diameter and applications, the 80/20 ratio specified has produced the most efficient results. The use of different ratios in mixtures according to the invention will",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4273049 * Oct 22, 1979 Jun 16, 1981 International Minerals & Chemical Corp. Method of blasting a field with ANFO and TL-136 US4422382 * Oct 8, 1980 Dec 27, 1983 C-I-L Inc. Explosive container of interconnected thermoplastic film packages US4790890 * Dec 3, 1987 Dec 13, 1988 Ireco Incorporated Packaged emulsion explosives and methods of manufacture thereof US5159153 * Mar 16, 1992 Oct 27, 1992 Cranney Don H Emulsion that is compatible with reactive sulfide/pyrite ores US5261327 * Jan 29, 1992 Nov 16, 1993 Patrick Carney Blasting method and composition US5596165 * Sep 7, 1993 Jan 21, 1997 Carney; Patrick Blasting method and composition",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}