{
    "relation": [
        [
            "Date",
            "Oct 26, 1987",
            "Feb 4, 1992",
            "Nov 22, 1993",
            "Mar 2, 1998",
            "Mar 19, 2002",
            "Sep 4, 2002",
            "Oct 29, 2002",
            "Apr 28, 2004",
            "Oct 3, 2007",
            "Aug 27, 2009",
            "Jan 23, 2013",
            "Jan 24, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: LASER DYNAMICS, INC., 170 TECHNOLOGY CIRCLE, SCOTT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:CLEMENTS, KEN;REEL/FRAME:004786/0176 Effective date: 19871028 Owner name: LASER DYNAMICS, INC., 170 TECHNOLOGY CIRCLE, SCOTT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CLEMENTS, KEN;REEL/FRAME:004786/0176 Effective date: 19871028",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20020904",
            "",
            "Owner name: SILICON VALLEY BANK, CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:VERTICAL CIRCUITS, INC.;REEL/FRAME:019910/0394 Effective date: 20070905 Owner name: SILICON VALLEY BANK,CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:VERTICAL CIRCUITS, INC.;REEL/FRAME:019910/0394 Effective date: 20070905",
            "Owner name: VERTICAL CIRCUITS, INC., CALIFORNIA Free format text: RELEASE;ASSIGNOR:SILICON VALLEY BANK;REEL/FRAME:023148/0163 Effective date: 20090824 Owner name: VERTICAL CIRCULTS, INC., CALIFORNIA Free format text: RELEASE;ASSIGNOR:SILICON VALLEY BANK;REEL/FRAME:023148/0183 Effective date: 20090824 Owner name: VERTICAL CIRCUITS, INC.,CALIFORNIA Free format text: RELEASE;ASSIGNOR:SILICON VALLEY BANK;REEL/FRAME:023148/0163 Effective date: 20090824",
            "Owner name: VERTICAL CIRCUITS SOLUTIONS, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:VERTICAL CIRCUITS, INC.;REEL/FRAME:029683/0797 Effective date: 20121114",
            "Owner name: VERTICAL CIRCUITS, INC., CALIFORNIA Free format text: CHANGE OF NAME;ASSIGNOR:VERTICAL CIRCUITS SOLUTIONS, INC.;REEL/FRAME:029686/0255 Effective date: 20070912"
        ]
    ],
    "pageTitle": "Patent US4954875 - Semiconductor wafer array with electrically conductive compliant material - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4954875?dq=7143430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480651431,
    "recordOffset": 480615999,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23520=The present application is a continuation-in-part of application Ser. No. 06/887,129, filed July 17, 1986, now U.S. Pat. No. 4,897,708, issued Jan. 30, 1990, entitled \"Semiconductor Wafer Array\" and assigned to the assignee of the present application.}",
    "textBeforeTable": "Patent Citations While several embodiments of the present invention are described above, it is contemplated that various modifications may be made thereto without departing from the spirit and scope of the present invention. For example, the second etch described above for making the hole 38 may be an isotropic etch thereby producing the same sized hole but with parallel sidewalls. Of course, the pads 45 may be similarly shaped. In all cases, the methods and means used for forming the vias and the wads comprise conventional semiconductor wafer processing techniques. Accordingly, it is intended that the embodiments described be considered only as illustrative of the present invention and that the scope thereof should not be limited thereto but be determined by reference to the claims hereinafter provided and their equivalents. r is a constant having a value less than unity, (e.g. 0.1-0.2.) t is the thickness of the wafer 10 and s1 is the width of the apex of the vias 25, where s2=s1+√2 t-2√2 rt Referring to FIG. 15, the width s2 of the vias 25 is given by the equation Referring to FIG. 14, there is provided in an alternative embodiment of the present invention a wad of electrically conductive compliant wire material 55. Wad 55 is substantially identical to wad 45 described above with respect to FIGS. 11 and 12 with the exception that the wad 55 is made to extend",
    "textAfterTable": "Title not available * Cited by examiner Non-Patent Citations Reference 1 * Bassous Fabrication of Novel Three Dimensional Micro Structures by the Anisotropic Etching of (100) and (110) Silicon, IEEE Transactions on Electron Devices, vol. ED 25, No. 10, Oct., 1978. 2 Bassous-Fabrication of Novel Three-Dimensional Micro-Structures by the Anisotropic Etching of (100) and (110) Silicon, IEEE Transactions on Electron Devices, vol. ED-25, No. 10, Oct., 1978. 3 * Bernhard Focus on Conductive Elastomers, Electronic Design, Nov. 20, 1986, pp. 149 154. 4 Bernhard-Focus on Conductive Elastomers, Electronic Design, Nov. 20, 1986, pp. 149-154. 5 * Dawson Button Board: The Short Cut Connector; Connection Technology, Nov. 1986, pp. 15 16. 6 Dawson-Button-Board: The Short-Cut Connector; Connection Technology, Nov. 1986, pp. 15-16. 7 Fang, \"Interplanar LSI Structure,\" IBM Technical Disclosure Bulletin, vol. 20, No. 4, Sep. 1977, pp. 1604-1605.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}