{
    "relation": [
        [
            "Citing Patent",
            "US7379107 *",
            "US7440018 *",
            "US7564492 *",
            "US7701495 *",
            "US8576311 *",
            "US9001239 *",
            "US20040150733 *",
            "US20140035967 *"
        ],
        [
            "Filing date",
            "10 Dec 2004",
            "23 Aug 2005",
            "12 Nov 2003",
            "24 Feb 2005",
            "18 Jun 2009",
            "3 Oct 2013",
            "12 Nov 2003",
            "3 Oct 2013"
        ],
        [
            "Publication date",
            "27 May 2008",
            "21 Oct 2008",
            "21 Jul 2009",
            "20 Apr 2010",
            "5 Nov 2013",
            "7 Apr 2015",
            "5 Aug 2004",
            "6 Feb 2014"
        ],
        [
            "Applicant",
            "Eastman Kodak Company",
            "Fujifilm Corporation",
            "Panasonic Corporation",
            "Sanyo Electric Co., Ltd.",
            "Sony Corporation",
            "Sony Corporation",
            "Matsushita Electric Industrial Co., Ltd.",
            "Sony Corporation"
        ],
        [
            "Title",
            "Image sensor for still or video photography",
            "Driving method of solid-state imaging apparatus and solid-state imaging apparatus",
            "Solid-state image sensing device and camera using the same",
            "Image capture device and controller of image capture device",
            "Image processing apparatus, image processing method and manufacturing apparatus",
            "Image processing apparatus, image processing method and manufacturing apparatus",
            "Solid-state image sensing device and camera using the same",
            "Image processing apparatus, image processing method and manufacturing apparatus"
        ]
    ],
    "pageTitle": "Patent US7199826 - Thin-out drive method for CCD image sensor - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US7199826",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486360687,
    "recordOffset": 486333318,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34564=In the digital still camera using a solid-state image pickup device, it is essential to have an image confirming function (movie mode) to confirm an image according to a movie picture produced by the camera. The number of pixels of the solid-state image pickup device is increasing every year. Solid-state image pickup devices available in the market have about 330 thousand pixels in 1996, about 800 thousand pixels in 1997, 1.5 million pixels in 1998, and more than 3 million pixels in 2000., 33885=This application is based on and claims priority of Japanese Patent Application No. 2001-064917, filed on Mar. 8, 2001, the whole contents of which are incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations While the present invention has been described with reference to the particular illustrative embodiments, it is not to be restricted by those embodiments but only by the appended claims. It is to be appreciated that those skilled in the art can change or modify the embodiments without departing from the scope and spirit of the present invention. The control technique of the solid-state image pickup device of the embodiment is not restricted by the above configuration, but is naturally also applicable to solid-state image pickup devices of other configurations. As above, the unit of color layout in the solid-state image pickup device can includes two rows and three rows. It is possible to expand this idea such that the unit includes n rows, where n is an integer equal to or more than two. The readout photoelectric converter rows (groups) used for the signal readout operation and those not used therefor are arranged with an equal interval in the row direction. This consequently reduces the influence of the false color. In the solid-state image pickup device, before the signal charge is transferred to the horizontal charge transfer channel region, signal charge of three pixels of the same color is added to each other in the vertical charge transfer channel region. Therefore, the amount of signals and hence the sensitivity is tripled, and a bright mobile picture is obtained. In an",
    "textAfterTable": "US7379107 * 10 Dec 2004 27 May 2008 Eastman Kodak Company Image sensor for still or video photography US7440018 * 23 Aug 2005 21 Oct 2008 Fujifilm Corporation Driving method of solid-state imaging apparatus and solid-state imaging apparatus US7564492 * 12 Nov 2003 21 Jul 2009 Panasonic Corporation Solid-state image sensing device and camera using the same US7701495 * 24 Feb 2005 20 Apr 2010 Sanyo Electric Co., Ltd. Image capture device and controller of image capture device US8576311 * 18 Jun 2009 5 Nov 2013 Sony Corporation Image processing apparatus, image processing method and manufacturing apparatus US9001239 * 3 Oct 2013 7 Apr 2015 Sony Corporation Image processing apparatus, image processing method and manufacturing apparatus US20040150733 * 12 Nov 2003 5 Aug 2004 Matsushita Electric Industrial Co., Ltd. Solid-state image sensing",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}