{
    "relation": [
        [
            "TWV",
            "54 : D2",
            "54 : Es1",
            "54 : F1",
            "54 : B2"
        ],
        [
            "Title",
            "Concerto for Violin and 3 Horns",
            "Concerto for 2 Horns",
            "Concerto for Violin, Oboe and 2 Horns",
            "Concerto for 2 Recorders and 2 Oboes"
        ],
        [
            "Scoring",
            "Vl, 3 Horns, Strings, Bc",
            "2 Horns, Strings, Bc",
            "Vl, Ob, 2 Horns, Strings, Bc",
            "2 Rec, 2 Ob, Strings, Bc"
        ],
        [
            "Key",
            "D major",
            "E flat major",
            "F major",
            "B flat major"
        ],
        [
            "Genre",
            "Concertos",
            "Concertos",
            "Concertos",
            "Concertos"
        ],
        [
            "Date",
            "",
            "",
            "",
            ""
        ],
        [
            "Notes",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "List of works by Georg Philipp Telemann - IMSLP/Petrucci Music Library: Free Public Domain Sheet Music",
    "title": "",
    "url": "http://www.imslp.org/wiki/List_of_compositions_by_Georg_Philipp_Telemann",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 509144183,
    "recordOffset": 509112656,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 13 Jun 2015 19:51:46 GMT",
    "textBeforeTable": "TVWV1 - Church cantatas Sacred vocal For a pretty complete list look at http://home.arcor.de/kbhartmann/KATALOGE/telemg.kat Only Works in IMSLP included, the list isn't yet completed. Listed by TWV-Numbers 3.3 Publications outside of Germany 3.2 Publications in Germany after 1740 3.1.2 published in Hamburg 3.1.1 published in Frankfurt/Main 3.1 Publications at own expense until 1740 3 Compositions published in lifetime 2 Works without TWV-Numbers 1.5.6 TWV55 - Orchestral suites 1.5.5 TWV54 - Concertos for 4 or more instruments and orchestra 1.5.4 TWV53 - Concertos for 3 instruments and orchestra 1.5.3 TWV52 - Concertos for 2 instruments and orchestra 1.5.2 TWV51 - Concertos for solo instrument and orchestra 1.5.1 TWV50 - Symphonies, divertimenti, marches 1.5 Music for orchestra 1.4.6 TWV45 - Polish dances from the Rostock manuscript 1.4.5 TWV44 - Chamber music for 4 or more instruments with basso continuo",
    "textAfterTable": "1 : 306 Der mit Sünden beleidigte Heiland Voice, Ob, Vl, Bc A minor Cantatas 1731 New year's day 1 : 313 Der Reichtum macht allein beglückt Voice, Ob, Bc C major Cantatas 1725-26 Lent, 2. sunday of 1 : 504 Es ist ein köstlich Ding SATB, 2 Ob, 2 Vl, Va, Vcl, Bc C minor Cantatas Easter, 3. sunday after 1 : 617 Gesegnet ist die Zuversicht Voices, 2 Fl, 2 Vl, Va, Bc Cantatas 1717 Trinity, 07. sunday after (also attributed to J.S. Bach, BWV Anh. 1) 1 : 634 Gott der Hoffnung erfülle euch Soloists: SATB; Choir SATB; Orchestra: 2 Horns, 2 Vl, Va, Bc D major Cantatas 1723 Pentecost (also attributed to J.S. Bach, BWV 218) 1 : 805 Hirt und Bischof unsrer Seelen Voice, Vl, Bc G major Cantatas",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}