{
    "relation": [
        [
            "Name and position",
            "Blais, Jean-Pierre",
            "Canadian Radio-television and Telecommunications Commission",
            "Full-time member and Chairperson",
            "Smith, The Hon. Heather J.",
            "Government of Ontario",
            "Administrator",
            "June 15, 2012 to June 30, 2012",
            "Strahl, The Hon. Chuck, P.C.",
            "Security Intelligence Review Committee",
            "Chairman",
            "Weissenberger, Angela Tu",
            "Canada Deposit Insurance Corporation",
            "Member of the Board of Directors"
        ],
        [
            "Order in Council",
            "2012-796",
            "",
            "",
            "2012-807",
            "",
            "",
            "",
            "2012-798",
            "",
            "",
            "2012-797",
            "",
            ""
        ]
    ],
    "pageTitle": "ARCHIVED — Canada Gazette – GOVERNMENT NOTICES",
    "title": "Appointments from the Office of the Registrar General",
    "url": "http://canadagazette.gc.ca/rp-pr/p1/2012/2012-06-30/html/notice-avis-eng.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 36860527,
    "recordOffset": 36818885,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{14591=10. Approvals: The Permittee shall obtain from the permit-issuing office a letter of approval for each loading and disposal activity prior to undertaking the work, and conduct these activities in accordance with the relevant letter of approval. The Permittee shall follow the procedures outlined in the document titled “Multi-Site Excavation Projects Involving Disposal at Sea: Requests for Letters of Approval — Standard Procedures” (February 2011)., 38867=Compared to its key competitors for international students, Canada is the only country that has not put in place an International Student Program integrity framework that requires international students to pursue study after entry, and that limits the types of educational institutions that are eligible to host international students. The number of international students choosing Canada as a study destination has been on the rise in recent years. In 2011, 98 378 international students entered Canada, an increase of 34% since 2007. A 2010 study commissioned by Foreign Affairs and International Trade Canada found international students contributed more than $6.5 billion to the Canadian economy in 2008. Despite these successes, the International Student Program continues to be vulnerable to fraud and abuse from those who would exploit either study permit holders or the program itself for personal gain. An evaluation of the International Student Program released by CIC in 2010 concluded that gaps in the Department’s regulatory and policy framework leave the International Student Program vulnerable to potential misuse., 17474=Notice is hereby given that, pursuant to section 127 of the Canadian Environmental Protection Act, 1999, Disposal at Sea Permit No. 4543-2-03550 authorizing the loading for disposal and the disposal of waste or other matter at sea is approved., 10333=15.2. The loading and disposal at sea referred to under this permit shall be carried out in accordance with the mitigation measures summarized in the report titled “Environmental Assessment Report — Matcon Excavation and Shoring Ltd. — Loading and Disposal at Sea — 4543-2-03550” (June 2012)., 26423=No new applications in this class will be accepted on or after July 1, 2012. This pause is being implemented until further notice to manage inventory pressures., 23190= 4. Loading site(s): Thunderbird Marina, West Vancouver, British Columbia, at approximately 49°21.37′ N, 123°16.19′ W (NAD83), as described in the figure titled “Proposed Dredging Thunderbird Marina, West Vancouver, BC” (May 2012), submitted in support of the permit application., 9549=Notice is hereby given that, pursuant to section 127 of the Canadian Environmental Protection Act, 1999, Disposal at Sea Permit No. 4543-2-03551 authorizing the loading for disposal and the disposal of waste or other matter at sea is approved., 28114=No new Federal Skilled Worker applications will be accepted on or after July 1, 2012, excluding those applications for the PhD eligibility stream and those with a qualifying offer of arranged employment., 28857=All applications received by designated CIC offices prior to July 1, 2012, shall continue to be considered for processing according to the Ministerial Instructions in place at the time of their receipt., 27101=Complete applications with a qualifying offer of arranged employment will continue to be put into processing without regard to a cap, as established in the Ministerial Instructions that came into effect on July 1, 2011., 26161=As per Instructions that came into force on July 1, 2011, a temporary pause remains in place for all new applications in this class., 23323= 3. Duration of permit: Permit is valid from November 1, 2012, to October 31, 2013., 27652=Complete applications for the PhD eligibility stream, the criteria for which were established by Ministerial Instructions that came into force on November 5, 2011, will continue to be put into processing until the annual cap of 1 000 is reached. The current cap year for the PhD stream ends on October 31, 2012, unless otherwise indicated in a future Ministerial Instruction. Subsequent years will be calculated from November 1 to October 31, unless otherwise indicated in a future set of Ministerial Instructions., 13842=12.1. By accepting this permit, the Permittee and their contractors accept that they are subject to inspection pursuant to Part 10 of the Canadian Environmental Protection Act, 1999., 2452=Pursuant to paragraph 71(1)(b) of the Canadian Environmental Protection Act, 1999, notice is hereby given that the Minister of the Environment requires, for the purpose of assessing whether the substances listed in Schedule 1 to this notice are toxic or are capable of becoming toxic, or for the purpose of assessing whether to control, or the manner in which to control the listed substances, any person described in Schedule 2 to this notice who possesses or who may reasonably be expected to have access to the information required in Schedule 3 to this notice, to provide that information no later than October 30, 2012, 5 p.m. Eastern Daylight Saving Time., 23994=Notice is hereby given that, pursuant to section 127 of the Canadian Environmental Protection Act, 1999, Disposal at Sea Permit No. 4543-2-03497 authorizing the loading for disposal and the disposal of waste or other matter at sea is approved., 29036=These Instructions will come into force on July 1, 2012, and apply to applications received by designated CIC offices on or after July 1, 2012., 3371=14.2. The loading and disposal at sea referred to under this permit shall be carried out in accordance with the mitigation measures summarized in the report titled “Environmental Assessment Report — Fraser River Pile & Dredge (GP) Inc. — Richmond Plywood. Loading and Disposal at Sea — 4543-2-03551” (June 2012)., 21789=11.1. By accepting this permit, the Permittee and their contractors accept that they are subject to inspection pursuant to Part 10 of the Canadian Environmental Protection Act, 1999., 18266=14.2. The loading and disposal at sea referred to under this permit shall be carried out in accordance with the mitigation measures summarized in the report titled “Environmental Assessment Report — Thunderbird Marine Corp. — Thunderbird Marina: Loading and disposal at sea — 4543-2-03497” (June 2012)., 8501= 3. Duration of permit: Permit is valid from October 10, 2012, to October 9, 2013., 16691= 3. Duration of permit: Permit is valid from July 30, 2012, to July 29, 2013., 1736=Responses to this notice shall be submitted to the Minister of the Environment, to the attention of the Substances Management Coordinator, Chemicals Management Plan, 200 Sacré-Cœur Boulevard, Gatineau, Quebec K1A 0H3. Inquiries concerning the notice may be directed to the Substances Management Coordinator at the above address, at 1-800-567-1999 (toll free in Canada) or 819-953-7156 (outside of Canada) [telephone], 819-953-7155 (fax), or substances@ec.gc.ca (email)., 24555=Applicants in the Federal Skilled Worker and Federal Immigrant Investor Classes whose applications are received on or after July 1, 2012, and which do not meet the criteria described above, shall be informed that their application does not qualify for processing and their processing fees shall be returned., 8369= 4. Loading site(s): Richmond Plywood, Richmond, British Columbia, at approximately 49°12.12′ N, 123°04.23′ W (NAD83), as described in the drawing titled “Sampling Locations & Dredge Envelope — Richmond Plywood Benthic Sediment Sampling in Support of Loading and Ocean Disposal” (June 2010), as submitted in support of the permit application., 25714=As per Instructions that came into force on November 5, 2011, a temporary pause remains in place for new sponsorship applications for parents and grandparents.}",
    "TableContextTimeStampAfterTable": "{13958=Provide the information no later than October 30, 2012, 5 p.m. Eastern Daylight Saving Time, to the Minister of the Environment, to the attention of the Substances Management Coordinator Chemicals Management Plan 200 Sacré-Cœur Boulevard, Gatineau, Quebec K1A 0H3 Email: Substances@ec.gc.ca Telephone: 1-800-567-1999 (toll free in Canada) or 1-819-953-7156 (outside of Canada) Fax: 819-953-7155 www.chemicalsubstanceschimiques.gc.ca, 162420=16/05/2012, 155074=Koenig, J. Q., Jansen, K., Mar, T. F., Lumley, T., Kaufman, J., Trenga, C. A., Sullivan, J., Liu, L.-S., Shapiro, G. G. and Larson, T. V. (2003) “Measurement of Offline Exhaled Nitric Oxide in a Study of Community Exposure to Air Pollution.” Environmental Health Perspectives, 111(13): 1625–1629., 173088=The Department is hereby providing an opportunity for interested parties to comment on its intention to approve FreeHD’s application for a temporary licence to operate a 14-14.5 GHz and 12.2-12.7 GHz satellite on a no-protection, no-interference basis at the 95.5°W orbital position., 154713=Health Canada. (2010) Health Canada Exposure Assessment Studies: PM2.5 Sampling Data Summary. “Report: HC-IACAS-2010-09 — PM Data” (unpublished)., 19129=Imported in 2011, 168882=03/05/2012, 144245=Provide your information no later than October 30, 2012, 5 p.m., Eastern Daylight Saving Time, to the Minister of the Environment, to the attention of the Substances Management Coordinator, Chemicals Management Plan, 200 Sacré-Cœur Boulevard, Gatineau, Quebec K1A 0H3, substances@ec.gc.ca (email), 1-800-567-1999 (toll free in Canada) or 819-953-7156 (outside of Canada), 819-953-7155 (fax). An electronic copy of this notice is available at the following Web site: www. chemicalsubstanceschimiques.gc.ca., 172621=FreeHD Canada Inc. plans to use this satellite until its permanent satellite is brought into use in 2015. FreeHD Canada Inc. will then use a 17 GHz band broadcasting satellite at the 95°W position. This 17 GHz satellite will be operated by 95W Canadian Satellite Communications Inc., which has an approval to build and launch a satellite operating in this frequency range., 81688=12. (1) For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:, 153599=Allen, R. W., Mar, T., Koenig, J., Liu, L.-S., Gould, T., Simpson, C. and Larson, T. (2008) “Changes in Lung Function and Airway Inflammation Among Asthmatic Children Residing in a Woodsmoke-Impacted Urban Area.” Inhalation Toxicology, 20(4): 423–433., 178635=That certain lot, piece or parcel of land situate, lying and being in the City of Saint John, County of Saint John, Province of New Brunswick, designated, described and shown as “Water Street a Public Street, 645 m2 on Plan of Survey Showing portion of Water Street, Saint John County, New Brunswick”, prepared by Hughes Surveys & Consultants Inc. and dated September 8, 2011, and filed in the Saint John County Registry Office on October 14th, 2011 as Number 30721998., 166794=29/05/2012, 165116=18/05/2012, 159960=Notice is hereby given that His Excellency the Governor General in Council, by Order in Council dated May 17, 2012, has been pleased to change the name of the Chambre de commerce et d’industrie de l’Est de l’île de Montréal / The East Island of Montreal Chamber of Commerce and Industry to the Chambre de commerce de l’Est de Montréal Eastern Montreal Chamber of Commerce upon petition made therefore under section 39 of the Boards of Trade Act., 29406=9. (1) For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information from any calendar year:, 157575=2012-796, 3814=1. This notice applies to any person who, during the 2011 calendar year, manufactured a total quantity greater than 100 kg of a substance listed in Schedule 1 to this notice, at any concentration., 18980=Manufactured in 2011, 79017=11. For each substance listed in Part 2 of Schedule 1 that a person manufactured or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:, 159028=2012-797, 170532=24/02/2012, 74738=9. (2) For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information from any calendar year:, 76649=10. For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:, 179387=Issued under my hand this 18th day of June 2012., 165610=21/02/2012, 165206=281663-6, 169199=07/05/2012, 164399=26/04/2012, 162523=June 21, 2012, 163843=19/04/2012, 159417=June 22, 2012, 143862=For additional information on the Act and the Compliance andEnforcement Policy for the Canadian Environmental Protection Act, 1999 and on applicable penalties, please contact the Enforcement Branch at enforcement.environmental@ec.gc.ca. A copy of the Policy is available at the following Internet site: www.ec.gc.ca/CEPAregistry/policies., 4046=2. This notice applies to any person who, during the 2011 calendar year, imported a total quantity greater than 100 kg of a substance listed in Schedule 1 to this notice, at any concentration, whether alone, in a mixture or in a product., 178065=2. Schedule B of the Letters Patent is amended by adding the following before the phrase “SAVING AND EXCEPTING thereout and therefrom that lot, piece and parcel of land entrusted to the Canadian National Railway by Federal Privy Council Order 1449 dated May 9, 1979.”:, 170900=10/04/2012, 165865=27/04/2012, 162024=10/05/2012, 136912=On October 8, 2011, the Minister of the Environment and the Minister of Health announced, as part of the second phase of the Chemicals Management Plan (CMP 2), in the Canada Gazette, Part Ⅰ, Vol. 145, No. 41, that approximately 500 substances divided into nine groups have been selected as priorities for action, and are planned to be assessed and managed, where appropriate, over the next five years. These substances have been selected for further action based on the categorization exercise completed in 2006, and new information received as part of the first phase of the Chemicals Management Plan., 169933=01/05/2012, 164648=30/04/2012, 8681=3. Where information required under Schedule 3 to this notice was submitted to the Minister of the Environment, after January 1, 2007, it may be relied on as a response to any question in Schedule 3 to this notice if, 155734=Liu, L., Ruddy, T., Dalipaj, M., Poon, R., Szyszkowicz, M., You, H., Dales, R. E. and Wheeler, A. J. (2009) “Effects of Indoor, Outdoor, and Personal Exposure to Particulate Air Pollution on Cardiovascular Physiology and Systemic Mediators in Seniors.” Journal of Occupational and Environmental Medicine, 51(9): 1088–1098., 143292=The Environmental Enforcement Act, chapter 14 of the Statutes of Canada, 2009, will amend the above provisions when section 72 of the Environmental Enforcement Act comes into force. The above provisions of the Act have been reproduced for convenience of reference only. If there is any variance between the above provisions and the wording of the Act, the official version of the Act prevails. For all purposes of interpreting and applying the law, readers should consult the official versions of Acts of Parliament., 182955=Footnote 7 A list of six-digit North American Industry Classification System (NAICS) codes is available at the following Statistics Canada Web site: www.statcan.gc.ca/access_acces/alternative_ alternatif.action?l=eng&loc=http://www.statcan.gc.ca/pub/12-501-x/12-501-x2012001-eng.pdf&teng=North%20American%20Industry%20Classification%20System%20(NAICS) %20Canada%202012&tfra=Le%20Syst%E8me%20de%20classification%20des%20industries %20de%20l'Am%E9rique%20du%20Nord%20(SCIAN)%20Canada%202012. Note that the NAICS code(s) Internet address is case sensitive., 156646=World Health Organization (WHO) [2005]. Air Quality Guidelines for Particulate Matter, Ozone, Nitrogen Dioxide and Sulfur Dioxide. Global update 2005. Summary of risk assessment., 160470=May 28, 2012, 158047=2012-807, 149483=The acceptable long- and short-term exposure ranges established in the 1987 exposure guidelines should be rescinded and replaced with this new guidance focusing on indoor source control to minimize long-term exposure to PM2.5 indoors., 146116=June 18, 2012, 156102=Trenga, C. A., Sullivan, J. H., Schildcrout, J. S., Shepherd, K. P., Shapiro, G. G., Liu, L.-S., Kaufman, J. D. and Koenig, J. Q. (2006) “Effect of Particulate Air Pollution on Lung Function in Adult and Pediatric Subjects in a Seattle Panel Study.” CHEST, 129(6): 1614–1622., 158603=2012-798, 12138= Pursuant to section 313 of the Canadian Environmental Protection Act, 1999, I request that the following parts of the information that I am submitting be treated as confidential. (Specify the parts [e.g. sections, tables, attachments, previously submitted unpublished studies or data] of the information that you request be treated as confidential.), 161814=09/05/2012, 145127=Pursuant to subsection 55(3) of the Canadian Environmental Protection Act, 1999, the Minister of Health hereby gives notice of guidance for fine particulate matter (PM2.5) in residential indoor air. The guidance recommends that the existing residential indoor air exposure limits for fine particulate matter, as established by the 1987 Health Canada Exposure Guidelines for Residential Indoor Air Quality, be rescinded, as they are no longer supported by the available scientific evidence. No new numerical exposure limits for indoor air are proposed. Rather, any reduction in indoor levels of PM2.5 is expected to be associated with health benefits, particularly for sensitive individuals. The guidance recommends strategies to reduce exposure to indoor PM2.5, including, 181768=Footnote 5 A list of six-digit North American Industry Classification System (NAICS) codes is available at the following Statistics Canada Web site: www.statcan.gc.ca/access_acces/alternative_alternatif.action?l=eng&loc=http://www.statcan. gc.ca/pub/12-501-x/12-501-x2012001-eng.pdf&teng=North%20American%20Industry %20Classification%20System%20(NAICS)%20Canada%202012&tfra=Le%20Syst%E8me %20de%20classification%20des%20industries%20de%20l'Am%E9rique%20du%20Nord %20(SCIAN)%20Canada%202012. Note that the NAICS code(s) Internet address is case sensitive., 11169=Contact name for CEPA 1999 section 71 notices: ______________________, 177479=SAVING AND EXCEPTING thereout and therefrom that certain lot, piece or parcel of land situate, lying and being in the City of Saint John, in the County of Saint John, and Province of New Brunswick, designated, described and shown as Parcel 11-01 on Subdivision Plan Parcel 11-01, Saint John Port Authority Property, Lower Cove Loop, City of Saint John, Saint John County, New Brunswick, prepared by Hughes Surveys & Consultants Inc. dated October 12, 2011 and filed in the Saint John County Registry Office on October 31, 2011 as Number 30786421., 173412=Interested parties should submit their comments or interest in the licence no later than July 30, 2012. All comments received will be posted on Industry Canada’s Spectrum Management and Telecommunications Web site at www.ic.gc.ca/spectrum. The Department will consider all comments in arriving at a final decision on the application., 14504=5. For each substance listed in Schedule 1 that a person imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration of less than 0.1 percent by weight (w/w%), the person shall provide the following information:, 161641=362089-1, 89859=13. (1) For each substance listed in Schedule 1 that a person manufactured or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:, 137560=As part of the CMP 2, a grouping of certain substituted diphenylamine substances will be assessed, and are part of this notice. This substituted diphenylamine grouping is based on the chemical similarity and common use as an antioxidant in lubricants of the substances in Canada, although they may also be used in plastics and rubbers. These substances are all potential alternatives for BNST (Benzenamine, N-phenyl-, reaction products with styrene and 2,4,4-trimethylpentene), which is considered to be toxic under the Canadian Environmental Protection Act, 1999 (CEPA 1999). Prohibition of BNST via proposed regulations will likely increase the use of these substances, and addressing these substances may inform potential substitution for BNST., 175567=WHEREAS Letters Patent were issued by the Minister of Transport (“Minister”) for the Saint John Port Authority (“Authority”) under the authority of the Canada Marine Act (“Act”) effective May 1, 1999;, 168438=441416-1, 146559=Fine particulate matter (PM2.5) is a general term for all small particles found in air measuring equal to or less than 2.5 μm in aerodynamic diameter. It is a complex mixture whose constituents vary in size, shape, density, surface area, and chemical composition (Health Canada and Environment Canada 1999; United States Environmental Protection Agency [U.S. EPA] 2009). In 1987, Health Canada published Exposure Guidelines for Residential Indoor Air Quality, which set maximum acceptable long- and short-term exposure ranges for PM2.5 in homes. These guidelines are being revised to reflect the most up-to-date science on the health effects and residential exposure for PM2.5., 172044=The interim satellite will use the frequency bands 14-14.5 GHz (Earth-space) and 12.2-12.7 GHz (space-Earth) at the 95.5°W orbital location. The satellite will operate at low power and is not expected to cause interference to other existing satellite systems. As a normal condition of licence, FreeHD Canada Inc. will also be required to coordinate with nearby satellites. FreeHD Canada Inc. will use the capacity on its interim satellite, in addition to some capacity on foreign satellites, to begin offering its services in early 2013., 22459=8. (1) For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:, 19274=Used in 2011, 7431=“calendar year” means a period of 12 consecutive months commencing on January 1., 166106=02/05/2012, 158389=June 15, 2012 to June 30, 2012, 155416=Koenig, J. Q., Mar, T. F., Allen, R. W., Jansen, K., Lumley, T., Sullivan, J. H., Trenga, C. A., Larson, T. V. and Liu, L.-S. (2005) “Pulmonary Effects of Indoor- and Outdoor-Generated Particles in Children with Asthma.” Environmental Health Perspectives, 113(4): 499–503., 175029=June 30, 2012, 163933=031189-8, 4319=3. This notice applies to any person who, during the 2011 calendar year, used a total quantity greater than 1 000 kg of a substance listed in Schedule 1 to this notice, at any concentration, whether the substance is used alone, in a mixture or in a product, in the manufacture of a mixture, product or manufactured item., 19415=Exported in 2011, 20691=7. (1) For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:, 138681=Pursuant to subsection 71(3) of CEPA 1999, every person to whom this notice applies is required to comply with this notice within the time specified in the notice. The time specified in this notice is October 30, 2012, 5 p.m., Eastern Daylight Saving Time., 164895=04/06/2012, 165955=052627-4, 164161=15/05/2012, 17107=6. For each substance listed in Schedule 1 that a person manufactured, imported or used during the 2011 calendar year, in respect of which the person meets the criteria set out in Schedule 2, at a concentration equal to or above 0.1 percent by weight (w/w%), the person shall provide the following information:}",
    "textBeforeTable": "Part 1 Substances Substances SCHEDULE 1 MARGARET KENNY Director General Chemicals Sector Directorate DAVID MORIN Director General Science and Risk Assessment Directorate On behalf of the Minister of the Environment Pursuant to subsection 71(4) of the Act, the Minister of the Environment may, on request in writing from any person to whom this notice applies, extend the time or times within which the person shall comply with this notice. The person seeking such extension shall submit a request to the Minister of the Environment, to the attention of the Substances Management Coordinator, Chemicals Management Plan, 200 Sacré-Cœur Boulevard, Gatineau, Quebec K1A 0H3. Pursuant to section 313 of the Act, any person who provides information in response to this notice may submit, with the information, a written request that the information or part of it be treated as confidential. Responses to this notice shall be submitted to the Minister of the Environment, to the attention of the Substances Management Coordinator, Chemicals Management Plan, 200 Sacré-Cœur Boulevard, Gatineau, Quebec K1A 0H3. Inquiries concerning the notice may be directed to the Substances Management Coordinator at the above address, at 1-800-567-1999 (toll free in Canada) or 819-953-7156 (outside of Canada) [telephone], 819-953-7155 (fax), or substances@ec.gc.ca (email). Pursuant to paragraph 71(1)(b) of the Canadian Environmental Protection Act, 1999, notice is hereby given that the Minister of the Environment requires, for the purpose of assessing whether the substances listed",
    "textAfterTable": "68608-77-5 Benzenamine, 2-ethyl-N-(2-ethylphenyl)-, (tripropenyl) derivs. 68608-79-7 Benzenamine, N-phenyl-, (tripropenyl) derivs. 184378-08-3 Benzenamine, N-phenyl-, reaction products with isobutylene and 2,4,4-trimethylpentene SCHEDULE 2 Persons Required to Provide Information 1. This notice applies to any person who, during the 2011 calendar year, manufactured a total quantity greater than 100 kg of a substance listed in Schedule 1 to this notice, at any concentration. 2. This notice applies to any person who, during the 2011 calendar year, imported a total quantity greater than 100 kg of a substance listed in Schedule 1 to this notice, at any concentration, whether alone, in a mixture or in a product. 3. This notice applies to any person who, during the 2011 calendar year, used a total quantity greater than 1 000 kg of a substance listed in Schedule 1 to this notice, at any concentration, whether the substance is used alone, in a mixture or in a product, in the manufacture of a mixture, product or manufactured item. 4. (1) This notice does not apply to a substance listed in Schedule 1, whether alone, in a mixture, or in a product that (a) is in transit through Canada; (b) is a fuel or fuel additive, or is contained in a fuel or fuel additive; (c) is, or is contained in, a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}