{
    "relation": [
        [
            "Period",
            "Apr",
            "Mar-Apr",
            "Feb-Apr",
            "Jan-Apr",
            "Dec-Apr",
            "Nov-Apr",
            "Oct-Apr",
            "Sep-Apr",
            "Aug-Apr",
            "Jul-Apr",
            "Jun-Apr",
            "May-Apr"
        ],
        [
            "Rank",
            "35th wettest ( 74th driest)",
            "28th wettest ( 81st driest)",
            "52nd wettest ( 57th driest)",
            "38th driest",
            "27th driest",
            "11th driest",
            "7th driest",
            "9th driest",
            "6th driest",
            "5th driest",
            "9th driest",
            "6th driest"
        ]
    ],
    "pageTitle": "Drought - April 2002 | National Centers for Environmental Information (NCEI)",
    "title": "Precipitation Ranks for the Northeast Region, 2001-2002",
    "url": "http://www.ncdc.noaa.gov/sotc/drought/200204",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 612829807,
    "recordOffset": 612809885,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7553=NCEI added Alaska climate divisions to its nClimDiv dataset on Friday, March 6, 2015, coincident with the release of the February 2015 monthly monitoring report. For more information on this data, please visit the Alaska Climate Divisions FAQ., 27182=The rainy season (October-April) for the West region started out wet, but the last four months have been drier than normal regionwide (see top right graph below). January-April 2002 ranked as the ninth driest January-April on record for the region (see bottom right graph below). The last 12 months ranked as the 17th driest May-April on record for the region.}",
    "textBeforeTable": "April continued the precipitation pattern of recent months, with Pacific storms bringing limited drought relief to the Pacific Northwest and northern Rockies while the southern portions of the West continued dry. On a regional basis, the Pacific Northwest had the 29th wettest April in the last 108 years, while April 2002 ranked 35th driest in the West region and 12th driest in the Southwest. Reservoir levels across the West were still generally below-average, reflecting dry conditions in the very long-term (24 months or longer) in some areas and low snowpack this season in others. The rainy season (October-April) for the West region started out wet, but the last four months have been drier than normal regionwide (see top right graph below). January-April 2002 ranked as the ninth driest January-April on record for the region (see bottom right graph below). The last 12 months ranked as the 17th driest May-April on record for the region. Western U.S. Drought The Keetch-Byram Drought Index (KBDI) is used by the Wildland Fire Assessment System to monitor the risk of wildfires. The early May KBDI showed dry conditions in the Desert Southwest, along the Rio Grande Valley, parts of the southern and northern Plains, and across Florida",
    "textAfterTable": "larger image larger image The Southwest region has experienced persistently dry conditions for much of the last eleven months (see top right graph below). Mountain snowpack was essentially gone from the southern portions (Arizona and New Mexico) of the region by the end of April and considerably below average elsewhere in the region. Measurements of snow water equivalent ranged from 25 to 50 percent of average, or less. January-April 2002 ranked as the second driest such year-to-date on record regionwide, and May-April ranked as the third driest such 12-month period. Several other seasons within the last year have ranked as second or third driest (see table below). Precipitation Ranks for the Southwest Region, 2001-2002 Period Rank Apr 12th driest Mar-Apr 9th driest Feb-Apr 2nd",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}