{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I am in Greek Life. It's not national so it's not as big of a deal as at some other larger schools.",
            "Dancers and actors",
            "There's a very nice park just five minutes walk from campus.",
            "Join organizations",
            "Make sure you can afford the steep tuition.",
            "The university has small class sizes which makes learning a much more enjoyable experience. The campus is beautiful and location is great. The food isn't that great, but hey, there's grocery stores near by."
        ]
    ],
    "pageTitle": "Otterbein University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Otterbein-University/reviews?_escaped_fragment_=/show/2544",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905882471,
    "recordOffset": 905830616,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19187=I am hoping to attend Otterbein in the fall of 2012. When I visited, I absolutely loved it; Everyone was really friendly and seemed authentically interested in me and my plans. I would highly recommend!, 38081=So much! We have free movie nights at our local movie theater. Donut runs at 1:00 am. (Best donuts ever) Many organizations and clubs for everyone!, 125718=The biggest tradition that Otterbein has is 'donut runs'. There is a bakery in Uptown Westerville that opens at 1:30AM during the week, It's great after a long night of studying to run up to Schneider's and grab a fresh donut and a carton of milk for only $1!, 197484=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "05/21/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 42 Tara from Columbus, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Otterbein University Reviews Otterbein University › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Lauren from Cincinnati, OH 06/09/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 9 people found this review useful. 2 of 42 Categories Comments Tips for prospective students I really love the small school and home town feel of campus. Everyone, from my local counselor to the admissions and financial aid staff have been absolutely wonderful! I am very much looking forward to starting classes this Fall. Login to rate or flag the reviews Stephen from Columbus, OH 10/14/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 42 Categories Comments Great for these types of students People",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}