{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2008-07-31T00:00:00",
            "2010-01-01T00:00:00",
            "2011-10-05T00:00:00"
        ],
        [
            "Description",
            "LiDAR was collected within portions of Pinellas, Hillsborough, Manatee, Sarasota, Charlotte, Lee, Collier, Monroe, and a very small coastal area of Pasco, Counties. System Parameters/Flight Plan. The LiDAR system acquisition parameters were developed based on a maximum average ground sample distance of 4 feet. Two Leica ALS50 sensors were used for acquisition. Acquisition specifications for the two sensors were as follows: Sensor 19 Field of View (full angle) - 29 degrees Nominal flight altitude (AMSL) - 3999.30 feet Airspeed - 54.02 meters/sec Laser pulse rate - 75,000 Hz Nominal swath width (on ground) - 2068.58 feet Maximum cross track point spacing - 3.91 feet Maximum along track point spacing - 3.94 feet Average point spacing - 2.21 feet Flight line spacing - 1544.95 feet Side overlap - 25.31 percent Sensor 59 Field of View (full angle) - 29 degrees Nominal flight altitude (AMSL) - 3999.30 feet Airspeed - 60.70 meters/sec Laser pulse rate - 84,400 Hz Nominal swath width (on ground) - 2068.58 feet Maximum cross track point spacing - 3.94 feet Maximum along track point spacing - 3.91 feet Average point spacing - 2.21 feet Flight line spacing - 1413.72 feet Side overlap - 31.66 percent LiDAR System Calibration. Prior to the LiDAR acquisition, the system underwent a calibration to verify the operational accuracy and misalignment angles. Boresight calibrations were performed for each LiDAR system at the beginning and end of each flight mission. LiDAR Data Acquisition. LiDAR data acquisition only occurred when the sky was sufficiently clear of clouds, smoke, and atmospheric haze. The LiDAR data was processed immediately after the acquisition to verify the coverage had no voids. GPS/Inertial Measurement Unit (IMU) Post Processing. The GPS and IMU data was post processed using differential and kalman filter algorithms to derive a best estimate of trajectory. The quality of the solution was verified to be consistent with the accuracy requirements of the project. LiDAR Processing and Classification. The LiDAR data was post processed and verified to be consistent with the project requirements in terms of post spacing and absence of artifacts. The point cloud underwent classification to determine bare-earth points (class 2), noise points (class 7), water returns (class 9), and unclassified data (class 1). Class 12 contains LiDAR points removed from the overlap region between adjacent flight lines. The MASSPOINT feature class contains ground (class 2) points only.",
            "The NOAA Coastal Services Center (CSC) received files in LAS format. The files contained LiDAR intensity and elevation measurements. CSC performed the following processing on the data to make it available within Digital Coast: 1. The data were converted from State Plane Florida West coordinates to geographic coordinates. 2. The data were converted from NAVD88 heights to ellipsoid heights using Geoid03. 3. The LAS header fields were sorted by latitude and updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2004-2008_FDEM_Southwest_m529.xml&view=ISO19115Components-HTMLTable",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 619147447,
    "recordOffset": 619138383,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2004-2008_FDEM_Southwest_m529Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2004 - 2008 Florida Division of Emergency Management (FDEM) Lidar Project: Southwest Florida 2009-01-01 1 Lidar Final Reports 1 North American Datum 1983 2007-01-19 2 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Citation URL ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/fl/fdem/southwest/ 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}