{
    "relation": [
        [
            "Timestamp",
            "2013-07-12",
            "2013-07-11",
            "2013-07-11"
        ],
        [
            "Action",
            "Added",
            "Added",
            "Added"
        ],
        [
            "Category",
            "SYNONYM",
            "SYNONYM",
            "DEFINITION"
        ],
        [
            "Detail",
            "DNA replication, synthesis of RNA primer involved in cell cycle DNA replication",
            "replication priming involved in cell cycle DNA replication",
            "Any DNA replication, synthesis of RNA primer that is involved in cell cycle DNA replication."
        ]
    ],
    "pageTitle": "GO:1902295 synthesis of RNA primer involved in cell cycle DNA replication",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:1902295",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417421431,
    "recordOffset": 417396706,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122622=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 122489=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms GO:1902295 Wiki Page GONUTS Any DNA replication, synthesis of RNA primer that is involved in cell cycle DNA replication. Definition Biological Process Ontology synthesis of RNA primer involved in cell cycle DNA replication Name GO:1902295 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Term Basket",
    "textAfterTable": "Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:1902295: Relationship To GO:1902295 Child Term Child Term Name Is a GO:1902318 synthesis of RNA primer involved in nuclear cell cycle DNA replication Is a GO:1902330 synthesis of RNA primer involved in bacterial-type DNA replication Protein Annotation",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}