{
    "relation": [
        [
            "File Type",
            "Developer",
            "Popularity",
            "Category"
        ],
        [
            "Citrix Server Connection File",
            "Citrix Systems",
            "3.5 (10 Votes) Thanks for voting! Rare Uncommon Average Common Very Common",
            "Settings Files"
        ]
    ],
    "pageTitle": "CFG File Extension - Open .CFG Files",
    "title": "",
    "url": "http://fileinfo.com/extension/cfg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 93542767,
    "recordOffset": 93534099,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "NEW: Open .CFG files for FREE with File Viewer Tweet .CFG File Extension 7 File Associations Z Y X W V U T S R Q P O N M L K J I H G F E D C B A # Tutorial Videos Quiz Questions Software Programs Random Extension Developers Misc Backup Developer Disk Image Compressed Encoded Settings System Font Plugin Web GIS CAD Game Executable Database Spreadsheet Page Layout Camera Raw Vector Image Raster Image 3D Image eBook Video Audio Data Text Common File Types (adsbygoogle = window.adsbygoogle || []).push({}); Help Center",
    "textAfterTable": "Rare Uncommon Average Common Very Common Category Settings Files File Format Description Generic preference file that stores settings and configuration information; used by various programs, which means different CFG files may store data in different formats; typically should not be opened manually, but may be saved in a text format that can be viewed in a text editor; can sometimes be moved or deleted to revert to a program's default settings. Generic configuration files are often named \"config.cfg\". Text-based CFG files often contain one variable and value per line in the following format: var1=low var2=med var3=high To test if a program automatically generates a default CFG file, move the configuration file out of the default directory when the program is not running. Then open the program and check the directory to see if a new CFG file has been created. Linux configuration files typically use the .CONF extension rather than CFG. Program(s) that open .CFG files Windows Microsoft Notepad Microsoft WordPad",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}