{
    "relation": [
        [
            "Character Sequence",
            "%s",
            "\\n"
        ],
        [
            "Meaning",
            "Substitute this sequence with the string value of the next argument in the argument list.",
            "Substitute with the appropriate platform-specific line terminator."
        ]
    ],
    "pageTitle": "UTL_FILE",
    "title": "",
    "url": "http://docs.oracle.com/cd/B19306_01/appdev.102/b14258/u_file.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70466039,
    "recordOffset": 70451217,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2416=The FOPEN max_linesize parameter must be a number in the range 1 and 32767. If unspecified, Oracle supplies a default value of 1024. The GET_LINE len parameter must be a number in the range 1 and 32767. If unspecified, Oracle supplies the default value of max_linesize. If max_linesize and len are defined to be different values, then the lesser value takes precedence.}",
    "TableContextTimeStampAfterTable": "{49910=The maximum size of the buffer parameter is 32767 bytes unless you specify a smaller size in FOPEN.If unspecified, Oracle supplies a default value of 1024. See also \"GET_LINE_NCHAR Procedure\"., 61004=The maximum size of the buffer parameter is 32767 bytes unless you specify a smaller size in FOPEN. If unspecified, Oracle supplies a default value of 1024. The sum of all sequential PUT calls cannot exceed 32767 without intermediate buffer flushes., 33991=Maximum number of characters for each line, including the newline character, for this file (minimum value 1, maximum value 32767). If unspecified, Oracle supplies a default value of 1024., 3289=The MAX_LINESIZE value for FOPEN() is invalid; it should be within the range 1 to 32767.}",
    "lastModified": "Wed, 13 May 2015 05:07:08 GMT",
    "textBeforeTable": "The format string can contain any text, but the character sequences %s and \\n have special meaning. Usage Notes From one to five operational argument strings. Argument strings are substituted, in order, for the %s formatters in the format string. If there are more formatters in the format parameter string than there are arguments, then an empty string is substituted for each %s for which there is no argument. arg1..arg5 Format string that can contain text as well as the formatting characters \\n and %s. format Active file handle returned by an FOPEN call. file Description Parameters Table 168-23 PUTF Procedure Parameters Parameters arg5 IN VARCHAR2 DEFAULT NULL]); . . . [arg1 IN VARCHAR2 DEFAULT NULL, format IN VARCHAR2, file IN FILE_TYPE, UTL_FILE.PUTF (  Syntax This procedure is a formatted PUT procedure. It works like a limited printf(). See also \"PUTF_NCHAR Procedure\". PUTF Procedure   The maximum size of the buffer parameter is 32767 bytes unless you",
    "textAfterTable": "Examples The following example writes the lines:  Hello, world! I come from Zork with greetings for all earthlings. my_world varchar2(4) := 'Zork'; ... PUTF(my_handle, 'Hello, world!\\nI come from %s with %s.\\n', my_world, 'greetings for all earthlings'); If there are more %s formatters in the format parameter than there are arguments, then an empty string is substituted for each %s for which there is no matching argument. Exceptions  INVALID_FILEHANDLE INVALID_OPERATION WRITE_ERROR PUTF_NCHAR Procedure This procedure is a formatted PUT_NCHAR procedure. Using PUTF_NCHAR, you can write a text file in Unicode instead of in the database charset. Syntax  UTL_FILE.PUTF_NCHAR ( file IN FILE_TYPE, format IN NVARCHAR2, [arg1 IN NVARCHAR2 DEFAULT NULL, . . . arg5 IN NVARCHAR2 DEFAULT NULL]); Parameters Table 168-24 PUTF_NCHAR Procedure Parameters Parameters Description file Active file handle returned by an FOPEN_NCHAR call. The file must be open for reading (mode r). If the file is opened by FOPEN instead of FOPEN_NCHAR, a CHARSETMISMATCH exception is raised. format Format string that can contain text as well as the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}