{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The security is very good at Manhattanville. They are all friendly and are familiar faces. There is blue light safety all around the campus.",
            "There is every club imaginable. Each one is active in the community around campus. It is easy to start a club of your own. If you don't want to join a varsity sport, there are club sports. Film club is very popular. It's really easy to be involved in something.",
            "If you're into sports, theater, dance, film or music, there is almost every type of person you can think of. Everyone is outgoing and accepting of whatever you like to do.",
            "Quad Jam, 200 Nights and Castle parties are the traditional campus gatherings that everyone raves about. They are the most anticipated events of the year. Quad Jam is especially fun because local bands and a special guest artist play on the quad.",
            "Almost everyone recieves financial aid. The Duchesne Scholarship gives you $2000 to be involved in community service work. There are plenty of on campus jobs as well.",
            "There is always some type of activity going on campus. Clubs hold plenty of events and the Valiant bus can take you into White Plains for free.",
            "There are two places to eat on campus, the dinning hall and the pub. Both have average food, but there are plenty of choices to choose from food wise.",
            "Living on campus is always exciting. All the freshman live together, which is great because you can build friendships quickly and easily. The rooms are a good size with plenty of storage space.",
            "The toughness of a class truly depends on your professor. As long as you stay on top of your work, you will succeed.",
            "It is very easy to get involved with extracurricular activities. Everyone is welcome from club sports to the theater department. There is always some type of activity going on.",
            "From the moment I walked onto the campus as a freshman, I felt welcome and at home. The community is is small by number but large in what we do. Everyday you will learn something new, either inside or outside the classroom."
        ]
    ],
    "pageTitle": "Manhattanville College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Manhattanville-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919359087,
    "recordOffset": 919329047,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84395=For prospective students, make sure you hand in or send all items needed to get into college, like your final high school transcript and other requirements. Also, while in school, have your parents make payments on time in order to remain in school. You will not be able to dorm if payments are not made on time. For the year 2013, my parents and I have agreed that I commute because they could not afford a bill that was due a month ago since my mother has been unemployed since July 2012. My father has always filed taxes under my name as Head of Household and my mother's tax information has been recently added to my FAFSA, so I received a new financial aid award letter. Moreover, not only will you unable to dorm, you will be unable to access your grades, which are only available on the school website, or register for courses the following semester. Since a bill has not been paid in a month, I have a hold on my student account. In addition, if you were awarded as a Duchesne scholar, you must at least complete thirty hours of community service or your scholarship will be delayed and put you in more serious debt. Finally, it is very important that you at least know what you are going to study or have an interest of what you would like to study. You do not plan your major/minor until your sophomore year, so you have time to think. During my first semester, I realized that many students dropped out of classes that they did not need to take in a very short amount of time. I recommend that you take courses that you feel will benefit the career you want to pursue. It is okay to explore different areas because that is what college is about, but it is best to take certain courses that you feel will help you in the future., 109253=© 2015, Cappex.com, LLC, 83096=For the first semester, I took three writing classes, which were First Year Seminar Writing, Creative Writing, and African-American Studies. I had a pretty tough professor for African-American Studies who gave me a lot of criticisms for my essays, but it taught me how to make my essays more argumentative, precise, and comprehensible. Many students had to revise their thesis statement before the professor approved it. In First Year Seminar and Creative Writing, I learned how to improve my grammar, punctuation, and make my responses briefer. Creative Writing and African-American Studies were classes that I was interested in and First Year Seminar is a required course. My point is although First Year Seminar and Creative Writing were courses of interest, they helped me become a better writer. I chose to major in Communications because my parents explained that writing was not going to help me earn enough money. Communications can help me in the Journalism field by not only writing papers, but be seen on television or be heard on the radio. I chose to take Journalism the year of 2013 as well., 60303=Mville begins its celebration in October. We celebrate together the 200 nights before our seniors graduate. We come together as an institution to celebrate our unity and our success through dance, theater, our legendary Halloween Festival, and of course the Haunting of Reed Castle!, 104336=Almost everyone recieves financial aid. The Duchesne Scholarship gives you $2000 to be involved in community service work. There are plenty of on campus jobs as well.}",
    "textBeforeTable": "12/13/2009 Reviewer is A current student here. 13 out of 13 people found this review useful. 1 of 25 Jake Check out reviews left by other students or leave your own review. You could win a free scholarship. Manhattanville College Reviews Manhattanville College › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am enjoying being here I enjoy being on that beautiful campus and the activities they have, such as: Fall Fest, Clubs, The Castle Parties, etc. The people on that campus are very nice and outgoing and fun to be around with. Also the volunteer activities they have are fun and enjoyable such as: helping teachers with kinder gardeners, feeding homeless people food in the streets of Harlem, and being a mentor to orphans. Am learning a lot I am learning how to be more independent for myself now since I am a resident on that campus. I also learned interesting art skills that can help me with my major, which is graphic design. Login to rate or flag the reviews Karen from Yonkers, NY 01/16/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 25 Categories Comments Great for these types of students Activists Tips for prospective students",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}