{
    "relation": [
        [
            "Condition:",
            "Brand:",
            "Style:",
            "Inseam:"
        ],
        [
            "Pre-owned: An item that has been used or worn previously. See the seller’s listing for full details and description of any imperfections. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "London Jean from Victoria's Secret",
            "Cargo",
            "Short"
        ],
        [
            "Bottoms Size (Women's):",
            "Color:",
            "Size Type:",
            ""
        ],
        [
            "Medium short",
            "Multi-Color",
            "Regular",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/London-Jean-Size-Medium-Short-Lightweight-Camo-Pants-From-Victorias-Secret-/261477034569?pt=US_CSA_WC_Pants&hash=item3ce13eea49",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414962299,
    "recordOffset": 414922253,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics Seller assumes all responsibility for this listing. 261477034569 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab Guarantee:",
    "textAfterTable": "Size medium short camo cargo pants. They are lightweight. Elastic waist with drawstring. Made by London Jean from Victoria's Secret. Clean, smoke free home. See multiple pictures. Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing. Shipping and handling This item will ship to United States, but the seller has not specified shipping options. Contact the seller- opens in a new window or tab and request a shipping method to your location. Shipping cost cannot be calculated. Please enter a valid Postal Code.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}