{
    "relation": [
        [
            "Year",
            "1996",
            "1997",
            "1998",
            "1999",
            "2000",
            "2001",
            "2002",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010"
        ],
        [
            "Recipient",
            "William Stout",
            "Brett Davis",
            "Jonathan Baker",
            "Mark Zagol",
            "Bernard Luttmer",
            "Bernard Luttmer",
            "Bradley Funk",
            "Clayton Biscoff",
            "David Wright",
            "Clay Johnson",
            "Clay Johnson",
            "Trevor Moore",
            "Reed Johnson",
            "Kyle Rogachenko",
            "Frederick Strammer"
        ],
        [
            "College",
            "U.S. Naval Academy",
            "Harvard University",
            "Tufts University",
            "Old Dominion University",
            "Queen's University",
            "Queen's University",
            "Old Dominion",
            "Harvard",
            "USMMA",
            "Harvard",
            "Harvard",
            "Hobart William Smith",
            "Boston College",
            "Old Dominion",
            "Brown University"
        ]
    ],
    "pageTitle": "Trophies - Sailing :: USNA Sailing Center :: USNA",
    "title": "",
    "url": "http://www.usna.edu/SailingTeam/trophies.php/trophies.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 821538827,
    "recordOffset": 821486223,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1270=History: The McMillan Cup Regatta is the oldest collegiate sailing event. Originally, the McMillan Cup was known as the Oliver Hay Trophy. The latter, was established in 1928 by Mr. Briggs Cunningham as an event to honor a well known Yale alumnus sailor and was retired in 1930. The McMillan cup was donated by Mr. William McMillan of Baltimore, MD, but with the understanding that his name not appear on the Cup. As the McMillan Cup Regatta was primarily an intercollegiate large yacht racing event for New England and Middle Atlantic States, it was sailed on the East Coast. Up to 1950, the regattas were held at various sailing centers in New England. After World War II, it became apparent that the competing colleges would have difficulty in obtaining sufficient boats to carry on the McMillan Cup. and in 1950 the Naval Academy offered their 44' Luders Yawls for Intercollegiate Yacht Racing (ICYRA) competition. Since that time the regattas has been a Chesapeake Bay event.}",
    "TableContextTimeStampAfterTable": "{159256=History: The award was established in 1995 to recognize George Griswold for his three decades of outstanding service to Collegiate Sailing. George was the graduated secretary for the MCSA District and led many schools in the formation and development of their teams throughout the Midwest and United States., 245421=History: This award, established in 1981 by the Naval Academy Parents Club of Northern California, is in memory of LTJG Tony Bilotti, Class of 1977, who lost his life in a tragic accident at sea.  Tony was an active and enthusiastic member of the Yawl Team while attending the Naval Academy., 136388=History:  From the estate of Sir Thomas Lipton (1850-1931) this memorial trophy was offered to the Intercollegiate Yacht Racing Association of North America (ICYRA of NA) by Robert Bartly Smallwood in 1952 for Intercollegiate Yacht Racing to perpetuate the bonds of friendship and sailing forged by the famous British sportsman., 135849=2012, 184451=History: The award was established in 1994 to recognize Faye Bennet.  A senior judge an junior championship chairman, she has been a long time participant and supporter of junior and youth activities.  This award is presented in October of each year., 174197=History: This trophy was established in 1983 and is awarded in November to the winner of the MAISA single handed championships., 332621=History: Established in 1989, this award is named in honor of RADM Robert W. McNitt, whose accomplishments as a distinguished naval officer and in the sailing community best embody those traits desired in our future leaders., 200707=History: This trophy is dedicated in memory of Coast Guard Cadet Julia Babineau, who was an exchange student to the Naval Academy in 1980.  Julia sailed for the Naval Academy and became a valued and special member of the dinghy team as a varsity crew.  The following spring, she was tragically killed in a sailing accident at the Coast Guard Academy., 169045=History: This award was established in 1964 to recognize the top team in the Mid Atlantic District., 16654=History: The Truxton Umsted Memorial Regatta was established in 1971 and is held at the United States Naval Academy., 24269=History: The Shields Trophy is awarded annually to the winner of the offshore regatta held among the Service Academies. This competition was started in 1963 and then discontinued in 1986. However in 1996, the regatta was revived with nine schools participating in the event. The event in now run every year., 348543=History:  The race for the sterling silver service set held in late November brings together all phases of the midshipman sailing squadron. the race is sailed in offshore boats with crews representing the dinghies, plebes, VOST, faculty, NASS, sail craft department, and coaches staff.  Captain Robert Dache Steele, USN, class of 1945 was the Commodore of NASS and commanding officer of the Naval Station, Annapolis, from 1969 to 1972.  As a tribute to him for his deep concern for the welfare of the midshipman, the sailing center staff and coaches organized this regatta in his honor.  Upon the death of Robert Huntington, Jr. in 1973, Captain Steele graciously rededicated the Robert D. Steele regatta to the memory of his friend., 375074=History:  The Aloha  Cup is  one of four trophies belonging to Lloyd-Phoenix that came into the possession of the Naval Academy.  Lloyd Phoenix graduated from the U.S. Naval Academy in 1861 and served in until the Civil War.  He resigned his commission in 1865, went into business, and became a yachting enthusiast.  He won the Aloha Cup in an annual cruise of the New York Yacht Club in 1910, sailing his most famous yacht, Intrepid., 178789=History: This award was established in 1963 and is awarded twice a year to the top team's freshman in the spring and fall., 240452=History: This trophy was presented to the US Naval Academy by Mr. Decoursey Fales, former Commodore of the New York Yacht Club, in honor of Admiral Harry W. Hill, USN (RET), former superintendent of the Naval Academy.  The trophy is awarded annually during May Week to the graduating  midshipman who has shown outstanding achievement in the area of sail trim through leadership, skill, and dedication to the team., 361764=History: The CAPT A.G.B Grosvenor Trophy was established by the Fales Committee in 1978 to honor the late Captain Alexander G. Bell Grosvenor, USNA Class of 1950, Commanding Officer, Naval Station Annapolis, and Commodore, Naval Academy Sailing Squadron. Captain Grosvenor had noted that of all the sailing-oriented trophies awarded at the Naval Academy, none honored the hard working and dedicated volunteers from the Naval Academy Sailing Squadron., 47557=History: In 1961, the New England Women's Intercollegiate Sailing Association (NEWISA) was formed when New England no longer permitted women to sail in varsity regattas. Eventually NEWISA, and her sister organization, the Middle Atlantic Association of Women Sailors (MAAWS), organized the first women's nationals in 1967. Policies and procedures for the event were set at the ICYRA annual meeting in 1970, and in 1978 the results of the Women's Nationals were first included in the scoring for the Leonard Fowle Trophy. Gerald Miller was the coach at Boston University in the late 1960's and was one of the originators of the first women's nationals., 162527=History: The award was established in 1941 to recognize the top team in the Mid Atlantic District., 30520=History: The Fowle Trophy honors the late Graduate Secretary of the New England District and Executive Vice President of the ICYRA/NA. Len served in both posts from their creation until his death in 1973 and his devotion to college sailing is without peer. College sailing today had its very beginnings in the organizational ability and personal drive of this one man., 52831=History: The ICYRA/NA Sloop Championship was inaugurated in 1972 with the first championship held at the University of California, Irvine in the Shields class sloops. To commemorate that event, the Pacific Coast I.Y.R.A. donated the Cornelius Shields Trophy. The trophy was named in honor of Mr. Shield of Larchmont, New York, who was one of the most well known sailors of his time, and was one of the largest benefactors of collegiate sailing. He donated more than 80 of the Shields class sloops to colleges throughout the U.S. and was named to the collegiate Hall of Fame in its initial Year., 109732=History: This trophy, along with the Judy Lawson Trophy, were first given in 1967. The Madeline Cup is awarded to the low point skipper of \"A\" division in the ICYRA Women's Dinghy Championship. Ms. Madeline was the graduate secretary of MAAWS and helped initiate the first women's nationals., 95367=History: This trophy was presented to the ICYRA by the Oxford University Yacht Club team and its Captain Jeremy Thomas in 1954 on the occasion of the first of a continuing series of British Universities vs. North American Colleges regattas held alternately in the United States and Great Britain every two years. The trophy has become emblematic of the second place team in the ICYRA Dinghy Championships., 263588=History: The Carey Arthur Memorial Trophy is presented in the memory of LTJG Carey Arthur, Class of 1979.  The name of the biannual winners are engraved on the trophy, which is on display in the Hall of Fame., 123856=History: This trophy along with the Miller Trophy was established in 1967. It is given to the second place team in the ICYRA Women's Dinghy Championships and honors Nancy Kleckner, the first graduate secretary of NEWISA., 312508=History: This trophy was established in 1974 and was presented to the Naval Academy by the Knickerbocker Yacht Club in Port Washington, New York.  It is in recognition and commemoration of the club's 100th Anniversary., 204608=History: The Class of 1916 Trophy was presented to the Naval Academy Sailing Squadron by the late Harris K. Lyle in 1976.  It honors six fellow students from the Class of 1916 lost in enemy action.  Those remembered with this trophy include RADM Henry M. Mullinix, RADM Charles P. Cecil, CAPT Casain Young, CAPT Frank Marston, CAPT Edward C. Fuller, USMC, and LTJG Stanton F. Kalk., 135708=2011, 362385=The perpetual trophy on display in the Crown Center Hall of Fame is a fully rigged half-model of the sailing vessel SIREN, a custom-built Sparkman & Stephens 58-foot sloop aboard which Captain Grosvenor served as Head Coach. In the spring of 2003, the Fales Committee re-dedicated the Grosvenor Trophy as the Alex and Marcia Grosvenor Trophy. The renamed trophy recognizes and honors the extraordinary time, effort, and energy that both Captain and Mrs. Grosvenor devoted in supporting all aspects of the Naval Academy sailing programs., 140016=History: This trophy, along with the British-America, Lipton, and Performance Sailcraft trophies, was established in 1967. It is usually sailed in larger yawls and more recently in the Navy 44's., 381949=History:  Lloyd Phoenix graduated from the U.S. Naval Academy in 1861 and served in until the Civil War.  He resigned his commission in 1865, went into business, and became a yachting enthusiast.  He won the Aloha Cup in an annual cruise of the New York Yacht Club in 1910, sailing his most famous yacht, Intrepid., 231580=History: Admiral Blakely, class of 1892, was awarded the Navy cross, rose to rank of Rear Admiral in 1926, and was commanding officer of the USS Arizona during World War I.  Commodore Decoursey Fales, former Commodore of the New York Yacht Club, presented this trophy in honor of Rear Admiral Blakely, under whom whom he served on the Arizona., 128490=History: The John F. Kennedy Memorial Trophy was presented to the U.S. Naval Academy in 1965 by Mr. C. Robert Yeager in behalf of the many friends of the late President. President Kennedy's love for sailing is perpetuated in the annual competition for the trophy., 304113=History: The Dubose Trophy was presented in 1958 to the Naval Academy by the Intercollegiate Yacht Racing Association, the predecessor to the Intercollegiate Sailing Association.  It honors the outstanding midshipman on the Varsity Offshore team., 267033=History: In 1957, Mr. Walter N. Rothchild donated his yacht Avanti to the midshipmen of the Naval Academy.  However, before the yacht could be delivered, Hurricane Carole lashed the New England Coast and destroyed her.  Mr. Rothchild recovered Avanti's wheel and forwarded it to the Naval Academy.  It is now a perpetual trophy on display in the Hall of Fame., 116522=History: This trophy, along with the Madeline Cup, was fist give in 1967. The Judy Lawson trophy is given to the low point skipper of the \"B\" division in the ICYRA Women's Dinghy Championship, 13082=History: The intrepid Trophy was established in 1990, but then not sailed again until 1998. It is an offshore event sailed in Navy 44's on the Chesapeake Bay. Day one involves a series of fleet races, with a winner determined. Day two's format is match racing for one round robin. The winner is the team with the lowest overall score considering both days of racing., 344995=History: This trophy was presented in 1995 by the members of the New York Yacht Club to mark the 150th year anniversary of the US Naval Academy.  Performance in seamanship, navigation, leadership skills, and academics will be assessed in determining the winner., 7834=History: LT Jeff Stanley Trophy is a memorial to honor LT Jeff Stanley, USN, Class of 1970, who was killed in an aircraft over the Pacific Ocean in 1974. Throughout his four years at the Naval Academy, LT Stanley served as an excellent example as a midshipman and Corinthian yachtsman. His participation on the Varsity Dinghy Team, Class \"A\" Ocean Racing Team, and on four Kennedy Cup Teams, caused him to be looked upon by both his superiors and peers as rare master of the varied aspects of Yacht Racing. It was in his enthusiastic support an participation in the Kennedy Cup that he is most remembered by those who knew him well., 35167=History: The North American Dinghy Championship Trophy is a memorial to the late Henry Morss, Boston Yachtsman and 1907 Bermuda Race winner, who was an MIT alumnus and benefactor. The Morss Trophy was presented in 1937 by Charles Francis Adams, Edwin A. Beardman, Charles P. Curtis, Chandler Hovey, and Gerald B. Lambert, nationally known yachtsman. The early competitions were sailed at MIT on the Charles River, but since 1946 the site has been rotated throughout the member districts of the Intercollegiate Yacht Racing Association., 224863=History: The Seelig-Ulmer Memorial Trophy was established in 1972 to promote the coeducational aspects of Intercollegiate Dinghy Racing.  It is presented in the memory of MIlton C. Seelig, Charlotte K. Ulmer, and Charles Ulmer, Sr., by their sons, Martin Seelig, Class of 1962, and Charles Ulmer, Class of 1961.  The participants are members of the intercollegiate team and/or their family members, friends, or drags., 209443=History: Established by NASS in honor of Mr. Cornelius Shields, Sr., this trophy recognizes his support of the Naval Academy Sailing program.  Mr. Shields donated five Shields sloops to the Academy and served a number of years on the Fales Committee as an advisor.  It also honors his long and exciting career as a yachtsman.  He has the rare distinction of twice winning the Seawanhaka Cup, was the first winner of the Mallory Trophy and skippered Columbia during the final part of its successful 1958 campaign for the America's Cup., 367255=History:  The Blue Water Bowl was presented to the U.S. Naval Academy in 1947.  It is awarded by the U.S. Navy to the winning skipper at the end of the race., 57606=History: This regatta, originated in 1963, is given in appreciation to Mr. Foster for his interest in collegiate sailing and devotion to singlehanded competition, particularly in the Finn class., 194857=History: Mr. Albert C. Cavileer, a chartered member of the Naval Academy Sailing Squadron from 1947 to 1962, served as a sailing coach and advisor to the midshipmen on the yawls and ocean racers.  The midshipmen and members of NASS presented this bowl in honor of their friend for his devotion to the midshipman sailing program., 260542=History: The Naval Base of Bermuda presents the Dan A. Kimball Trophy biannually.  Prior to 1966, the trophy remained on display in the Administration Building of the Base.  After the 1966 race, the trophy was donated for permanent display at the Naval Academy.  Each year, NASS provides a suitable keeper trophy for presentation at the awards ceremony in Bermuda., 102619=History: This Trophy was a first presented in 1971 and is awarded to the third place team in the ICYRA Dinghy Championship., 256811=History: The Scarritt Adams Shield was presented to the USNA in June of 1980 by Mrs. Scarritt Adams of Paget, Bermuda.  This shield is given in memory of her late husband Captain Scarritt, USN, class of '30, who was the first midshipman from Bermuda to graduate from the USNA.  The wood of this plaque is Bermuda cedar and came from a tree which was on the Adams's property in Paget.  Capt. Adams was always keenly interested in sailing and was a member of the New York Yacht Club as well as the Royal Bermuda Yacht Club. , 275482=History: On August 5, 1911, the New York Yacht Club Cruise Trophy was won by the Yacht Intrepid, owned and skippered by Lieutenant Lloyd Phoenix, USNA, Class of 1861.  The trophy was subsequently gifted to the Naval Academy to be awarded to the deserving midshipman., 150251=History: This trophy, presented in 1954 by Mr. Kenneth H. Preston, Commodore of the Oxford University Yacht Club, is intended to promote the sport of team racing in yachts between the Universities of Great Britain and the United States of America., 354200=History: The Reina Mercedes regatta is a race held annually in August of each year.  Competitiors are employees of the Naval Station Command.  Typically Knockabouts are used for competition in this NASS sponsored event., 152865=History: This regatta, first held in the fall of 1994, was named in appreciation of Janet Lutz. Janet graduated from Bouve, Boston in 1952 and then went on to receive her masters in education from Syracuse in 1958. Janet became a teacher as well as the sailing coach at Pembroke where in 1961 she was one of the founders of NEWISA. She remained at Pembroke, which later merged with Brown University, for 32 years. Janet retired in 1990.}",
    "textBeforeTable": "Winners of the George Griswold Trophy   History: The award was established in 1995 to recognize George Griswold for his three decades of outstanding service to Collegiate Sailing. George was the graduated secretary for the MCSA District and led many schools in the formation and development of their teams throughout the Midwest and United States. Awarded annually to the second place finisher in the ICSA National Singlehanded Sailing Championship. The George Griswold Trophy - ICYRA Trophies     Boston College 2009 Yale 2008 Stanford 2007 St. Mary's College 2006 Georgetown 2005 US Naval Academy 2004 Old Dominion 2003 St. Mary's College 2002 St. Mary's College 2001 Boston College 2000 Connecticut College 1999 Connecticut College 1998 Connecticut College 1997 Dartmouth College 1996 Dartmouth College 1995 Dartmouth College 1994 St. Mary's College 1993 College Year Winners of the Ann Campbell Trophy   History: Ann Campbell has been a long time graduate secretary for the MAISA Collegiate Sailing District. The award was created to recognize Ann's many years of exceptional service to Collegiate Sailing. Awarded annually to the third pace team in ICSA",
    "textAfterTable": "The America Trophy - MAISA Trophies Awarded annually to the winner of the Mid Atlantic Spring Dinghy Championship  History: The award was established in 1941 to recognize the top team in the Mid Atlantic District.   Winners of the America Trophy Year College Year College Year College 1941 Princeton 1966 Princeton 1991 Old Dominion 1942 Navy 1967 Princeton 1992 Navy 1943 Navy 1968 Kings Point 1993 Navy 1944 Navy 1969 Navy 1994 Old Dominion 1945 Navy 1970 N.Y. Maritime 1995 Navy 1946 Navy 1971 Navy 1996 Kings Point 1947 Navy 1972 Kings Point 1997 St. Mary's 1948 Navy 1973 N.Y. Maritime 1998 Hobart William Smith 1949 Kings Point 1974 N.Y. Maritime 1999 St. Mary's 1950 Kings Point 1975 Kings Point 2000 Hobart William Smith 1951 Navy 1976 Kings Point 2001 Kings Point 1952 Navy 1977 Navy 2002 Old Dominion 1953 Navy 1978 Navy 2003 St. Mary's 1954 Kings Point 1979 Kings Point 2004 St. Mary's 1955 Navy 1980 Navy 2005 Hobart William Smith 1956 Princeton 1981 Navy 2006 Hobart William Smith 1957 Navy 1982 Kings Point 2007 Georgetown 1958 Navy 1983 Navy 2008",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}