{
    "relation": [
        [
            "XML Tag",
            "name",
            "key-store",
            "key-store-pass",
            "key-store-alias",
            "key-manager-algorithm",
            "ssl-protocol",
            "trust-store",
            "trust-store-pass",
            "trust-store-alias",
            "trust-store-type",
            "trust-manager-algorithm",
            "enforce-fips",
            "need-client-auth",
            "ciphers",
            "secure-random-algorithm",
            "secure-random-provider"
        ],
        [
            "Type",
            "string",
            "string",
            "See Description",
            "string",
            "string",
            "string",
            "string",
            "See Description",
            "string",
            "string",
            "string",
            "boolean",
            "boolean",
            "See Description",
            "string",
            "string"
        ],
        [
            "Description",
            "The name of this cluster. For more information, see name.",
            "Specifies the file path to the key store such as ./ssl/evsidentity.jks.",
            "This element contains a password child element with a string value that specifies the password used to access the key store.",
            "Specifies the alias for the key store.",
            "Specifies the key manager algorithm such as SunX509.",
            "Specifies the SSL protocol such as TLS.",
            "Specifies the file path to the trust store such as ./ssl/evstrust.jks.",
            "This element contains a password child element with a string value that specifies the password used to access the trust store.",
            "Specifies the alias for the trust store.",
            "Specifies the trust store type such as JKS.",
            "Specifies the trust manager algorithm such as SunX509.",
            "Specifies whether or not Oracle Event Processing server uses a Federal Information Processing Standards (FIPS)-certified pseudo-random number generator. For more information, see \"FIPS\" in the Oracle Fusion Middleware Administrator's Guide for Oracle Event Processing.",
            "Specifies whether or not client certificate authentication is required.",
            "This element contains one or more cipher child elements, each with a string value that specifies the ciphers that are required.",
            "When enforce-fips is set to true, specify the secure random algorithm to use. Valid values: FIPS186PRNG",
            "When enforce-fips is set to true, specify the secure random provider to use. Valid values: JsafeJCE"
        ]
    ],
    "pageTitle": "Schema Reference: Server Configuration wlevs_server_config.xsd",
    "title": "",
    "url": "http://docs.oracle.com/cd/E28280_01/dev.1111/e14301/server_tags.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72577143,
    "recordOffset": 72536962,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{155262=Default: 1000 ms, 198327=Default: 1000., 40186=The number of prepared and callable statements stored in the cache between 1 and 1024. This may increase server performance., 105639=Default: 00:00.}",
    "lastModified": "Wed, 14 Jan 2015 14:07:19 GMT",
    "textBeforeTable": "Table F-26 Child Elements of: ssl The ssl server configuration element supports the child elements that Table F-26 lists. F.38.1 Child Elements Use this element to configure Secure Sockets Layer-specific properties on the Oracle Event Processing server. F.38 ssl In the example, the show-detail-error-message element's unique identifier is myShowDetail. </show-detail-error-message> <value>true</value> <name>myShowDetail</name> <show-detail-error-message>  The following example shows how to use the show-detail-error-message element in the Oracle Event Processing server configuration file: F.37.3 Example      The show-detail-error-message server configuration element has no attributes. F.37.2 Attributes       false: the Oracle Event Processing server shows abbreviated error messages (default). true: the Oracle Event Processing server shows detailed error messages. Whether or not to show detailed error messages. Valid values: boolean value The name of this show-detail-error-message element. For more information, see name. string name Description Type XML Tag",
    "textAfterTable": "F.38.2 Attributes The ssl server configuration element has no attributes. F.38.3 Example The following example shows how to use the ssl element in the Oracle Event Processing server configuration file:  <ssl> <name>sslConfig</name> <key-store>./ssl/evsidentity.jks</key-store> <key-store-pass> <password>{Salted-3DES}s4YUEvH4Wl2DAjb45iJnrw==</password> </key-store-pass> <key-store-alias>evsidentity</key-store-alias> <key-manager-algorithm>SunX509</key-manager-algorithm> <ssl-protocol>TLS</ssl-protocol> <enforce-fips>false</enforce-fips> <need-client-auth>false</need-client-auth> </ssl> In the example, the ssl element's unique identifier is sslConfig. F.39 timeout-seconds Use this element to configure weblogic-jta-gateway default transaction timeout in seconds in the Oracle Event Processing server. Default: 60. F.39.1 Child Elements The timeout-seconds server configuration element has no attributes. F.39.2 Attributes The timeout-seconds server configuration element has no attributes. F.39.3 Example The following example shows how to use the timeout-seconds element in the Oracle Event Processing server configuration file:  <weblogic-jta-gateway> <name>myJTAGateway</name> <timeout-seconds>90</timeout-seconds> <weblogic-instances> <weblogic-instance> <domain-name>ocep_domain</domain-name> <server-name>fxserver</server-name> <protocol>t3</protocol> <host-address>ariel</host-address> <port>9002</port> </weblogic-instance> </weblogic-instances> </weblogic-jta-gateway> F.40 transaction-manager Use this element to configure",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}