{
    "relation": [
        [
            "Poster",
            "Jackio",
            "Just popping in Joined: 2006/7/23 From: Newley English- East Yorkshire, United Kingdom Posts: 5",
            ""
        ],
        [
            "Thread",
            "Posted: 2006/10/19 11:02 Updated: 2006/10/19 11:06",
            "Re: 2008 Liberty Unmasked: Baby Commander Greg, buddy, I dont comment too often on this forum because I'm here mostly to read jeep news and such but you should read what you just typed (Ill reiterate it for you): \"First I get the feeling that your ideas on exterior improvements would make it look just like the Wrangler. I'm no expert, but I think having two vehicles looking exactly the same would be pointless if you\u0092re looking to reach out to as many different people as possible...\" Im hoping that you typed this in a fit of frustrastion without any real logical thinking; because (if this is indeed the new Liberty) it looks nearly IDENTICAL to the Commander- in fact my brother walking by me this morning thought it WAS a 2008 Commander.\" Exactly the same\" in your words (go to Allpar and look at 2008 (or 2007, I forget) Commander changes , particuarly when he talks about the taillights, then look at these taillights....\"exactly\") . Therefore your comment on \"having two vehicles looking exactly the same would be pointless etc.....\" makes really no sense at all. I personally think that this redesign is a lack of effort on Jeep's part- lately it seem's our friends over at Jeep are sitting around and either a.) producing some cheap bean counter \"car\" [compass....in deserved lowercase] b.) matching there \"bold\" exterior decisions with \"bold\" enigine options for all the wrong vehicles [ minivan engine in the 2007 Wrangler] or c.) using a complete lack of imagination in creating new automoblies and \"jumping on the bandwagon\" and rebadging everything [ Caliber/compass, Nitro/Liberty] I do love the new 4 door Wrangler and the redesign, new diesel options on the jeep lineup and some of the SRT options ( on the GC), but unless this vehicle above us is called a \"Commander Sport\" or something associated with the commander - the direct \"copying\" of named vehicle thats a tad smaller (with the Liberty badge) is silly, uncreative and furthermore proves alot of people's point on the new direction jeep is going.... But, hey, this are just Spy shots and who could really know for sure?",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=1292",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 530433575,
    "recordOffset": 530413439,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3490=AllPar.com recently posted some unmasked spy shots of the next generation, 2008 Liberty. From the AllPar.com article: For 2008, the Liberty is moving to a \u0093baby Commander\u0094 look, gaining some length and mainly getting the squared-off, Land Rover/Hummer look. The headlights and turn signals are, as with the Commander, separate units behind a rectangular plastic housing. The glass has been trimmed, and it appears that the roof has been lowered; seats seem to be the more comfortable yet thinner new design from the Compass; and the fancy new stereos/nav systems should be available. The cargo area has been expanded. It appears that only the 3.7 liter V6 will be available, and that the four speed automatic will carry forward, so the four cylinder and stick-shift may have been dropped; a diesel is expected to return for late availability. Check out the entire article for the fantastic photos. UPDATE (10/20/06): They just posted up a couple of additional photos - including one that shows what appears to be some type of fabric roof.}",
    "textBeforeTable": "I'm leaning toward the thought that it may just be hiding a new sun-roof system, much like \"Command-View\" on the XK. Notice how the fabric on the Gladiator is flush with the roof line, and the fabric on the KK is at least an inch or two above. http://4wheeldrive.about.com/od/jeepreviews/ig/Jeep-Gladiator/829210glada.htm The new photo appears to show just a sheet of camo covering the roof, but camo does have a purpose - it is hiding something new. Does anyone realistically think that the KK would have a fabric roof? Wouldn't that just compete with the Unlimited? However, do recall the fabric roof on the Gladiator concept...  Re: 2008 Liberty Unmasked: Baby Commander (UPDATED) Posts: 32 From: Joined: 2003/1/26 Not too shy to talk Updated: 2006/10/20 16:00 Posted: 2006/10/20 15:54   KCarl1927283 Thread Poster",
    "textAfterTable": "Poster Thread RUBICON Posted: 2006/10/20 17:21   Updated: 2006/10/20 17:21 Home away from home Joined: 2005/7/13 From: Posts: 377  Re: 2008 Liberty Unmasked: Baby Commander (UPDATED) I agree, wind noise would be too much of a concern as they are trying to move the Liberty upscale. But like it has already been said, they must be hiding something under there. Poster Thread RUBICON Posted: 2006/10/20 12:17   Updated: 2006/10/20 12:18 Home away from home Joined: 2005/7/13 From: Posts: 377  Re: 2008 Liberty Unmasked:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}