{
    "relation": [
        [
            "Patent application number",
            "20090136422",
            "20090311173",
            "20090311413",
            "20100015042",
            "20100062143",
            "20150104560"
        ],
        [
            "Description",
            "Radioactive Surface Source and a Method for Producing the Same - A method for preparing a radioactive surface source for radiotherapy is disclosed. The method comprises: (a) providing a structure having a surface; (b) positioning the structure in a flux of at least one radionuclide so as to collect atoms of the at least one radionuclide on or beneath the surface; and (c) treating the surface such that the atoms are intercalated into the surface but allowed to recoil out of the surface upon radioactive decay. In various exemplary embodiments of the invention the method further comprises coating the surface by at least one layer of polymeric material, such that the atoms are collected into the polymeric material.",
            "METHOD AND DEVICE FOR RADIOTHERAPY - A radiotherapy method, comprising positioning a predetermined amount of a radionuclide selected from the group consisting of Radium-223, Radium-224, Radon-219 and Radon-220, in proximity to and/or within a tumor of a subject, for a predetermined time period. The predetermined amount and the predetermined time period are selected sufficient for the radionuclide to administering a predetermined therapeutic dose of decay chain nuclei and alpha particles into the tumor.",
            "METHOD AND DEVICE FOR RADIOTHERAPY - A radiotherapy method, comprising positioning a predetermined amount of a radionuclide selected from the group consisting of Radium-223, Radium-224, Radon-219 and Radon-220, in proximity to and/or within a tumor of a subject, for a predetermined time period. The predetermined amount and the predetermined time period are selected sufficient for the radionuclide to administering a predetermined therapeutic dose of decay chain nuclei and alpha particles into the tumor.",
            "Combine radiation therapy and chemotherapy for treating cancer - A method of treating a tumor of a subject is disclosed. The method comprises administering to the subject a therapeutically effective amount of alpha particles and a chemotherapeutic agent, wherein the alpha particles are administered by positioning a non-stable alpha-emitting radionuclide in proximity to and/or within the tumor, so as to administer a dose of alpha particles into the tumor, wherein the method does not comprise administration of an inhibitor of DNA repair, thereby treating the tumor of the subject.",
            "METHOD AND DEVICE FOR RADIOTHERAPY - A radiotherapy method, comprising positioning a predetermined amount of a radionuclide selected from the group consisting of Radium-223, Radium-224, Radon-219 and Radon-220, in proximity to and/or within a tumor of a subject, for a predetermined time period. The predetermined amount and the predetermined time period are selected sufficient for the radionuclide to administering a predetermined therapeutic dose of decay chain nuclei and alpha particles into the tumor.",
            "METHOD AND DEVICE FOR RADIOTHERAPY - A radiotherapy method, comprising positioning a predetermined amount of a radionuclide selected from the group consisting of Radium-223, Radium-224, Radon-219 and Radon-220, in proximity to and/or within a tumor of a subject, for a predetermined time period. The predetermined amount and the predetermined time period are selected sufficient for the radionuclide to administering a predetermined therapeutic dose of decay chain nuclei and alpha particles into the tumor."
        ],
        [
            "Published",
            "05-28-2009",
            "12-17-2009",
            "12-17-2009",
            "01-21-2010",
            "03-11-2010",
            "04-16-2015"
        ]
    ],
    "pageTitle": "Itzhak - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/itzhak-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00229-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443256463,
    "recordOffset": 443231125,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Itzhak Kelson, Tel-Aviv IL //]]> BarDraw('2652841',['Patent applications by Itzhak Gurantz, San Diego, CA US'],[[2,3,1,1]],['2009','2011','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2652841\" align=\"center\"></div> </div> <canvas id=\"bg2652841\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Itzhak Gurantz, San Diego, CA US</p> <div class=\"bar2652841\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-19-2015</td> <td><a href=\"/patents/app/20150082360\">BROADBAND LOCAL AREA NETWORK</a> - A BCN network with BCN modems that enable network wired devices to communicate over a typical home coaxial network that may include passive splitters and different types of coaxial cable.</td> <td>20150082360</td> <tr> </tr> <td>08-21-2014</td> <td><a href=\"/patents/app/20140237513\">Variable Modulation Unicast System</a> - A system is described that consists of a variable modulation unicast system that utilizes multiple modulation schemes in a cable network for unicast applications and is capable of assigning users to different channels of differing modulation schemes in the network based on a feedback signal received in response to a transmitted probe signal. The system may also, in response to the feedback signal from a remote device in the network, assign a channel from a plurality of channels having differing carrier frequencies and modulation schemes to the remote device and may also modify the carrier frequencies of the channels.</td> <td>20140237513</td> <tr> </tr> <td>08-25-2011</td> <td><a href=\"/patents/app/20110209186\">Variable Modulation Unicast System</a> - A system is described that consists of a variable modulation unicast system that utilizes multiple modulation schemes in a cable network for unicast applications and is capable of assigning users to different channels of differing modulation",
    "textAfterTable": "Patent applications by Itzhak Kelson, Tel-Aviv IL Itzhak Kiselevsky, Kfar Saba IL Patent application number Description Published 20120243622 METHOD AND APPARATUS FOR IMPROVING THE ERROR RATE OF A SERIAL/DE-SERIAL BACKPLANE CONNECTION - Methods and apparatus that reduce the error rate of a Serial-De-Serial (SerDes) backplane connection are shown. The apparatus may include a receiver verifying a received block of data at the PHY layer. When the received block of data is received correctly, that block can be acknowledged by the receiver to the transmitter, which is also located at the PHY later. Upon detection of an error in a block of data, the receiver may send a negative acknowledge along with the block number, or some other suitable block identifier, of the faulty block to the transmitter. The transmitter may buffer blocks of data, and remove each block from the buffer upon receiving an acknowledgement. Use of the retransmission protocol may be triggered by speed of the connection, the bandwidth of the connection, the detection of too many errors in the connection or any suitable combination of these, or other, parameters. 09-27-2012 Itzhak Kremin, Givatayim IL Patent application number Description Published",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}