{
    "relation": [
        [
            "Class",
            "com.sun.identity.liberty.ws.authnsvc.mechanism.PlainMechanismHandler",
            "com.sun.identity.liberty.ws.authnsvc.mechanism.CramMD5MechanismHandler"
        ],
        [
            "Description",
            "This class is the default implementation for the PLAIN authentication mechanism. It maps user identifiers and passwords in the PLAIN mechanism to the user identifiers and passwords in the LDAP authentication module under the root organization.",
            "This class is the default implementation for the CRAM-MD5 authentication mechanism."
        ]
    ],
    "pageTitle": "Part II Federation, Web Services, and SAML Administration (Sun OpenSSO Enterprise 8.0 Administration Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19316-01/820-3885/gglxk/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73078059,
    "recordOffset": 73010023,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{283064=urn:liberty:security:2005-02:null:SAML, 282233=urn:liberty:security:2003-08:null:null, 282535=urn:liberty:security:2005-02:ClientTLS:Bearer, 261043=It is recommended that the value of this attribute be the targetNamespace URI defined in the abstract WSDL description for the service. An example of a valid URI is urn:liberty:id-sis-pp:2003-08., 283137=urn:liberty:security:2005-02:null:X509, 281871=urn:liberty:security:2003-08:TLS:SAML, 273086=This field defines the type of service. It is recommended that the value of this attribute be the targetNamespace URI defined in the abstract WSDL description for the service. An example of a valid URI is urn:liberty:disco:2003-08., 282160=urn:liberty:security:2003-08:null:X509, 267076=This URI defines the type of service. It is recommended that the value of this attribute be the targetNamespace URI defined in the abstract WSDL description for the service. An example of a valid URI is urn:liberty:id-sis-pp:2003-08., 281793=urn:liberty:security:2003-08:ClientTLS:null, 282917=urn:liberty:security:2005-02:TLS:X509, 282615=urn:liberty:security:2005-02:ClientTLS:SAML, 281943=urn:liberty:security:2003-08:TLS:X509, 282989=urn:liberty:security:2005-02:null:Bearer, 282015=urn:liberty:security:2003-08:TLS:null, 282693=urn:liberty:security:2005-02:ClientTLS:X509, 282087=urn:liberty:security:2003-08:null:SAML, 205668=urn:liberty:disco:2003-08:DiscoveryResourceOffering=urn:liberty:disco:2003-08:DiscoveryResourceOffering, 192486=A sample SAMLv2 assertion is reproduced below. Note the SAML v2 security token stored in the Discovery Service resource offering: urn:liberty:security:2003-08:null:SAML. Both are stored within the attribute statement., 281715=urn:liberty:security:2003-08:ClientTLS:X509, 282845=urn:liberty:security:2005-02:TLS:SAML, 306961=This attribute is used to calculate the notBefore time of an assertion. For example, if IssueInstant is 2002-09024T21:39:49Z, and Assertion Skew Factor For notBefore Time is set to 300 seconds (180 is the default value), the notBefore attribute of the conditions element for the assertion would be 2002-09-24T21:34:49Z., 282306=urn:liberty:security:2004-04:ClientTLS:Bearer, 282460=urn:liberty:security:2004-04:null:Bearer, 282771=urn:liberty:security:2005-02:TLS:Bearer, 282386=urn:liberty:security:2004-04:TLS:Bearer, 281637=urn:liberty:security:2003-08:ClientTLS:SAML}",
    "lastModified": "Thu, 03 Feb 2011 09:54:01 GMT",
    "textBeforeTable": "ssoadm Subcommands for Managing Metadata Table 7–1 ssoadm is used to manage the provider metadata. The following table describes the ssoadm subcommands specific to metadata management. Managing Entity Metadata using ssoadm Managing Circles of Trust Using ssoadm Managing Entity Metadata using ssoadm This section contains the following information: The format of the XML file used as input is based on the sms.dtd. Alterations to the DTD files may hinder the operation of OpenSSO Enterprise. Caution – The previous sections detailed how to create and configure entities and circles of trust using the OpenSSO Enterprise console. But entities can also be created and configured using the ssoadm command-line interface. Rather than filling in provider attribute values manually, you would create an XML file containing the provider attributes and corresponding values and import it using ssoadm. Managing Federation Using ssoadm Click Delete. Deleting a circle of trust does not delete the providers that belong to it. Check the box next to the name of the circle of trust you want to delete. A circle of trust must be empty of providers before you delete it. Follow this procedure to delete an existing",
    "textAfterTable": "Note – Use the –spec option to specify saml2 , idff, or wsfed. create-meadata-templ Generates a metadata configuration file for any provider type with defined values for default metadata properties. The generated file can be modified for use with import-entity. Note – Use the –spec option to specify saml2 , idff, or wsfed. delet-entity Removes standard or extended metadata from a local configuration data store.  Note – Use the –spec option to specify saml2 , idff, or wsfed. list-entities Generates a list of all the entity identifiers on the system.  Note – Use the –spec option to specify saml2 , idff, or wsfed. update-entity-key-info Update XML signing and encryption key information for a hosted IDP or SP.  There are two types of entity provider metadata (formatted in XML files) that can be used as input to ssoadm: Standard metadata properties are defined in the Liberty ID-FF and SAMLv2 specification. Extended metadata properties are proprietary and used by features specific to OpenSSO Enterprise. Information regarding the attributes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}