{
    "relation": [
        [
            "Patent application number",
            "20090141246",
            "20130044298",
            "20130077054",
            "20140043678",
            "20140300872"
        ],
        [
            "Description",
            "PROJECTION TYPE IMAGE DISPLAY APPARATUS - A projection type image display apparatus includes: a cabinet; a screen which is provided in the cabinet; a display device which is placed inside the cabinet and forms an image; and an optical system which projects an image formed by the display device to the screen and comprises at least one mirror, a supporter for supporting the mirror, and a frame through which the supporter is fastened to the cabinet, all of the mirror, the supporter and the frame being disposed within a single interior space formed by the cabinet and the screen.",
            "FOCUS REGULATING APPARATUS OF PROJECTOR AND PROJECTOR USING THE SAME - Disclosed are a focus regulating apparatus for use with a projector and a projector using the same. The apparatus has a structure which is designed to overcome asymmetry in focus regulation due to the optical characteristics of the projector. The focus regulating apparatus of a projector includes: a focus regulator, which is provided in a projection lens unit of a projector main body so that the focus can be regulated by rotating a lens barrel of the projection lens unit; and an actuator, which gears with the focus regulator and moves rectilinearly with respect to the projector main body, thereby causing the focus regulator to rotate. The rotation of the focus regulator is varied when the actuator rectilinearly moves at a constant speed. The apparatus thus enables an asymmetry in focus regulation to be overcome when a screen size for the projector is adjusted.",
            "PROJECTOR AND DISPLAY APPARATUS HAVING THE SAME - The projector according to an exemplary embodiment includes an optical system which forms, expands, and projects the image, and includes at least one light source; a light source dissipation unit for dissipating heat generated by the light source; a plurality of circuit boards for operating the projector; an intake unit having an intake opening where external air is received; an exhaust unit having an exhaust opening where the received air is expelled; and a flow path dividing unit which divides a cooling flow path formed between the intake opening and the exhaust opening into an upper cooling flow path and a lower cooling flow path, wherein the light source dissipation unit is placed on the upper cooling flow path and at least one of the plurality of circuit boards is placed on the lower cooling flow path.",
            "PROJECTION APPARATUS INCLUDING INTEGRATED IMAGE PROJECTIONUNIT AND SCREEN UNIT - A projection apparatus, in which an image projection unit and a screen unit are integrally mounted on one mounting unit, is provided. The screen unit includes a screen configured to display an image, and a screen attaching part to which the screen is attached. The screen attaching part includes a front plate to which the screen is attached, a rear plate, and a strength reinforcing member interposed between the front plate and the rear plate.",
            "DISPLAY DEVICE - A projection-type display device having an improved structure to effectively cool an optical engine to generate light having image information and project the same onto a screen, and a driving circuit to drive the optical engine are provided."
        ],
        [
            "Published",
            "06-04-2009",
            "02-21-2013",
            "03-28-2013",
            "02-13-2014",
            "10-09-2014"
        ]
    ],
    "pageTitle": "Lim, Suwon-Si - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lim-suwon-si-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442780264,
    "recordOffset": 442743771,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jae-Geun Lim, Suwon-Si KR 03-25-2010 Probe of electrical measuring instrument - Disclosed is a probe of an electrical measuring instrument including a handle and at least one loop antenna coupled to the handle. A plane defined by the loop antenna is oriented to face an object to be inspected, to detect electrical characteristics in the vicinity of the object. Enhanced accessibility of the probe with respect to the object to be inspected results in an improvement in the accuracy of measured electrical characteristics information and use convenience of the probe by an inspector. 20100073020 Published Description Patent application number Jae Deok Lim, Suwon-Si KR //]]> BarDraw('3116751',['Patent applications by Hyun-Sig Lim, Suwon-Si KR'],[[1,1,1]],['2010','2012','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3116751\" align=\"center\"></div> </div> <canvas id=\"bg3116751\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Hyun-Sig Lim, Suwon-Si KR</p> <div class=\"bar3116751\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-02-2014</td> <td><a href=\"/patents/app/20140297720\">CLIENT APPARATUS, SERVER APPARATUS, MULTIMEDIA REDIRECTION SYSTEM, AND METHOD THEREOF</a> - A client apparatus, a server apparatus, a multimedia redirection system, and a method thereof includes: a client interface which communicates with a server apparatus that supports a multimedia redirection function; a connector which is connected to a client local storage that stores a client content; a data processor which processes the client content; a controller which transmits information about the client content to the server apparatus and, if a play command with",
    "textAfterTable": "Patent applications by Jae-Geun Lim, Suwon-Si KR Jae-Guyn Lim, Suwon-Si KR Patent application number Description Published 20090136148 Digital auto-focusing apparatus and method - An apparatus and method for digital auto-focus are provided. The apparatus includes a local block generator generating a local block from an input image, a distance-estimation unit estimating distances of each image of the local block, a focal-distance-setting unit setting one of the estimated distances of the local block image as a focal distance of the input image, a reblurred-image generator generating a reblurred image from the local block image, a reconstructed image generator generating an in-focus image focused to the estimated distances from the local block image, a local-block-image-matching unit matching the reblurred image to the in-focus image with different weight values based on the set focal distance, and a final-image generator generating a final image by summing the matched local block images. 05-28-2009 Jae-Heung Lim, Suwon-Si KR Patent application number Description Published 20120081592 DIGITAL PHOTOGRAPHING APPARATUS AND METHOD OF CONTROLLING THE SAME - A digital photographing apparatus with a display unit on a front surface thereof and a method of controlling the same. The method",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}