{
    "relation": [
        [
            "Payment method",
            "Money order/Cashiers cheque",
            "Cash in person",
            "Other - See seller's payment instructions"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Ford-F-350-XLT-FX4-Powerstroke-Turbo-Diesel/161398535964?hash=item25941a371c",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422253547,
    "recordOffset": 422197566,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135687=We have many different sources for the cars and trucks we stock. Vehicles may be purchased at dealer sales, at off-lease sales, directly from large franchise dealers, from credit unions and banks. The vehicles we sell on eBay are usually late model (2002 and newer) and have good miles and may still be under a factory warranty. We resell cars with clean titles only, this means we never sell salvage, rebuilt, reconstructed, insurance claim, flood or other gray market vehicles unless specifically noted., 88457=2011 Ford F350 SRW XLT 1 Ton Super Crew FX4- 4 wheel drive Long Bed 1Texas owner! Powered by a 6.7 liter V8 Powerstroke turbo diesel engine, accompanied by an automatic transmission, and patented Ford four wheel drive system with FX4 suspension. Wow!! This is a 1 Texas owner trade in!! This is a super clean truck! This truck rides and drives fantastic. This powerful diesel runs strong, the transmission is solid. Besides running fantastic it's good looking too. XLT Package, FX4 package, power driver seat, power windows, power locks, power tow mirrors, power folding mirrors, power sliding pedals, premium sound system with Sync, tow package, ice cold AC, cruise control, tilt wheel, chrome front and rear bumpers, 18\" alloy wheels, keyless entry, remote start, step rails, and much much more!!! Buy this truck with confidence! It's as good as it looks, and it is very nice! This is an outstanding vehicle! Buy with confidence and save thousands!!! Please Call us with any questions. We have financing available, please go to www.txssmotors.com and click on the financing link, not all vehicles will qualify, depending on year and miles. Ask us about extended warranty's, we have very competitive pricing and great coverage options. We can assist you with reliable shipping to your home or complementary Airport Pick Up at DFW International Airport or Dallas Love Field! Please call us at 817-459-4848 or 469-600-4269 with any questions., 135398=We are located at 1920 W. Pioneer Pkwy. Arlington TX 76013. All vehicles are stored at our secure facility.}",
    "textBeforeTable": "Full Payment Payment details Go to the Gigamoves website Want a personalized quote from one of these transport companies?  Sign in to get free shipping quotes. Shipping Quotes Shipping to: United States Item Location:Arlington, Texas, United States If your vehicle is near you, just make arrangements with the seller to pick it up. If it's further away, you can either fly or drive to the car's location, or you can hire a shipping service to get it delivered to your door. The seller may have additional options available, so check their description for more information Shipping and handling Seller assumes all responsibility for this listing. AutoCheck Sign In  please sign in now for access to your remaining reports If you",
    "textAfterTable": "Full payment is required within 7 days of auction close Vehicle Purchase Protection This vehicle is eligible for up to $50,000 in Vehicle Purchase Protection in the event that you never receive after you have paid for it or sent a refundable deposit. To qualify for Vehicle Purchase Protection you must be the winning bidder or an auction or click the Buy It Now button directly on the eBay site. Additional eligibility may apply. Please refer to the full terms, conditions and restrictions Financing Get Low Monthly Payments on the Vehicle You Always Wanted! Get Pre-approved at RoadLoans.com | Estimate monthly payment Monthly Payment Calculator",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}