{
    "relation": [
        [
            "Garden",
            "24Hr Backup",
            "Club House",
            "Badminton Court",
            "Electricity_backup"
        ],
        [
            "Swimming Pool",
            "Maintenance Staff",
            "Cafeteria",
            "Gymnasium",
            ""
        ],
        [
            "Play Area",
            "Security",
            "Broadband Internet",
            "Indoor Games",
            ""
        ],
        [
            "Health Facilities",
            "Intercom",
            "Tennis Court",
            "Community Hall",
            ""
        ]
    ],
    "pageTitle": "Residential Projects by Puravankara Projects Limited | Find Properties by Puravankara Projects Limited in Bangalore",
    "title": "",
    "url": "https://www.commonfloor.com/all-projects-by-puravankara-projects-limited-in-bangalore/bpc-mbo6b4-70",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902451331,
    "recordOffset": 902375307,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{230278=Bangalore - a bustling metropolis, whose economic prosperity and cosmopolitan populace are reflective of India's march towards becoming a global powerhouse. The world's second fastest growing city has witnessed a complete metamorphosis from a laid-back, pensioners' haven to a booming, global tech-city. As one of Singapore's leading, listed property developers with a portfolio of landmark residential projects across the Asia-Pacific, Keppel Land Limited is proud to play a part in making Bangalore a truly international destination. In a first-of-its kind Joint Venture, Keppel Land Limited has joined hands with Puravankara Projects Ltd, one of Bangalore's premier developers, to form Elita - a series of international living spaces across the country. Elita Promenade - the first international residential project launched in Bangalore, is a hallmark of Keppel's expertise and global outlook., 256606=The entire project stretches in an area of 13 acres at Sarjapur Road in Bangalore. It comprises of with an option of 2 BHK (1285 sq. ft.), 3 BHK (1614 sq. ft.) and 4 BHK (2342 sq. ft.) apartments. The project is located off Sarjarpur Road, Kudlu / Haralur which is merely 4 km from ORR Junction Bangalore.Floor Level:G+20 .The complex has state of art health club, swimming pool, club area and play area having different types of games for residents. The whole area is developed with ample green space making it an Eco-friendly zone. It also comprises of Sports Facility, Gymnasium, Jogging Track, Party Hall, Meditation /Aerobic room, Crèche, Super Market, Amphitheater, landscape garden, Water purification plant and fire protection system, Sewerage Treatment Plant & Organic waste converter and many more.Puravankara Group was established in 1975 with the aim to be a household name across the country owing to the response and demand for quality housing and commercial space in the metropolitan cities of India., 128670=Project is Ready to Occupy and was delivered around Dec 2012, 309224=Project is Ready to Occupy and was delivered around Dec 2010, 271201=Project is Ready to Occupy and was delivered around Apr 2010, 141947=Puravankara one the India’s most well known and established developers bring to you their new project Purva Highlands. Located on a plateau off Kanakpura Road, Bangalore, Purva Highlands comprises of 13, G+20 storied towers and offers 1500, 2 and 3 bedroom well appointed residential apartments. From outdoors to indoors, Purva Highlands offers you enough options to enjoy. You can indulge at the clubhouse, the swimming pool, the gym or the tennis court. For those cut out for lighter things in life, there’s the herbal garden and the amphitheatre. From spacious, airy rooms to high-end specifications and fixtures, it’s a project planned for the discerning customers like you. It offers both homebuyers and investors another opportunity to invest in one of the hottest real estate markets in India. It stands tall as a masterpiece to be emulated. Better still, it’s the perfect example of how a world-class home should be., 333063=Purva Belmont is an completed project of Puravankara Projects Limited. It has an intake of 4 residential blocks and over 204 spacious houses. It offers 2 bhk apartments in an area space of 1210 sq ft. It is situated on the ground floor. Located at JP Nagar in Bangalore, this is a highly residential area., 31582=PURVA THE WAVES Purva The Waves is one such unprecedented creation by Purva Developers based on beach theme which impersonates landscapes, sights, sounds & tropical backwaters of the sea and is ideally located in the most affluent locality of Bangalore i.e. Narayanapura off Hennur Road. This mesmerizing project is constructed across a sprawling area of 19.5 acres wherein a central courtyard namely The Lagoon is equipped in a stretch of over 4 acres. The abodes at Purva The Waves have been caringly designed with great attention to details and offer a massive space range of 1346-1962 sqft in a budget ., 296994=Purva Gold Crest There comes a time in your life, when you feel your success, tastes and lifestyle deserve a better address.   Yes! It’s that time now. Come home to Gold Crest apartments from Puravankara. Planned intricately, these large, lavish 3 BHK homes (measuring nearly 1900 sft.) speak of \u001fawless quality, fabulous amenties and an ambience that’s straight out of a fairytale book. And yes! You’ve a 12,000 sft. clubhouse and a 10,000 sft. 3-tier swimming pool to substantiate the claim.   Speaking of smartness, these apartments are built using modern MIVAN Technology, even the doors are pre-engineered to give you that perfect \u001enish. Gold Crest homes are strategically perched on a hillock o\u001d Kanakapura Road. In fact, from now on your drive to both Bannerghatta Road and Electronic City will become shorter and easier., 4940=Since its inception in 1975, Puravankara has believed that there is only one mantra for success: Quality. This credo combined with uncompromising values, customer-centricity, robust engineering, and transparency in business operations, has placed it among the most preferred real estate brands in both residential and commercial segments. The Company has grown from strength to strength, having successfully completed 36 residential/commercial projects spanning 7.80 million square feet. Currently, it has 29 million square feet of projects under development, with an additional 88 million square feet in projected development over the next 7-10 years. An ISO 9001 certification by DNV in 1998 and a DA2+ rating by CRISIL are testament to Puravankara s reputation as a real estate developer of the highest quality and reliability standards.}",
    "textBeforeTable": "Amenities Map HDFC Bank, Axis Bank, State Bank of India, HSBC, ING Vysya Bank, Standard Chartered Bank, ICICI Bank, All Leading Bank Home Loans providers include Project is known to be approved by BBMP, BESCOM, BWSSB, A Khata Project Approving Authorities Approvals 1.92Cr - 2.08Cr 2275-2425 sq.ft 4bhk Apartments 1.48Cr - 1.70Cr 1867-2024 sq.ft 3bhk Apartments Price Area Bedrooms Property Type Unit Types Purva Whitehall Purva Whitehall, We are pleased to announce the launch of a Premium project PURVA Whitehall on Sarjapur Road next to Total Mall. There are in the project with a combination of 3 and 4 BHK. ‘A reflection of rich taste and successful life’ Loaded with amenities and strategically located, Purva Whitehall is an address only for the privileged few. Constructed with high-end specifications like laminated wooden/vitrified flooring in the master bedroom, marble/granite counter washbasins, the best modular kitchens and plastic",
    "textAfterTable": "About Builder Since its inception in 1975, Puravankara has believed that there is only one mantra for success: Quality. This credo combined with uncompromising values, customer-centricity, robust engineering, and transparency in business operations, has placed it among the most preferred real estate brands in both residential and commercial segments. The Company has grown from strength to strength, having successfully completed 36 residential/commercial projects spanning 7.80 million square feet. Currently, it has 29 million square feet of projects under development, with an additional 88 million square feet in projected development over the next 7-10 years. An ISO 9001 certification by DNV in 1998 and a DA2+ rating by CRISIL are testament to Puravankara s reputation as a real estate developer of the highest quality and reliability standards. 17 PHOTOS",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}