{
    "relation": [
        [
            "First Name",
            "Kam",
            "Randall"
        ],
        [
            "Last Name",
            "Quarles",
            "Jones"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=6D82EC4C-32E8-4ED8-A1F4-C9A450A9BE1C&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224992065,
    "recordOffset": 224983863,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34232=H.R. 371, Agriculture Job Opportunities, Benefits, and Security Act of 2007, provisions relating to agriculture and farmer cooperatives. S.340, Agriculture Job Opportunities, Benefits, and Security Act of 2007, provisions relating to agriculture and farmer cooperatives. H.R. 1645, Security Through Regularized Immigration and Vibrant Economy Act of 2007 (STRIVE), provisions relating to agriculture and farmer cooperatives. H.R. 4008, Secure America Through Verification and Enforcement Act of 2007 (SAVE Act), provisions relating to agriculture and farmer cooperatives. H.R. 2642, Supplemental Appropriations Act of 2008, provisions related to Emergency Agricultural Relief Act (EARA) Amendment. S. 1348, Comprehensive Immigration Reform Act of 2007; provisions relating to agriculture and farmer cooperatives. S. 1639, A bill to provide for comprehensive immigration reform and other purposes; provisions relating to agriculture and farmer cooperatives., 40664=H.R. 2419, Food Conservation and Energy Act of 2008, implementation of tax and other provisions relating to agriculture and farmer cooperatives. H.R. 6124, Food Conservation and Energy Act of 2008, implementation of tax and other provisions relating to agriculture and farmer cooperatives. H.R. 6049, Energy and Tax Extenders Act of 2008; provisions relating to agriculture and farmer cooperatives., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12229=Capper- Volstead Act; provisions related to agriculture and farmer cooperatives. H.R. 2419, Food, Conservation and Energy Act of 2008; implementation of provisions relating to agricultur and farmer cooperatives. H.R. 6124, Food, Conservation and Energy Act of 2008; implementation of provisions relating to agricultur and farmer cooperatives., 16356=H. Con. Res. 312, FY 2009 Budget Resolution; provisions relating to agriculture. S.Con.Res 70, FY 2009 Budget Resolution; provisions relating to agriculture. FY 2009 Agriculture Appropriations; provisions relating to agriculture and farmer cooperatives. FY 2009 Energy and Water Appropriations, provisions relating to agriculture and farmer cooperatives., 47863=H.R. 2419, Food Conservation and Energy Act of 2008, implementation of tax and other provisions relating to agriculture and farmer cooperatives. H.R. 6124, Food Conservation and Energy Act of 2008, implementation of tax and other provisions relating to agriculture and farmer cooperatives. H.R. 2629, To restore import and entry agricultural inspection functions to the U.S. Dept of Agriculture; provisions relating to agriculture and farmer cooperatives. S.887, To restore import and entry agricultural inspection functions to the U.S. Dept of Agriculture; provisions relating to agriculture and farmer cooperatives. H.R. 445 A bill to terminate limitations on imports of ammonium nitrate from Russian Federation, provisions relating to agriculture and farmer cooperatives. USDA GSM Export Credit Program, provisions relating to agriculture and farmer cooperatives. USDA Agriculture Export Program; provisions relating to agriculture and farmer cooperatives. FY 2009 Agriculture Appropriations; provisions relating to agriculture and farmer cooperatives. U.S.- Korea Free Trade Agreement; provisions relating to agriculture and farmer cooperatives. U.S.- Peru Free Trade Agreement; provisions relating to agriculture and farmer cooperatives. WTO- Doha Round of Trade Negotiations; provisions relating to agriculture and farmer cooperatives., 26502=H.Con.Res.25, Expressing Sense of Congress that 25% of U.S. Energy should come from renewable resources by 2025, provisions relating to agriculture and farmer cooperatives. S.Con.Res.3, Expressing Sense of Congress that 25% of U.S. Energy should come from renewable resources by 2025, provisions relating to agriculture and farmer cooperatives. H.R. 2419 Food, Conservation and Energy Act of 2008; Implementation of energy and other provisions relating to agriculture and farmer cooperatives. H.R. 6124 Food, Conservation and Energy Act of 2008; Implementation of energy and other provisions relating to agriculture and farmer cooperatives. H.R. 2361, Responsible Renewable Energy Tax Credit Act of 2007; provisions relating to agriculture and farmer cooperatives. H.R. 6049, Energy and Tax Extenders Act of 2008; provisions relating to agriculture and farmer cooperatives., 30629=H.R. 1398, Agriculture Protection and Prosperity Act of 2007; provisions relating to agriculture and farmer cooperatives. S. 807, Agriculture Protection and Prosperity Act of 2007; provisions relating to agriculture and farmer cooperatives. S. 3036, Climate Security Act, provisions relating to agriculture and farmer cooperatives., 52601=H.R. 5904, Safe Food Enforcement, Assessment, Standards and Targeting Act of 2008 (Safe FEAST Act); provisions relating to agriculture and farmer cooperatives., 19948=H.R. 2421, Clean Water Restoration Act of 2007; provisions affecting agriculture and farmer cooperatives. S. 1870, Clean Water Restoration Act of 2007; provisions affecting agriculture and farmer cooperatives. Spill Prevention, Control and Countermeasures (SPCC); provisions and regulations affecting agriculture and farmer cooperatives. Air Quality (Particulate Emissions and GHG Emissions); provisions and regulations affecting agriculture and farmer cooperatives. Concentrated Animal Feeding Operations (CAFO); provisions and regulations affecting agriculture and farmer cooperatives. H.R. 21, Ocean Conservation, Education, and National Strategy for the 21st Century Act; all provisions affecting agriculture and farmer cooperatives. Nypoxia Task Force Report and Implementation; all recommendations affecting agriculture and farmer cooperatives. Clean Water Act; application and regulations pertaining to agriculture.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  RANDALL T. JONES  2026268700  jthomson@ncfc.org 5. Senate ID#  27638-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}