{
    "relation": [
        [
            "Patent application number",
            "20090326030",
            "20120017447",
            "20140010585"
        ],
        [
            "Description",
            "Use of Levo-Ornidazole in the Preparation of Anti-Anaerobic Bacteria Infection Drugs - The use of levo-ornidazole in the preparation of medicine for preventing and treating the anti-anaerobic bacteria infection is provided. It is demonstrated that levo-ornidazole exhibits lower toxicity and less central inhibition effects than dextro-ornidazole or racemic ornidazole. L-ornidazole possesses pharmacokinetics characteristics, which are superior to that of the racemic ornidazole, and anti-anaerobic activities which are slightly better than or substantially the same as that of the racemic ornidazole. Also, this invention particularly relates to a preparation process, which comprises formulating L-ornidazole as anti-anaerobic infection pharmaceutical preparations, which are suitable for clinical uses.",
            "HAND-HELD POWER TOOL FOR PRUNING AND CUTTING VEGETATION AND A METHOD FOR REPLACING BLADES THEREOF - A hand-held power tool for pruning and cutting vegetation and a method for replacing blades thereof. The hand-held power tool has a main body and a work head detachably mounted on the main body. The main body has a housing, a motor placed in the housing, and a first gear transmissively connected with the motor. The work head has a blade assembly and a second gear. The second gear engages with the first gear and is provided with a eccentric member connected with the blade assembly. By arranging one portion of the transmission mechanism on the work head, especially the second gear used for providing the eccentrically rotary output on the work head, the transmission mechanism is directly connected with the blade assembly. When the work head needs to be mounted on the main body, it only needs the second gear to be placed on the mandrel arranged on the main body where it will engage with the first gear. This avoids the need to align and mate the eccentric member arranged on the second gear with the upper and lower blades one by one thereby providing an assembly process that is simple and time-saving while providing a connection that is reliable.",
            "ELECTRICAL TOOL WITH BATTERY PACK EJECTION ASSIST MECHANISM - The present invention provides an electrical tool with batter pack ejection assist mechanism. The electrical tool includes a housing receiving a motor and a transmission mechanism, a tool accessory driven by the motor for the operation, a battery pack slidably mounted to the housing for providing power and a locking mechanism for locking the battery pack after being mounted. The electrical tool further includes an ejecting assembly for assisting in the ejection of the battery pack when the locking mechanism unlocks the battery pack, the ejecting assembly includes a contacting member for contacting and ejecting the battery pack and a driving member for driving the contacting member for ejecting the battery pack. The contacting member is movably connected to the housing, and the driving member is arranged in the housing and contacts the contacting member."
        ],
        [
            "Published",
            "12-31-2009",
            "01-26-2012",
            "01-09-2014"
        ]
    ],
    "pageTitle": "Li Li - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/li-li-2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436545747,
    "recordOffset": 436496962,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Li Li, Nanjing CN 01-07-2010 Smart thermal textile for acupuncture therapy - The present invention relates to a smart textile capable of providing acupuncture therapy to the wearer through strategically positioned electrodes throughout the textile, connected via silver coated fabric. Through the instant invention, heat therapy can be applied to specific points on the body, while being safe due to the absence of wires. 20100004720 Published Description Patent application number Li Li, Kowloon HK //]]> BarDraw('3161736',['Patent applications by Li Li, Meridian, ID US'],[[7,9,3,2,4,1,1]],['2005','2006','2007','2008','2009','2010','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3161736\" align=\"center\"></div> </div> <canvas id=\"bg3161736\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Li Li, Meridian, ID US</p> <div class=\"bar3161736\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>09-01-2011</td> <td><a href=\"/patents/app/20110212608\">Sputtering-Less Ultra-Low Energy Ion Implantation</a> - Methods of implanting dopants into a silicon substrate using a predeposited sacrificial material layer with a defined thickness that is removed by sputtering effect is provided.</td> <td>20110212608</td> <tr> </tr> <td>01-28-2010</td> <td><a href=\"/patents/app/20100022096\">MATERIAL REMOVAL METHODS EMPLOYING SOLUTIONS WITH REVERSIBLE ETCH SELECTIVITIES</a> - A method for removing (e.g., etching) different dielectric materials from a semiconductor substrate includes exposing the semiconductor substrate to a solution at temperatures below and at or above a set threshold. Below the threshold temperature, the solution removes one dielectric material (e.g., silicon nitride) faster than it removes another, different dielectric material (e.g., silicon oxide). At or above the threshold temperature, the selectivity of",
    "textAfterTable": "Patent applications by Li Li, Nanjing CN Li Li, Issaquah, WA US Patent application number Description Published 20080262909 INTELLIGENT INFORMATION DISPLAY - Computer-readable media, systems, and methods for intelligent information display are described. In embodiments, a display environment is monitored for one or more audience data and, upon receiving the one or more audience data, display information is processed in accordance with the one or more audience data and the processed display information is presented. In various embodiments, the audience data includes user gestures that indicate a communication with the intelligent information display, such as gestures indicating a mouse motion or a mouse click. In various other embodiments, the audience data includes demographic indicia such as the typical gender and/or typical age of an audience in a display environment. 10-23-2008 20080282290 Interactive Viewer for Advertisements - A system, method, and computer-readable media are presented for displaying an interactive viewer associated with an advertisement within a user interface. In one aspect, the system includes an advertisement manager for providing advertisements in response to request from clients. The system further includes a rendering component for determining if an advertisement has an associated interactive viewer, determining features associated with the advertisement,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}