{
    "relation": [
        [
            "Patent application number",
            "20120228547",
            "20120228548"
        ],
        [
            "Description",
            "MOISTURE CONTROL CONSTRUCTION MATERIAL AND METHOD FOR PRODUCING THE SAME - Provide is a moisture control constructional material which has improved moisture control performance and strength and which is easily produced, and a method for producing the same. The moisture control construction material is produced by forming a raw material that contains aluminum hydroxide and talc, and firing the formed raw material at 700° C. to 1100° C. The raw material contains 20% to 95% by weight aluminum hydroxide and 5% to 80% by weight of the talc-like material. The raw material may further contain at least one of clay and bentonite and/or montmorillonite.",
            "MOISTURE CONTROL CONSTRUCTION MATERIAL AND METHOD FOR PRODUCING THE SAME - Provide is a moisture control construction material which has improved moisture control performance and strength and which is easily produced, and a method for producing the same. The moisture control construction material is produced by forming a raw material that contains aluminum hydroxide and bentonite and/or montmorillonite, and firing the formed: raw material at 700° C. to 1100° C. The raw material contains 30% to 97% by weight aluminum hydroxide and 3% to 70% by weight bentonite and/or montmorillonite, or contains 30% to 90% by weight aluminum hydroxide, 1% to 30% by weight bentonite and/or montmorillonite, and 5% to 69% by weight clay."
        ],
        [
            "Published",
            "09-13-2012",
            "09-13-2012"
        ]
    ],
    "pageTitle": "Hirasawa, Tokyo - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hirasawa-tokyo-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449413407,
    "recordOffset": 449397958,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Yoshiaki Hirasawa, Tokyo JP //]]> BarDraw('3268345',['Patent applications by Yoichi Hirasawa, Tokyo JP'],[[1,2,1]],['2008','2009','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3268345\" align=\"center\"></div> </div> <canvas id=\"bg3268345\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Yoichi Hirasawa, Tokyo JP</p> <div class=\"bar3268345\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-27-2014</td> <td><a href=\"/patents/app/20140083818\">COMPONENT TRANSFER DEVICE AND METHOD</a> - A component transfer device according to the present invention includes a holding mechanism that positions and holds a component on a carrying surface located at a predetermined height and a pull-out unit that pulls out the component held on the carrying surface by the holding mechanism in a horizontal direction. The pull-out unit includes a grasping member that can separably grasp the component from a vertical direction, a cam member that causes the grasping member to perform a component grasping operation and a component releasing operation at predetermined timings by exercising a cam function to the grasping member, a driving mechanism that drives the cam member and the grasping member, and a restraint mechanism that restrains a relative movement of the cam member with respect to the movable holder upon grasping operation.</td> <td>20140083818</td> <tr> </tr> <td>10-22-2009</td> <td><a href=\"/patents/app/20090265031\">AUTOMATIC WAREHOUSE</a> - An automatic warehouse </td> <td>20090265031</td> <tr> </tr> <td>06-11-2009</td> <td><a href=\"/patents/app/20090148261\">Work Handling Apparatus</a> - A work handling apparatus of the present invention includes a general-purpose tray holding unit (</td> <td>20090148261</td> <tr> </tr> <th>Published</th> <th>Description</th> <th>Patent application number</th> <tr> <tbody> <table class=\"preltab\" id=\"inv_tab_3268345\"> <h2>Yoichi Hirasawa, Tokyo JP</h2> <div style=\"clear: left;\"></div>",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}