{
    "relation": [
        [
            "Patent application number",
            "20110082169",
            "20110086876"
        ],
        [
            "Description",
            "Stable SNS-595 Compositions and Methods of Preparation - Methods of preparing substantially pure SNS-595 substance are disclosed. Also provided are compositions comprising SNS-595 substance that are substantially pure and essentially free of visible particles.",
            "STABLE SNS-595 COMPOSITIONS AND METHODS OF PREPARATION - Methods of preparing substantially pure SNS-595 substance are disclosed. Also provided are compositions comprising SNS-595 substance that are substantially pure and essentially free of visible particles."
        ],
        [
            "Published",
            "04-07-2011",
            "04-14-2011"
        ]
    ],
    "pageTitle": "Cheng, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cheng-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437982055,
    "recordOffset": 437935840,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{99730=Patent applications by Jianjun Cheng, Arcadia, CA US}",
    "textBeforeTable": "Hengqin Cheng, Foster City, CA US 09-15-2011 METHOD AND APPARATUS FOR GENERATING A REFERENCE SIGNAL LEVEL AND FOR CANCELLING AMPLIFIER OFFSET IN AN OPTICAL SYSTEM - Described is a method and apparatus for generating a mid-level reference signal and for cancelling amplifier offset in an optical communication system without DC-balancing of optical data. The apparatus comprises an optical-to-electrical converter to receive an optical signal and to generate an electrical signal; an amplifier to receive the electrical signal and to generate an output signal based on a reference signal; a feedback mechanism to be enabled during a training phase only and to generate a control signal from the output signal; and a counter logic having a digital-to-analog converter to generate the reference signal based on the control signal. 20110222860 Published Description Patent application number Hengiu Cheng, Mountain View, CA US 10-30-2008 Bible Field Enhancer - A bible field enhancer includes a receiver cone that is hollow, and the apex of which is positioned near a bible. The bible is open in the middle and closed over the top, wherein the apex of the receiver cone is projected about ⅔ way in the middle of the bible. The enhancer also includes a bible jacket holder that holds a partially opened bible, and is attached along the receiver cone. The receiver cone and the bible jacket holder may be provided as small units that are assembled to make",
    "textAfterTable": "Honesty Young Cheng, Saratoga, CA US Patent application number Description Published 20090187447 CHECKING THE CORRECTNESS OF GIS DATA - A method and apparatus for checking the correctness of GIS data. The method includes the steps of: receiving GIS data; receiving business data of each branch; determining the geographic area to which each branch belongs, wherein the GIS data in the geographic area will be checked; and, checking whether the GIS data of the geographic area to which each branch belongs are correct based on the business data of each branch. The method and apparatus can automatically check geographic and demographic data of a given city or region. 07-23-2009 Hongfei Cheng, Sunnyvale, CA US Patent application number Description Published 20110208953 EVENT TIME MANAGEMENT IN AN ELECTRIC VEHICLE CHARGING STATION WITHOUT A BATTERY-BACKED REAL TIME CLOCK - An electric vehicle charging station, which does not include a battery-backed Real Time Clock, is in a charging station network managed by a charging station network server. Upon booting, the charging station requests actual real time from a remote source. While the charging station has not received the actual real time, it records the time of charging station specific events in a local system time format that resets when the charging station loses power. The charging station maintains the events recorded in their local system time until actual time is received. When actual real time",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}