{
    "relation": [
        [
            "Use this command...",
            "addIRMTranslation",
            "getIRMDefaultTranslation",
            "getIRMTranslations",
            "removeIRMTranslation",
            "setIRMTranslations"
        ],
        [
            "To...",
            "Create a new language support instance.",
            "Display the default language.",
            "Display all the language support instances.",
            "Remove an existing language support instance.",
            "Set the default language, and set a language support instance for one or more additional languages."
        ],
        [
            "Use with WLST...",
            "Online",
            "Online",
            "Online",
            "Online",
            "Online"
        ]
    ],
    "pageTitle": "Information Rights Management Custom WLST Commands",
    "title": "",
    "url": "http://docs.oracle.com/cd/E21764_01/web.1111/e13813/custom_irm.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77007290,
    "recordOffset": 76991339,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:19:31 GMT",
    "textBeforeTable": "Table 16-6 WLST Commands for Oracle IRM Server languages support Use the WLST commands listed in Table 16-6 to set up languages support for users of Oracle IRM Server. Languages Support Commands (English),Test Content (French)\\\") \\\"http://irm.example.com/exampleImage.jpg\\\",\\\"en,fr\\\",\\\"Test Content wls:/base_domain/serverConfig> updateIRMTestContent(0,  The following example updates a test content instance by changing the image to exampleImage.jpg at http://irm.example.com, for use with English and French installations, and showing the names 'Test Content (English)' and 'Test Content (French)': wls:/base_domain/serverConfig> updateIRMTestContent(0,\\\"http://irm.example.com/exampleImage.jpg\\\",\\\"en\\\",\\\"Test Content\\\")  The following example updates a test content instance by changing the image to exampleImage.jpg at http://irm.example.com, for use with English installations, and showing the name 'Test Content': Examples            Specifies the name(s) associated with this test content instance. If there is more than one name for a URI, they must be specified as comma-separated values. testNames   Specifies the locale(s) associated with this test content instance. Must be from the list of two-letter language codes given in Table 16-5 (for example, 'fr' for French). If there is more than one supported locale for an instance, the two-letter codes must be listed as comma-separated",
    "textAfterTable": "addIRMTranslation Online command that creates a new language support instance. Description This command creates a new language support instance. Each language support instance provides the facility in Oracle IRM Server to add names and descriptions in one or more languages (in addition to the default language). Syntax  addIRMTranslation(transList) Argument Definition transList Specifies the supported language(s). Must be from the list of two-letter language codes given in Table 16-5 (for example, 'fr' for French). If there is more than one supported language for an instance, the two-letter codes must be listed as comma-separated values. Examples The following example creates a language support instance that will enable users of Oracle IRM Server to add names and descriptions in French (in addition to their default language):  wls:/base_domain/serverConfig> addIRMTranslation(\\\"fr\\\") The following example creates a language support instance that will enable users of Oracle IRM Server to add names and descriptions in French and Arabic (in addition to their default language):  wls:/base_domain/serverConfig> addIRMTranslation(\\\"fr,ar\\\")",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}