{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "None"
        ],
        [
            "Adherents",
            "5,323",
            "4,998",
            "1,067",
            "573",
            "18,965"
        ],
        [
            "Congregations",
            "35",
            "2",
            "5",
            "6",
            "-"
        ]
    ],
    "pageTitle": "Harrison, Michigan (MI 48625) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Harrison-Michigan.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373076151,
    "recordOffset": 372952742,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6407=School Enrollment by Level of School (%) in 2013, 19059=Lead (Pb) [µg/m3] level in 2006 was 0.00304. This is significantly better than average. Closest monitor was 20.5 miles away from the city center., 76764=Elevation: 1186 feet, 2369=2012 Presidential Elections Results, 6805=Educational Attainment (%) in 2013, 3227=2000 Presidential Elections Results, 2655=2008 Presidential Elections Results, 23402=Air Quality Index (AQI) level in 2012 was 74.3. This is about average., 22022=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 1.39. This is significantly better than average. Closest monitor was 20.5 miles away from the city center., 21277=Sulfur Dioxide (SO2) [ppb] level in 2003 was 0.576. This is significantly better than average. Closest monitor was 20.5 miles away from the city center., 28595=Hotels: Blackie's North Star Cabins (585 County Farm Road) (1), Budd Lake Motel (378 N 1st St) (2), Acorn Motel (1306 North Clare Avenue) (3). Display/hide their approximate locations on the map, 45267=On 4/3/1956, a category F5 (max. wind speeds 261-318 mph) tornado 53.5 miles away from the Harrison city center killed 18 people and injured 340 people and caused between $50,000 and $500,000 in damages., 44953=On 3/30/1976, a category F3 (max. wind speeds 158-206 mph) tornado 29.8 miles away from the city center injured 10 people., 20529=Ozone [ppb] level in 2012 was 32.8. This is about average. Closest monitor was 20.5 miles away from the city center., 2085=Graphs represent county-level data. Detailed 2008 Election Results, 58078=According to our research of Michigan and other state lists there were 91 registered sex offenders living in Harrison, Michigan as of July 31, 2015. The ratio of number of residents in Harrison to the number of sex offenders is 23 to 1., 3513=1996 Presidential Elections Results, 19829=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 5.96. This is significantly better than average. Closest monitor was 20.5 miles away from the city center., 2941=2004 Presidential Elections Results, 22757=Carbon Monoxide (CO) [ppm] level in 2003 was 0.149. This is significantly better than average. Closest monitor was 20.5 miles away from the city center., 179365=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{15491=6.44% of this county's 2010 resident taxpayers moved to other counties in 2011 ($26,966 average adjusted gross income), 21597=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 13670=6.32% of this county's 2011 resident taxpayers lived in other counties in 2010 ($30,541 average adjusted gross income), 38849=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 37534=Total of 7 patent applications in 2008-2015.}",
    "textBeforeTable": "Religion statistics for Harrison city (based on Clare County data) Seven Lakes neighborhood Piney Woods neighborhood Lakeside neighborhood Hayes neighborhood Downtown Harrison (Downtown) neighborhood Coopertown neighborhood Buck Trails neighborhood Ash Acres neighborhood Allendale neighborhood Harrison, Michigan Neighborhood Map) Neighborhoods in Harrison:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 14 Clare County: 4.56 / 10,000 pop. Michigan: 2.34 / 10,000 pop. Number of convenience stores (no gas): 6 Clare County: 1.96 / 10,000 pop. Michigan: 1.52 / 10,000 pop. Number of convenience stores (with gas): 17 Clare County: 5.54 / 10,000 pop. State: 2.99 / 10,000 pop. Number of full-service restaurants: 26 Here: 8.47 / 10,000 pop. State: 6.80 / 10,000 pop. Adult diabetes rate: This county: 9.5% Michigan: 9.7% Adult obesity rate: Clare County: 28.5% Michigan: 29.7%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}