{
    "relation": [
        [
            "#",
            "1",
            "2"
        ],
        [
            "Rider Name (Country) Team",
            "Wai Sze Lee (HKg) Hong Kong",
            "Kayono Maeda (Jpn) Japan"
        ],
        [
            "Result",
            "",
            ""
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "UCI Track World Cup II 2012: Day 2 Results | Cyclingnews.com",
    "title": "Women sprint 1/8 finals heat 4",
    "url": "http://www.cyclingnews.com/races/uci-track-world-cup-ii-2012/day-2/results/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 389409147,
    "recordOffset": 389390011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41222=Earlier in the session, Lucas Liss had led the way for Germany by winning the men’s omnium ahead of Glenn O’Shea (Australia) and Unai Elorriaga Zubiaur (Spain). Meanwhile, Lasse Norman Hansen (Denmark) – who won the omnium at the London 2012 Olympics – was focused on the individual pursuit in Glasgow, and he took gold ahead of Ireland’s Martyn Irvine.}",
    "textBeforeTable": "Results   After three events of the women’s omnium, meanwhile, Ashlee Ankudinoff (Australia) leads Katarzyna Pawlowska (Poland) and Tatsiana Sharakova (Belarus), but Laura Trott (Great Britain) moved up the standings to fourth after taking a commanding victory in the elimination race. Earlier in the session, Lucas Liss had led the way for Germany by winning the men’s omnium ahead of Glenn O’Shea (Australia) and Unai Elorriaga Zubiaur (Spain). Meanwhile, Lasse Norman Hansen (Denmark) – who won the omnium at the London 2012 Olympics – was focused on the individual pursuit in Glasgow, and he took gold ahead of Ireland’s Martyn Irvine. In the women’s sprint, Kristina Vogel (Germany) emerged victorious by coolly dispatching of Jessica Varnish (Great Britain) in the final, winning 2-0. On each occasion, Vogel bided her time and nipped around Varnish on the crown of the final bend to take the decision. Varnish had defeated her British teammate Rebecca James to make the final, and James duly won the bronze medal race. In the men’s keirin, Olympic champion Jason Kenny (Great Britain) was the star attraction, but a crash in the final meant that he could only take fourth place, while Stefan Boetticher (Germany) took the gold medal ahead of Australia’s Peter Lewis. Day two of the UCI Track World Cup in Glasgow saw success for Germany in three separate disciplines while the British challenge was thwarted before an expectant public in Glasgow.",
    "textAfterTable": "3 David Muntaner Juaneda (Spa) Spain 0:04:26.479   4 Dylan Kennett (NZl) New Zealand 0:04:28.128   5 Andrew Tennant (GBr) Great Britain 0:04:28.806   6 Sergey Shilov (Rus) Lokosphinx 0:04:29.006   7 Ondrej Vendolsky (Cze) Czech Republic 0:04:29.968   8 Roy Eefting (Ned) Netherlands 0:04:33.334   9 Dias Omirzakov (Kaz) Kazakhstan 0:04:35.808   10 Gijs Van Hoecke (Bel) Belgium 0:04:36.279   11 Frank Pasche (Swi) Switzerland 0:04:37.369   12 Maximilian Beyer (Ger) Germany 0:04:38.046   13 King Lok Cheung (HKg) Hong Kong 0:04:38.616   14 Thomas Boudat (Fra) France 0:04:39.201   15 Oleksandr Lobov (Ukr) Ukraine 0:04:39.959   16 Manuel Cazzaro (Ita) Italy 0:04:41.405   17 Jonathan Mould (GBr) Team USN 0:04:42.263   18 Aliaksandr Lisouski (Blr) Belarus 0:04:42.729   19 Manuel Briceño (Ven) Venezuela 0:04:44.939   20 Cesar Octavio Ayala Mussard (Spa) Reyno de Navarra-Telco-M-Conor",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}