{
    "relation": [
        [
            "",
            "Arm A QHPV",
            "Arm B Placebo/QHPV"
        ],
        [
            "Description",
            "Participants received three doses of the quadrivalent human papillomavirus vaccine (QHPV) (Types 6, 11, 16, 18) at week 0, 8, and 24 and an additional dose at week 96.",
            "Participants received three doses of the placebo at week 0, 8, and 24 and additional dose of the quadrivalent human papillomavirus vaccine (QHPV) (Types 6, 11, 16, 18) at week 96, 104 and 120."
        ]
    ],
    "pageTitle": "Safety of and Immune Response to a Novel Human Papillomavirus Vaccine in HIV Infected Children - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00339040?sect=X0125&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00253-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 864475699,
    "recordOffset": 864455447,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups Participants were stratified by CD4% criteria. Four participants were randomized but did not receive the study treatment. The study analyses were based on 126 participants who received the study treatment. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Between October 11, 2006 and November 22, 2006 130 participants were enrolled at 34 clinical sites from US & Puerto Rico. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Biological: Quadrivalent human papillomavirus (types 6, 11, 16, 18) L1 virus-like particle (VLP) or Quadrivalent human papillomavirus vaccine (QHPV) Other: Placebo/QHPV Interventions: HIV Infections Sexually Transmitted Diseases",
    "textAfterTable": "Participant Flow for 2 periods Period 1:   Stage I     Arm A QHPV     Arm B Placebo/QHPV   STARTED     96     30   Vaccination 1 at Week 0     96     30   Vaccination 2 at Week 8     95     30   Vaccination 3 at Week 24     94     30   COMPLETED     94     29   NOT COMPLETED     2     1   Not",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}