{
    "relation": [
        [
            "Argument",
            "appName",
            "urn",
            "server",
            "applicationVersion"
        ],
        [
            "Definition",
            "Name of the Activity Graph application in which to perform this operation—always activitygraph-engines.",
            "URN for the Activity Graph rank calculation to delete.",
            "Optional. Name of the managed server where the application is deployed. For example, WC_Utilities. Required when applications with the same name are deployed to different servers and also when you have a cluster.",
            "Optional. Version number of the deployed application. Required if more than one version of the Activity Graph application is deployed."
        ]
    ],
    "pageTitle": "Oracle WebCenter Custom WLST Commands",
    "title": "",
    "url": "https://docs.oracle.com/cd/E21764_01/web.1111/e13813/custom_webcenter_admin.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 874009579,
    "recordOffset": 873908661,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{268718=Edits an existing Microsoft SharePoint 2007 repository connection. This command requires that you specify values for appName and name, plus at least one additional argument., 162353=The following example archives activity stream data that is older than October 1, 2009:, 463069=Choose OCS for Microsoft Office Communications Server 2007., 187205=Create a Microsoft SharePoint 2007 repository connection., 627383=The following example creates a connection named MyPEConnection for a WebCenter Spaces. The connection points to a Microsoft Exchange Server 2003., 460508=Use the listIMPAdapters command to find out which types of instant messaging and presence servers are supported. Out-of-the-box, WebCenter applications support Oracle WebLogic Communications Server (OWLCS), Microsoft Live Communications Server (LCS), and Microsoft Communications Server 2007 (OCS)., 587711=The frequency, in seconds, that Space distribution lists are checked for new incoming emails. The default is 1800 seconds (30 minutes)., 626838=The following example creates a connection named MyPEConnection for WebCenter Spaces (appName='webcenter'). The connection points to a Microsoft Exchange Server 2007 and is designated as the default connection for the Personal Events service., 187625=Edit a Microsoft SharePoint 2007 repository connection., 173817=The following example archives activity stream data associated with Spaces that have been inactive (no activities have occurred, regardless of open or closed status) since October 1, 2009:, 621416=The Personal Events service supports connections to Microsoft Exchange Server 2003 and Microsoft Exchange Server 2007.While you can register multiple personal events connections for a WebCenter application, only one connection is used for personal events services - the default (or active) connection., 188045=List all Microsoft SharePoint 2007 connections that are configured for a WebCenter application., 261480=Creates a connection to a Microsoft SharePoint 2007 repository., 178409=The following example restores activity stream data archived since October 1, 2009:}",
    "lastModified": "Wed, 13 May 2015 05:19:31 GMT",
    "textBeforeTable": "deleteConnection(appName, name, [server, applicationVersion])  Syntax       If you use deleteConnection to delete a WSRP or PDK-Java producer connection (instead of using deregisterWSRPProducer or deregisterPDKJavaProducer), unused secondary connections will remain, which you might want to remove. For example, when you delete a WSRP producer connection, its associated Web Service connection remains; when you delete a PDK-Java producer connection, its associated URL connection remains. Deletes a named WebCenter connection. Description     Use with WLST: Online Module: Oracle WebCenter deleteConnection        Online   Clone a WebCenter Managed Server.   cloneWebCenterManagedServer     Online   List all the WebCenter connection types.   getWebCenterConnectionTypes     Online   Return status information for the last WebCenter command executed.   webcenterErrorOccurred     Online   Return WebCenter Service Framework configuration properties.   getWebCenterServiceFrameworkConfig     Online   Set WebCenter Service Framework configuration",
    "textAfterTable": "Example The following example deletes a WebCenter connection.  wls:/weblogic/serverConfig> deleteConnection(appName='webcenter', name='MyConnection') setWebCenterServiceFrameworkConfig Module: Oracle WebCenter Use with WLST: Online Description Sets WebCenter Service Framework configuration properties, such as the Resource Action Handler class and display as popup properties. Syntax  setWebCenterServiceFrameworkConfig(appName, [resourceActionHandlerClassName], [resourceActionHandlerDisplayInPopup], [server], [applicationVersion]) Argument Definition  appName Name of the WebCenter application in which to perform this operation. For WebCenter Spaces, the name is always webcenter.  resourceActionHandlerClassName Optional. Class used by the Service Framework Resource Action Handler. resourceActionHandlerDisplayInPopup Optional. Indicates whether the Resource Action Handler displays resources in a popup or inline. Valid options are 1 (true) and 0 (false).  server Optional. Name of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}