{
    "relation": [
        [
            "Property",
            "ColumnType",
            "CopyFromReferenceColumn",
            "SourceInputColumnLineageId"
        ],
        [
            "Data type",
            "Integer (enumeration)",
            "String",
            "Integer"
        ],
        [
            "Description",
            "A value that identifies the type of output column for columns that the transformation adds to the output. The valid values are Similarity, Confidence, and ColumnSimilarity.",
            "A value that specifies the name of the column in the reference table that provides the value in an output column.",
            "A value that identifies the input column that provides values to this output column."
        ]
    ],
    "pageTitle": "Transformation Custom Properties",
    "title": "",
    "url": "https://technet.microsoft.com/en-US/library/ms136014(v=sql.90).aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894406671,
    "recordOffset": 894381266,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{127664=12 December 2006, 21753=The data flow objects in the Microsoft SQL Server 2005 Integration Services (SSIS) object model have many common properties that can be set at the level of the component, input or output, input column or output column. Many data flow objects also have custom properties that are specific to the object. These custom properties are available only at run time, and are not documented in the Integration Services Managed Programming Reference Documentation., 128131=5 December 2005}",
    "textBeforeTable": "Transformations with Custom Properties Some properties of transformations can be set by using property expressions. For more information, see Using Property Expressions to Specify Property Values for Data Flow Objects. This topic lists and describes the custom properties of the various data flow transformations. For information about the properties common to most data flow objects, see Common Properties. The data flow objects in the Microsoft SQL Server 2005 Integration Services (SSIS) object model have many common properties that can be set at the level of the component, input or output, input column or output column. Many data flow objects also have custom properties that are specific to the object. These custom properties are available only at run time, and are not documented in the Integration Services Managed Programming Reference Documentation. Updated: 12 December 2006 SQL Server 2016 SQL Server 2008 SQL Server 2008 R2 SQL Server 2012 SQL Server 2014 Other Versions SQL Server 2005 Transformation Custom Properties",
    "textAfterTable": "Lookup Merge Join OLE DB Command Percentage Sampling Pivot Row Count Row Sampling Script Component Slowly Changing Dimension Sort Term Extraction Term Lookup Unpivot     Transformations Without Custom Properties The following transformations have no custom properties at the component, input, or output levels. They use only the properties common to all data flow components. Merge Transformation. For more information, see Merge Transformation. Multicast Transformation. For more information, see Multicast Transformation. Union All Transformation. For more information, see Union All Transformation. To view the list of properties common to all data flow components, see Common Properties. Aggregate Transformation Custom Properties The Aggregate transformation has both custom properties and the properties common to all data flow components. The following table describes the custom properties of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}