{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Out",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Matt Tuiassosopo bats ninth and plays shortstop.",
            "Justin Smoak grounded out second to first. None on with one out and Matt Treanor due up.",
            "Matt Treanor struck out swinging. None on with two outs and Craig Gentry due up.",
            "Pinch-Hitter David Murphy lined out to short to end the inning."
        ]
    ],
    "pageTitle": "Friday, April 30, 2010 Texas Rangers - Seattle Mariners Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/rangers_mariners/2010/04/30",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 51055163,
    "recordOffset": 51039220,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2345=View all MLB box scores for 4/30/2010}",
    "TableContextTimeStampAfterTable": "{39314=Ian Kinsler also made his 2010 debut and went 1-for-5. The All-Star second baseman missed the first 22 games this year due to a high right ankle sprain., 38239=The Mariners had to wait for the 2008 American League Cy Young Award winner to recover from foot and abdominal injuries suffered in spring training, and the left-hander dazzled in his return from the disabled list, allowing just three hits in seven shutout innings while fanning eight and walking none., 38112=Seattle acquired Lee in a December trade with the Philadelphia Phillies, who received three prospects in the deal.}",
    "textBeforeTable": "Top of the 1st Marvin Hudson  3B Jim Joyce  2B Derryl Cousins  1B Jim Wolf  H Umpires 1.04 5 9 0 0 0 0 0 0.2 Sean White  2.63 20 32 2 1 1 2 2 2.1 Brandon League (L, 3-2) 2.79 8 11 2 0 0 0 0 1 David Aardsma  2.89 9 18 1 1 0 0 0 1 Mark Lowe  0.00 73 98 8 0 0 0 3 7 Cliff Lee  ERA Strikes Pitches SO BB ER R H IP Name 5.40 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Mariners pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/mariners_22t.png 7 10 1 0 0 0 0 1 Neftali Feliz (S, 4) 6.30 9 15 2 1 0 0 2 1 Frank Francisco (W, 3-3) 0.00 1 1 0 0 0 0 0 0.2 Darren O`Day  2.25 5 14 0 1 0 0 2 0.1 Darren Oliver  2.76 79 116 10 1 0 0 3 9 Colby Lewis  ERA Strikes Pitches SO BB ER R H IP Name Intentional walks: Adam Moore  (1) \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Rangers pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/rangers_22t.png",
    "textAfterTable": "Play Type Play Double Ichiro Suzuki singled to short, advances to second on Elvis Andrus's throwing error. Runner on second with none out and Chone Figgins due up. Out Chone Figgins popped out to short. Runner on second with one out and Franklin Gutierrez due up. Out Franklin Gutierrez flied out to right. Runner on second with two outs and Jose Lopez due up. Out Jose Lopez grounded out third to first to end the inning. Top of the 2nd Play Type Play Out Vladimir Guerrero grounded out second to first. None on with one out and Ian Kinsler due up. Out Ian Kinsler flied out to left. None on with two outs and Ryan Garko due up. Out Ryan Garko struck out swinging to end the inning. Bottom of the 2nd Play Type Play Out Ken Griffey Jr. struck out looking. None on with one out and Milton Bradley due up. Walk Milton Bradley walked. Runner on first with one out and Casey Kotchman due up. Out Casey Kotchman grounded into a fielder's choice, second to short. Runner on first with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}