{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is a graveyard on campus. During construction a team of workers came across an unmarked slave burial site. This graveyard is along the path from the University Center to the Dining Hall and constantly reminds you of the history all around.",
            "The Education that a student receives at Francis Marion University compared to the tuition has to be one of the best in the region. In state students tuition is around $15,000 for a top quality education.",
            "There are a plethora of organizations to join. A student could also spend time cheering on the Patriots at one of our many sporting events.",
            "The cafeteria food is good, but for the good stuff students should check out the Grille on campus.",
            "The student/dorm life at Francis Marion University could not be any better. There are so many great people and great activities to take part in.",
            "A very high percentage of professors have there doctorates. This equates to a higher quality of learning in the classroom.",
            "Prospective students should take no time diving in to school activities. In a smaller university, the more involved a student is, the more close knit the groups are. It would also be wise to take advantage of the smart professors at Francis Marion University by paying attention and studying hard.",
            "Francis Marion University is a culturally diverse school. The diversity, along with the professionalism of each professor, lends to a great atmosphere. This atmosphere creates a great school where learning is effortless."
        ]
    ],
    "pageTitle": "Francis Marion University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Francis-Marion-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897454751,
    "recordOffset": 897398583,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{274119=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/10/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 17 out of 17 people found this review useful. 1 of 63 Brittany from Pawleys Island, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Login to rate or flag the reviews Bianca from Salley, SC 07/07/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 7 out of 9 people found this review useful. 3 of 63 Categories Comments Great for these types of students Not too far away from home and if you love the BEACH it's nearby!! Tips for prospective students I've been told to not party too much and to always remember what I'm going to school to do. (Get an education). I'd say to everyone, it's your responsibility to get what you need done, but have fun while doing it Will enjoy being here I think I will enjoy being here. Everyone is so nice and very supporting. Will learn a lot The classes are all design to help us. If we need more assistance there is free tutoring services offered! I love that.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}