{
    "relation": [
        [
            "Date",
            "Mar 26, 2001",
            "Nov 13, 2003",
            "Aug 20, 2007",
            "Sep 16, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20020155962 - Nonaqueous hair styling composition and method of use - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20020155962?dq=7,117,286",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481255759,
    "recordOffset": 481210964,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Referenced by [0065] While the invention has been described with a number of embodiments, the scope of the invention is not intended to be limited by the specific embodiments. Modifications and variations from the described embodiments exist. Although numerous ingredients suitable for formulating the hair styling composition have been listed, the list is by no means exhaustive. Other unlisted ingredients, both known and unknown, may also be used in embodiments of the invention. While the hair styling composition is a hair care product, the same composition may also be used as a skin care product which is applied to a portion of a skin, both human and animal. Skin care products may be made by modifying the hair styling compositions described herein. The appended claims intend to cover all such modification and variations as falling within the scope of the invention. [0064] As demonstrated above, embodiments of the invention provide a nonaqueous hair styling composition and a method of making and using the composition. The hair styling composition may provide one or more of the following advantages. For example, the hair styling composition can be used on both dry hair and wet hair. The Style can be held until next shampoo. It provides a moisture barrier which protects the style from reverting to natural shape in high humidity conditions. An exemplary hair styling composition may further be easily removed with detergent and water.",
    "textAfterTable": "Uyen T. Lam Anti-adherent formulation including a quaternary ammonium compound and a fatty alcohol US8603448 Jun 5, 2006 Dec 10, 2013 L'oreal Use of a non-hydroxide base with heat for relaxing or straightening hair US9028804 Apr 17, 2012 May 12, 2015 L'oreal Water resistant compositions containing a lactone compound and an amine compound chosen from amino alcohol compounds and alkoxylated amine compounds US20090232752 * Sep 12, 2008 Sep 17, 2009 Carson John C Silicone polyurethane blends US20090269296 * Sep 18, 2006 Oct 29, 2009 Katya Ivanova Hair Treatment Compositions US20110064684 * Sep 14, 2010 Mar 17, 2011 Thomas Krause Method of chemically modifying the internal region of a hair shaft US20110189113 * Aug 12, 2008 Aug 4, 2011 Tracey Ross Water-Resistant, Rub-Resistant, Sprayable Homogeneous Sunscreen Composition US20110265810 * Nov 3, 2011 Philip Pelusi Phytolink 4.0, Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}