{
    "relation": [
        [
            "Order",
            "First Turn",
            "Follow Up",
            "Follow Up",
            "Follow Up",
            "Follow Up",
            "Follow Up",
            "Follow Up",
            "Follow Up",
            "Follow Up"
        ],
        [
            "Attack",
            "Leer",
            "Bite",
            "Faint Attack",
            "Glare",
            "Horn Attack",
            "Scary Face",
            "Scratch",
            "Stomp",
            "Tackle"
        ],
        [
            "Category",
            "Cool",
            "Tough",
            "Smart",
            "Tough",
            "Cool",
            "Tough",
            "Tough",
            "Tough",
            "Tough"
        ],
        [
            "Appeal",
            "3",
            "1",
            "2",
            "1",
            "4",
            "2",
            "4",
            "1",
            "4"
        ],
        [
            "Jam",
            "0",
            "3",
            "0",
            "3",
            "0",
            "1",
            "0",
            "4",
            "0"
        ],
        [
            "Description",
            "Temporarily stops the crowd from growing excited.",
            "Badly startles those that have made appeals.",
            "The appeal works great if performed first.",
            "???",
            "A highly appealing move.",
            "Startles the Pokémon that has the judge's attention.",
            "A highly appealing move.",
            "Badly startles the Pokémon in front.",
            "A highly appealing move."
        ]
    ],
    "pageTitle": "Difference between revisions of \"Contest combination\" - Bulbapedia, the community-driven Pokémon encyclopedia",
    "title": "",
    "url": "http://bulbapedia.bulbagarden.net/w/index.php?title=Contest_combination&diff=prev&oldid=823696",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 38052343,
    "recordOffset": 38014997,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "When the second move of any of the below are used it will receive double the appeal points it would have earned otherwise. Combinations usable in Pokémon Contests Many moves are both a follow-up move for one combination while themselves able to be followed up by another move. This, however, is not allowed, and if a move is used as a follow-up move, it will not set up another move to follow it. Several of these combinations were actually introduced in Generation II before Contests as \"combination attacks\" which offered beneficial bonuses when used in battle, such as Defense Curl and Rollout. A Contest combination is a group of several moves, which, when used in Contests and Super Contests, will form a specially recognized combination with another move used afterwards, gaining the user more appeal points. This article does not yet meet the quality standards of Bulbapedia. Please feel free to edit this article to make it conform to Bulbapedia norms and conventions.",
    "textAfterTable": "Smart 2 3 Startles the Pokémon that appealed before the user. Follow Up Meditate Beauty 1 0 Ups the user's condition. Helps prevent nervousness. Follow Up Mist Ball Smart 1 4 Badly startles the Pokémon in front. Follow Up Psybeam Beauty 3 0 Scrambles the order of appeals on the next turn. Follow Up Psychic Smart 1 3 Badly startles those that have made appeals. Follow Up Psywave Smart 2 1 Badly startles all Pokémon that made good appeals. Follow Up Reflect Smart 1 0 Can avoid being startled by others. Order Attack Category Appeal Jam Description First Turn Charge Smart 2 0 If the Pokémon who appealed right before the user used the same type of move,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}