{
    "relation": [
        [
            "Player",
            "Peter Bourjos",
            "Tim Byrdak",
            "Tony Cingrani",
            "Jason Frasor",
            "Curtis Granderson",
            "J.A. Happ",
            "Garrett Jones",
            "Jason Kipnis",
            "Zach McAillister",
            "Josh Thole",
            "Jayson Werth"
        ],
        [
            "Birthplace",
            "Park Ridge, IL",
            "Oak Forest, IL",
            "New Lenox, IL",
            "Chicago, IL",
            "Blue Island, IL",
            "Spring Valley, IL",
            "Harvey, IL",
            "Northbrook, IL",
            "Chillicothe, IL",
            "Breese, IL",
            "Springfield, IL"
        ]
    ],
    "pageTitle": "The Greatest Active MLB Player from All 50 U.S. States | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/1628000-the-greatest-active-mlb-player-from-all-50-us-states",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 26484903,
    "recordOffset": 26383797,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{303929=One of the more underrated players in the game, Pittsburgh second baseman Neil Walker has provided the Pirates with a solid bat and decent defense at second base since making his major league debut in 2009., 104256=We'll look at not only what a player is doing in 2013, but what he's accomplished over the course of his career as we separate the contenders from the pretenders and figure out who the greatest active player from every state in the union is., 218751=Born: August 19, 1978 in Springfield, MA, 213417=Born: April 11, 1980 in Annapolis, MD, 203429=Born: June 15, 1972 in Baton Rouge, LA, 348407=Born: June 15, 1984 in Bellevue, WA, 343275=Born: February 20, 1983 in Manakin-Sabot, VA, 293525=Kemp's combination of power and speed makes him one of the most dangerous and exciting players in the game today. And while he got off to a slow start in 2013, the 28-year-old seems to be getting into a groove, as he's in the midst of an eight-game hitting streak., 187722=While he's off to a mediocre start in 2013 (1-2, 4.79 ERA and 1.31 WHIP), Hellickson remains a key piece of Tampa Bay's rotation and one of the brightest pitchers under the age of 30 in the game., 318766=Born: May 25, 1982 in Belle Fourche, SD, 107658=Ultimately, Cain gets the nod, not only for his lengthy track record of success, but his postseason performance (4-2, 2.10 ERA, 1.05 WHIP in eight career starts)—and despite his subpar performance on the mound for the defending World Series champions in 2013., 213915=Yet to make his 2013 debut as he recovers from a partially-torn tendon in his right wrist, Teixeira has hit at least 24 home runs in each of his 10 big-league seasons and at least 30 in eight of them., 107115=Born: October 4, 1984 in Dothan, AL, 313417=Born: May 21, 1986 in Goose Creek, SC, 254657=A three-time All-Star and the 2001 AL Cy Young Award winner, Zito has turned his career around after a disastrous few years with the San Francisco Giants, going 18-9 with a 3.99 ERA and 1.40 WHIP since the start of the 2012 season., 104634=*Unless otherwise noted, all stats courtesy of Baseball-Reference.com and are current through the end of games on May 8., 119707=Ultimately, I decided on Kinsler because he plays a premium position, a spot where production like his isn't as prevalent as Ethier's is for a corner outfielder. Since his rookie season of 2006, only three second basemen have posted a higher WAR than Kinsler, according to FanGraphs:, 192838=Now with the Arizona Diamondbacks, Ziegler, 33, has pitched to a 3.00 ERA and 1.11 WHIP in a league-high 20 appearances in 2013. , 323181=Born: August 20, 1973 in Knoxville, TN, 239968=In the prime of his career, few batters could keep up with the gaudy numbers that Ryan Howard put up. From his NL MVP-winning season of 2006 through the 2011 season, Howard hit .274 with a .929 OPS while averaging 44 home runs and 133 RBI a year., 278383=Born: May 21, 1981 in Raleigh, NC, 348621=Tim Lincecum's decline since the beginning of the 2012 season has been well documented and his future debated. But there's no changing what he's done up to this point in his career: four consecutive All-Star appearances, three consecutive strikeout titles and back-to-back NL Cy Young Awards in 2008 and 2009., 240232=Fully recovered from a torn ACL that cost him much of the 2012 season, a 33-year-old Howard remains a productive member of Philadelphia's lineup, trailing only Chase Utley for the team lead in home runs and RBI., 130595=Despite the PED cloud that has hung over his head since winning the National League MVP in 2011, Milwaukee's Ryan Braun remains one of the best all-around players in the game, a perennial MVP candidate and a force in the middle of the Brewers lineup., 388950=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 245784=Montana offers virtually no viable choices, as only career backup Rob Johnson and right-handed pitcher Mason Tobin are affiliated with a major league club. Of the two, only Johnson has seen action in 2013, posting a .203/.282/.304 slash line with two home runs and six RBI in 21 games for Triple-A Memphis., 298883=Seemingly healthy in 2013, the runner-up for the AL MVP award in 2011 is off to a strong start in what could be his final season in Boston, hitting .270 with a league-leading three triples and 12 stolen bases., 229633=Born: April 19, 1983 in St. Paul, MN, 187136=Born: April 8, 1987 in Des Moines, IA, 125296=Born: August 30, 1978 in Benton, AR, 169186=With the White Sox in 2013, the 33-year-old has a 3.86 ERA and 1.00 WHIP, allowing earned runs in only three of his 16 relief appearances so far., 258425=Born: April 27, 1975 in Exeter, NH, 293137=Born: September 23, 1984 in Midwest City, OK, 151420=Born: October 10, 1986 in Fort Meade, FL, 362980=Born: July 7, 1980 in Kemmerer, WY, 268629=He was named the 2010 NLCS MVP while with the San Francisco Giants, hitting .350 with three home runs and five RBI in the team's six-game series against the Philadelphia Phillies and winning the World Series in five games over the Texas Rangers., 136552=Born: May 14, 1977 in Denver, CO, 287621=Born: November 25, 1980 in Columbus, OH, 137257=It comes down to their track records, really. Halladay has a decade of dominance and a pair of Cy Young awards under his belt, while Headley has only his breakout 2012 season that makes you stand up and take notice., 272551=Born: July 27, 1975 in New York, NY, 224278=Derek Lowe has done it all, from leading the AL in saves with 46 for the Boston Red Sox in 2000 to posting an NL-leading 16 wins for the Los Angeles Dodgers in 2006 and posting 17 losses for Atlanta in 2011., 118122=Arizona posed another tough choice, this time between a pair of former teammates on the 2002 Arizona State Sun Devils, Phoenix native Andre Ethier and Tucson's Ian Kinsler., 262987=Out of action as he recovers from a fractured ankle, the end of Jeter's iconic career has been predicted for years, only for him to come back with a vengeance and silence the critics with his bat. He did exactly that in 2012, when he led all of baseball with 216 hits, the eighth time he's surpassed the 200-hit plateau. , 120851=Ethier, who also made his MLB debut in 2006, ranks 27th among outfielders over the same period of time with a 17.5 WAR, also via FanGraphs., 203890=Named the MVP of the 2001 ALCS, Pettitte is baseball's all-time postseason leader in wins (19), games started (44) and innings pitched (276.2), winning five World Series championships along the way., 363170=John Buck doesn't have much in the way of competition for the top spot in Wyoming, and his play in 2013 for the New York Mets alone would make him the clear-cut choice here., 303725=Born: September 10, 1985 in Pittsburgh, PA, 147065=Born: September 10, 1987 in Wilmington, DE, 258860=Winner of the 2005 NL Cy Young Award, Carpenter is a three-time All-Star who went 95-42 with a 3.06 ERA and 1.13 WHIP from 2004 through 2011—a span that saw him throw only 21.1 innings combined between 2007 and 2008 due to Tommy John surgery. , 141605=Born: March 27, 1989 in New London, CT, 179413=Born: December 21, 1972 in Gary, IN, 157878=Born: March 27, 1987 in Leesburg, GA, 107972=It's an incredibly close contest between the two, and you couldn't go wrong picking one or the other. That said, it's only a matter of time before Kimbrel surpasses Cain as the best active player from the Heart of Dixie—perhaps as early as the end of the 2013 season., 163942=Born: November 30, 1980 in Wailuku, HI, 329991=Born: March 19, 1988 in Dallas, TX, 164204=After spending much of the winter criticizing the Red Sox for handing a seemingly over-the-hill Victorino nearly $40 million over the next three years, the 32-year-old has posted a respectable .293/.353/.380 slash line thus far in 2013., 298456=Born: September 11, 1983 in Madras, OR, 219216=An All-Star in 2006, Capuano missed two years in the middle of his prime due to Tommy John surgery (the second of his career), yet he bounced back to become a serviceable major league starter with the Milwaukee Brewers, New York Mets and, currently, the Los Angeles Dodgers., 187533=In only two full big league seasons, Hellickson has acquired an impressive amount of hardware, winning the 2011 AL Rookie of the Year award and a Gold Glove award in 2012., 308994=Born: March 5, 1976 in Providence, RI, 224503=A two-time All-Star and member of Boston's 2004 World Championship team, Lowe continues to reinvent himself, currently playing the part of long reliever in Texas., 130166=Born: November 17, 1983 in Mission Hills, CA, 268238=Born: December 23, 1980 in Portales, NM, 147448=Arizona's 25-year-old first baseman broke out in 2012, flashing his big-time power potential while quickly becoming an on-base machine and the key piece in the lineup for the post-Justin Upton Diamondbacks., 273126=Currently working his way back from offseason hip surgery, Rodriguez will continue to add to his gaudy career totals for years to come, as he remains under contract through the 2017 season with roughly $114 million remaining on his deal., 358647=Since the beginning of the 2011 season, Zimmermann has pitched to a 2.90 ERA and 1.11 WHIP, numbers befitting of an ace, not a No. 3 starter in a major league rotation—a role Zimmerman currently occupies with Washington, sitting behind both Stephen Strasburg and Gio Gonzalez., 208909=Born: June 2, 1982 in Portland, ME, 343708=One of the two best pitchers in baseball and winner of both the AL Cy Young Award and MVP in 2011, Verlander, 30, remains at the top of his game and a legitimate threat to win his second Cy Young in 2013., 245591=Born: July 2, 1982 in Anaconda, MT, 168435=Born: February 11, 1980 in Rexburg, ID, 113046=Born: May 9, 1986 in Anchorage, AK, 323657=From 1998 through 2004, Helton hit .340 with an OPS of 1.053, averaging 35 homers and 118 RBI a season., 335599=Born: August 10, 1979 in Salt Lake City, UT, 224056=Born: June 1, 1973 in Dearborn, MI, 230000=Mauer has won three AL batting titles and the 2009 AL MVP award, been selected to play in five All-Star games and will go down in history as not only one of the best hitting catchers of all time, but one of the best hitters of his generation., 235153=It sure looked like Roy Oswalt's career was over after a disastrous 2012 season with the Texas Rangers. But the Colorado Rockies, always on the lookout for a live arm, signed the 12-year veteran to a minor league deal at the beginning of May., 319220=Since becoming an everyday player with the Minnesota Twins in 2007, Kubel has hit .270 with an .811 OPS, averaging 21 home runs and 81 RBI a season., 254238=Born: May 13, 1978 in Las Vegas, NV, 278579=A five-time All-Star and the 2010 AL MVP, Josh Hamilton remains one of the most dangerous run producers in the game and a threat to go deep every time he steps to the plate., 147672=Among the league leaders in 2013 in both home runs (nine) and RBI (30), Goldschmidt is well on his way to becoming one of the most prolific sluggers in the game., 239763=Born: November 19, 1979 in St. Louis, MO, 358204=Born: May 23, 1986 in Auburndale, WI, 173381=Born: May 26, 1981 in Eureka, IL, 249964=Now in the prime of his career, Gordon's overall numbers are ticking upwards. He's posted a .300/.369/.480 slash line since the beginning of the 2011 season with 42 HR, 182 RBI and 102 doubles, the latter among the highest totals in baseball during that time., 249532=Born: February 10, 1984 in Lincoln, NE, 262568=Born: June 26, 1974 in Pequannock, NJ, 284284=While many thought his career was over after another injury-filled season in 2012, he has been revitalized in the Bronx as a member of the New York Yankees, hitting .284 with an OPS of .976, six home runs and 18 RBI in 28 games., 197492=Born: March 11, 1980 in Louisville, KY, 125710=The 2008 American League Cy Young Award winner continues to baffle the opposition on the mound, despite receiving less than three runs of support per start from an aging Philadelphia lineup. He also shows remarkable control, with a 1.3 BB/9 mark that puts him among the league leaders., 234930=Born: August 29, 1977 in Kosciusko, MS, 353584=Born: September 23, 1988 in Morgantown, WV, 339714=Born: August 16, 1985 in Springfield, VT, 283864=Born: June 3, 1977 in Jamestown, ND, 117937=Born: June 22, 1982 in Tucson, AZ, 192224=Born: October 10, 1979 in Pratt, KS}",
    "textBeforeTable": "Other Notable Active Alabama Natives   311: Number of players from Alabama. 61: Number of players born in Birmingham, most in the state. 23: Number of active players born in Alabama. 11: Number of Hall of Famers born in Alabama. Alabama By The Numbers   It's an incredibly close contest between the two, and you couldn't go wrong picking one or the other. That said, it's only a matter of time before Kimbrel surpasses Cain as the best active player from the Heart of Dixie—perhaps as early as the end of the 2013 season. Ultimately, Cain gets the nod, not only for his lengthy track record of success, but his postseason performance (4-2, 2.10 ERA, 1.05 WHIP in eight career starts)—and despite his subpar performance on the mound for the defending World Series champions in 2013. That's the dilemma I faced in Alabama, where San Francisco's Matt Cain and Atlanta's Craig Kimbrel, born in Huntsville, both make strong cases for the top spot. How do you choose between a perennial Cy Young Award contender and the best relief pitcher in baseball not named Mariano Rivera?   Career Stats: 242 G (241 GS), 85-80, 3.34 ERA, 1.18 WHIP, 3.1 BB/9, 7.5 K/9 Born: October 4, 1984 in Dothan, AL Thearon W. Henderson/Getty Images",
    "textAfterTable": "Willie Mays Westfield, AL Willie McCovey Mobile, AL Satchel Paige Mobile, AL Joe Sewell Titus, AL Ozzie Smith Mobile, AL Don Sutton Clio, AL Billy Williams Whistler, AL Early Wynn Hartford, AL « Prev 3 of 52 Next » Alaska: Daniel Schlereth, LHP, Baltimore Orioles J. Meric/Getty Images Born: May 9, 1986 in Anchorage, AK Career Stats: 5-6, 4.35 ERA, 1.57 WHIP, 6.4 BB/9, 7.7 K/9    There isn't an Alaskan-born player currently on a 25-man roster in the major leagues. And only two, left-handed reliever Daniel Schlereth (for the Baltimore Orioles) and outfielder Aaron Cunningham (for the Texas Rangers), currently play in the minor leagues. Schlereth's career numbers may not be impressive, but neither are Cunningham's, owner of a  219/.280/.347 slash line with seven home runs and 51 RBI in 222 career major league games. I give the southpaw the nod over the light-hitting outfielder in what amounts",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}