{
    "relation": [
        [
            "Job Title",
            "Research Coordinator(Temp)",
            "Executive Producer",
            "Executive Assistant to EVP (Temp)",
            "Social Media Associate(Temporary)",
            "Coord, Social Media/Fan Engagement-Temp"
        ],
        [
            "Location",
            "New York, NY",
            "New York, NY",
            "New York, NY",
            "New York, NY",
            "New York, NY"
        ]
    ],
    "pageTitle": "Production - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/production/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00224-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 625745455,
    "recordOffset": 625612847,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13766=Lately I’ve been frustrated by the radio on my commute to work. I hear the same songs over and over again– and I’m not even good at singing along with any of them. That’s why I was fascinated by an article from The New Yorker titled “The Song Machine The Hitmakers behind Rihanna”. As it turns out, a relatively small number of producers and top-liners create a disproportionately large share of contemporary hits (Top Forty radio) which helps explain why so many of them sound similar. Apparently in 2009, both Beyoncé and Kelly Clarkson had hits (Beyoncé’s “Halo” and Clarkson’s “Already Gone”) that were created from the same track, by Ryan Tedder. To make these songs, the producer runs the session and serves as creative director of the song, while the top-liner works on the lyrics and hooks. Basically a Producer works to create a successful project, guiding the creative vision from start to finish., 9443=The average yearly salary for a Film/TV Producer ranges between $29,921 – $102,184. In 2009, TV Producer Producers earned a median annual salary of $66,720. The average yearly salary for a Music Producer ranges between $17,764 – $106,681. From there you could go on to become an Audio Engineer ($20,628 – $84,306 on average per year), a Producer/Director TV/Cable Broadcast ($25,107 – $98,364 on average per year), a Film/Video Editor ($23,387 – $97,330 on average per year), or an Executive Producer Television Productions ($39,288 – $193,470 on average per year).}",
    "TableContextTimeStampAfterTable": "{194119=J. Crew - J. Crew is a New York, NY based apparel retailer that started with a catalog in 1983 and is known for its preppiness, but that may be changing., 204536=Leo Burnett - Leo Burnett is a Chicago, IL based advertising agency that was founded in 1935 and has one of the most impressive client lists of any agency out there., 309158=Copyright © 2007-2013 One Day, One Job. All rights reserved.}",
    "textBeforeTable": "writing virtual science research production product management journalism editorial editing e-commerce copywriting blogging all employers affiliate marketing See the complete The Wirecutter profile The Wirecutter - The Wirecutter is a site that offers “a list of the best electronics and gadgetry\" that will help you make the absolute best purchasing decision. Companies with Entry Level Jobs and Internships in Production Video Entertainment Post-Production Music Television Film Careers Related to Production Animation and Film Jobs Job Search Resources TV Production Post Production Professionals Film TV Professionals Networking Opportunities The Top 40 Online Video Producers (ReadWrite) Video Producer Blog Blogs and Websites 10 Filmmakers to Follow on Twitter (Paste Magazine) @GregMottola @leeunkrich @Jon_Favreau Key Folks to Follow on Twitter Film Production Management 101 by Deborah Patz The Complete Film Production Handbook by Eve Light Honthaner Required",
    "textAfterTable": "See all 19 job postings ArtStream - ArtStream is a DC based non-profit “whose mission is to create artistic opportunities for individuals in communities traditionally under-served by the arts.” See the complete ArtStream profile administrative all employers arts costumes design education music non-profit production theater Washington DC No current job openings. GuideSpark - GuideSpark is a Menlo Park, CA based company that offers a “robust employee communications platform” to make HR's job easier. See the complete GuideSpark profile all employers California communications customer service design engineering human resources production quality assurance quality engineer recruiting software development user experience video web",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}