{
    "relation": [
        [
            "First Name",
            "Mike",
            "Anthony",
            "Lorna",
            "Marty"
        ],
        [
            "Last Name",
            "Eckard",
            "Alexander",
            "Wisham",
            "Hall"
        ],
        [
            "Suffix",
            "",
            "Jr.",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=730493AB-88DB-4093-9FE0-AC7797D63604&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 213770955,
    "recordOffset": 213759680,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22896=S. 2105 The \"Cybersecurity Act of 2012\"; S. 21, \"Cyber Security and American Cyber Competitiveness Act\"; H.R. 174, \"Homeland Security Cyber and Physical Infrastructure Protection Act\"; H.R. 668, \"SHIELD Act\"; \"Guarantee Reliability and Infrastructure Defense (GRID) Act\" - House draft; S. 1342, \"Grid Cyber Security Act\"; The \"SECURE IT Act\" - \"Strengthening and Enhancing Cybersecurity by Using Research, Education, Information and Technology\" as introduced in the Senate; H.R. 3523 \"Cyber Intelligence Security and Protection Act\"; S. 413, \"Cybersecurity and Internet Freedom Act\";, 45000=H.R. 5325, the \"energy and Water Development and Related Agencies Appropriations Act, 2013,\" (appropriations issues generally); S. 2465, the \"energy and Water Development and Related Agencies Appropriations Act, 2013,\" (appropriations issues generally); H.J. RES. 117 (PL 112-175), the \"Continuing Appropriations Resolution, 2013,\" (appropriations issues generally);, 40968=Over-The-Counter derivatives issues generally; H.R. 2682, \"Business Risk Mitigation and Price Stabilization Act of 2011\"; H.R. 3527 \"Protecting Main Street End-Users from excessive Regulation\" Act and it pertains to financial hedging activities;, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12229=S.J. Res. 37 - \"To disapprove a rule promulgated by the Administrator of the Environmental Protection Agency relating to emission standards for certain steam generating units; S. 1833 \"Fair Compliance Act of 2011\" to provide additional time for compliance with, and coordinating of, the compliance schedules for the EPA Utility MACT and CSAPR rules; H.R. 910, the Energy Tax Prevention Act of 2011\", to prohibit EPA greenhouse gas regulations under the Clean Air Act; S. 482, the Energy Tax Prevention Act of 2011\", to prohibit EPA greenhosue gas regulations under the Clean Air Act; Clean Water Act, Section 316(b) - cooling water intace structure rule-making; The \"Mercury and Air Toxics Standards\" (MATS) Rule promulgated by the EPA; the \"New Source Performance Standards (NSPS) rule for greenhouse gases\" proposed by the EPA; H.R. 6172, to prohibit EPA from finalizing any GHG performance standards for EGUs until CCS is found to be technologically and oconomically feasible; S. 1815, the \"Cross State Air Pollution Act\", to codify and delay the implementation dates for a final EPA rule relating to interstate transport of air pollution;, 27352=H.R. 3091, to make permanent the individual income tax rates for capital gains and dividends; S. 1647, a bill to repeal the sunset on the reduction of capital gains rates for individuals and on the taxation of dividends of individuals at capital gains rates; H.R. 8, the \"Job Protection and Recession Prevention Act of 2012,\" (extension of current rate on dividends); S. 3412, the \"Middle Class Tax Cut Act,\" (extension of current rate on dividends);, 57352=S. 1813, \"MAP-21 (Moving ahead for Progress in the 21st Century)\" surface transportation bill as it pertains to pension reform and regulation of coal-combustion residuals; H.R. 4348, \"Surface Transportation Bill Extension and Conference Report\" - pension reform and coal-combustion residuals regulation provisions;, 17277=H.R. 4273 \"Resolving Environmental and Grid Reliability Conflicts Act of 2012\" to clarify compliance with an emergency order under Section 202 (c) of the Federal Power Act; S. 1845 \"Storage 2011 Act\" to incent storage of electricity on the grid; Energy Policy Act of 2005 implementation including infrastructure; Implementation of \"Energy Independence and Security Act of 2007\"; Clean energy standard legislation generally; S. 741, to amend PURPA to establish a renewable energy standard; S. 1000, \"Energy Savings and Industrial Competitiveness Act of 2011\", (efficiency); S. 1321, the \"Practical Energy Plan Act of 2011\"; H.R. 3626, \"LIHEAP Protection Act\"; S. 1961, \"LIHEAP Protection Act\"; S. 2146, the \"Clean Energy Statndard Act of 2012\"; S. 1510, \"Clean Energy Financing Act of 2011\"; S. 512, A bill to amend the Energy Policy Act of 2005 to require the Secretary of Energy to carry out programs to develop and demonstrate 2 small modular nulcear reactor designs, and for other purposes; S. 1320, A bill to require the Secretary of Energy to offer to enter into temporary used fuel storage facility agreements;, 36502=Coal - combustion residuals issues generally; EPA's proposed Coal Combustion Residuals Rule and related legislative proposals; H.R. 2273, \"Coal Residuals Reuse and Management Act\", regulates coal ash under existing municipal solid waste landfill regulations; S. 1751 to amend subtitle D of the Solid Waste Disposal Act to facilitate recovery and beneficial use, and provide for the proper management and disposal, of materials generated by the combustion of coal and other fossil fuels; S. 3512, the \"Coal Ash Recycling and Oversight Act of 2012\" (bill to establish minimum federal requirements for state coal ash regulatory programs);}",
    "textBeforeTable": "",
    "textAfterTable": "3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  Carrie Dunn  3303845596  cordead@firstenergycorp.com 5. Senate ID#  43764-12 7. Client Name Self Check if client is a state or local government or instrumentality  FIRSTENERGY CORP 6. House ID#  312290000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}