{
    "relation": [
        [
            "Related Topic",
            "SSM concepts and configuration",
            "Cisco IOS IP multicast commands: complete command syntax, command mode, defaults, command history, usage guidelines, and examples"
        ],
        [
            "Document Title",
            "“Configuring Basic IP Multicast” module",
            "Cisco IOS IP Multicast Command Reference"
        ]
    ],
    "pageTitle": "IP Multicast: IGMP Configuration Guide, Cisco IOS XE Release 3S (Cisco ASR 1000) - SSM Mapping [Cisco ASR 1000 Series Aggregation Services Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipmulti_igmp/configuration/xe-3s/asr1000/imc-igmp-xe-3s-asr1000-book/imc_ssm_map.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 375645807,
    "recordOffset": 375615696,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9937=Allocating a unique IP multicast group address for an application is still a problem. Most short-lived applications use mechanisms like Session Description Protocol (SDP) and Session Announcement Protocol (SAP) to get a random address, a solution that does not work well with a rising number of applications in the Internet. The best current solution for long-lived applications is described in RFC 2770, but this solution suffers from the restriction that each autonomous system is limited to only 255 usable IP multicast addresses.}",
    "TableContextTimeStampAfterTable": "{62952=Configures the groups permitted by ACL 10 to use source address 172.16.8.10., 63985=Configures the groups permitted by ACL 11 to use source address 172.16.8.11., 62639=ip igmp ssm-map static 10 172.16.8.10, 6996=The multicast-domain argument is a configurable DNS prefix. The default DNS prefix is in-addr.arpa. You should only use the default prefix when your installation is either separate from the internet or if the group names that you map are global scope group addresses (RFC 2770 type addresses that you configure for SSM) that you own., 63663=ip igmp ssm-map static 11 172.16.8.11, 81928=RFC 2365, 82218=RFC 2770, 72574=access-list 10 permit 232.1.2.10 access-list 11 permit 232.1.2.0 0.0.0.255}",
    "textBeforeTable": "To look up one or more source addresses for a group G that includes G1, G2, G3, and G4, the following DNS resource records (RRs) must be configured on the DNS server: The SSM mapping mechanism that enables the last hop router to join multiple sources for a group can be used to provide source redundancy for a TV broadcast. In this context, the redundancy is provided by the last hop router using SSM mapping to join two video sources simultaneously for the same TV channel. However, to prevent the last hop router from duplicating the video traffic, it is necessary that the video sources utilize a server-side switchover mechanism where one video source is active while the other backup video source is passive. The passive source waits until an active source failure is detected before sending the video traffic for the TV channel. The server-side switchover mechanism, thus, ensures that only one of the servers is actively sending the video traffic for the TV channel. Figure 1. DNS-Based SSM-Mapping DNS-based SSM mapping enables you to configure the last hop router to perform a reverse DNS lookup to determine sources sending to groups (see the figure below). When DNS-based SSM mapping is configured, the router constructs a domain name that includes the group address G and performs a reverse lookup",
    "textAfterTable": "The multicast-domain argument is a configurable DNS prefix. The default DNS prefix is in-addr.arpa. You should only use the default prefix when your installation is either separate from the internet or if the group names that you map are global scope group addresses (RFC 2770 type addresses that you configure for SSM) that you own. The timeout argument configures the length of time for which the router performing SSM mapping will cache the DNS lookup. This argument is optional and defaults to the timeout of the zone in which this entry is configured. The timeout indicates how long the router will keep the current mapping before querying the DNS server for this group. The timeout is derived from the cache time of the DNS RR entry and can be configured for each group/source entry on the DNS server. You can configure this time for larger values if you want to minimize the number of DNS queries generated by the router. Configure this time for a low value if you want to be able to quickly update all routers with new source addresses. Note Refer to your DNS server documentation for more information about configuring DNS RRs. To configure DNS-based SSM mapping in the software, you must configure a few global commands but no per-channel specific configuration is needed.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}