{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Well on campus we have normally have a lot activities that CAB hosts.",
            "Great food though it gets very repetitive.",
            "Academics at Roanoke College are very challenging.",
            "I would recommend that if you are having trouble in class remember you can talk to your professor because they do care.",
            "Roanoke College is an excellent school for those that like close interactions with their professors as well as small class room size. Also, the people at Roanoke College make you feel really welcomed, Last, the food is very good."
        ]
    ],
    "pageTitle": "Roanoke College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Roanoke-College/reviews?_escaped_fragment_=/show/77309",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906109111,
    "recordOffset": 906070092,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{173789=© 2015, Cappex.com, LLC, 116366=Roanoke College is a wonderful school. With only 2,100 students and plenty of teachers, all of my classes have a 20:1 or less student-teacher ratio. All of my teachers were easy to find and talk to. As a mathematics major, I also found that there were multiple opportunities to meet and talk to the math faculty thru clubs and Tea Time. The campus is beautiful, and easy to memorize.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 14 out of 17 people found this review useful. 1 of 38 Micah from Roanoke, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Great for these types of students The students that like to get involved on campus and those who want to learn. Tips for prospective students Apply for the scholarships even if you do not think you fit into the requirements. Take the campus tours! They are great! The scenery is beautiful! Take the roommate questionnaire and don't judge your roommate before you spend at least a week with them. Bang for the buck It is a little expensive but they offer a lot of scholarships. The 19 meal a week meal-plan is not ideal but they are revising it. Am enjoying being here There are many on-campus activities such as BINGO, The President's Ball (kinda like a Homecoming), Casino Night, Karaoke, and so much more and everyone knows each other. The students, teachers, and workers are very nice. Am learning a lot The teachers on campus try and reach every student. You have to want to learn! The teachers aren't going to bother with someone who doesn't want to learn. Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}