{
    "relation": [
        [
            "Date",
            "2014-01-10",
            "2014-01-10"
        ],
        [
            "Description",
            "Mozilla Firefox file type memory corruption attempt RuleID : 17603 - Revision : 9 - Type : BROWSER-FIREFOX",
            "Mozilla Firefox file type memory corruption attempt RuleID : 17601 - Revision : 15 - Type : BROWSER-FIREFOX"
        ]
    ],
    "pageTitle": "USN-668-1 - Alert Detail - Security Database",
    "title": "",
    "url": "http://www.security-database.com/detail.php?alert=USN-668-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 694851931,
    "recordOffset": 694828510,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2751=Georgi Guninski, Michal Zalewsk and Chris Evans discovered that the same-origin check in Thunderbird could be bypassed. If a user were tricked into opening a malicious website, an attacker could obtain private information from data stored in the images, or discover information about software on the user's computer. (CVE-2008-5012), 3711=A flaw was discovered in Thunderbird's DOM constructing code. If a user were tricked into opening a malicious website while having JavaScript enabled, an attacker could cause the browser to crash and potentially execute arbitrary code with user privileges. (CVE-2008-5021), 240443=Copyright Security-Database 2006-2015 - Powered by themself ;) in 0.6574s , 4002=It was discovered that the same-origin check in Thunderbird could be bypassed. If a user had JavaScript enabled and were tricked into opening malicious web content, an attacker could execute JavaScript in the context of a different website. (CVE-2008-5022), 3102=Jesse Ruderman discovered that Thunderbird did not properly guard locks on non-native objects. If a user had JavaScript enabled and were tricked into opening malicious web content, an attacker could cause a browser crash and possibly execute arbitrary code with user privileges. (CVE-2008-5014), 2343=Ubuntu 7.10: thunderbird 2.0.0.18+nobinonly-0ubuntu0.7.10.1, 2231=Ubuntu 6.06 LTS: mozilla-thunderbird 1.5.0.13+1.5.0.15~prepatch080614h-0ubuntu0.6.06.1, 239175=06 July 2015, 3415=Several problems were discovered in the browser, layout and JavaScript engines. If a user had JavaScript enabled, these problems could allow an attacker to crash Thunderbird and possibly execute arbitrary code with user privileges. (CVE-2008-5016, CVE-2008-5017, CVE-2008-5018), 2428=Ubuntu 8.04 LTS: thunderbird 2.0.0.18+nobinonly-0ubuntu0.8.04.1, 239633=28 July 2014, 2517=Ubuntu 8.10: thunderbird 2.0.0.18+nobinonly-0ubuntu0.8.10.1, 4277=Chris Evans discovered that Thunderbird did not properly parse E4X documents, leading to quote characters in the namespace not being properly escaped. (CVE-2008-5024)}",
    "textBeforeTable": "this. This Alert is flagged as TOP 25 Common Weakness Enumeration from CWE/SANS. For more information, you can read Executive Summary 10- USN-668-1   OVAL : Open Vulnerability and Assessment Language CWE : Common Weakness Enumeration CAPEC : Common Pattern Enumeration CVE : Common Vulnerability Enumeration Contacts About us About US Blog CVSS Calculator OVAL Definitions OVAL Repository CPE : Common Plateform Enumeration DPE : Default Password Enumeration CAPEC : Common Pattern Enumeration CWE : Common Weakness Enumeration vDNA : Vulnerability DNA API Documentation vDNA : Vulnerability DNA API Resources HP VMware US-CERT Gentoo",
    "textAfterTable": "Name USN-668-1 First vendor Publication 2008-11-26 Vendor Ubuntu Last vendor Modification 2008-11-26 Severity (Vendor) N/A Revision N/A Security-Database Scoring CVSS v2 Cvss vector : (AV:N/AC:L/Au:N/C:C/I:C/A:C) Cvss Base Score 10 Attack Range Network Cvss Impact Score 10 Attack Complexity Low Cvss Expoit Score 10 Authentication None Required Calculate full CVSS 2.0 Vectors scores Detail A security issue affects the following Ubuntu releases: Ubuntu 6.06 LTS Ubuntu 7.10 Ubuntu 8.04 LTS Ubuntu 8.10 This advisory also applies to the corresponding versions of Kubuntu, Edubuntu, and Xubuntu. The problem can be corrected by upgrading your system to the following package versions: Ubuntu 6.06 LTS: mozilla-thunderbird 1.5.0.13+1.5.0.15~prepatch080614h-0ubuntu0.6.06.1 Ubuntu 7.10: thunderbird 2.0.0.18+nobinonly-0ubuntu0.7.10.1 Ubuntu 8.04 LTS: thunderbird 2.0.0.18+nobinonly-0ubuntu0.8.04.1 Ubuntu 8.10: thunderbird 2.0.0.18+nobinonly-0ubuntu0.8.10.1 After a standard system upgrade you need to restart Thunderbird to effect the necessary changes. Details follow: Georgi Guninski, Michal Zalewsk and Chris Evans discovered that the same-origin check in Thunderbird could be bypassed. If a user were tricked into opening a malicious website, an attacker could obtain private information from data stored in the images, or discover information about software on the user's computer. (CVE-2008-5012) Jesse Ruderman discovered that Thunderbird did not properly guard locks on non-native objects. If a user",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}