{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "Bang for the buck",
            "Will enjoy being here",
            "Will learn a lot"
        ],
        [
            "Comments",
            "Be sure to apply early, as the increasing number of applicants put those who apply after the Early Action deadline at a disadvantage. Since Early Action is non-binding, it's also helpful so that you find out earlier and can begin planning, especially since this year many applicants didn't hear back until the end of April",
            "U of M is an excellent choice financially for in-state students, but the cost is quite steep for out-of-state students, especially since they're quite stingy with their merit aid. If you're a Michigan resident, this is definitely worth considering over similarly ranked schools in other states, as it's about half the price.",
            "Ann Arbor is one of the best college towns out there. Definitely a great place to be.",
            "High-quality academic programs. This is the best public university in the country and will provide an education rivaling that of the Ivy League. Its alumni network is extremely useful, too. If you're looking at going into business, Ross is one of the best."
        ]
    ],
    "pageTitle": "University of Michigan-Ann Arbor (U of M) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Michigan-Ann-Arbor/reviews?_escaped_fragment_=/show/109908",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897829199,
    "recordOffset": 897623419,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{396066=i can't list everything because it wouldn't ever end. football games, basketball games, hockey games, water polo games, frisbee, feeding squirrels, climbing trees, slip 'n' slides in the dorms, ultimate frisbee, grabbing coffee, seeing movies downtown, capture the flag in the diag, parties, random late night events, rollerblading, biking, over 1300 student groups from the michigan zombie club to the michigan planking club, climbing buildings, etc. the list can go on and on., 442768=University of Michigan- Ann Arbor is a wonderful school where students like myself are proud to say GO BLUE . It has given me the opportunity to meet new people and has aspired me to do new things. I look forward to graduating in 2015 and continuing into graduate school at University of Michigan- Ann Arbor so I rate U of M- Ann Arbor a 10 out of 10., 823031=U of M looks for the ideal well-balanced individual. Make sure that you balance a high GPA with decent extracurricular activities and a high SAT/ACT score. For those that want actual numbers: based on the students I have met here, most tend to come in with around a 3.8 or higher GPA and a fairly decent SAT score of 2000., 888428=Check out Restaurant Week. Twice a year (one week in January, and one week in June), select restaurants have a fixed menu for a fixed price (usually both lunch and dinner). It's a great way to experience expensive restaurants for a fraction of the price you would otherwise pay. Also, in January there's a concert at Hill Auditorium called the Collage Concert. Students from the School of Music, Theatre and Dance put on an incredibly diverse and fun concert. It's fun to see what your fellow wolverines on North Campus are doing all year! Go to the Arb, too. While most of Ann Arbor is more industrialized, the Arb is a great getaway for some time in nature., 625593=Over a 1000 different clubs., 348117=Nichols Arboretum (The Arb) is a popular place to go for a run or to hang out and clear your head. The Safe Sex Store on South University is a classic store. Ann Arbor is well-known for Zingerman's deli, which has excellent sandwiches and other delightful treats. Legend has it that if you kiss someone under the arch between east hall and west hall by south university and the diag at midnight, you will marry them. Also, we have a hash bash in April that is one of the biggest. Not endorsing that, just saying, it's there and it's unusual., 825668=There are over 1200 clubs on campus, so you can definitely find something that interests you., 838537=Check out Festifall and Winterfest to learn about some of our 2300 student clubs. There's something for everyone! From the many premed clubs to the community service clubs to the squirrel feeding club, you're sure to fit in somewhere., 608871=The campus is right in the city of Ann Arbor and is open to the public. Therefore, anybody can just walk on campus. There were several crime alerts throughout the 2011-2012 school year, but there was nothing really serious or violent. There are also many safety officials on campus., 181321=One very important aspect that I foolishly overlooked when applying to college was their academic schedule. Every university has a difficult schedule and some are more desirable than others. Michigan'Â?s is a bit strange in that its summers are exceptionally long. School begins in early September and exams tend to be over around May 1st. The generous 4 month long summer happens because our Winter Break is far shorter than those elsewhere. Since I am an out-of-state student, I found flying home for such a brief time to be fairly annoying. If you can'Ã?Â?t decide between schools, consider which summer and winter break trade-off would best suit your plans. For in-state students, who comprise roughly 2/3 of the student body, a good tip is to try and forge your own path away from your high school classmates. I know many in-state students who hung out with high school friends instead of meeting new hall-mates and classmates at the beginning of Freshman Year and later regretted this thoroughly. Make sure to come to Orientation and the beginning of Freshman Year ready to make new friends and connections. My roommate of three years was actually the 2nd person I met at Michigan. Michigan's weather is something that should not be taken lightly. I always thought I wanted a cold, northern university but I soon grew tired of how cold it gets in Michigan. Coming from Maryland, I was neither physically nor mentally prepared for the 5 months of frigid, snowy weather that Ann Arbor gets every year. While this does not make me regret coming to school at Michigan, it does make me regret not having a heavy winter coat and boots during my Freshman Year., 311266=Apply early. The longer you wait, the more competitive the admissions process becomes. If you're applying to the LSA Honors Program, try to write a good essay, but if it's late April and you still haven't submitted your application, just get something in before they fill up., 918551=University of Michigan is a huge campus and a lot of things are going on all the time in every department. I'm going to be joining the music department and this department alone houses at least 1000 students and recitals occur every day as well as rehearsals and concerts. Like in music, UMich is extremely strong in many areas and those students who want a greater challenge can even apply to be in special colleges for those who desire to get more out of their education., 106843=Be sure to apply early, as the increasing number of applicants put those who apply after the Early Action deadline at a disadvantage. Since Early Action is non-binding, it's also helpful so that you find out earlier and can begin planning, especially since this year many applicants didn't hear back until the end of April, 393787=over 1300 student groups. enough said. there is always something to do here. oh, and yeah we have a squirrel club with like 900 members that feed squirrels every sunday with peanuts., 750942=Apply for the November 1st Early Action Deadline. TOUR., 1105043=Superb dining experience in the newly renovated halls, though a few of the older ones are left in the dust and serve lackluster food. Stick to the more popular, new dining halls and find one that you like and eat there often. It can be very difficult to maintain a healthy diet given the amount of unhealthy options, desserts, and oil/fat included in most foods but it is possible. If you're trying to avoid the freshman 15, you have to be one of the rare ones who keeps the priority of health all year! For 2015, the West Quad dining hall is the one being renovated and will be newly opened, so try there if looking for a first option.}",
    "textBeforeTable": "07/15/2009 Reviewer is A current student here. 66 out of 67 people found this review useful. 1 person found it offensive. 1 of 256 Jasmine from Detroit, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Michigan-Ann Arbor Reviews University of Michigan-Ann Arbor › Michigan › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "People say college is the best experience of your life. And as the years continue I am positive you will go from liking college to loving it. The University provides a course guide during summer orientation that is full of hundreds of different courses. You can take just about anything you want and learn about things you never even imagined you would be interested in. As the years goes on you will discover that everything you learn will be related in some way to another class, required reading or something that you hear on TV. There is nothing like the college classroom experience. Login to rate or flag the reviews Elizabeth from Rochester Hills, MI 10/25/2009 Reviewer is A current student here. 35 out of 35 people found this review useful. 2 of 256 Categories Comments Great for these types of students Any student who loves a challenge will thrive here. There is a high level of competition here, but there are also classes and departments where group work is the main method for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}