{
    "relation": [
        [
            "Your Needs",
            "You want digital copies for reference or research. You are storing and using your material on a computer and have no need for high quality",
            "You want paper copies for reference or research, and have no need for high quality",
            "You have the technology & environment to read & store microfilm"
        ],
        [
            "Your Format Options",
            "A digital photocopy saved as a PDF.",
            "A standard paper photocopy",
            "A microfilm reel"
        ],
        [
            "Your Copy Options",
            "Black and white PDF file(s) containing the scanned materials. Quality is similar to that of photocopying.",
            "8\"x10\" and 11\"x17\". Black and white or color depending on the original.",
            "A duplicate microfilm reel(s)."
        ],
        [
            "Your Delivery Options",
            "Email or CD, depending on size of file and/or customer preference.",
            "Tracked shipping via Fed Ex or USPS. Shipments are appropriately packed to help avoid damage during shipping.",
            "Tracked shipping via Fed Ex or USPS. Shipments are appropriately packed to help avoid damage during shipping."
        ],
        [
            "Order Form",
            "Order form",
            "Order form",
            "Order form"
        ]
    ],
    "pageTitle": "Copies and Formats Matrix - Duplication Services (Library of Congress)",
    "title": "",
    "url": "http://rs7.loc.gov/duplicationservices/formats/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 211728795,
    "recordOffset": 211720593,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21577=You're looking for early printed material published between 1600 to 1800.}",
    "textBeforeTable": "You're looking for photographic negatives, transparencies, and prints. Photographs Microfilm Legal Documents General / Technical Architectural Drawings Art Prints & Illustrations Posters Rare Books Sheet Music & Scores Periodical / Journal Newspapers Manuscripts Maps Photographs Copies and Formats Matrix (PDF, 24 KB) Download Note: Other options may be available. For example, microfilm is available for nearly all types of original content, but is rarely ordered. If you don’t see an copy type suitable for your need, contact Duplication Services Customer Service. The many options for copies, combined with some limitations in what we can do, can make it difficult to decide what to order. This page will help you figure out your order based on the original material and your need. What Kind of Copy Should You Order? Copies and Formats Matrix Cataloging Products and Services Framed Prints & Photographs from the Library Shop",
    "textAfterTable": "Top Maps You're looking for cartographic and geographic images, maps and atlases. Your Needs Your Format Options Your Copy Options Your Delivery Options Order Form You want a high quality digital image for research, personal use, or publication or other commercial use (see requirements under Copyright) A high-resolution digital file (TIFF) that meets federal preservation standards in resolution, depth, and range. Most commonly 300 dpi. Also available in 400 to 600 dpi, depending on object size. Black and white or color depending on the original. Email or CD, depending on size of file and/or customer preference. Order form You want a high-quality image printed on paper. Image is ready to hang on a wall. An image printed by professional photographers from a digital scan on to resin-coated photo paper. Most commonly 8\"x10\". Also available in sizes 11\"x14\", 16\"x20\", and 20\"x24\", depending on original. Black and white or color depending on the original. Tracked shipping via Fed Ex or USPS. Shipments are appropriately packed to help avoid damage during shipping. Order form You want paper copies for reference or research, and have no need for high quality A",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}