{
    "relation": [
        [
            "Partners during lifetime",
            "1-3",
            "4-9",
            "10 or more"
        ],
        [
            "Gonorrhea",
            "1.6",
            "2.3",
            "17.4"
        ],
        [
            "Chlamydia",
            "0.3",
            "3.3",
            "10.9"
        ],
        [
            "Herpes",
            "0.3",
            "0.5",
            "2.7"
        ],
        [
            "Condyloma",
            "1.0",
            "3.3",
            "6.7"
        ],
        [
            "(n)",
            "(307)",
            "(214)",
            "(403)"
        ]
    ],
    "pageTitle": "CCIES at The Kinsey Institute: Finland",
    "title": "",
    "url": "http://kinseyinstitute.org/ccies/fi.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00058-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 135263579,
    "recordOffset": 135181354,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{6432=[Update 2003: The trend toward increasing expectations of marital faithfulness represents a renaissance of romanticism in a time of increasing individualism. Sex belongs currently to a romantic script in which sexuality is highly valued. According to this approach, individual pleasures are integrated into romantic relationships. Romanticism does not mean an orientation toward the partner at the expense of oneself. The romantic ideas highly valued in traditional female culture have become transformed into valuing the relationship between the partners. This has happened especially among women and in the youngest generation. (Kontula & Haavio-Mannila 2003.) (End of update by O. Kontula)], 11682=Men still have the majority of masters\u0092 degrees (60%), but women are quickly catching up; since 1986, the number of women graduating from universities has exceeded that of men. For example, in 1989, women represented 54% of students who obtained a master\u0092s degree and 34% of those with a higher degree. The proportion of women who have a doctorate has been steadily increasing since 1976. The percentage of women in the senior faculty of universities remains small., 17237=In 1906, Finnish women gained parliamentary voting rights, second in the world after New Zealand. Finnish women also were the first in the world to gain the right to serve in Parliament. These rights were immediately implemented. In 1907, 19 women were elected to a Parliament of 200 members. At present, 39% of the MPs in Finland are women. In the 1994 presidential election, the female candidate got 46% of the votes, indicating that a woman can reach the highest positions of power in this country. [Update 2003: In the 2000 presidential election, a woman candidate was for the first time elected President of the Republic. (End of update by O. Kontula)], 8633=Sex is considered to be an important aspect of a steady relationship. In 1992, most Finns, 86% of men and 78% of women, considered sexual life very important or important for happiness in their relationship. Among women, the strength of this opinion had declined from 1971 to 1992. In 1971, 40% of women aged 18 to 54 considered sexual life very important for happiness in their relationship, while only 21% held this view in 1992, a development that reflects the strong public preoccupation with sexual liberation 20 years ago. [In 1999, this figure had increased to 29%.], 24152=In July 2002, Finland had an estimated population of 5.18 million. (All data are from The World Factbook 2002 (CIA 2002) unless otherwise stated.), 8044=Women are expected to be more restricted than men in their sexual behavior. These expectations are rationalized by referring to gender differences in sexual needs. In 1992, 51% of Finnish men and 61% of women thought that a grown-up man has a clearly or somewhat stronger sexual need than a woman. Forty-one percent of men and 33% of women considered the sexual needs of men and women as equally strong. Only 7% believed that the sexual needs of women are stronger., 9047=People in Finland have a positive attitude toward sexual behaviors as a health promoter\u0097they do not see it as a threat to health. In 1992, 88% of Finnish men and 79% of women thought that sexual activity promotes health and well-being. A clear majority, 74% of men and 70% of women, believed that masturbation does not endanger one\u0092s health. [In 1999, these figures were 81% and 76%, respectively.], 7563=In the case of marital fidelity, a double moral standard is not very strong. In 1971, 34% of men and 29% of women aged 18 to 54 said that one must be able to accept a husband\u0092s temporary infidelity, and 28% of men and 30% of women would accept a wife\u0092s temporary infidelity. In 1992, the corresponding liberal attitudes in regard to a husband\u0092s infidelity were 19% of men and 21% of women, and to a wife\u0092s infidelity by 22% and 23%, respectively. [In 1999, the corresponding figures were 23% and 13% related a husband\u0092s infidelity, and 21% and 15% related to wife\u0092s infidelity. Women\u0092s approval of sexual infidelity had decreased significantly.], 19538=*Editor\u0092s Note: Because most of the updates to this chapter are brief inserts to add the results of this third national survey in 1999 (Haavio-Mannila, Kontula, & Kuusi 2001), we indicate these only with brackets to avoid breaking the reader\u0092s attention; longer updates are in our standard format, i.e., beginning with Update 2003 and ending with the updaters\u0092 names., 16546=Women in Finland are gainfully employed nearly as often as men. In 1991, some 72% of the women in the working-age population and 78% of the men were part of the labor force. In Finland, both women and men work on a full-time basis. In 1991, the proportion of women working part-time was 10% and that of men 5%., 3185=It is an essential principle in recent Finnish legislation concerning sexual issues that people may and can do privately all they want when it does not involve forcing another person. In this regard, Finnish legislation aims to respect the individual\u0092s right of self-determination. This was a decisive principle in the reform of Finnish legislation around 1990. This principle is also strong in the general population where liberal sexual attitudes prevail among the secularized and independent-thinking majority. This liberalization of sexual attitudes is a significant change, because those with liberal attitudes on sexual issues are usually more satisfied with their sexual life than are others., 2470=The interval between publication of results from the 1971 national survey (Sievers et al. 1974) and the FINSEX survey (Kontula & Haavio-Mannila 1993) was marked by a great change in attitudes, values, and practices that began in the sexual revolution of the 1960s. Public discussion about the sexual revolution at the beginning of the 1970s in Finland concerned, to a great extent, the increased availability of sexual material and its commercial use in advertising and mass communication in general. The change could also be seen in legislation where the individuals\u0092 liberty to decide about their own sexual matters was increasingly recognized. While increased open discussion about sexual issues in society continued the erosion of some of the still-existing old taboos, a clear step was taken towards more-accepting attitudes to sexual issues as a whole. Today, the sexual life of unmarried people is almost as accepted as that of married couples., 14542=The differences between women\u0092s and men\u0092s earnings diminished both proportionally and in real terms in the 1970s. In 1983, this development shifted, and the pay differentials between women and men began to grow in real terms in most sectors. In 1991, women\u0092s pay was 80% of men\u0092s pay., 12215=When the educational level of the entire population is examined, it is discovered that women and men are now at the same level. In 1989, half of those who had completed senior secondary school or vocational education or had a university degree were women. Women have reached a high level of general education. In the working-age population, women have a senior secondary school diploma more frequently than men, a circumstance that will prevail in the future, because 60% of senior secondary-level students are women., 12780=The provision of daycare for children is a municipal responsibility. The Day Care Act of 1973 aims at providing communal daycare for all children in need of it. Since 1985, parents have been able to choose between placing their child in communal daycare or receiving a homecare allowance for taking care of their child at home. This allowance may also be used to cover some of the costs of private daycare. Taking care of one\u0092s child at home with the help of a homecare allowance does not terminate employment or, since 1991, lower employee pension., 16220=The large proportion of gainfully employed women is also reflected in their high percentage of the entire labor force. In 1991, 48% of the labor force were women, and women made up 51% of the salary and wage earners. Unlike most European countries in the 1980s, Finland had a lower rate of undisguised unemployment for women than for men. However, the rate of unemployment among women over 55 has been higher than the rate among men of the same age., 13848=As most women work for pay, it is necessary that men share household work with them. In international comparison, gender equality in the division of housework is high (Gershuny 1990). Nevertheless, women still do more domestic work than men, even though their share of it has declined from 67% in 1979 to 64% in 1987 (Niemi & Pääkkönen 1989). In the United States, the percentage was 67% in 1987 (Robinson 1988)., 21389=In 1992, the sexual life of the Finns was studied using nationally representative data on the 18- to 74-year-old population in Finland (Kontula & Haavio-Mannila 1993). The response rate for the 2,250 Finns in this FINSEX survey was 76%. Each of the respondents was interviewed personally and asked to fill out a questionnaire about the most intimate sexual matters. The questionnaire responses were not shown to the interviewers. The results of this study have been compared with a corresponding 1971 study (Sievers et al. 1974) to provide a detailed picture of Finnish sexual attitudes and behaviors in recent decades. Worldwide, the 1971 study was only the second population survey based on nationally representative data of sexual matters. (The first nationally representative sexual study was done in Sweden in 1967.) The results of this most recent FINSEX study will be discussed in different sections of this chapter., 22575=HIV/AIDS (1999 est.): Adult prevalence: 0.05%; Persons living with HIV/AIDS: 1,100; Deaths: < 100. (For additional details from www.UNAIDS.org, see end of Section 10B.), 18952=There is archeological evidence that Finland was inhabited already at least 50,000 years ago. In a better-known history, the early settlers of Finland probably arrived about 2,000 years ago from the Ural area to the southeast. Swedish settlers brought the country into the Kingdom of Sweden in 1154, where it remained until 1809, when it became an autonomous grand duchy of the Russian Empire. A strong national spirit emerged, with Finland declaring its independence in 1917 and becoming a republic two years later. Finland was invaded by the Soviet Union in 1939, forcing the Finns to give up 16,173 square miles (41,888 km2) of territory. Further cessions were exacted by the Soviets after World War II. Finland became a member of the European Union in 1995., 20446=[Update 2003: In 1999, the authors conducted a follow-up to the 1992 survey by a mailed survey (Haavio-Mannila, Kontula, & Kuusi 2001). This sex survey had 1,496 respondents. Because of this new data-collection technique, the response rate was 46%. By analyzing the distributions of several identical retrospective questions measuring sexual issues in different birth cohorts in the three Finnish surveys, Kontula (2001) showed that the low response rate in 1999 did not bias the recorded sexual histories of those who were under 55 years old. In the age group 55-to-74, the male respondents were more monogamous than those participating in the two earlier Finnish sex surveys. (End of update by O. Kontula)]*, 10827=The dropout rate at the basic level of education is very low nowadays. The law provides for compulsory education until the age of 16. The dropout rate at the upper secondary level was 7% in 1988. Somewhat fewer women leave school prematurely than men., 1104=In 1971, two women out of three set the promise of marriage as the condition for beginning a sexual relationship; in 1992, only 16%, [and in 1999, only 11%] of Finnish women were of this opinion (see Table 1). Among adolescents, the revolution is even more apparent. Dating has replaced marriage as an institution, with sexual intimacy almost as accepted during dating as it was earlier only within marriage. As a consequence, very few young people marry their first sexual partners any more. As late as 30 years ago, 60% of women married their first sexual partners., 22204=Per Capita Gross Domestic Product (purchasing power parity): $25,800 (2001 est.); Inflation: 2.6%; Unemployment: 9.4%; Living below the poverty line: NA}",
    "TableContextTimeStampAfterTable": "{267580=Haavio-Mannila, E., O. Kontula, & E. Kuusi. 2001. Trends in sexual life: Measured by national sex surveys in Finland in 1971, 1992 and 1999 and a comparison to a sex survey in St. Petersburg in 1996 (Working Papers E 10/2001). The Population Research Institute. The Family Federation of Finland. Helsinki., 269732=Kontula, O. 1996. Sex education in Finland. Paper presented in the 39th Annual Meeting of the Society for the Scientific Study of Sexuality (SSSS) held in Houston, November 14-17, 1996., 62910=In 1992, 30% of Finnish men ages 18 to 74 and 34% of women were not married or cohabiting. One third of these had a steady sexual relationship. In the whole population covered by our survey, 11% of both men and women had a steady sex partner with whom they did not live., 172415=[In 2002, there was a lively public discussion on the human rights problems related to the pimping of Russian prostitutes in Finland. This has led to proposals of criminalizing buying prostitute services in a similar way to what was done in Sweden some years ago. It is assumed that the government will give this amendment to Parliament in 2003. (End of update by O. Kontula)], 32041=With the spread of a more-natural attitude towards self-loving, fewer and fewer people abstain from it entirely. In 1971, 49% of the women and 26% of the men had never tried this sexual outlet. In 1992, the corresponding figures were 23% and 10% [and in 1999, 14% and 6%]. So, a large majority of both women and men have engaged in self-loving at least some time in their life., 162836=[In 2000, STM (the Ministry of Social Affairs and Health) started to give instructions for treatment and recommendations for legislation on transsexuals\u0092 legal status. Internationally, in 2002, a very progressive law and instructions for treatments were confirmed. They were then implemented at the beginning of 2003., 174808=[In 1999, phone sex was also studied. Of the men who were younger than 35 years, 15% reported using phone sex during their lifetime and 8% during the last year. Among young women, these proportions were 4% and 1%. (End of update by O. Kontula)], 82848=In 1992, the age at moving in together was for men aged 15 to 64 years, on average, 0.9 years lower than age at marriage in 1971, and among women 0.6. The increase in cohabitation thus made men, in particular, more inclined to move in together with their partner relatively early. Twenty years ago, the average age at first marriage was 24.6 for men and 22.3 for women\u0097there are no data on when couples moved in together from that era. In 1992, men initiated cohabiting, or married for the first time, on average, at age 23.7 years, women at age 21.8. [The mean age of women at first marriage in 2000 was 28.0 years. This difference is because of the fact that, practically speaking, everybody cohabited before they married.], 112158=In Finland, anal intercourse is not illegal. Nevertheless, it seems not to have been an acceptable sex technique in earlier generations, as older people rarely admit having practiced it. According to the 1992 survey, only 20% of men and 17% of women reported having ever practiced anal intercourse. Eight percent of men and 6% of women had done it several times. It had most often been practiced by 25- to 34-year-old persons, 31% of the men and 29% of the women. In this age group, one in ten had had anal sex several times. Only 2% of the women over 55, and 5% of the older men, had ever tried this sex technique., 273074=Laumann, E. O., J. Gagnon, R. T. Michael, & S. Michaels. 1994. The social organization of sexuality. Chicago: University of Chicago Press., 270891=Kontula, O., & E. Haavio-Mannila. 1995. Matkalla intohimoon: Nuoruuden hurma ja käsimys seksuaalielämäkertojen kuvaamana [Along the way to passion: The joy and suffering of youth revealed in sexual autobiographies]. Juva: WSOY., 269250=Kontula, O. 1991. Sukupuolielämän aloittamisen yhteiskunnallisista ehdoista [Cultural terms of sexual initiation]. Sosiaali-ja Terveyshallitus. Tutkimuksia 14/1991. Valtion Painatuskeskus, Helsinki., 224559=By 1994, about 600 HIV infections had been diagnosed, and about 100 people had died of AIDS. The proportion of the HIV-infected in Finland has remained fairly small by international comparison. This is partly because of the scarcity of prostitution and intravenous drug use in Finland. [Update 2003: At the end of the 1990s, IV-drug use had become more popular in the Capital area. This caused some increase in HIV infections. In 2001 and 2002, this epidemic was already rather well controlled by the health authorities. (End of update by O. Kontula)], 237006=According to the 1992 survey, men\u0092s erectile ability is strongest around the age of 30, when two men out of three have no problems having erections, as reported by both the men and women. With the 50-year-olds, the corresponding share is about 40%, and with the 70-year-olds, about one fifth. So, a significant number of men live throughout their lives without experiencing any problems with having erections. Here, it may be of great importance what kind of partners men have intercourse with, among other things, and how healthy they themselves are., 151945=In the population aged 18 to 54 years, the proportion of persons interested only or mainly in people of the same sex was 0.8% in 1971, in 1992 only 0.6%, [and in 1999, 1.1%]. When one takes into consideration all people who have at least some interest in people of the same sex, the proportions were 7.6% and 6.5%, respectively. When all people aged 55 to 74 years who were studied in 1992 are included, the proportion of the exclusively or mainly homosexually oriented persons was 0.7%, and that of at least partly bisexually oriented 6.4%. Men more often than women identified themselves as homosexuals, whereas there was no gender gap in the proportion of bisexually oriented people. Same-gendered experiences are more common than homosexual identity. According to the 1992 survey, 4.0% of the Finnish men and 3.8% of the women had had same-sex partners during their life. [In 1999, these proportions were 6.5% and 5.3%, respectively.] In the United States, in 1991, the proportions were 5.0% for men and 2.7% for women (Laumann et al. 1994). The gender difference is thus larger in the United States than in Finland where there is hardly any gender gap. American women may be shyer than Finnish women in admitting their lesbian behavior, or they may avoid lesbian practices deliberately in order to avoid the social stigma attached to them. In Finland, the liberalization of attitudes toward homosexuality in the last 20 years may have helped lesbians acknowledge and report on their homosexual experiences., 39564=[Update 2003: In 1999, the popularity of pornography had again increased: 64% of the men and 21% of the women had looked at sex magazines during the last year. For sex videos, these proportions were 57% and 27%, respectively. (End of update by O. Kontula)], 74345=Because of the higher standard of living, adult Finns today live less often with their parents than in earlier times and more often alone (see Table 10). The increase in unmarried cohabitation has decreased the proportion of married people in the population. In 1971, 64% of the respondents ages 18 to 54 lived together with their spouse and only a few percent with their fiancées or steady partners. The rapid growth of cohabitation can be seen from the 1992 survey: 16% of the 18- to 54-year-olds were cohabiting and only 53% of the population in this age cohort were married. [In 1999, 15% were cohabiting and 50% were married. Living apart together (LAT) relationships had increased; their proportion was already 13%.], 269484=Kontula, O. 1993. Ketkä hyväksyvät vapaan abortin? [Who approves a free abortion?] In: Suomalaisia mielipiteitä raskauden keskeytyksestä. STAKES. Julkaisusarja Aiheita 34/1993, Helsinki, pp. 23-39., 87547=[Update 2003: In the 1990s, the frequency of sexual intercourse had not changed significantly. In 1999, the number of intercourses per month in the age group 18-to-54 years was 6.3 for men and 5.9 for women; the annual totals for men was 75.9 and for women 70.3. (End of update by O. Kontula)], 182307=In 1992, 29% of the men and 18% of the women did not need contraception at their last intercourse (Erkkola & Kontula 1993). About one fifth of the middle-aged people reported that they did not need contraception. A very important reason is that about 12% of the 35- to 54-year-old women had undergone hysterectomy, which becomes more common with age., 202921=The 1992 FINSEX study shows that 15% of the men and 11.5% of the women surveyed had contracted gonorrhea, syphilis, chlamydia, condyloma, or the HPV, and/or genital herpes during their lifetime. Three percent of the men and 2.8% of the women had experienced at least two of these diseases. During the prior year, 0.7% of the men and 1.5% of the women had an STD infection. Based on the total population, these numbers suggest that 450,000 Finns had a some time suffered from an STD, more than one STD had been contracted by about 100,000 people, and during the year, about 38,000 people had been infected., 265166=Christensen, H. T., & C. F. Gregg. 1970. Changing sex norms in America and Scandinavia. Journal of Marriage and Family, 32:616-27., 12357=In the 1920s and 1930s, sex education was considered a family responsibility. There was no sex education in the schools as yet. In 1944, the National Board of Education sent a letter concerning sex education to the schools, directing teachers of biology, hygienics, Finnish, and religion to give instruction in sexual matters., 268095=Haavio-Mannila, E., J. P. Roos, & O. Kontula. 1997. Repression, revolution and ambivalence: The sexual life of three generations. Acta Sociologica, 40(1):2-22 (in press)., 145656=Cohabitation does not always lead to marriage; separation of cohabiting partners is relatively common, especially in the younger age groups. One in four respondents interviewed for the 1992 study had had a cohabitation relationship that had not continued as a marriage. This share was more than one in two in the age groups 35 or younger., 110012=Incidence of Oral and Anal Sex. In the 1992 data, stimulation of the partner\u0092s genitals (e.g., fondling and stimulating by hand) in order to give him or her satisfaction without sexual intercourse is a common form of petting and love play. It may or may not be linked to vaginal intercourse. A large majority, 86% of men and 76% of women, had at least sometimes during their lifetime stimulated a partner\u0092s genitals. [In 1999, these proportions were 84% and 81%.] During the past month, this had been done by half of men and more than a third of women. More than one year had gone by since the last incidence of stimulation by hand for 26% of men and 42% of women. Women thus have been less active than men in giving satisfaction to a partner without sexual intercourse. Maybe some men offer fondling and stimulation by hand to their partners who otherwise do not have an orgasm in intercourse., 88347=Twenty years ago, it was usual that the man was the sole initiator of sexual intercourse in 49% of the incidents. In 1992, only 37% of the most recent experiences of sexual intercourse were initiated solely by the man. Fifteen percent of the male respondents said that the woman was the initiator of the last sexual intercourse, but this figure was only 10% according to the women\u0092s responses. Women were slightly more likely than men to report that both partners took an equal role in initiating intercourse, 51% compared with 45%. Women may find it more difficult to admit that they have taken an active role in coitus., 271936=Kontula, O., & E. Haavio-Mannila. 2003b (in press). Masturbation in a generational perspective. Journal of Psychology & Human Sexuality, 15(1):2003., 84282=Cohabitation does not always lead to marriage, particularly among young people. One fourth of the 1992 respondents had been cohabiting without getting married to the partner. Among people under 35 years, the proportion was more than half., 170648=There is a certain amount of demand for paid sexual services in Finland. Twenty percent of women and 8% of men had during their lifetime been persuaded to intercourse by being offered money or similar economic advantages. [In 1999, the corresponding proportions were 17% of women and 11% of men.] Women under 35 years of age most often reported having received these kinds of offers. This indicates that they have increased with time. Only 0.2% of Finnish women and 1.5% of men admitted that they had complied with the request., 268488=Järvinen, M. 1990. Prostitution i Helsingfors\u0097En studie i kvinnokontroll (Prostitution in Helsinki\u0097A study on control of women). Åbo: Åbo Academy Press., 156820=[Update 2000/2002: In December 2000, the government of Finland proposed legalizing gay partnerships, but with some limitations. In Parliament, the five government parties holding a majority were expected to approve the proposal. The Finnish Evangelical Lutheran Church, to which 85% of Finland\u0092s population of 5.2 million people belongs, opposed giving gay partners the same rights as married couples. However, Archbishop Jukka Paarma admitted that \u0093the legal position of homosexual and lesbian couples should be improved.\u0094, 151149=In the Finnish sex survey of 1992, there were ten questions about sex with same-sex persons. They refer to sexual identity, sexual experiences with persons of one\u0092s own sex, age at first homosexual experience, type and frequency of these experiences, number of same-sex partners, and orgasm in homosexual intercourse., 195423=A 1978 amendment to the abortion law required permission of the Central Administrative Board for termination of a pregnancy after 12 weeks. The latest law concerning abortions came into force in 1985, making it possible to terminate pregnancy prior to the 24th week of pregnancy on the grounds of the illness of the fetus, instead of the earlier 20th week. If the mother\u0092s life or health is at stake, termination of pregnancy is permitted at any stage of pregnancy, even after the 24th week. In practice, termination of pregnancy has been without restriction, at least prior to the 12th week of pregnancy, for the past over 20 years., 9512=Based on attitudes towards sexuality, equality of gender has made remarkable progress in Finland. Women\u0092s right to be the initiators at sexual intercourse when they want it so, was supported by 94% of men and by 90% of women in 1992. This is a significant increase, especially among women. [In 1999, these proportions were still higher: 97% and 94%.] Three out of four women were of the opinion that a respectable woman could openly show her interest in sex., 83924=A longer life expectancy and the growing divorce rate have contributed to the fact that people have time to enter several unions during their lives. According to the 1971 study, 5% of the ever-married men and 6% of the women had been married at least twice. In 1992, the proportions were 17% and 22%, respectively, [and in 1999, 26% and 25%]., 266135=Gershuny, J. 1990. International comparisons of time budgets\u0097Methods and opportunities. In: R. von Schweitzer, M. Ehling, & D. Schäfer, eds., Zeitbudgeterhebungen\u0097Ziele, methoden und neue konzepte. Stuttgart: Metzler Poeschel., 274385=Sievers, K., O. Koskelainen, & K. Leppo. 1974. Suomalaisten sukupuolielämä [Sex life in Finland]. Porvoo: WSOY., 228892=[No estimate is available for the number of Finnish children who had lost one or both parents to AIDS and were under age 15 at the end of 2001. (End of update by the Editors)], 146597=There are no serious obstacles concerning values and attitudes in dealing with the sexual needs and activities. In 1992, only 5% of the respondents believed that elderly people should not establish sexual relationships. Most Finns, 75%, held that people in residential facilities ought to have a privacy room for intimate meetings. Although the majority also approve of sexual relationships for physically and mentally challenged persons, no actual studies have been carried out on sexual issues and the disabled., 157368=[In April of 2002, gay partnerships were legalized, but without allowing them to adopt children or share a surname. Finland joined the four other Nordic countries, Sweden, Norway, Denmark, and Iceland, in legally recognizing gay partnerships. Denmark, Sweden, and Iceland also allow gay couples to adopt children under certain circumstances. Same-sex couples 18 years or older are able to make their union official in a civil ceremony, comparable to matrimony but nevertheless \u0093a separate legal institution.\u0094 Registered gay couples have the same rights as heterosexual couples who are married when it comes to inheritance and divorce. (End of update by R. T. Francoeur and O. Kontula)], 144913=In 1986-1989, there were 11.6 officially recorded divorces per 1,000 mean population of married women, compared with 5.3 in 1966-1970. In 1989, 47% of marriages ended in divorce. The increase in divorces can also be seen in the survey data. In 1971, only 3% of the respondents were divorced or separated from their spouse at the time of the survey; 20 years later, the figure was 8%. [Altogether, 30% of both genders had experienced divorce, based on the results of the 1999 survey.] Even changes in the structure of families with children reflect the increased incidence of divorces. In 1971, 90% of the respondents reported that their parents had lived together throughout their childhood; 20 years later, the figure was 88%., 268953=Kinsey, A. C., W. B. Pomeroy, & C. E. Martin. 1948. Sexual behavior in the human male. Philadelphia: Saunders., 173155=In Finland, between 1971 and 1992, women\u0092s attitudes toward pornography became somewhat more negative, whereas men\u0092s attitudes have remained unchanged. This may be related to the contents of pornography becoming \u0093harder\u0094 and less satisfying to women\u0092s expectations than before. The consumption of pornographic products has remained almost the same among men, but has decreased among women. Even when sex videos are included with the printed publications, fewer women, on the average, used pornographic materials during the year in 1992 than in 1971., 271368=Kontula, O., & E. Haavio-Mannila. 1997. Intohimon hetkiä: Seksuaalisen läheisyyden kaipuu ja täyttymys omaelämäkertojen kuvaamana [Moments of passion: The longing for sexual intimacy and its fulfillment described in autobiographies]. Juva: WSOY., 169244=Attitudes toward prostitution differ greatly by gender. In 1992, men more often (51%) than women (21%) had nothing against people earning money by selling sexual services in Finland. This activity was opposed by 34% of men and 65% of women. People over 50 years were most negative toward prostitution. [In 1999, 64% of men and 24% of women had nothing against people earning money by selling sexual services. Men had more favorable attitudes towards prostitution than before.], 274545=Smith, T. W. 1990. The sexual revolution? Public Opinion Quarterly, 54:415-435., 223524=The first public statements about AIDS in Finland were issued in 1983, with a general discussion following in 1985 and 1986. Health officials were immediately involved, concentrating their efforts on general information about AIDS and its transmission and about other sexually transmitted diseases, strongly recommending the use of condoms in casual sexual contacts. At the same time, together with communal health organizations, health officials also directed an effective information and support campaign for groups at special risk of AIDS. In schools, the AIDS issue was\u0097and continues to be\u0097associated with general sex education and the prevention of sexually transmitted diseases., 247697=Orgasm during intercourse had been experienced seldom or never by 0.7% of the men and 10% of the women according to the 1992 data on 18- to 74-year-old Finns. In 1972, 12% of the women under 55 years old had experienced orgasm seldom or never. In 1992, 9% of the women under age 55 reported orgasm never or seldom; quite-seldom orgasm had been experienced by 30% of the women between the ages 18 and 74 years. Thus, sexual satisfaction has remained significantly deficient for a large number of women, and little improvement has been observed in this regard between 1971 and 1992., 92188=Sexual Partners. For Finns ages 18 to 54, the average number of sexual partners during their lifetime has risen from 7 to 10 during the last 20 years. In 1971, women of all ages had about 3, men about 11 partners, and in 1992, correspondingly, 6 and 14. In 1992, the male respondents between ages 25 and 44 years had the most partners, between 40% and 50% had at least 10 partners; of the women in the same age cohorts, about 18% had at least 10 partners (see Table 13)., 77562=The increase in cohabitation has not meant that there are more couples living together than earlier. When one adds the percentages of married and cohabiting people together, their proportion only grew from 66% in 1971 to 69% in 1992. The main change is that nowadays more people delay or do not enter a formal marriage, and maintain an official status as single. In the past 20 years, the proportion of never-married people among the 15- to 54-year-old Finns rose from 35% to 40% for men and from 27% to 36% for women., 236527=[Update 2003: In 1999, there was some increase in erection disorders compared to the 1992 survey. Of all men, 7% reported having had erection disorders at least quite often in the last year. Among women, the equal proportion (of their partners) was 12%. In the age group 55-to-74 years, these proportions were 19% of men and 32% of women\u0092s partners (of the respondents who had sexual intercourse in the last year). (End of update by O. Kontula)], 23386=Discussion of sexual matters has gradually increased both in the homes and in the schools. In their childhood home, information had been received about sexual matters by 39% of men and by 41% of women in 1971, and in 1992, correspondingly by 61% and by 64%. Ten percent of men and 14% of women in 1971 regarded the information received at home as sufficient. In 1992, the percentages were 29% and 32%, respectively. Until recently, most people have, thus, not been getting very much information about sexual matters at home, even if these matters have been more talked about., 158823=In Finland, the most conspicuous gender minority group has been the transsexuals, because their situation requires both therapeutic and juridical measures to be resolved. Society has indeed taken concrete measures to draft legislation and to develop a functioning healthcare system to meet this need. The Ministry of Social Affairs and Health has been preparing the legislation since 1991., 181661=[Update 2003: In 2002, 61% of 15-year-old boys and 51% of girls had used a condom during the last sexual intercourse. Twelve percent of boys and 26% of girls had used contraceptive pills, while 18% of boys and 16% of girls used no contraception. Among 17-year-olds, these proportions were 27% and 43%, and 11% and 8%, respectively. (End of update by O. Kontula)], 190732=Laws relating to sterilization were enacted in 1970 and 1985. The spirit of the latter law is quite liberal, for, in practice, any person over age 30 may be sterilized if he or she so wishes. This law caused sterilization to rise threefold compared to previous years., 178006=[Update 2003: In 1999, 8% of men and 7% of women reported that they had practiced bondage plays in their lifetime. Among young persons, this proportion was around 15%. Sadomasochistic experiences had been experienced by 3% of men and 1.5% of women. (End of update by O. Kontula)], 225144=In the FINSEX study, 6.4% of the men and 7% of the women reported having taken the HIV test on their own initiative by the beginning of 1992. [In 1999, these proportions had already about doubled to 12%.] Multiple tests were reported by 30% of these men (1.9% of all men) and by 16% of the women tested (1.1% of all women). At the beginning of 1992, about 250,000 Finns had been tested for HIV, and about 50,000 of those had had themselves tested several times. Multiple tests were most common among 30-year-old women. The young age groups had had themselves tested more frequently than older Finns. One tenth of young adults had taken the test., 272637=Kontula, O., & M. Rimpelä. 1988. Onko AIDS-valistus vaikuttanut nuorten seksuaalisuuteen 1986-1988? [Has AIDS education influenced the adolescents\u0092 sexuality 1986-1988?] Suomen Lääkärilehti, 43:3493-3500., 273352=Markkula, H. 1981. Maksettu nainen [Paid woman]. Hämeenlinna: Kustannus-Mäkelä Oy., 266788=Haavio-Mannila, E. 1991. Impact of coworkers on female alcohol use. Contemporary Drug Problems, 18(4):597-627., 265950=Fugl-Meyer K. S., E. Almås, E. Benestad, et al. 2001. Nordic sexology education and authorisation. Scandinavian Journal of Sexology, 4(1):61-68., 121174=Sexual Satisfaction. Perhaps the most positive result of the Finnish sex survey is the observation that young Finns are more satisfied with their sexual lives than their elders are. Sexual intercourse was more generally regarded as pleasant in 1992 than it was in 1971. The amount of love play was considered more adequate, the steady relationship was experienced as happier, discussing sexual matters with the partner was more open and easier, and sexual life as a whole was estimated to be more satisfying than in 1971. Women had experienced orgasm somewhat more often in their last sexual intercourse, and men had had less problems with getting erections during the prior year., 171191=Men use paid sexual services more than women. Eleven percent of Finnish men and 0.3% of women had offered money or similar economic advantages for intercourse. One percent of all men and women said that their initiatives had not led to sexual activity. [In 1999, 15% of men had offered money for intercourse in their lifetime.] For Finnish men, traditionally, buying sexual services starts at about age 40 when men begin to have the economic resources for it. Having sex with prostitutes was connected with having many sexual partners, extra relationships, sex with foreigners, high sexual self-esteem, and few homosexual experiences. Using paid sexual services was not related to sexual satisfaction nor sexual fears., 274077=Robinson, J. 1988. Who is doing the housework? American Demographics, 10(12):24-28., 230007=In the FINSEX study, the prevalence of different kinds of sexual problems was surveyed, as well as the help sought to resolve these problems. Half of the men and 26% of the women in a steady relationship reported no lack of sexual desire during the prior year. Fifteen to 55% of women in a steady relationship in different age groups experienced a lack of sexual desire fairly often. The women had succeeded in concealing this lack of desire in many cases, since clearly fewer men than this, when asked about their partners\u0092 lack of desire, had experienced their partners\u0092 lack of desire as a problem in each of the age groups. The men\u0092s reports on their own lack of desire and the women\u0092s opinions about their partners\u0092 lack of desire fit well together. Five to 20% of the men had experienced a lack of sexual desire at least fairly often. [In 1999, this variation in different age groups ranged from 7% to 19% of men. Among women, it ranged from 27% to 56%. Lack of one\u0092s own sexual desire increased especially among middle-aged women.], 271172=Kontula, O., & E. Haavio-Mannila. 1995. Sexual pleasures: Enhancement of sex life in Finland, 1971-1992. Aldershot, Brookfield, USA, Signapore, and Sidney: Dartmouth., 153472=The number of homosexual partners during one\u0092s lifetime was on the average of 7.4 for men and 1.6 for women. Compared with the number of sexual partners in the whole population (10.6), these figures are small. This is because of the fact that most homosexual encounters only have taken place with one person: 53% of men and 72% of women had had only one same-sex partner. [These proportions were almost equal in 1999.] Many homosexual contacts took place a long time ago. Only 29% of the same-sex contacts of people ever having had one had happened during the last 12 months. During the last year, 1.3% of the Finns and 1.6% of the Americans had had a homosexual relationship. [In 1999, 2.6% of men and 1.3% of women had had a homosexual relationship.] This question had been left unanswered by a significantly greater proportion (23%) of the Americans than of the Finns (8%). This again suggests that there are more social taboos regarding homosexuality in the United States than in Finland., 78096=The developmental cycle of the present union greatly varied by age in 1992 (see Table 11). In the older age groups, 55 years and over, a large majority first moved in together after the wedding. In the age category 25-to-44 years, half of the people first lived together and then married. Four fifths of the less-than-35-year-old people living together with someone were cohabiting without marriage. At present, most Finns start their marital life as a cohabiting couple., 106172=Extra or Concurrent Sexual Relationships. The partners in the most recent sexual intercourse have mostly been steady partners or spouses in marriage or cohabitation. In 1992, only 6% of the men and 4% of the women in a steady sexual relationship had had someone other than the steady partner as the last partner. However, a greater and greater share of people have experiences of sexual relationships alongside their steady sexual relationships. Sexual relationships of this kind, including extramarital relationships, are called extra or parallel sexual relationships in the study., 83589=Of all the men interviewed in 1992, 79%, and of the women, 83%, had lived in a matrimonial relationship. In the oldest age group, 65 to 74 years, there was a gender gap: 7% of men and 13% of women never had cohabited or married. This is partly explained by the fact that single men die young and single women live long., 227862=[The estimated number of adults and children living with HIV/AIDS on January 1, 2002, were:, 41739=By age 13, about four out of five girls have had their first periods of menstruation and about 60% of the boys their first ejaculations. As a result, many young people show considerably more serious interest in the opposite sex than before. Over half of the boys of this age and one third of the girls have already viewed sex magazines and sex videos, and more than half of both boys and girls have kissed, according to the 1992 data. Many have experienced caressing over the clothing. Almost half of the 13-year-olds are ready to accept sexual intercourse in their peers\u0092 relationships. About as many report having already had a dating relationship with the opposite sex. Mostly, this means going around together with the dating partner as part of a group of young people. Sexual intercourse has been experienced by about 5% by the age of 13., 112789=[Anal sex had become much more prevalent in the 1990s. In 1999, 28% of men and women reported having ever practiced anal intercourse. In the age group 18-to-34, one third has practiced anal intercourse several times.], 265720=Erkkola, R., & O. Kontula. 1993. Syntyvyyden säännostely [Birth control]. In: O. Kontula & E. Haavio-Mannila, eds., Suomalainen seksi (Finnish sex). Helsinki: WSOY, pp. 343-370., 268692=Jeffreys, S. 1990. Anticlimax: A feminist perspective on the sexual revolution. New York: New York University Press., 42827=Adolescence is a time of rapid changes, and, with age, sexual experience quickly grows. In Finland, the greatest changes in adolescent sexual behaviors occurred between 1960 and 1970. In 1992, Finns between ages 18 and 54 reported they had kissed for the first time, on the average, at the age of 14, had started dating at 17, and experienced their first sexual intercourse at the age of 18. Young people with a long education began sexual intercourse later than others., 237573=Men were also asked about their experience with continuous erectile dysfunction during their life. The continuity was not defined except by options of varying spans of time, the shortest of which was the option of \u0093a few weeks\u0092 time.\u0094 Fifteen percent of the male respondents reported experiencing a continuous erectile dysfunction for a span of at least a few weeks at least once (see Table 27). The incidence of erectile problems increased significantly for those over age 50. Half of the 70-year-olds had experienced continuous erectile dysfunction. While erectile dysfunction remains a very common problem, it did decrease slightly between 1971 and 1992., 235289=For the 1992 survey, 49% of the men who had intercourse during the prior year reported that they themselves had had at least some problems with having an erection during that year; 47% of the women reported the same about their partners. Six percent by the men and 9% by the women reported this as a fairly frequent problem, a fairly good convergent appraisal, although men obviously tend to conceal their more difficult erectile problems. Comparatively, it seems that men\u0092s erectile problems are slightly less frequent than women\u0092s problems with vaginal lubrication., 169736=There has been recurrent public discussion about establishing brothels under the control of the state as there were in the beginning of the 20th century in Finland. Brothels might be a means to fight problems connected with prostitution: i.e., liability of clients and prostitutes to venereal diseases and connections to criminality, particularly drug dealing. Approval of state-controlled brothels was greater among men than women: 42% of men, but only 17% of women approved public brothels, while 41% and 67%, respectively, opposed them. Middle-aged people were most favorable to brothels. Support for public brothels has clearly increased since a 1972 survey. At that time, only 20% approved establishing state-controlled brothels (Markkula 1981). [In 1999, 60% of men and 26% of women approved of establishing brothels under the control of the state. The proportions were higher than before.], 43931=In the 1992 FINSEX survey, one third of the 18- to 74-year-old women and a quarter of the men reported dating (going steady) by age 15. About four out of five had experienced kissing, and two out of three caressing over the clothing. Petting under the clothing had been experienced by one of every two younger Finns. Sexual intercourse before the age of 16 had been experienced by 31% of the girls and 19% of the boys according to the 1992 data (see Table 6). On average, Finnish girls begin having intercourse somewhat younger than the boys. This is quite understandable, because girls often date boys from two to three years older than they themselves are. The boys are more eager to have intercourse than the girls, but the girls have better opportunities., 89345=Sex Styles. Sexual satisfaction can be attained in many ways. Following a factor analysis of the 1992 data to measure variables associated with different sexual habits and partners, three sex styles were identified:, 258686=[Update 2003: After several years of educational discussions, the general assembly of the Nordic Association for Clinical Sexology (NACS) in September 1997 appointed a committee of three representatives from each of the countries, Denmark, Norway, Sweden, and Finland, to work on a Nordic educational project. The purposes were: to design and offer qualitatively high-standing educational programs structured into different levels and comparable between the different Nordic countries, and, to provide regulations for sexological authorization [certification] and act for authorization of those who are clinically active within the field of sexology. The Nordic Council (\u0093Nordplus\u0094) supported the project financially., 88984=Alcohol consumption before the last sexual intercourse became slightly more frequent in the past 20 years. In 1971, alcohol had been used by 21% of the men and 11% of the women; in 1992, this figure was 25% and 16%, respectively, [and in 1999, 34% and 23%, respectively]. This reflects an increased consumption of alcohol among Finns in general., 20449=[Teenage sexual knowledge was tested in Finland in 2000 (Kontula et al. 2001). Fourteen- and 15-year-old students of the 8th grade responded to the national sexual health knowledge survey. It was organized as a competition between schools. The survey had 30,000 respondents. It revealed that the quality of sexual knowledge was much poorer among the boys than among the girls. On the average, boys got 48 points and girls 57 points of the maximum 80 points. Girls had better knowledge in all areas of the sexual health topics. Because of more-limited sources of information, sex education provided in the school is more important for the boys than for the girls. (End of update by O. Kontula)], 150415=Finnish homosexuals were studied by the snowball method in 1982 (Grönfors et al. 1984). More than 1,000 homosexuals answered a relatively extensive questionnaire. Two thirds of the respondents were men and one third were women. About 60% of the respondents reported that they were exclusively homosexual in their feelings and about 70% in their behavior. Finnish homosexuals were quite similarly distributed into Kinsey\u0092s categories (Kinsey et al. 1948, 1953). Feelings and behavior were in most cases consistent. However, it is not always possible to combine feelings with practice in real life. There were people who identified themselves as only or mostly homosexual, but behaved only or mostly heterosexually., 5618=Finns also take a more liberal attitude than before toward sexual relationships that are outside their own steady relationships. This shift is linked with the greater acceptance of sexual relationships among unmarried and single persons. Attitudes toward homosexual relationships are also significantly more accepting than before. In 1971, close to half of all Finns, 44% of males and 45% of females, regarded homosexual behavior between adults as a private affair with which officials and legislation should in no way interfere (see Table 3). In 1992, this opinion was supported by 59% of men and by 72% of women. [In 1999, the corresponding figures were similar: 58% and 72%.] On the other hand, attitudes toward extramarital relationships of spouses and pornography have become somewhat stricter, but only among women. Two thirds of the men and one third of the women considered watching pornography sexually arousing for themselves. The quite-free sale and distribution of pornographic films and videos were supported by 51% of men and by 24% of women., 179041=A decline in birthrate has been a common phenomenon in most West European countries and in all the Nordic countries during the past several decades. In Finland, the birthrate was at its highest after World War II; for instance, in 1947, as many as 108,000 children were born. After this, there was an even decline, so that, after 1968, the birthrate has been lower than the replacement birthrate, which would be about 70,000 births per year. At its lowest, in 1973, the birthrate was 56,787 births. In the 1990s, it has been about 65,000 children per year. Unless immigration increased, the population had been estimated to grow until 1999, after which it would begin to decrease. [Update 2003: In the latest prognosis, the population is estimated to increase until 2013, after which it will slowly decrease. (End of update by O. Kontula)], 111792=Clinically there is no difference between stimulation of the mouth, ears, nipples, feet, or anus in the production of pleasure sensations to the brain. None of these activities have a direct role in reproduction so it seems inconsistent for people to accept some and not all points of arousal in sexual activity. (Love 1992, 10), 267915=Haavio-Mannila, E., O. Kontula, & A. Rotkirch. 2002. Sexual lifestyles in the twentieth century: A research study. Hampshire & New York: Palgrave., 87874=Sexual intercourse has become more varied. While in 1971, as much as 68% of the most recent occurrences of sexual intercourse among 18- to 54-year-old people were the missionary position, in 1992, the proportion was 43%. The proportion of those who had used many different positions during their most recent sexual intercourse had increased in a very significant way, from 16% to 32%. [In 1999, this proportion was even higher: 44% of men and 36% of women.], 159825=In Finland, there are an estimated 300 people who would benefit from sex-reassignment surgery. So far, the treatment of transsexuals has been quite haphazard. The information about the possibilities and places of treatment varies. The transsexuals get this information through their associations. As of early 1994, sex-reassignment operations were being postponed until the law comes into force. Male-to-female transsexuals have their operations abroad, mainly in London. Of necessity, female-to-male operations may be performed in the homeland, because Finns cannot obtain these operations abroad., 243645=With women, experiencing orgasm is much more occasional than with men. Orgasm is experienced at least mostly during sexual intercourse by slightly over half of the women and by about 60% of the middle-aged women. When the incidences of women\u0092s orgasms in the 1971 and the 1992 surveys are compared, the regularity of experiencing orgasm had slightly increased with the over-35-year-olds. With women younger than this, no change had happened. At least mostly, orgasm had been experienced during intercourse by 53% of the under-55-year-old women in 1971, and in 1992, by 58%., 24658=Young people report clearly more often than others of having received sufficient information concerning sexual matters from the school or home (see Table 4). This suggests that speaking and teaching about sexual matters has clearly become more common, at least with those people who lived their youth in the 1980s. During the past 20 years, there was an especially clear increase in dealing with sexual matters. After 1971, the share of those who had received sex education in the school increased nearly threefold. Only a few people in the oldest age groups reported they had talked enough about sexual matters in their homes or at school., 173720=Interest in pornographic publications was exceptionally great in 1971 because open nudity had only recently become available in pictures in sex magazines. The charm of novelty and the taste of the forbidden fruit made people anxious to have and use them. Since this initial interest, the greatest excitement and attraction have settled. Besides, the so-called soft pornography has come within everyone\u0092s reach\u0097for example, in the pictures of the afternoon tabloids. Such material, however, is no longer referred to as pornography. There are legal restrictions against hard pornography in Finland, but soft pornography and erotica are shown even on public television., 20195=[Update 2003: In 2002, health education was prescribed as a compulsory subject of the national primary school curriculum. Sex education was integrated in health education. This will harmonize and improve sex education in Finland., 273484=Niemi, I., & H. Pääkkönen. 1989. Ajankäytön muutokset [Changes in the appropriation of time in the 1980s]. Tutkimuksia [Research Reports], 153. Helsinki: Tilastokeskus [Statistics Finland]., 270487=Kontula, O., & E. Haavio-Mannila, eds. 1993. Suomalainen seksi: Tietoa Suomalaisten sukupuolielämän muutoksesta (Finnish sex: Information of changes in sexual life in Finland). Juva: WSOY., 270724=Kontula, O., & E. Haavio-Mannila. 1994. Sexual behavior changes in Finland in the past 20 years. Nordisk Sexologi, 12(3):196214., 260313=[In order to secure the (basic) quality of sexological education and the clinical practice of sexologists, the NACS Annual General Meeting in 2000 (in Helsinki, Finland) approved the authorization [certification] procedure based on the Nordic Association of Clinical Sexology\u0092s education requirements. In 2002, the first specialists in sexological counseling and clinical sexology were authorized in Finland, Sweden, Denmark, and Norway. This gives more official status to these professions. (End of update by O. Kontula)], 272127=Kontula, O., & K. Kosonen 1996. Sexuality changing from privacy to the open\u0097A study of the Finnish press over the years from 1961 to 1991. Nordisk Sexologi, 14(1):34-47., 273746=Riihinen O., A. Pulkkinen, & M. Ritamies. 1980. Suomalaisen perheen lapsiluku [The number of children in the Finnish family]. Helsinki: Väestöntutkimuslaitos D.7., 204103=Compared to the corresponding study of the year 1971, morbidity among men only slightly rose; with women, the rise was fivefold. This can be explained by the fact that in 1971, only gonorrhea and syphilis were surveyed and diagnosed. In 1992, reports of chlamydia and condyloma greatly enlarged the share of the women who had experienced an STD., 195036=The current law regarding termination of pregnancies, which was preceded by a fierce debate, was enacted in 1970. As a result of this liberal law, abortion became practically free, and illegal abortions were believed to have almost entirely ceased. With the new Primary Health Care Act instituted in 1972, the cost of abortions was essentially paid by the municipalities., 122878=[Update 2003: Respondents were less satisfied in their sexual life as a whole in 1999 compared to that in 1992. This was evident, although sexual intercourse was considered more pleasant than before, and sexual self-esteem had improved. This finding was explained by strongly increased desire to experience more sexual intercourse. As the frequency of sexual intercourse did not increase in the 1990s, satisfaction in one\u0092s sexual life also diminished, on the average of 5 to 10 percentage points. (End of update by O. Kontula)], 180500=In 1988, contraceptive use among 13- to 17-year-olds was surveyed (Kontula & Rimpelä 1988). No contraception had been used at the first intercourse by 27% of the 15-year-olds. Most of them, 66% of boys and 71% of the girls, had used a condom during the first intercourse. A few percent had used the pill. At the most recent intercourse, use of the pill was reported by 17% of the girls and 7% of the boys. At the same time, the proportion of those who used the condom had diminished to 59% with the girls. The share of those with no contraception had remained almost the same as at the first intercourse, about one in four., 226832=[Update 2002: UNAIDS Epidemiological Assessment: As of the end of 2001, Finland had reported a cumulative total of 1,301 cases of HIV infection. Of 222 HIV cases reported in 1998 to 1999, 100 were injection drug users, which suggests a recent outbreak among this population. HIV testing is mandatory for blood donors but otherwise voluntary. Diagnosed HIV infections are recorded in a national HIV case-reporting system, using an identification code. Other data come from screening programs. An UAT survey in all pregnant women has been conducted nationally since 1993. Of five positive women identified through unlinked anonymous testing, three were already identified through voluntary testing. UAT surveys have been done also among injection drug users. The incidence of syphilis decreased from 2 to 1 case per 100,000 between 1985 and 1987, and remained stable until 1995. In 1996 to 1998, an epidemic of syphilis had occurred, and most cases identified were imported cases from neighboring countries., 84609=Sexual Intercourse. The frequency of sexual intercourse 20 years ago was almost as high as nowadays. Finns have sexual intercourse usually once or twice a week. The share of people who had had sexual intercourse during the last two days among the people ages 35 to 54 was higher in 1992 than in 1971 (see Table 12). Sexual relations seem nowadays to remain consistent and regular later in life than they did 20 years ago. The frequency of sexual intercourse does not decrease significantly until after the age of 55, especially among women. Even this change does not necessarily follow from aging but from generational differences., 146010=The increased lifespan and increasing occurrence of divorce allows people time to marry several times. According to the 1971 study, 5% of married men and women had been married at least twice. Two decades later, 17% of presently or formerly married or cohabiting men and 22% of the corresponding women had had at least two such relationships. [In 1999, these proportions were 26% and 25%.] Women had had a higher number of such relationships before age 54. In older age groups, men had been married more times than women., 22917=In the FINSEX study (Kontula & Haavio-Mannila 1993), people were asked if they had gotten information about sexual matters in their childhood homes in their youth or sex education at school. At the same time, the people were asked to evaluate the sufficiency of the information and education they had received and their willingness then to receive such information about sexual matters in general. Similar questions were asked both in 1971 and 1992., 174402=[Update 2003: Consumption of pornographic products increased in the 1990s. Use of sex magazines and sex videos was 5% to 10% more common in 1999 than in 1992. Pornography was also more valued than before. Four fifths of men and two thirds of women judged pornography sexually very stimulating. This proportion was even 25% higher among young women in 1999 than what it was in 1992., 47024=A great number of people have already kissed before their first steady relationship, according to the 1992 FINSEX study. After the mid-1970s, about 60% of the men and 70% of the women were dating before the age of 18. About 40% of the present-day under-35-year-olds had had a steady dating relationship before the age of 16. Before the 1950s, it was quite unusual for women of this age to date. Nowadays, only 3% of the over-25-year-olds have never had a dating relationship. Since the 1980s, there have not been great changes in the onset of dating., 267413=Haavio-Mannila, E., & O. Kontula. 1997. Correlates of increased sexual satisfaction. Archives of Sexual Behavior, 26(4):399-419., 265043=CEDAW Convention. 1993. Second periodic report by Finland. Helsinki: Ministry of Foreign Affairs., 199216=[Update 2003: In 1995, the number of abortions fell below 10,000, varying thereafter between 10,000 and 11,000. In 2001, the number amounted to 10,696 or 8.8 abortions per 1,000 women aged 15-to-49 years. The most common reason for performing an induced abortion has been social (about 85%), meaning that the birth of the child would cause considerable strain to the mother in view of her living conditions. About 94% of induced abortions are performed before the end of the 12th week of gestation., 272900=Kosunen, E. 1993. Teini-ikäisten raskaudet ja ehkäisy [Teen-age pregnancies and contraception]. STAKES. Helsinki: Raportteja, 99., 175662=[Update 2003: In 2001, new legislation was implemented in Finland. Practically speaking, it gave legal status to pornography. The only exceptions are pictures that are related to pedophilia, sexual violence, and sex with animals. These forms of sexually explicit material are now defined as illegal. (End of update by O. Kontula)], 272335=Kontula, O., & J. Meriläinen. 1988. Nuorten kypsyminen seurusteluun ja seksuaalisuuteen [Adolescents\u0092 maturation for social intercourse and sexuality]. Lääkintöhallituksen julkaisuja. Sarja Tutkimukset 9/1988. Valtion Painatuskeskus, Helsinki., 148803=The coital positions of elderly people do not vary very much and they quite seldom engage in oral sex, anal sex, or manual stimulation. They even abstain quite often from masturbation and pornographic products. Only 18% of men and 11% of women over 65 years have masturbated during the past year. [In 1999, these proportions were already 28% and 20%, respectively.] The sexual inactivity is explained only partly by aging and illness; the education and generation gap is the more-important reason for this finding. This can be seen, for example, in the data on the number of sexual partners during a lifetime that are much lower among elderly people. Elderly Finns have had much more time to engage in sexual relationships than younger Finns, but they seldom have experienced multiple relationships., 15225=In 1996, a comprehensive national study of sex education was started at the upper stage of the comprehensive school (grades 7 to 9). A questionnaire was mailed to the biology teachers in all upper-stage schools in Finland (N = 603) in February 1996. A total of 421 acceptable responses were returned from 70% of the target population., 95779=[Update 2003: The number of sexual partners had somewhat increased in the 1990s. In 1999, the mean number of sexual partners was 16 for men and 7 for women; 43% of men and 25% of women had had more than 10 sexual partners in their lifetime. (End of update by O. Kontula)], 224224=Public discussion and education concerning AIDS was at its strongest from 1986 to 1988, but the tone was considerably calmer than, for example, in the United States or the United Kingdom. By September 1990, the cumulative AIDS incidence rate per million of population was 14.3, compared with 66.3 in the United Kingdom., 265520=Darling, C. Anderson, J. K. Davidson, & R. P. Cox. 1991. Female sexual response and the timing of partner orgasm. Journal of Sex and Marital Therapy, 17(1):3-21., 13287=In the early 1960s, the first summer university courses were held for teachers on family education. In the schools, sex education was still very scarce. In the 1970s, the National Board of Education set up a working committee to make a curriculum for the education in personal relations and sexual matters for the comprehensive school. The work was finished in 1976, but it did not lead to any wider reform of teaching. Instruction in contraception was, however, given in most schools., 270159=Kontula, O., R. Cacciatore, D. Apter, K. Bildjuschkin, M. Törhönen, S. Koski, & L. Tiilo. 2001. Nuorten tiedot seksuaaliterveydestä [Adolescent knowledge on sexual health] (Väestöntutkimuslaitoksen katsauksia E 11/2001). Helsinki: The Family Federation of Finland., 197809=In 1992, 18% of the women of fertile age thought that they would terminate their pregnancy if they just then found out that they were pregnant. One in two woman thought that they would not want to terminate their pregnancy. If a pregnancy had been a current problem, 16% of the men would have supported their partner\u0092s abortion and 69% would have opposed it. Women want to have abortions clearly more often than men, especially after the age of 35. Women\u0092s desire to have children is clearly concentrated within narrower age limits than with men\u0097around the early 30s. With women, wanting to have an abortion is most centrally related to their age. Almost half of the young women under 25 and women over 40 years of age want to have their pregnancy terminated., 38542=The use of pornographic materials has remained almost the same among men but decreased among women between 1970 and 1990. Even when sex videos were included in the printed publications in 1992, fewer people, on the average, had viewed such material during the previous year. During the past year, 50% to 60% of the men in the different age groups, and from 15% to 20% of the women, had watched a sex video or read a sex magazine., 14867=Since 1972, the Primary Health Care Act has required municipalities to organize contraceptive counseling for all who want it, including schoolchildren, who were given access either to public clinics or to school physicians and nurses. When a physician or school nurse has found it necessary, girls have been provided with contraceptive pills., 109099=In 1992, the respondents were also asked how many parallel sexual relationships they had had while in their steady relationship with their then or earlier partner. Of all the people aged 18 to 74 years who had sometimes lived in a steady relationship, 52% of the men and 29% of the women admitted having experienced at least one relationship of this kind. Even if the incidence of parallel sexual relationships has increased, attitudes to parallel sexual relationships have become stricter during the past 20 years. This discrepancy between liberated actual behavior and tightening attitudes may be related to the fear of AIDS and the growing conservatism in the society in general (Haavio-Mannila et al., 1997). [Comment 2003: It may also imply higher expectations for permanent couple relationships and a renaissance of romanticism in the 1990s. (End of comment by O. Kontula)], 207362=While data on chlamydia are not available for older Finns, one in ten of the under-35-year-olds has had this infection. During 1991, 1.3% of both men and women had been infected by chlamydia. This share very well corresponds to the statistical observation of about 12,000 chlamydia infections per year., 240409=Slightly under 4% of all men in 1992 had consulted a physician for erectile problems, about one third of the men who had reported having sometimes experienced continuous erectile dysfunction. Nearly half of the men who had suffered from at least half a year\u0092s continuous erectile dysfunction had sought a physician for help. In 1971, fewer men than at present, 16%, had talked about the matter with a physician. More than half of the men who sought help in 1992 and about one fifth of the men who sought help in 1971 felt that they had been helped. So, seeking treatment, and the efficiency of this treatment, improved during the 20 years., 123440=Sexual satisfaction as a whole is a combination of emotional and physical satisfaction. According to our 1992 survey results, the two aspects are equally important. Among women, the correlation between general sexual satisfaction and finding intercourse pleasant\u0097measured by the sum of finding them in general pleasant and considering the last intercourse as pleasant\u0097was 0.47 and 0.40 for men. Happiness in the present steady relationship, meaning emotional satisfaction, correlated with sexual satisfaction as a whole for women at 0.44 and for men at 0.36., 274659=Turpeinen, T. 1991. Suomalaisen seksuaalikirjallisuuden bibliografia 1549-1989 [Bibliography of the Finnish sexual literature 1549-1989]. Kellokosken Sairaala, Mariefors Sjukhus and Sexpo ry. Jyväskylä., 23977=In 1971, 28% of men and 33% of women reported having received sex education at school, and in 1992, 64% of males and 74% of females. [In 1999, these proportions were already 78% and 81%.] In 1971, 7% of men and 8% of women considered this information sufficient; in 1992, the percentages were 25% and 32% [and in 1999, 36% and 43%]. This shows that sex education in the schools has clearly improved, although only around 40% of the respondents considered the education sufficient. Close to 5% of the people said that they would not even have wanted such education. Slightly more people would have wanted to receive more education from the school than from the home., 228803=[An estimated less than 100 adults and children died of AIDS during 2001., 199739=[Since 1994, the relative number of abortions among those under 20 has increased by 43% and the corresponding proportion under age 17 by 23%. The rise in both pregnancy and abortion rates from 1997 to 1999 strongly suggests that unplanned teenage pregnancies are increasing. (End of update by O. Kontula)], 267148=Haavio-Mannila, E., & K. Kauppinen-Toropainen. 1992. Women and the welfare state in the Nordic countries. In: H. Kahne & J. Giele, eds., Women\u0092s work and women\u0092s lives\u0097The continuing struggle worldwide. Boulder, CO: Westview Press., 274915=UNAIDS. 2002. Epidemiological fact sheets by country. Geneva, Switzerland: Joint United Nations Programme on HIV/AIDS (UNAIDS/WHO). Available: http://www.unaids.org/hivaidsinfo/statistics/ fact_sheets/index_en.htm., 96084=In both surveys, the large number of sexual partners is related not only to gender and age, but also to marital status, according to a Multiple Classification (multivariate) analysis: The married people had fewer partners than the unmarried, widowed, and the divorced. Those alienated from religion, as well as the frequent consumers of alcohol, had more sexual partners than the religious and temperate people. Those who had passed the matriculation examination had fewer partners than the less educated; this difference, however, was no longer statistically significant in 1992., 31361=The proportion of adults engaging in self-loving, clearly more common among men than women, has definitely increased during the last 20 years, according to the FINSEX study. There has been an increase in the practice of self-loving both during the previous month and during the past year. In 1971, 28% of the men and 16% of women reported masturbating during the previous month. In 1992, the corresponding shares were 42% and 25% [and in 1999, already 60% and 37%]. The strength of the change can be seen in the percentage of women who had masturbated during the previous year. In 1992, this figure for women was higher than the corresponding data for men in 1971., 275155=Wikman, K., & V. Rob. 1937. Die einleitung der ehe. Åbo: Acta Academiae Åboensis. Humaniora, XI:1., 159228=The National Research and Development Center for Welfare and Health (STAKES) gave the first report on the matter in 1992 and the second at the beginning of 1994. The second report had been drafted by a working committee that had been set up to develop a support and care system for the transsexuals in Finland. The aim is to create legislation to secure healthcare services for transsexuals, create a special expert healthcare system, and provide juridical protection for their gender reassignment and privacy. The legislation will also define the criteria for gender reassignment., 273957=Ritamies, M. 1994. Finland: A comparative handbook (pp. 85-99). Westport, CT: Greenwood Press., 2122=Attitudes have also become more positive towards casual relationships (see Table 2). About 70% of Finns think that even a casual sexual relationship can be happy and satisfying. The necessity of love as a premise for sexual intercourse has also diminished. Sexual intercourse without love was considered wrong by 42% of men and 64% of women in 1971. In 1992, the corresponding shares were 29% and 43%. [In 1999, they were almost unchanged: 28% and 42%.], 196072=In the 1992 FINSEX survey, 57% of the men and 53% of the women supported free abortion, disagreeing with the statement, \u0093I do not approve of free abortion (termination of pregnancy).\u0094 [In 1999, these proportions were 62% and 59%, respectively.] Agreement with this statement was expressed in 1992 by 28% of the men and 34% of the women [and in 1999 by 22% of the men and 29% of the women.]. Most abortion opponents were in the older age groups. Opinions on abortion did not vary much in the other age groups, or between men and women., 106915=The number of extra sexual relationships has approximately doubled during the 20 years among the Finns between 18 and 54 years old. In 1971, 24% of the men and 9% of the women who were married at the time of the survey stated that they had had sexual intercourse with some persons other than their spouses during their marriage. In 1992, 44% of the men and 19% of the women who were living in cohabitation or marriage had experiences of parallel sexual relationships during their cohabitation or marriage (see Table 18). [In 1999, these proportions had somewhat decreased among men, but increased among women.], 12699=In 1948, an expert board set up by the Ministry of Education produced a program for instruction and education in sexual morals. The program contained guidebooks both for teachers and students. These guidebooks were distributed to schools, colleges, municipal officers of health, church registry offices, and youth organizations at the public expense. Apart from information about personal relations and sexuality, the program, with the guidebook to accompany it, also contained moral views about conditions in which sexual life was considered appropriate for young people., 268304=Hatfield, E., & R. L. Rapson. 1987. Passionate love/sexual desire: Can the same paradigm explain both? Archives of Sexual Behavior, 16(3):259-78., 269093=Kinsey, A. C., W. B. Pomeroy, C. E. Martin, & P. H. Gebhard. 1953. Sexual behavior in the human female. Philadelphia: Saunders., 259428=[Between 1997 and 2000, the committee\u0097which per se regarded itself as a network\u0097met ten times. Analyses of the current sexological educational situation in the Nordic countries, as well as in other European countries and the United States, were performed. Thereafter, analyses of expected requirements, seen from the viewpoints of the prospective students of each country, the different countries, and the NACS followed. Consensus for Nordic educational programs for clinical sexologists took shape. These programs were, in 1999, approved at the NACS Annual Meeting in Grimstad, Norway. The Nordic training program has three levels: Sexology I: Basic sexology (20 points), Sexology II: Clinical sexology: Sexological counseling (20 points), and Sexology III: Clinical Sexology: Specialist in clinical sexology (40 points). This training has started in Finland., 244234=Comparing orgasm data of 50-year-olds in1971 with the 70-year-olds 20 years later in 1992, experiencing orgasm had not decreased in spite of aging and the increased morbidity (see Table 28). So, the preconditions for sexual satisfaction seem to have improved in this respect. On the other hand, since a considerable number of women do not experience orgasm during intercourse, it is a clear sign of the many restraints that still are obstructing women on their way to enjoyment. And if the woman does not find real satisfaction in sexual intercourse, the man cannot enjoy himself to the full either., 269943=Kontula, O. 2001. Response rate and selection bias in a sex survey: An empirical test. Paper presented in the IUSSP XXIV General Population Conference held in Salvador, Brazil, August 18-24., 261619=In Finland, sexological research is conducted by individual scholars working at universities and research institutes or projects financed mainly by the state. A bibliography of sex literature for the time period 1549-1989 includes over 2,000 authors (Turpeinen 1991). Most of the articles and books listed are written by medical doctors, but some important sociological studies on sexual behavior were also published in the last century. [Update 2003: An updated bibliography covers years 1990-2000 and is available at: http://www.seksologinenseura.net/Palvelut/body_palvelut.htm. (End of update by O. Kontula)], 265335=CIA. 2002 (January). The world factbook 2002. Washington, DC: Central Intelligence Agency. Available: http://www .cia.gov/cia/publications/factbook/index.html., 193647=[Update 2003: The teenage fertility rate declined throughout the 1990s, slower in the second than in the first half of the decade. For 19-year-olds, the pregnancy rate continued to decrease until 1996, while among younger girls (aged under 18 years), the decrease leveled off two years earlier. Starting from 1997, the pregnancy rate has increased every single year in every age group among teenagers. In 2000, the mean age of women at the birth of their first child was as high as 27.4 years. (End of update by O. Kontula)], 266396=Grönfors, M., E. Haavio-Mannila, K. Mustola, & O. Stålström. 1984. Esitietoja homo-ja biseksuaalisten ihmisten elämäntavasta ja syrjinnästä [Preliminary data on lifestyle and discrimination of homo- and bisexual people]. In: K. Sievers & O. Stålström, eds., Rakkauden monet kasvot. Espoo: Weilin+Göös., 268834=Kaplan, H. S. 1987. The illustrated manual of sex therapy (2nd ed.). New York: Brunner/Mazel., 248804=Ninety-two percent of the men and 56% of the women reported having experienced orgasm in the latest intercourse (see Table 29). There was a rise in this level of experiencing orgasm for all the women\u0092s age groups between 1971 and 1992. In 1971, 56% of the under-55-year-old women had experienced orgasm at their last intercourse, and in 1992, 63%. The possible change concerning men is not known, for in 1971, only the women had been asked questions about experiencing orgasm. With women, the level of experiencing orgasm had stayed at 60% until the age of 50, after which it had fallen to about one third., 38987=Obviously, interest in pornographic publications was exceptionally high in 1971, because open nakedness had come, for the first time, into the pictures of the sex magazines at the end of the 1960s in Finland. The charm of novelty and the taste of \u0093the forbidden fruit\u0094 made this material especially attractive. More recently, this high excitement and attraction have settled down. Besides, the so-called soft pornography is now within everyone\u0092s reach, for example, in the pictures in the afternoon tabloids, although it is no longer referred to as pornography., 274195=Sarmela, M. 1969. Reciprocity systems of the rural society in the Finnish-Karelian culture area (FF Communications No. 207). Helsinki: Academia Scientiarum Fennica., 161956=[Update 2003: The Transgender Support Center (TSC) was established by SETA in 1994 with the financial help from the Finnish government. By close networking with the authorities and other relevant organizations, the expertise of the TSC has been an important part of the ongoing process of creating the new professional practices and consensus in medical, juridical, and psychosocial services., 182057=According to the 1971 sex survey, only about 3% of those who needed contraception did not use any method. According to a study conducted in 1977, one in ten women who needed contraception did not use any method (Riihinen et al. 1980)., 266933=Haavio-Mannila, E., T. R. Harris, A. D. Klassen, R. W. Wilsnack, & S. C. Wilsnack. 1996. Alcohol and sexuality among American and Finnish women. Nordisk Sexologi, 4(3):129-146., 235872=Two clear observations emerge when the results of the years 1971 and 1992 are compared: On the one hand, erectile problems seem to have diminished during the 20 years and, on the other hand, they are very much age-bound. In 1971, 4.3% of the under-55-year-old men reported having experienced erectile problems during the last year, and in 1992, 2.2%. The corresponding figures with women about their partners were 6.2% and 4.4%. Both vaginal lubrication and erectile problems become clearly more common after the age of 50. In the age group of the 70-year-olds, almost one third of the couples had at least fairly often suffered from them., 273242=Love, B. 1992. Encyclopedia of unusual sex practices. Fort Lee, NJ: Barricade Books., 198584=As a result of the 1970 law, the number of abortions rose quickly, reaching its peak of over 23,300 abortions, about 41% of the births, in 1973. After that, the number of abortions declined evenly to 11,200 abortions, about 17% of the births, in 1992. Since the early 1980s, the relative number of abortions has been about 30% lower in Finland than in the other Nordic countries (Ritamies 1994). With young people under 20, abortions have also decreased after the early 1970s. Abortion is more than twice as common among young women in the United States than it is in Finland, 44 per 1,000 compared with 9 per 1,000.}",
    "textBeforeTable": "Percentages of Men and Women by Age Who Think Adolescent Sexual Intercourse Is Acceptable in a Regular Relationship, 1971 and 1992 Table 1                   In 1971, two women out of three set the promise of marriage as the condition for beginning a sexual relationship; in 1992, only 16%, [and in 1999, only 11%] of Finnish women were of this opinion (see Table 1). Among adolescents, the revolution is even more apparent. Dating has replaced marriage as an institution, with sexual intimacy almost as accepted during dating as it was earlier only within marriage. As a consequence, very few young people marry their first sexual partners any more. As late as 30 years ago, 60% of women married their first sexual partners. A major factor in this shift to more-liberal attitudes has been a rise in the level of education, but even without this, the changes would have been significant. More-positive attitudes about the sexual rights of adolescents, women, and homosexuals have been matched by more-liberal attitudes regarding the acceptability of casual sexual relationships that are not based on love. The interval between publication of results from the 1971 national survey (Sievers et al. 1974) and the FINSEX survey (Kontula & Haavio-Mannila 1993) was marked by a great change in attitudes, values, and practices that began in the sexual revolution of the 1960s. Public discussion about the sexual revolution at the beginning of the 1970s",
    "textAfterTable": "71 55-64   72   49 65-74   56   43 1971: N = 2,139, with 738 men and 1,401 women 1992: N = 2,244, with 1,101 men and 1,143 women Attitudes have also become more positive towards casual relationships (see Table 2). About 70% of Finns think that even a casual sexual relationship can be happy and satisfying. The necessity of love as a premise for sexual intercourse has also diminished. Sexual intercourse without love was considered wrong by 42% of men and 64% of women in 1971. In 1992, the corresponding shares were 29% and 43%. [In 1999, they were almost unchanged: 28% and 42%.] Table 2                   Percentages of Men and Women by Age Who Think That an Entirely Casual Sexual Relationship Can Be Happy and Satisfying, 1971 and 1992 Age Men 1971      Men 1992      Women 1971 Women 1992 18-24    77 74 52 73 25-34 66 82 44 73 35-44 50 73",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}