{
    "relation": [
        [
            "Click for price",
            "",
            ""
        ],
        [
            "Part Number",
            "75-29021",
            "75-29022"
        ],
        [
            "PART",
            "BINARY SAFETY SWITCH",
            "TRINARY SAFETY SWITCH"
        ]
    ],
    "pageTitle": "B.C. Broncos - 66-77 Early Bronco A/C Systems",
    "title": "",
    "url": "http://www.bcbroncos.com/interiorac.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 313061911,
    "recordOffset": 313038195,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47887=Dakota Digital is proud to release the DCC-2200 Digital Climate Control system designed for Vintage Air Gen-II Air Conditioning systems! Created to interface directly to a Gen-II Air Conditioning system, the DCC-2200 provides convenience of full climate control.       Similar to other Dakota Digital instruments, the DCC-2200 offers a full character Vacuum Fluorescent Digital readout for a simple and beautiful approach to updating your A/C system. With a direct plug-in into the Vintage Air Gen-II's wiring harness and the addition of three temperature senders installation is nearly effortless. Backed by a Limited 24-month Warranty against manufacturer defects, Dakota Digital provides the accuracy and performance you've come to expect from an American Made Product!, 40681=The BC Broncos A/C system (made for BC Broncos by Vintage air) for the Bronco (75-21100 vbelt 75-21101 serpentine) sold by BC Broncos and special ordered through Wild Horses.}",
    "textBeforeTable": "Binary safety switch Trinary safety switch There are two types of safety switches a Binary and a Trinary. The Binary safety switch will cut off the compressor if the pressure gets too high (380psi)or too low (30 psi). The Trinary safety switch will cut off at the same pressures but will also turn on an electric fan when the pressure reaches 220psi helping to cool the system. The BC Broncos A/C system comes with a Binary switch but can be upgraded if needed. A/C SAFETY SWITCH     DRYER WITH TRINARY SAFETY SWITCH 75-29012 DRYER WITH BINARY SAFETY SWITCH 75-29011                    PART            ",
    "textAfterTable": "  CLASSIC UNDER DASH A/C The classic under dash A/C unit is just like some of the dealer installed units that came in Broncos, In fact Vintage Air installed A/C in Broncos for some of the dealers in the San Antonio area in the 1970's. The Mark IV features an all steel case built from the original tooling. This is a great option if you want to add A/C only and not change out your heater or if you want to have a more retro looking set up. You can buy just the unit or a hole kit.      Click for price Part Number                    PART             75-24110 UNDER DASH  A/C ONLY 75-21102 UNDER DASH  A/C KIT V BELT",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}