{
    "relation": [
        [
            "Short Argument",
            "-E",
            "-d name",
            "-G",
            "-g name",
            "-N",
            "-n name",
            "-U",
            "-u name"
        ],
        [
            "Long Argument",
            "--everything",
            "--domain name",
            "--groups",
            "--group name",
            "--netgroups",
            "--netgroup name",
            "--users",
            "--user name"
        ],
        [
            "Description",
            "Invalidates all cached entries with the exception of sudo rules.",
            "Invalidates cache entries for users, groups, and other entries only within the specified domain.",
            "Invalidates all group records. If -g is also used, -G takes precedence and -g is ignored.",
            "Invalidates the cache entry for the specified group.",
            "Invalidates cache entries for all netgroup cache records. If -n is also used, -N takes precedence and -n is ignored.",
            "Invalidates the cache entry for the specified netgroup.",
            "Invalidates cache entries for all user records. If the -u option is also used, -U takes precedence and -u is ignored.",
            "Invalidates the cache entry for the specified user."
        ]
    ],
    "pageTitle": "Deployment Guide",
    "title": "",
    "url": "https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/6/html-single/Deployment_Guide/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 863862867,
    "recordOffset": 863666137,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{798855=Example 12.9. An Active Directory 2008 R2 Domain with Services for Unix, 785908=Example 12.8. An Active Directory 2008 R2 Domain with ID Mapping, 784697=Example 12.7. An Active Directory 2008 R2 Domain}",
    "lastModified": "Wed, 15 Jul 2015 13:24:29 GMT",
    "textBeforeTable": "Table 12.12. Common sss_cache Options ⁠ ~]# sss_cache -u jsmith sss_cache can purge the records for that specific account and leave the rest of the cache intact: If the administrator knows that a specific record (user, group, or netgroup) has been updated, then ~]# sss_cache -Ed LDAP1 sss_cache command can also clear all cached entries for a particular domain: The ~]# sss_cache -E Most commonly, this is used to clear the cache and update all records: sssd package. This utility is included with SSSD in the Note sss_cache, invalidates records in the SSSD cache for a user, a domain, or a group. Invalidating the current records forces the cache to retrieve the updated records from the identity provider, so changes can be realized quickly. The cache purge utility, As LDAP updates are made to the identity provider for the domains, it can be necessary to clear the cache to reload the new information quickly. ⁠Purging the SSSD Cache /var/lib/sss/db/ directory. SSSD can define multiple domains of the same type and different types of domain. SSSD maintains a separate database file for each domain, meaning each domain has its own cache. These cache files are stored in the ⁠12.2.28. Managing",
    "textAfterTable": "⁠Deleting Domain Cache Files All cache files are named for the domain. For example, for a domain named exampleldap, the cache file is named cache_exampleldap.ldb. Be careful when you delete a cache file. This operation has significant effects: Deleting the cache file deletes all user data, both identification and cached credentials. Consequently, do not delete a cache file unless the system is online and can authenticate with a user name against the domain's servers. Without a credentials cache, offline authentication will fail. If the configuration is changed to reference a different identity provider, SSSD will recognize users from both providers until the cached entries from the original provider time out. It is possible to avoid this by purging the cache, but the better option is to use a different domain name for the new provider. When SSSD is restarted, it creates a new cache file with the new name and the old file is ignored. ⁠12.2.29. Downgrading SSSD When downgrading — either downgrading the version of SSSD or downgrading the operating system itself — then the existing SSSD cache needs to be removed. If the cache is not removed, then SSSD process is",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}