{
    "relation": [
        [
            "",
            "Lab. No.",
            "37",
            "38",
            "39"
        ],
        [
            "",
            "Absorbance (1%)",
            "0.324",
            "0.128",
            "1.917"
        ],
        [
            "",
            "Calculated Lovibond value",
            "12.8",
            "5.1",
            "75.7"
        ],
        [
            "",
            "Origin",
            "Korea (produced before World War II)",
            "China (Northern)",
            "Japan (former legal production)"
        ]
    ],
    "pageTitle": "UNODC - Bulletin on Narcotics - 1957 Issue 2 - 005",
    "title": "",
    "url": "http://www.unodc.org/unodc/en/data-and-analysis/bulletin/bulletin_1957-01-01_2_page006.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 794389087,
    "recordOffset": 794362302,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13812=Author: Haruyo Asahina,, Toyohiko Kawatani,, Miss Masako Ono,, Sanaenosuke Fujita, Pages: 20 to 33 Creation Date: 1957/01/01, 262013=Haruyo Asahina and Masako Ono, \"Quantitative determination of morphine in opium by paper chromatography and spectrophotometry \", Bulletin on Narcotics, Vol. VIII, No. 4, 1956., 15854=The morphine content of commercial opiums produced by the Japanese cultivators in the crop seasons of 1953/54 and 1954/55 was assayed by us by the method of the Japanese Pharmacopoeia, and this information is summarized in the paper., 133776=a C. D. Darlington and A. P. Wylie. Chromosome Atlas of Flowering Plants, 2nd. ed. 33-34, London: George Allen & Unwin Ltd. 1955., 17546=The presence of morphine in Papaver setigerum DC., previously suspected, was confirmed by Farmilo et al.[1] in 1953. Morphine was detected in the pod, bud, and leafy parts of this poppy plant., 263619=Charles G. Farmilo & Patricia M. L. Kennett, \"The Colorimetric Determination of ' Porphyroxine-Meconidine ', The Relation between Tintometer and Spectro-photometric Measurements obtained in the Determination of 'Porphyroxine-Meconidine' in Opiums \", United Nations document ST/SOA/SER.K/14, 26 January 1953., 261750=Haruyo Asahina and Masako Ono, \" Determination of morphine in opium tincture by paper chromatography \", United Nations document · ST/SOA/SER.K/40, 25 August 1955., 18770=With this in mind, the following two experiments, experiment I and experiment II, were made in successive years. The seeds were sown in October 1954 and 1955. The flowering continued almost throughout May of the following year., 17797=The Japanese Opium Act (Act No. 71) promulgated in 1954, prohibits the cultivation of the opium poppy, including P. setigerum, except under licence., 33101=It was observed in 1955 that the violet- and mauve-flowered strains of P. setigerum were almost pure phenotypically, that is, the violet- or mauve-flowered strain consisted almost exclusively of plants with violet or mauve flowers respectively., 264668=R. Eder and E. Wackerlin, \"The determination of morphine in opium \", Quarterly Journal of Pharmacy and Pharmacology, 10, 680 - 730, 1937., 262478=M. A. Vesselovskaya. \"The Poppy - Its classification and its importance as an oleiferous crop \" - Supplement 56 to the Bulletin of Applied Botany, of Genetics and Plant Breeding. The Lenin Academy of Agricultural Sciences in the USSR, Leningrad; 1933 (in Russian and English)., 203631=( b) From Papaver somniferum L.-\" Ikkanshu\" cultivated during 1954/55 at the Wakyama Experiment Station attached to the National Hygienic Laboratory., 264269=Haruyo Asahina, \"An assay procedure for opium based on that of the Japanese Pharmacopoeia, and morphine percentages obtained on samples from various countries \", United Nations document ST/SOA/SER. K/15, 11 March 1953. This procedure was adopted as official for the Japanese Pharmacopoeia as from 15 March 1955., 45247=During 1955 and 1956 a considerable number of varieties and strains of Papaver somniferum, P. orientale, and P. rhoeas, together with 29 other species grown at the Kasukabe Experiment Station from seeds sent by foreign botanical gardens, were examined for the presence of morphine by our method of paper chromatography. The method has been given in a preceding section of this paper and was previously published in a United Nations document.[8], 250394=Classification of Japanese opium samples according to morphine percentages, crop season 1954/55, 14731=Since the promulgation of the Japanese Opium Act in 1954, which allows the cultivation of the opium poppy under licence, we have grown the opium poppy and other poppies for study and experiments, and the opiums or juices therefrom have been analysed., 264025=L. Fuchs & W. Ullrich, \"The Colorimetric Determination of 'Porphyroxine-Meconidine'\" United Nations document ST/SOA/ SER.K/10, 25 September 1952., 204431=( d) From P. somniferum cultivated during 1954/55 by a drug company (Nippon Shinyaku) in Kyoto., 263264=L. Fuchs & W. Ullrich, \"The Colorimetric Determination of' Porphyroxine-Meconidine', 2nd communication. Experiments on the Determination of ‘ Porphyroxine-Meconidine' in Small Quantities of Opium\". United Nations document ST/SOA/SER.K/19, 1 September 1953., 32687=Vesselovskaya mentioned in 1933 that P. setigerum, although distinct, could be crossed readily with P. somniferum, indicating their close genetic relationship, and that the crosses were perfectly normal fertile hybrids with viable seed.[6] However, we do not know of either a chemical or a detailed botanical investigation of such a hybrid before our own., 238505=Morphine percentages in Japanese opium, crop season 1953/54, 261502=Haruyo Asahina & Masako Ono, \"Detection of morphine in poppy plants by paper chromatography \", United Nations document ST/SOA/ SER.K/39, 30 June 1955., 261239=C. G. Farmilo, H. L. J. Rhodes, H. R.. L. Hart & H. Taylor. \"Detection of morphine in Papaver setigerum DC. \", Bulletin on Narcotics, Vol. V, No. 1, 26, 1953., 33845=Apparently the female parent is the violet-flowered strain of P. setigerum, whereas the male parent is considered to be P. somniferum, \"Ikkanshu\" variety, a strain commonly cultivated for actual production of opium in Japan. In 1955, no species with a chromosome number 2n = 22 or its multiple other than P. somniferum and P. setigerum was grown by us, and \"Ikkanshu\" was cultivated in the adjoining field to the female parent at our experiment station., 249831=In Table VI the laboratory analyses are given for Japanese opiums of the crop season of 1953/54, and in Table VII analyses are Summarized for the crop season of 1954/55., 135098=The poppies were sown in October 1954 and 1955 and grown under uniform cultural conditions at the Kasukabe Experiment Station (numbers 1 to 26, 58 to 98) and the Wakayama Experiment Station (numbers 27 to 57). The method of incision was the usual practice described in section 1., 33366=An F 1 hybrid was found to grow in the violet-flowered strain in 1956. The chromosome number in the root-tip cell was 2n= 33, which was the stun of the gametic chromosome numbers of P. setigerum n = 22, and P. somniferum n = 11 (fig. 3). At the first meiotic metaphase in the pollen mother cell (PMC), 11 bivalent and 11 univalent chromosomes were observed (fig. 4). The chromosome behaviour in meiosis of PMCs of the F 1 hybrid was of the type of Pilosella., 219262=Black spot shows the village in which the opium poppy was actually cultivated under licence during 1954/55.}",
    "lastModified": "Tue, 16 Aug 2005 11:57:00 GMT",
    "textBeforeTable": "Details of the Collection of Opium from Papaver setigerum DC. The capsules were incised in the evening and the latex was gathered just after incision (\" Kiritori\" collection) and the following morning (\" Oigaki\" collection). The opiums thus obtained were mixed, as is the usual practice in collecting commercial opium from P.somniferum. Three or four incisiom, each covering a quarter of the capsule, were made at intervals of one day, till no more latex was yielded. The first incision began ten days after the petals had fallen. In experiment I it began at different dates in the sequence of flowering, irrespective of the strains, whereas in experiment II all sets of incisions made began on the same date. Each incision consisted of four longitudinal slashes. There were plants with violet flowers and also plants with mauve flowers in the strain. In experiment I both kinds were used without separating them, whereas in experiment II only plants with violet flowers were used. With this in mind, the following two experiments, experiment I and experiment II, were made in successive years. The seeds were sown in October 1954 and 1955. The flowering continued almost throughout May of the following year. This investigation was undertaken to grow and identify botanically P. setigerum, and to determine quantitatively the content of alkaloids in the opium from this poppy plant. For actual production of opium only P. somniferum has been cultivated, and there is no history of the cultivation of",
    "textAfterTable": "16-31.V.1955 65 II 25.X.1955 Violet-flowered 130 15.88 18-24.V.1956 67 The presence of alkaloids, at the proper Rf values for morphine, codeine, and other opium alkaloids in the opium from P. setigerum was readily demonstrated by using paper chromatography [2] Opium was rubbed thoroughly with dilute hydrochloric acid, and the solution containing the alkaloidal salts was centrifuged. The supernatant solution was used for the paper chromatography. The paper chromatography was carried out as follows: Solvent: n-butanol 50, 28 % NH4OH 9, distilled water 15 parts by volume. In the preparation of the solvent, the constituents were mixed, the mixture allowed to stand for some time, and the top layer of the mixture used for chromatography. Paper: No. 51 manufactured by Toyo Filter Paper Co., Ltd., 2.5 x 40 cm. Movement of solvent: Ascending. Spot-developing reagent: Potassium iodoplatinate prepared according to Munier: 1 cc of 10% platinic chloride and 25 cc of 4% potassium iodide were mixed and the resulting solution made up to 50 cc with H 20. The following spots were obtained. The Rf values and colouration of the spot are given. Chromatography of Opium from Papaver setigerum DC. Opium R/ values",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}