{
    "relation": [
        [
            "Element",
            "Field Caption field",
            "Field Type",
            "Override Bit Flag",
            "Administrator Only Edit check box",
            "View Only Field check box",
            "Enable Option List check box"
        ],
        [
            "Description",
            "Label for the field that is displayed on content server pages.",
            "Text: 30 characters. Long Text: 100 characters. Date: Date format (such as dd/mm/yyyy or dd/mm/yy for the English-US locale). Memo: 255 characters. Integer: -231 to 231 (-2 billion to +2 billion). By definition, an integer is a natural number, so decimal values and commas are not permitted.",
            "For internal use.",
            "Selected: The field is not displayed on the User Profile pages. However, the field is visible to an admin user through the User Admin applet. Clear: The field is displayed on the User Profile page.",
            "Selected: The field is displayed on the User Profile page, but cannot be edited by the user. Clear: If the Administrator Only Edit check box is clear, the field can be edited by the user on the User Profile page.",
            "If selected, the field has an option list that is defined by the Option List Type and Option List Key. Values shown in the Information Fields tab Is Option List are True or False."
        ]
    ],
    "pageTitle": "A.2 Security and User Access Interface",
    "title": "",
    "url": "http://docs.oracle.com/cd/E14571_01/doc.1111/e10792/e01_interface002.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72573596,
    "recordOffset": 72557648,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:14:23 GMT",
    "textBeforeTable": "Select a user information field and click Edit on the User Admin Screen: Information Fields Tab. Enter a field name and click OK on the Add Metadata Field Name Screen The Edit Metadata Field screen is used to define a user information field. To access this screen, do one of the following: A.2.4.16 Edit Metadata Field Screen Displays the Edit Metadata Field Screen. OK button Duplicate names are not allowed. Maximum field length is 29 characters. The following are not acceptable: spaces, tabs, line feeds, carriage returns and ; ^ ? : @ & + \" # % < * ~ | When you add a custom user information field, the system automatically prefixes the name with a \"u\" to ensure that it is unique and does not conflict with any reserved names. However, you must be careful not to inadvertently use restricted names for columns in the user logins table because they may conflict with reserved names in databases. For example, if you try to use \"ID\" to name a new custom user information field, the result will be \"UID\" when the",
    "textAfterTable": "A.2.4.17 Update Database Design Screen The Update Database Design screen is used to add or delete user information fields in the content server database. To access this screen, add or delete a user information field and click Update Database Design on the Edit Metadata Field Screen. Element Description Info field(s) that will be added Lists the user information fields that were added since the last time the database was updated. Info field(s) to delete check boxes Lists the user information fields that were deleted since the last time the database was updated. Selected: The user information field is deleted from the database. Clear: The user information field is not deleted from the database. The field remains hidden on the User Admin screen and User Profile pages, but it still exists in",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}