{
    "relation": [
        [
            "Name",
            "",
            "",
            "",
            "",
            "bserver53",
            "cmcfixes78",
            "impress186",
            "oooimprovement6",
            "vgbugs11"
        ],
        [
            "Description",
            "Coming originally from release codeline milestone (see separate release notes for OOO330m8)",
            "Coming originally from release codeline milestone (see separate release notes for OOO330m7)",
            "Coming originally from release codeline milestone (see separate release notes for OOO330m6)",
            "Integrated into development codeline DEV300",
            "",
            "various warnings and minor optimizations",
            "Impress OOo 3.3 bugfix workspace",
            "usagetracking fixes",
            "This CWS contains some little fixes. No office code changed."
        ],
        [
            "Milestone (integrated)",
            "",
            "",
            "",
            "",
            "DEV300m88",
            "DEV300m88",
            "DEV300m88",
            "DEV300m88",
            "DEV300m88"
        ]
    ],
    "pageTitle": "DEV300m104 Developer Snapshot - Release Notes",
    "title": "",
    "url": "http://www.openoffice.org/development/releases/DEV300m104_snapshot.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 633288823,
    "recordOffset": 633269559,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "DEV300m89 Misc. 3.4 bug fixes. tl82 DEV300m89 smoketest28 DEV300m89 passive registration of UNO components sb129 DEV300m89 misc. OOo 3.4 fixes sb126 DEV300m89 perftest12 DEV300m89 Impress OOo 3.4 Bugfix workspace impress198 DEV300m89 Fixes and enhancements for charmap handling ifcmap01 DEV300m89 dev300m89masterfix DEV300m89 ause125 DEV300m89 improve handling of freetype and xinerama prerequisites in setsolar build environment ause123 Integrated into development codeline DEV300",
    "textAfterTable": "Name Description Milestone (integrated) Coming originally from release codeline milestone (see separate release notes for OOO330m5) Coming originally from release codeline milestone (see separate release notes for OOO330m4) Coming originally from release codeline milestone (see separate release notes for OOO330m3) Integrated into development codeline DEV300 automationdev300m85 DEV300m87 automationdev300m86graphics DEV300m87 changeannouncemail2 add cross merged cwses in mail body DEV300m87 cmcfixes77 misc warnings and build fixes DEV300m87 codecleanup02 Remove unused code",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}