{
    "relation": [
        [
            "First Name",
            "BRIAN",
            "KRISTIN"
        ],
        [
            "Last Name",
            "MALNAK",
            "WHITMAN"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=57F578E8-2B0B-4484-B577-2F295485E34E&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 215618219,
    "recordOffset": 215607705,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12259=FY 2012 Appropriations bills and funding for DOI and EPA to carry out regulatory responsibilities related to offshore oil and gas leases including: Interior and Environment Appropriations bill (H.R. 2584); FY 2011 Appropriations bills and funding for DOI and EPA to carry out regulatory responsibilities related to offshore oil and gas leases., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 28893=Issues related to offshore oil & gas - response to Arctic moratorium, no bill title; Issues related to offshore oil & gas - response to Gulf of Mexico moratorium, no bill title; Issues related to offshore oil & gas - air permit for AK OCS, no bill title; Draft SEIS for Lease Sale 193; FY 2012 Appropriations bills and funding for DOI and EPA to carry out regulatory responsibilities related to offshore oil and gas leases including: Interior and Environment Appropriations bill (H.R. 2584); Issues related to exploratory drilling on Shell's leases in Alaska's OCS including air permit requirements; incidental harassment authorization from NMFS/NOAA; and plan approvals from DOI; Dodd-Frank Implementation; Issues related to OCS drilling in Alaska; S. 275, Pipeline Hazard Safety Mitigation Act Reauthorization, all provisions; General issues related to the Clean Air Act; General issues related to natural gas fuels; General issues related to offshore oil and gas activities and oil spill response, no bill number assigned; Issues related to onshore gas development including renewal of agreement between Pennsylvania DEP and Army Corp of Engineers, concerns regarding hydraulic fracturing, produced water, treatment of waste water, air emissions, land footprint, discussion of possible ethylene cracker in Marcellus region, no bill number assigned; S. 589 The Faster Action Safety Team Response Act; Legislative language in the Department of Defense Reauthorization Act of 2012 (S. 981, S. 1253, S. 1254) to repeal Sec. 527 of the Energy Independence and Security Act of 2007; H.R. 1540, the National Defense Authorization Act for Fiscal Year 2012, provisions related to repeals Sec. 526 of the Energy Independence and Security Act of 2007; Issues related to the Canadian production and exportation to the United States of oil sands crude, including approval of the Keystone Pipeline XL and engaging with federal government on EU Fuels Quality Directive, no bill number assigned; Educate on the importance of including gas in a Clean Energy Standard, no bill number assigned; Work with National Petroleum Council and Department of Energy to finalize the North America's Resource Development Report, no bill number assigned; Issues related to permits needed for exploration on Alaska OCS leases; Issues related to Shell's Gulf of Mexico activities/permits, including clarity on regulatory requirements for the Gulf of Mexico; HR 2012 Jobs and Energy Permitting Act of 2011, provisions relating to air permits for OCS oil and gas activities; Issues related to domestic oil and gas development, including proposals to expand/restrict access; proposals to impose new regulatory requirements; HR 261 No New Drilling Act of 2011, provisions related to amendment of Outer Continental Shelf Lands Act to prohibit OCS leasing for oil and gas activity; HR 612/S. 171, West Coast Ocean Protection Act of 2011, provisions related to permanently blocking drilling off CA, OR, WA; HR 1230, Restarting American Offshore Leasing Now Act, provisions that require offshore lease sales in the Gulf of Mexico and offshore Virginia that have been delayed or canceled; HR 1231, Reversing President Obamas Offshore Moratorium Act, provisions that require the 2012-2017 lease plan to include areas that have the most oil and natural gas resources; HR 1229, Putting the Gulf Back to Work Act , provisions that ensure timely permitting of OCS activities in the Gulf; Various proposals related to offshore oil and gas leasing, permitting and oversight, including the provisions included in HR 1287, Domestic Jobs, Domestic Energy, and Deficit Reduction Act of 2011; H.R. 1115, Expedited Offshore Permitting Act of 2011; H.R. 1102, Affordable Gas Price Act; HR 1023, No More Excuses Energy Act of 2011; Energy policy proposals with provisions re: developing the OCS; HR 909 Roadmap for America's Energy Future; HR 903 Maximize Offshore Resource Exploration Act of 2011; Discussions regarding the Department of Interior 2012 drilling program; Discussion regarding Shells 2012 drilling program., 16948=FY 2012 Appropriations bills and funding for DOI and EPA to carry out regulatory responsibilities related to offshore oil and gas leases including: Interior and Environment Appropriations bill (H.R. 2584); FY 2011 Appropriations bills and funding for DOI and EPA to carry out regulatory responsibilities related to offshore oil and gas leases; Discussion regarding the importance of flexibility in Draft EPA New Source Performance Standards for the refining sector and the value of incentivizing gas in similar standards for the power sector; Administrative rule making, no bill number assigned ; HR 1204 Legislation to amend the Clean Air Act to eliminate the exemption for aggregation of emissions from oil and gas development sources; H.R. 1084/S. 587 The Fracturing Responsibility and Awareness of Chemicals Act; Encourage inclusion of market mechanisms and incentives for CCS in U.S. input to United Nations Framework Convention on Climate Change regarding Copenhagen Accord and Cancun Agreement on climate, no bill number assigned; S. 937 -- The American Alternative Fuels Act of 2011, provisions related to repeals Sec. 526 of the Energy Independence and Security Act of 2007; General issues related to permits needed for exploration on Alaska OCS leases; HR 2012, Jobs and Energy Permitting Act of 2011, provisions related to air permits for OCS oil and gas activities; General issues related to the National Ocean Policy Commission and implementation of ocean policy recommendations., 66231=Meeting with EPA R10 and to discuss impending new regulations and plans for further air permitting; Meeting with EPA R10 regarding Shell's discharge plans for 2011 in Beaufort Sea., 47473=General issues related to maritime operations associated with oil and gas activities on the OCS, e.g., HR 1572 Offshore Installations Emergency Evacuation Act; HR 2838 Coast Guard and Maritime Transportation Act; Issues related to the National Ocean Policy Commission and implementation of ocean policy recommendations., 60078=General issues related to Customs & Border Protection enforcement of trade agreements; S. 1472 Syria Sanctions Act of 2011, all provisions; S. 1048 Iran, North Korea, and Syria Sanctions Consolidation Act of 2011, all provisions.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City  HOUSTON State  TX Zip Code  77002 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mr.  BRIAN P. MALNAK  2024661410  brian.malnak@shell.com 5. Senate ID#  35092-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}