{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "campus safety works hard at their job. they can be quite slow though. many times if at a help station on campus, it can take them an hour to reach you.",
            "there is no greek like at apu.",
            "apu offers more clubs and activities than any one person has time for. there are things for people of all interests and backgrounds.",
            "apu is a great school for students who want that christian community environment and an all star athletics program. many times students have to choose, but here you can enjoy the fun of a public school and the quality of a private school.",
            "apu has many religion areas on campus. these included a replica of the wailing wall, seven palms and a few others that are taken from influences around the world.",
            "though apu is a wonderful establishment, many students can not afford to come or stay. even with scholarships and grants, the cost of tuition is way too high and progressively getting higher.",
            "there are so many things to do for fun around apu. not too far away are the beach, disneyland, and the mountain. it is very easy to get to wonderful attractions if you have transportation. if not, there are always fun things and events happening every week.",
            "the food is not very good. it has gotten better in recent years, but it still tastes like school food. there are some small shops around campus that serve excellent food, but the primary venues are lacking in quality and taste.",
            "dorms are strictly for freshman. there are many buildings that are new and well equipped, but the majority of the housing needs to be updated. there are so many students here now that the rooms are often very crowded. however, the events that the dorms take part in are very fun and exciting.",
            "academia here is completely dependent on the major one chooses, and the teachers one takes. the honors and nursing programs are very rigorous, and those who dare to double major will be under a lot of stress and pressure.",
            "when coming to apu, make sure to get involved with the leadership programs and all the events that happen on campus. this school works very hard in trying to make everyone feel welcome, so participate and have fun.",
            "azusa pacific university is excellent at accommodating different types of students and creating a warm tight knit environment. being a christian university, there are many strict and limiting rules that are often unnecessary. overall, apu is a wonderful high spirited school with a passion for the community."
        ]
    ],
    "pageTitle": "Azusa Pacific University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Azusa-Pacific-University/reviews?_escaped_fragment_=/show/18416",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914778887,
    "recordOffset": 914642101,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72652=The transition to college can be scary, but my biggest piece of advice is to stay positive through whatever life gives you! Be open to change and keep the future in mind! If you haven't visited yet, take a tour of the campus! Visit the department in which you are planning on majoring in. Make sure you are ready to be fully immersed in a Christian environment. Start looking out for sales on things you might need for college and start buying over summer so it's not stressful once you get to school! Read the ENTIRE code of conduct, housing rules, and just be prepared for what is expected of you once you get to APU. Make sure to register for classes as early as possible and ask your academic advisor as many questions as you need in order to be prepared for the year! Stay in contact with your admissions counselor often over the summer if you have questions. Also, get talking to future classmates on Facebook so you can make friends! The APU Class of 2015 page is where I made many friends before even getting to school, you can do the same! Have goals for the school year- not just long term goals, but lots of short term ones that you can achieve throughout the year. Have a mentor. Whether it is your alpha leader, RA, a professor you meet, ask an older person to be your mentor throughout college and guide you through life. Use ratemyprofessors.com to the fullest. You won't regret it. You will regret not using it! Compare book prices on amazon and the bookstore. Don't pay more than you need to., 7760=Honestly everyone could fit in at this school. We don't necessarily have a specific cookie cutter mold that you have to fit. There are many out of state students that attend here which adds to the diversity. The only requirement that I believe that would be necessary is that you have an open and receptive heart to the Christian lifestyle. There are many on-fire Christians at this school that might catch you off guard if you have never been exposed but they definitely should not intimidate you. You are not required to be a Christian but that doesn't mean that you can go about living any which way you please. The university wants to maintain its reputation of its motto to have God First. It goes all the way up to our president who constantly shows us a God driven heart to care for each and everyone person. If you can just buy into the mission you will enjoy your experience to the utmost. It says in the most cliche verse of the whole Bible, John 3:16, that ...God so loved the WORLD..., the entire world and that is what we are called to do as Christians as difficult and challenging as that may be but with the strength and love that God empowers us with each and every person will feel a sense of belonging. Some people who may not enjoy this experience are ones that dislike: Warm weather Suburban areas Required Chapel attendances (3 a week) Required Community service (120 credits by graduation) Required Bible Courses Having a good time! haha Like I said, this school only requires an open and willing heart ready to listen and act on the way God is pushing or pulling you. Sit back, relax and enjoy our Creators wild ride!!!, 745070=© 2015, Cappex.com, LLC, 635243=Skip out on the caf (1899 dining hall) it ruins your stomach, but the west campus eating areas are way better. Their is two sandwich shops, a sushi place, pizza place, fast food type place, BBQ stand, Mexican restaurant, coffee shop, and west campus cafeteria on campus., 377852=Azusa Pacific University has a satellite school, which is conveniently located in my city of Victorville. The facility is beautiful and very functional. The instructors are all very knowledgeable. I am proud to become a graduate of APU in November of 2012!}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 40 out of 41 people found this review useful. 1 of 159 Audrey from Azusa, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Azusa Pacific University Reviews Azusa Pacific University › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Eli from Ennis, MT 12/24/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 159 Categories Comments Great for these types of students Honestly everyone could fit in at this school. We don't necessarily have a specific cookie cutter mold that you have to fit. There are many out of state students that attend here which adds to the diversity. The only requirement that I believe that would be necessary is that you have an open and receptive heart to the Christian lifestyle. There are many on-fire Christians at this school that might catch you off guard if you have never been exposed but they definitely should not intimidate you. You are not required to be a Christian but that doesn't mean that you can go about living any which way you please. The university wants to maintain its reputation of its motto to have God First. It goes all the way up to our president who constantly shows us a God driven heart to care for each and everyone person.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}