{
    "relation": [
        [
            "Name",
            "",
            "",
            "ause123",
            "ause125",
            "dev300m89masterfix",
            "ifcmap01",
            "impress198",
            "perftest12",
            "sb126",
            "sb129",
            "smoketest28",
            "tl82"
        ],
        [
            "Description",
            "Coming originally from release codeline milestone (see separate release notes for OOO330m9)",
            "Integrated into development codeline DEV300",
            "improve handling of freetype and xinerama prerequisites in setsolar build environment",
            "",
            "",
            "Fixes and enhancements for charmap handling",
            "Impress OOo 3.4 Bugfix workspace",
            "",
            "misc. OOo 3.4 fixes",
            "passive registration of UNO components",
            "",
            "Misc. 3.4 bug fixes."
        ],
        [
            "Milestone (integrated)",
            "",
            "",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89",
            "DEV300m89"
        ]
    ],
    "pageTitle": "DEV300m105 Developer Snapshot - Release Notes",
    "title": "",
    "url": "http://www.openoffice.org/development/releases/DEV300m105_snapshot.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 625239911,
    "recordOffset": 625214685,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Integrated Child Workspaces (CWS) Go back to top drawing speclink sven.jacobi@sun.com     i4499 changed/cws impress186: setting pixel resolution when exporting graphics Component Spec. link Dev. owner Description Spec. title TaskId Feature title formula editor   thomas.lange@sun.com Math symbol catalog supports UTF-32 characters now   i74049 Math symbol catalog supports UTF-32 characters now Component Spec. link Dev. owner Description Spec. title TaskId Feature title gsl speclink philipp.lohmann@oracle.com Printing on Unix systems can now produce PDF files instead of PostScript.   i94173 Print file format changes on Linux systems Component Spec. link Dev. owner Description Spec. title TaskId Feature title framework   frank.schoenheit@sun.com The tree lists in the application's Navigator, Stylist (\"Styles and Formattings\"), and in the options dialog, now support selecting entries by typing their name.   i31275 stylist / navigator / options dialog: selecting",
    "textAfterTable": "rt40 Minor RE related tooling fixes DEV300m105 sw34bf05 fixes in Writer for OOo 3.4 DEV300m105 test123l10n04 L10N cws produced by ContL10N DEV300m105 vcl121 3.4 issues DEV300m105 vcl2gnumake Migrate vcl to gbuild system DEV300m105 Name Description Milestone (integrated) chart53 chart bug fixes DEV300m104 dba34c DEV300m104 dev300m104masterfix DEV300m104 dr78 Calc bug fixes DEV300m104 native361 OOo 3.4 Installation tasks, preregistration of extensions DEV300m104",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}