{
    "relation": [
        [
            "Yr",
            "2013",
            "2013",
            "2013",
            "2014",
            "2014",
            "2014"
        ],
        [
            "Cls",
            "1",
            "1",
            "1",
            "2",
            "2",
            "3"
        ],
        [
            "Player",
            "Derrick Green",
            "De'Veon Smith",
            "Ty Isaac",
            "De'Veon Smith",
            "Derrick Green",
            "Drake Johnson"
        ],
        [
            "Rush Att",
            "83",
            "26",
            "40",
            "108",
            "82",
            "60"
        ],
        [
            "Rush Yds",
            "270",
            "117",
            "236",
            "519",
            "471",
            "361"
        ],
        [
            "Rush Avg",
            "3.3",
            "4.5",
            "5.9",
            "4.8",
            "5.7",
            "6.0"
        ],
        [
            "Rush Td",
            "2",
            "0",
            "2",
            "6",
            "3",
            "4"
        ],
        [
            "Rec",
            "0",
            "0",
            "4",
            "3",
            "2",
            "1"
        ],
        [
            "Rec Yds",
            "0",
            "0",
            "57",
            "26",
            "26",
            "11"
        ],
        [
            "Rec Avg",
            "0",
            "0",
            "14.3",
            "8.7",
            "13.0",
            "11.0"
        ],
        [
            "Rec Td",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Plays Tot",
            "83",
            "26",
            "44",
            "111",
            "84",
            "61"
        ],
        [
            "Yds Tot",
            "270",
            "117",
            "293",
            "545",
            "497",
            "372"
        ],
        [
            "Avg Tot",
            "3.3",
            "4.5",
            "6.7",
            "4.9",
            "5.9",
            "6.1"
        ],
        [
            "TD Tot",
            "2",
            "0",
            "2",
            "6",
            "3",
            "4"
        ]
    ],
    "pageTitle": "Diaries | mgoblog",
    "title": "",
    "url": "http://mgoblog.com/blog?page=0%2C0%2C2%2C1%2C1%2C3%2C1%2C5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 156472939,
    "recordOffset": 156249648,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{53146=Vegas has set Northwestern's win line at 6.5 games and judging from their tough schedule this sounds fair.   Tough games with brainy schools Stanford (home) and a suddenly solid Duke (away) are mixed with FCS Eastern Illinois and quite bad Ball State.  2-2 seems likely.   (Duke is likewise breaking in a new QB but is well coached, and is at home)   Northwestern is probably sick of playing Michigan as UM has (at times undeservedly)  snatched some last second victories away but it doesnt get easier for the Wildcats in 2016-2017 as their crossovers switch from UM/PSU to OSU/MSU.    If they only go 2-2 in non conf they'd need to go 5-3 in the conf to go 7-5 and surpass Vegas 6.5 games.  That seems daunting with the schedule they have.  I might actually take the under on Northwestern this year., 54989=Disclaimer:  My previews of Big 10 teams are based on viewing of 2014 games of said teams plus extensive reading of local and national previews of that team.  I might be wrong in my assessment any one team or any specific unit of that team.  But that's clearly doubtful. (!!)  No, on a serious note I enjoy people who comment who live locally to these teams or is an opposing fan - helps us get a better perspective so if you are one feel free to add to the discussion. , 6708=UM rush off v Northwestern rush def - Adv: Even.  Both teams have questions and until the season begins its too early to really determine who has what.  Hopefully by mid October UM has a viable rushing offense with lineman who create holes that running backs not named Drake Johnson can find.  Northwestern's questions at DT offer similar questions for their rush defense., 3254=This is a home game, enough weeks into the season for the offense to (fingers crossed) have a viable rush offense and that shold parlay in Rudock being more effective as the offense can be more 2 dimensional.  Of course that is a lot of theories and we need to see them become fact by mid October. , 6895=(take these matchups with more of a grain of salt than usual because once you get past the month of September teams grow and evolve - well at least well coached teams.), 27914=At WR - an ACL injury to Northwestern's top catching threat - led to relatively meh production from Kyle Prater (now in the NFL) and junior Dan Vitale.  Both had \"2014 Darboh like\" seasons; ok as complementary receivers but considering they were the top line guys it wasn't good., 39488=At the individual level, QB Trevor Siemian was what you typically get with a Big 10 QB the past decade.  Nothing special - and often just bad.  While he threw for 2200 yards his yards per attempt were a pathetic 5.6 (for comparison in 2013 he threw for 7.2 ypa!).  And even with that short passing game his completion % couldn't bust 60%.  7 TDs, 11 INTs - it wasn't good.  Freshman running back Justin Jackson was a revelation later in the year and he piled up nearly 1200 yards with a 4.8 ypc average.  Michigan fans won't remember his name because UM's run defense stuffed him to the tune of 35 yards but aside from that game he had between 100ish and 150ish a game in all of Northwestern's final 8 games.  Considering the dour OL that was especially impressive.  , 39733=Explosiveness is hard to quantify, but the IsoPPP (isolated points per play) stat does a pretty good job. In 2014, Northwestern's IsoPPP was .68, which was 128th in the nation.  (i.e. last in FBS), 27418=The 2014 defense was good at two things: preventing big plays on the ground (40th in Rushing IsoPPP+) and preventing completions through the air (43rd in Passing Success Rate+, 32nd in completion rate allowed)., 41297=In many ways Northwestern was in a similar spot to Michigan entering 2014.  Coming off success a few years earlier but some stubbed toes in 2013, many thought Northwestern was a bit of a dark horse coming into 2014, and if things fell right could challenge in their division.  Two bad losses early killed that thought but by week 5 wins over Wisconsin and Penn State had restored the faith a bit and brought a 3-2 record.  It went downhill from there as Northwestern closed out the year 2-5, although their week to week performance was wickedly variant.   A team who in a span of 3 weeks could lose 48-7 to Iowa, then punish TV viewers with a 10-9 slog vs UM, and then beat a decent Notre Dame 43-40 in South Bend.  It was one strange year. , 54235=After making what seemed like a \"breakthrough\" in 2012 with a 10 win season Northwestern began receiving the type of hype you are seeing with Minnesota this year as a top tier 2 team in the conference.  I've already outlined why I believe Minnesota hype will come back down to earth this year and it sure did for Northwestern.  Some of it was just bad injury luck but programs of this ilk rarely have the depth to go a whole season without a serious setback.   After back to back 5 win seasons Minnesota has basically replaced Northwestern as the chic program to pick as a challenger for the Nebraskas and Wisconsin in the West.   As for Northwestern, 2012 feels more like an outlier and if Northwestern doesn't get to 7 wins this year that will be 3 years in a row without a winning season., 27601=Speaking of injuries, they forced some young players into key roles on the defense last year which didn't help 2014 but should help in 2015., 26363=The WRs were meh in 2014 but the return of Christian Jones - Northwestern's lead WR in 2012 and 2013 - from an ACL suffered last August should boost this group big time., 523=I will focus on the ten largest states by participation; Otherwise there is just too much data.  These numbers are for male football athletes during 2014.}",
    "TableContextTimeStampAfterTable": "{279411=De'Veon Smith is another applicant for the feature back position. In the wake of losing Green to a broken clavicle, Smith saw the most carries on the 2014 team. However, Drake Johnson started stealing carries towards the end of the year before he too went down with an injury. Let's see to whom Smith is most comparable.  , 323429=Michigan had home games scheduled the weekend of May 1 with Purdue and Illinois, but got in only one game, a 9 to 1 Weber win against Purdue., 310526=These numbers are even more impressive when plotted against every Michigan running back with greater than 20 carries since 1975. The x-axis is the Class (1-freshman, 2-sophomore, etc) and the y is Yds/Carry., 126776=It's July, which means most of us are starving for college football, but our insatiable desire for it has yet to be satisfied.  I had been playing around a lot on NCAA Football 14 (hi, Denard), which in dynasty mode offers many options in the way of conference rules and realignment.  This got me thinking about a method to solve a lot of the college football discrepancies between conferences and, at this point, teams in the same conference, but in separate and huge divisions., 290254=Drake Johnson came on strong last season before going down with a knee injury. By all accounts he's been putting in the work to be ready for this season, and with his vision he is definitely in the hunt for the feature back role. Let's see who Johnson's 2014 season was reminiscent of.  , 249334=Minn rush off v UM rush def - Adv: UM.  Last year this was supposed to be strength on strength.  It ended up not being so as Minn rushed for over 200 yards with 183 coming from Cobb and a nasty 5.7 ypc average.  UM did a good job on Leidner - or if you are a pessimist, Leidner barely had to run as he only had 6 carries which will include sack yards.  UM usually did quite well vs average to below average rush offenses in 2014 but struggled against units who specialize in the run.  Fast forward a year and UM should still have a solid rush defense but Cobb is gone.  Minn should continue to have a good OL but needs to show a back so slight edge to UM here., 317930=1975 MVP starting pitcher Mark Weber returned, but #2 man Chuck Rogers was off to the pros and #3 starter Craig Forhan was off to UM law school., 156979=(Army-Navy would keep its slot on the 2nd Saturday of December at 4:30pm ET)., 340618=1976 did not boast the most talented team, outscoring its opponents overall just 180 runs to 178, hitting only 5 home runs for the entire regular season, and finishing in the middle of the conference in fielding., 248228=(take these matchups with more of a grain of salt than usual because once you get past the month of September teams grow and evolve - well at least well coached teams.  Both these teams should be better in October than September as they both now have good staffs), 157579=(January 1, New Year's Six Sites), 227657=Gophers fans are high on 2014 four star RB Jeff Jones who was ineligible last year.  Now keep in mind Gophers fans are not used to four stars so any four star will excite them.  Jones is the only composite 4 star I found in the 2012, 2013, 2014, and 2015 classes.  Jones apparently did a solid job this spring and this is a team with a solid OL to run behind.  Berkley Edwards, Rodney Smith, and Rodrick Williams are also in the running back group and it certainly could be a position by committee situation this year ala UM., 17635=Findings: There was a fairly dramatic decrease in football participation between 2011 and 2012.  As you all remember, Junior Seau shot himself in May of 2012 and sparked the debate about long term concussion effects.  This correlation cannot be ignored., 162999=Minnesota is a program that has turned it around under the Jerry Kill regime but in some corners of the universe the hype machine is a bit too high from this set of eyes; especially considering the offensive production lost to graduation.  In Cowherd's terms I'd like to be a short seller of Minnesota Gophers football in 2015 while stuffing them in my 401k as a long term investment 12 months from now once the price cools down.   Jerry Kill has very much installed a Jim Tressel / Mark Dantonio (until last year) blueprint of tough defense + running offense + special teams., 201476=Long story short - a lot of offense production needs to be replaced based on 2 NFL players leaving.   Can Kill's staff create new NFL players?  Probably.  Good staffs do that.  Is it going to happen overnight?  Doubtful based on how Minnesota recruits and what the backups did last year.  A typical Minn class will have all 3 stars in it.  I think these big production losses are a top reason Vegas is so dour on Minnesota's win total in 2015.   , 315138=Even winning two national titles, in 1953, 260479=\"Time is a Flat Football\" is a series of posts which will explore players from Michigan football history members of the 2015 team resembles the most. Tackled in these posts will be the offensive \"skill\" position groups: Quarterbacks, Running Backs, and Receivers/Tight Ends. My apologies go out to the offensive line, but it's very difficult to get o-line statistics, and more difficult to compare the groups. I used Python and Pandas almost exclusively for this quick trip to the past. Any \"predictions\" can be described as unscientific, but kind of fun., 6835=Unfortunately, I was finding conflicting data for the birth rates during the time when high school athletes for my parameters were being born so I'd rather not go off of that.  However, using the US Census estimates, I was able to get the number of 14-17 year old males in each state and compare to those playing in 2014., 318204=The 1976 team was shooting for UM's first back-to-back conference baseball titles since 1944-45., 157484=(3rd Saturday in Dec.), 156819=The College Football Final would be played at a host site that bid for the rights to host the game on the 2nd Sunday of January at 8:30pm ET., 317509=The 1975 team finished 28 and 12 overall, 13 and 3 in the conference, losing the NCAA regional final in Ypsilanti 2-1 to a loaded Eastern Michigan team, featuring Bob Welch and Bob Owchinko on the pitching staff, future Tiger Pat Sheridan in the outfield, and two more future major leaguers., 319023=After the pair of Boston Brave starters went 8 and 0 over a 12 day span in early September, 1948, a newspaperman wrote:, 323739=Ohio State rolled into town on Saturday, May 8 for two scheduled games, Weber to start the first and Sorensen the second., 148149=2015 Matchup, 303393=Ty Isaac is the outside challenger this year. After a decent freshman season with USC, Isaac transferred to Michigan, finally completing the Justin Fargas trade. Isaac's 2013 freshman season was similar to a few familiar names.  , 248515=UM rush off v Minn rush def - Adv: Wash.  UM needs to prove it has a run game and Minn has a decent front 7 even if their top LB is gone.   Tons of unknowns and mysteries - we'll know better by late October who has what., 148169=(From 2014 season), 154063=(From 2014 Season), 317135=Though his teams finished second in 1964, 1965, 1967, 1971 and 1973, and third place five other seasons, Moby's teams did not win the Big Ten title until 1975, Michigan's first since the 1961 Freehan team., 200321= Hopes are high this year for the Gophers in a weakened West, especially with the coaching turnover at Nebraska and Iowa being Iowa.  But despite a solid coaching staff and a good secondary (maybe the best in the Big 10?) it is difficult to see Minnesota as a team that just \"reloads\".  This is not Wisconsin where you replace one 1600 yard rusher with another.  Will they find an adequate RB?  Probably.  Will he be David Cobb?  Doubtful.  So that is 57% of their rushing yards they must replace. , 248786=UM pass off v Minn pass def - Adv: Minn.   While I like Rudock, the lack of UM WRs is the main issue I see in this matchup.   The ability to get separation vs a pair of potential NFL CBs could be a big issue and while Rudock can overcome that to some degree it's difficult to not give Minn the advantage, although lack of pass rush could expose their secondary if UM's OL holds up.  It is also worth nothing the Minnesota game was Rudock's worse of 2014 at Iowa (10/19, 89 yards, 1 INT)., 146888=Now, the idea that I think would be extra cool and would give us a lot more better matchups earlier in the season AND force schools to play teams of their own caliber, is the \"Challenge\" system.  Teams are matched up against teams from adjacently-seeded conferences for an early non-conference game, say in Week 1, 2, or 3.  The teams are matched up based upon the previous season's conference record.  The games will be at campus sites and will count just like any other game would.  Even seeds would host the games, so, for instance, the #2 seed from one conference would host the #1 team from another conference.  Every conference will participate except the Heartland 16 and the Sun Belt, since those conferences play 9 conference games.  The matchups will be set up accordingly shown in the tables below, and hypothetical matchups based upon the conclusion of the 2014 season are shown in those same tables. (Spoiler: some luscious matchups emerge.), 314437=This is a story of and from the 1976 UM baseball season., 289515=  Morris had a great season by all accounts. Most impressive was his 5.2 yards/carry and the first of three straight 1,000 yd seasons. The 1985 team went 10-1-1 and finished ranked #2 in the country, with Morris being a large part of the offense. Past Wolverines show Smith to be the running back in the most prime position to break out., 157392=(2nd Saturday in Dec.), 316302=The 1961 team won the Big Ten title, the first since the 1953 National Championship team, with sophomore Bill Freehan leading the way, but did not make it to the College World Series., 183461=Mitch Leidner was ... not a great QB.  He completed 51.5% for 1800 yards at 7.6 yds per attempt.  He had 11 TD and 8 INT.  One third of those yards went to TE star Maxx Williams who had 36 catches, resulting in 8 of Leidner's 11 TDs.   David Cobb in most conferences would have been a superlative running back but 2014 was a vintage year for Big 10 running backs (well not in Ann Arbor or Happy Valley but a lot of other places).   His 1600+ yards and 5.2 per carry average would make UM fans salivate and yearn for \"the old days\".   Leidner contributed another 450 yards of his own and back up QB Chris Streveler  was the 3rd leading rusher at 235 yards.   Those 3 had 83% of  rushing yards., 316163=and 1962., 278294=The 2001 team won 8 games and lost 4. Chris Perry split carries that year with B.J. Askew, who had a good season as well. At this point it's tough to see much separation between all four candidates for the feature back role. Barring a surprise breakout, this should translate to a running back by committee simply for the sake of fresh legs.  , 157687=(2nd Sunday of Jan.), 17934=I couldn't find hard data about younger football players.  The Wall Street Journal has reported that Pop Warner Football participation is down 6% since 2008.  My guess is that more parents are discouraging their children from playing during crucial brain development years, but then letting them make their own decision once they get to high school., 316615=After Freehan left to be a Tigers Bonus Baby, the 1962 team finished second in the conference, but won the College World Series., 340960=But a team with heart, none bigger than the the co- MVPs, Mark Weber, and, Lary Sorenson, the starter who risked his arm and his future, for the team, when he threw back to back complete game victories one weekend in the spring of 1976., 314743=Michigan baseball has a long tradition, being the oldest varsity sport, all the way back to that perfect 1866 team., 302827=The 2011 went 11-2 and won the Sugar Bowl. Shaw saw a small share of the rushing load with Denard, Fitz Toussaint, and junior Vincent Smith getting more carries. Carries were difficult to come by for Shaw behind these backs, a problem which will also be faced by Johnson.  , 337059=As in 1975, we won the rematch, this time, 9 to 3. McGinnis started, but was pulled with one out in the second inning, having surrendered the 3 Huron runs., 316873=Don Lund then left as manager for another job in the athletic department and Milbry (Moby) Benedict took over as manager until 1979., 318396=Following the 1976 season, Weber was named co-MVP with fellow starter Lary Sorensen, a junior, who entered the year with a 7 and 6 career record, and left after the season as a Milwaukee Brewers 8th round draft pick., 315347=\"1953 University of Michigan baseball team (national champions)\" by Rentschler's Studio (Ann Arbor, Mich.) - Bentley Historical Library, Item BBT1953 -- http://quod.lib.umich.edu/b/bhl/x-bbt1953/bbt1953. Licensed under Public Domain via Wikimedia Commons - https://commons.wikimedia.org/wiki/File:1953_University_of_Michigan_baseball_team_(national_champions).jpg#/media/File:1953_University_of_Michigan_baseball_team_(national_champions).jpg, 157300=(1st Saturday in Dec.)}",
    "lastModified": "Sat, 01 Aug 2015 18:19:21 GMT",
    "textBeforeTable": "  Michigan has an interesting mix of running backs this year. Junior backs Derrick Green and De'Veon Smith were highly rated coming out of high school, but neither have locked up the feature back role at this point. Drake Johnson is heading into his senior year after a promising junior season which unfortunately ended after a knee injury. Newly eligible Ty Isaac will be a RS sophomore after taking a year off following his transfer from USC. It's a crowded but talented backfield, and at this point, not much separates them. Let's take a look at their stats, gathered from sports-reference.com. Here are their stats throughout the years they have been active.     Disclaimer: Obviously caveats do apply here. These are namely the effects of other position groups, coaching, and style of offense on the players being analyzed. Also, the past probably has no bearing on what current players will do, unless you believe Rust Cohle. I plan to deal with these issues by completely ignoring them. It's the off season, people.   \"Time is a Flat Football\" is a series of posts which will explore players from Michigan football history members of the 2015 team resembles the most. Tackled in these posts will be the offensive \"skill\" position groups: Quarterbacks, Running Backs, and Receivers/Tight Ends. My apologies go out to the offensive line, but it's very difficult to get o-line statistics, and more difficult to compare the groups. I used Python and Pandas almost exclusively for this",
    "textAfterTable": "  We can also look at the totals for each player:     Yr Cls Player Rush Att Rush Yds Rush Avg Rush Td Rec Rec Yds Rec Avg Rec Td Plays Tot Yds Tot Avg Tot TD Tot 2014 2 Derrick Green 165 741 4.5 5 0 0 0 0 167 767 4.6 5 2014 2 De'Veon Smith 134 636 4.65 6 0 0 0 0 137 662 4.7 6 2014 3 Drake Johnson 60 361 6 4 1 11 11 0 61 372 6.1 4 2013 1 Ty Isaac 40 236 5.9 2 4 57 14.3 0 44 293 6.7 2     Green and Johnson were each having promising seasons last year before going down with injuries. De'Veon Smith put up a relatively good season, especially considering he spent most of the year splitting carries with Green and Johnson. Isaac's freshman year at USC was good for a freshman",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}