{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Blue posts around campus, a night shuttle from the parking lots. Write parking tickets for the stupidest things....",
            "Whatever you did in high school. Go visit friends at real colleges.",
            "NONE.",
            "Most of the classes are comparable to other college courses and require a good bit of work.",
            "Bucks provides a low cost college option for those looking to continue their education. However, it should not be anyone graduating from high school's first choice as you will wish you went somewhere else. A good choice for older people coming back to school, however I would not recommend it to college freshman or sophomores."
        ]
    ],
    "pageTitle": "Bucks County Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bucks-County-Community-College/reviews?_escaped_fragment_=/show/63904",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900854395,
    "recordOffset": 900816834,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{131518=© 2015, Cappex.com, LLC, 83933=Five classes for a semester would put you between $2000-2500 tuition., 114784=The school is great for what it costs. A semester with four classes is around $2000. The teachers are excellent as well which is what makes a great school.}",
    "textBeforeTable": "01/04/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 31 Erin from coopersburg, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Campus Safety Students get ID the first day they start at Bucks. The school also has security guards all over, and teacher to make sure your are in the right class. Greek Life Students will study the historical stages of the Hellenic-Greek World. The class teaches the development of the Bronze Age, Archaic, Classical, and Hellenistic societies of Ancient Greece. Clubs and Activities Theirs many clubs and activitys like Arts & Media, Faith Focused, Student Leadership/ Programming, Inactive Clubs (Students/ Advisors ), and so much more. Great for these types of students If you love diversity and meeting new people, and great sport bucks is the place for you. Share any unusual traditions or locations on campus I'm a freshman at buck and i play volleyball and found out are mascot is a centurion. What is it you ask a knight looking thing. Bang for the buck bucks is the best school I've ever been to. With great people , and teacher who care. Come on done and give us a try. What to do for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}