{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "could be bigger",
            "there aren't any dorms that i am aware of",
            "they offer a lot of help for students and you should really take them up on their offer. it can really help.",
            "Irvine Valley is absolutely amazing! The professors there really take an interest in all the students. The environment is so welcoming and vibrant and fun"
        ]
    ],
    "pageTitle": "Irvine Valley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Irvine-Valley-College/reviews?_escaped_fragment_=/show/17750",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897938043,
    "recordOffset": 897886118,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{74786=Really low. Some teachers in more major based classes expect hard work but most others have very low standards of work for students. It's very possible to still receive an A on a general ed paper without sticking to your thesis, using sentence fragments and poor grammar., 235415=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/18/2011 Reviewer is A current student here. 3 out of 5 people found this review useful. 1 of 56 Jennifer from Irvine, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Comments Great for these types of students Students that want to better their future, planning to broaden their horizon. Also IVC has an awesome accounting program and many other so check them out. Tips for prospective students Great community college for future transferring student looking to go into a 4 year university. Bang for the buck Going to IVC is really affordable attending the college is a benefit to your pockets. Did enjoy being here The IVC campus is great lots of exciting people there to meet many great teachers to teach and many books to be opened and read. Class rooms are enormous. Did learn a lot Starting my freshman year at IVC was nerve wreck never the less enjoyed my experience the school provided learned more in a few weeks and a pace that was comfortable but at the same time enlightened. Login to rate or flag the reviews Jonathan from Irvine, CA 05/28/2012 Reviewer is A current student",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}