{
    "relation": [
        [
            "Industry",
            "Total, All Industries",
            "Agriculture, Forestry, Fishing & Hunting",
            "Mining",
            "Construction",
            "Manufacturing",
            "Utilities",
            "Wholesale Trade",
            "Retail Trade",
            "Transportation and Warehousing",
            "Information",
            "Finance and Insurance",
            "Real Estate and Rental and Leasing",
            "Professional and Technical Services",
            "Management of Companies and Enterprises",
            "Administrative and Waste Services",
            "Educational Services",
            "Health Care and Social Assistance",
            "Arts, Entertainment, and Recreation",
            "Accommodation and Food Services",
            "Other Services, Ex. Public Admin",
            "Public Administration"
        ],
        [
            "Establish- ments",
            "4,816",
            "29",
            "8",
            "596",
            "171",
            "14",
            "128",
            "692",
            "98",
            "89",
            "166",
            "140",
            "354",
            "15",
            "250",
            "92",
            "398",
            "109",
            "489",
            "821",
            "157"
        ],
        [
            "Total Wages",
            "$2,340,412,497",
            "$3,979,245",
            "$6,023,640",
            "$138,296,886",
            "$299,567,000",
            "$23,858,251",
            "$39,815,957",
            "$215,528,707",
            "$39,647,467",
            "$41,785,228",
            "$114,037,295",
            "$19,772,993",
            "$163,734,693",
            "$17,489,855",
            "$74,389,528",
            "$304,530,714",
            "$496,134,129",
            "$44,026,587",
            "$118,497,302",
            "$75,949,953",
            "$103,347,066"
        ],
        [
            "Average Employment",
            "60,540",
            "177",
            "108",
            "2,956",
            "4,910",
            "313",
            "902",
            "8,469",
            "1,119",
            "1,014",
            "2,042",
            "624",
            "2,575",
            "222",
            "2,082",
            "7,352",
            "11,453",
            "1,870",
            "6,844",
            "3,068",
            "2,440"
        ],
        [
            "Average Weekly Wage",
            "$743",
            "$432",
            "$1,073",
            "$900",
            "$1,173",
            "$1,466",
            "$849",
            "$489",
            "$681",
            "$792",
            "$1,074",
            "$609",
            "$1,223",
            "$1,515",
            "$687",
            "$797",
            "$833",
            "$453",
            "$333",
            "$476",
            "$815"
        ]
    ],
    "pageTitle": "iBerkshires.com - The Berkshires online guide to events, news and Berkshire County community information.",
    "title": "",
    "url": "http://www.iberkshires.com/blogs/thewatercooler?user_id=6422&cat=133&page=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 510639591,
    "recordOffset": 510615910,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{68617=The Massachusetts unemployment rate remains below the national rate, which is 9.0 percent. In April, the number of Massachusetts residents employed grew and those unemployed decreased resulting in a decline in the unemployment rate. Trends for the labor force, unemployed residents, employed residents, the unemployment rate and jobs continue to indicate improvement for the Commonwealth's economy., 20422=BOSTON — Pittsfield saw its seasonally unadjusted unemployment rate drop to 7 percent during the month of July, compared to 7.8 percent jobless rate statewide. The Executive Office of Labor and Workforce Development reported Tuesday that the July seasonally unadjusted unemployment rates were down not only in Pittsfield but also in the Framingham, Lawrence-Methuen-Salem, Peabody, Barnstable, Amherst, Great Barrington, Nantucket and Tisbury areas; unchanged in the Boston-Cambridge-Quincy, Worcester and North Adams areas and up in the remaining 10 areas. The Pittsfield area also had the largest over-the-year growth rate at 5.4 percent followed by the Worcester area, at 3.7 percent.   In Pittsfield, out of a work force of 41,773, 38,830 were employed. The metropolitan area had a jobless rate of 7.3 in June; a year ago, the rate was 7.9 compared to the statewide jobless rate of 8.5 Great Barrington jobless rate was 5.4 percent, down from 5.6 in June and 6.0 from a year ago. North Adams remained the same at 8.8 percent, although that is still down from 9.4 percent a year ago. Some 1,554 were out of work in July out of a work force of 17,647. Statewide, the July seasonally unadjusted unemployment rate remained unchanged at 7.8 percent.   Over-the-year, unemployment rates were lower in 21 areas and unchanged in one area. The state unadjusted unemployment rate was down 0.7 of a percentage point from the 8.5 percent rate in July 2010.   The Barnstable and Pittsfield areas had continued strong seasonal job growth rates at 3.6 and 3.2 percent respectively. Over-the-month, Other Services jobs increased in all 12 areas, while Leisure and Hospitality jobs increased in eight of the areas.   The statewide seasonally adjusted jobs estimate released on Aug. 18 showed a 12,700 job gain. The seasonally adjusted statewide July unemployment rate remained unchanged at 7.6 percent for the third consecutive month and was down 0.8 of a percentage point from the 8.4 percent rate recorded in July 2010. The Massachusetts statewide seasonally adjusted unemployment rate remains well below the national rate of 9.1 percent.   The unadjusted unemployment rates and job estimates for the labor market areas reflect seasonal fluctuations and therefore may show different levels and trends than the statewide seasonally adjusted estimates.   The August 2011 unemployment rate, labor force data and jobs estimates for Massachusetts will be released on Sept. 15, 2011; local unemployment statistics will be released on Sept. 20, 2011. For more information: www.mass.gov/lmi., 73597=BOSTON — Unemployment declined again across the state and was down about a half point from last year at this time. The Pittsfield metro area lost jobs in February, .3 percent, but its unadjusted unemployment rate is still lower than this time last year. The Executive Office of Labor and Workforce Development reported that the February seasonally unadjusted unemployment rates were down in 19 labor market areas; up in one area, Fall River; and unchanged in Nantucket and Tisbury. Statewide, the February seasonally unadjusted unemployment rate was 8.7 percent, a decrease of 0.2 of a percentage point from the revised January rate of 8.9 percent.   Over-the-year, unemployment rates were lower in 20 of the 22 areas. The Amherst and Tisbury rates were up. Over-the-year, the state unadjusted unemployment rate was down 0.6 of a percentage point from the 9.3 percent rate in February 2010.   In February, over-the-month jobs gains occurred in four of the areas for which job estimates are published. They were Boston-Cambridge-Quincy; Springfield; New Bedford; and Worcester areas.  Over-the-year job gains were realized in 10 of the areas while two had a loss. Job gains occurred in the Boston-Cambridge-Quincy, Worcester, Springfield, New Bedford, Barnstable, Brockton-Bridgewater-Easton, Haverhill-North-Andover-Amesbury, Framingham, Pittsfield and Leominster-Fitchburg-Gardner areas. The Peabody and Lowell-Billerica-Chelmsford areas lost jobs.   The statewide seasonally adjusted jobs estimate released on March 17 showed a 15,400 job gain. The seasonally adjusted statewide February unemployment rate of 8.2 percent was down 0.1 of a percentage point over-the-month and down 0.6 of a percentage point from the 8.8 percent rate in February 2010.  The Massachusetts statewide seasonally adjusted unemployment rate remains well below the national rate of 8.9 percent.   The unadjusted unemployment rates and job estimates for the labor market areas reflect seasonal fluctuations and therefore may show different levels and trends than the statewide seasonally adjusted estimates.   The March 2011 unemployment rate, labor force data and jobs estimates for Massachusetts will be released on April 14, 2011; local unemployment statistics will be released on April 19, 2011.  Detailed labor market information is available at www.mass.gov/lmi., 68043=Job gains occurred in Leisure and Hospitality; Trade, Transportation, and Utilities; Education and Health Services; Manufacturing; Professional, Scientific, and Business Services; Financial Activities; Construction; Information; and Mining and Logging. Government and Other Services lost jobs. The April job gain follows a revised 1,300 jobs loss in March, previously reported as a 3,200 job gain. Over-the-year, jobs are up 40,800 (+1.3 percent) with private sector jobs up 47,200 (+1.7 percent). Since January 2011, 34,200 jobs have been added in the Commonwealth., 27759=BOSTON — The Executive Office of Labor and Workforce Development reported Thursday that the preliminary July job estimates show an increase of 12,700 jobs, for a total of 3,246,800 jobs in Massachusetts. The private sector gained 11,600 jobs. The July total unemployment rate remained at 7.6 percent, well below the national rate of 9.1 percent.   Six of the 10 private sectors added jobs in July with the largest over the month gains in Education and Health Services; Other Services; Trade, Transportation and Utilities; Manufacturing; Professional and Business Services; and Financial Activities. The July job gain follows a revised 9,400 job gain in June, previously reported as a 10,400 job gain.   Over-the-year (July 2010 to July 2011), jobs are up 56,800, for a growth rate of 1.8 percent. Private sector jobs are up 61,900, a growth rate of 2.2 percent, with gains in nine of the 10 sectors. Year-to-date, (December 2010 to July 2011), 53,000 jobs have been added in the Bay State with 58,200 jobs in the private sector. The biggest gains were in education and health services (3,000 for a .4 percent gain). Over-the-year, this sector has added 17,300 (up 2.6 percent) jobs with health care and social assistance gaining 15,000 (up 3 percent) and educational services 2,300 (1.4 percent). Also up were other services, primarly seasonal help, which is occurring later in the season and at higher levels.   Trade, transportation, and utilities gained 2,900 jobs, manufacturing gained 2,400 jobs. Construction, however, lost 1,500 jobs (down 1.4 percent) following a 1,900 job gain in June.  This sector had posted job gains in each of the previous four months. Over-the-year, this sector has added 2,100 (2 percent) jobs with gains in all component industries.   The July estimates show 3,208,700 Massachusetts residents were employed and 263,400 were unemployed, for a total labor force of 3,472,100. Since October 2009, there are 40,300 more residents employed and 41,000 fewer residents unemployed as the labor force decreased by 700. Local area unemployment statistics for July 2011 will be released on Tuesday, Aug. 23., 34848=The Executive Office of Labor and Workforce Development is reporting a seasonally unadjusted unemployment rate for June of  7.8 percent, up 0.4 of a percentage point from the revised May rate of 7.4 percent.  A statement from the office says that reflects seasonal increases in the number of residents entering and re-entering the labor force., 35209=Berkshire County overall added more than 2,000 jobs over the month of May, and has 1,300 fewer jobless claims than January of this year. The county also is down from January's unemployment rate of 9.2 and has seen a decrease of more than a point from last year's average unemployment rate of 8.2., 34655=NORTH ADAMS, Mass. — The latest state jobless rates show Berkshire County falling within the state average for the month of June with a seasonally unadjusted rate of 7.3 percent., 67431=BOSTON — The Executive Office of Labor and Workforce Development reported today that the total unemployment rate in April was 7.8 percent, down 0.2 of a percentage point from the 8.0 percent March rate. The preliminary April job estimates show 3,228,000 jobs in Massachusetts, an increase of 19,500 jobs. The private sector added 20,500 jobs.}",
    "textBeforeTable": "2009 Average Employment and Wages by Industry     All Ownership is available for this area. Download an Excel file with the data Occupational Wage Data  2.9    2,068    68,092    70,160    2000   Average  3.5    2,492    68,590    71,082    2001   Average  4.6    3,311    69,395    72,706    2002   Average  5.1    3,696    68,958    72,654    2003   Average  4.7    3,420    68,705    72,125    2004   Average  4.4    3,161    69,485    72,646    2005   Average  4.3    3,175    70,292    73,466    2006   Average  4.4    3,191    69,810    73,000    2007   Average  5.1    3,736    69,400    73,136    2008   Average",
    "textAfterTable": "Cities and Towns in Berkshire County WIA Largest Employers in Berkshire County WIA   Write a comment - 0 Comments       Tags: unemployment, statistics       State Jobless Rate Drops for April By: Department of Unemployment Assistance On: 11:39AM / Thursday May",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}