{
    "relation": [
        [
            "Player/Year",
            "Zimmermann",
            "Garza",
            "Sanchez"
        ],
        [
            "Career MLS",
            "3.154",
            "3.149",
            "3.099"
        ],
        [
            "Platform ERA",
            "2.94",
            "3.91",
            "3.55"
        ],
        [
            "Career ERA",
            "3.47",
            "3.97",
            "3.86"
        ],
        [
            "Platform QS %",
            "75%",
            "56%",
            "38%"
        ],
        [
            "Career QS %",
            "59%",
            "51%",
            "45%"
        ],
        [
            "Platform WARP",
            "3.5",
            "0.6",
            "0.7"
        ],
        [
            "Career WARP",
            "6.8",
            "6.4",
            "2.2"
        ],
        [
            "Next Salary",
            "$5.8M request",
            "$5.95M",
            "$1.25M"
        ]
    ],
    "pageTitle": "Baseball Prospectus | Arbitration Showdown: Mock Hearing: Jordan Zimmermann",
    "title": "",
    "url": "http://www.baseballprospectus.com/article.php?articleid=19426",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 322873967,
    "recordOffset": 322842710,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{37922=Though Gonzalez won more decisions, he enjoyed considerably more run support. Washington scored an average of 5.4 runs in his starts. Only six pitchers in baseball received more. Zimmermann, on the other hand, received an average of 4.9 runs of support in his starts (15th in the majors), nearly half a run less. In fact, Baseball Prospectus’ WARP places nearly identical values on Gonzalez and Zimmermann. Gonzalez’s extension will pay him $6.35 million in 2013, $1.15 million more than the $5.2 million midpoint in this case. With Zimmermann healthy and his innings no longer limited, he has proven to be just as productive as both Gonzalez and Garza. An award of $5.8 million for Zimmermann would bring his salary into line with his peers. —Jeff Euston, 32779=Zimmermann 2012, 72194=In June, Zimmermann told David Laurila:, 17876=In 2012, Jordan Zimmermann established himself as one of the best young starting pitchers in the game, a key piece of the top pitching staff in the National League. At just 26 years old, he joined Stephen Strasburg and Gio Gonzalez in anchoring one of baseball’s best young starting rotations and leading the Nationals to the postseason. Zimmermann is deserving of his $5.8 million salary request in light of his contribution to the team’s division title, his production both in 2012 and for his career, and his performance compared to pitchers in his service class., 10694=It's salary arbitration season in Major League Baseball, and here at Baseball Prospectus we're holding mock hearings, arguing for or against the actual team/player filing figures before a three-person panel of certified arbitrators. We've selected 10 of this winter's most intriguing, highest-dollar cases to cover in depth over the first two weeks of February (regardless of whether the players' real-life cases remain unsettled). After each side's opening argument and rebuttal/summation below, we'll give you a chance to vote on what you think the result should be before seeing the panel's decision. For more on the arbitration process, read the series intro by Atlanta Braves Assistant GM John Coppolella, listen to his appearance on Episode 35 of Up and In, or check out the BP Basics introduction to arbitration., 55653=Zimmermann is a frontline pitcher who has had one injury, not a long history of nagging physical problems. Before his surgery, he had one start pushed back three days because of elbow soreness. His ligament replacement surgery was performed on August 18, 2009, and by August 26, 2010, he was back on the mound in Washington. He has not missed a start due to injury since., 24586=2012 Fastball Velocity Leaders, 69082=Zimmermann’s 2012 was not only the more valuable season—his WARP would have led 22 teams' pitching staffs—but the more overlooked. Unlike Cain in 2009, he wasn’t even an All-Star, despite a 2.61 ERA in 110 1/3 first-half innings. In part, that’s a product of the pitch-to-contact profile, which tends to attract less attention. But Cain has gotten a lot more love from the voters in recent seasons without drastically altering his approach. It’s helped that his team has won two World Series, that he pitched a perfect game, and that Lincecum isn’t what he once was. But it’s also a reflection of the fact that he’s solidified his status as one of baseball’s most prolific pitchers, reaching or blowing by the 200-inning mark in six straight seasons., 22080=Zimmermann’s marks for starts, quality starts, and ERA were career highs, as were his 12 victories and 195.7 innings pitched. He set a team record by pitching at least six innings in each of his first 21 outings of the season, a streak that matched San Francisco’s Ryan Vogelsong and Detroit’s Cy Young Award winner Justin Verlander for the longest in baseball in 2012. His six-game winning streak (from June 27 to August 9) tied Strasburg for the team’s longest of the season, and in only one start did he allow more than four earned runs., 37110=Gonzalez 2012, 7813=February 13, 2013, 30658=Zimmerman’s $5.8 million request is in line with recent salaries for starting pitchers with three-plus years of service who are second-time arbitration-eligibles. Specifically, it is commensurate with Matt Garza’s $5.95 million salary for 2010, a platform season that did not measure up to Zimmermann’s in 2012., 68222=The only other pitcher to do the same in the last several seasons is Matt Cain, who’s a lot like Zimmermann in some other respects. Both are right-handers with similar heights and builds. Both throw the same assortment of five pitches at roughly similar rates (Zimmermann uses his changeup more often). Both throw hard with excellent control, but neither gets many strikeouts. Both Cain in 2009 and Zimmermann in 2012 had modest win totals and were overshadowed by other pitchers on their own staffs—in Cain’s case, Tim Lincecum, who won the Cy Young that season, and in Zimmermann’s, Gio Gonzalez (who finished third) and Stephen Strasburg., 99617=Copyright © 1996-2015 Baseball Prospectus, LLC.            Surprise Me!, 28134=In addition, Zimmermann is one of the better hitting pitchers in the game, with three extra-base hits (a home run and two doubles) in 2012. His offensive statistics ranked highly among the 82 pitchers with 30 or more plate appearances in 2012, as the following chart illustrates., 84557=Strasburg's average fastball velocity in 2012 didn't make the top 10 list?, 27468=Zimmermann’s 2011 season featured a streak of 11 consecutive quality starts and an outstanding 3.18 ERA, which ranked 10th in the league. He did not pitch in September, as the Nationals limited him to 161 innings as a precaution in his first full season after surgery. Nevertheless, Washington manager Davey Johnson told SB Nation he thought “Zimmermann was arguably my best pitcher” in 2011 and noted that his successful recovery served as a template for Strasburg, who had the same ligament-replacement surgery in late 2011., 61987=Second, it's important to note that while Zimmermann is an outstanding young pitcher, he had the benefit of a great defense behind him in 2012. Washington's defense ranked fifth in the majors in defensive efficiency, a measure of the percentage of balls put in play by opposing batters that a team converts into outs. Not only that, but Adam LaRoche, the Nationals’ first baseman, won the National League Gold Glove award, and Ryan Zimmerman, the team’s third baseman, is a previous winner of the award. Meanwhile, six of Washington's fielders received votes at their positions for the Fielding Bible awards. Zimmermann is a good pitcher, but he had an unusual amount of defensive support., 33623=Garza 2010, 67535=Cy Young voters like low ERAs, high winning percentages and, just as importantly, innings, the active ingredient that makes the first two stats (more) meaningful. But they don’t like Jordan Zimmermann, judging by 2012. From 2006-12, there were 42 pitcher-seasons with an ERA no higher than 3.00, a winning percentage no lower than .600, and at least 190 innings pitched. In 40 of those seasons, the pitcher responsible finished no lower than (and usually much higher than) ninth in his league’s Cy Young voting. Last season, Zimmermann pitched (for a playoff team) to a 2.94 ERA in 195 2/3 innings, winning 12 out of 20 decisions, without receiving a single Cy Young vote., 66991=In 2010 he suffered an arm injury and had Tommy John surgery on his elbow. His return in 2011 was strong, pitching 161 innings with an ERA of 3.18, and his 2012 was even better. Notwithstanding all of that, I think a doubling of his salary to $4.6 million is sufficient and $5.8 million too much of a reach. —Burt Fendelman, 34434=Zimmermann posted an ERA nearly a full run better than Garza’s, and he allowed 10 fewer home runs and made six more quality starts. The Baseball Prospectus valuation tool, Wins Above Replacement Player (WARP)—measuring the number of wins the pitcher contributed above what a freely available pitcher would have provided—gives Zimmermann’s platform year a decided advantage. Yet his request of $5.8 million is $150,000 less than Garza’s 2011 salary of $5.95 million., 73339=There’s some evidence to suggest that in his quest to induce contact, Zimmermann has been throwing both too many strikes and too many fastballs. Only three qualified starters threw a higher percentage of four-seamers than Zimmermann’s 61 percent last season. To be fair, one of those pitchers was Clayton Kershaw, who seems to be doing okay. But Kershaw’s four-seamer isn’t thrown in the zone as often, and it has the most vertical movement among the 52 starters who threw the pitch 1000 times last season. Zimmermann’s has the 11th-least., 56039=As a precaution, the Nationals limited Zimmermann’s pitch count during his 2010 and 2011 starts, reducing how deep into each game he could pitch. The club also capped his season-long innings total for 2011. After he passed the 160-inning mark in late August, the club voluntarily shut him down for the year, a decision that cost him five starts and at least 30 innings. He was not injured, but Zimmermann accepted this conservative approach despite the fact it hurt his future earning potential., 74715=In 2009, Cain threw his four-seamer 58 percent of the time; last season, he threw it only 48 percent of the time. In 2009, he threw strikes 53.2 percent of the time; last season, he threw them only 51.6 percent of the time. He’s a better pitcher because of it. The secret to Cy Young votes for Zimmermann, then, might be simple: be even more like Matt Cain. —Ben Lindbergh  , 22939=In July, Zimmermann won the NL Pitcher of the Month award, allowing just four earned runs in 37 innings. In his six July starts, he posted a 4-0 record and led the major leagues with a dominant 0.97 ERA. He tied for the NL lead in victories and led the league in fewest walks and hits allowed per inning with a WHIP of 0.84. He was the third Nationals pitcher to receive the monthly honor in 2012, following Strasburg (April) and Gonzalez (May). He capped his season by starting Game Two of the NL Division Series for Washington, then pitching in with a crucial relief appearance in Game Four., 23547=Zimmermann’s durability and consistency were all the more impressive because 2012 marked his first season pitching without innings limits put in place for 2011, his first full campaign after 2009 ligament replacement surgeron his right elbow. Zimmermann’s 2012 average fastball velocity of 93.9—sixth-highest among major-league starters—indicates that his arm is healthy. And though control often presents difficulty for pitchers returning from surgery, Zimmermann’s has been excellent. In the last two seasons, he walked just 74 hitters in 357 innings. His strikeout-to-walk ratio ranked seventh in the NL in that period, and his 3.05 ERA in 2011-12 was 12th in baseball. Overall, since returning from surgery, Zimmerman has posted a 21-21 record with a 3.20 ERA in 65 starts. The Nationals have a winning percentage of .569 (37-28) in his starts during that stretch., 60852=A pitcher’s innings totals, while important, are not the only factor in determining his value. It’s the quality of performance that distinguishes a frontline pitcher from a reliable “innings eater,” both on the field and in the market. Since his return in 2010, Zimmermann has provided both quality and quantity, both high-level production and consistency. His performance merits a salary award of $5.8 million. —Jeff Euston, 61521=First, although we inadvertently rebutted the Garza comparison in our own presentation, we'd like to raise the point again: Garza, whom the Zimmermann team is using as a comparison, had almost 250 more innings through 2010 than Zimmermann does. This process doesn't just consider the platform year, but the player's entire body of work. Under such circumstances, it's hard to take any claim that says both contributed to their teams equally seriously., 62917=Third, Gonzalez's contract is a questionable reference point since he signed it before the 2012 season, so his performance after the extension has little impact on his salary during the life of the contract., 18661=The Nationals pitching staff led the NL in ERA in 2012 with a mark of 3.33, more than a half a run below the league average of 3.95. Washington starting pitchers also ranked fifth in baseball with 97 quality starts (outings of at least six innings pitched and no more than three earned runs). Zimmermann was a team leader in each of these important categories, ranking second in the rotation in ERA (2.94) and first in quality starts with 24. In fact, among the 88 qualifying starting pitchers in the majors, Zimmermann ranked highly in several statistical categories, as the following chart shows.}",
    "lastModified": "Fri, 31 Jul 2015 19:30:50 GMT",
    "textBeforeTable": "The Nationals pitching staff led the NL in ERA in 2012 with a mark of 3.33, more than a half a run below the league average of 3.95. Washington starting pitchers also ranked fifth in baseball with 97 quality starts (outings of at least six innings pitched and no more than three earned runs). Zimmermann was a team leader in each of these important categories, ranking second in the rotation in ERA (2.94) and first in quality starts with 24. In fact, among the 88 qualifying starting pitchers in the majors, Zimmermann ranked highly in several statistical categories, as the following chart shows. In 2012, Jordan Zimmermann established himself as one of the best young starting pitchers in the game, a key piece of the top pitching staff in the National League. At just 26 years old, he joined Stephen Strasburg and Gio Gonzalez in anchoring one of baseball’s best young starting rotations and leading the Nationals to the postseason. Zimmermann is deserving of his $5.8 million salary request in light of his contribution to the team’s division title, his production both in 2012 and for his career, and his performance compared to pitchers in his service class. Player's Presentation     Position: RHP DOB: 05/23/1986 Bats/Throws: R/R Service Time: 3 years, 154 days R.J. Anderson Represented By: ​ $4.6 million Club Offer:",
    "textAfterTable": "1. David Price 95.5 2. Jeff Samardzija 95.0 3. Matt Moore 94.4 4. Justin Verlander 94.3 5. Max Scherzer 94.2 6. Jordan Zimmermann 93.9 7. Edinson Volquez 93.6 8. Edwin Jackson 93.5 9. Henderson Alvarez 93.3 10. Clayton Kershaw 93.2 Zimmermann’s 2011 season featured a streak of 11 consecutive quality starts and an outstanding 3.18 ERA, which ranked 10th in the league. He did not pitch in September, as the Nationals limited him to 161 innings as a precaution in his first full season after surgery. Nevertheless, Washington manager Davey Johnson told SB Nation he thought “Zimmermann was arguably my best pitcher” in 2011 and noted that his successful recovery served as a template for Strasburg, who had the same ligament-replacement surgery in late 2011. In addition, Zimmermann is one of the better hitting pitchers in the game, with three",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}