{
    "relation": [
        [
            "Citing Patent",
            "US7581225",
            "US7886269",
            "US8015483",
            "US8046737",
            "US8108799",
            "US8132148",
            "US8201147",
            "US8250530",
            "US8275793",
            "US8336027",
            "US8418132 *",
            "US8578350",
            "US8612852 *",
            "US8756515 *",
            "US8805887 *",
            "US8949785 *",
            "US20050055634 *",
            "US20080127215 *",
            "US20090150907 *",
            "US20100088350 *",
            "US20130159970 *",
            "EP1939735A1 *",
            "WO2008121474A1 *"
        ],
        [
            "Filing date",
            "Feb 23, 2006",
            "Feb 23, 2006",
            "Feb 6, 2007",
            "Feb 23, 2006",
            "Mar 30, 2007",
            "Feb 23, 2006",
            "Feb 8, 2008",
            "May 27, 2009",
            "Feb 23, 2006",
            "May 27, 2009",
            "Feb 23, 2006",
            "Nov 30, 2006",
            "Sep 30, 2003",
            "Dec 14, 2009",
            "Oct 22, 2008",
            "Dec 15, 2011",
            "Sep 30, 2003",
            "Jan 25, 2007",
            "Dec 7, 2007",
            "Oct 22, 2008",
            "Dec 15, 2011",
            "Oct 9, 2007",
            "Feb 28, 2008"
        ],
        [
            "Publication date",
            "Aug 25, 2009",
            "Feb 8, 2011",
            "Sep 6, 2011",
            "Oct 25, 2011",
            "Jan 31, 2012",
            "Mar 6, 2012",
            "Jun 12, 2012",
            "Aug 21, 2012",
            "Sep 25, 2012",
            "Dec 18, 2012",
            "Apr 9, 2013",
            "Nov 5, 2013",
            "Dec 17, 2013",
            "Jun 17, 2014",
            "Aug 12, 2014",
            "Feb 3, 2015",
            "Mar 10, 2005",
            "May 29, 2008",
            "Jun 11, 2009",
            "Apr 8, 2010",
            "Jun 20, 2013",
            "Jul 2, 2008",
            "Oct 9, 2008"
        ],
        [
            "Applicant",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Ncr Corporation",
            "Oracle International Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Oracle International Corporation",
            "Mitsubishi Electric Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "NCR Corporation",
            "Microsoft Corp"
        ],
        [
            "Title",
            "Multithreading with concurrency domains",
            "XML application framework",
            "Processing an XML feed with extensible or non-typed elements",
            "XML application framework",
            "Remoting of windows presentation framework based applications in a non-composed desktop",
            "XML application framework",
            "Generic XAD processing model",
            "Composite values for declarative language applications",
            "Transaction transforms",
            "Hierarchical view state storage",
            "Application description language",
            "System and method for interpreting a specification language file to implement a business system",
            "Omniportlet-declaratively publish data in a portal without code",
            "Dynamic editors for functionally composed UI",
            "Packaging system to facilitate declarative model-driven development",
            "Custom compound types in declarative programs",
            "Omniportlet-declaratively publish data in a portal without code",
            "Software creating method",
            "Mapping between disparate data models via anonymous functions",
            "Packaging system to facilitate declarative model-driven development",
            "Custom compound types in declarative programs",
            "System and method for interpreting a specification language file to implement a business system",
            "Remoting of windows presentation framework based applications in a non-composed desktop"
        ]
    ],
    "pageTitle": "Patent US20060248112 - Application description language - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20060248112?ie=ISO-8859-1&dq=2040248",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472335987,
    "recordOffset": 472296961,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6454=Given that the present invention may be implemented as a computer system, FIG. 7 is provided to illustrate an example of a suitable computing system environment on which embodiments of the invention may be implemented. In its most basic configuration, system 2000 includes at least one processing unit 2002 and memory 2004. Depending on the exact configuration and type of computing device, memory 2004 may be volatile (such as RAM), non-volatile (such as ROM, flash memory, etc.) or some combination of the two. This most basic configuration is illustrated in FIG. 20 by dashed line 2006.}",
    "TableContextTimeStampAfterTable": "{26442=This patent application is also related to and filed concurrently with U.S. patent application Ser. No. ______, entitled “Multithreading with Concurrency Domains,” bearing attorney docket number 14917.0258USU1/MS310186.01; U.S. patent application Ser. No. ______, entitled “Application Framework Phasing Model,” bearing attorney docket number 14917.0258USU2/MS310224.01; U.S. patent application Ser. No. ______, entitled “XML Application Framework,” bearing attorney docket number 14917.0258USU3/MS311586.01; and U.S. patent application Ser. No. ______, entitled “Transaction Transforms,” bearing attorney docket number 14917.0258USU5/MS311262.01; U.S. patent application Ser. No. ______, entitled “XML Application Framework”, bearing attorney docket number 14917.0258USU6/MS316537.01; U.S. patent application Ser. No. ______, entitled “XML Application Framework”, bearing attorney docket number 14917.0258USU7/MS316538.01; U.S. patent application Ser. No. ______, entitled “XML Application Framework”, bearing attorney docket number 14917.0258USU8/MS316539.01; which are assigned to the same assignee as the present application and expressly incorporated herein, in their entirety, by reference., 172213=In addition to the memory 2004, the system may include at least one other form of computer-readable media. Computer-readable media can be any available media that can be accessed by the system 2000. By way of example, and not limitation, computer-readable media might comprise computer storage media and communication media., 173526=System 2000 may also contain a communications connection(s) 2012 that allow the system to communicate with other devices. The communications connection(s) 2012 is an example of communication media. Communication media typically embodies computer readable instructions, data structures, program modules or other data in a modulated data signal such as a carrier wave or other transport mechanism and includes any information delivery media. The term “modulated data signal” means a signal that has one or more of its characteristics set or changed in such a manner as to encode information in the signal. By way of example, and not limitation, communication media includes wired media such as a wired network or direct-wired connection, and wireless media such as acoustic, RF, infrared and other wireless media. The term computer readable media as used herein includes both storage media and communication media., 174504=In accordance with an embodiment, the system 2000 includes peripheral devices, such as input device(s) 2014 and/or output device(s) 2016. Exemplary input devices 2014 include, without limitation, keyboards, computer mice, pens, or styluses, voice input devices, tactile input devices and the like. Exemplary output device(s) 2016 include, without limitation, devices such as displays, speakers, and printers. For the purposes of this invention, the display is a primary output device. Each of these devices is well know in the art and, therefore, not described in detail herein., 172596=Computer storage media includes volatile and nonvolatile, removable and non-removable media implemented in any method or technology for storage of information such as computer readable instructions, data structures, program modules or other data. Memory 2004, removable storage 2008, and non-removable storage 2010 are all examples of computer storage media., 173020=Computer storage media includes, but is not limited to, RAM, ROM, EPROM, EEPROM, flash memory or other memory technology, CD-ROM, digital versatile disks (DVD) or other optical storage, magnetic cassettes, magnetic tape, magnetic disk storage or other magnetic storage devices, or any other medium which can be used to store the desired information and which can accessed by system 2000. Any such computer storage media may be part of system 2000., 25874=This patent application claims priority to U.S. Patent Application Ser. No. 60/676,137 filed Apr. 29, 2005 and entitled “Application Description Language,” and U.S. Patent Application Ser. No. 60/703,220 filed Jul. 28, 2005 and entitled “Markup Language Based Application Framework with Application Description Language, Concurrency Domains, Application Framework Phasing Models, and Application Framework Transaction Transforms”, the disclosures of which are expressly incorporated herein, in their entirety, by reference.}",
    "textBeforeTable": "Patent Citations The various embodiments described above are provided by way of illustration only and should not be construed to limit the invention. Those skilled in the art will readily recognize various modifications and changes that may be made to the present invention without following the example embodiments and applications illustrated and described herein, and without departing from the true spirit and scope of the present invention, which is set forth in the following claims. As discussed above, XAD offers progressive levels of abstraction to assist in design, strong typing, a high degree of static checking, and a high degree of extensibility. XAD also allows manipulation of heterogeneous data. With the computing environment in mind, the previous figures were described with reference to logical operations being performed to implement processes embodying various embodiments of the present invention. As will be appreciated by those skilled in the art, these logical operations are implemented (1) as a sequence of computer implemented steps or program modules running on a computing system and/or (2) as interconnected machine logic circuits or circuit modules within the computing system. The implementation is a matter of choice dependent on the performance requirements of the computing system implementing the invention. Accordingly, the logical operations making up the embodiments of the present invention described herein are referred to variously as operations, structural devices, acts or modules. It",
    "textAfterTable": "System and method for interpreting a specification language file to implement a business system US8612852 * Sep 30, 2003 Dec 17, 2013 Oracle International Corporation Omniportlet-declaratively publish data in a portal without code US8756515 * Dec 14, 2009 Jun 17, 2014 Microsoft Corporation Dynamic editors for functionally composed UI US8805887 * Oct 22, 2008 Aug 12, 2014 Microsoft Corporation Packaging system to facilitate declarative model-driven development US8949785 * Dec 15, 2011 Feb 3, 2015 Microsoft Corporation Custom compound types in declarative programs US20050055634 * Sep 30, 2003 Mar 10, 2005 Oracle International Corporation Omniportlet-declaratively publish data in a portal without code US20080127215 * Jan 25, 2007 May 29, 2008 Mitsubishi Electric Corporation Software creating method US20090150907 * Dec 7, 2007 Jun 11, 2009 Microsoft Corporation Mapping between disparate data",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}