{
    "relation": [
        [
            "Year",
            "2003",
            "2004",
            "2005",
            "2006",
            "2007",
            "2008",
            "2009",
            "Totals"
        ],
        [
            "Deductible",
            "2,000",
            "2,000",
            "2,000",
            "1,000",
            "1,000",
            "1,000",
            "700",
            "$9,700"
        ],
        [
            "Nondeductible",
            "-0-",
            "-0-",
            "-0-",
            "-0-",
            "-0-",
            "-0-",
            "300",
            "$300"
        ]
    ],
    "pageTitle": "Publication 590 - Individual Retirement Arrangements (IRAs) - Are Distributions Taxable?",
    "title": "",
    "url": "http://taxmap.ntis.gov/taxmap/archive2010/taxmap/pubs/p590-011.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 233989071,
    "recordOffset": 233970809,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 15 Dec 2011 17:58:12 GMT",
    "textBeforeTable": "Rose Green has made the following contributions to her traditional IRAs. Example.(p40) taxmap/pubs/p590-011.htm#en_us_publink1000230821 Enter the amount from line 9 of Worksheet 1-5 (or, if you entered an amount on line 11, the amount from that line) on line 15 of Form 8606. Complete line 14 of Form 8606. Enter the amount from line 8 of Worksheet 1-5 on lines 13 and 17 of Form 8606. If line 5 of Form 8606 is equal to or greater than line 8 of Worksheet 1-5, follow instructions 6 and 7, next. Do not complete lines 6 through 12 of Form 8606. If line 5 of Form 8606 is less than line 8 of Worksheet 1-5, complete lines 6 through 15 of Form 8606 and stop here. Complete lines 2 through 5 of Form 8606. After you complete Worksheet 1-2 or the IRA deduction worksheet in the form instructions, enter your nondeductible contributions to traditional IRAs on line 1 of Form 8606. Use Worksheet 1-2 or the IRA Deduction Worksheet in the Form 1040, 1040A, or 1040NR instructions to figure your deductible contributions to traditional IRAs to report on Form 1040, line 32; Form 1040A, line 17; or Form 1040NR, line 32. To report your nontaxable distribution and to figure the remaining basis in your traditional IRA after distributions, you",
    "textAfterTable": "Rose needs to complete Worksheet 1-5, Figuring the Taxable Part of Your IRA Distribution, to determine if her IRA deduction for 2010 will be reduced or eliminated. In 2010, she makes a $2,000 contribution that may be partly nondeductible. She also receives a distribution of $5,000 for conversion to a Roth IRA. She completed the conversion before December 31, 2010, and did not recharacterize any contributions. At the end of 2010, the fair market values of her accounts, including earnings, total $20,000. She did not receive any tax-free distributions in earlier years. The amount she includes in income for 2010 is figured on Worksheet 1-5, Figuring the Taxable Part of Your IRA Distribution—Illustrated. The illustrated Form 8606 for Rose shows the information required when you need to use Worksheet 1-5 to figure your nontaxable distribution. Assume that the $500 entered on Form 8606, line 1, is the amount Rose figured using instructions 1 and 2 given earlier under Reporting your nontaxable distribution on Form 8606. Note. There are special rules for 2010 conversions from traditional IRAs to Roth IRAs. Under those rules, Rose would include half of the amount required to be included in income as a result of the conversion in income in 2011 and half in income in 2012. However, Rose elects to include the entire amount in income in 2010. She indicates this election by checking the box on line",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}