{
    "relation": [
        [
            "Patent application number",
            "20090050175",
            "20120090649",
            "20130084709",
            "20130084710",
            "20140352742",
            "20150059645"
        ],
        [
            "Description",
            "SUBSTRATE CLEANING APPARATUS AND SUBSTRATE CLEANING METHOD - At a vibration applying position, ultrasonic vibration is applied upon a liquid film which is on a surface of a substrate. Concurrently with this, at a drop arrival position which is different from the vibration applying position, drops of a cleaning liquid are supplied to the liquid film, whereby wave-generating vibration which is different from the ultrasonic vibration is applied upon the liquid film. This dramatically improves removal of particles adhering to the surface of the substrate as compared with mere application of ultrasonic vibration. Hence, even when the output, the frequency and the like of the ultrasonic vibration are set to such an extent not damaging the substrate, it is possible to effectively remove particles with the wave-generating vibration and favorably clean the surface of the substrate.",
            "SUBSTRATE PROCESSING APPARATUS AND SUBSTRATE PROCESSING METHOD - A substrate processing apparatus includes a substrate holding unit that horizontally holds a substrate in non-contact with a major surface of the substrate, a processing liquid supply unit that supplies a processing liquid to the major surface of the substrate held by the substrate holding unit, and a hydrophilic surface placing unit that places an annular hydrophilic surface along a peripheral portion of the major surface of the substrate held by the substrate holding unit such that the hydrophilic surface comes into contact with a liquid film of the processing liquid held on the major surface of the substrate.",
            "SUBSTRATE PROCESSING APPARATUS AND SUBSTRATE PROCESSING METHOD - In a substrate processing apparatus, an anti-static liquid supply part supplies the anti-static liquid having electrical resistivity higher than that of an SPM liquid onto a substrate to puddle an entire upper surface of the substrate with the anti-static liquid, to thereby gradually remove static electricity from the substrate. Then, the processing liquid supply part supplies the SPM liquid onto the substrate to thereby perform an SPM process. In the SPM process, it is thereby possible to prevent a large amount of electric charges from rapidly moving from the substrate to the SPM liquid and prevent any damage to the substrate. Further, by maintaining the electrical resistivity of the anti-static liquid at the target electrical resistivity, it is possible to increase the static elimination efficiency of the substrate and shorten the time required for the static elimination process within the limits of causing no damage to the substrate.",
            "SUBSTRATE PROCESSING APPARATUS AND SUBSTRATE PROCESSING METHOD - A substrate processing apparatus comprises a single-substrate processing apparatus for processing substrates one by one, and an anti-static liquid storage part for storing an anti-static liquid having electrical resistivity maintained at target electrical resistivity higher than the electrical resistivity of an SPM liquid. A plurality of substrates held in a cartridge are immersed in the anti-static liquid inside the anti-static liquid storage part and both main surfaces of the substrate entirely come into contact with the anti-static liquid. From the substrates, static electricity is relatively gently removed. Then, after the static elimination process are finished, a processing liquid supply part supplies the SPM liquid onto an upper surface of the substrate and an SPM process is thereby performed. It is thereby possible to prevent a large amount of electric charges from rapidly moving from the substrate to the SPM liquid and also possible to prevent any damage to the substrate.",
            "SUBSTRATE PROCESSING APPARATUS - A substrate processing apparatus has a cup part for receiving processing liquid such as pure water which is splashed from a substrate. The cup part is formed of electrical insulation material or semiconductor material. Hydrophilic treatment may be performed on an outer annular surface of the cup part and water may be held on the outer annular surface of the cup part while processing the substrate. With the disclosed apparatus, charged potential of the cup part generated by splashing of pure water can be suppressed, without greatly increasing the manufacturing cost of the substrate processing apparatus. As a result, it is possible to prevent electric discharge from occurring on the substrate due to induction charging of the substrate, in application of the processing liquid onto the substrate.",
            "SUBSTRATE PROCESSING APPARATUS - A substrate processing apparatus comprising a substrate holding rotating mechanism, a process liquid supply mechanism having a nozzle for dispensing a process liquid toward a principal face of the substrate, a processing liquid reservoir for holding sufficient process liquid to form a liquid film covering the whole principal face of the substrate, a liquid film forming unit for forming the liquid film by supplying the process liquid onto the principal face of the substrate in a single burst, and a control unit for controlling the liquid film forming unit and the process liquid supply mechanism such that the process liquid is dispensed from the process liquid nozzle toward the principal face of the substrate after formation of the liquid film covering the whole area of the principal face of the substrate by the liquid film forming unit."
        ],
        [
            "Published",
            "02-26-2009",
            "04-19-2012",
            "04-04-2013",
            "04-04-2013",
            "12-04-2014",
            "03-05-2015"
        ]
    ],
    "pageTitle": "Miyagi, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/miyagi-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446814087,
    "recordOffset": 446782306,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masahiro Miyagi, Kyoto JP 07-24-2014 SUBSTRATE PROCESSING APPARATUS AND SUBSTRATE PROCESSING METHOD - In a substrate processing apparatus, a temperature of an anti-static liquid having electrical resistivity which gradually decreases as a liquid temperature increases is adjusted by a temperature adjustment part and the electrical resistivity of the anti-static liquid is higher than the electrical resistivity of a processing liquid (SPM liquid). After that, a plurality of substrates are immersed in the anti-static liquid inside the anti-static liquid storage part and both main surfaces of each substrate entirely conic into contact with the anti-static liquid. This gradually removes static electricity from the substrate. Then, the SPM liquid is supplied onto an upper surface of the substrate to thereby perform an SPM process. In the SPM process, it is thereby possible to prevent a large amount of electric charges from sharply moving from the substrate to the SPM liquid and prevent any damage to the substrate. 20140202496 10-03-2013 SUBSTRATE PROCESSING APPARATUS AND SUBSTRATE PROCESSING METHOD - In a substrate processing apparatus, with an internal space of a chamber brought into a reduced pressure atmosphere, a first processing liquid is supplied onto an upper surface of a substrate while the substrate is rotated, and the first processing liquid is thereby quickly spread from a center portion toward a peripheral portion on the upper surface of the substrate. It is thereby possible to coat the upper surface of the substrate with the first processing liquid in",
    "textAfterTable": "Patent applications by Masahiro Miyagi, Kyoto JP Masanori Miyagi, Hitachinaka JP Patent application number Description Published 20110248001 METAL DEPOSITION METHOD AND LASER METAL DEPOSITION APPARATUS - In a deposition method of forming a buildup on a single crystal or directionally solidified crystal parent material, metal deposition is performed from an extension in a preferential growth orientation of parent material crystals while forcedly cooling a portion of the parent material somewhat below a processed surface and beforehand giving a temperature gradient to the parent material so that a maximum temperature gradient is oriented along the preferential growth orientation of parent material crystals. 10-13-2011 20120145683 LASER PROCESSING SYSTEM AND OVERLAY WELDING METHOD - A laser processing system includes a laser processing head, a powder supply device, and a controller. The powder supply device supplies powder to the laser processing head. The laser processing head includes: a laser emission unit which irradiates a workpiece with laser light; and a powder supply unit which receives the powder supplied from a powder supply device to the laser processing head, and can supply the powder to a laser spot on the workpiece. The powder supply unit includes: a powder discharge unit which can discharge",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}