{
    "relation": [
        [
            "Part #",
            "RECEIVE5",
            "HDG000 RECEIVE",
            "AE TEST - RECEIVE (1",
            "dsPIC33FJ128MC802",
            "dsPIC33FJ128GP802"
        ],
        [
            "Distributor",
            "National Microchip",
            "ASAP Semiconductor",
            "ASAP Semiconductor",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Manufacturer",
            "Not Provided",
            "RCA",
            "TE CONNECTIVITY",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc."
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "Not Provided",
            "Not Provided",
            "1",
            ". - Wake-up on Start bit from Sleep mode. - 4-character TX and RX FIFO buffers. - LIN bus support. - IrDA ® encoding and decoding in hardware. - High-Speed Baud mode. - Hardware Flow Control with CTS and RTS. . Enhanced CAN (ECAN. module) 2.0B active: - Up to eight transmit and up to 32 receive buffers...",
            "Control with CTS and RTS. . Enhanced CAN (ECAN. module) 2.0B active: - Up to eight transmit and up to 32 receive buffers. - 16 receive filters and three masks. - Loopback, Listen Only and Listen All. - Messages modes for diagnostics and bus monitoring. - Wake-up on CAN message. - Automatic..."
        ]
    ],
    "pageTitle": "Receive | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/receive",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481630303,
    "recordOffset": 481592617,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{99335=Description: Model 2823-4/2824-4 is a four channel RGB video system. Transmitter uses extra wide 30 MHz bandwidth for transmitting RGB video signals across fiber optic cable to a RGB monitor. 2823/2824 is ideal for computer remoting applications., 88779=Description: High-Density Media Converter System II Layer 2 Module, 10BASE-T/100BASE-TX/1000BASE-T to 1000BASE-SSLX, Single-Strand, 1550-nm Transmit/1310-nm Receive, SC, 74555=Description: The MAX2410 performs the RF front-end transmit/receive function in time-division-duplex (TDD) communication systems. It operates over a wide frequency range and is optimized for RF frequencies around 1.9GHz. Applications include most popular cordless and PCS standards. The MAX2410 contains}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top KEELOQ (R) Manchester Encoding Receive Routines Advanced KEELOQ Encoders (HCS360 and higher) offer alternative methods. One such alternative method is Manchester encoding. This Technical Brief shows PICmicro (R) microcontrollers assembly routines to receive Manchester encoded transmissions. other encoding systems, such as PWM. Agfa Graphics Is First Vendor to Receive CIP4 Certification from PIA/GATF for JDF 1.3 Capable Prepress Workflow. integral to effective and successful JDF prepress. :ApogeeX 4.0 is the first JDF-capable prepress workflow to receive the designation. Awarded only after Agfa Graphics Is First Vendor to Receive CIP4 Certification from PIA/GATF for MIS to Prepress Workflow Integration Agfa Graphics announced today that its :Apogee Prepress 5.0 workflow solution has received the \"CIP4 Certified Product \" designation from the Printing Industries of America/Graphic Arts Technical Foundation (PIA/GATF). They verified its reliability on behalf of CIP4, as well as the compatibility and German Lithium-Ion Developers Receive Award EIG Achieves ISO/TS16949 Certification BASF Signs Agreement for Argonne Technology Hopkins Selects Yuasa for NASA Mission International Battery Names New CEO Super Tram Battery Charges in Ten Seconds Greenl Leaving on a trip to the fjords during the EVS24 show in Norway are",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}