{
    "relation": [
        [
            "cod.",
            "7101",
            "9306",
            "9307",
            "9317",
            "9326",
            "9327"
        ],
        [
            "PATOLOGIA SISTEMICA",
            "ACONDROPLASIA",
            "DERMATOMIOSITE O POLIMIOSITE",
            "DIABETE GLUCO-FOSFO-AMINICO (SINDR. DI FANCONI)",
            "MORBO DI COOLEY (THALASSEMIA MAJOR)",
            "SCLERODERMIA CON LIEVE COMPROMISSIONEVISCERALE",
            "POLIARTERITE NODOSA SENZA GRAVE COMPROMISSIONE VISCERALE"
        ],
        [
            "min.",
            "0",
            "0",
            "0",
            "0",
            "41",
            "41"
        ],
        [
            "max.",
            "0",
            "0",
            "0",
            "0",
            "50",
            "50"
        ],
        [
            "fisso",
            "60",
            "35",
            "60",
            "90",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Tabella Invalidità (DM 05/02/1992) | Medicina Sociale",
    "title": "",
    "url": "http://medicinasociale.siracusae.it/tabella-invalidita-dm-05021992/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 164682991,
    "recordOffset": 164617752,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{337591=Dati anamnestici: PRECEDENTI RICONOSCIMENTI : ANAMNESI : RICONOSCIMENTO I.C. PERCENTUALE 55% IN DATA 09/05/2011 PER DISTURBO SCHIZOFRENICO CON UMORE disturbo del comportamento DEPRESSO ED ANSIA, DISTURBO DA SONNAMBULISMO, LIEVE IPERCIFOSI DORSALE IN INIZIALE SPONDILOARTROSI, INIZIALE MENISCOSI GINOCCHIO DX SEGUITO DAL CSM DAL 2000 CON DISCONTINUITA’, DEFLESSIONE DEL TONO TIMICO CON NOTE MALINCONICHE, SENTIMENTI DI INADEGUATEZZA. FIBROMIALGIA. PRECEDENTE ESPERIENZA LAVORATIVA COME OPERAIO. ATTUALMENTE IN CORSO CONTRATTO TRIMESTRALE COME ADDETTO PULIZIE. POSSIEDE PATENTE DI GUIDA. Esame obiettivo: BUONE CONDIZIONI GENERALI. PESO KG 110, ALTEZZA CM 184. LUCIDO, ORIENTATO T-S. TONO UMORE DEFLESSO. PP E DEAMBULAZIONE AUTONOMI. Accertamenti disposti: Documentazione acquisita: REL. CSM DEL 6/3/13, RX GINOCCHIA DEL 16/1/13, EEC DEL 4/12, REL. REUMATOLOGICA DEL 02/13, RX L-S DEL 01/2013 Parere dell’esperto:, 6033=Avviso che è inutile cercare nella tabella del DM 5/02/1992 una percentuale di invalidità riferibile ad una specifica “malattia rara”; il legislatore ha previsto solo un certo numero di menomazioni più comuni; per le altre si usa un criterio analogico oppure si valutano i deficit funzionali conseguenti alla patologia da valutare. Ulteriori notizie su questo argomento alla fine di QUESTA PAGINA., 373709=Buonasera. Mi dispiace per la sua situazione, ma, perdoni la franchezza che spero serva a capire meglio, a volte i pazienti hanno una percezione assolutamente falsa della documentazione in loro possesso e pensano che raccontando le loro problematiche di salute la commissione valuti favorevolmente. La commissione per l’accertamento dell’invalidità ha il compito di valutare secondo le indicazioni contenute nella tabella del Decreto Ministeriale 05/02/1992 e comunque nulla viene riconosciuto se non adeguatamente documentato da certificazioni specialistiche, meglio se di strutture pubbliche. Inoltre la stessa malattia viene valutata con percentuali diverse in rapporto alla gravità della stessa; per capirci, il diabete ad esempio può essere valutato dal 5%, in caso di forme controllate con solo dieta, al 100% nelle forme gravi, scompensate, con complicanze severe tipo retinopatia angiopatia, insufficienza renale , etc. Torniamo alle sue malattie. Il Morbo di Crohn è una patologia prevista dalla tabella con percentuale variabile dal 15% al 70%; la percentuale viene decisa sulla scorta delle eventuali complicanze, quindi malassorbimento, anemia, etc., e inquadrandola in una classe funzionale di gravità: … I CLASSE – la malattia determina alterazioni lievi della funzione tali da provocare disturbi dolorosi saltuari, trattamento medicamentoso non continuativo e stabilizzazione del peso corporeo convenzionale (rilevato dalle tabelle facenti riferimento al sesso ed alla statura) su valori ottimali. In caso di trattamento chirurgico non debbono essere residuati disturbi funzionali o disordini del transito., 367777=Buongiorno, nel 2006 a seguito di un infortunio sul lavoro mi è ststa riconosciuta dall”inail un’invalidità lavorativa del 27% per “esiti di trauma perforante con cataratta traumatica in occhio dx v.n.1/10 e v.c.2-3/10,pseudoafachia monoculare con esiti di glaucoma secondario,disturbo post-traumatico da stress cronico”.Inoltre sono affetto da “colesterolemia ereditaria” riconosciuta dall’ ASL.Che percentuale di invalidità civile mi spetta? Grazie., 319450=L’epatite cronica attiva è valutata, nella tabella del DM 05/02/1992, il 51%, ma in realtà si riferisce ad una condizione con elevazione delle transaminasi, alterazioni del protidogramma, alterazione ecostrutturali significativa, etc. Altrimenti la percentuale riconoscibile può tranquillamente essere più bassa, anche parecchio; in ogni caso la carica viremica non ci dice nulla., 437481=Buon giorno nel 2005 ho subito un intervento di gastrectomia totale in adenoca T2 N1 e mi e’ stata riconosciuta una invalidita’ del 91 % Nel maggio 2011 dopo revisione d’ufficio la percentuale di invalidita’ e’ stata diminuita al 50%.Questa percentuale e’ corretta??’ Visto che nel frattempo lo stomaco non mi e’ ricresciuto., 425517=Buongiorno. La Tiroidite di Hashimoto non è tabellata e pertanto occorre andare per via analogica e quindi c’è spazio per l’opinabilità. Nella tabella, l’unico riferimento a patologie della tiroide è il cod. 1004 relativo agli ipotiroidismi congeniti con ritardo mentale, certamente non applicabile al caso specifico. In ogni caso, se è compensata farmacologicamente con terapia sostitutiva, non credo che possa essere indicata una percentuale maggiore del 20%, da sola insufficiente ad ottenere qualunque beneficio. Saluti, 438961=Buona sera. Non è così semplice; il fine della tabella è quella di indicare una percentuale di riduzione di capacità lavorativa generica e spesso ciò non dipende dal danno anatomico, ma dal danno funzionale che nei soggetti diversi può cambiare, nonostante la malattia di base sia la stessa. Così, per molte delle infermità della tabella viene indicata una ulteriore precisazione, la cosiddetta “classe funzionale”, che va dalla prima alla quarta. Se osserva attentamente la tabella nella sezione “apparato digerente”, vedrà che in parecchie voci è indicata la classe funzionale; tranne pochissime eccezioni per una patologia in prima classe viene indicata una percentuale del 10%, per la seconda l’11-20%, per la terza il 41-50% e per la quarta il 61-70%. Le classi funzionali, a loro volta, possono essere rilevate da un’altra sezione del DM 05/02/1992, quella delle “Indicazioni per le valutazioni funzionali”, a questo link ==> http://medicinasociale.siracusae.it/dm-5292-parte-prima/ . In ogni caso, si tratta di percentuali non superiori al 70%, e ciò in casi in cui le alterazioni della funzione digestiva sono molto gravi. Nel 2005 le è stata riconosciuta una percentuale molto più elevata perchè, molto probabilmente, è stata riconosciuta anche una componente percentualistica derivata dalla patologia neoplastica, la cui evoluzione non poteva essere prevista con certezza. Saluti. Nikol, 295791=Salve gent.mo Dottor Nicolosi! Scrivo per chiederle qual’è secondo lei il grado di invalidità che mi spetta e se ovviamente ci sono le condizioni per essere dichiarato invalido. Sono in attesa di visita di revisione dell’invalidità, che mi è stata riconosciuta dopo aver avuto il linfoma, la percentuale era del 100%, ho già effettuato invece la revisione dell’handicap e ho già ricevuto il verbale, mi è stato confermato l’handicap senza revisione. Riporto qui tutta la mia situazione clinica: Relazione della Reumatologa: Si certifica che il Sig. Nicola è affetto da grave spondiloartrosi cervicale secondaria. Storia clinica: Nel 2000, all’età di 10 anni, diagnosi di Istiocitosi X presso l’Ospedale S. Orsola di Bologna. Le indagini di diagnostica per immagini evidenziano lesione osteolitica della V cervicale. Effettua chemioterapia a base di Vinblastina, in associazione a terapia corticosteroidea a dosaggio immunosopressivo che porta remissione della malattia. Comorbidità: Pregressa esofagite per cui necessita di terapia a base di inibitori di pompa protonica. 2013 diagnosi di Linfoma di Hodgkin, trattato con chemioterapia (schema ABVD), attualmente in remissione completa, in follow-up. Attualmente il sig. Nicola lamenta deficit di forza dell’arto superiore sn, sintomatologia dolorosa in regione cervicale e deltoidea sn. All’esame obiettivo è presente importante limitazione nei movimenti di rotazione e inclinazione del capo, dolorabilità evocata alla palpazione del muscolo trapezio a sn, deficit di abduzione dell’arto superiore sn. L’esame RX e Rm della colonna cervicale effettuati di recente mostrano vertebra a blocco c4-c5-c6 e discopatia c6/c7, spondilouncoartrosi e artrosi interapofisaria, scoliosi destro-convessa e rotazione assiale dei metameri. E’ in programma una valutazione fisiatrica per effettuare rieducazione funzionale e recupero della motilità. Non vi è dubbio che i gravi esiti della patologia cervicale sofferta in età infantile interferiscano, a causa della sintomatologia dolorosa e delle limitazioni meccaniche, con le normali attività della vita quotidiana riducendo le capacità funzionali del sig. Nicola. Non vi è dubbio inoltre che le importanti comorbidità influenzano la condizione fisica e psichica del sig. Nicola, e la qualità della vita., 463323=Buongiorno, chiedo scusa per la lunga attesa, ma non sono riuscito ad avere tempo per sedermi alla tastiera. A beneficio di tutti, ricordo che per coartazione aortica si intende una stenosi, cioè un “restringimento” localizzato dell’arco dell’aorta, generalmente a valle delle arterie che provvedono all’irrorazione degli arti superiori. Al fine di permettere una pressione di irrorazione sufficiente agli organi irrorati da arterie che nascono “a valle” della stenosi, viene aumentata la pressione nel distretto arterioso “a monte”; l’ipertensione è quindi “secondaria” e fa parte del quadro clinico della coartazione aortica. Il prolasso della valvola mitralica può essere lieve, moderato, severo: bisognerebbe specificare. In ogni caso, nella tabella del DM 05/02/1992, cioè quella di questa pagina, la “coartazione aortica” è presente, con i codici 6415 e 6416: STENOSI O COARTAZIONE AORTICA CONGENITA MODERATA (II CLASSE NYHA): 50% STENOSI O COARTAZIONE AORTICA CONGENITA SERRATA (III CLASSE NYHA): 75%., 416698=Buonasera, nel 2007 (all’età di 25 anni) mi è stato diagnosticato un enfisema bolloso panlobulare bilaterale. Mi è stato eseguito il controllo per Alfa 1-AT, risulta nella norma. So che questo tipo di malattia è cronica e soprattutto debilitante con gli anni (se non si arresta). Posso richiedere l’invalidità? Quale percentuale potrebbe venire riconosciuta?, 216191=Ascissa: ORECCHIO MIGLIORE (somma delle perdite uditive in dB per le frequenze 500-1000-2000Hz), 289050=Salve dott. Nicolosi le volevo dire che la spirometria semplice esce nella norma ma io quando salgo le scale ho salite ho il respiro come se ho fatto una corsa e sto curando lo broncospasmo e i poblemi alle gambe sono nati nel 2013 dopo che mi e venuto come una scossa di corrente in testa e mi si e addormentata tutta la parte dx poi mi anno ricoverato per tia e poi dimesso con ipostenia e parestesia arto dx solo che oggi i dolori sobo passati pure a sx con bruciore al piede…grazie per la sua risp., 448140=Nel caso1. l’Assegno è compatibile con l’attività lavorativa, indipendentemente dal reddito, e viene concesso per 3 anni, dopo il quale si deve riproporre la domanda. nel caso 2. la Pensione è concessa “per sempre”, ma in senso lato in quanto l’INPS la può revisionare e sospendere e, soprattutto, è incompatibile con l’attività lavorativa; in un soggetto giovane è concessa con molta difficoltà e comunque, nel suo caso, mi sento di sconsigliare anche il tentativo: meglio mantenere il posto di lavoro. Nel suo caso non mi è chiaro se parliamo di invalidità civile o invalidità “contributiva” INPS (uso questo termine per differenziare, anche se non è proprio corretto). Se si tratta di invalidità civile ed il suo reddito personale nel 2010 è stato inferiore a € 15.154,24, può tentare di ottenere l’invalidità civile totale 100% che è compatibile con l’attività lavorativa, ma ATTENZIONE: non sono pochi i casi di soggetti che hanno presentato domanda per ottenere un aggravamento dell’invalidità civile ed invece hanno ottenuto una riduzione. Occorre valutare con attenzione la documentazione in possesso e documentare, rispetto alla visita precedente, un significativo aggravamento delle infermità oppure la persistenza delle precedenti e l’insorgeza di altre patologie invalidanti. Meglio fare valutare il caso e la documentazione ad un medico in carne ed ossa, meglio se esperto in problematiche medico-legali, che saprà consigliare per il meglio. Saluti. Nikol, 428786=Buonasera. Verissimo! Come per moltissime malattie, nell’obsoleta tabella del DM 05/02/1992 non c’è alcuna indicazione riguardante la Febbre Mediterranea Familiare. Occorre procedere con criterio analogico. Nel caso specifico, poiché la tabella da indicazioni su percentuali di riduzione di capacità lavorativa generica, occorre precisare e documentare le problematiche provocate dalla malattia. Un primo criterio valutativo può essere individuato nell’ultima voce della tabella: poliarterite nodosa senza grave impegno funzionale” con percentuale compresa tra il 41 ed il 50%. Ma la F.M.F. è caratterizzata 1) da un susseguirsi di attacchi ricorrenti di febbre e sierosite con cadenza che può variare da una volta alla settimana fino ad 1 volta all’anno 2) da possibile insorgenza di insufficienza renale provocata dall’amiloidosi; 3) da artralgie, anch’esse ricorrenti, a volte con residue lesioni permanenti. 4) da lesioni cutanee, etc. Non mi dilungo perché una buona descrizione può essere visionata in questa pagina: http://www.febbriperiodiche.it/index.php?option=com_content&view=article&id=9:febbre-mediterranea-familiare&catid=14:le-patologie&Itemid=114 In sostanza la percentuale può tranquillamente essere anche molto più elevata del 50% se la “compromissione viscerale” è più che lieve e se la frequenza dell’attacco ricorrente è elevata. Occorre però documentare tutto con idonea certificazione specialistica. Saluti e a disposizione per chiarimenti. Nikol., 351845=Salve volevo sapere con una miopia elevata e diabete mellito tipo 2 si puo essere iscritte nelle categorie protette e se si ha diritto ad una percentuale di invalidità. Al 2007 la miopia era questa occhio dx sf -11 50 / cil -125/ asse 175 occhio sx sf -9 50 / cil -175 / asse 180 questi i dati sul responso dell’oculista, non faccio un controllo dal 2007 età 45 anni grazie Luciano, 394270=buongiorno mi scusi io sono nata con la sindrome di Klippel-Trénaunay,ho fatto richiesta di invalidità perchè ho provato a lavorare (ho 23 anni),sono cuoca,ma ho notato che mi uscivano ulcere cutanee sull polpaccio,di cui una sono 2 anni che combatto per chiuderla.La domanda non è stata accolta perche è una malatia rara,ho trovato su wikipedia un codice esenzione per la mia malatia è SSN RN1510,come posso far ricorso?mi spiego mi hanno detto di guardare se l asl riconosce la mia malatia ma io non me ne capisco molto e hai medici che l ho chiesto facendo anche visite specialistiche sono stati vaghi,spero che mi possa aiutare a trovare il mio codice se esistente.Oppure un consiglio su cosa posso fare,la ringrazio per il tempo x me speso., 396216=Buonasera. Il riconoscimento della malattia rara è una cosa, l’invalidità civile è un’altra. Il riconoscimento della condizione di soggetto affetto da malattia rara da diritto ad esenzione dal Tiket per le prestazioni inerenti la patologia e a questo dovrebbe provvedere la USL dopo aver valutato la documentazione specialistica (il codice RN 1510 è corretto). L’invalidità civile invece viene valutata secondo le indicazioni della tabella del DM 05/02/1992, mai aggiornata, in cui non esistono indicazioni percentualistiche per nessuna delle malattie rare, spesso neppure per malattie che rare non sono. In questi casi la Commissione valutante ricorre al cosiddetto criterio analogico, cioè cerca una somiglianza tra la patologia del richiedente e quelle inserite in tabella; altre volte invece utilizza un criterio “funzionale”, cioè cerca di valutare il deficit funzionale provocato dalla malattia non tabellata, anche in questo caso comunque cercando infermità “somiglianti” Per questo c’è un grande spazio per valutazioni “personalistiche”, che non sempre rendono giustizia delle difficoltà del richiedente. Non posso sapere perchè la domanda non è stata accolta, ma l’unico consiglio che posso dare, se non sono trascorsi 180 giorni dal ricevimento del verbale, è di rivolgersi ad un patronato “serio” per tentare un ricorso giudiziario, cioè far causa all’INPS. Il patronato, se serio come raccomando, metterà a disposizione gratuitamente un medico-legale che valutarà la sua documentazione medica e le sue patologie e potrà consigliare correttamente su quanto è opportuno e utile fare. Se i 180 giorni utili per la presentazione del ricorso sono già trascorsi, allora si può solo tentare una domanda di “aggravamento” che però deve essere dimostrato. Anche in questo caso un medico-legale potrà consigliare opportunamente. Saluti e ancora a disposizione per ulteriori chiarimenti. Nikol (alias S. Nicolosi), 314872=Buonasera. Art. 21 della legge 104/92: “21. Precedenza nell’assegnazione di sede. 1. La persona handicappata con un grado di invalidità superiore ai due terzi o con minorazioni iscritte alle categorie prima, seconda e terza della tabella A annessa alla legge 10 agosto 1950, n. 648, assunta presso gli enti pubblici come vincitrice di concorso o ad altro titolo, ha diritto di scelta prioritaria tra le sedi disponibili. 2. I soggetti di cui al comma 1 hanno la precedenza in sede di trasferimento a domanda.”, 333691=ok ! grazie tante ! gentilissimo ! buona serata ! ps cmq si l’ultimo intervento è stato nel novembre 2012 , con la GAMMA KNIFE ; che ahime’ essendo vicino al chiasma ottici mi ha provocato delle alterazioni alla vista … visto che è stati irradiato il craniofaringioma che si trova tra il chiasma ottico e l’ipofisi ! cmq tutto sommato tt bene … cmq ancora tante grazie e buona serata !, 441782=Grazie per la chiarezza nell’esposizione, io ero stato molto confusionario. Attualmente mi è stata riconosciuta una invalidità civile del 67% ed un assegno di invalidità INPS, con decorrenza dal 1-1-2011. Tra tre anni quando sarò rivalutato dall’INPS, e quindi presenterò per la prima volta la documentazione sul mieloma, non corro il rischio di avere la Pensione di inabilità INPS? E’ un rischio che non vorrei correre. Grazie di tutto, Antonio., 339777=Cominciamo con la “lieve ipercifosi dorsale con iniziale spondilartrosi”: non è valutabile in quanto è sicuramente invalidante in misura inferiore all’11%; anche la “lieve meniscosi” non raggiunge dignità di patologia invalidante in modo significativo. La fibromialgia non è presente in tabella e molte commissioni tendono a non valutarla. Per ciò che riguarda il “disturbo schizofrenico …” e correlati, in questi casi viene effettuata una valutazione complessiva sulla scorta della gravità dei sintomi, dell’efficienza della terapia e della frequenza di riacutizzazioni; credo che la Commissione lo abbia inserito in una fascia compresa tra il codice 1208, con percentuale del 31-40%, e il codice 1210 con percentuale del 71/80%. Non sono in grado di affermare se questa valutazione è errata o corretta. Le valutazioni a distanza sono difficili e spesso scorrette. Meglio far visionare la documentazione ad un medico-legale., 461674=Buongiorno vorrei sapere che possibilità ho che mi aumentano l’ ivalidità civile io attualmente ho il 46 per cento dovuto a interventi alle ginocchia dx e sn di osteotomie su entrambi poi nel 2007 ho scoperto di avere epatite cronica c attiva più la sindrome di sjogren sindrome sicca .Ho gia effettuato per l epatite la terapia con interferone e rivarbina con scarsi risultati avendo il genotipo1 b difficilmente da debellare in più effettuato BIOPSIA EPATICA che evidenzia il tutto.In attesa di una vosta risposta vi ringrazio., 216390=Ordinata: ORECCHIO PEGGIORE (somma delle perdite uditive inn dB per le frequenze 500-1000-2000 Hz), 447234=Buongiorno. Occorre differenziare: 1) l’Assegno di invalidità INPS che spetta ai lavoratori dipendenti privati che a causa delle loro infermità hanno avuto una riduzione di capacità lavorativa in occupazioni confacenti alle attitudini superiore ai 2/3, 2) la Pensione di Inabilità INPS che spetta ai lavoratori dipendenti che si trovano nell’impossibilità di svolgere qualunque attività lavorativa, 3) l’Assegno mensile di invalidità civile che spetta a tutti i soggetti con invalidità superiore al 74% e che non superano il limite reddituale previsto per legge (attualmente nel 2010 € 4.470,70) .4) la pensione agli invalidi civili totali che spetta a tutti i soggetti dichiarati invalidi civili al 100% e che non superano il limite reddituale previsto per legge (attualmente nel 2010 € 15.154,24)}",
    "lastModified": "Tue, 13 Jan 2015 14:28:13 GMT",
    "textBeforeTable": "  . 0 50 41 SINDROME DA MALASSORBIMENTO ENTEROGENO CON COMPROMESSO STATO GENERALE 9334 80 0 0 ESOFAGOSTOMIA CERVICALE E GASTROSTOMIA 8205 0 50 41 MEGACOLON – COLOSTOMIA (III CLASSE) 8204 0 30 21 MEGACOLON – COLOSTOMIA (II CLASSE) 8203 41 0 0 ANO ILIACO SN. 8201 0 20 11 SINDROME POSTPRANDIALE DA GASTRECTOMIA (II CLASSE) 6485 10 0 0 SINDROME POSTPRANDIALE DA GASTRECTOMIA (I CLASSE) 6484 5 0 0 PROLASSO DEL RETTO 6472",
    "textAfterTable": "6207 RITENZIONE URINARIA CRONICA (PLURISETTIMANALE) 0 0 35 6208 MEGAVESCICA 0 0 30 6401 AGENESIA DI UN RENE NON COMPLICATA 0 0 21 6402 ANOMALIE NON COMPLICATE DELLA PELVI RENALE 0 0 21 6422 DUPLICITÀ OD ECTOPIA URETERALE BILATERALE 0 0 41 6423 DUPLICITÀ OD ECTOPIA URETERALE MONOLATERALE 0 0 15 6438 GLOMERULONEFRITE DA IMMUNOCOMPLESSI CON INSUFFICIENZA RENALE LIEVE 61 70 0 6439 GLOMERULONEFRITE EREDITARIA 0 0 100 6440",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}