{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "There are a lot of options (including vegan and vegetarian), but my favorite part is the sustainability. They use local farmers and producers, which keeps the food fresh and good for the environment. The first year, a meal plan is required, but you get to use the dinning hall as much as you like.",
            "Most of Colgate's students live on campus. I think this is because campus housing is guaranteed, which makes it so much easier for students. The best part of housing, at least compared to other schools, is the the wonderful gender inclusive housing. The dorms are small (but aren't all dorms?). There are suites, doubles and singles. There are laundry and study/lounge rooms within the buildings.",
            "The core curriculum is designed to challenge students in many disciplines beyond their major. As such, some courses are hard for some and easy for others. I like how you have to take a variety of classes like Legacies of the Ancient World and the Science of Art. There really is something for everyone. In addition to classes, Colgate offers a lot of research opportunities, which is extremely beneficial."
        ]
    ],
    "pageTitle": "Colgate University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Colgate-University/reviews?_escaped_fragment_=/show/39755",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906497187,
    "recordOffset": 906455139,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114971=The torch light ceremony is a nice tradition and Feature at Colgate which involves the Konosioni ( an honor society) marching up the hill with lit torches leading the incoming freshmen. When you graduate you will march down with the torches., 64449=Some good places to go to get away from campus are the quarry behind campus and the Yurt, which is a short drive away. We often go to the quarry to build a fire and make smores but you can actually rent out the Yurt for about $20 a night and sleep there with a bunch of people. Colgate's Spring Party Weekend in April is a famous four-day celebration funded by the school and the frats where students can unwind before finals and listen to some awesome concerts., 134992=© 2015, Cappex.com, LLC, 18745=Come during April Visit Days and eat a chipwich - it's a tradition! Also check out the athletic trails on top of the hill - the views are great!, 97533=We have a torchlight march up the hill during freshman orientation and another down the hill at graduation., 115842=Frank dining hall has a lot of variety but it can get old very quickly. Frank dining hall has something for everyone including vegetarians and vegans, specifically the Wild Mushroom.There is The Coop also on campus that has grilled food like chicken tenders and and fried chicken sandwiches and more. There is also pasta, salad, and a deli. The Coop is the most popular late night option because it open until 1:30.}",
    "textBeforeTable": "12/27/2009 Reviewer is A current student here. 29 out of 30 people found this review useful. 1 of 26 Peter from Hamilton, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. Colgate University Reviews Colgate University › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Colgate is a great place to go to college. There is no denying the fact that it is rural and isolated, but I haven't had any problems with life on campus. There are so many students interest groups and events on campus that everyone stays busy and the isolation isn't really noticable. Also, between school organizations and the Greek organizations there are always musicians coming to campus: everything from up and coming bands to headliners. Am learning a lot I came to Colgate with a pretty narrow idea of what I wanted to study and what I wanted out of my collegiate career. Colgate has, however, reshaped my ideas about the potential of a college education. I thought that both the core program and the distribution requirements would be a nuisance, but I have actually discovered a wide range of interests that I probably would not have explored had these programs not been a vital part of the Colgate experience. I am able to focus on, and engross myself with, my major but can also study a broad range of other interesting subjects. Login to rate or flag the reviews Brian from Penfield, NY 05/21/2012 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}