{
    "relation": [
        [
            "Condition:",
            "Brand:",
            "Model:",
            "Features:",
            "Max. DPI:"
        ],
        [
            "New: A brand-new, unused and undamaged item. See the seller's listing for full details. See all condition definitions- opens in a new window or tab",
            "E-Blue",
            "Cobra EMS151BK",
            "Adjustable DPI, Right-Handed only",
            "1600"
        ],
        [
            "Type:",
            "Tracking Method:",
            "Connectivity:",
            "Interface:",
            ""
        ],
        [
            "Gaming",
            "Optical",
            "Wired",
            "USB",
            ""
        ]
    ],
    "pageTitle": "E Blue Cobra Series EMS151BK Optical USB Professional LED Gaming Mouse 1600 DPI | eBay",
    "title": "",
    "url": "http://www.ebay.in/itm/E-Blue-Cobra-Series-EMS151BK-Optical-USB-Professional-LED-Gaming-Mouse-1600-DPI/291142091729?hash=item43c96bc3d1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423092307,
    "recordOffset": 423056164,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  27 Jun, 2015 00:16:26 IST  Seller assumes all responsibility for this listing. 291142091729 eBay item number: Shipping and payments Description Report item - opens in a new window or tab | Learn more Replacement and refund for this product is covered through Returns: Any international shipping is paid in part to Pitney Bowes Inc. Learn More- opens in a new window or",
    "textAfterTable": "Cobra II Series Professional Gaming Mouse with Adjustible DPI Upto 1600 and Light Illumination High performance optical sensor The mouse is with high performance optical sensor which ensures excellent precision and control. With three levels DPI, high mobility and accuracy can be guaranteed. Multimedia function keys To cater for the need of business and entertainment, multimedia function keys are installed to let you move forward and backward easily. Clamp on design The clamp on design at the front of the mouse is effective to lengthen the clicking button of the mouse. Its unique structure differentiates",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}