{
    "relation": [
        [
            "",
            "Is the rise in global average temperature during the past 150 years statistically significant?",
            "Is the rise in global average sea surface temperature during the past 150 years statistically significant?",
            "Is the rise in global average land surface temperature during the past 150 years statistically significant?"
        ],
        [
            "BenestadI",
            "Yes",
            "Yes",
            "Yes"
        ],
        [
            "BundeII",
            "YesIV",
            "No",
            "Yes"
        ],
        [
            "KoutsoyiannisIII",
            "NoV",
            "No",
            "No"
        ]
    ],
    "pageTitle": "Climate Dialogue",
    "title": "",
    "url": "http://www.climatedialogue.org/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373622687,
    "recordOffset": 373435880,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{564=The first who studied clustering in natural processes was Harold Edwin Hurst, a British hydrologist who worked in the Nile for more than 60 years. In 1951 he published a seminal paper[8] in which he stated:}",
    "TableContextTimeStampAfterTable": "{507080=This summary is based on the contributions of Rasmus Benestad, Armin Bunde and Demetris Koutsoyiannis who participated in this Climate Dialogue that took place in May 2013., 14828=The sun goes through cycles of approximately 11 years in which the activity goes up and down. The differences in TSI between the maxima and minima are very small however, on the order of 0.1%. Two of the datasets (PMOD and ACRIM) suggest that the most recent solar minimum in 2008 (the start of solar cycle 24) was somewhat lower than the TSI during the two preceding minima. In Box 10.2 of AR5 the IPCC concludes that “it is very likely that there has been a small decrease in solar forcing of –0.04 [–0.08 to 0.00] W/m2 over a period with direct satellite measurements of solar output from 1986 to 2008” and therefore that “there is high confidence that changes in total solar irradiance have not contributed to global warming during that period”., 50098=Referring back to general point 6, the change in TSI between 1750 and 1980 of dS = 0.38 Wm-2 is a radiative forcing of FRS ≈ 0.06 Wm-2. Hence the recent downturn in solar activity is giving us direct evidence that the contribution of TSI is small, of order a few percent of the effect of well mixed greenhouse gases. This agrees with modelling studies that have predicted that even a return to Maunder minimum TSI values would only give a minor slowing of greenhouse gas driven warming [Feulner and Rahmstorf , 2010; Jones et al., 2012]. The inferred radiative forcing of FRS ≈ 0.06 Wm-2 is very similar to the IPCC estimate and the main change to the IPCC consensus values that I would suggest is needed is that the level of confidence in the value should, in the light of the recent data, be changed from “medium” to “high”., 475127=Figure 5 Updated Fig. 2 in Koutsoyiannis and Montanari [21] testing lagged climatic differences based on the HadCrut4 data set (1850-2012; see explanation in text)., 476338=Our (pseudo)test relies on climatic differences for different time lags (not just that of the latest and earliest values). For example, assuming a lag of 30 years (equal to the period for which we defined a climatic value), the climate difference between 2012 and 1982 is 0.31°C – (–0.05°C) = 0.36°C, where the value - 0.05°C is the average of years 1953-82. The value 0.36°C is plotted as a green triangle in Figure 5 at year 2012. Likewise, we find climatic differences for years 2011, 2010, …, 1909, all for lag 30. Plotting all these we get the series of green triangles shown in Figure 5. We repeat the same procedure for time lags that are multiples of 30 years, namely 60 years (red points), 90 years (blue points) and 120 years (purple points)., 144670=My personal opinion is that we don’t have a clear definition of Grand Episodes (Maxima and Minima), including the Maunder Minimum. Note in Figure 5 a new definition of the limits dates of the Maunder Minimum(Vaquero and Trigo, 2015) that illustrate the problem with the exact definitions of Grand Episodes. The common limits dates for the MM are 1645-1715, proposed by Eddy (1976). However, we have proposed a redefinition of the Maunder Minimum period with the core “Deep Maunder Minimum” spanning from 1645 to 1700 (that corresponds to the Grand Minimum state) and a wider “Extended Maunder Minimum” for the longer period 1618–1723 that includes the transition periods. The origin of this new “definition” was the discovery of sunspot observations made by G. Marcgraf in 1637. A new analysis of this data (and other revised historical observations) indicated a possibly gradual onset of the minimum with reduced activity starting two cycles earlier (Vaquero et al., 2011)., 117565=Richards, M. T., Rogers, M.L., Richards, D. St. P., Long-Term variability in the Length of the Solar Cycle, Publ. Astron. Soc., Pac, 121, 797-809, 2009, 247754=Sexton, D.M. H., J.M. Murphy, M. Collins, and M.J. Webb, 2012. Multivariate probabilistic projections using imperfect climate models part I: outline of methodology. Clim. Dynam., 38: 2513–2542., 413208=Mearns, Linda O. , Ray Arritt, Sébastien Biner, Melissa S. Bukovsky, Seth McGinnis, Stephan Sain, Daniel Caya, James Correia, Jr., Dave Flory, William Gutowski, Eugene S. Takle, Richard Jones, Ruby Leung, Wilfran Moufouma-Okia, Larry McDaniel, Ana M. B. Nunes, Yun Qian, John Roads, Lisa Sloan, Mark Snyder, 2012: The North American Regional Climate Change Assessment Program: Overview of Phase I Results. Bull. Amer.Met Soc. September issue. pp 1337-1362., 280239=Fig. 1. Ratio of trends in TTT to trends in TSurf as a function of the ending year of the trend analysis. The starting point is January 1979. The surface dataset used is HADCRUT4. The pink horizontal line is at a value of 1.4, the amplification factor for TTT in reference 1., 328724=Douglass, D. and J.R. Christy, 2013: Reconciling observations of global temperature change: 2013. Energy and Env., 24 No. 3-4, 414-419., 359798=Van Oldenborgh, G.J. F.J. Doblas-Reyes, S.S. Drijfhout en E. Hawkins (2013), Reliability of regional climate model trends; Environmental Research Letters, 8, 1, 014055, doi:10.1088/1748-9326/8/1/014055., 95661=Scafetta and Willson (2009), N. Scafetta, R. Willson: ACRIM-gap and Total Solar Irradiance (TSI) trend issue resolved using a surface magnetic flux TSI proxy model. Geophysical Research Letter 36, (2009) L05701. DOI: 10.1029/2008GL036307., 98071=Thejll and Lassen (2000), Thejll, P., K. Lassen: Solar forcing of the northern hemisphere land air temperature: new data. J. Atmos. Solar-Terrest. Phys. 62 (2000) 1207-1213., 398182=· Sakaguchi, K., X. Zeng, and M. A. Brunke (2012), The hindcast skill of the CMIP ensembles for the surface air temperature trend, J. Geophys. Res., 117, D16113, doi:10.1029/2012JD017765. published 28 August 2012, 11392=New paleoclimate reconstruction efforts since AR4 (Figure 5.7; Table 5.4; Appendix 5.A.1) have provided further insights into the characteristics of the Medieval Climate Anomaly (MCA; Table 5.1) and the Little Ice Age (LIA; Table 5.1). The timing and spatial structure of the MCA and LIA are complex (see Box 6.4 in AR4 and Diaz et al., 2011; and Section 5.5), with different reconstructions exhibiting warm and cold conditions at different times for different regions and seasons. The median of the NH temperature reconstructions (Figure 5.7) indicates mostly warm conditions from about 950 to about 1250 and colder conditions from about 1450 to about 1850; these time intervals are chosen here to represent the MCA and the LIA, respectively., 96148=Shapiro et al. (2011), Shapiro, A. I., W. Schmutz, E. Rozanov, M. Schoell, M. Haberreiter, A. V. Shapiro, S. Nyeki: A new approach to the long-termreconstruction of the solar irradiance leads to large historical solar forcing. Astron. Astrophys. 529 (2011) A67., 90317=Eddy (1976), Eddy, J. A.: The Maunder minimum. Science 192 (1976) 1189–1202., 65542=Krivova, N., S.K. Solanki, and Y. Unruh (2011) Towards a long-term record of solar total and spectral irradiance. J. Atmos. Solar-Terr. Phys., 73, 223–234. doi:10.1016/j.jastp.2009.11.013, 63584=Foukal P., C. Fröhlich , H. Spruit ,T.M.L. Wigley (2006) Variations in solar luminosity and their effect on the Earth’s climate. Nature, 443, 161–166. doi:10.1038/nature05072, 430161=In 2005, there was a scientific paper [1] suggesting that statistical models describing random long-term persistence (LTP) could produce similar trends as seen in the global mean temperature. I wrote a comment then on this paper on RealClimate.org with the title Naturally trendy?., 151943=Eddy, J.A. (1976) The Maunder Minimum. Science 192, 1189., 170664=Hansen, J., M. Sato, G. Russell, and P. Kharecha, 2013: Climate sensitivity, sea level, and atmospheric carbon dioxide. Phil. Trans. R. Soc. A, 371, 20120294, doi:10.1098/rsta.2012.0294., 359223=Stegehuis A., Vautard R., Teuling R., Ciais P. Jung M. Yiou, P. (2012) Summer temperatures in Europe and land heat fluxes in observation-based data and regional climate model simulations, in press by Climate Dynamics; doi 10.1007/s00382-012-1559-x, 113804=· The modern maximum of the millennium quasi-periodic cycle takes place around 2060. This makes a solar minimum less dramatic than in the Maunder Minimum period, which appeared in a minimum of the millennium cycle., 243950=Gregory, J.M., R.J. Stouffer, S.C.B. Raper, P.A. Stott, and N.A. Rayner, 2002. An observationally based estimate of the climate sensitivity. J. Clim.,15: 3117–3121., 67747=Shapiro, A. I. et al. (2011) A new approach to the long-term reconstruction of the solar irradiance leads to large historical solar forcing. Astron. & Astrophys. 529, A67. doi: 10.1051/0004-6361/201016173, 475345=The method has the advantages that it uses the entire series (not a few values), it considers the actual climatic values (not their ranks) and it avoids specifying a mathematical form of trend (e.g. linear). Furthermore, it is simple: First we calculate the climatic value of each year as the average of the present and the previous 29 years. This is plotted as a pink continuous line in Figure 5, where we can see, among other things, that the latest climatic value is 0.31°C (at 2012, being the average of HadCrut4 data values for 1983-2012), while the earliest one was –0.30°C (at 1879, being the average of 1850-79). Thus, during the last 134 years the climate has warmed by 0.61°C. Note that no subjective smoothing is made here (in contrast to the graphs by CRU), and thus the climatic series has length 134 years (but with only 5 non-overlapping values), while the annual series has length 163., 395476=· Mauritsen, T., et al. (2012), Tuning the climate of a global model, J. Adv. Model. Earth Syst., 4, M00A01, doi:10.1029/2012MS000154. published 7 August 2012 During a development stage global climate models have their properties adjusted or tuned in various ways to best match the known state of the Earth’s climate system…..The tuning is typically performed by adjusting uncertain, or even non-observable, parameters related to processes not explicitly represented at the model grid resolution., 263200=Figure 3. Vertical profiles of trends in atmospheric temperature (panel A) and in actual and synthetic MSU temperatures (panel B). All trends were calculated using monthly-mean anomaly data, spatially averaged over 20 °N–20 °S. Results in panel A are from seven radiosonde datasets (RATPAC-A, RICH, HadAT2, IUK, and three versions of RAOBCORE; see Section 2.1.2) and 19 different climate models. The grey-shaded envelope is the 2σ standard deviation of the ensemble-mean trends at discrete pressure levels. The yellow envelope represents 2σSE, DCPS07’s estimate of uncertainty in the mean trend. The analysis period is January 1979 through December 1999, the period of maximum overlap between the observations and most of the model 20CEN simulations. Note that DCPS07 used the same analysis period for model data, but calculated all observed trends over 1979–2004. Source: Santer (2008), 139216=Maunder Minimum The classical reconstruction of solar activity based on the Wolf number started in 1700, 1749 and 1818 at annual, monthly and daily scales respectively (International Sunspot Number, ISN, see Clette, 2011). Therefore, it does not cover the Maunder Minimum. However a reconstruction by Hoyt and Schatten (the so-called Group Sunspot Number, GSN) published in 1998 starts in 1610 and, therefore, is an extremely useful tool to investigate the Maunder Minimum. The Group Sunspot Number is based only on the number of sunspot groups that are observed in the solar disc. However the International Sunspot Number is computed from the number of sunspot groups and the number of individual spots that are observed in the solar disc. GSN and ISN are pretty similar from approximately 1880 onwards. However they are very different in the 18th century and much of the 19th century. GSN values show a strong upward trend since the end of the Maunder Minimum up to now while values of ISN show no significant trend., 64108=Gray L.J., J. Beer, M. Geller, J. Haigh, M. Lockwood, K. Matthes, U. Cubasch, D. Fleitmann, R.G. Harrison, L. Hood, J. Luterbacher, N. Marsh , D. Shindell, B. van Geel, and W. White (2010) Solar influences on climate. Rev. Geophys., 48, RG4001, doi:10.1029/2009RG000282, 389248=· Taylor et al, 2012: Afternoon rain more likely over drier soils. Nature. doi:10.1038/nature11377. Received 19 March 2012 Accepted 29 June 2012 Published online 12 September 2012, 116220=Hansen, J. et al. Climate forcings in Goddard Institute for Space Studies SI2000 simulations, J. Geophys. Res., 107(D18), 4347, doi:10.1029/2001JD001143,2002, 417563=Veljovic, K., B. Rajkovic, M.J. Fennessy, E.L. Altshuler, and F. Mesinger, 2010: Regional climate modeling: Should one attempt improving on the large scales? Lateral boundary condition scheme: Any impact? Meteorologische Zeits., 19:3, 237-246. DOI 10.1127/0941-2948/2010/0460., 290368=S. C. Sherwood, C. L. Meyer, R. J. Allen, and H. A. Titcher, “Robust tropospheric warming revealed by iteratively homogenized radiosonde data,” Journal of Climate, vol. 21, no. 20, pp. 5336-5352, Oct. 2008. (This describes the IUK dataset), 282119=In Fig. 2, I have reproduced panel D of Fig. 4 from Santer et al. (2005), except with updated measured data, the addition of the reanalysis data, and the use of CMIP-5 model results. The CMIP-5 model results for 1979-2012 were made by splicing together results from 20th century simulations (before 2005, using measured values of the forcings), and RCP8.5 21st century predictions (after 2005, results using predicted values for the various forcings. For details on this process, see Santer et al., 2012), 341333=[7] Kundzewicz, Zbigniew W. and Stakhiv, Eugene Z.(2010) 'Are climate models “ready for prime time” inwater resources management applications, or is more research needed?', Hydrological Sciences Journal, 55: 7, 1085 —1089, 316159=We see that all 73 models anticipated greater warming than actually occurred for the period 1979-2012. Of importance here too is that the balloons and satellites represent two independent observing systems but they display extremely consistent results. This provides a relatively high level of confidence that the observations as depicted here have small errors. The observational trends from both systems are slightly less than +0.06 °C/decade which is a value insignificantly different from zero. The mean TMT model trend is +0.26 °C/decade which is significantly positive in a statistical sense. The observed satellite and balloon TLT trends (not shown) are +0.10 and +0.09 °C/decade respectively, and the mean model TLT trend is +0.28 °C/decade. In a strict hypothesis test, the mean model trend can be shown to be statistically different from that of the observations, so that one can say the model-mean has been falsified (a result stated in a number of publications already for earlier sets of model output.) In other words, the model mean tropical tropospheric temperature trend is warming significantly faster than observations (See Douglass and Christy 2013 for further information.), 430675=More recently, another paper [2] followed somewhat similar ideas, although for the Arctic temperature rather than the global mean. A discussion ensued after my posting of ‘What is signal and what is noise?’ on RealClimate.org. A meeting is planned in Tromsø, Norway in the beginning of May to discuss our differences - much in the spirit of Climate Dialogue., 177691=Some recent papers which explore the CMIP ensembles have presented arguments that the climate models with the higher sensitivities tend to be more realistic when we examine them in various ways (e.g. Fasullo and Trenberth 2012, Shindell 2014). If these results are correct, then the current moderate warming rate is a bit of an aberration, and so a substantial acceleration in the warming rate can be expected to occur in the near future, sufficient not only to match the modelled warming rate, but even to catch up the recent lost ground. It must be noted that these analyses are primarily qualitative in nature, in that they do not provide quantitative probabilistic estimates of the sensitivity (instead merely arguing that higher values are preferred). Thus it is difficult to judge whether they really do contradict analyses based on the recent warming., 294187=Confidence and Implications for Atmospheric Physics I first became interested in the tropical lapse rate (now alternatively known as “hot spot”) issue around 2001, shortly after it was raised in a prominent paper in Science (Gaffen et al. 2000). I had been using radiosonde data to look at wind fields and temperature trends near the tropical tropopause and lower stratosphere. This new problem drew my attention because I was interested in how tropical atmospheric convection (e.g. storms) responds to its environment, one of the grand unsolved problems in atmospheric modelling. Tropical convection was supposed to prevent the kind of lapse-rate changes that were being reported, so what was going on?, 197689=The general lack of strong decadal shifts in total OHC have recently been corroborated by estimates of global thermometric sea level rise from satellite altimetry, which show remarkable persistence in the rate of thermometric expansion since 1993 (15). Further, efforts to deduce variability in the planetary imbalance from the satellite record of top of atmosphere radiative fluxes also find little change between the 1990s and 2000s (Richard Allan, personal communication)., 389846=· Driscoll, S., A. Bozzo, L. J. Gray, A. Robock, and G. Stenchikov (2012), Coupled Model Intercomparison Project 5 (CMIP5) simulations of climate following volcanic eruptions, J. Geophys. Res., 117, D17105, doi:10.1029/2012JD017607. published 6 September 2012., 291805=Morice, C. P., J. J. Kennedy, N. A. Rayner, and P. D. Jones (2012),Quantifying uncertainties in global and regional temperature change using an ensemble of observational estimates: The HadCRUT4 data set, J. Geophys. Res., 117, D08101, doi:10.1029/2011JD017187. (This discussed HadCRUT4 and the HadCRUT4 error ensembles), 56852=Solar Influences on Regional/Seasonal Climates This is an area of some academic debate, but there is a growing body of evidence that there are effects of solar changes on some regional and seasonal climates [see reviews by Gray et al., 2010, Lockwood et al., 2012]. The mechanisms largely involve modulation of the jet stream (particularly in the northern hemisphere which is different from that in the south because it passes over much more complex ground orography than the southern jet stream which is largely over ocean)., 106120=My preferred temperature reconstruction for the last 2000 years is Ljungqvist (2010) for the extra-tropical Northern Hemisphere as shown in Figure 6. This reconstruction utilizes many paleo-temperature proxies never before included in any large-scale temperature reconstruction. It shows clearly the Roman and Medieval warm periods. The difference between the warmest decade (950-959) and the coldest (1690-1699) is 0.9 °C in this reconstruction. The author admits there is a divergence problem also in his reconstruction, i.e. that the tree-ring growth shows lower temperature in the last decades of the 20th century than the thermometer measurements suggest. The author also concludes that the cooling during the Little Ice Age (LIA) probably is larger than his estimates, since the trees reflect summer temperatures, while other seasons may have cooled more., 358275=Pielke, R. A., Sr., R. Wilby, D. Niyogi, F. Hossain, K. Dairuku,J. Adegoke, G. Kallos, T. Seastedt, and K. Suding (2012), Dealing with complexity and extreme events using a bottom-up, resource-based vulnerability perspective, in Extreme Events and Natural Hazards: The Complexity Perspective, Geophys. Monogr. Ser., vol. 196, edited by A. S. Sharma et al. 345–359, AGU, Washington, D. C., doi:10.1029/2011GM001086., 415743=Pielke Sr., R.A. 2013b: Comment on “The North American Regional Climate Change Assessment Program: Overview of Phase I Results.” Bull. Amer. Meteor. Soc., in press. doi: 10.1175/BAMS-D-12-00205.1. http://pielkeclimatesci.files.wordpress.com/2013/02/r-372.pdf, 5906=Sunspot records since 1600 suggest there has been a considerable increase in solar activity in the 20th century leading to a Grand Solar Maximum or Modern Maximum. However recently these sunspot records have come under increasing scrutiny and newer reconstructions show a much ‘flatter’ sunspot history. This challenges the idea of a Modern Maximum., 68326=Willson, R.C. (1997) Total Solar Irradiance Trend During Solar Cycles 21 and 22, Science, 277 (5334), 1963-1965. doi: 10.1126/science.277.5334.1963, 289405=J. R. Christy, R. W. Spencer, W. B. Norris, W. D. Braswell, and D. E. Parker, “Error estimates of version 5.0 of MSU-AMSU bulk atmospheric temperatures,” Journal of Atmospheric and Oceanic Technology, vol. 20, no. 5, pp. 613-629, 2003., 47770=Because TSI is undoubtedly related to sunspot number, it is instructive to do the same analysis for sunspot numbers. Figure 2 shows annual means (in grey) of extended and corrected sunspot number, RC. This sequence is very similar to others and its precise derivation is discussed in Lockwood et al. [2014]. The blue line shows the 11-year running means of these sunspot data. The value for 2009 is 32.4, and the last time we saw such low average levels of sunspot number was 1900. This value was also seen in the fall into, and recovery out of, the Dalton minimum and also applies around 1750., 328227=Christy, J.R., B. Herman, R. Pielke, Sr., P. Klotzbach, R.T. McNider, J.J. Hnilo, R.W. Spencer, T. Chase and D. Douglass, (2010): What do observational datasets say about modeled tropospheric temperature trends since 1979? Remote Sens. 2, 2138-2169., 65095=Kaufmann, R., H. Kauppi, M. Mann, and J. Stock (2011), Reconciling anthropogenic climate change with observed temperature 1998–2008, Proc. Natl. Acad. Sci., 108 (29), 11,790., 73120=On longer time scales the solar influence on climate becomes clearer once appropriate solar proxy models are used (e.g.: Eddy, 1976; Hoyt and Schatten, 1997; Kirkby, 2007). Steinhilber et al. (2012) found an excellent correlation between a 9,400-year cosmic ray proxy model of solar activity from ice cores and tree rings and the Holocene Asian climate as determined from stalagmites in the Dongge cave, China. In particular, data show a strong millennial oscillation common to both solar and temperature records (e.g.: Bond et al., 2001; Kerr, 2001) that must have contributed significantly to the warming observed since 1850., 416019=Pielke, R. A. Sr.and L. Bravo de Guenni, 2004: Conclusions. Vegetation, Water, Humans and the Climate: A New Perspective on an Interactive System, P. Kabat et al., Eds., Springer, 537–538. http://pielkeclimatesci.files.wordpress.com/2010/01/cb-42.pdf, 171150=Otto, A., F. E. L. Otto, O. Boucher, J. Church, G. Hegerl, P. M. Forster, N. P. Gillett, J. Gregory, G. C. Johnson, R. Knutti, N. Lewis, U. Lohmann, J. Marotzke, G. Myhre, D. Shindell, B. Stevens and M. R. Allen, 2013. Energy budget constraints on climate response. Nature Geosci., 6: 415–416., 244954=Knutti, R. and G.C. Hegerl, 2008. The equilibrium sensitivity of the Earth's temperature to radiation changes. Nature Geoscience;1: 735–743., 245501=Libardoni, A.G. and C.E.Forest, 2013. Correction to ‘Sensitivity of distributions of climate system properties to the surface temperature dataset’. Geophys. Res. Lett.; doi:10.1002/grl.50480., 450155=14. Marcott, S. A., Shakun, J. D., Clark, P. U. & Mix, A. C. A Reconstruction of Regional and Global Temperature for the Past 11,300 Years. Science 339, 1198–1201 (2013)., 392253=· Stephens, G. L., T. L’Ecuyer, R. Forbes, A. Gettlemen, J.‐C. Golaz, A. Bodas‐Salcedo, K. Suzuki, P. Gabriel, and J. Haynes (2010), Dreary state of precipitation in global models, J. Geophys. Res., 115, D24211, doi:10.1029/2010JD014532., 61627=But I also dislike the name as it is inherently misleading: this period was not an ice age in any shape or form. For example, the Central England Temperature (CET) is the longest series of temperature measurements in existence, starting in 1659 and continuing to the present day. The CET data for the Maunder minimum show that there was a higher occurrence frequency of cold winters in this interval. However, the term “little ice age” implies that they were unremittingly cold. This is not the case. For example, the coldest winter in the CET record is 1683-4, right in the middle of the Maunder minimum; but the winter just two years later was the fifth hottest in the whole 350-year CET record. Furthermore, there are many examples of hot summers during the Maunder minimum. Hence, in central England at least, it was not unremittingly cold – far from it!, 243309=Forster, P.M.D., and J.M. Gregory, 2006. The climate sensitivity and its components diagnosed from Earth radiation budget data. J.Clim.,19: 39–52., 133341=Gray, L., et al., Solar Influences on Climate, Rev. Geophys., 48, RG4001, 2010., 134289=Shapiro, A. et al., A new approach to the long-term reconstruction of the solar irradiance leads to large historical solar forcing, Astron. Astrophys., 529, 67, 2011., 289853=L. Haimberger, “Homogenization of radiosonde temperature time series using innovation statistics,” Journal of Climate, vol. 20, no. 7, pp. 1377-1403, 2007. (This describes the RAOBCORE dataset), 183147=Armour, K. C., Bitz, C. M., & Roe, G. H. (2013). Time-Varying Climate Sensitivity from Regional Feedbacks. Journal of Climate, 26, 4518–4534. doi:10.1175/JCLI-D-12-00544.1, 419920=Update 28 April 2014: Climate Dialogue summaries now online The summary of the second Climate Dialogue discussion on long-term persistence is now online (see below). We have made two versions: a short and an extended version. We apologize for the delay in publishing the summary., 63209=Feulner, G., and S. Rahmstorf (2010) On the effect of a new grand minimum of solar activity on the future climate on Earth, Geophys. Res. Lett., 37, L05707, doi:10.1029/2010GL042710., 133886=Lockwood, M., Owens, M. J., Barnard, L., Centennial variations in sunspot number, open solar flux, and streamer belt width: 1. Correction of the sunspot number record since 1874, J. Geophys. Res., 119, 5172, 2014., 416524=Pielke Sr., R.A., R. Wilby, D. Niyogi, F. Hossain, K. Dairaku, J. Adegoke, G. Kallos, T. Seastedt, and K. Suding, 2012: Dealing with complexity and extreme events using a bottom-up, resource-based vulnerability perspective. Extreme Events and Natural Hazards: The Complexity Perspective Geophysical Monograph Series 196 © 2012. American Geophysical Union. All Rights Reserved. 10.1029/2011GM001086. http://pielkeclimatesci.files.wordpress.com/2012/10/r-3651.pdf, 118555=Solheim, J.-E. The sunspot cycle length – modulated by plants?, Pattern Recogn. Phys. 1, 159-164, 2013, 292251=Santer, B. D., J. F. Painter, C. A. Mears, C. Doutriaux, P. Caldwell, J. M. Arblaster, P. J. Cameron-Smith, N. P. Gillett, P. J. Gleckler, J. Lanzante, J. Perlwitz, S. Solomon, P. A. Stott, K. E. Taylor, L. Terray, P. W. Thorne, M. F. Wehner, F. J. Wentz, T. M. L. Wigley, L. J. Wilcox, and C. Z. Zou, 11-29-2012: Identifying Human Influences on Atmospheric Temperature. Proceedings of the National Academy of Sciences, 110, 26-33, 10.1073/pnas.1210514109. (This describes, amoung other things, the construction of the 1979-2012 model datasets by combining 20th century simulations with RCP8.5 21st century predictions), 357773=Min, E., W. Hazeleger, G.J. van Oldenborgh en A. Sterl (2013), Evaluation of trends in high temperature extremes in North-Western Europe in regional climate models; Environmental Research Letters, 8, 1, 014011, doi:10.1088/1748-9326/8/1/014011., 315532=Figure 1. Time series of the mid-tropospheric temperature (TMT) of 73 CMIP-5 climate models (rcp8.5) compared with observations (circles are averages of the four balloon datasets and squares are averages of the two satellite datasets.) Values are running 5-year averages for all quantities. [There are four basic rcp emission scenarios applied to CMIP-5 models, but their divergence occurs after 2030. Thus, for our comparison which ends in 2012, there are essentially no differences among the rcp scenarios.] The model output for all figures was made available by the KNMI Climate Explorer., 29073=Advances in Space Research 40, 1173–1180., 5399=According to some more skeptical scientists such a small solar influence is counterintuitive. The Little Ice Age, the period roughly from 1350 to 1850, in which winters on the Northern Hemisphere could be severe and glaciers advanced, coincided with the so-called Maunder Minimum, a period of supposedly low solar activity. In their eyes, the sun therefore still is a serious candidate to also explain a substantial part of the warming since pre-industrial times., 98656=Willson and Mordvinov (2003), Willson, R. C., A. V. Mordvinov: Secular total solar irradiance trend during solar cycles 21–23. Geophys. Res. Lett. 30, (2003) 1199., 101814=The reconstruction by D. Hoyt and K. Schatten (1993) updated with the ACRIM data (Scafetta, 2013) gives a remarkable good correlation with the Central England temperature back to 1700. This is shown in the figure below., 119527=Steele, D., Earth’s Orbit and Contemporary Climate Change, 2014 http://www.duncansteel.com/archives/996, 248139=de Szoeke, S.P. et al, 2012. Observations of Stratocumulus Clouds and Their Effect on the Eastern Pacific Surface Heat Budget along 20°S. J. Clim, 25, 8542–8567., 197221=When this vertical structure is averaged out, for example by considering the total ocean heat content (OHC) from the surface to 2000 meter (Figure 1) the data show remarkable constancy in the rate of warming from the 1990s through 2000s. They also show a dramatic shift in how that warming has occurred as a function of ocean depth between decades, with the uppermost layers warming little in recent years in conjunction with rapid warming at depth., 89353=Bond et al. (2001), Bond, G., B. Kromer, J. Beer, R. Muscheler, M. N. Evans, W. Showers, S. Hoffmann, R. Lotti- Bond, I. Hajdas, G. Bonani: Persistent solar influence on North Atlantic climate during the Holocene. Science 294 (2001) 2130–2136., 73766=In fact, Christiansen and Ljungqvist (2012) showed that the extra tropical surface temperature of the northern hemisphere experienced significant warm periods during the Roman Optimum (100 B.C. - 300 A.D.), and during the Medieval Warm Period (900-1400 A.D.) and significant cool periods during the Dark Age (400-800 A.D.) and the Little Ice Age (1400-1800 A.D.) (Christiansen and Ljungqvist, 2012)., 307835=Wentz, F. J., L. Ricciardulli, K. Hilburn and C. Mears, 2007, How much more rain will global warming bring?, Science, Vol. 317, 233-235., 93296=Scafetta and West (2007), Scafetta, N., B. J. West: Phenomenological reconstruction of the solar signature in the NH surface temperature records since 1600. Journal of Geophysical Research 112 (2007) D24S03., 20929=Figure 8: Sunspot numbers during solar cycles 23 and 24, updated in May 2014. Source: David Hathaway, Nasa. http://solarscience.msfc.nasa.gov/predict.shtml, 329280=Stevens, B. and S. Bony, 2013. What Are Climate Models Missing? Science. 31 May 2013. Doi:10.1126/science/1237554., 204205=Dr. Fasullo studies processes involved in climate variability and change using both observations and models with a focus on the global energy and water cycles. He has published over 50 peer-reviewed papers dealing with aspects of this work, aimed primarily at understanding variability in clouds, the tropical monsoons, and the global water and energy cycles. His work has centered on identifying strengths and weakness across observations and models, and has emphasized the benefits of holistic evaluation of the climate system with multiple datasets, theoretical constraints, and novel techniques. Dr. Fasullo is a member of various committees and science teams, and participated in the IPCC AR4 report that contributed to the award of the Nobel Peace Prize to IPCC in 2007., 278597=Now, I will turn my attention to one of the core questions of this discussion – “can we detect/have detected a hot spot in the observations “. On monthly time scales, there is no question. If we average across the tropics, the temperature of the upper troposphere is strongly correlated with the temperature of the surface, only with larger amplitude (Santer et al., 2005). On decadal time scales, the results obtained depend on the datasets chosen, as Santer 2005 showed for the RSS and UAH satellite datasets and a few homogenized radiosonde datasets. Here we expand this a little further to include more homogenized radiosonde datasets and two of the more recent reanalysis datasets, MERRA and ERA-Interim. Figure 1 shows the ratio of the mid to upper tropospheric temperature trends to surface temperature trends in the deep tropics (20S to 20N). Each point on the graph is the trend starting in January 1979, and ending at the date on the x-axis. The surface temperature is from HADCRUT4. The mid to upper tropospheric data is the “temperature tropical troposphere” product, or TTT, first introduced by Fu and Johanson (2005). For MSU/AMSU, it is equal to 1.1*TMT – 0.1*TLS. This combination has the effect of adjusting for the cooling effect of the stratosphere on TMT by subtracting off part of the stratospheric cooling measured by TLS. The weighting function for this product is centered in the mid to upper tropical troposphere, where we expect the hot spot to be most pronounced., 49438=Looking at 1750, the difference is not quite so great: the Shapiro et al. reconstruction gives around 1364. 5 Wm-2 which is 1.3 Wm-2 lower than we would estimate from the recent TSI data. Hence the Shapiro et al. reconstruction appears to overestimate both the long term trend in TSI after 1900 and the fluctuation level before 1900. The value of TSI for 1750 and 1900 of 1365.77 Wm-2 inferred here does agree very well with many other recent reconstructions of TSI [for example, Wang et al., 2005; Foukal et al., 2006; Krivova et al., 2011; Schrijver et al., 2011]., 244738=Knutti, R., T.F. Stocker, F. Joos, and G.-K. Plattner, 2002. Constraints on radiative forcing and future climate change from observations and climate model ensembles. Nature, 416: 719–723., 244328=Harris, G.R., D.M.H. Sexton, B.B.B. Booth, M. Collins, and J.M. Murphy, 2013. Probabilistic projections of transient climate change. Clim. Dynam., doi:10.1007/s00382–012–1647-y., 313797=For a layer-average of the tropospheric temperature there are two satellite-based tropospheric datasets (known as UAH and RSS) which have by independent methods combined the readings from several spacecraft carrying microwave instruments into a time series beginning in late 1978. There are dozens of publications which detail the methods used by the various groups to generate both balloon and satellite products. Through the years each group has updated their products as new information has come to light, and we use the latest versions as of June 2013., 104974=As shown in Figure 5, lower panel, the 10-yr average sunspot no has never been as high the last 1000 yrs as in the last part of the 20th century. In the same graph I have shown a first harmonic component, with period 190 years, of the timing of sunspot minima. This period apparently controls the timing of sunspot minima. When this curve is near minima or is ascending, sunspot periods become longer, and arrive delayed. This was for the first time demonstrated by Richards et al. (2009)., 247136=Ring, M.J., D. Lindner, E.F. Cross, and M.E. Schlesinger, 2012. Causes of the global warming observed since the 19th century. Atmos. Clim. Sci., 2: 401–415., 108454=Stauning’s conclusion is that the solar activity relation can explain the temperature anomaly in the period 1860-1990, but from then on another components appears. He concludes that the reduction in solar activity disguises a global temperature rise that otherwise would have happened., 77348=(1) The analytical models such as the CMIP5 GCMs adopted by the IPCC (2013) have used a solar forcing function deduced only from a specific total solar irradiance proxy record that shows only a very small secular variability (e.g. Wang et al. (2005)), while alternative total solar irradiance proxy models showing a far greater secular variability and different details in the patters also exist (Hoyt and Schatten, 1997; Shapiro et al., 2011). These alternative solar models better correlate with the temperature patterns on multiple scales and reconstruct a large fraction of the warming observed since 1850 (Scafetta, 2013b; Hoyt and Schatten, 1997; Soon, 2009; Soon, 2005; Soon and Legates, 2013)., 412860=Castro, C.L., R.A. Pielke Sr., J. Adegoke, S.D. Schubert, and P.J. Pegion, 2007: Investigation of the summer climate of the contiguous U.S. and Mexico using the Regional Atmospheric Modeling System (RAMS). Part II: Model climate variability. J. Climate, 20, 3866-3887. http://pielkeclimatesci.wordpress.com/files/2009/10/r-307.pdf, 62504=Biosketch Prof. Mike Lockwood is a professor of space environment physics with the Department of Meteorology, University of Reading, UK. He has received five international academic awards and in 2006 was elected as a Fellow of the Royal Society of London. Prof. Lockwood studies variations in the Sun on all timescales up to millennia and their effects on near-Earth space, Earth's atmosphere and climate. His quantification of the variation in the open solar magnetic flux using geomagnetic activity observations provided a constraint which allowed physics-based reconstruction of total solar irradiance over the past 10,000 years., 86314=Finally Figure 4A compares the four CMIP5 climate model ensemble average projections versus the HadCRUT4 global surface temperature record. Figure 4B shows the solar–astronomical semi-empirical model against the HadCRUT4 GST record: a common 1900–2000 baseline is used. The ﬁgure highlights the better performance of the solar–astronomical semi-empirical model versus the CMIP5 models, which is particularly evident since 2000 as shown in the inserts., 68137=Wang, Y. M., J. Lean, and N. Sheeley, Jr. (2005) Modeling the Sun’s magnetic field and irradiance since 1713. Astrophys. J., 625, 522–538. doi:10.1086/429689, 225619=Gregory & Forster (2008) – regressed global temperature on anthropogenic forcing (excluding years with strong volcanism) over 1970–2006. That period coincided with the upswing half of the Atlantic Multidecadal Oscillation cycle, to which 0.1–0.2°C of the 0.5°C temperature rise was probably attributable. Regressing over 70 years using AR5 forcings gives a TCR best estimate of 1.3°C., 154552=Vieira, L.E.A., Solanki, S.K., Krivova, N.A., Usoskin, I.G.: 2011, Astron. Astrophys. 531, A6., 95062=Scafetta (2013c), Scafetta, N.: Discussion on common errors in analyzing sea level accelerations, Solar Trends and Global Warming. Pattern Recogn. Phys. 1 (2013c) 37-57. http://dx.doi.org/10.5194/prp-1-37-2013, 64680=Ineson, S. et al. (2011) Solar forcing of winter climate variability in the Northern Hemisphere, Nature Geoscience, 4, 753–757, doi:10.1038/ngeo1282., 182718=Annan, J. D., & Hargreaves, J. C. (2006). Using multiple observationally-based constraints to estimate climate sensitivity. Geophysical Research Letters, 33(6), 1–4. doi:10.1029/2005GL025259, 246071=Meinshausen, Malte, Nicolai Meinshausen, William Hare, Sarah C. B. Raper, Katja Frieler, Reto Knutti, David J. Frame, Myles R. Allen, 2009: Greenhouse gas emission targets for limiting global warming to 2°C. Nature, doi: 10.1038/, 245309=Libardoni, A.G. and C.E.Forest, 2011. Sensitivity of distributions of climate system properties to the surface temperature dataset. Geophys. Res. Lett.; 38, L22705., 246551=Olson, R., R. Sriver, M. Goes, N.M. Urban, H.D. Matthews, M. Haran, and K. Keller, 2012. A climate sensitivity estimate using Bayesian fusion of instrumental observations and an Earth System model. J. Geophys. Res. Atmos.,117: D04103., 14713=Figure 4: direct TSI measurements by satellite since 1978. Replication of AR5 figure 8.10., 414544=Pielke Sr., R.A.,, 2004: A broader perspective on climate change is needed. Global Change Newsletter, No. 59, IGBP Secretariat, Stockholm, Sweden, 16–19. http://pielkeclimatesci.files.wordpress.com/2009/09/nr-139.pdf, 100665=It should be emphasized that Central Greenland temperature changes are not identical to global temperature changes. However, they tend to reflect planetary temperature changes with a decadal-scale delay. The GISP2 record ends in 1855 before the onset of the 20th Century warming. A simple harmonic model based on wavelet analysis, which we may call a natural cycle model, with only 3 long periods (2800, 1190 and 560 yr) is used to forecast the observed warming until 2800 (Humlum et al., 2011). This indicates that the modern maximum will peak at some time this century. A more detailed harmonic analysis and a comparison with the HadCRUT4 temperature data set shows that we are close to the peak of this long period cycle, which will have a maximum around 2060 (Solheim, 2013a)., 8905=Figure 1: Radiative forcing estimates in 2011 relative to 1750 and aggregated uncertainties for the main drivers of climate change. Replicated from figure SPM.5 in AR5., 152953=Meehl, G. A., J. M. Arblaster, and D. R. Marsh (2013), Could a future grand solar minimum like the maunder minimum stop global warming?, Geophys. Res. Lett., 40(9), 1789–1793., 67282=Loehle, C., and N. Scafetta (2011), Climate change attribution using empirical decomposition of climatic data, Open. Atmos. Sci. J., 5, 74–86, doi: 10.2174/1874282301105010074., 19702=Sunspots Sunspots are probably the most well-known proxy for the sun. Sunspots - darks spots on the sun caused by intense magnetic activity - are counted since 1610 (see figure 3 below). Although the dark sunspots are cooler areas at the surface of the sun, the surrounding margins of sunspots are brighter than the average. Overall, more sunspots increase the Sun's solar brightness. Sunspots were rarely observed during the Maunder Minimum in the second part of the 17th century (approximately from 1645 to 1715) for reasons which are not yet fully understood., 99201=According to the latest IPCC report, AR5, the influence of the Sun on our climate since pre-industrial times, in terms of radiative forcing, is very small compared to the effect of greenhouse gases. Figure 1 in the introduction (SPM.5 in AR5) is quite misleading, since it compares the TSI at solar minimum around 1745 with TSI around minimum in 2008. They are apparently the same. This covers the fact that the Sun has changed quite a lot in the time between., 376431=[7] di Luca A, Elía R de, Laprise R (2012) Potential for added value in precipitation simulated by high-resolution nested Regional Climate Models and observations. Clim Dyn 38:1229–1247, 341995=[10] Kundzewicz, Zbigniew W. and Stakhiv, Eugene Z.(2010) 'Are climate models “ready for prime time” in water resources management applications, or is more research needed?', Hydrological Sciences Journal, 55: 7, 1085 —1089, 27832=1) What is according to you the “best” solar reconstruction since 1600 (or even 1000) in terms of Total Solar Irradiance?, 409672=Biosketch Roger A. Pielke Sr. is currently a Senior Research Scientist in CIRES and a Senior Research Associate at the University of Colorado-Boulder in the Department of Atmospheric and Oceanic Sciences (ATOC) at the University of Colorado in Boulder (November 2005 -present). He is also an Emeritus Professor of Atmospheric Science at Colorado State University and has a five-year appointment (April 2007 - March 2012) on the Graduate Faculty of Purdue University in West Lafayette, Indiana. Pielke has studied terrain-induced mesoscale systems, including the development of a three-dimensional mesoscale model of the sea breeze, for which he received the NOAA Distinguished Authorship Award for 1974. Dr. Pielke has worked for NOAA's Experimental Meteorology Lab (1971-1974), The University of Virginia (1974-1981), and Colorado State University (1981-2006). He served as Colorado State Climatologist from 1999-2006. He was an adjunct faculty member in the Department of Civil and Environmental Engineering at Duke University in Durham, North Carolina (July 2003-2006). He was a visiting Professor in the Department of Atmospheric Sciences at the University of Arizona from October to December 2004. Roger Pielke Sr. was elected a Fellow of the AMS in 1982 and a Fellow of the American Geophysical Union in 2004. From 1993-1996, he served as Editor-in-Chief of the US National Science Report to the IUGG (1991-1994) for the American Geophysical Union. From January 1996 to December 2000, he served as Co-Chief Editor of the Journal of Atmospheric Science. In 1998, he received NOAA's ERL Outstanding Scientific Paper (with Conrad Ziegler and Tsengdar Lee) for a modeling study of the convective dryline. He was designated a Pennsylvania State Centennial Fellow in 1996, and named the Pennsylvania State College of Earth and Mineral Sciences Alumni of the year for 1999 (with Bill Cotton). He is currently serving on the AGU Focus Group on Natural Hazards (August 2009-present) and the AMS Committee on Planned and Inadvertent Weather Modification (October 2009-present). He is among one of three faculty and one of four members listed by ISI HighlyCited in Geosciences at Colorado State University and the University of Colorado at Boulder, respectively. Dr. Pielke has published over 370 papers in peer-reviewed journals, 55 chapters in books, co-edited 9 books, and made over 700 presentations during his career to date. A listing of papers can be viewed at the project website: http://cires.colorado.edu/science/groups/pielke/pubs/. He also launched a science weblog in 2005 to discuss weather and climate issues. This weblog was named one of the 50 most popular Science blogs by Nature Magazine on July 5, 2006 and is located at http://pielkeclimatesci.wordpress.com/., 238575=Decadal trends for the 1988–2012 period in tropical (20°S to 20°N) lower tropospheric temperature (TLT) over the oceans are shown along the x-axis. Coloured symbols are from CMIP5 models. The black cross (UAH) and black star (RSS) show trends per satellite observations. Other black symbols are from model-based data reanalyses. All but two CMIP5 models exhibit higher TLT trends than UAH and RSS., 358794=Pitman, A., N. de Noblet, F. Avila, L. Alexander, J.P. Boissier, V. Brovkin, C. Delire, F. Cruz, M.G. Donat, V. Gayler, B.J.J.M. van den Hurk, C. Reick en A. Voldoire (2012): Effects of land cover change on temperature and rainfall extremes in multi-model ensemble simulations; Earth System Dynamics, 3, 213-231, doi:10.5194/esd-3-213-2012., 134767=Usoskin, I.G., S.K. Solanki, G.A. Kovaltsov, Grand minima and maxima of solar activity: new observational constraints, Astron. Astrophys., 471, 301-309, 2007., 183760=Klocke, D., Pincus, R., & Quaas, J. (2011). On constraining estimates of climate sensitivity with present-day observations through model weighting. Journal of Climate, 110525130752016. doi:10.1175/2011JCLI4193.1, 66798=Lockwood M., A.P. Rouillard AP, and I.D. Finch (2009) The rise and fall of open solar flux during the current grand solar maximum. Astrophys. J. 700, 937–944. doi:10.1088/0004-637X/700/2/937, 116089=Alley, R. B. The Younger Dryas cold interval as viewed from central Greenland, Quart. Sci. Rev. 19, 213-226, 2000, 97676=Svensmark and Friis-Christensen (2007), Svensmark, H., E. Friis-Christensen: Reply to Lockwood and Frhlich - The persistent role of the Sun in climate forcing. Danish National Space Center Scientific Report 3/2007. Available at http://www.space.dtu.dk/english/research/reports/scientific_reports, 328877=Guemas, V., F.J. Doblas-Reyes, I. Andrea-Burillo and M. Asif, 2012: Retrospective prediction of global warming slowdown in the past decade. Nature Clim. Ch., 3, 649-653, DOI:10.1038/nclimate1863., 152333=Krivský, L., Pejml, K.: 1988, Publ. Astron. Inst. Czech. Acad. Sciences 75, 116570=Humlum, O., Solheim J-E, Stordahl K. Identifying natural contributions to late Holocene climate change, Global and Planetary Change, 79, 145-156. 2011, 145787=Figure 5. Solar activity indexes for the period 1550-1800: (green)decadal sunspot numbers, reconstructed by Usoskin et al. (2014), (orange) 25-year moving average of the number of aurorae observed from Hungary (Rethly and Berkes 1963), and (blue) Group Sunspot Number (Hoyt and Schatten 1998, Vaquero et al. 2011)., 340459=[3] Anagnostopoulos, G. G., Koutsoyiannis, D., Christofides, A., Efstratiadis, A. &Mamassis, N. (2010) A comparison of local and aggregated climate model outputs with observed data. Hydrol. Sci. J. 55(7), 1094–1110, 98262=Wang et al. (2005), Wang, Y.-M., J. L. Lean, N. R. Sheeley Jr.: Modeling the sun's magnetic field and irradiance since 1713. Astrophys. J. 625 (2005) 522–538., 198758=Is such behavior surprising? Not really. As early as 2011, colleagues and I demonstrated that the NCAR CCSM4 reproduced periods analogous to the current hiatus, with hiatus periods accompanying changes in the vertical redistribution of heat driven by winds at low latitudes (17). Subsequent work has shown that similar behavior is evident across a wide range of GCMs. Recent observations have only reinforced the likelihood that the current hiatus is consistent with such simulated periods. The main question that persists relates mainly to the broader context for the hiatus, given the uncertainties surrounding internal variability, and just how unusual such an event may be., 119390=Stauning, P. Reduced Solar Activity Disguises Global Temperature Rise, Atmospheric and Climate Sciences, 4, 60-63, 2014, 123688=Figure 1: changes in TSI during the last millennium. Replication of figure 5.1b in IPCC’s AR5 report. The blue reconstruction is one published by Lean et al. 1995. Since the 90-ies reconstructions of the TSI have become considerably flatter suggesting that the influence of the sun through time is relatively small. See AR5 for all the references., 153401=Usoskin, I.G., A History of Solar Activity over Millennia, Living. Rev. Solar Phys., 10, 1, 2013., 102199=Figure 2: Total solar irradiance reconstruction by Hoyt and Schatten updated with the ACRIM record (since 1980) (the red curve) versus the updated Lean model used in the CMIP5 reconstructions (blue). The lower panel shows a comparison between the TSI model by Hoyt and Schatten and the Central England temperature record (From Scafetta, 2013, figure 15)­., 171568=Schwartz, S.E., 2012. Determination of Earth’s transient and equilibrium climate sensitivities from observations over the twentieth century: Strong dependence on assumed forcing. Surv. Geophys., 33: 745–777., 383141=Type 2 downscaling provides an effective way to provide increased value-added information on regional and local spatial scales. It is important to recognize, however, that type 2 downscaling is not a prediction (projection) for the cases where the global data comes from a reanalysis (e.g. a reanalysis is a combination of real world observations, folded into a global model). An example of this type of application is reported in Feser et al., 2011, Pielke 2013 and Mearns et al 2012, 2013b)., 184206=Ring, M. J., Lindner, D., Cross, E. F., & Schlesinger, M. E. (2012). Causes of the global warming observed since the 19th century. Atmospheric and Climate Sciences, 2, 401. doi:10.4236/acs.2012.24035, 34741=Geophysical Research Letters 39: L13701, doi:10.1029/2012GL051977; van Loon, H., and G. A. Meehl (2011), The average influence of decadal solar forcing on the atmosphere in the South Pacific region, Geophys. Res. Lett., 38, L12804, doi:10.1029/2011GL047794., 243714=Gillett, N.P., V.K. Arora, D. Matthews, P.A. Stott, and M.R. Allen, 2013. Constraining the ratio of global warming to cumulative CO2 emissions using CMIP5 simulations. J. Clim., doi:10.1175/JCLI-D-12–00476.1., 449214=9. Balmaseda, M. A., Trenberth, K. E. & Källén, E. Distinctive climate signals in reanalysis of global ocean heat content. Geophys. Res. Lett. n/a–n/a (2013). doi:10.1002/grl.50382, 444252=Furthermore, taking paleoclimatic information into account, there is no evidence that there have been similar temperature excursion in the past ~1000 years [12-14]. If the present warming was a result of natural fluctuations, it would imply a high climate sensitivity, and similar variations in the past. Moreover, it would suggest that any known forcing, such as GHGs, would be amplified accordingly. The climate sensitivity may be a common denominator for natural fluctuations and forced trends (Figure 3)., 184928=Shindell, D. T. (2014). Inhomogeneous forcing and transient climate sensitivity. Nature Climate Change, 4(4), 274–277. doi:10.1038/nclimate2136, 82962=Figure 2B shows that the radiosonde temperature anomalies, after an appropriate filtering of other climatic factors, reveals a clear signature of the 11-year solar cycle reconstructed by the cosmic ray record (Svensmark and Friis-Christensen, 2007). Figure 2C compares the instrumental global surface temperature record versus a SCL121 solar cycle length model (Thejll and Lassen, 2000). Figure 2D compares the annual-mean equator-to-pole gradient over the entire Northern Hemisphere versus the estimated total solar irradiance record (red) of Hoyt and Schatten (1997) (red, with updates by Scafetta and Willson (2014)) from 1850 to 2010 (Soon and Legates, 2013)., 295871=Small changes Although there has been more to-ing and fro-ing in the literature since then, as described in the opening article for this exchange, I still remain unconvinced that we can observe the small changes in temperature structure that are being discussed. Tests of radiosonde homogenisation methods (e.g., Thorne et al. 2011) show that they are often unreliable. MSU is not well calibrated and its homogenisation issues are also serious, as shown by the range of results previously obtained from this instrument series. To obtain upper-tropospheric trends from Channel 2 of MSU requires subtracting out a large contribution to trends in this channel coming from lower-stratospheric cooling. The latter remains highly uncertain due to a discrepancy between cooling rates in radiosondes and MSU. Tropical ozone trends are sufficiently uncertain so as to render either of these physically plausible (Solomon et al. 2012). I used to think (as do most others) that the radiosondes were wrong, but in Sherwood et al. 2008 we found (to my surprise) that when we homogenised the global radiosonde data they began to show cooling in the lower stratosphere that was very similar to that of MSU Channel 4 at each latitude, except for a large offset that varied smoothly with latitude. Such a smoothly varying and relatively uniform offset is very different from what we’d expect from radiosonde trend biases (which tend to vary at lot from one station to the next) but is consistent with an uncorrected calibration error in MSU Channel 4. If that were indeed responsible, it would imply that there has been more cooling in the stratosphere than anyone has reckoned on, and that the true upper-tropospheric warming is therefore stronger than what any group now infers from MSU data. By the way, our tropospheric data also came out very close to those published at the time by RSS, both in global mean and in the latitudinal variation (Sherwood et al., 2008)., 396879=· Van Oldenborgh, G.J., F.J. Doblas-Reyes, B. Wouters, W. Hazeleger (2012): Decadal prediction skill in a multi-model ensemble. Clim.Dyn. doi:10.1007/s00382-012-1313-4 who report quite limited predictive skill in two regions of the oceans on the decadal time period, but no regional skill elsewhere, when they conclude that \"A 4-model 12-member ensemble of 10-yr hindcasts has been analysed for skill in SST, 2m temperature and precipitation. The main source of skill in temperature is the trend, which is primarily forced by greenhouse gases and aerosols. This trend contributes almost everywhere to the skill. Variation in the global mean temperature around the trend do not have any skill beyond the first year. However, regionally there appears to be skill beyond the trend in the two areas of well-known low-frequency variability: SST in parts of the North Atlantic and Pacific Oceans is predicted better than persistence. A comparison with the CMIP3 ensemble shows that the skill in the northern North Atlantic and eastern Pacific is most likely due to the initialisation, whereas the skill in the subtropical North Atlantic and western North Pacific are probably due to the forcing.\", 79826=For example, one of the reasons why the IPCC claims that the sun has not contributed to the warming observed since 1970s is because the adopted solar model (Wang et al., 2005) suggests that the average solar activity was quite constant or even decreased during this period. This interpretation follows the PMOD total solar irradiance satellite composite by Fröhlich (2006). However, Scafetta and Willson (2009); Scafetta and Willson (2014) have shown that PMOD used altered total solar irradiance satellite records based on hypotheses that appear contradictory. On the contrary, the unaltered total solar irradiance satellite records are combined in the ACRIM composite which suggests that solar activity increased from 1980 to 2000 and decreased afterward (Willson and Mordvinov, 2003). Even if the direct effect of the total solar irradiance may be small and the difference between ACRIM and the PMOD might be climatically negligible, the pattern shown by the ACRIM composite suggests a dynamics, for example a 60-year oscillation, regulated by astronomical forcings whose harmonics are found in the climate system as well (Scafetta, 2010; Scafetta, 2013b; Scafetta, 2012a; Scafetta,2014). See the difference between the ACRIM and the PMOD composite here http://acrim.com/TSI%20Monitoring.htm., 117734=Scafetta, N. Does the Sun work as a nuclear fusion amplifier of planetary tidal forcing? A proposal for a physical mechanism based on the mass-luminosity relation, Journal of Atmospheric and Solar–Terrestrial Physics, 81—82, 27-40, 2012, 336073=Hundreds of studies have been published in the literature [1] presenting regional projections of climate change for 2050 and 2100. The output of such model simulations is then used by the climate impacts community to investigate what potential future benefits or threats could be expected. However several recent studies cast doubt whether global model output is realistic on a regional scale, even in hind cast. [2-5], 158944=An important discussion is what the pros and cons are of the various methods and studies and how these should be weighed to arrive at a particular range and a ‘best estimate’.  The latter was not given in AR5 because of “a lack of agreement on values across assessed lines of evidence”. Studies based on observations from the instrumental period (1850-2014) generally arrive at moderate values for ECS (and that led to a decrease of the lower bound for the likely range of climate sensitivity from 2°C in AR4 to 1.5°C in AR5). Climate models, climate change in the distant past (palaeo records) and climatological constraints generally result in (much) higher estimates for ECS., 332703=[Update 15 April 2015] Summaries online The summaries of the Climate Dialogue on Regional Modelling are now online (see links below). We have made two versions: an extended and a shorter version., 118893=Soon, W. Dutta, K., Legates D. R. Velasco, V. and Zhang, W. Variation in surface air temperature of China during the 20th Century, Journal of Atmospheric and Solar-Terrestrial Physics, 73, 2331-2344, 2011, 288966=B. D. Santer et al., “Amplification of surface temperature trends and variability in the tropical atmosphere,” Science, vol. 309, no. 5740, pp. 1511-1556, 2005., 340951=[5] J. Bhend, and P. Whetton, \"Consistency of simulated and observed regional changes in temperature, sea level pressure and precipitation\", Climatic Change, 2013. http://dx.doi.org/10.1007/s10584-012-0691-2, 299140=If I were looking for climate model defects, there are far more interesting and more damning ones around. For example, no climate model run for the IPCC AR4 (c. 2006) was able to reproduce the losses of Arctic sea ice that had been observed in recent decades (and which have continued accelerating since). No model, to my knowledge, produces the large asymmetry in warming between the north and south poles observed since 1980. Models underpredict the observed poleward shifts of the atmospheric circulation and climate zones by about a factor of three over this same period (Allen et al. 2012); cannot explain the warmings at high latitudes indicated by paleaoclimate data in past warm climates such as the Pliocene (Fedorov et al. 2013); appear to underpredict observed trends in the hydrological cycle (Wentz et al. 2007, Min et al. 2011) and in their simulated climatologies tend to produce rain that is too frequent, too light, and on land falls at the wrong time of day (Stephens et al. 2010). Finally, the tropical oceans are not warming as much as the land areas, or as much as predicted by most models, and this may be the root cause of why the recent warming of the tropical atmosphere is slower than predicted by most models (there is a nice series of posts about this on Isaac Held’s blog). What makes the “hot spot” more important than these other discrepancies which, in many cases, are supported by more convincing evidence? Is it because the “missing hot spot” can be spun into a tale of model exaggeration, whereas all the other problems suggest the opposite problem?, 184427=Rohling, E. J., Rohling, E. J., Sluijs, A., Dijkstra, H. A., Köhler, P., van de Wal, R. S. W., et al. (2012). Making sense of palaeoclimate sensitivity. Nature, 491(7426), 683–691. doi:10.1038/nature11574, 459991=The clustering of similar events, more formally described as Long-Term Persistence (LTP) is obvious. For example, around AD 780 we have a group of low values producing a low climatic value, and around 1110 and 1440 we have groups of large values. Such grouping would not appear in a climate that would be the synthesis of independent random events. The latter would be more flat as illustrated by the synthetic example of Figure 3., 66268=Lockwood, M. (2012) Solar Influence on Global and Regional Climate, Surveys in Geophysics , 33 (3), 503-534, doi: 10.1007/s10712-012-9181-3, 118675=Soon, W. Solar Arctic-mediated climate variation on multidecadal to centennial timescales: Empirical evidence, mechanistic explanation, and testable consequences. Physical Geography, 30, 144-184, 2009, 133752=Leussu, R., et al., Inconsistency of the Wolf sunspot number series around 1848, Astron. Astrophys., 559, A28, 2013., 237960=Over the slightly shorter 1988–2012 period, Figure 9.9 of AR5, reproduced here as Figure 5, shows an even more striking difference in trends in tropical lower tropospheric temperature over the oceans. The median model temperature trend (shown along the x-axis: the y-axis is not relevant here) is three times that of the average of the two observational datasets, UAH and RSS., 242930=Annan, J.D. and J.C. Hargreaves, 2006. Using multiple observationally-based constraints to estimate climate sensitivity. Geophys. Res. Lett., 33: L06704., 428019=[1] Cohn,. T. A., and H. F. Lins (2005), Nature's style: Naturally trendy,. Geophys. Res. Lett., 32, L23402, doi:10.1029/2005GL024476 [2] Koutsoyiannis, D., Montanari, A., Statistical analysis of hydroclimatic time series: Uncertainty and insights, Water Resour. Res., Vol. 43, W05429, doi:10.1029/2006WR005592, 2007 [3] Rybski, D., A. Bunde, S. Havlin, and H. von Storch (2006), Long-term persistence in climate and the detection problem, Geophys. Res. Lett., 33, L06718, doi:10.1029/2005GL025591 [4] Zorita, E., T. F. Stocker, and H. von Storch (2008), How unusual is the recent series of warm years?, Geophys. Res. Lett., 35, L24706, doi:10.1029/2008GL036228 [5] Lennartz, S., and A. Bunde. \"Trend evaluation in records with long‐term memory: Application to global warming.\" Geophysical Research Letters 36.16 (2009) [6] Lennartz, Sabine, and Armin Bunde. \"Distribution of natural trends in long-term correlated records: A scaling approach.\" Physical Review E 84.2 (2011): 021129, 119835=Usoskin, I. G., Solanki, S. A., Kovaltsov, G. A. Grand minima and maxima of solar activity: new observational constraints, Astron. Astrophys., 471, 301-309, 2007, 446502=Biosketch Rasmus Benestad is a physicist by training. Benestad has a D.Phil in physics from Atmospheric, Oceanic & Planetary Physics at Oxford University in the United Kingdom. He has affiliations with the Norwegian Meteorological Institute. Recent work involves a good deal of statistics (empirical-statistical downscaling, trend analysis, model validation, extremes and record values), but he has also had some experience with electronics, cloud micro-physics, ocean dynamics/air-sea processes and seasonal forecasting. In addition, Benestad wrote the book ‘Solar Activity and Earth’s Climate’ (2002), published by Praxis-Springer, and together with two colleagues the text book ‘Empirical-Statistical Downscaling’ (2008; World Scientific Publishers). He has also written a number of R-packages for climate analysis posted on http://cran.r-project.org. Benestad was a member of the council of the European Meteorological Society for the period (2004-2006), representing the Nordic countries and the Norwegian Meteorology Society, and he has served as a member of the CORDEX Task Force on Regional Climate Downscaling. He is a regular contributor to the well-known climate blog RealClimate.org., 4555=UPDATE: The Ministry of Infrastructure and the Environment stopped financing Climate Dialogue, at which point both PBL Netherlands Environmental Assessment Agency and the Royal Netherlands Meteorological Institute (KNMI) stopped their involvement in this project. The blog ClimateDialogue will remain online until 1 January 2016 and Marcel Crok will take on the responsibility for its continuation. Neither PBL nor KNMI will be responsible for any text written after 1 January 2015., 130258=The issue is that no one knows when the new Grand Minimum occurs and no one really knows what would happen then. I call such extended minima of suppressed solar activity Grand Minima, since the Maunder Minimum (lasting from 1645 till about 1700 or 1712) is only one of those. Later minima, such as the Dalton Minimum (ca. 1800 AD) and modern (ca. 1900 AD) ones were not really Grand Minima, in neither depth or duration., 115056=Biosketch Jan-Erik Solheim is a retired professor from University of Tromsø, Norway. He received his Cand. Real. degree in Astrophysics from University of Oslo in 1964. He has worked with cosmological models and observational astrophysics during several visits to University of Texas, Department of Astronomy, the McDonald Observatory and other institutes. From 1971 to 2002 he had a position at the Institute for Physics and Technology at the University of Tromsø, where he became interested in fast photometry and detection of signals from pulsating and interacting stars. He participated in establishing the Nordic Optical Telescope at La Palma, Spain and participated in coordinated world wide observing campaigns (Whole Earth Telescope) from 1987. After retirement he has worked as an independent scientist on some aspects of relations between the Sun and Earth and the possibility of detecting signals from planets in solar and climate variations., 248815=Tung, K-K and J Zhou, 2013. Using data to attribute episodes of warming and cooling in instrumental records. PNAS, 110, 6, 2058–2063, 124760=The very existence of the Grand Maximum is not questioned by others I think. As e.g. stated by Clette et al. (Space Sci. Rev., 2014 in press): “The recalibrated series may thus indicate that a Grand Maximum needs to be redefined as a tight repetition/clustering of strong cycles over several decades, without requiring exceptionally high amplitudes for those cycles compared to other periods.” This indicates that even in the “corrected” sunspot series the Grand Maximum is observed as a period of clustering of several consecutive high cycles, even though the height of the cycles is not unique., 118177=Scafetta, N. and Willson, R. C. Empirical evidences for a planetary modulation of total solar irradiance and the TSI signature of the 1.09-year Earth-Jupiter conjunction cycle, Astrophysics Space Sci DOI 10.1007/s10509-013-1558-3, 2013, 185402=Yoshimori, M., Hargreaves, J. C., Annan, J. D., Yokohata, T., & Abe-Ouchi, A. (2011). Dependency of Feedbacks on Forcing and Climate State in Physics Parameter Ensembles. Journal of Climate, 24(24), 6440–6455. doi:10.1175/2011JCLI3954.1, 133192=Calisto, M., et al., Influence of Galactic Cosmic Rays on atmospheric composition and dynamics, Atmos. Chem. Phys., 11, 4547, 2011., 108836=If all the warming up to 1990 is due to the Sun as proposed by Stauning (2014) in equation (1), this means that we have experienced about 0.5°C warming by the Sun in the period 1900-1990. After 1990 the reduced solar activity related to sunspots has disguised a warming of about 0.6°C (Figure 7), making the observed warming between the decades 1985-95 to 2003-13 only 0.3 °C., 65761=Lean, J., and D. H. Rind (2008), How natural and anthropogenic influences alter global and regional surface temperatures: 1889 to 2006, Geophys. Res. Lett., 35, L18,701, doi:10.1029/2008GL034864., 67987=Uppala S.M. et al. (2005) The ERA-40 re-analysis. Q. J. R. Meteorol. Soc., 131 (612), 2961–3012. doi:10.1256/qj.04.176, 171461=Paleosens Members, 2012. Making sense of palaeoclimate sensitivity. Nature, 491: 683–691., 147893=I have computed the average sunspot number using only the direct information about sunspots that appear in this historical source. My results indicate an average value of GSN equal to 3 and 4 for the periods 1659-1661 and 1653-1663, respectively. In contrast, Hoyt and Schatten (1998) obtained values equal to 0.9 and 0.5 for the same periods. Therefore, the estimations of GSN from Hevelius’ direct observations are 3-8 times higher than the values obtained by Hoyt and Schatten. Obviously, the values remain very low if we compare them with modern values (see Figure 3). But this result indicates that there are probably many erroneous values equal to zero in the database by Hoyt and Schatten (1998). And, our knowledge of the Maunder Minimum, based now on the original GSN series, is not correct in some important details., 408247=Since the 2011 report (which I was a member of the Committee that wrote it), I now feel that using the global climate model projections, downscaled or not, to provide regional and local impact assessment on multi-decadal time scales is not an effective use of money and other resources. If the models cannot even accurately simulate current climate statistics when they are not constrained by real world data, the expense to run them to produce detailed spatial maps is not worthwhile. Indeed, it is counterproductive as it provides the impact community and policymakers with an erroneous impression on their value., 132949=Barnard L., et al., Predicting space climate change, Geophys. Res. Lett., 38, L16103, 2011., 103168=Finally, the excellent relationship between the TSI and the Equator-to-Pole (Arctic) temperature gradient (EPTG) is displayed in figure 4. Increase in TSI is related to decrease in temperature gradient between the Equator and the Arctic. This may be explained as an increase in TSI results in an increase in both oceanic and atmospheric heat transport to the Arctic in the warm period since 1970., 158537=Climate sensitivity is at the heart of the scientific debate on anthropogenic climate change. In the fifth assessment report of the IPCC (AR5) the different lines of evidence were combined to conclude that the Equilibrium Climate Sensitivity (ECS) is likely in the range from 1.5°C to 4.5°C. Unfortunately this range has not narrowed since the first assessment report in 1990., 116738=Mörner, N.-A., Planetary beat, solar wind and terrestrial climate, in Solar Wind Emission, technologies and impacts, C. D. Escaropa Borrega and A. F. Beirós Cruz (eds.), Nova Science publ., N.Y. p47-67, 2012, 357005=Di Luca, A., Elía, R. & Laprise, R., 2012. Potential for small scale added value of RCM’s downscaled climate change signal. Climate Dynamics. Available at: http://www.springerlink.com/index/10.1007/s00382-012-1415-z, 314372=The time frame we shall consider here will begin in Jan 1979 and end in Dec 2012 as this is the time we have output from models and from observations, both balloons and satellites. It is also the period for which the greatest amount of accumulation of heat energy (joules) should be evident due to the increasing impact of the rising greenhouse gas concentrations., 60964=The “Little Ice Age” I dislike this name as it has been used to build arguments that rely on the name which, as mentioned in point 7, is inherently bad science. Many paleoclimate records show an interval of lower temperatures but the start and end dates are not well agreed. For example it has been claimed to correspond to the Maunder minimum (i.e. 1645-1715) , such that in many arguments the terms “Maunder minimum” and “Little Ice Age” are even taken to be synonymous! This is undoubtedly invalid as most paleoclimate records indicate that the lower temperatures began at least 50 years before the start of the Maunder minimum., 65301=Krivova, N. A., S. K. Solanki, and T. Wenzler (2009), ACRIM-gap and total solar irradiance revisited: Is there a secular trend between 1986 and 1996? Geophys. Res. Lett., 36, L20101, doi: 10.1029/2009GL040707., 13848=Total Solar Irradiance Direct temperature measurements are available since 1850 or so. However, direct measurements of the sun by satellite started only in 1978. There is still considerable debate about the exact absolute values of the Total Solar Irradiance (TSI) in this period. The difficulty is that one has to merge data from different satellites together. The most recent SORCE/TIM measurements are probably our best shot and the background level of TSI therefore seems to be around 1361 W/m2 ., 248339=Tomassini, L., P. Reichert, R. Knutti, T.F. Stocker, and M.E. Borsuk, 2007. Robust Bayesian uncertainty analysis of climate system properties using Markov chain Monte Carlo methods. J. Clim., 20: 1239–1254., 245122=Lewis, N., 2013. An objective Bayesian, improved approach for applying optimal fingerprint techniques to estimate climate sensitivity. J. Clim.,26: 7414–7429., 406610=This need to develop a broader approach was even endorsed in the climate research assessment and recommendations in the “Report Of The 2004-2009 Research Review Of The Royal Netherlands Meteorological Institute”., 341572=[8] Pielke, R. A. S., and R. L. Wilby, 2012: Regional climate downscaling: What’s the point? Eos Trans.AGU, 93, PAGE 52, doi:201210.1029/2012EO050008, 255139=[Update 31 October 2014] Summaries online The summaries of the Climate Dialogue discussion on the (missing) tropical hot spot are now online (see links below). We have made two versions: an extended and a shorter version., 306912=Sherwood, S. C., C. L. Meyer, R. J. Allen, and H. A. Titchner, Robust tropospheric warming revealed by iteratively homogenized radiosonde data. Journal of Climate, Vol. 21, 2008, 5336-5352., 290632=R. H. Rienecker et al., A. da Silva, “MERRA - NASA’s Modern-Era Retrospective Analysis for Research and Applications,” Journal of Climate, 2011. (This describes the MERRA dataset), 319649=Figure 4. Value of the 1979-2012 temperature trend at various upper levels divided by the magnitude of the respective surface trend, i.e. the ratio of upper air trends to surface trends. Model simulations are lines with the average of the models as the dotted line. Squares are individual balloon observations (green – RATPAC, gray RAOBCORE, purple – RICH and orange – HadAT2) with the averages of observations the gray circles., 261906=Figure 2. Temperature trends for the satellite era. Plot of temperature trend (°C/decade) against pressure (altitude). The HadCRUT2v surface trend value is a large blue circle. The GHCN and the GISS surface values are the open rectangle and diamond. The four radiosonde results (IGRA, RATPAC, HadAT2, and RAOBCORE) are shown in blue, light blue, green, and purple respectively. The two UAH MSU data points are shown as gold-filled diamonds and the RSS MSU data points as gold-filled squares. The 22-model ensemble average is a solid red line. The 22-model average ±2σSE are shown as lighter red lines. MSU values of T2LT and T2 are shown in the panel to the right. UAH values are yellow-filled diamonds, RSS are yellow-filled squares, and UMD is a yellow-filled circle. Synthetic model values are shown as white-filled circles, with 2σSE uncertainty limits as error bars. Source: Douglass et al. 2008, 68506=Woollings T.G., M. Lockwood, G. Masato, C. Bell and L. Gray (2010) Enhanced signature of solar variability in Eurasian winter climate. Geophys Res Lett 37:L20805. doi:10.1029/2010GL044601, 114616=· The pattern of minima the last 1000 yr (Fig. 5-upper panel) indicates that a new minimum is to be expected the coming decades., 394096=· Ronald van Haren, Geert Jan van Oldenborgh, Geert Lenderink, Matthew Collins and Wilco Hazeleger, 2012: SST and circulation trend biases cause an underestimation of European precipitation trends Climate Dynamics 2012, DOI: 10.1007/s00382-012-1401-5, 119718=Svensmark, H. Cosmoclimatology: A new theory emerges, Astronomy and Geophysics, 48, 1.18-1.24, 2007, 287636=Biosketch Dr. Mears has a B.S. in Physics from the University of Washington (1985), and a PhD. in Physics from University of California, Berkeley (1991), where his thesis research involved the development of quantum-noise-limited superconducting microwave heterodyne receivers. He joined Remote Sensing Systems in 1998. Since then, he has validated SSM/I and TMI winds versus in situ measurements, developed and validated a rain-flagging algorithm for the QuikScat Scatterometer. Over the past several years he has constructed and maintained a climate-quality data record of atmospheric temperatures from MSU and AMSU, and studied human-induced change in atmospheric water vapor and oceanic wind speed using measurements from passive microwave imagers. Dr. Mears was a convening lead author for the U.S. Climate Change Science Program Sythesis and Assessment product 1.1 (the first CCSP report to reach final form), and a contributing author to the IGPP 4th assessment report. He is a member two international working groups, the Global Climate Oberving System Working Group on Atmospheric Reference Observations, and the WCRP Stratospheric Trends Working Group, which is part of the Stratospheric Processes and their Role in Climate (SPARC) project., 170414=References Gillett, N.P., V.K. Arora, D. Matthews, P.A. Stott, and M.R. Allen, 2013. Constraining the ratio of global warming to cumulative CO2 emissions using CMIP5 simulations. J. Clim., doi:10.1175/JCLI-D-12–00476.1., 110913=If we want to compare insolation today with 1750, we have also to consider the effect of perihelion change.We are in the (lucky) situation that the Earth at present is in the perihelion position around Jan 4th. The difference between the date of perihelion and solistice shifts with one day every 57 or 58 years. This has caused the solar flux on the Earth at the time of vernal spring to increase with 0.24 per cent since 1750. This is significant when compared with the apparent AGW contribution of 0.12 (AR4) or 0.17 per cent (AR5). The increased insolation results in earlier snow melting, which again changes the albedo such that more heat from the Sun is absorbed. This is a non-linear effect that adds heat to the Earth. Steele (2014) has shown that the insolation changes because of Earth orbit change used in climate models are wrongly modeled, and the result as he writes is “worse than useless”, and this needs to be corrected before a difference between the solar forcing around 1750 and now can be realistic estimated in climate models., 359488=Van Haren, R. G.J. van Oldenborgh, G. Lenderink, M. Collins en W. Hazeleger (2012), SST and circulation trend biases cause an underestimation of European precipitation trends; Clim. Dyn., doi:10.1007/s00382-012-1401-5., 46367=Figure 1 shows daily values of TSI from the PMOD composite (in grey) along with their 11-year running (“boxcar”) means (in blue). The last available value is for the 11-year period centred on decimal year 2009.03 and is 1365.77 Wm-2, which is 0.38 Wm-2 lower than the peak running mean value of 1366.15 Wm-2 which was observed at decimal year 1979.9., 412531=Castro, C.L., R.A. Pielke Sr., and G. Leoncini, 2005: Dynamical downscaling: Assessment of value retained and added using the Regional Atmospheric Modeling System (RAMS). J. Geophys. Res. - Atmospheres, 110, No. D5, D05108, doi:10.1029/2004JD004721. http://pielkeclimatesci.wordpress.com/files/2009/10/r-276.pdf, 358112=Pielke, R. A. S., and R. L. Wilby, 2012: Regional climate downscaling: What’s the point? Eos Trans.AGU, 93, PAGE 52, doi:201210.1029/2012EO050008, 153300=Steinhilber, F., Beer, J., Fröhlich, C.: 2009, Geophys. Res. Lett. 36, L19704., 41086=6. Solar radiative forcing FRS and change in total solar irradiance dS are different things and the difference needs to be clear when putting TSI changes into context. The two are related by FRS = dS *(1-A)/4 where A is Earth’s albedo and the factor 4 arises because TSI is power per unit area of the disc presented to the Sun by the Earth and radiative forcing in per unit surface area of Earth. The albedo is not known well (let alone its variation with time) and is impossible to measure properly because every point of the Earth’s surface/atmosphere reflects and scatters the incoming sunlight incident upon it in every direction back into space. Our best estimate of A is somewhere near 1/3, which means FRS ≈ dS /6. The largest estimates of dS since 1750 are around 6 Wm-2 [Shapiro et al., 2011] which therefore corresponds to FRS ≈ 1 Wm-2 . However, most recent estimates of dS are in the range 0.6-0.9 Wm-2 which corresponds to FRS between about 0.1 and 0.15 Wm-2. In contrast the radiative forcing caused by changes in well-mixed greenhouse gasses over the same interval is relatively well known at 3.2 ± 1.2 Wm-2. Thus the largest estimate in TSI change is about 30% of the known greenhouse radiative forcing, the mean of a basket of recent estimates is about 4%., 291512=Thorne, P. W., D. E. Parker, J. R. Christy, and C. A. Mears, 2005, “Uncertainties in Climate Trends: Lessons From Upper-Air Temperature Records”, Bulletin of the American Meteorological Society, 86, 1437-1442. (This discusses the idea of structural uncertainty), 245888=Lindzen, R.S. and Y.S. Choi, 2011. On the observational determination of climate sensitivity and its implications. Asia-Pacific J. Atmos. Sci.;47: 377–390., 407131=In this 2011 report, we wrote, 247520=Schwartz, S.E., 2012. Determination of Earth's transient and equilibrium climate sensitivities from observations over the twentieth century: Strong dependence on assumed forcing. Surv.Geophys., 33: 745–777., 243483=Frame D.J., B.B..B. Booth, J.A. Kettleborough, D.A. Stainforth, J.M. Gregory, M. Collins andM.R. Allen, 2005.Constraining climate forecasts: The role of prior assumptions. Geophys. Res. Lett., 32, L09702, 95917=Scafetta and Willson (2014), Scafetta, N., R. C. Willson: ACRIM total solar irradiance satellite composite validation versus TSI proxy models. Astrophysics and Space Science (2014). DOI: 10.1007/s10509-013-1775-9., 551898=However, Benestad is in favour of separating forced and unforced climate change (as the definition of detection implies), and part of the 1850-1949 temperature changes are due to (natural) forcing. This implies that it is difficult to draw conclusions like Koutsoyiannis did. There was no further discussion on this issue., 134619=Usoskin I.G., and G.A. Kovaltsov, Cosmic rays and climate of Earth: Possible connection, Compt. Rend. Geosci., 340. 441-450, 2008., 91584=Kerr (2001), Kerr, R. A.: A variable sun paces millennial climate. Science 294 (2001) 1431-1433., 574054=Koutsoyiannis’ Figure 5: testing lagged climatic differences based on the HadCrut4 data set (1850-2012). Differences are not statistically significant according to Koutsoyiannis, except maybe for the 90 year lag., 200113=The NCAR CESM1-CAM5 Large Ensemble (LE) Community Project provides a unique framework for understanding the role of internal variability in obscuring forced changes. It currently consists of 28 ensemble members in simulations of the historical record (1920-2005) and future projections (2006-2080) based on RCP8.5 forcing., 291055=Mears, CA, FJ Wentz, P Thorne and D. Bernie, 2011, “Assessing uncertainty in estimates of atmospheric temperature changes from MSU and AMSU using a Monte-Carlo estimation technique”, Journal of Geophysical Research, 116, D08112, doi:10.1029/2010JD014954. (This discussed RSS error ensembles)., 326477=What I can say from the standpoint of applying the scientific method to a robust response-feature of models, is that the average model result is inconsistent with the observed rate of change of tropical tropospheric temperature - inconsistent both in absolute magnitude and in vertical structure (Douglass and Christy 2013.) This indicates our ignorance of the climate system is still enormous and, as suggested by Stevens and Bony, this performance by the models indicates we need to go back to the basics. From this statement there is only a short distance to the next - the use of climate models in policy decisions is, in my view, not to be recommended at this time., 305905=References Allen, R. J., S. C. Sherwood, J. R. Norris and C. Zender, Recent Northern Hemisphere tropical expansion primarily driven by black carbon and tropospheric ozone, Nature, Vol. 485, 2012, 350-355., 89614=Brohan (2006), Brohan, P., Kennedy, J.J., Harris, I., Tett, S.F.B., Jones, P.D.: Uncertainty estimates in regional and global observed temperature changes: a new dataset from 1850. Journal of Geophysical Research 111, (2006) D12106. doi:10.1029/ 2005JD006548., 175839=More recently, as data improves in both quantity and quality, and helped by better understanding of aerosol effects, it is widely agreed that the gradual warming of the climate system points to a sensitivity somewhere at the low end of the traditional IPCC range (e.g. Aldrin et al 2012, Ring et al 2012, Otto et al 2013). One important limitation of these methods is that they typically assume a rather idealised low-dimensional and linear system in which the surface temperature can be adequately represented by global or perhaps hemispheric averages. In reality the transient pattern of warming is likely to be a little different from the equilibrium result, which complicates the relationship between observed and future (equilibrium) warming (e.g. Armour et al 2014)., 110319=A fair part of the warming after 1990 may be due to the cleaning of the stratosphere of aerosols after the Pinatubo eruption in 1992. Observation of earthshine during lunar eclipses shows that the atmosphere now is very clean (Keen 2008; 2013) The difference in volcanic Aerosol Optical Thickness (AOD) since 1996 is estimated to Δτ = -0.033 which corresponds to ΔT=0.13°C (no feedback calculation). This is based on the relation between aerosol forcing and optical depth Fa ≈ -21 Δτ, where Fa is the forcing in Wm-2 (Hansen et al. 2000)., 59966=Figure 4: (a). Composite difference maps of winter (December/January/February) means of mean surface level pressure (MSLP, contours 1 hPa apart) and 2-m temperature (colour map) between low- and high-solar conditions defined by the lower and upper terciles of the open solar flux (FS). (b). Scaled anomalies associated with the NAO for comparison, in this case the two subsets are for the lower and upper terciles of the NAO index. Data are from the European Centre for Medium-range Weather Forecasting ERA-40 reanalysis data set (Uppala et al. 2005) extended to cover 44 complete winters (1957/1958 to 2000/2001) using operational data. A bootstrap test was employed, resampling the sets of winters in order to estimate the sampling uncertainty, to test whether the solar pattern in a was different from that associated with the NAO in b: this found that the two patterns are significantly different at the 93% level [from Woollings et al. 2010]., 282786=Fig. 2. Scatter plot of trend (1979-2012) in TTT as a function of trend in TSurf. The model results cluster around a line with a slope of 1.45, indicating a tropospheric hotspot. For the observed results, HadCRUT4 is used for the surface temperatures, and various sources of tropospheric temperature (Satellites, Radiosondes, and Reanalysis) are used to TTT., 301962=Moreover, the discrepancy with models was opposite from 1958-1979 (Gaffen et al. 2000)—that is to say, the observed tropical upper-tropospheric warming was evidently stronger than expected. But the world was warming then too. So if this interesting phenomenon is real, it probably is not connected to global warming., 84315=Figure 3A shows the good performance of an empirical model for the global surface temperature proposed by Scafetta (2013b). This model has the peculiarity of attempting a reconstruction of the climate variability using 6 identified solar-astronomical oscillations at periods of 9.1, 10.4, 20, 60, 115 and 983 year. Other harmonics are likely present. These oscillations are able to model the natural decadal-to-millennial natural climatic oscillations. To this harmonic component it is necessary to add an estimate of the anthropogenic and volcano components made by properly attenuating the CMIP5 general circulation model ensemble mean simulation by a factor β ≈ 0.5 to simulate a climate sensitivity to CO2 doubling of about 1.5oC . Scafetta (2013b) showed that his model outperforms all CMIP5 general circulation models in reconstructing the global surface temperature record. Figure 3B shows a detail with an update of the semi-empirical astronomical model proposed by Scafetta (2012b) in 2011 against the HadCRUT3 global surface temperature record (Brohan, 2006). The red curve shows the original global surface temperature record published in Scafetta (2012b), which ended in October 2011. The blue curve shows the global surface temperature updated to the most current available month, which is May 2014. The back curve within the cyan 1-σ error area is the semi-empirical astronomical model forecast (which was modelled to start in 2000). The figure clearly shows that the proposed semi-empirical model outperforms the IPCC 2007 CMIP3 general circulation model projections (green area) and has successfully forecast the temperature trend from October 2011 to March 2014. Note that a simplified version of the same model was proposed by Scafetta since 2009 (Lorenzetto, 2009; Scafetta, 2010)., 72384=For example, Douglass and Clader (2002); Lean and Rind (2009); van Loon and Labitzke (2000); Scafetta (2009); Scafetta (2013c) evaluated the signature of the 11-year solar cycle on the temperature by simultaneously filtering off the volcano signature, the anthropogenic signature and the ENSO oscillations. These authors found that during the period from 1980 to 2000, which experienced very large 11-year solar oscillations, the 11-year solar cycle signature on the global surface temperature had an amplitude of about 0.1 K. At higher altitudes, however, the amplitude of the 11-year solar signature increases up to ∼ 0.4 K (e.g.: Scafetta, 2013c; van Loon and Labitzke, 2000; Svensmark and Friis-Christensen, 2007)., 167091=Others argue that the main limit on ECS is that it has to be consistent with palaeoclimatic data which point at ranges being consistent with the IPCC-range (Palaeosens, 2012, also mentioned in figure 1) and also in line with climate models likely range of about 2 to 4.5 0C (CMIP5). Some argue that palaeoclimatic data points to values in the upper part of the IPCC range (Hansen, 2013). In this dialogue we therefore want to focus first on the following two questions:, 355193=Biosketch Bart van den Hurk has a PhD on land surface modelling, obtained in Wageningen in 1996. Since then he has worked at the Royal Netherlands Meteorological Institute (KNMI) as researcher, involved in studies addressing modelling land surface processes in regional and global climate models, data assimilation of soil moisture, and constructing regional climate change scenarios. He is strongly involved with the KNMI global modelling project EC-Earth, and is co-author of the land surface modules of the European Centre for Medium Range Weather Forecasts (ECMWF). Since 2005 he is part-time professor “Regional Climate Analysis” at the Institute of Marine and Atmospheric Research (IMAU) at the Utrecht University. There he teaches masters students, supervises PhD-students and is involved in several research networks. Between 2007 and 2010 he was chair of the WCRP-endorsed Global Land-Atmosphere System Studies (GLASS) panel, since 2006 member of the council of the Netherlands Climate Changes Spatial Planning program, and since 2008 member of the board of the division “Earth and Life Sciences” of the Dutch Research Council (NWO-ALW). He is convenor at a range of incidental and periodic conferences, and editor for Hydrology and Earth System Science (HESS)., 116395=Hoyt, D. V. & Schatten, K. H. A. Discussion of Plausible Solar Irradiance Variations, 1700.1992, Journal of Geophysical Research, 98, 18,894-18,906, 1993, 117372=Ljungqvist, F. C., A new reconstruction of temperature variability in the extra-tropical Northern Hemisphere during the last two millennia, Geogra. Ann. 92A (3), 339-351, 2010, 199629=Figure 2: The range of decadal trends in global mean surface temperature from the CESM1-CAM5 Large Ensemble Community Project (LE, black and grey lines, 18) along with an observed estimate based on the NOAA-NCDC Merged Land and Ocean Surface Temperature dataset. Also shown are the mean (circle) and range (lines) of simulated planetary imbalance (right axis) from 2000 through 2010 for the 10 members of the LE with greatest cooling (blue) and warming (red), 182382=References Aldrin, M., Holden, M., Guttorp, P., Skeie, R. B., Myhre, G., & Berntsen, T. K. (2012). Bayesian estimation of climate sensitivity based on a simple climate model fitted to observations of hemispheric temperatures and global ocean heat content. Environmetrics, n/a–n/a. doi:10.1002/env.2140, 183340=Fasullo, J. T., & Trenberth, K. E. (2012). A Less Cloudy Future: The Role of Subtropical Subsidence in Climate Sensitivity. Science, 338(6108), 792–794. doi:10.1126/science.1227465, 416301=Pielke Sr., R.A., and R.L. Wilby, 2012: Regional climate downscaling – what’s the point? Eos Forum, 93, No. 5, 52-53, doi:10.1029/2012EO050008. http://pielkeclimatesci.files.wordpress.com/2012/02/r-361.pdf, 46920=Figure 2: Corrected sunspot number, RC. This is a composite of international, Zurich, Wolf and group sunspot numbers with implementations of corrections as discussed by Lockwood et al. [2014]. The grey shows annual means, the blue 11-year running means. The horizontal dashed line shows the last available value of these 11-year means (for 2002-2013, inclusive) and yellow dots show when average sunspot activity was at this level in the past. The Data available from http://onlinelibrary.wiley.com/store/10.1002/2014JA019972/asset/supinfo/JGR_Lockwood_OSF2_supplementarydata.txt?v=1&s=9889b7655c22cc249a9f6e2f43aa76305125cbdd, 328508=Christy, J.R., R.W. Spencer and W.B. Norris, 2011: The role of remote sensing in monitoring global bulk atmospheric temperatures. Int. J. Remote Sens., 32, 671-685, DOI:10.1080/01431161.2010.517803., 294928=I considered various ways that aerosols might alter the convective lapse rate and how to test these hypotheses. Before going too far with this, however, I wanted to assure myself that the reported trends were robust, and began my own analysis of the radiosonde data (or in fact continued it, since I was already using radiosondes to understand change in the lower stratosphere). By 2005, based on my own work and others’ plus a better understanding of the basic challenges, I no longer thought there was credible evidence for any unexpected changes in atmospheric temperature structure. Consequently I dropped this as a research topic (my student who was thinking along these lines, Bob Allen, changed gears to examine the possible impacts of aerosol on the general circulation which did lead to some very interesting results published later; he also showed that wind trends in the tropics were consistent with the hot spot)., 63795=Fröhlich, C. (2000) Observations of irradiance variability, Space Sci. Rev., 94, 15-24. doi: 10.1023/A:1026765712084, 290071=L. Haimberger, C. Tavolato, and S. Sperka, “Towards the elimination of warm bias in historic radiosonde records -- some new results from a comprehensive intercomparison of upper air data,” Journal of Climate, vol. 21, pp. 4587-4606, 2008. (This describes the RICH dataset), 109242=However, this does not include effects of the longer cycles in TSI which peak around 1940 and 1995 (Figs 3 and 4), and the longer period of about 200 yr (fig 5), which controls the length of solar cycles. The change from shorter to longer cycles happened about the year 2000, and if one assume that a longer cycle imply more time for cooling, then the effect will appear some decades ahead. This is the same delayed effect we observe in the yearly cycle of warming/cooling of the Earth. In the Northern Hemisphere we have the minimum solar insolation on Dec 21, but the average temperature minimum appears on Feb 11, which is about 13 per cent time delay with respect to the yearly cycle. Power spectrum analyses of global and hemispherical temperature series shows that 60 and 20 yrs quasi-periodic oscillations are much stronger than the 11 yr sunspot period, and can be attributed to periodic forcing from the mayor planets Jupiter and Saturn (Scafetta 2013). These periods may dominate in the coming decades when the effects of the 11-yr cycle is reduced., 86783=As Figures 3 and 4 show, the proposed model has correctly predicted the observed continued standstill of the global surface temperature while the CMIP3 and CMIP5 general circulation models adopted by the IPCC in 2007 and 2013 predicted for the period 2000-2014 a strong warming of about 2oC/century, which has not been observed., 92945=Parker et al. (1992), Parker, D. E., T. P. Legg, C. K. Folland: A new daily Central England Temperature Series, 1772-1991. Int. J. Clim. 12, (1992) 317-342., 245720=Lin, B., et al., 2010: Estimations of climate sensitivity based on top-of-atmosphere radiation imbalance. Atmos. Chem. Phys., 10: 1923–1930., 104231=Figure 5: The upper panel shows the timing of sunspot minima related to an average period of 11.07 yr, determined from estimated sunspot minima since 1610 (Solheim, 2013b). Positive values means that the time of minimum is delayed with respect to the expected time. O-C means Observed minus Computed (expected) time of minimum. In the same curve solar minima the last 1000 yrs are marked with a thick line. The lower panel shows reconstructed 10-yr averaged sunspot numbers (Usoskin et al. 2007) and Hoyt-Schatten group sunspot no after 1615 and updated until 2015 with modern scaled sunspot numbers from SILSO (World Data Center for the production, preservation and dissemination of the international sunspot number)., 414345=Pielke Sr., R.A., 2002: Overlooked issues in the U.S. National Climate and IPCC assessments. Climatic Change, 52, 1-11. http://pielkeclimatesci.wordpress.com/files/2009/10/r-225.pdf, 327981=Christy, J. R., W. B. Norris, R. W. Spencer, and J. J. Hnilo. Tropospheric temperature change since 1979 from tropical radiosonde and satellite measurements, J. Geophys. Res., 2007. 112, D06102, doi:10.1029/2005JD006881., 417366=Pielke et al, 2013: Introduction. http://pielkeclimatesci.files.wordpress.com/2013/04/b-18intro.pdf, 313029=Balloons and satellites Measurements of tropical tropospheric temperature have been performed by balloons that ascend through the air and radio back the atmosphere’s vital statistics, like temperature, humidity, etc. Due to a number of changes in these instruments through the years research organizations have spent a lot of effort to remove such problems and create homogenous or consistent databases of these readings. For this study we shall assume that the average of four major and well-published datasets (known as RATPAC, RAOBCORE, RICH and HadAT2) will serve as the “best guess” of the tropical temperatures at the various elevations (see Christy and Hnilo, 2007, Christy et al. 2010, 2011 for descriptions and earlier results.), 12841=Figure 3: Reconstructed (a) Northern Hemisphere annual temperatures during the last 2000 years. Replication of figure 5.7a from AR5. Individual reconstructions (see Appendix 5.A.1 in AR5 for further information about each one) are shown as indicated in the legends, grouped by colour according to their spatial representation (red: land-only all latitudes; orange: land-only extra-tropical latitudes; light blue: land and sea extra-tropical latitudes; dark blue: land and sea all latitudes) and instrumental temperatures shown in black (Hadley Centre/ Climatic Research Unit (CRU) gridded surface temperature-4 data set (HadCRUT4) land and sea, and CRU Gridded Dataset of Global Historical Near-Surface Air TEMperature Anomalies Over Land version 4 (CRUTEM4) land-only; Morice et al., 2012). All series represent anomalies (°C) from the 1881–1980 mean (horizontal dashed line) and have been smoothed with a filter that reduces variations on time scales less than about 50 years., 134117=Semeniuk, K., et al., Middle atmosphere response to the solar cycle in irradiance and ionizing particle precipitation, Atmos. Chem. Phys., 11, 5045, 2011., 153726=Vaquero, J.M., Gallego, M.C., García, J.A.: 2002, Geophys. Res. Lett. 29, 1997., 9585=Such a small solar influence might seem counterintuitive. The Little Ice Age, the period roughly from 1350 to 1850, in which especially winters on the Northern Hemisphere were severe, coincided with several solar minima (Wolf, Spörer, Maunder and Dalton Minimum, see figure 2)., 398943=· Kundzewicz, Z. W., and E.Z. Stakhiv (2010) Are climate models “ready for prime time” in water resources managementapplications, or is more research needed? Editorial. Hydrol. Sci. J. 55(7), 1085–1089. who conclude that “Simply put, the current suite of climate models were not developed to provide the level of accuracy required for adaptation-type analysis.”, 506339=[4] S. Lennartz and A. Bunde, Phys. Rev. E 84, 021129 (2011), 335058=Global climate projections for 2050 and 2100 have, amongst other purposes, been used to inform potential mitigation policies, i.e. to get a sense of the challenge we are facing in terms of CO2 emission reductions. The next logical step is to use models for adaptation as well. Stakeholders have an almost insatiable demand for future regional climate projections. These demands are driven by practical considerations related to freshwater resources, especially ecosystems and water related infrastructure, which are vulnerable to climate change., 306351=Gaffen, D. J., B. D. Santer, J. S. Boyle, J. R. Christy, N. E. Graham and R. J. Ross, Multidecadal changes in the vertical temperature structure of the tropical troposphere, Science, 2000, V. 287, 1242-1245., 64854=Jones G.S., M. Lockwood, and P.A. Stott (2012) What influence will future solar activity changes over the 21st century have on projected global climate changes? J. Geophys Res., ?? doi:10.1029/2011JD017013, 289151=C. A. Mears and F. J. Wentz, “Construction of the Remote Sensing Systems V3.2 atmospheric temperature records from the MSU and AMSU microwave sounders,” Journal of Atmospheric and Oceanic Technology, vol. 26, pp. 1040-1056, 2009., 157673=[Update 9 December 2014] Summaries online The summaries of the Climate Dialogue on Climate Sensitivity and Transient Climate response are now online (see links below). We have made two versions: an extended and a shorter version., 88698=Nicola Scafetta graduated in Physics at the University of Pisa (Italy) and received his Ph.D. in statistical mechanics and complex systems at the University of North Texas (USA) in 2001. Since 2002 he moved to Duke University and collaborates with the Active Cavity Radiometer Irradiance Monitor (ACRIM) in several projects concerning solar dynamics and solar-climate interactions. He is currently proposing that the climate system is regulated by a significant natural component that appears to be regulated by solar and astronomical harmonics that the current climate models do not take into account., 154186=Vaquero, J.M., Gallego, M.C (2014) “Reconstructing Past Solar Activity using Meridian Solar Observations: the Case of the Royal Observatory of the Spanish Navy (1833-1840)” Advances in Space Research 53, 1162-1168., 244142=Gregory J.M. and P.M.Forster, 2008. Transient climate response estimated from radiative forcing and observed temperature change. J.Geophys. Res., 113, D23105., 182930=Annan, J. D., & Hargreaves, J. C. (2011). On the generation and interpretation of probabilistic estimates of climate sensitivity. Climatic Change, 104(3-4), 423–436. doi:10.1007/s10584-009-9715-y, 247975=Shindell, D.T. et al, 2013. Radiative forcing in the ACCMIP historical and future climate simulations, Atmos. Chem. Phys., 13, 2939-2974, 283202=The general story around the hotspot remains unchanged from Santer et al 2005, except that the expected scaling ratio has increased from 1.40 to 1.45 with the use of CMIP-5 data. Two sources of measured data (I realize that a reanalysis is not really a measurement), STAR and MERRA, are reasonably close to the fitted line, while others, such as the HADAT Radiosonde dataset and the UAH satellite dataset, are far from the line. Other datasets are distributed in between. Note that the RSS data point has error bars both in the X and Y direction. These are 90% uncertainty ranges derived from the error ensembles that have been recently produced for the RSS dataset (Mears et al., 2011) and the HadCRUT4 dataset (Morice et al, 2012). (These error ensembles are made up of different realizations of the datasets that are consistent with the estimated errors, including measurement, sampling, and construction errors. The correlations of the errors across both time and location are thus automatically included if the error ensemble members are processed by the user in the same way as the baseline data.) This is the first time that we have been able to put error bars on the observed points on this plot, in both directions, in such a consistent manner., 91406=Hoyt and Schatten (1993), Hoyt, D. V., K. H. Schatten: A discussion of plausible solar irradiance variations, 1700–1992. J. Geophys. Res. 98 (1993) 18895–18906., 396096=· Jiang, J. H., et al. (2012), Evaluation of cloud and water vapor simulations in CMIP5 climate models using NASA “A-Train” satellite observations, J. Geophys. Res., 117, D14105, doi:10.1029/2011JD017237. published 18 July 2012. The modeled mean CWCs [cloud water] over tropical oceans range from ∼3% to ∼15× of the observations in the UT and 40% to 2× of the observations in the L/MT. For modeled H2Os, the mean values over tropical oceans range from ∼1% to 2× of the observations in the UT and within 10% of the observations in the L/MT….Tropopause layer water vapor is poorly simulated with respect to observations. This likely results from temperature biases, 74184=Thus, following this millennial cycle, since 1800 the temperature had to increase naturally: the millennial climatic maximum induced by the millennial solar maximum had to occur in the 21th century and could have contribute about 50% or more of the warming observed since 1850 (e.g.: Humlum et al., 2011; Scafetta, 2012a; Scafetta, 2013b). Numerous other climatic oscillations at the decadal, bi-decadal, 60-year and secular scales that could be solar-astronomically induced are also typically observed in a large number of data (e.g.: Scafetta, 2010; Scafetta, 2013b; Scafetta, 2014)., 329090=Spencer, R.W. and W.D. Braswell, 2010: On the diagnosis of radiative feedback in the presence of unknown radiative forcing. J. Geophys. Res., 115, DOI:10.1019/2009JD013371., 95289=Scafetta (2014), Scafetta, N.: The complex planetary synchronization structure of the solar system. Pattern Recognition in Physics 2 (2014) 1-19. DOI: 10.5194/prp-2-1-2014., 67020=Lockwood, M., M.J. Owens, and L. Barnard (2014) Centennial variations in sunspot number, open solar flux and streamer belt width: 2. Comparison with geomagnetic data, J. Geophys. Res., 119 (7), 5183–5192, doi: 10.1002/2014JA019972, 105849=Figure 6: Estimates of extra-tropical Northern Hemisphere (90°-30°N) decadal mean temperature variations AD 1-1999 (dark grey line) with the mean variance adjusted CRUTEM3+HadSST2 mean values for the same area 1850-1999 (Ljungqvist 2010)., 307640=Thorne, P. W. et al., A quantification of uncertainties in historical tropical tropospheric temperature trends from radiosondes, J. Geophys. Res., Vol. 116, 2011, D12116., 480264=Biosketch Demetris Koutsoyiannis received his diploma in Civil Engineering from the National Technical University of Athens (NTUA) in 1978 and his doctorate from NTUA in 1988. He is professor of Hydrology and Analysis of Hydrosystems at the Department of Water Resources and Environmental Engineering of NTUA (and former Head of the Department). He is also Co-Editor of Hydrological Sciences Journal and member of the editorial board of Hydrology and Earth System Sciences (and formerly of Journal of Hydrology and Water Resources Research). He teaches undergraduate and postgraduate courses in hydrometeorology, hydrology, hydraulics, hydraulic works, water resource systems, water resource management, and stochastic modelling. He is an experienced researcher in the areas of hydrological modelling, hydrological and climatic stochastics, analysis of hydrosystems, water resources engineering and management, hydro-informatics, and ancient hydraulic technologies. His record includes about 650 scientific and technological contributions, spanning from research articles to engineering studies, among which 96 publications in peer reviewed journals. He received the Henry Darcy Medal 2009 by the European Geosciences Union for his outstanding contributions to the study of hydro-meteorological variability and to water resources management., 327165=Biosketch J.R. Christy is Distinguished Professor of Atmospheric Science at the University of Alabama in Huntsville and Director of the Earth System Science Center. He is Alabama’s State Climatologist. In 1989 he and Dr. Roy Spencer, then of NASA, published the first global, bulk-atmospheric temperatures from microwave satellite sensors. For this achievement they were recognized with NASA’s Medal for Exceptional Scientific Achievement and the American Meteorology Society’s Special Award for developing climate datasets from satellites. Christy has served on the IPCC panels as Contributor, Key Contributor and Lead Author and has testified before the U.S. Congress, federal court, many state legislatures and regulatory boards on climate issues., 133058=Bond, G., et al., Persistent solar influence on North Atlantic climate during the Holocene, Science 294, 2130, 2001., 450491=16. Foster, G. & Rahmstorf, S. Global temperature evolution 1979–2010. Environ. Res. Lett. 6, 044022 (2011)., 415291=Pielke Sr., R.A., 2010: Comments on “A Unified Modeling Approach to Climate System Prediction”. Bull. Amer. Meteor. Soc., 91, 1699–1701, DOI:10.1175/2010BAMS2975.1, http://pielkeclimatesci.files.wordpress.com/2011/03/r-360.pdf, 152658=Leussu, R., Usoskin, I.G., Arlt, R., Mursula, K. (2013) Inconsistency of the Wolf sunspot number series around 1848. A&A 559:A28., 399433=Even on the global average scale, the multi-decadal global climate models are performing poorly since 1998, as very effectively shown in an analysis by John Christy in the post by Roy Spencer which is reproduced below. As reported in Roy’s post, these plots by John are based upon data from the KNMI Climate Explorer with a comparison of 44 climate models versus the UAH and RSS satellite observations for global lower tropospheric temperature variations, for the period 1979-2012 from the satellites, and for 1975 – 2025 for the models., 357478=Lenderink, G., E. van Meijgaard en F. Selten (2009), Intense coastal rainfall in the Netherlands in response to high sea surface temperatures: analysis of the event of August 2006 from the perspective of a changing climate; Clim. Dyn., 32, 19-33, doi:10.1007/s00382-008-0366-x., 175151=Recent (~20th century) temperature change Around ten years ago, Bayesian methods using the observed transient warming over the 20th century (also variously using ocean heat uptake and/or spatial patterns of climate change) became popular, although most researchers concluded that, at that time, these data didn't provide a very tight constraint. Actually, even as far back as 2002, there was enough data to provide useful estimates such as the 1.3-4.2°C of Forest et al (2002), but these results were unfortunately ignored in favour of methods which have since been shown to generate an inappropriate focus on higher values (Annan and Hargreaves 2011)., 133438=Harrison, R. G.; Ambaum, M. H. P.; Lockwood, M., Cloud base height and cosmic rays, Proc. Royal Soc. A., 467, 2777, 2011., 176629=GCM ensemble-based constraints Some (including me) have tried to generate constraints based on creating an ensemble of GCM simulations in which parameters of the GCM are varied, and then the models are generally evaluated against observations in some way to see which seem more likely. Unfortunately, the results of these experiments seem to be highly dependent on the underlying GCM, as was first shown by Yokohata et al 2010 and has also been confirmed by others (Klocke et al 2011). Therefore, I no longer consider such methods to be of much use. The underlying problem here appears to be that changing parameters within a given GCM structure does not adequately represent our uncertainty regarding the climate system. An alternative which might have the potential to overcome this problem is to use the full CMIP3/CMIP5 ensemble of climate models from around the world. These models generate a much richer range of behaviour, though debate still rages as to whether this range is really adequate or not (and for what purposes)., 243112=Forest, C.E., P.H. Stone and A.P. Sokolov, 2006.Estimated PDFs of climate system properties including natural and anthropogenic forcings. Geophys. Res. Lett., 33: L01705, 246332=Murphy, D.M., S. Solomon, R.W. Portmann, K.H. Rosenlof, P.M. Forster, and T. Wong, 2009. An observationally based energy balance for the Earth since 1950. J. Geophys. Res. Atmos.,114: D17107., 134473=Tinsley, B., The Global Atmospheric Electric Circuit and its Effects on Cloud Microphysics, Rep. Progr. Phys., 71, 066801, 2008., 140695=Unfortunately, Clette et al (2014), of which I am coauthor, has revealed several problems in the current GSN. The most important is that the reference series (obtained from the solar program at the Royal Greenwich Observatory, RGO, started in 1874) is not homogeneous in its early years. I presented Figure 2 in the 2nd Sunspot Number Workshop (Brussels, May 2012, see Cliver et al., 2013). This figure shows the ratio between the sunspot group counts of RGO and the main sunspot observers in the last quarter of the 19th century. All ratios present a positive trend. Therefore, sunspot counts by RGO are low in the first years of this Figure 2 and high in the last years in comparison with the rest of observers. Therefore, RGO counts are not homogeneous in these times. However, RGO was chosen by Hoyt and Schatten (1998) as the prime observer due to the prestigiousness of its solar program. This causes lower GSN values before 1880 because the calibration constant of the observers were adjusted using these first years and the error was propagated back., 377914=[15] Evans J, Ekström M, Ji F (2012) Evaluating the performance of a WRF physics ensemble over South-East Australia. Climate Dynamics 39:1241–1258, 66439=Lockwood M., and C. Fröhlich (2008) Recent oppositely-directed trends in solar climate forcings and the global mean surface air temperature: II. Different reconstructions of the total solar irradiance variation and dependence on response timescale, Proc. R. Soc. (Lond.) , 464 (2094), 1367–1385. doi:10.1098/rspa.2007.0347, 289665=P. W. Thorne et al., “Revisiting radiosonde upper-air temperatures from 1958 to 2002,” Journal of Geophysical Research, vol. 110, 2005. (This is the HADAT dataset), 63948=Fröhlich, C. (2003) Long-term behaviour of space radiometers, Metrologia, 40 (1), S60-S65. doi: 10.1088/0026-1394/40/1/314, 317899=Figure 2 Temperature trends in °C/decade by pressure level with 1000 hPa being the surface and 100 hPa being around 16 km. Circles represent the four observational balloon datasets, the largest circle being their mean. The lines represent 73 CMIP-5 model simulations (identities in Fig. 3) with the non-continuous lines representing models sponsored by the U.S. The large black dashed line is the 73-model mean. The pressure values are very close to linear with respect to mass but logarithmic with respect to altitude, so that 500 hPa is near 5.5 km altitude, 300 hPa near 9 km altitude and 200 hPa about 12 km altitude., 323287=Could there be a separate process like enhanced solar reflection by aerosols that is keeping the number of joules available for absorption at a smaller level relative to the past? The interaction of aerosols with the entire array of climate processes is another fundamental area of research that has more questions than answers. How do aerosols affect cloudiness (more?, less?, brighter?, darker?). What is the precise, time-varying distribution of all types of aerosols and what exactly does each type do in terms of affecting the absorption and reflection of the joules in all frequencies? The IPCC typically shows very large error ranges for our knowledge of the aerosol effects, so there is a possibility that models have significant and consistent errors in dealing with them (IPCC 2007 AR4 Fig SPM.2)., 22672=Figure 9: The group sunspot numbers (in blue) suggest a steady increase in solar activity since the Maunder Minimum. The corrected Wolf sunspot numbers however show periods of high solar activity in the 18th and 19th century that are similar to what is called the Modern Maximum. Source: Brian Owens, Spot of bother: have we been getting solar activity wrong?, New Scientist, 13 September 2013, 117988=Scafetta, N. Solar and Planetary oscillation control on climate change: Hind-cast, forecast and a comparison with the CMIP5 GCMS, Energy and Environment, 24, 456-396, 2013, 100040=Figure 1: Central Greenland (GISP2) surface temperature the past 4000 years (blue line). Natural cycles modeled and forecasted shown by the green line. Only 3-cycles are included (2800, 1190 and 560 yr) in the model. This model shows a temperature increase for the period 1850-2100 which is called the Modern Warm Period (MWP) (From Humlum et al., 2011), 341186=[6] Wilby, R. L. (2010) Evaluating climate model outputs for hydrologicalapplications – Opinion. Hydrol. Sci. J. 55(7), 1090–1093, 393193=· Sun, Z., J. Liu, X. Zeng, and H. Liang (2012), Parameterization of instantaneous global horizontal irradiance at the surface. Part II: Cloudy-sky component, J. Geophys. Res., doi:10.1029/2012JD017557, in press., 81470=Figure 1A compares the sunspot number record since 1700 (blue curve) versus two alternative total solar irradiance reconstructions (Wang et al., 2005; Hoyt and Schatten, 1997). The figure highlights that while the sunspot number is relatively flat, solar proxy models present a more significant secular variability that, however, depends greatly on the chosen proxy model. Some solar model predicts a variability significantly larger than others. Figure 1B simply compares the Central England Temperature record (Parker et al., 1992) and the solar reconstruction proposed by Hoyt and Schatten (1997). A good correlation is noted for 300 years, which includes a significant portion of the warming observed since 1900., 71398=Many empirical studies (e.g.: Bond et al., 2001; Douglass and Clader, 2002; Eichler et al., 2009; Friis-Christensen and Lassen, 1991; Hoyt and Schatten, 1993; Hoyt and Schatten, 1997; Kerr, 2001; Kirkby, 2007; Loehle and Scafetta, 2011;Scafetta, 2012b; Scafetta, 2013a; Scafetta, 2013b; Scafetta, 2014; Scafetta and West, 2007; Scafetta and West, 2008; Shaviv, 2008; Soon, 2005; Soon, 2009; Steinhilber et al., 2012; White et al., 1997) have found a strong but complex solar signature in the climate system at multiple timescales once that specific models and records have been used. Some of these studies have claimed that the Sun could have contributed at least ∼ 50% of the post 1850 global warming. This conclusion contradicts the current analytical climate models, such as the general circulation models (GCMs) adopted by the IPCC that predict only a 5% or lower solar contribution to the warming observed during the same period (e.g. see the IPCC (2013))., 290836=Q. Fu and C. M. Johanson, “Satellite-derived vertical dependence of tropospheric temperature trends,” Geophysical Research Letters, vol. 32, 2005. (This introduces the concept of TTT), 185089=Yokohata, T., Webb, M. J., Collins, M., Williams, K. D., Yoshimori, M., Hargreaves, J. C., & Annan, J. D. (2010). Structural Similarities and Differences in Climate Responses to CO2 Increase between Two Perturbed Physics Ensembles. Journal of Climate, 23(6), 1392. doi:10.1175/2009JCLI2917.1, 48408=In general, we cannot say that TSI is a function of sunspot number only; however, that is an assumption (implicit or explicit) we are forced to make if we use sunspot numbers alone to reconstruct TSI back to the Maunder minimum. This being the case, we would expect the average TSI around 1900 and around 1750 to be very similar to the 2009 value, i.e. 1365.77 Wm-2, which gives a change in TSI between 1750 and 1980 (the peak of the running-mean of the TSI observations) of (1366.15 -1365.77) = 0.38 Wm-2., 449020=8. Durack, P. J., Wijffels, S. E. & Matear, R. J. Ocean Salinities REveal Strong Global Water Cycle Intensification During 1950 to 2000. Science 336, 455–458 (2012)., 287022=Figure 4. Ratio of trends in TTT to trends in TSurf as a function of the ending year of the trend analysis. The starting point is January 1979. The surface dataset used is GHCN-ERSST., 48955=We can compare this expectation to the reconstructions. The largest drift in TSI is the Shapiro et al. [2011] reconstruction for which the average TSI around 1900 is 1362.5 Wm-2, i.e. the change in TSI between 1900 and 1980 is predicted to be (1366.15 -1362.5) = 3.65 Wm-2. Hence comparison of figures 1 and 2 indicates that the long-term drift in the Shapiro [2011] reconstruction since 1900 is overestimated by a factor of almost 10., 341739=[9] R.A. Kerr, \"Forecasting Regional Climate Change Flunks Its First Test\", Science, vol. 339, pp. 638-638, 2013. http://dx.doi.org/10.1126/science.339.6120.638, 390432=· Fyfe, J. C., W. J. Merryfield, V. Kharin, G. J. Boer, W.-S. Lee, and K. von Salzen (2011), Skillful predictions of decadal trends in global mean surface temperature, Geophys. Res. Lett.,38, L22801, doi:10.1029/2011GL049508, 151427=Clette, F. (2011) Past and future sunspot indices: New goals for SoTerIA. Journal of Atmospheric and Solar-Terrestrial Physics 73:182–186, 2011., 530675=Figure 2.14 from the IPCC AR5 WGI report. Global annual average land-surface air temperature (LSAT) anomalies relative to a 1961–1990 climatology from the latest versions of four different data sets (Berkeley, CRUTEM, GHCN and GISS)., 96427=Shaviv (2008), Shaviv N. J.: Using the oceans as a calorimeter to quantify the solar radiative forcing. Journal of Geophysical Research 113 (2008) A11101., 67490=Schrijver, C. J., W. C. Livingston, T. N. Woods, and R. A. Mewaldt (2011) The minimal solar activity in 2008–2009 and its implications for long-term climate modeling. Geophys. Res. Lett., 38, L06701. doi: 10.1029/2011GL046658, 142081=Furthermore, Leussu et al. (2013) found the ISN series decreased by roughly 20% around 1848 comparing with the data from original sunspot drawings by Schwabe. However, it was not found by Clette et al (2014) using the data provided by Hoyt and Schatten (1998). According to Leussu et al (2013), this breakpoint around 1848 was caused by the change of the primary observer from Schwabe to Wolf and, probably, an inappropriate individual correction factor used for Schwabe in the ISN. Therefore, we must check both historical sources to detect exactly the origin of these discrepancies., 244533=Hegerl, G.C., T.J. Crowley, W.T. Hyde, and D.J. Frame, 2006. Climate sensitivity constrained by temperature reconstructions over the past seven centuries. Nature;440: 1029–1032., 340695=[4] Stephens, G. L., T. L’Ecuyer, R. Forbes, A. Gettlemen, J.‐C. Golaz, A. Bodas‐Salcedo, K. Suzuki, P. Gabriel, and J. Haynes (2010), Dreary state of precipitation in global models, J. Geophys. Res., 115, D24211, doi:10.1029/2010JD014532, 114769=Evaluating these parameters, I arrive at the conclusion that the global temperature may during the next solar deep minimum fall to a level slightly higher than around 1900 which means -0.6 ±0.2 °C relative to the last decade., 247320=Rogelj, J., M. Meinshausen and R. Knutti, 2012. Global warming under old and new scenarios using IPCC climate sensitivity range estimates. Nature Climate Change, 2, 248–253, 65988=Lockwood, M. (2008), Recent changes in solar outputs and the global mean surface temperature. III. Analysis of contributions to global mean air surface temperature rise, P. Roy. Soc. A: Math. Phy., 464 (2094), 1387–1404, doi:10.1098/rspa.2007.0348., 45977=Figure 1: The PMOD composite of total solar irradiance (TSI). Daily values are shown in grey, 11-year running means in blue. Data were downloaded from the WRC/PMOD website on 6th September 2014 (http://www.pmodwrc.ch/pmod.php?topic=tsi/composite/SolarConstant)., 52918=Multiple regression fits of global mean temperature have been made using known inputs into the atmosphere at earth’s surface. Similarly global multiple regression maps of the air surface temperature have been generated, revealing influences on regional climates. These have been carried out using a number of different procedures and datasets [Lockwood, 2008; Lean and Rind, 2008; Folland et al., 2013 ; Kaufmann et al., 2011], but the conclusions are always very similar [Imbers et al., 2013 ] that contributions to global mean air surface temperature changes are in very close proportion to the estimated radiative forcings (see figure 3)., 391675=· Anagnostopoulos, G. G., Koutsoyiannis, D., Christofides, A., Efstratiadis, A. & Mamassis, N. (2010) A comparison of local and aggregated climate model outputs with observed data. Hydrol. Sci. J. 55(7), 1094–1110, 414785=Pielke Sr., R., K. Beven, G. Brasseur, J. Calvert, M. Chahine, R. Dickerson, D. Entekhabi, E. Foufoula-Georgiou, H. Gupta, V. Gupta, W. Krajewski, E. Philip Krider, W. K.M. Lau, J. McDonnell, W. Rossow, J. Schaake, J. Smith, S. Sorooshian, and E. Wood, 2009: Climate change: The need to consider human forcings besides greenhouse gases. Eos, Vol. 90, No. 45, 10 November 2009, 413. Copyright (2009) American Geophysical Union. http://pielkeclimatesci.wordpress.com/files/2009/12/r-354.pdf, 225307=Padilla (2011) – poor aerosol forcing estimation [see c) above]; reducing uncertainty about aerosol forcing by using only post 1970 data lowers range from 1.3–2.6°C to 1.1–1.9°C. Its TCR estimate is sensitive to the forcing dataset and does vary logically with ocean mixed layer depth., 93663=Scafetta (2009), Scafetta, N.: Empirical analysis of the solar contribution to global mean air surface temperature change. Journal of Atmospheric and Solar-Terrestrial Physics 71 (2009) 1916–1923., 320103=Figure 4 displays the ratio, or amplification factor, that observations and models depict for 1979-2012 in the tropics (see Christy et al. 2010 for further information). The mean observational result indicates the values are between +0.5 and +1.5 through the lower and middle troposphere (850 to 250 hPa). [The observational results tend to have greater variability due to the denominator (surface trend) being relatively small. Viewing Fig. 2 shows that the observations are rather tightly bunched for absolute trends in comparison to the model spread.] The models indicate a systematic increase in the ratio from 1.0 at the surface with amplification factors well above +1.5 from 500 to 200 hPa. What this figure clearly indicates is that the second aspect of this discussion, i.e. namely the rising temperatures with increasing altitude, is also over-done in the climate models. The differences of the means between observations and models are significant., 100418=What we observe in the GISP2 temperature graph is a cooling since the Holocene maximum 4000 years ago, interrupted with temperature peaks about 1000 years apart. The temperature peaks can be identified with historic warm periods., 340203=[2] G.J. van Oldenborgh, F.J. Doblas Reyes, S.S. Drijfhout, and E. Hawkins, \"Reliability of regional climate model trends\", Environmental Research Letters, vol. 8, pp. 014055, 2013. http://dx.doi.org/10.1088/1748-9326/8/1/014055, 134943=Vieira L. et al., Evolution of the solar irradiance during the Holocene, Astron. astrophys., 531, 6, 2011., 153146=Rethly, A., Berkes, Z., 1963. Nordlicht beobachtungen in Ungarn, 1523–1960. Verlag der Ungarischen Akademieder Wissenschaften, Budapest., 184654=Rose, B. E., Armour, K. C., Battisti, D. S., Feldl, N., & Koll, D. D. (2014). The dependence of transient climate sensitivity and radiative feedbacks on the spatial pattern of ocean heat uptake. Geophysical Research Letters. doi:10.1002/(ISSN)1944-8007, 64409=Imbers, J., A. Lopez, C. Huntingford, and M. R. Allen (2013) Testing the robustness of the anthropogenic climate change detection statements using different empirical models. J. Geophys. Res. Atmos., 118, 3192–3199, doi:10.1002/jgrd.50296., 360095=Wramneby, A., B. Smith, and P. Samuelsson (2010), Hot spots of vegetation-climate feedbacks under future greenhouse forcing in Europe, J. Geophys. Res., 115, D21119, doi:10.1029/2010JD014307., 200454=At 4.1°C, the ECS of the CESM1-CAM5 is higher than for most GCMs. Nonetheless, decadal trends from the model track quite closely with those derived from NOAA-NCDC observations (red line), with the model mean decadal trend (thick black line) skirting above and below observed trends about evenly since 1920. In several instances, decadal trends in observations have been at or beyond the LE range including intervals of exceptional observed warming (1945, 1960, 1980) and cooling (1948, 2009). The extent to which these frequent departures from the LE reflect errors in observations, insufficient ensemble size, or biases in model internal variability remains unknown. Nonetheless, there is no clear evidence of the model sensitivity being systematically biased high. Also noteworthy is the fact that the LE suggests that due to forcing, as indicated by the ensemble mean, certain decades including the 2000s are predisposed to a reduced rate of surface warming., 92607=Lorenzetto (2009), Lorenzetto, S.: Se la Terra si surriscalda colpa del Sole: l’uomo non c’entra. Il Giornale, October 25, 2009. http://www.ilgiornale.it/news/se-terra-si-surriscalda-colpa-sole-l-uomo-non-c-entra.html, 183993=Otto, A., Otto, F. E. L., Boucher, O., Church, J., Hegerl, G., Forster, P. M., et al. (2013). Energy budget constraints on climate response. Nature Geoscience, 6(6), 415–416. doi:10.1038/ngeo1836, 417008=Pielke Sr, R.A., Editor in Chief., 2013: Climate Vulnerability, Understanding and Addressing Threats to Essential Resources, 1st Edition. J. Adegoke, F. Hossain, G. Kallos, D. Niyoki, T. Seastedt, K. Suding, C. Wright, Eds., Academic Press, 1570 pp. Available May 2013., 237328=Figure 4. Modelled versus observed decadal global surface temperature trend 1979–2013 Temperature trends in °C/decade. Source: http://climateaudit.org/2013/09/24/two-minutes-to-midnight/. Models with multiple runs have separate boxplots; models with single runs are grouped together in the boxplot marked ‘singleton’. The orange boxplot at the right combines all model runs together. The red dotted line shows the actual increase in global surface temperature over the same period per the HadCRUT4 observational dataset., 201437=The LE also allows for the evaluation of subsets of ensemble members, such as in Fig 2, where the planetary imbalances for the ten ensemble members with the greatest global surface warming (red) and cooling (blue) trends from 2000-2010 are compared. It is found that no significant difference exists between the two distributions and the mean imbalance for the cooling members is actually greater than for the warming members. Thus the finding of a relatively unchanged planetary imbalance during the recent hiatus period is entirely consistent with analogous periods in LE simulations. While the LE does suggest that recent trends have been exceptional, this is also suggested by the instrumental record itself, which includes exceptional El Niño (1997-98) and La Niña events (2010-2012) at the bounds of the recent hiatus., 388256=· provide projections of future climate change on two time scales, near term (out to about 2035) and long term (out to 2100 and beyond), and, 143523=In any case, note that the results presented by Clette et al. (2014) are preliminary and the authors indicate that “although recent cycles do not reach unprecedented amplitudes anymore, the repetition of five strong cycles over the last 60 years (cycles 17 to 22, with the exception of cycle 20) still marks a unique episode in the whole 400-year record” and they add that “this unique character is also illustrated when considering another sunspot byproduct, i.e. the number of spotless days over each sunspot cycle minimum”. Figure 4 shows the total number of spotless days from 1818 (red line). Unfortunately, we have no reliable data of this indicator for earlier years., 90411=Eichler et al. (2009), Eichler, A., S. Olivier, K. Heenderson, A. Laube, J. Beer, T. Papina, H.W. Gaggeler, M. Schwikowski: Temperature response in the Altai region lags solar forcing. Geophysical Research Letters 36 (2009) L01808., 348103=But also here, RCMs can be of great help, not necessarily by providing reliable predictions, but also by supporting evidence about the salience of planned measures or policies (Berkhout et al, 2013). A nice example is a near flooding situation in Northern Netherlands (January 2012), caused by a combined occurrence of a saturated soil due to excessive antecedent precipitation, a heavy precipitation event in the coastal area and a storm surge with a duration of several days that hindered the discharge of excess water from the area. This is typically a “real weather” event that is not necessarily exceptional but does expose a local vulnerability to superfluous water. The question asked by the local water managers was whether the combination of the individual events (wet soil, heavy rain, storm surge) has a causal relationship, and whether the frequency of occurrence of compound events can be expected to change in the future. Observational analyses do suggest a link between heavy precipitation and storm surge, but the available dataset was too short to explore the statistical relationships in a relevant part of the frequency distribution. A large set of RCM simulations is now explored to increase the statistical sample, but – more importantly – to provide a physically comprehensive picture of the boundary conditions leading up to an event like this. By enabling the policy makers to communicate this physically comprehensive picture provides public support for measures undertaken to adapt to this kind of events. This exploration of model based – synthetic – future weather is a powerful method to assess the consequences of possible changes in regional climate variability for the local water management., 116982=Keen, R., Volcanoes and Climate since 1960: what does the Moon have to say? 2008 http://lasp.colorado.edu/sorce/news/2008ScienceMeeting/doc/Session4/S4_05_Keen.pdf , Updated at NOAA Earth System research Lab Global Monitoring Annual Conference, May 21.22, 2013, Boulder, Col., 9099=The estimated increase in radiative forcing due to the sun since 1750 is only 0.05 W/m2 compared to a total increase that is mainly caused by greenhouse gases of 2.29 W/m2. This almost negligible influence is even smaller than the estimation in the fourth assessment report which was 0.12 W/m2 on a total of 1.66 W/m2. The reduction since AR4 has partly to do with the decreased solar activity in the current solar cycle 24., 248573=Tomassini, L.et al, 2013. The respective roles of surface temperature driven feedbacks and tropospheric adjustment to CO2 in CMIP5 transient climate simulations. Clim. Dyn, DOI 10.1007/s00382-013-1682-3., 390973=· Xu, Zhongfeng and Zong-Liang Yang, 2012: An improved dynamical downscaling method with GCM bias corrections and its validation with 30 years of climate simulations. Journal of Climate 2012 doi: http://dx.doi.org/10.1175/JCLI-D-12-00005.1, 413689=Mearns, L.O. , R. Leung, R. Arritt, S. Biner, M. Bukovsky, D. Caya, J. Correia, W. Gutowski, R. Jones, Y. Qian, L. Sloan, M. Snyder, and G. Takle 2013: Reply to R. Pielke, Sr. Commentary on Mearns et al. 2012. Bull. Amer. Meteor. Soc., in press. doi: 10.1175/BAMS-D-13-00013.1. http://pielkeclimatesci.files.wordpress.com/2013/02/r-372a.pdf, 377345=[12] Wang Y, Leung L, McGregor J, Lee D, Wang W, Ding Y, Kimura F (2004) Regional climate modeling: Progress, challenges, and prospects. Journal of the Meteorological Society of Japan 82:1599–1628, 504795=Armin Bunde is professor of theoretical physics in Giessen. After receiving his PhD in theoretical solid state physics at Giessen University, he spent several years as a Post Doc in Antwerp, Saarbrücken, and Konstanz. He received a prestigious Heisenberg Fellowship in 1984 and spent three years at Boston University and Bar Ilan University in Israel, where he worked with H.Eugene Stanley (Boston) and Shlomo Havlin (Israel). In 1985 he received the Carl-Wagner Award. Between 1987 and 1993 he was professor of theoretical physics at Hamburg University, since 1993 he is back in Giessen., 119126=Soon, W. and Legates, D. R. Solar irradiance modulation of equator-to-pole (Arctic) temperature gradients: Empirical evidence for climate variation on multi-decadal timescales, Journal of Atmospheric and Solar-Terrestrial Physics, 93, 45-56, 2013}",
    "textBeforeTable": "Table 1 Benestad said that ice ages and the El Niño Southern Oscillation (ENSO) are examples of LTP processes. Bunde and Koutsoyiannis disagreed (Table 3). The three participants agree that LTP exists in the climate (Table 1), but they disagree about the exact definition and the physical processes that lie behind it. Benestad and Bunde describe LTP in terms of “long memory”. Koutsoyiannis holds the opinion that LTP is mainly the result of the irregular and unpredictable changes that take place in the climate (Table 2). Both Bunde and Koutsoyiannis are in favour of a formal (mathematical) definition of LTP, which states that on longer time scales climate variability decreases—but not as much as implied by classical statistics. If the temperature of this year is not related to that of last year or next year we can use statistics to determine whether the increase in global temperature is significant or not. In such an “uncorrelated climate”, i.e. if the temperature of this year is fully independent of other years, the average value becomes zero (or a fixed value) quickly and deviations from the mean last only shortly. However, if there is (strong) temporal dependence the moving average can have large deviations from the mean. This is called long-term dependence or long-term persistence (LTP). Long term persistence and trend significance “Is global average temperature increase statistically significant?” To answer this question one needs to make assumptions on the statistical nature of the temperature time series and to choose what statistical",
    "textAfterTable": "Bunde LTP is a process with long memory; the value of a parameter (e.g. temperature) today depends on all previous points. Koutsoyiannis It is unfortunate that LTP has been interpreted as memory; it is the change, mostly irregular and unpredictable in deterministic terms, that produces the LTP, while the autocorrelation results from change. Table 3 Benestad Bunde Koutsoyiannis Quasi-oscillatory phenomena like ENSO can be described as LTP. Yes No No Is LTP relevant for the detection of climate change? There was confusion about the exact meaning of the IPCC definition about detection. The definition reads: “Detection of change is defined as the process of demonstrating that climate or a system affected by climate has changed in some defined statistical sense without providing a reason for that change. An identified change is detected in observations if its likelihood of occurrence by chance due to internal variability alone is determined to be small.” Bunde and Koutsoyiannis both think detection is mainly a matter of statistics while Benestad thinks it also involves a physical interpretation of distinguishing unforced internal variability from forced changes. Table 4 Benestad Bunde Koutsoyiannis Is detection purely a matter of statistics? No, laws of physics sets fundamental constraints Yes",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}