{
    "relation": [
        [
            "Campsite",
            "Residence Trivento",
            "Residence Trivento"
        ],
        [
            "Area",
            "Campania (Salerno)",
            "Campania (Salerno)"
        ],
        [
            "Validity period",
            "07/06/2015-07/18/2015",
            "01/16/2015-08/31/2015"
        ],
        [
            "Description",
            "Appartamenti Palinuro settimana 11-18.07 Appartamenti in villette in residence con piscina e animazione a Palinuro. Attrezzati con angolo cottura completo di ...",
            "Residence con piscina a Palinuro nel Cilento. Appartamenti e case vacanze in villette attrezzati con angolo cottura, terrazzo con mobili da giardino, Tv e WiFi, ..."
        ]
    ],
    "pageTitle": "Campsites Guide - Villages Guide - EasyCamping",
    "title": "",
    "url": "http://www.easycamping.it/en/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420728594,
    "recordOffset": 420712615,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 07 Jul 2015 20:40:54 GMT",
    "textBeforeTable": "Special Offer and Last Minute Enjoy: special offer, special savings, discounts and Last Minute. Special Offer and Last Minute Search Residences, Fun fair parks, Rent apartments, Stop areas, Farm holidays, Bed and Breakfast, Rent rooms, Hotels, Budget hotels, in Italy. Search other kind of structures La Locanda del Postino La Locanda del Postino in situated on the esplanade in the western part of the island of Salina. Crowned and sheltered by an amphitheatre of mountains, it o ... Sicilia>Messina First choice Le Palme Village The \"Le Palme Village\" campsite lies in a small oasis of greenery, on a beach lapped by the magnificent sea associated with the ancient legend of Ulysses, a re ... Lazio>Latina First choice",
    "textAfterTable": "Advertising - Properties Highlight Highlight Camping San Teodoro La Cinta Accesso diretto alla bellissima spiaggia de 'La Cinta' dalla sabbia bianca e dall'acqua trasparente e poco profonda. Ideale per bambini,gommonauti e surfisti. Sardegna>Olbia Tempio Highlight Camping Eucaliptus Is a holiday camp that offers a peaceful and friendly atmosphere above all. It is situated in a residential area in the town of Alba Adriatica, at 400 metres f ... Abruzzo>Teramo Highlight Holiday Center Valdor The Holiday Center Valdor is sited a few minutes from Venice, by the sea where nature is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}