{
    "relation": [
        [
            "Postage and packaging",
            "Free P&P",
            "US $6.99",
            "US $21.99"
        ],
        [
            "Each additional item",
            "Free",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping",
            "Expedited Delivery (USPS Priority Mail®)",
            "Expedited Delivery (USPS Priority Mail Express®)"
        ],
        [
            "Delivery*",
            "Estimated by Fri. 07 Aug. to 07095 per eBay FAST & FREE",
            "Estimated between Tue. 4 Aug. and Fri. 7 Aug.",
            "Estimated between Tue. 4 Aug. and Wed. 5 Aug."
        ]
    ],
    "pageTitle": "Swallow Tattoo - Set of 4 Drink Coasters - Your Text Here! Customizable #92C | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Swallow-Tattoo-Set-of-4-Drink-Coasters-Your-Text-Here-Customizable-92C-/370947691299?pt=LH_DefaultDomain_0&hash=item565e349323",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423031771,
    "recordOffset": 422975431,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 40 items available. Please enter a number less than or equal to 40. -Select- Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Republic Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Brazil British Virgin Islands Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Islands Cayman Islands Central African Republic Chad Chile China Colombia Comoros Congo, Democratic Republic of the Congo, Republic of the Cook Islands Costa Rica",
    "textAfterTable": "* You’ll see an estimated delivery date based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your payment clears - opens in a new window or tab. Returns policy After receiving the item, cancel the purchase within Refund will be given as 30 days Money back The buyer is responsible for return postage costs. Return policy details If your item has a manufacturing defect or your item was damaged during shipping you may return the item for a full refund or exchange at no additional cost to you. Please be aware that the item must be returned in its original shipping",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}