{
    "relation": [
        [
            "Command",
            "snmp ifindex clear",
            "snmp ifindex persist"
        ],
        [
            "Description",
            "Clears any previously configured snmpifIndex commands issued in interface configuration mode for a specific interface.",
            "Enables ifIndex values that persist across reboots (ifIndex persistence) in the IF-MIB."
        ]
    ],
    "pageTitle": "Cisco IOS Interface and Hardware Component Command Reference - show service-module serial through standby port [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/interface/command/ir-cr-book/ir-s6.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 372476223,
    "recordOffset": 372380631,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27872=The following shows sample output from the showservice-moduleserialcommand issued on a Cisco 1605 router:, 73390=speed { 10 | 100 | 1000 [ negotiate] | auto [ speed-list] }, 20647=Total bandwidth of the line (for example, 24 time slots multiplied by 64 kbps equals a bandwidth of 1536 kbps)., 33078=The following sample output shows CSU/DSU performance statistics on a Cisco 2524 or Cisco 2525 router for intervals 30 to 32. Each interval is 15 minutes long. All the data is zero because no errors were discovered on the T1 line:, 15729=For D4 signals, a count of 1-second intervals with framing errors, or an Out-of-Frame defect, or 1544 line code violations.}",
    "TableContextTimeStampAfterTable": "{361139=To display the names and versions of individual files in the hw-programmable package file in a Cisco ASR 1000 Series Router, use the showupgradehw-programmablefilecommand in Privileged EXEC configuration mode., 547352=1000 Mbps and half duplex (Gigabit Ethernet only), 523878=Configures the interface to transmit at 1000 Mbps. This keyword is valid only for interfaces that support Gigabit Ethernet., 535458=speed auto 10 100 1000, 507154=This command was introduced on the Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series routers., 316588=In the following example, the showupgradefpdpackagedefault command output shows that the ubr10k-fpd-pkg.122-122_33_SCB_20081123.pkg FPD image package file is required for the SPAs on this particular router with this particular Cisco IOS software release:, 229857=A key can be optionally added to a GRE tunnel and used to identify a traffic flow within the tunnel, as defined in RFC 2890, Key and Sequence Number Extensions to GRE., 368858=Displays the upgrade progress of the line card-field upgradeable device (LC-FPD) on a Cisco ASR 1000 Series Router., 554779=Forces a speed of 1000-Mbps and the half-duplex operation, and disables autonegotiation on the interface (Gigabit Ethernet only)., 42998=This command was modified. The interface-type and interface-number arguments and the broadcast, multicast, unicast, and history keywords were added to support the Ethernet switch network module on the Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series routers., 537565=speed 1000 [negotiate], 554568=speed 1000, 363651=The package file name is typically named asr1000-hw-programmables.<release_name>.pkg, 375205=Displays the current CPLD and FPGA version on a Cisco ASR 1000 Series Router., 368109=Performs a Complex Programmable Logic Device (CPLD) or Field-Programmable Gate Array (FPGA) upgrade on a Cisco ASR 1000 Series Router., 530140=Use the speed {10 | 100} command for 10/100 ports, the speed auto 10 100 1000 command for 10/100/1000 ports, and the speed 1000 [negotiate] command for Gigabit Ethernet ports., 507506=This command was integrated into Cisco IOS Release 12.3(4)XG on the Cisco 1700 series routers., 508221=This command was integrated into Cisco IOS Release 12.3(11)T on Cisco 2800 series and Cisco 3800 series routers., 363432=This is the hw-programmable upgrade package file that contains a new version of the CPLD and FPGA code, used for performing the CPLD on a Cisco ASR 1013 Router or FPGA upgade on a Cisco ASR 1000 Series Router., 424824=Enables and configures a port on an Ethernet hub of a Cisco 2505 or Cisco 2507 router., 547600=1000 Mbps and full duplex (Gigabit Ethernet only), 531503=If you set the Ethernet interface speed to auto on a 10/100-Mbps or 10/100/1000-Mbps Ethernet interface, both duplex operation and speed are autonegotiated., 537841=Speed is 1000 or negotiation is enabled., 484309=To issue a Simple Network Management Protocol (SNMP) trap when a MAC address violation is detected on an Ethernet hub port of a Cisco 2505, Cisco 2507, or Cisco 2516 router, use the snmptrapillegal-address command in hub configuration mode. To disable this function, use the no form of this command., 551451=1000 Mbps and full duplex (Gigabit Ethernet interfaces only), 368503=Displays the current CPLD and FPGA versions on a Cisco ASR 1000 Series Router., 392603=Local Credits : The amount of credits belonging to this node.PeerCredits: The amount of credits belonging to the peer.CreditGrantThreshold: The number of credits below which the peer needs to dip before this node sends an inband or out-of-band grant.MaxCreditspergrant: 65534PADGSeqNum: 133 PADGTimerindex: 0PADGlastrcvdSeqNum: 133PADGlastnonzeroSeqNum: 0PADGlastnonzerorcvdamount: 0PADGTimers: [0]-1000 [1]-2000 [2]-3000 [3]-4000PADGxmit:numbericrcvd: numeric PADCxmit:133rcvd:133 PADQxmit:0rcvd: 0, 535306=10/100/1000-Mbps interface, 369545=To display the upgrade progress of the line card-field upgradeable device (LC-FPD) on a Cisco ASR 1000 Series Router, use the showupgradehw-programmableprogresscommand in Privileged EXEC configuration mode., 543455=You cannot set the duplex mode to half when the port speed is set to 1000, and similarly, you cannot set the port speed to 1000 when the mode is set to half duplex. In addition, if the port speed is set to auto, the duplex command is rejected., 514287=To configure source address control on a port on an Ethernet hub of a Cisco 2505 or Cisco 2507 router, use the source-address command in hub configuration mode. To remove a previously defined source address, use the no form of this command., 528017=This command was implemented on the 4-port 10/100 Fast Ethernet SPA and the 2-port 10/100/1000 Gigabit Ethernet SPA on the Cisco 7304 router., 519166=The following example configures the hub to allow only packets from MAC address 1111.2222.3333 on port 2 of hub 0:, 436030=(Optional) Specifies the time, in milliseconds, between the onhook and offhook patterns. Values are in the range from 50 to 5000. Default is 2000. Any value entered is rounded up to the next multiple of 50 milliseconds., 508582=This command was integrated into Cisco IOS Release 12.3(14)T on Cisco 1800 series routers., 555474=Forces a speed of 1000-Mbps and the full-duplex operation, and disables autonegotiation on the interface (Gigabit Ethernet only)., 550140=Autonegotiates the speed. The interface advertises the capability for duplex mode for Fast Ethernet interfaces at a speed of 10-Mbps and 100-Mbps, and Gigabit interfaces at 10-Mbps, 100-Mbps, and 1000-Mbps., 507848=This command was integrated into Cisco IOS Release 12.3(7)T on Cisco 2600 series, Cisco 3631, and Cisco 3700 series routers., 42586=This command was integrated into Cisco IOS Release 12.2(8)T to support switchport creation on Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series routers., 527322=This command was modified. The 1000 keyword was added for Gigabit Ethernet interfaces., 548035=speed 10 or speed 100 or speed 1000, 531804=The Gigabit Ethernet interfaces are full duplex only. You cannot change the duplex mode on Gigabit Ethernet interfaces or on a 10/100/1000-Mbps interface that is configured for Gigabit Ethernet., 532078=The speed command applies to Shared Port Adapter (SPA) interfaces that use RJ-45 media. Gigabit Ethernet interfaces using fiber media support 1000-Mbps speed only and use the negotiation command to enable and disable autonegotiation., 419684=To shut down a port on an Ethernet hub of a Cisco 2505 or Cisco 2507 router, use the shutdowncommand in hub configuration mode. To restart the disabled hub, use the no form of this command., 365918=For procedures on performing a CPLD upgrade, see the Upgrading Field Programmable Hardware Devices for Cisco ASR 1000 Series Routers document., 523746=1000}",
    "textBeforeTable": "Syntax Description [interval-range] ] [ performance-statistics number serial service-module show To display the performance report for an integrated CSU/DSU, use the showservice-moduleserial command in privileged EXEC mode. show service-module serial sts-1 standby port sra line squelch speed source-address snr margin snmp-server ifindex persist snmp trap illegal-address snmp ifindex persist snmp-server enable traps netsync snmp ifindex clear snmp ifmib ifindex persist smt-queue-threshold signaling shutdown (interface) shutdown (hub) shutdown (dwdm) shutdown (controller) show wedged-interfaces show vmi neighbors show upgrade table show upgrade progress show upgrade package default show upgrade hw-programmable progress show upgrade hw-programmable file show upgrade fpga progress show upgrade fpd table show upgrade fpd progress show upgrade fpd package default show upgrade fpd file show upgrade file show ucse server raid level show ucse server erase device status",
    "textAfterTable": "Command Modes Privileged EXEC Command History Release Modification 11.2 This command was introduced. 12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. 12.2SX This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware. Usage Guidelines This command applies to the 2- and 4-wire 56/64-kbps CSU/DSU module and FT1/T1 CSU/DSU module. The performance-statistics keyword applies only to the FT1/T1 CSU/DSU module. Examples The following sample output shows CSU/DSU performance statistics on a Cisco 2524 or Cisco 2525 router for intervals 30 to 32. Each interval is 15 minutes long. All the data is zero because no errors were discovered on",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}