{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "hang around the jay walk and study",
            "just read your work",
            "This is a great college where you get a lot of help from the centers that are offered such as the seek tutoring lab.The professors are great and they know they topic well."
        ]
    ],
    "pageTitle": "CUNY John Jay College of Criminal Justice Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/CUNY-John-Jay-College-of-Criminal-Justice/reviews?_escaped_fragment_=/show/9053",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902888659,
    "recordOffset": 902831780,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{225769=I am a transfer student that will be attending John Jay in the fall of 2013 and John Jay professionals have been very welcoming. I have attended several events the college has offered transfer students. They have been very helpful as the events provided specific answers to many questions I may have had., 237230=My aunts went to this school and they said it was great! I'm planning to apply here for Fall 2014. I hope it's great., 86911=This is my dream commuter campus. The best diverse students and professors. I just completed my BA in Forensic and will begin my MA in Forensic Mental Health Counseling August 2012., 41864=john jay always have something new to offer. this semester, spring 2012, they have free yoga, a team to get in shape, workshops are being offered, and there are clubs to join., 276171=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/05/2009 Reviewer is A current student here. 41 out of 42 people found this review useful. 1 of 71 Jsmilez from Brooklyn, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Am enjoying being here I enjoy being here because it is right in the city, also the programs that are provided here for such an affordable price are excellent such like the Pre-law program in which I am involved in where they have a pre-law boot camp for freshmans and sophmores this summer to help prepare me and my peers for law school. I also enjoy being here because John Jay have a variety of students from different backgrounds who attend here. There are also a variety of clubs and activities to get involved in. Th school size is just right, not too big to get lost in, or too small. There are lounges which one may watch t.v., mingle, and use the computers provided. Am learning a lot I learn a lot from this school because the professors are willing to help if you ask. We also are given a lot of readings and if that is not done, the professors provide class discussions to encourage me and my fellow classmates to learn. Login to rate or flag the reviews Cariane from Staten Island, NY 07/18/2009 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}