{
    "relation": [
        [
            "First Name",
            "Jerry",
            "Lizanne"
        ],
        [
            "Last Name",
            "Prout",
            "Davis"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=F7A3CB18-3BF2-4A4C-9F08-DD8DA0A3EDF2&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220379683,
    "recordOffset": 220371565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21671=H.R. 4173 Restoring American Financial Stability Act of 2010: in support of a strong end-user exemption in derivatives trading S. 3217 Restoring American Financial Stability Act of 2010, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 28384=S. 1960 A bill to suspend temporarily the duty on propylene glycol alginates; S. 1961 A bill to suspend temporarily the duty on certain alginates S. 1962 A bill to suspend temporarily the duty on sodium alginate; S. 2251 A bill to suspend temporarily the duty on Fluthiacet-methyl, 15034=H.R. 2868 Chemical and Water Security Act of 2009: site security Crop Protection Chemical Regulation Re-registration Carbamates, Pyrethroids, 30720=H.R. 4380 Miscellaneous Trade and Technical Corrections Act of 2009: duty suspension H.R. 6517 Omnibus Trade Act of 2010 Trade issues, 32888=S. 1733 Clean Energy Jobs and American Power Act; H.R. 4741 Clean Energy Act of 2010; S. 2729 Clean Energy Partnerships Act of 2009; S. 2776 Clean Energy Act of 2009; S. 2877 Carbon Limits and Energy for America's Renewal (CLEAR) Act H.R. 2454 American Clean Energy and Security Act, 17282=S. 1462 American Clean Energy Leadership Act of 2009: lithium battery technology S. 661 Energy Efficiency in Manufacturing H.R. 2454 American Clean Energy and Security Act of 2009 S. 3495 Promoting Electric Vehicles Act of 2010, 19568=H.R. 2868 Chemical and Water Security Act of 2009: plant/facility security, 23923=S. 1856 A bill to amend the Energy Policy Act of 2005: to define 'pore space' as a subsurface space of any size that can be used as storage space for carbon dioxide or other substances injected into the space for storage, 12238=S.787 Clean Water Resotration Act H.R. 1262 Water Quality Investment Act of 2009 S. 1733 Clean Energy Jobs and American Power Act}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JERRY PROUT  2029565209  patricia.ripperger@fmc.com 5. Senate ID#  15031-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}