{
    "relation": [
        [
            "Categories",
            "Dorm Life",
            "In three sentences"
        ],
        [
            "Comments",
            "I have never been in the dorms.",
            "I enjoy Cameron a lot more than any other school I have attended so far. The teachers are excellent and work with you. The classes are interesting."
        ]
    ],
    "pageTitle": "Cameron University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cameron-University/reviews?_escaped_fragment_=/show/35941",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919563383,
    "recordOffset": 919520053,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14406=On campus, Cameron University is always hosting social functions, including parties and outdoor events. The Aggie RecCenter has an indoor heated swimming pool and facilities for weightlifting, cardiovascular workouts, racquetball, basketball, and other physical activity. As for off-campus attractions, depending on your tastes there's more to do in the Lawton area than there is than in the rest of the land between Dallas and OKC. Nearby Lawton is the Wichita Mountain Wildlife Refuge, which hosts a number of activities throughout the year and is a great place for all sorts of outdoor recreation. Also nearby is Medicine Park, a small resort town-like community that features a variety of shops, restaurants, and come spring 2014 will also host an aquarium and natural sciences center. Lawton (and Medicine Park) are adjacent to Lake Lawtonka, which provides opportunities for fishing, boating, swimming and the like. If museums are more your thing, there's a few in the area; the Museum of the Great Plains, the Ft. Sill Museum, and the Comanche National Museum and Cultural Center., 130737=I live at home. My friends live in the dorms and they say it is very convenient for them. Their class is 8:00 A.M, they get up at 7:50. Pretty quick traveling, if you ask me. Get the most rest that way, I would think! But, they do mention that sometimes, there are parties on the same floor, or floor above them who do make the sleeping process hard., 69489=Make sure to apply for scholarships specifically the PLUS this scholarship has a firm deadline usually sometime in February., 157437=© 2015, Cappex.com, LLC, 20473=Be sure to look into financial aid like a federal Pell Grant or Cameron University's General Scholarship. You can cut your fees almost in half this way. Be sure to apply for the general scholarship early! The initial deadline tends to be in the spring, around February. They only consider applicants after this point if they still have money left to award.}",
    "textBeforeTable": "04/20/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 1 of 35 Megan from Tulsa, OK Check out reviews left by other students or leave your own review. You could win a free scholarship. Cameron University Reviews Cameron University › Oklahoma › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Login to rate or flag the reviews Sarah from Geronimo, OK 05/09/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 35 Categories Comments Great for these types of students Well, this is a pretty well rounded collage! Almost anyone can come here and be satisfied....unless you think you want a more expensive collage? That's fine, hehe. Well, Cameron is known to be the Aggies. They are pretty big in Agricultural things! So, FFA Or even a slight interest in farm, plant, animal, and agriculture is great! But, they offer several different courses, majors and minors! They are just as capable as anyone else. :) Tips for prospective students Talk to people! Mostly everyone likes to talk for a while. Ask around, ask for tips, ask about the campus! People like to share! There is a gold rush- an enrollment orientation, and the people running it are really great with telling you about the campus and such! Most likely, they will answer the top questions while they show you around. :) They",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}