{
    "relation": [
        [
            "Patent application number",
            "20090126251",
            "20110107650",
            "20120151817",
            "20120167432",
            "20120311912",
            "20130276346",
            "20140109460",
            "20140360075",
            "20150153136"
        ],
        [
            "Description",
            "TWO IN ONE SIGHT - An aiming sight has a base, two oppositely facing light emitting elements on the base, a pivot upon which the base rotates, a detent that holds the base at selected positions, and a spring, magnet or other structure that presses the sight towards the aimed device upon which the sight is mounted. The sight is selectively rotated so that one of the light emitting elements faces the user for aiming, without removing the sight or the light emitting elements from the aimed device.",
            "SIGHTING DEVICE WITH MICROSPHERES - An aiming sight has a base, at least one light emitting element on the base, and a clear cover over the light emitting element. The light emitting element is made of light gathering plastic combined with self-luminous microspheres. When ambient light is present, the light emitting element functions as a light gathering rod that emits light from the back end. When no light is present, the light emitting element is self-luminous.",
            "Weapon sight light emission system - A light emission assembly for weapon sights which provides a viewable illuminated aiming indicia of substantially fixed area and uniform brightness regardless of the ambient light conditions.",
            "Recoil Pad - A recoil pad having a pad in which the elastomer contains a plurality of pockets having one or more pocket characteristics adjustable over the entirety or portions of the pad to achieve recoil pad characteristics which can be incrementally variably matched to the recoil energy characteristics and recoil energy transfer characteristics of a particular target stock.",
            "Foldably segmented weapon sight - A weapon sight removably mountable on a weapon provides a plurality of weapon sight segments coupled in end to end linear relation including a front weapon sight segment configured to receive a front sight and a rear weapon sight segment configured to receive a rear sight which disposes the front sight at a fixed distance from the rear sight allowing alignment of the front sight with the rear sight to aim the weapon at a target.",
            "Foldably Segmented Weapon Sight System - A weapon sight removably mountable on a weapon provides a plurality of weapon sight segments coupled in end to end linear relation including a front weapon sight segment configured to receive a front sight and a rear weapon sight segment configured to receive a rear sight which disposes the front sight at a fixed distance from the rear sight allowing alignment of the front sight with the rear sight to aim the weapon at a target.",
            "Weapon Sight Light Emission Member Locking System - An aiming sight having a sight body having a bore communicating between first and second body ends adapted to receive within in unflexed retained engagement a light conductive member configured to receive light along the length and conduct the light to at least one light conductive member end to provide a viewable aiming indicia",
            "Recoil Pad Mold - A recoil pad having a pad in which the elastomer contains a plurality of pockets having one or more pocket characteristics adjustable over the entirety or portions of the pad to achieve recoil pad characteristics which can be incrementally variably matched to the recoil energy characteristics and recoil energy transfer characteristics of a particular target stock.",
            "Weapon Sight Light Emission System - A light emission assembly for weapon sights which provides a viewable illuminated aiming indicia of substantially fixed area and uniform brightness regardless of the ambient light conditions."
        ],
        [
            "Published",
            "05-21-2009",
            "05-12-2011",
            "06-21-2012",
            "07-05-2012",
            "12-13-2012",
            "10-24-2013",
            "04-24-2014",
            "12-11-2014",
            "06-04-2015"
        ]
    ],
    "pageTitle": "Moore, CO - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/moore-co-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445493431,
    "recordOffset": 445470260,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Richard A. Moore, Fort Collins, CO US 03-10-2011 FEEDTHRU INCLUDING A CERAMIC BASED COATING AND A METHOD OF APPLYING A CERAMIC BASED COATING TO A FEEDTHRU - The present invention relates to a feedthru ( 20110056745 10-21-2010 VIBRATING FLOW DEVICE AND METHOD FOR FABRICATING A VIBRATING FLOW DEVICE - The present invention relates to a vibrating flow device that includes at least one conduit, at least one drive, at least one pick-off, and at least one housing. The at least one drive vibrates the at least one conduit at one or more drive frequencies and the at least one pick-off measures the motion of the at least one conduit. The at least one housing encompasses at least a portion of the at least one conduit. The at least one housing's modes of vibration occur at frequencies that exceed the one or more drive frequencies. 20100263456 Published Description Patent application number Michele Moore, Lafayette, CO US //]]> BarDraw('2545908',['Patent applications by Michael Moore, Lafayette, CO US'],[[1,1,1,1]],['2008','2009','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2545908\" align=\"center\"></div> </div> <canvas id=\"bg2545908\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Michael Moore, Lafayette, CO US</p> <div class=\"bar2545908\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>12-06-2012</td> <td><a href=\"/patents/app/20120310890\">DATA COMPRESSION AND STORAGE TECHNIQUES</a> - Provided are systems and methods for use in data archiving. In one arrangement, compression techniques are provided wherein an earlier version",
    "textAfterTable": "Patent applications by Richard A. Moore, Fort Collins, CO US Richard D. Moore, Broomfield, CO US Patent application number Description Published 20130003958 FUNCTIONALITIES FOR LOCAL NUMBER PORTABILITY IN A TELECOMMUNICATIONS NETWORK - According to various embodiments of the present invention, systems and methods for local number portability in a telecommunication network are disclosed. An embodiment of a method includes submitting a local number portability (LNP) order for the TN directly to a first telecommunications carrier that the TN is to be transferred from, triggering a port of the TN in accordance with the LNP order, and porting the TN from the first telecommunications carrier to the second telecommunications carrier, wherein the second telecommunications carrier is bypassed by the customer during the submitting and the triggering of the LNP order. Other embodiments are also disclosed. 01-03-2013 20140294013 SYSTEM AND METHOD FOR NETWORK PROVISIONING - Implementations described and claimed herein provided for a system for provisioning network resources. The system includes a network provisioning abstraction layer having an application interface for receiving network provisioning requests from applications and determine provisioning instructions for fulfilling the requests. Each of the received provisioning instructions is queued in a priority queuing",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}