{
    "relation": [
        [
            "telecom.",
            "phone.",
            "fax.",
            "mobile.",
            "pager."
        ],
        [
            "Category",
            "Physical Contact Information",
            "Physical Contact Information",
            "Physical Contact Information",
            "Physical Contact Information"
        ],
        [
            "Type",
            "phonenum.",
            "phonenum.",
            "phonenum.",
            "phonenum."
        ],
        [
            "Short display name",
            "Phone number",
            "Fax number",
            "Mobile Phone number",
            "Pager number"
        ]
    ],
    "pageTitle": "WD-P3P-20000404 P3P Specification",
    "title": "",
    "url": "http://www.w3.org/TR/2000/WD-P3P-20000404/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 805600055,
    "recordOffset": 805535821,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{175154=<DATASCHEMA xmlns=\"http://www.w3.org/2000/P3Pv1\"> <DATA-GROUP> <!-- ********** Base Data Types ********** --> <!-- \"date.\" Data Type --> <DATA name=\"date.ymd.year\"           short=\"Year\"                           type=\"number\" size=\"6\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.ymd.month\"           short=\"Month\"                           type=\"number\" size=\"2\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.ymd.day\"           short=\"Day\"                           type=\"number\" size=\"2\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.hms.hour\"           short=\"Hour\"                           type=\"number\" size=\"2\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.hms.minute\"           short=\"Minutes\"                           type=\"number\" size=\"2\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.hms.second\"           short=\"Second\"                           type=\"number\" size=\"2\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.fractionsecond\"           short=\"Fraction of Second\"                           type=\"number\" size=\"6\"                           template=\"yes\"/>  <!-- Variable Data Element --> <DATA name=\"date.timezone\"           short=\"Time Zone\"                           type=\"text\"   size=\"10\"                           template=\"yes\"/>  <!-- Variable Data Element -->, 22625=The [ABNF] notation used in this specification is specified in RFC2234 and summarized in an Appendix. However, note that such syntax is only a grammar representative of the XML syntax: all the syntactic flexibilities of XML are also implicitly included; e.g. whitespace rules, quoting using either single quote (') or double quote (\"), character escaping, comments, and case sensitivity. In addition, note that attributes and elements may appear in any order., 2886=This is a W3C Working Draft for review by W3C members and other interested parties. This document has been produced by the P3P Specification Working Group as part of the P3P Activity, and it is the second revision of the last call draft issued the 2nd of November 1999 (http://www.w3.org/TR/1999/WD-P3P-19991102). A change log is included at the end of this document for convenience. The last call period is expected to end on April 30, 2000. A revised version of this specification is expected to advance toward W3C Recommendation status after two interoperable implementations have been demonstrated., 259428=Change log from the 2 November 1999 Specification (last call):, 1403=Copyright ©2000 W3C® (MIT, INRIA, Keio), All Rights Reserved. W3C liability, trademark, document use and software licensing rules apply., 231231=This appendix contains two XML Schemas, one for P3P policy documents, and one for P3P dataschema documents. An XML Schema may be used to validate the structure and datatype values used in an instance of the schema given as an XML document. P3P policy and dataschema documents are XML documents that MUST conform to these schemas. Note that these schemas are based on the 17 December XML Schema working drafts [XML-Schema1][XML-Schema2], which are subject to change., 23282=The following key words are used throughout the document and should be read as interoperability requirements. This specification uses words as defined in RFC2119 [KEY] for defining the significance of each particular requirement. These words are:, 37648=The meta tags directly encode the information that could be expressed using the P3P Policy, Prefix and Exclude headers. Each sequence of extension headers identified by the extension declaration: \"http://www.w3.org/2000/P3Pv1\" can be directly expressed in HTML with meta tags using a block of the form:, 244633=The formal grammar of P3P is given in this specification using a slight modification of [ABNF]. The following is a simple description of the ABNF.}",
    "lastModified": "Tue, 04 Apr 2000 18:57:14 GMT",
    "textBeforeTable": "P3P schemas may refer to the following primitive data element types: 4.2 Primitive Data Types Analogously to P3P policies, an essential requirement on dataschemas is the immutability of dataschemas: with one exception, dataschemas that can be fetched at a certain URI cannot be changed.  This way, the URI of a policy acts like a unique identifier for the dataschema, and usually any new dataschema must therefore use a new different URI. The only exception to this general principle is when multiple language versions (translations) of the same dataschema are offered by the server using the HTTP \"Content-Language\" tag to properly indicate that a particular language encoding has been used for the dataschema. P3P clients MAY check for immutability of dataschemas, by comparing a cached version of a dataschema (and its Content-Language if present) with the corresponding freshly retrieved dataschema (and Content-Language if present). If a user agent discovers that the two dataschemas are different but retain the same URI, then it MUST treat the resource referencing the changed dataschema as if it has no P3P policy, UNLESS the dataschemas have two different values of their Content-Language. 4.1 Immutability of Dataschemas Note that the data element names specified in the base data schema or in extension data schemas may be used for purposes other than P3P policies. For example, web sites may use these names to label HTML form fields. By referring to data the same way in",
    "textAfterTable": "4.3 Basic Data Types The Basic Data Types are structured types used by the P3P Base Data Schema (and, possibly, reused by other different data schemas). All P3P-compliant user agent implementations MUST be aware of the Basic Data Types. Each table below specifies the elements of a basic data type, the categories associated, their types, and the display names shown to users. More than one category may be associated with a fixed data element. However, each base data element is assigned to only one category whenever possible. Data schema designers are recommended to do the same. 4.3.1 Dates The date. type is a structured type that specifies a date. Since date information can be used in different ways, depending on the context, all date. information is tagged as being of \"variable\" category. Schema definitions have to explicitly set the corresponding category in the element referencing this data type. For example, soliciting the birthday of a user might be \"Demographic and Socioeconomic Data\", while the expiration date of a credit card belongs to the \"Financial Account Identifiers\" category. date. Category Type Short display name ymd.year (variable-category) number Year ymd.month (variable-category) number Month ymd.day (variable-category) number Day hms.hour (variable-category) number Hour hms.minute (variable-category) number Minute hms.second (variable-category) number Second",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}