{
    "relation": [
        [
            "Code or Value",
            "0 to 136.248",
            "."
        ],
        [
            "Value Description",
            "Range of Values",
            "Missing"
        ],
        [
            "Count",
            "131205",
            "946"
        ],
        [
            "Cumulative",
            "131205",
            "132151"
        ],
        [
            "Skip to Item",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2005 - 2006: Dietary Interview - Individual Foods, Second Day Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2005-2006/DR2IFF_D.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360966561,
    "recordOffset": 360950167,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{2282=Title: Dietary Interview - Individual Foods, Second Day (DR2IFF_D ) Contact Number: 1-866-441-NCHS Years of Content: 2005 - 2006 First Published: July, 2008 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Dietary interview component provides detailed dietary intake information from NHANES participants. Record Source: NHANES 2005 - 2006 Survey Methodology: NHANES 2005 - 2006 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files}",
    "lastModified": "Fri, 09 May 2014 20:27:41 GMT",
    "textBeforeTable": "Both males and females 0 YEARS - 150 YEARS Target: One of the key variables for the file. The primary key variables are SEQN and DR2ILINE. English Instructions: Food/Individual component number English Text: Food/Individual component number SAS Label: DR2ILINE Variable Name: DR2ILINE - Food/Individual component number Both males and females 0 YEARS - 150 YEARS Target: One of the key variables for the file. The primary key variables are SEQN and DR2ILINE. English Instructions: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Title: Dietary Interview - Individual Foods, Second Day (DR2IFF_D ) Contact Number: 1-866-441-NCHS Years of Content: 2005 - 2006 First Published: July, 2008 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Dietary interview component provides detailed dietary intake information from NHANES participants. Record Source: NHANES 2005 - 2006 Survey Methodology: NHANES 2005 - 2006 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files Locator Record Last Revised: NA",
    "textAfterTable": "WTDRD1 - Dietary day one sample weight Variable Name: WTDRD1 SAS Label: Dietary day one sample weight English Text: Dietary day one sample weight Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 734.52517883 to 338460.18501 Range of Values 132151 132151 . Missing 0 132151 WTDR2D - Dietary two-day sample weight Variable Name: WTDR2D SAS Label: Dietary two-day sample weight English Text: Dietary two-day sample weight Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 790.46780496 to 358726.40791 Range of Values 132151 132151 . Missing 0 132151 DR2DRSTZ - Dietary recall status Variable Name: DR2DRSTZ SAS",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}