{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety and suny police so it's very secure and well maintained.",
            "I paid for a private institution before transferring here and the level of academic instruction is 10x better for 1/6th the price.",
            "Go out and meet new people, local town has attractions, and campus has activities everyday.",
            "Rated #1 in the suny system",
            "Look at all aspects of the college from the dorms to the weight room, the ins and outs of everything. Consider commuting to save money.",
            "A local suny college at an affordable price compared to private or out of state institutions. Respectable science department and professors offer a welcoming transition from college or high school instruction. Large enough that you don't know everyone, but small enough to meet and make new friends."
        ]
    ],
    "pageTitle": "College at Brockport, State University of New York Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/College-at-Brockport-State-University-of-New-York/reviews?_escaped_fragment_=/show/23440",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00322-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902913155,
    "recordOffset": 902856065,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28769=Brock-the-Port is the last celebration of Brockport pride in early May. This is the time to blow off some serious steam before finals and get free food, gifts, gags, and concert tickets with awesome attractions like local bands and glowing foam pits., 270527=© 2015, Cappex.com, LLC, 15033=The cost is definitely worth it. Brockport is one of the cheapest SUNY schools, but they are awesome. Most impressive is their food service that has been rated number 1 since 1994., 115851=Clubs and activities are abundant here. Brockport has a full workout area, tennis courts, racquetball courts, squash courts, basketball, an ice rink, and the SERC Project which should be completed in the Summer of 2012. The SERC project is yet another recreational facility that further expands what it already has., 135752=Brock-the-Port is an end of the year party in May with live concerts and food that student and the Brockport community celebrates., 26749=University Police is known to employ parking-ninjas to keep our campus and parking violators in line. See 3:40 at: http://www.youtube.com/watch?v=ub3LheUVj2M&feature=youtu.be. But besides that, its in your best interest to respect the police here and call on them when you need the slightest of help because they are friendly and great service men and women. All in all, I feel safe at home here., 195125=Other than the obnoxious drunks who trample around at 3:00 in the morning, dorm life is quaint. Anything negative only happens because of careless dorm-mates. Sometimes the R.A.s treat us like irresponsible high school students, but they're just looking out for the building as a whole, and most of us do act like that.}",
    "textBeforeTable": "12/29/2009 Reviewer is A current student here. 29 out of 31 people found this review useful. 1 of 61 Caitlin from Greenwich, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. College at Brockport, State University of New York Reviews College at Brockport, State University of New York › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Joanna from Tonawanda, NY 11/24/2010 Reviewer is A current student here. 9 out of 9 people found this review useful. 2 of 61 Categories Comments Great for these types of students outgoing. want to get involved. studying is a priority also. having a good time. Tips for prospective students Don't let snow and rain scare you away. Buy a pair of rain boots and you for sure will have a good time jumping in the puddles. The food is amazing also, ranked number 1 in the SUNY system. they also let you know which food is healthy and what is not by ranking it on their system of green yellow and red. the dorms get really warm in the winter you survive in shorts and t shirt in the dorms but bundle up when you go outside. go to everything you can they put on some good shows and late nights. Bang for the buck Free stuff everywhere you go almost. Whenever there is a school sponsored activity like free messages they give away",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}