{
    "relation": [
        [
            "",
            "Cinebench R11.5",
            "CPU Multi 64Bit",
            "CPU Single 64Bit"
        ],
        [
            "Wortmann Terra Mobile Pad 1160 Pro HD Graphics 4000, 3337U, 128 GB SATA SSD",
            "",
            "2.5",
            "1.09"
        ],
        [
            "Acer Aspire TimelineU M3-581PTG-53334G25Makk GeForce GT 730M, 3337U, TOSHIBA THNSNS256GMCP",
            "2%",
            "2.49 0%",
            "1.12 3%"
        ],
        [
            "Acer W700-53334G12as HD Graphics 4000, 3337U, Toshiba THNSNS128GMCP",
            "-7%",
            "2.18 -13%",
            "1.09 0%"
        ],
        [
            "Dell Inspiron 15-3521-0620 Radeon HD 8750M, 3337U, Seagate Momentus SpinPoint M8 ST1000LM024 HN-M101MBB",
            "-3%",
            "2.49 0%",
            "1.03 -6%"
        ],
        [
            "Dell XPS 13 L322X HD Graphics 4000, 3337U, Samsung SSD PM830 256 GByte mSATA",
            "-2%",
            "2.44 -2%",
            "1.08 -1%"
        ],
        [
            "Lenovo IdeaPad S500 Touch 59372927 GeForce GT 720M, 3337U, Seagate Momentus Thin ST500LT012-9WS142 + 24 GB LITEONIT LSS-24L6G SSD Cache",
            "-1%",
            "2.46 -2%",
            "1.09 0%"
        ]
    ],
    "pageTitle": "Test Wortmann Terra Mobile Pad 1160 Pro Tablet - Notebookcheck.com Tests",
    "title": "",
    "url": "http://www.notebookcheck.com/Test-Wortmann-Terra-Mobile-Pad-1160-Pro-Tablet.103119.0.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00153-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 618683523,
    "recordOffset": 618609766,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{67179=Nachdem Wortmanns Business Ultrabook uns nicht vom Hocker gehauen hatte, liegt jetzt eine neue Schöpfung des Herstellers vor uns. Wie auch das Terra 1450 II Ultrabook zielt das Terra Pad 1160 Pro unmissverständlich auf die Business-Kundschaft ab. Die Versprechungen sind gewagt: „Die optionale Tastatur verwandelt das PAD sekundenschnell in einen vollwertigen Arbeitsplatz für Ihre Windows 8 Professional Anwendungen.“ Technisch können wir uns das sehr gut vorstellen, denn ein Core i5 (Ivy Bridge) und eine schnelle SSD geben den Ton an., 63876=Das Terra Mobile Pad 1160 ist in erster Linie ein Tablet, das mit einem simplen, aber überzeugendem Tastatur-Dock in ein Klappformat konvertiert werden kann. Starke Magnete, ein flexibles Gelenk und eine elektrische Verbindung über Metallstifte sind die Elemente, die ein Subnotebook entstehen lassen. Einmal verbunden können wir das Gerät mit dem Keyboard-Case als Schutz bequem herumtragen oder verpacken. Die Verbindung geht nicht von selbst auf, hierfür wird deutliche Zugkraft benötigt., 53309=Mit Nortons Internet Security (Trial), MS Office (Trial) und MS Windows Essentials 2012 lässt Wortmann seine Kundschaft mit Softwareproben nicht ganz in Ruhe. Wortmann liefert sein 1160 Pro mit Windows 8 Pro 64 Bit aus (echter Datenträger). Windows 7 wird nicht angeboten. Das 1160 ohne Pro wird mit einem normalen Windows 8 ausgeliefert. Windows 7 wird zumindest in der normalen Serie nicht offeriert. Im Karton befinden sich neben dem Ladegerät (40 Watt) zwei Recovery DVDs (Windows/Treiber), ein Poliertuch sowie ein mehrsprachiges Handbuch. , 58691=Der WLAN-Adapter aus dem Hause Intel (Centrino Wireless-N 135) ist ein Einsteigermodell ohne 5-GHZ-Support (Dual Band). Bluetooth-Endgeräte können mit dem integrierten Modul angesprochen werden. Der WLAN-Reichweiten-Test mit der Infrastuktur des Autors versagte bei der 40-Meter-Funkstrecke, die 15-Meter-Verbindung außerhalb des Hauses hielt aber eine stabile Verbindung (WLAN-Surfen, 3 Balken der Windows Anzeige). Das eingebaute UMTS-/3G-Modem ist für geschäftliche Tablets fast schon Pflicht, da Nutzer eine separate Verbindung dem Smartphone Tethering immer noch vorziehen. Es handelt sich um ein HUAWEI MU736 mit assisted GPS und Standalone GPS Antenne. Damit kann das Pad 1160 unabhängig vom 3G Signal den Standort feststellen. Mit 3G geht es aber schneller., 28371=Der Intel Core i5 3337U (1,8 GHz) ist eine recht üppige Ausstattung für ein kleines Tablet. Wortmann bietet das Mobile Pad 1160 auch mit Intel Celeron (1,8 GHz, 64 GB SSD, kein 3G-Modem) an, was den Preis deutlich fallen lässt (knapp 500 Euro). Die 128 GB mSATA-SSD (Phison SSE128GTTC3-S90-4) bietet ein eher spartanisches Platzangebot. Bei Auslieferung sind nur zirka 81 GB frei. 4.096 MB Single-Channel-Arbeitsspeicher ergänzen das System. , 53547=Das Mobile Pad 1160 Pro besitzt keine businesstypischen Funktionen wie TPM-Modul, Fingerprint oder ein auf Sicherheit getrimmtes BIOS. Auch ein Kensington Lock fehlt., 37583=Der Kontrast von 755:1 ist für ein TN-Panel sehr gelungen. Der Nutzer profitiert davon durch ausreichend kräftige Farben und deutliche Konturen. Eine Profi-Anzeige entsteht allein dadurch aber noch nicht, dazu ist die sRGB-Abdeckung von 53 % viel zu gering. Mit dem Fotospektrometer haben wir die Anzeige im Auslieferungszustand vermessen. CalMAN zeigt einen deutlichen Blaustich bei den Graustufen. Dies setzt sich bei den Farben extrem fort, die meisten sind deutlich in blaue Bereiche verschoben. Die Konsequenz ist ein hoher DeltaE-Wert von 12. Durch eine Kalibrierung (z. B. X-Rite i1Pro 2) kann die Anzeige etwas vom überdeutlichen Blaustich befreit werden.}",
    "TableContextTimeStampAfterTable": "{225768=Nach einer langwährenden Ladezeit von vier Stunden (Gerät an) sorgt der WLAN-Test mit seinen 8:44 Stunden für eine Überraschung. So lange hielt nicht einmal das Dell XPS 12 ULT (7:44 h) durch. Die übrige Tablet- bzw. Convertible-Konkurrenz ist weit abgeschlagen: Aspire P3-171 (4:41 h), HP EliteBook Revolve 810 (5:15 h), Transformer Book TX300CA (5:42 h), Microsoft Surface Pro (4:45 h)., 236018=Was die Big Player auf dem Markt der Windows Tablets können, das kann ein vergleichsweise kleiner Anbieter wie Wortmann schon lange. Manchmal sogar besser, wie wir am Beispiel des Terra Mobile Pad 1160 Pro sehen. Wir hatten ein Windows Tablet im Test, das fast alle relevanten Kriterien erfüllt: wertige Verarbeitung, gute Eingabegeräte mit Type Cover, starke Laufzeiten und eine Performance auf Notebook-Niveau. Die Angst, gegenüber einem Subnotebook massiv an Anwendungsleistung zu verlieren, ist beim Terra Mobile Pad 1160 Pro unbegründet. Der Core i5 schlägt sich im Tablet-Gehäuse sehr gut., 199169=Den Stresstest absolviert das Terra Mobile Pad 1160 mit einem kleinen Leistungseinbruch. Wir lassen Prime95 (CPU-Stress) und Furmark (GPU-Stress) parallel für zwei Stunden laufen und beobachten die Taktungen. Die CPU pendelt sich schnell bei 1,8 GHz ein, was dem Standard-Takt entspricht. Der Turbo ist also nicht mehr aktiv, wohl aber bei der GPU mit 800 MHz (von 1.100 MHz). Sobald der CPU-Stress beendet wird (Furmark Solo), rappelt sich die HD 4000 auf und geht zurück auf 1.100 MHz. Der im Anschluss an den Stresstest ausgeführte 3DMark 2006 erzielte dasselbe Ergebnis wie bei einem Kaltstart., 5207=Was machen die PCMarks aus den guten Vorgaben des Prozessors? Die obigen Vergleichssysteme sind im PCMark 7 teilweise besser, denn sie profitieren von schnelleren SSDs (System Storage). Die HDD-basierten Geräte hängt das Wortmann Tablet im Total Score jedoch ab. Für PCMark 8 und Vantage liegen die Scores nur lückenhaft vor. Der Vergleich mit dem 15,6-Zoller IdeaPad S500 Touch zeigt jedoch auch in diesen Fällen den beachtlichen Vorsprung des Terra Mobile Pad 1160. Selbst die dedizierten GPUs der genannten Systeme vermögen es nicht, den Total Score deutlich zu heben.}",
    "lastModified": "Tue, 04 Aug 2015 08:12:12 GMT",
    "textBeforeTable": "17.6 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 310px; height: 16px; background: #8a0101; Eurocom Panther 5D (max)  E5-2697 v2, Quadro K5100M    ... 2.5 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 69.772727272727px; height: 16px; background: #8a0101; Lenovo IdeaPad Flex 14-59395501  4200U, HD Graphics 4400 2.5 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 69.772727272727px; height: 16px; background: #8a0101; Samsung 410B2B  2520M, HD Graphics 3000 2.5 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 69.772727272727px; height: 16px; background: #8a0101; Asus VivoBook S551LB-CJ026H  4500U, GeForce GT 740M 2.5 \"> font-weight:bold; border: 1px solid #550000; color: #ffffff; text-align: right; line-height: 16px; padding-bottom:auto; padding-top:auto; padding: 3px; margin: 1px; width: 69.772727272727px; height: 16px; background: #8a0101;  3337U, HD Graphics 4000 2.5 \"> font-weight:bold; border:",
    "textAfterTable": "System Performance PCMark 7 Scores Was machen die PCMarks aus den guten Vorgaben des Prozessors? Die obigen Vergleichssysteme sind im PCMark 7 teilweise besser, denn sie profitieren von schnelleren SSDs (System Storage). Die HDD-basierten Geräte hängt das Wortmann Tablet im Total Score jedoch ab. Für PCMark 8 und Vantage liegen die Scores nur lückenhaft vor. Der Vergleich mit dem 15,6-Zoller IdeaPad S500 Touch zeigt jedoch auch in diesen Fällen den beachtlichen Vorsprung des Terra Mobile Pad 1160. Selbst die dedizierten GPUs der genannten Systeme vermögen es nicht, den Total Score deutlich zu heben. Wie leistungsstark das Testsystem im Vergleich zu anderen Windows Tablets oder Convertibles ist, das zeigen wir unter dem Fazit des Tests in Form eines längeren Balkendiagrammes. Dort sehen wird deutlich, wie gut die Rechen- und die Storage-Leistung und mit der versammelten Konkurrenz mithalten kann. Wortmann Terra Mobile Pad 1160 Pro HD Graphics 4000, 3337U, 128 GB SATA SSD Acer Aspire TimelineU M3-581PTG-53334G25Makk GeForce GT 730M, 3337U, TOSHIBA THNSNS256GMCP",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}