{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very safe at night. If you feel a little discomfort there are many Safety towers along the campus where your press a button and talk to an officer to drive over and walk with you to your dorm. The occasional skunk around campus is a little alarming but other than that it is just fine.",
            "There is no greek life but we have a volunteer fraternity which has initiation and all that good stuff.",
            "Get involved!!!!! There are many students who are not involved in community service, athletics, or even a job or club on campus. Graduate schools and employers want you to succeed in the workplace by being socially engaged. I played soccer this year and basketball season for me just started. I am also in the Spanish Club, Health Professional Students Club, and Black Student Union. Although I have these things I also have a work-study job. You must be involved in order to succeed in college, or else you will get bored. The only thing I wish we had was a pep club to attend all home sporting events because the turnout for many of the sports teams games is bad considering we have many undergraduate students.",
            "Hardworking, culturally diverse, disciplined, passionate, and lovely students.",
            "We have frolic before final exams which is kind of a big party where they make breakfast for dinner and everyone unwinds before finals.",
            "I wish more merit aid was given because a lot of students, including myself can not afford to pay a good chunk of change out of pocket a month. If you do well in school, you have greater chances of getting a better scholarship. Other than that the fin aid of is more than accommodating to help you whether it be searching for scholarships or even filling out a loan.",
            "The college has weekend palooza which is an assortment of activities done on the weekends. SAB (Student Activities Board) makes a lot of activities which they provide the transportation for. Excursions like Mall and a Movie (for a great price), Renaissance Festival, Broadway show in NYC, and more. The Athletics Department also includes the home games of sports teams. Some clubs include movies in the multicultural center, rock-climbing, bingo nights, and even shopping in the Promenade shops. The Spanish club most recently did a Salsa Night which included salsa dance lessons and hispanic food.",
            "The food in the cafeteria isn't some great somedays. Other days, it can be really good. We had a Vietnam food day, Indian food day, Italian food day, and German food day so far for the diversity factor of the college. The falcons nest has wraps and sandwiches and burgers and fries. But it can be a bit annoying on the weekends when only the falcons nest is open and all you can really order is fried food when they have put away the sandwich station or buffet station.",
            "I love my dorm! I live in Moore Hall. It is specifically designed for freshmen but you can live anywhere on campus. Upperclassmen live in Moore too. My RA is great. We have monthly dorm activities. In october they had decorate your own cupcakes night and pamper yourself night. We also had a build our own sundae night. The only thing I can say I don't like about Moore is that people can tend to be REALLY loud on the weekends if your trying to study in your room. I also hate that I am on the 3rd floor but hey, its good exercise.",
            "Honestly I think some of my classes are really hard but don't let that get to you. My Biology 121 class is the hardest out of all my classes (I am pre-med). We had a teacher at the beginning of the year but he retired so we have an even more rigorous professor now. What you put in is what you get back. In other words, if you work hard- you will get A's and B's and maybe high C's. If you don't go to class and play around- you will get D's and F's. I could do a lot better. My GPA right now is a 3.3 but I have a little time to get it up with Final Exam grades. Work hard when you are here.",
            "We have a First Year Seminar. I personally think it isn't that great but it actually ties in with your Writing class you take as a Freshman. Transfers are welcomed with open arms. The school has many opportunities for research and real world experience. We actually have a department of community service which is required to graduate when you take ethical life. The community service department has activities and excursions every week by the bucket loads. Make sure you do well in school and do exceptional on your standardized tests in order to get in. If not, make a killer essay. Our nursing, science, and social work departments are where most majors come from. Our nursing department has a very good reputation in PA. Many science majors go on to get Ph.D's and work in labs or even become physicians. Social work places a lot of people in field work their senior year. You get a lot of opportunities here.",
            "The atmosphere is academically enriching. The academics carry great internship and research opportunities. Cedar Crest is for the hardworking and disciplined."
        ]
    ],
    "pageTitle": "Cedar Crest College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cedar-Crest-College/reviews?_escaped_fragment_=/show/52928",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901301799,
    "recordOffset": 901264509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{135462=Make sure you know what the program is that you're enrolling in. For example, if you are going into the nutrition program, know that it is a night program. All classes will be at night, often until 9:30 p.m. If you don't like having class at 9:30 at night, don't enroll in this program. Another example: If you are going into the nursing program, understand that you are not actually a nursing major yet. After your sophomore year, you must take the TEAS test. If you score well and did well in your pre-requisite classes, you may be accepted into the actual nursing program. Not every student who applied to Cedar Crest for nursing and is accepted to the college is actually accepted into the nursing program., 112566=I love my dorm! I live in Moore Hall. It is specifically designed for freshmen but you can live anywhere on campus. Upperclassmen live in Moore too. My RA is great. We have monthly dorm activities. In october they had decorate your own cupcakes night and pamper yourself night. We also had a build our own sundae night. The only thing I can say I don't like about Moore is that people can tend to be REALLY loud on the weekends if your trying to study in your room. I also hate that I am on the 3rd floor but hey, its good exercise., 138936=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/16/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 30 Jessica from Dover, DE Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Login to rate or flag the reviews Tasha from Bethlehem, PA 04/01/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 30 Categories Comments Campus Safety Campus Police patrol regularly. What to do for fun There are many attractions nearby including Dorney Park, Cedar Crest's own Da Vinci Science Center, movie theaters, and on campus activities such as Zumba. Tips for prospective students Be prepared to take responsibility for your experience, and make the most of it! Expect rigorous coursework that will prepare you for your career. In three sentences Cedar Crest College is a leader in educating its nursing students. They teach students a global perspective to successfully prepare them for their career. They excel academic expectations. Login to rate or flag the reviews Jasmine from Landenberg, PA",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}