{
    "relation": [
        [
            "",
            "Disclosure Material",
            "Loan Agreement",
            "Report, Opinion or Appraisal",
            "Contracts, Arrangements or Understandings",
            "Statement re: Appraisal Rights",
            "Oral Solicitation Materials",
            "Tax Opinion"
        ],
        [
            "13E-3",
            "X",
            "X",
            "X",
            "X",
            "X",
            "X",
            ""
        ],
        [
            "TO",
            "X",
            "X",
            "",
            "X",
            "",
            "X",
            "X"
        ],
        [
            "14D-9",
            "X",
            "",
            "",
            "X",
            "",
            "X",
            ""
        ]
    ],
    "pageTitle": "eCFR — Code of Federal Regulations",
    "title": "",
    "url": "http://www.ecfr.gov/cgi-bin/text-idx?node=17:3.0.1.1.11&rgn=div5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00195-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421694595,
    "recordOffset": 421480885,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{736120=(A) A large accelerated filer (§240.12b-2 of this chapter) that had an aggregate worldwide market value of the voting and non-voting common equity held by non-affiliates of more than $5 billion as of the last business day of the second fiscal quarter of its most recently completed fiscal year that prepares its financial statements in accordance with generally accepted accounting principles as used in the United States and the filing contains financial statements of the registrant for a fiscal period that ends on or after June 15, 2009;, 92225=(i) The total number of violations of mandatory health or safety standards that could significantly and substantially contribute to the cause and effect of a coal or other mine safety or health hazard under section 104 of the Federal Mine Safety and Health Act of 1977 (30 U.S.C. 814) for which the operator received a citation from the Mine Safety and Health Administration., 734601=(i) Required to be submitted and posted. Required to be submitted to the Commission and posted on the registrant's corporate Web site, if any, in the manner provided by Rule 405 of Regulation S-T (§232.405 of this chapter) if the registrant does not prepare its financial statements in accordance with Article 6 of Regulation S-X (17 CFR 210.6-01 et seq.) and is described in paragraph (b)(101)(i)(A), (B) or (C) of this Item, except that an Interactive Data File: first is required for a periodic report on Form 10-Q (§249.308a of this chapter), Form 20-F (§249.220f of this chapter) or Form 40-F (§249.240f of this chapter), as applicable; is required for a registration statement under the Securities Act only if the registration statement contains a price or price range; and is required for a Form 8-K (§249.308 of this chapter) only when the Form 8-K contains audited annual financial statements that are a revised version of financial statements that previously were filed with the Commission that have been revised pursuant to applicable accounting standards to reflect the effects of certain subsequent events, including a discontinued operation, a change in reportable segments or a change in accounting principle, and, in such case, the Interactive Data File would be required only as to such revised financial statements regardless whether the Form 8-K contains other financial statements:, 866249=(b) Factors considered in determining fairness. Discuss in reasonable detail the material factors upon which the belief stated in paragraph (a) of this section is based and, to the extent practicable, the weight assigned to each factor. The discussion must include an analysis of the extent, if any, to which the filing person's beliefs are based on the factors described in Instruction 2 of this section, paragraphs (c), (d) and (e) of this section and Item 1015 of Regulation M-A (§229.1015)., 1022985=(b) During a prefunding or revolving period, or if there has been a new issuance of asset-backed securities backed by the same pool under a master trust during the fiscal year of the issuing entity, provide the information required by Items 1110, 1111 and 1112 of this Regulation AB applied taking the revised pool composition into account in the Form 10-D report (§249.312 of this chapter) for the last required distribution of the fiscal year of the issuing entity. In addition, provide such updated information in the first Form 10-D report for the period in which the prefunding or revolving period ends (if applicable). However, no disclosure need be provided by this paragraph if the information has not materially changed from that previously provided in an Exchange Act report relating to the asset-backed securities or in an effective registration statement under the Securities Act or a prospectus timely filed pursuant to §230.424 of this chapter under the same Central Index Key (CIK) code regarding a subsequent issuance of asset-backed securities backed by a pool of assets that includes the pool assets that are the subject of this paragraph., 139846=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 54768, Dec. 6, 1982; 51 FR 42056, Nov. 20, 1986; 70 FR 1593, Jan. 7, 2005], 135998=B. In the case of debt, the rate of interest; the date of maturity or, if the issue matures serially, a brief indication of the serial maturities, such as “maturing serially from 1955 to 1960”; if the payment of principal or interest is contingent, an appropriate indication of such contingency; a brief indication of the priority of the issue; and, if convertible or callable, a statement to that effect; or, 149561=2. This paragraph, together with §210.4-10 of Regulation S-X, prescribes financial reporting standards for the preparation of accounts by persons engaged, in whole or in part, in the production of crude oil or natural gas in the United States, pursuant to Section 503 of the Energy Policy and Conservation Act of 1975 (42 U.S.C. 8383) (“EPCA”) and Section 11(c) of the Energy Supply and Environmental Coordination Act of 1974 (15 U.S.C. 796) (“ESECA”) as amended by Section 506 of EPCA. The application of the paragraph to those oil and gas producing operations of companies regulated for ratemaking purposes on an individual-company-cost-of-service basis may, however, give appropriate recognition to differences arising because of the effect of the ratemaking process., 920143=(1) Identify the participants in the transaction, including the sponsor, depositor, issuing entity, trustee and servicers contemplated by Item 1108(a)(2) of this Regulation AB, and their respective roles. Describe the roles briefly if they are not apparent from the title of the role. Identify any originator contemplated by Item 1110 of this Regulation AB and any significant obligor., 899600=(4) Static pool data, as referenced in Item 1105 of this Regulation AB, such as for the sponsor's and/or servicer's portfolio, prior transactions or the asset pool itself;, 851175=Instruction to Item 1009(b): Provide all information required by this Item except for the information required by paragraph (a) of this section and Item 1007 of Regulation M-A (§229.1007)., 889551=(D) If the pool assets relating to the third party are guaranteed by a wholly owned subsidiary of the third party and the subsidiary does not meet the conditions of paragraph (c)(2)(ii)(A) or (c)(2)(ii)(B) of this section, the criteria in either paragraph (c)(2)(ii)(A) or paragraph (c)(2)(ii)(B) of this section are met with respect to the third party and the requirements of Rule 3-10 of Regulation S-X (§210.3-10 of this chapter) are satisfied regarding the information in the reports to be referenced., 819163=The following definitions apply to the terms used in Regulation M-A (§§229.1000 through 229.1016), unless specified otherwise:, 198216=[53 FR 12929, Apr. 20, 1988, as amended at 54 FR 9774, Mar. 8, 1989], 169043=7. Any forward-looking information supplied is expressly covered by the safe harbor rule for projections. See Rule 175 under the Securities Act [17 CFR 230.175], Rule 3b-6 under the Exchange Act [17 CFR 240.3b-6] and Securities Act Release No. 6084 (June 25, 1979) (44 FR 38810)., 286000=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 55665, Dec. 13, 1982; 48 FR 19874, May 3, 1983; 49 FR 32763, Aug. 16, 1984; 52 FR 48982, Dec. 29, 1987; 59 FR 52695, Oct. 19, 1994; 70 FR 1594, Jan. 7, 2005; 71 FR 53241, Sept. 8, 2006; 73 FR 958, Jan. 4, 2008; 74 FR 68362, Dec. 23, 2009], 1040696=Instruction 3 to Item 1122. If multiple parties are participating in the servicing function, a separate assessment report and attestation report must be included for each party participating in the servicing function. A party participating in the servicing function means any entity (e.g., master servicer, primary servicers, trustees) that is performing activities that address the criteria in paragraph (d) of this section, unless such entity's activities relate only to 5% or less of the pool assets., 232932=General instructions to paragraphs 305(a), 305(b), 305(c), 305(d), and 305(e): 1. Bank registrants, thrift registrants, and non-bank and non-thrift registrants with market capitalizations on January 28, 1997 in excess of $2.5 billion should provide Item 305 disclosures in filings with the Commission that include annual financial statements for fiscal years ending after June 15, 1997. Non-bank and non-thrift registrants with market capitalizations on January 28, 1997 of $2.5 billion or less should provide Item 305 disclosures in filings with the Commission that include financial statements for fiscal years ending after June 15, 1998., 1041782=[70 FR 1597, Jan. 7, 2005, as amended at 79 FR 57316, Sept. 24, 2014], 141539=2.  Subject to appropriate variation to conform to the nature of the registrant's business, the following items shall be included in the table of financial data: net sales or operating revenues; income (loss) from continuing operations; income (loss) from continuing operations per common share; total assets; long-term obligations and redeemable preferred stock (including long-term debt, capital leases, and redeemable preferred stock as defined in §210.5-02.27(a) of Regulation S-X [17 CFR 210]; and cash dividends declared per common share. Registrants may include additional items which they believe would enhance an understanding of and would highlight other trends in their financial condition and results of operations., 39562=(d) Incorporation by Reference. Where rules, regulations, or instructions to forms of the Commission permit incorporation by reference, a document may be so incorporated by reference to the specific document and to the prior filing or submission in which such document was physically filed or submitted. Except where a registrant or issuer is expressly required to incorporate a document or documents by reference (or for purposes of Item 1100(c) of Regulation AB (§229.1100(c)) with respect to an asset-backed issuer, as that term is defined in Item 1101 of Regulation AB (§229.1101)), reference may not be made to any document which incorporates another document by reference if the pertinent portion of the document containing the information or financial statements to be incorporated by reference includes an incorporation by reference to another document. No document on file with the Commission for more than five years may be incorporated by reference except:, 896376=(f) Filing of required exhibits. Where agreements or other documents in this Regulation AB (§§229.1100 through 229.1125) are specified to be filed as exhibits to a Securities Act registration statement, such agreements or other documents, if applicable, may be incorporated by reference as an exhibit to the registration statement, such as by filing a Form 8-K (§249.308 of this chapter) in the case of offerings registered on Form SF-3 (§239.45 of this chapter). Final agreements must be filed and made part of the registration statement no later than the date the final prospectus is required to be filed under §230.424 of this chapter., 96167=(1) The term coal or other mine means a coal or other mine, as defined in section 3 of the Federal Mine Safety and Health Act of 1977 (30 U.S.C. 802), that is subject to the provisions of such Act (30 U.S.C. 801 et seq.)., 627385=(2) For the purpose of determining any liability under the Securities Act of 1933, each post-effective amendment that contains a form of prospectus shall be deemed to be a new registration statement relating to the securities offered therein, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof., 763821=(vi) A transaction in which all of the investors' partnership securities are reported under a transaction reporting plan declared effective before December 17, 1993 by the Commission under Section 11A of the Securities Exchange Act of 1934 (15 U.S.C. 78k-1) and such investors receive new securities or securities in another entity that are reported under a transaction reporting plan declared effective before December 17, 1993 by the Commission under Section 11A of the Securities Exchange Act of 1934 (15 U.S.C. 78k-1), except that, for purposes of this paragraph, securities that are reported under a transaction reporting plan declared effective before December 17, 1993 by the Commission under Section 11A of the Securities Exchange Act of 1934 shall not include securities listed on the American Stock Exchange's Emerging Company Marketplace;, 980070=(4) A registrant may provide additional explanatory disclosure related to an Asset Data File by filing an asset related document as an exhibit to Form ABS-EE (§249.1401 of this chapter) in accordance with Item 601(b)(103) of Regulation S-K (§229.601(b)(103))., 56408=[47 FR 11401, Mar. 16, 1982, as amended at 52 FR 21260, June 5, 1987; 58 FR 14665, Mar. 18, 1993; 58 FR 62029, Nov. 23, 1993; 60 FR 32824, June 23, 1995; 64 FR 61443, Nov. 10, 1999; 68 FR 4831, Jan. 30, 2003; 70 FR 1593, Jan. 7, 2005; 73 FR 956, Jan. 4, 2008; 76 FR 46617, Aug. 3, 2011], 942080=(j) If expenses incurred in connection with the selection and acquisition of the pool assets are to be payable from offering proceeds, disclose the amount of such expenses. If such expenses are to be paid to the sponsor, servicer contemplated by Item 1108(a)(2) of this Regulation AB, depositor, issuing entity, originator contemplated by Item 1110 of this Regulation AB, underwriter, or any affiliate of the foregoing, separately identify the type and amount of expenses paid to each such party., 597339=[47 FR 11401, Mar. 16, 1982, as amended at 58 FR 19606, Apr. 15, 1993; 62 FR 543, Jan. 3, 1997; 62 FR 11323, Mar. 12, 1997; 63 FR 6384, Feb. 6, 1998], 737031=(C) A filer not specified in paragraph (b)(101)(i)(A) or (B) of this Item that prepares its financial statements in accordance with either generally accepted accounting principles as used in the United States or International Financial Reporting Standards as issued by the International Accounting Standards Board, and the filing contains financial statements of the registrant for a fiscal period that ends on or after June 15, 2011., 693971=(B) A cross-reference sheet showing the location in the indenture of the provisions inserted pursuant to sections 310 through 318(a) inclusive of the Trust Indenture Act of 1939., 727005=(32) Section 1350 Certifications. (i) The certifications required by Rule 13a-14(b) (17 CFR 240.13a-14(b)) or Rule 15d-14(b) (17 CFR 240.15d-14(b)) and Section 1350 of Chapter 63 of Title 18 of the United States Code (18 U.S.C. 1350)., 263219=[62 FR 6064, Feb. 10, 1997, as amended at 73 FR 958, Jan. 4, 2008; 74 FR 18617, Apr. 23, 2009; 76 FR 50121, Aug. 12, 2011], 131642=(9) If debt securities are to be offered at a price such that they will be deemed to be offered at an “original issue discount” as defined in paragraph (a) of section 1273 of the Internal Revenue Code (26 U.S.C. 1273), or if a debt security is sold in a package with another security and the allocation of the offering price between the two securities may have the effect of offering the debt security at such an original issue discount, the tax effects thereof pursuant to sections 1271-1278;, 600072=2. Accountants, providing a report on the financial statements, presented or incorporated by reference in the registration statement, should note §210.2-01 of Regulation S-X (17 CFR 210) for the Commission's requirements regarding “Qualification of Accountants” which discusses disqualifying interests., 25803=Authority: 15 U.S.C. 77e, 77f, 77g, 77h, 77j, 77k, 77s, 77z-2, 77z-3, 77aa(25), 77aa(26), 77ddd, 77eee, 77ggg, 77hhh, 77iii, 77jjj, 77nnn, 77sss, 78c, 78i, 78j, 78j-3, 78l, 78m, 78n, 78n-1, 78o, 78u-5, 78w, 78ll, 78mm, 80a-8, 80a-9, 80a-20, 80a-29, 80a-30, 80a-31(c), 80a-37, 80a-38(a), 80a-39, 80b-11, and 7201 et seq.; and 18 U.S.C. 1350, unless otherwise noted., 626934=(1) For purposes of determining any liability under the Securities Act of 1933, the information omitted from the form of prospectus filed as part of this registration statement in reliance upon Rule 430A and contained in a form of prospectus filed by the registrant pursuant to Rule 424(b) (1) or (4) or 497(h) under the Securities Act shall be deemed to be part of this registration statement as of the time it was declared effective., 1014236=(3) Originator contemplated by Item 1110 of this Regulation AB., 1001648=Instruction 1 to Item 1114(b). The requirements in paragraph (b) of this section apply to all providers of external credit enhancement or other support, other than those described in Item 1115 of this Regulation AB. Enhancement may support payment on the pool assets or payments on the asset-backed securities themselves., 231190=(d) Safe harbor. (1) The safe harbor provided in Section 27A of the Securities Act of 1933 (15 U.S.C. 77z-2) and Section 21E of the Securities Exchange Act of 1934 (15 U.S.C. 78u-5) (“statutory safe harbors”) shall apply, with respect to all types of issuers and transactions, to information provided pursuant to paragraphs (a), (b), and (c) of this Item 305, provided that the disclosure is made by: an issuer; a person acting on behalf of the issuer; an outside reviewer retained by the issuer making a statement on behalf of the issuer; or an underwriter, with respect to information provided by the issuer or information derived from information provided by the issuer., 26359=Source: 47 FR 11401, Mar. 16, 1982, unless otherwise noted., 831282=Instruction to Item 1004(a): If the consideration offered includes securities exempt from registration under the Securities Act of 1933, provide a description of the securities that complies with Item 202 of Regulation S-K (§229.202). This description is not required if the issuer of the securities meets the requirements of General Instructions I.A, I.B.1 or I.B.2, as applicable, or I.C. of Form S-3 (§239.13 of this chapter) and elects to furnish information by incorporation by reference; only capital stock is to be issued; and securities of the same class are registered under section 12 of the Exchange Act and either are listed for trading or admitted to unlisted trading privileges on a national securities exchange; or are securities for which bid and offer quotations are reported in an automated quotations system operated by a national securities association., 625516=Insofar as indemnification for liabilities arising under the Securities Act of 1933 may be permitted to directors, officers and controlling persons of the registrant pursuant to the foregoing provisions, or otherwise, the registrant has been advised that in the opinion of the Securities and Exchange Commission such indemnification is against public policy as expressed in the Act and is, therefore, unenforceable. In the event that a claim for indemnification against such liabilities (other than the payment by the registrant of expenses incurred or paid by a director, officer or controlling person of the registrant in the successful defense of any action, suit or proceeding) is asserted by such director, officer or controlling person in connection with the securities being registered, the registrant will, unless in the opinion of its counsel the matter has been settled by controlling precedent, submit to a court of appropriate jurisdiction the question whether such indemnification by it is against public policy as expressed in the Act and will be governed by the final adjudication of such issue., 1041254=Instruction 4 to Item 1122. If the asset pool backing the asset-backed securities includes a pool asset representing an interest in or the right to the payments or cash flows of another asset pool and both the issuing entity for the asset-backed securities and the entity issuing the asset to be included in the issuing entity's asset pool were established under the direction of the same sponsor and depositor, see also Item 1100(d)(2) of this Regulation AB., 981237=[70 FR 1597, Jan. 7, 2005, as amended at 76 FR 4243, Jan. 25, 2011; 79 FR 57315, Sept. 24, 2014], 748762=[47 FR 11401, Mar. 16, 1982, as amended at 61 FR 54508, Oct. 18, 1996; 62 FR 39762, July 24, 1997; 70 FR 1597, Jan. 7, 2005; 73 FR 967, Jan. 4, 2008], 888975=(C) If the third party does not meet the conditions of paragraph (c)(2)(ii)(A) or (c)(2)(ii)(B) of this section and the pool assets relating to the third party are fully and unconditionally guaranteed by a direct or indirect parent of the third party, General Instruction I.C.3 of Form S-3 or General Instruction I.A.5(iii) of Form F-3 is met with respect to the pool assets relating to such third party and the requirements of Rule 3-10 of Regulation S-X (§210.3-10 of this chapter) are satisfied regarding the information in the reports to be referenced., 145230=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 54768, Dec. 6, 1982; 52 FR 30919, Aug. 18, 1987; 73 FR 958, Jan. 4, 2008; 74 FR 18617, Apr. 23, 2009], 733623=(100) XBRL-Related Documents. Only an electronic filer that prepares its financial statements in accordance with Article 6 of Regulation S-X (17 CFR 210.6-01 et seq.) is permitted to participate in the voluntary XBRL (eXtensible Business Reporting Language) program and, as a result, may submit XBRL-Related Documents (§232.11 of this chapter) in electronic format as an exhibit to: the filing to which they relate; an amendment to such filing; or a Form 8-K (§249.308 of this chapter) that references such filing, if the Form 8-K is submitted no earlier than the date of filing. Rule 401 of Regulation S-T (§232.401 of this chapter) sets forth further details regarding eligibility to participate in the voluntary XBRL program., 97614=[76 FR 81782, Dec. 28, 2011], 982669=(2) If pool assets relating to a significant obligor represent 20% or more of the asset pool, provide financial statements meeting the requirements of Regulation S-X (§§210.1-01 through 210.12-29 of this chapter), except §210.3-05 of this chapter and Article 11 of Regulation S-X (§§210.11-01 through 210.11-03 of this chapter), of the significant obligor. Financial statements of such obligor and its subsidiaries consolidated (as required by §240.14a-3(b) of this chapter) shall be filed under this item., 497852=[71 FR 53252, Sept. 8, 2006, as amended at 73 FR 964, Jan. 4, 2008], 566767=Instruction to Item 501: For asset-backed securities, see also Item 1102 of Regulation AB (§229.1102)., 43454=(D) Present non-GAAP financial measures on the face of any pro forma financial information required to be disclosed by Article 11 of Regulation S-X (17 CFR 210.11-01 through 210.11-03); or, 731840=(1) The term coal or other mine means a coal or other mine, as defined in section 3 of the Federal Mine Safety and Health Act of 1977 (30 U.S.C. 802), that is subject to the provisions of such Act (30 U.S.C. 801 et seq)., 235529=D. For purposes of instruction 1. of the General Instructions to Paragraphs 305(a), 305(b), 305(c), 305(d) and 305(e), market capitalization is the aggregate market value of common equity as set forth in General Instruction I.B.1. of Form S-3; provided however, that common equity held by affiliates is included in the calculation of market capitalization; and provided further that instead of using the 60 day period prior to filing referenced in General Instruction I.B.1. of Form S-3, the measurement date is January 28, 1997., 894285=(e) Foreign asset-backed securities. If the asset-backed securities are issued by a foreign issuer (as defined in §230.405 of this chapter), backed by pool assets that are foreign assets, or affected by enhancement or support contemplated by Items 1114 or 1115 of this Regulation AB provided by a foreign entity, then in providing the disclosure required by this Regulation AB (including, but not limited to, Items 1104 and 1110 of this Regulation AB regarding origination and securitization practices, Item 1107 of this Regulation AB regarding the sale or transfer of the pool assets, bankruptcy remoteness and collateral protection, Item 1108 of this Regulation AB regarding servicing, Item 1109 of this Regulation AB regarding the rights, duties and responsibilities of the trustee, Item 1111 of this Regulation AB regarding the terms, nature and treatment of the pool assets and Items 1114 or 1115 of this Regulation AB, as applicable, regarding the enhancement provider), the filing must describe any pertinent governmental, legal or regulatory or administrative matters and any pertinent tax matters, exchange controls, currency restrictions or other economic, fiscal, monetary or potential factors in the applicable home jurisdiction that could materially affect payments on, the performance of, or other matters relating to, the assets contained in the pool or the asset-backed securities. See also Instruction 2 to Item 202 of Regulation S-K (§229.202). In addition, in a registration statement under the Securities Act, provide the information required by Item 101(g) of Regulation S-K (§229.101(g)). Disclosure also is required in Forms 10-D (§249.312 of this chapter) and 10-K (§249.310 of this chapter) with respect to the asset-backed securities regarding any material impact caused by foreign legal and regulatory developments during the period covered by the report which have not been previously described in a Form 10-D, 10-K or 8-K (§249.308 of this chapter) filed under the Exchange Act., 936540=(1) With respect to information regarding prior securitized pools of the sponsor that do not include the currently offered pool, information regarding prior securitized pools that were established before January 1, 2006; and, 498276=Every registrant having a class of equity securities registered pursuant to section 12 of the Exchange Act (15 U.S.C. 78l) and every closed-end investment company registered under the Investment Company Act of 1940 (15 U.S.C. 80a-1 et seq.) shall:, 875347=(c) Any report, opinion or appraisal referred to in response to Item 1014(d) or Item 1015 of Regulation M-A (§229.1014(d) or §229.1015);, 1020542=(7) Any amounts drawn on any credit enhancement or other support identified in Item 1114 of this Regulation AB, as applicable, and the amount of coverage remaining under any such enhancement, if known and applicable., 897538=The following definitions apply to the terms used in Regulation AB (§§229.1100 through 229.1123), unless specified otherwise:, 604643=1Paragraph (a) reflects proposals made in Securities Act Release No. 6334 (Aug. 6, 1981)., 144367=6. A foreign private issuer shall present the selected financial data in the same currency as its financial statements. The issuer may present the selected financial data on the basis of the accounting principles used in its primary financial statements but in such case shall present this data also on the basis of any reconciliations of such data to United States generally accepted accounting principles and Regulation S-X made pursuant to Rule 4-01 of Regulation S-X (§210.4-01 of this chapter)., 766571=[56 FR 57247, Nov. 8, 1991, as amended at 59 FR 63682, Dec. 8, 1994], 8407=e-CFR data is current as of August 3, 2015, 626667=(i) Include the following in a registration statement permitted by Rule 430A under the Securities Act of 1933 (§230.430A of this chapter):, 892093=(b) Contains the information required by Instruction 3.a. of Item 1112 of this Regulation AB., 846650=(a) Securities ownership. State the aggregate number and percentage of subject securities that are beneficially owned by each person named in response to Item 1003 of Regulation M-A (§229.1003) and by each associate and majority-owned subsidiary of those persons. Give the name and address of any associate or subsidiary., 944167=[70 FR 1597, Jan. 7, 2005, as amended at 71 FR 53259, Sept. 8, 2006], 893757=Instruction to Item 1100(d)(2). Reference to the underlying asset pool includes, without limitation, compliance with applicable servicing criteria referenced in §§240.13a-18 and 240.15d-18 of this chapter and the servicer compliance statement required by Item 1123 of this Regulation AB. In addition, provide clear and concise disclosure, including by flow chart or other illustration, of the transaction and the various parties involved., 606346=(A) Paragraphs (a)(1)(i) and (a)(1)(ii) of this section do not apply if the registration statement is on Form S-8 (§239.16b of this chapter), and the information required to be included in a post-effective amendment by those paragraphs is contained in reports filed with or furnished to the Commission by the registrant pursuant to section 13 or section 15(d) of the Securities Exchange Act of 1934 (15 U.S.C. 78m or 78o(d)) that are incorporated by reference in the registration statement; and, 860080=[64 FR 61443, Nov. 10, 1999, as amended at 76 FR 6044, Feb. 2, 2011], 809283=[56 FR 57247, Nov. 8, 1991, as amended at 59 FR 63683, Dec. 8, 1994], 617515=The undersigned registrant hereby undertakes that, for purposes of determining any liability under the Securities Act of 1933, each filing of the registrant's annual report pursuant to section 13(a) or section 15(d) of the Securities Exchange Act of 1934 (and, where applicable, each filing of an employee benefit plan's annual report pursuant to section 15(d) of the Securities Exchange Act of 1934) that is incorporated by reference in the registration statement shall be deemed to be a new registration statement relating to the securities offered therein, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof., 736681=(B) A large accelerated filer not specified in paragraph (b)(101)(i)(A) of this Item that prepares its financial statements in accordance with generally accepted accounting principles as used in the United States and the filing contains financial statements of the registrant for a fiscal period that ends on or after June 15, 2010; or, 715637=(25) Statement of eligibility of trustee. (i) A statement of eligibility and qualification of each person designated to act as trustee under an indenture to be qualified under the Trust Indenture Act of 1939. Such statement of eligibility shall be bound separately from the other exhibits., 609876=(5) That, for the purpose of determining liability under the Securities Act of 1933 to any purchaser:, 918549=(h) Briefly describe any credit enhancement or other support for the transaction and identify any enhancement or support provider referenced in Items 1114(b) or 1115 of this Regulation AB., 527594=(D) Based on the review and discussions referred to in paragraphs (d)(3)(i)(A) through (d)(3)(i)(C) of this Item, the audit committee recommended to the board of directors that the audited financial statements be included in the company's annual report on Form 10-K (17 CFR 249.310) (or, for closed-end investment companies registered under the Investment Company Act of 1940 (15 U.S.C. 80a-1 et seq.), the annual report to shareholders required by section 30(e) of the Investment Company Act of 1940 (15 U.S.C. 80a-29(e)) and Rule 30d-1 (17 CFR 270.30d-1) thereunder) for the last fiscal year for filing with the Commission., 175383=(2) Material changes in results of operations. Discuss any material changes in the registrant's results of operations with respect to the most recent fiscal year-to-date period for which an income statement is provided and the corresponding year-to-date period of the preceding fiscal year. If the registrant is required to or has elected to provide an income statement for the most recent fiscal quarter, such discussion also shall cover material changes with respect to that fiscal quarter and the corresponding fiscal quarter in the preceding fiscal year. In addition, if the registrant has elected to provide an income statement for the twelve-month period ended as of the date of the most recent interim balance sheet provided, the discussion also shall cover material changes with respect to that twelve-month period and the twelve-month period ended as of the corresponding interim balance sheet date of the preceding fiscal year. Notwithstanding the above, if for purposes of a registration statement a registrant subject to paragraph (b) of §210.3-03 of Regulation S-X provides a statement of income for the twelve-month period ended as of the date of the most recent interim balance sheet provided in lieu of the interim income statements otherwise required, the discussion of material changes in that twelve-month period will be in respect to the preceding fiscal year rather than the corresponding preceding period., 879728=Source: 70 FR 1597, Jan. 7, 2005, unless otherwise noted., 951562=[70 FR 1597, Jan. 7, 2005, as amended at 79 FR 57314, Sept. 24, 2014], 984617=3. If the significant obligor is a foreign business (as defined §210.1-02 of this chapter):, 606860=(B) Paragraphs (a)(1)(i), (a)(1)(ii) and (a)(1)(iii) of this section do not apply if the registration statement is on Form S-3 (§239.13 of this chapter), Form SF-3 (§239.45 of this chapter) or Form F-3 (§239.33 of this chapter) and the information required to be included in a post-effective amendment by those paragraphs is contained in reports filed with or furnished to the Commission by the registrant pursuant to section 13 or section 15(d) of the Securities Exchange Act of 1934 that are incorporated by reference in the registration statement, or is contained in a form of prospectus filed pursuant to Rule 424(b) (§230.424(b) of this chapter) that is part of the registration statement., 869071=(vii) Any report, opinion, or appraisal described in Item 1015 of Regulation M-A (§229.1015); and, 627768=(j) Qualification of trust indentures under the Trust Indenture Act of 1939 for delayed offerings. Include the following if the registrant intends to rely on section 305(b)(2) of the Trust Indenture Act of 1939 for determining the eligibility of the trustee under indentures for securities to be issued, offered, or sold on a delayed basis by or on behalf of the registrant:, 876756=Exhibit Table to Item 1016 of Regulation M-A, 623462=(2) The registrant undertakes that every prospectus (i) that is filed pursuant to paragraph (h)(1) immediately preceding, or (ii) that purports to meet the requirements of section 10(a)(3) of the Act and is used in connection with an offering of securities subject to Rule 415 (§230.415 of this chapter), will be filed as a part of an amendment to the registration statement and will not be used until such amendment is effective, and that, for purposes of determining any liability under the Securities Act of 1933, each such post-effective amendment shall be deemed to be a new registration statement relating to the securities offered therein, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof., 922966=(ix) Identify any credit enhancement or other support for the transaction, as referenced in Items 1114(a) and 1115 of this Regulation AB, and briefly describe what protection or support is provided by the enhancement. Identify any enhancement provider referenced in Items 1114(b) and 1115 of this Regulation AB. Summarize how losses not covered by credit enhancement or support will be allocated to the securities., 723660=5. All of the reports on assessment of compliance with servicing criteria for asset-backed securities and their related attestation reports on assessment of compliance with servicing criteria for asset-backed securities required to be included in this report in accordance with Item 1122 of Regulation AB and Exchange Act Rules 13a-18 and 15d-18 have been included as an exhibit to this report, except as otherwise disclosed in this report. Any material instances of noncompliance described in such reports have been disclosed in this report on Form 10-K.3, 569325=[63 FR 6383, Feb. 6, 1998], 756695=[47 FR 11401, Mar. 16, 1982, and 49 FR 47600, Dec. 6, 1984, as amended at 57 FR 36466, Aug. 13, 1992; 61 FR 30401, June 14, 1996; 74 FR 2193, Jan. 14, 2009], 761520=(ii) A transaction in which the securities to be issued or exchanged are not required to be and are not registered under the Securities Act of 1933 (15 U.S.C. 77a et seq.);, 757687=[47 FR 11401, Mar. 16, 1982, as amended at 49 FR 47600, Dec. 6, 1984; 57 FR 36468, Aug. 13, 1992; 61 FR 30401, June 14, 1996; 74 FR 2193, Jan. 14, 2009], 762662=(v) A transaction in which the securities offered to investors are securities of another entity that are reported under a transaction reporting plan declared effective before December 17, 1993 by the Commission under Section 11A of the Securities Exchange Act of 1934 (15 U.S.C. 78k-1), if:, 738456=(iii) Not permitted to be submitted. Not permitted to be submitted to the Commission if the registrant prepares its financial statements in accordance with Article 6 of Regulation S-X (17 CFR 210.6-01 et seq.)., 1045695=(b) As required by Item 1111(h) (§229.1111(h)), provide asset-level information for each asset or security in the pool in the manner specified in appendix to §229.1125., 880151=(a) Application of Regulation AB. Regulation AB (§§229.1100 through 229.1123) is the source of various disclosure items and requirements for “asset-backed securities” filings under the Securities Act of 1933 (15 U.S.C. 77a et seq.) (the “Securities Act”) and the Securities Exchange Act of 1934 (the “Exchange Act”) (15 U.S.C. 78a et seq.). Unless otherwise specified, definitions to be used in this Regulation AB, including the definition of “asset-backed security,” are set forth in Item 1101., 897094=[70 FR 1597, Jan. 7, 2005, as amended at 70 FR 72373, Dec. 5, 2005; 79 FR 57313, Sept. 24, 2014; 80 FR 6652, Feb. 6, 2015], 887205=(2) Reference information for significant obligors. If the third party information relates to a significant obligor and the following conditions are met, you may include a reference to the third party's periodic reports (or the third party's parent with respect to paragraph (c)(2)(ii)(C) of this section) under section 13(a) or 15(d) of the Exchange Act (15 U.S.C. 78m(a) or 78o(d)) that are on file with the Commission (or otherwise publicly available with respect to paragraph (c)(2)(ii)(F) of this section), along with a statement of how those reports may be accessed, including the third party's name and Commission file number, if applicable (See, e.g., Item 1118 of this Regulation AB):, 997146=[70 FR 1597, Jan. 7, 2005, as amended at 79 FR 57315, Sept. 24, 2014], 930628=[70 FR 1597, Jan. 7, 2005, as amended at 76 FR 4511, Jan. 26, 2011; 79 FR 57313, Sept. 24, 2014], 874482=(2) Solicitation or recommendation (including those referred to in Item 1012 of Regulation M-A (§229.1012));, 959117=Describe the pool assets, including the information required by this Item 1111. Present statistical information in tabular or graphical format, if such presentation will aid understanding. Present statistical information in appropriate distributional groups or incremental ranges in addition to presenting appropriate overall pool totals, averages and weighted averages, if such presentation will aid in the understanding of the data. In addition to presenting the number, amount and percentage of pool assets by distributional group or range, also provide statistical information for each group or range by variables, to the extent material, such as, average balance, weighted average coupon, average age and remaining term, average loan-to-value or similar ratio and weighted average standardized credit score or other applicable measure of obligor credit quality. These variables are just examples and should be tailored to the particular asset class backing the asset-backed securities. Consider providing minimums and maximums when presenting averages on an aggregate basis and within each group or range. In addition, provide historical data on the pool assets as appropriate (e.g., the lesser of three years or the time such assets have existed) to allow material evaluation of the pool data. In making any calculations regarding overall pool balances, disregard any funds set aside for a prefunding account., 1013365=[70 FR 1597, Jan. 7, 2005, as amended at 73 FR 967, Jan. 4, 2008], 577279=[63 FR 6383, Feb. 6, 1998, as amended at 70 FR 1594, Jan. 7, 2005; 73 FR 964, Jan. 4, 2008; 74 FR 18617, Apr. 23, 2009; 76 FR 50121, Aug. 12, 2011], 481358=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 55665, Dec. 13, 1982; 51 FR 42056, Nov. 20, 1986; 57 FR 48158, Oct. 21, 1992; 71 FR 53252, Sept. 8, 2006], 841012=(5) Any other material change in the subject company's corporate structure or business, including, if the subject company is a registered closed-end investment company, any plans or proposals to make any changes in its investment policy for which a vote would be required by Section 13 of the Investment Company Act of 1940 (15 U.S.C. 80a-13);, 566954=[63 FR 6381, Feb. 6, 1998, as amended at 70 FR 1594, Jan. 7, 2005], 988840=(i) Describe how the delinquency threshold that triggers a review by the asset representations reviewer was determined to be appropriate. In describing the appropriateness of such delinquency threshold, compare such delinquency threshold against the delinquencies disclosed for prior securitized pools of the sponsor for that asset type in accordance with Item 1105 of Regulation AB (§229.1105)., 581713=[47 FR 11401, Mar. 16, 1982, as amended at 73 FR 964, Jan. 4, 2008], 928542=(i) For prospectuses to be filed pursuant to §230.424 of this chapter prior to February 14, 2013, information may be limited to the prior year; and, 629032=The undersigned registrant hereby undertakes that, for purposes of determining any liability under the Securities Act of 1933, each filing of the annual report pursuant to section 13(a) or section 15(d) of the Securities Exchange Act of 1934 of a third party that is incorporated by reference in the registration statement in accordance with Item 1100(c)(1) of Regulation AB (17 CFR 229.1100(c)(1)) shall be deemed to be a new registration statement relating to the securities offered therein, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof., 886441=5. If you are relying on paragraph (c)(1) of this section to provide information required by Item 1112 of this Regulation AB regarding a significant obligor that is an asset-backed issuer and the pool assets relating to such significant obligor are asset-backed securities, then for purposes of paragraph (c)(1)(iii) of this section, the term “financial statements” means the information required by Instruction 3 of Item 1112 of this Regulation AB. Such information required by Instruction 3.a. of Item 1112 of this Regulation AB may be incorporated by reference from a prospectus that contains such information and is included in an effective Securities Act registration statement or filed pursuant to §230.424 of this chapter., 505671=[68 FR 5127, Jan. 31, 2003, as amended at 70 FR 1594, Jan. 7, 2005], 1014401=(5) Enhancement or support provider contemplated by Items 1114 or 1115 of this Regulation AB., 1039314=(xv) Any external enhancement or other support, identified in Item 1114(a)(1) through (3) or Item 1115 of this Regulation AB, is maintained as set forth in the transaction agreements., 613593=(B) Each prospectus required to be filed pursuant to §230.424(b)(2), (b)(5), or (b)(7) of this chapter as part of a registration statement in reliance on §230.430D of this chapter relating to an offering made pursuant to §230.415(a)(1)(vii) or (a)(1)(xii) of this chapter for the purpose of providing the information required by section 10(a) of the Securities Act of 1933 (15 U.S.C. 77j(a)) shall be deemed to be part of and included in the registration statement as of the earlier of the date such form of prospectus is first used after effectiveness or the date of the first contract of sale of securities in the offering described in the prospectus. As provided in §230.430D of this chapter, for liability purposes of the issuer and any person that is at that date an underwriter, such date shall be deemed to be a new effective date of the registration statement relating to the securities in the registration statement to which that prospectus relates, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof. Provided, however, that no statement made in a registration statement or prospectus that is part of the registration statement or made in a document incorporated or deemed incorporated by reference into the registration statement or prospectus that is part of the registration statement will, as to a purchaser with a time of contract of sale prior to such effective date, supersede or modify any statement that was made in the registration statement or prospectus that was part of the registration statement or made in any such document immediately prior to such effective date; or, 276618=(2) Directorships. Indicate any other directorships held, including any other directorships held during the past five years, held by each director or person nominated or chosen to become a director in any company with a class of securities registered pursuant to section 12 of the Exchange Act or subject to the requirements of section 15(d) of such Act or any company registered as an investment company under the Investment Company Act of 1940, 15 U.S.C. 80a-1, et seq., as amended, naming such company., 602306=[47 FR 11401, Mar. 16, 1982, as amended at 56 FR 48103, Sept. 24, 1991], 95913=6. Appeals of judges' decisions or orders to the Federal Mine Safety and Health Review Commission referenced in Subpart H of 29 CFR part 2700., 601869=Insofar as indemnification for liabilities arising under the Securities Act of 1933 may be permitted to directors, officers or persons controlling the registrant pursuant to the foregoing provisions, the registrant has been informed that in the opinion of the Securities and Exchange Commission such indemnification is against public policy as expressed in the Act and is therefore unenforceable., 1019460=(ii) Payments accrued or paid with respect to enhancement or other support identified in Item 1114 of this Regulation AB (such as insurance premiums or other enhancement maintenance fees), with an identification of the general purpose of such payments and the party receiving such payments., 608042=(2) That, for the purpose of determining any liability under the Securities Act of 1933, each such post-effective amendment shall be deemed to be a new registration statement relating to the securities offered therein, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof., 723311=[Based on my knowledge and the servicer compliance statement(s) required in this report under Item 1123 of Regulation AB, and except as disclosed in the Exchange Act periodic reports, the servicer(s) [has/have] fulfilled [its/their] obligations under the servicing agreement(s) in all material respects; and]2, 181439=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 29839, July 9, 1982; 47 FR 54768, Dec. 6, 1982; 52 FR 30919, Aug. 18, 1987; 68 FR 5999, Feb. 5, 2003; 73 FR 958, Jan. 4, 2008; 76 FR 50120, Aug. 12, 2011], 824205=(e) Prior public offerings. If the filing person has made an underwritten public offering of the subject securities for cash during the past three years that was registered under the Securities Act of 1933 or exempt from registration under Regulation A (§230.251 through §230.263 of this chapter), state the date of the offering, the amount of securities offered, the offering price per share (adjusted for stock splits, stock dividends, etc. as appropriate) and the aggregate proceeds received by the filing person., 1027127=[70 FR 1597, Jan. 7, 2005, as amended at 76 FR 4511, Jan. 26, 2011; 79 FR 57315, Sept. 24, 2014], 179669=(c) Safe harbor. (1) The safe harbor provided in section 27A of the Securities Act of 1933 (15 U.S.C. 77z-2) and section 21E of the Securities Exchange Act of 1934 (15 U.S.C. 78u-5) (“statutory safe harbors”) shall apply to forward-looking information provided pursuant to paragraphs (a)(4) and (5) of this Item, provided that the disclosure is made by: an issuer; a person acting on behalf of the issuer; an outside reviewer retained by the issuer making a statement on behalf of the issuer; or an underwriter, with respect to information provided by the issuer or information derived from information provided by the issuer., 1007348=(2) If the aggregate significance percentage related to any entity or group of affiliated entities providing derivative instruments contemplated by this section is 20% or more, provide financial statements meeting the requirements of Regulation S-X (§§210.1-01 through 210.12-29 of this chapter), except §210.3-05 of this chapter and Article 11 of Regulation S-X (§§210.11-01 through 210.11-03 of this chapter), of such entity or group of affiliated entities. Financial statements of such entity and its subsidiaries consolidated (as required by §240.14a-3(b) of this chapter) shall be filed under this item., 722857=4. [I am responsible for reviewing the activities performed by the servicer(s) and based on my knowledge and the compliance review(s) conducted in preparing the servicer compliance statement(s) required in this report under Item 1123 of Regulation AB, and except as disclosed in the Exchange Act periodic reports, the servicer(s) [has/have] fulfilled [its/their] obligations under the servicing agreement(s) in all material respects; and], 738146=(2) Not in accordance with Article 6 of Regulation S-X (17 CFR 210.6-01 et seq.); and, 46947=(6) The requirements of paragraph (e) of this section shall not apply to a non-GAAP financial measure included in disclosure relating to a proposed business combination, the entity resulting therefrom or an entity that is a party thereto, if the disclosure is contained in a communication that is subject to §230.425 of this chapter, §240.14a-12 or §240.14d-2(b)(2) of this chapter or §229.1015 of this chapter., 1016488=Instruction to Item 1119: With respect to disclosure in an annual report on Form 10-K, information required by this Item 1119 may be omitted to the extent that substantially the same information had been provided previously in an annual report on Form 10-K (§249.310) for the asset-backed securities or in an effective registration statement under the Securities Act or a prospectus timely filed pursuant to §230.424 of this chapter under the same Central Index Key (CIK) code as the current annual report on Form 10-K., 268969=[68 FR 36663, June 18, 2003, as amended at 70 FR 1594, Jan. 7, 2005; 71 FR 76595, Dec. 21, 2006; 72 FR 35321, June 27, 2007; 75 FR 57387, Sept. 21, 2010], 1003503=Instruction 4 to Item 1114(b). If the enhancement provider is a foreign business (as defined §210.1-02 of this chapter):, 927663=(e) Repurchases and replacements. (1) If the underlying transaction agreements provide a covenant to repurchase or replace an underlying asset for breach of a representation or warranty, provide in the body of the prospectus for the prior three years, the information required by Rule 15Ga-1(a) (17 CFR 240.15Ga-1(a)) concerning all assets securitized by the sponsor that were the subject of a demand to repurchase or replace for breach of the representations and warranties concerning the pool assets for all asset-backed securities (as that term is defined in Section 3(a)(79) of the Securities Exchange Act of 1934 (15 U.S.C. 78c(a)(79)) where the underlying transaction agreements included a covenant to repurchase or replace an underlying asset of the same asset class held by non-affiliates of the sponsor, except that:, 610369=(B) Each prospectus required to be filed pursuant to Rule 424(b)(2), (b)(5), or (b)(7) (§230.424(b)(2), (b)(5), or (b)(7) of this chapter) as part of a registration statement in reliance on Rule 430B relating to an offering made pursuant to Rule 415(a)(1)(i), (vii), or (x) (§230.415(a)(1)(i), (vii), or (x) of this chapter) for the purpose of providing the information required by section 10(a) of the Securities Act of 1933 shall be deemed to be part of and included in the registration statement as of the earlier of the date such form of prospectus is first used after effectiveness or the date of the first contract of sale of securities in the offering described in the prospectus. As provided in Rule 430B, for liability purposes of the issuer and any person that is at that date an underwriter, such date shall be deemed to be a new effective date of the registration statement relating to the securities in the registration statement to which that prospectus relates, and the offering of such securities at that time shall be deemed to be the initial bona fide offering thereof. Provided, however, that no statement made in a registration statement or prospectus that is part of the registration statement or made in a document incorporated or deemed incorporated by reference into the registration statement or prospectus that is part of the registration statement will, as to a purchaser with a time of contract of sale prior to such effective date, supersede or modify any statement that was made in the registration statement or prospectus that was part of the registration statement or made in any such document immediately prior to such effective date; or, 715980=(ii) Electronic filings. The requirement to bind separately the statement of eligibility and qualification of each person designated to act as a trustee under the Trust Indenture Act of 1939 from other exhibits shall not apply to statements submitted in electronic format. Rather, such statements must be submitted as exhibits in the same electronic submission as the registration statement to which they relate, or in an amendment thereto, except that electronic filers that rely on Trust Indenture Act Section 305(b)(2) for determining the eligibility of the trustee under indentures for securities to be issued, offered or sold on a delayed basis by or on behalf of the registrant shall file such statements separately in the manner prescribed by §260.5b-1 through §260.5b-3 of this chapter and by the EDGAR Filer Manual., 1008033=Instructions to Item 1115: 1. Instructions 2, 3 and 5 to Item 1114 of this Regulation AB apply to the information contemplated by paragraph (b) of this item., 755291=[68 FR 64969, Nov. 17, 2003], 936779=(2) With respect to information regarding the currently offered pool, information about the pool for periods before January 1, 2006., 1014314=(4) Significant obligor contemplated by Item 1112 of this Regulation AB., 151013=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 57914, Dec. 29, 1982; 52 FR 30919, Aug. 18, 1987; 56 FR 30053, July 1, 1991; 64 FR 73402, Dec. 30, 1999; 73 FR 958, Jan. 4, 2008; 74 FR 18617, Apr. 23, 2009; 76 FR 50120, Aug. 12, 2011], 1040185=Instruction 2 to Item 1122. If certain servicing criteria are not applicable to the asserting party based on the activities it performs with respect to asset-backed securities transactions taken as a whole involving such party and that are backed by the same asset type backing the class of asset-backed securities, the inapplicability of the criteria must be disclosed in that asserting party's and the related registered public accounting firm's reports., 96481=(2) The term operator has the meaning given the term in section 3 of the Federal Mine Safety and Health Act of 1977 (30 U.S.C. 802)., 234945=i. An insured depository institution as defined in section 3(c)(2) of the Federal Deposit Insurance Act (12 U.S.C.A. Sec. 1813 (c));, 179044=6. Any forward-looking information supplied is expressly covered by the safe harbor rule for projections. See Rule 175 under the Securities Act [17 CFR 230. 175], Rule 3b-6 under the Exchange Act [17 CFR 249.3b-6] and Securities Act Release No. 6084 (June 25, 1979) (44 FR 38810)., 728256=(35) Servicer compliance statement. Each servicer compliance statement required by §229.1123., 1044057=Instruction to Item 1124. The disclosure required under this item shall separately state the resulting amount and nature of any interest or asset retained in compliance with law, including any amounts that are retained by parties other than the sponsor in order to satisfy such requirement., 979886=(3) File the Asset Data File as an exhibit to Form ABS-EE (§249.1401 of this chapter) in accordance with Item 601(b)(102) of Regulation S-K (§229.601(b)(102))., 1002306=Instruction 3 to Item 1114(b). If the pool assets are student loans originated under the Federal Family Education Loan Program of the Higher Education Act of 1965 (20 U.S.C. 1001 et seq.)) and the enhancement provider for the pool assets is a guarantee agency as defined under the Higher Education Act, then the following information may be provided in lieu of providing financial information required pursuant to paragraph (b)(2) of this section:, 83830=[47 FR 11401, Mar. 16, 1982, as amended at 63 FR 6381, Feb. 6, 1998; 64 FR 1734, Jan. 12, 1999; 67 FR 58504, Sept. 16, 2002; 70 FR 76641, Dec. 27, 2005; 73 FR 957, Jan. 4, 2008; 76 FR 50120, Aug. 12, 2011], 726092=3The certification refers to the reports prepared by parties participating in the servicing function that are required to be included as an exhibit to the Form 10-K. See Item 1122 of Regulation AB (§229.1122) and Rules 13a-18 and 15d-18 (§§240.13a-18 and 240.15d-18 of this chapter). If a report that is otherwise required to be included is not attached, disclosure that the report is not included and an associated explanation must be provided in the Form 10-K report., 98973=(ii) If the principal United States market for such common equity is an exchange, state the high and low sales prices for the equity for each full quarterly period within the two most recent fiscal years and any subsequent interim period for which financial statements are included, or are required to be included by Article 3-01 through 3-04 of Regulation S-X (§210.3-01 through 3-04 of this chapter), or Article 8-02 through 8-03 of Regulation S-X (§210.8-02 through 8-03 of this chapter) in the case of smaller reporting companies, as reported in the consolidated transaction reporting system or, if not so reported, as reported on the principal exchange market for such equity., 551266=2. For purposes of the disclosure required by paragraph (f)(2)(ii) of this Item, a registrant's process for collecting and organizing security holder communications, as well as similar or related activities, need not be disclosed provided that the registrant's process is approved by a majority of the independent directors or, in the case of a registrant that is an investment company, a majority of the directors who are not “interested persons” of the investment company as defined in section 2(a)(19) of the Investment Company Act of 1940 (15 U.S.C. 80a-2(a)(19))., 608566=(4) If the registrant is a foreign private issuer, to file a post-effective amendment to the registration statement to include any financial statements required by “Item 8.A. of Form 20-F (17 CFR 249.220f)” at the start of any delayed offering or throughout a continuous offering. Financial statements and information otherwise required by Section 10(a)(3) of the Act need not be furnished, provided that the registrant includes in the prospectus, by means of a post-effective amendment, financial statements required pursuant to this paragraph (a)(4) and other information necessary to ensure that all other information in the prospectus is at least as current as the date of those financial statements. Notwithstanding the foregoing, with respect to registration statements on Form F-3 (§239.33 of this chapter), a post-effective amendment need not be filed to include financial statements and information required by Section 10(a)(3) of the Act or §210.3-19 of this chapter if such financial statements and information are contained in periodic reports filed with or furnished to the Commission by the registrant pursuant to section 13 or section 15(d) of the Securities Exchange Act of 1934 that are incorporated by reference in the Form F-3., 1000837=(ii) If any entity or group of affiliated entities providing enhancement or other support described in paragraph (a) of this section is liable or contingently liable to provide payments representing 20% or more of the cash flow supporting any offered class of the asset-backed securities, provide financial statements meeting the requirements of Regulation S-X (§§210.1-01 through 210.12-29 of this chapter), except §210.3-05 of this chapter and Article 11 of Regulation S-X (§§210.11-01 through 210.11-03 of this chapter), of such entity or group of affiliated entities. Financial statements of such enhancement provider and its subsidiaries consolidated (as required by §240.14a-3(b) of this chapter) shall be filed under this item., 139731=6. For asset-backed securities, see also Item 1113 of Regulation AB (§229.1113)., 258910=The table below provides information about the Company's corn inventory and futures contracts that are sensitive to changes in commodity prices, specifically corn prices. For inventory, the table presents the carrying amount and fair value at December 31, 19x1. For the futures contracts the table presents the notional amounts in bushels, the weighted average contract prices, and the total dollar contract amount by expected maturity dates, the latest of which occurs one year from the reporting date. Contract amounts are used to calculate the contractual payments and quantity of corn to be exchanged under the futures contracts., 902790=(i) Neither the depositor nor the issuing entity is an investment company under the Investment Company Act of 1940 (15 U.S.C. 80a-1 et seq.) nor will become an investment company as a result of the asset-backed securities transaction., 501485=[56 FR 7265, Feb. 21, 1991, as amended at 61 FR 30391, June 14, 1996; 70 FR 46088, Aug. 9, 2005; 76 FR 71875, Nov. 21, 2011], 915719=[70 FR 1597, Jan. 7, 2005, as amended at 79 FR 57313, Sept. 24, 2014], 938236=If the depositor is not the same entity as the sponsor, provide separately the information regarding the depositor called for by paragraphs (a) and (b) of Item 1104 of this Regulation AB, and, to the extent the information would be material and materially different from the sponsor, paragraphs (c) and (d) of Item 1104 of this Regulation AB. In addition, provide the following information:, 577092=Instruction to Item 503: For asset-backed securities, see also Item 1103 of Regulation AB (§229.1103)., 123459=[47 FR 11401, Mar. 16, 1982, as amended at 47 FR 25127, June 10, 1982; 47 FR 54768, Dec. 6, 1982; 67 FR 246, Jan. 2, 2002; 71 FR 53240, Sept. 8, 2006; 73 FR 957, Jan. 4, 2008; 76 FR 50120, Aug. 12, 2011], 629666=[47 FR 11401, Mar. 16, 1982], 137736=3. Section 305(a)(2) of the Trust Indenture Act of 1939, 15 U.S.C. 77aaa et seq., as amended (“Trust Indenture Act”), shall not be deemed to require the inclusion in a registration statement or in a prospectus of any information not required by this Item., 928709=(ii) For prospectuses to be filed pursuant to §230.424 of this chapter on or after February 14, 2013 but prior to February 14, 2014, information may be limited to the prior two years., 238236=December 31, 19X1, 47394=(7) The requirements of paragraph (e) of this section shall not apply to investment companies registered under section 8 of the Investment Company Act of 1940 (15 U.S.C. 80a-8)., 760279=(3) Partnership does not include any entity registered under the Investment Company Act of 1940 (15 U.S.C. 80a-1 et seq.) or any Business Development Company as defined in section 2(a)(48) of that Act (15 U.S.C. 80a-2(a)(48))., 473709=[71 FR 53241, Sept. 8, 2006; 71 FR 56225, Sept. 26, 2006, as amended at 71 FR 78350, Dec. 29, 2006; 73 FR 958, Jan. 4, 2008; 74 FR 68362, Dec. 23, 2009; 76 FR 6043, Feb. 2, 2011; 76 FR 50121, Aug. 12, 2011], 828417=Instruction to Item 1003. If the filing person is making information relating to the transaction available on the Internet, state the address where the information can be found., 27557=(a) Application of Regulation S-K. This part (together with the General Rules and Regulations under the Securities Act of 1933, 15 U.S.C. 77a et seq., as amended (Securities Act), and the Securities Exchange Act of 1934, 15 U.S.C. 78a et seq., as amended (Exchange Act) (parts 230 and 240 of this chapter), the Interpretative Releases under these Acts (parts 231 and 241 of this chapter) and the forms under these Acts (parts 239 and 249 of this chapter)) states the requirements applicable to the content of the non-financial statement portions of:, 556614=[71 FR 53254, Sept. 8, 2006, as amended at 73 FR 964, Jan. 4, 2008; 73 FR 57238, Oct. 2, 2008; 74 FR 68364, Dec. 23, 2009; 77 FR 38453, July 27, 2012], 980354=(5) A registrant may provide other asset-level information in addition to the information required by Schedule AL (§229.1125) by filing an asset related document as an exhibit to Form ABS-EE (§249.1401 of this chapter) in accordance with Item 601(b)(103) of Regulation S-K (§229.601(b)(103)). The asset related document(s) must contain the definitions and formulas for each additional data point and the related tagged data and may contain explanatory disclosure about each additional data point., 264465=[68 FR 36663, June 18, 2003], 882804=(c) Presentation of certain third party information. If information of a third party is required in a filing by Item 1112(b) of this Regulation AB (Information regarding significant obligors) (§229.1112(b)), Items 1114(b)(2) or 1115(b) of this Regulation AB (Information regarding significant provider of enhancement or other support) (§229.1114(b)(2) or (§229.1115(b)), or Item 1125 of this Regulation AB (Asset-level information) (§229.1125) such information, in lieu of including such information, may be provided as follows:, 854953=(1) Any present or proposed material agreement, arrangement, understanding or relationship between the offeror or any of its executive officers, directors, controlling persons or subsidiaries and the subject company or any of its executive officers, directors, controlling persons or subsidiaries (other than any agreement, arrangement or understanding disclosed under any other sections of Regulation M-A (§§229.1000 through 229.1016));, 943521=(l) If applicable law prohibits the issuing entity from holding the pool assets directly (for example, an “eligible lender” trustee must hold student loans originated under the Federal Family Education Loan Program of the Higher Education Act of 1965 (20 U.S.C. 1001 et seq.)), describe the arrangements instituted to hold the pool assets on behalf of the issuing entity. Include disclosure regarding the arrangements taken, as applicable, regarding the items in paragraph (k) of this section with respect to any such additional entity that holds such assets on behalf of the issuing entity., 983826=a. For a registration statement under the Securities Act or the Exchange Act or a prospectus to be filed pursuant to §230.424 of this chapter, the information required by Items 1104 through 1115, 1117 and 1119 of this Regulation AB regarding such asset-backed securities; and, 937819=[70 FR 1597, Jan. 7, 2005, as amended at 70 FR 72373, Dec. 5, 2005; 79 FR 57314, Sept. 24, 2014], 615358=(6) That, for the purpose of determining liability of the registrant under the Securities Act of 1933 to any purchaser in the initial distribution of the securities:, 897883=(1) Factual information regarding the asset-backed securities being offered and the structure and basic parameters of the securities, such as the number of classes, seniority, payment priorities, terms of payment, the tax, Employment Retirement Income Security Act of 1974, as amended, (29 U.S.C. 1001 et seq.) (“ERISA”) or other legal conclusions of counsel, and descriptive information relating to each class (e.g., principal amount, coupon, minimum denomination, anticipated price, yield, weighted average life, credit enhancements, anticipated ratings, and other similar information relating to the proposed structure of the offering);, 890705=(F) The third party is a U.S. government-sponsored enterprise, has outstanding securities held by non-affiliates with an aggregate market value of $75 million or more, and makes information publicly available on an annual and quarterly basis, including audited financial statements prepared in accordance with generally accepted accounting principles covering the same periods that would be required for audited financial statements under Regulation S-X (§§210.1-01 through 210.12-29 of this chapter) and non-financial information consistent with that required by Regulation S-K (§§229.10 through 229.1123)., 739241=(106) Static pool. If not included in the prospectus filed in accordance with §230.424(b)(2) or (5) and (h) of this chapter, static pool disclosure as required by §229.1105., 87608=[47 FR 11401, Mar. 16, 1982, as amended at 64 FR 1735, Jan. 12, 1999; 73 FR 957, Jan. 4, 2008; 74 FR 2193, Jan. 14, 2009], 761746=(iii) A transaction that involves only issuers that are not required to register or report under Section 12 of the Securities Exchange Act of 1934 (15 U.S.C. 78l), both before and after the transaction;, 521028=Instructions to Item 407(c)(2)(ix). 1. For purposes of paragraph (c)(2)(ix) of this Item, the percentage of securities held by a nominating security holder may be determined using information set forth in the registrant's most recent quarterly or annual report, and any current report subsequent thereto, filed with the Commission pursuant to the Exchange Act (or, in the case of a registrant that is an investment company registered under the Investment Company Act of 1940, the registrant's most recent report on Form N-CSR (§§249.331 and 274.128 of this chapter)), unless the party relying on such report knows or has reason to believe that the information contained therein is inaccurate., 86081=4. A registrant engaged in oil and gas producing activities shall provide the information required by Subpart 1200 of Regulation S-K., 818734=Source: 64 FR 61443, Nov. 10, 1999, unless otherwise noted., 953544=Instruction to Item 1109. If multiple trustees are involved in the transaction, provide a description of the roles and responsibilities of each trustee., 758136=Source: 56 FR 57247, Nov. 8, 1991, unless otherwise noted.}",
    "textBeforeTable": "Index of Scaled Disclosure Available to Smaller Reporting Companies (f) Smaller reporting companies. The requirements of this part apply to smaller reporting companies. A smaller reporting company may comply with either the requirements applicable to smaller reporting companies or the requirements applicable to other companies for each item, unless the requirements for smaller reporting companies specify that smaller reporting companies must comply with the smaller reporting company requirements. The following items of this part set forth requirements for smaller reporting companies that are different from requirements applicable to other companies: 3. The non-GAAP financial measure is included in the annual report prepared by the registrant for use in the jurisdiction in which it is domiciled, incorporated or organized or for distribution to its security holders. 2. The non-GAAP financial measure is required or expressly permitted by the standard-setter that is responsible for establishing the GAAP used in such financial statements; and 1. The non-GAAP financial measure relates to the GAAP used in the registrant's primary financial statements included in its filing with the Commission; Note to paragraph (e): A non-GAAP financial measure that would otherwise be prohibited by paragraph (e)(1)(ii) of this section is permitted in a filing of a foreign private issuer if: (7) The requirements of paragraph (e) of this section shall not apply to investment companies registered under section 8 of the Investment Company Act of 1940 (15 U.S.C. 80a-8). (6)",
    "textAfterTable": "(1) Definition of smaller reporting company. As used in this part, the term smaller reporting company means an issuer that is not an investment company, an asset-backed issuer (as defined in §229.1101), or a majority-owned subsidiary of a parent that is not a smaller reporting company and that: (i) Had a public float of less than $75 million as of the last business day of its most recently completed second fiscal quarter, computed by multiplying the aggregate worldwide number of shares of its voting and non-voting common equity held by non-affiliates by the price at which the common equity was last sold, or the average of the bid and asked prices of common equity, in the principal market for the common equity; or (ii) In the case of an initial registration statement under the Securities Act or Exchange Act for shares of its common equity, had a public float of less than $75 million as of a date within 30 days of the date of the filing of the registration statement, computed by multiplying the aggregate worldwide number of such shares held by non-affiliates before the registration plus, in the case of a Securities Act registration statement, the number of such shares included in the registration statement by the estimated public offering price of the shares; or (iii) In the case of an issuer whose public float as calculated under paragraph (i) or (ii) of this definition was zero, had annual revenues of less than",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}