{
    "relation": [
        [
            "S.N.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8"
        ],
        [
            "Panel & Description",
            "BorderContainer The BorderContainer class provides a set of CSS styles that control the appearance of the border and background fill of the container.",
            "Form The Form container provides control over the layout of a form, mark form fields as required or optional, handle error messages, and bind form data to the Flex data model to perform data checking and validation.",
            "VGroup The VGroup container is a Group container that uses the VerticalLayout class.",
            "HGroup The HGroup container is a Group container that uses the HorizontalLayout class.",
            "Panel The Panel class is a container that includes a title bar, a caption, a border, and a content area for its children.",
            "SkinnableContainer The SkinnableContainer class is the base class for skinnable containers that provide visual content.",
            "TabBar The TabBar displays a set of identical tabs.",
            "TitleWindow The TitleWindow extends Panel to include a close button and move area."
        ]
    ],
    "pageTitle": "Flex - Quick Guide",
    "title": "",
    "url": "http://www.tutorialspoint.com/flex/flex_quick_guide.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 808683399,
    "recordOffset": 808647812,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{145855=© Copyright 2015. All Rights Reserved., 6269=You can download the latest version of Tomcat from http://tomcat.apache.org/. Once you downloaded the installation, unpack the binary distribution into a convenient location. For example in C:\\apache-tomcat-6.0.33 on windows, or /usr/local/apache-tomcat-6.0.33 on Linux/Unix and set CATALINA_HOME environment variable pointing to the installation locations.}",
    "lastModified": "Fri, 31 Jul 2015 10:43:56 GMT",
    "textBeforeTable": "FLEX requires JDK 1.4 or higher so the very first requirement is to have JDK installed in your machine. System Requirement This tutorial will guide you on how to prepare a development environment to start your work with Adobe Flex Framework. This tutorial will also teach you how to setup JDK and Adobe Flash Builder on your machine before you setup Flex Framework: Flex - Environment Setup Flex is actionscript and XML based. Learning of these two is a must to work in Flex. Flex applications are single threaded applications but Flex provides an asynchronous programming model to mitigate this concern. Disadvantages of Flex Flex application reduces the load on the server to great extent because it is only required return the application once, rather than a new page every time when the user changes views. Flex application is a single page application where states can can transition from one state to other state without having to fetch a new page from the server or to refresh the browser. Flex Applications developed assures Rich User Experience through intuitive interaction with the application and presenting information in a visually richer interface. Flex applications can interact with server with all major server side technologies like Java, Spring, Hibernate, PHP, Ruby, .NET, Adobe ColdFusion, and SAP using industry standards such as REST, SOAP, JSON, JMS, and AMF. Flex applications are platform independent. UI can be native to platform or can be made same on each platform. Flex applications",
    "textAfterTable": "Mac Open Terminal machine:~ joseph$ java -version Let's verify the output for all the operating systems: OS Generated Output Windows java version \"1.6.0_21\" Java(TM) SE Runtime Environment (build 1.6.0_21-b07) Java HotSpot(TM) Client VM (build 17.0-b17, mixed mode, sharing) Linux java version \"1.6.0_21\" Java(TM) SE Runtime Environment (build 1.6.0_21-b07) Java HotSpot(TM) Client VM (build 17.0-b17, mixed mode, sharing) Mac java version \"1.6.0_21\" Java(TM) SE Runtime Environment (build 1.6.0_21-b07) Java HotSpot(TM)64-Bit Server VM (build 17.0-b17, mixed mode, sharing) Step 2 - Setup Java Development Kit (JDK): If you do not have Java installed then you can install the Java Software Development Kit (SDK) from Oracle's Java site: Java SE Downloads. You will find instructions for installing JDK in downloaded files, follow the given instructions to install and configure the setup. Finally set PATH and JAVA_HOME environment variables to refer to the directory that contains java and javac, typically java_install_dir/bin and java_install_dir respectively. Set the JAVA_HOME environment variable to point to the base directory location where Java is installed on your machine. For example OS Output Windows Set the environment variable JAVA_HOME to C:\\Program Files\\Java\\jdk1.6.0_21 Linux export JAVA_HOME=/usr/local/java-current Mac export JAVA_HOME=/Library/Java/Home Append Java compiler location to System Path. OS Output",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}