{
    "relation": [
        [
            "Patent application number",
            "20130128627",
            "20140265615"
        ],
        [
            "Description",
            "SWITCH CONTROL METHOD, SWITCH CONTROLLER, AND CONVERTER COMPRISING THE SWITCH CONTROLLER - The present invention relates to a converter, a switch controller controlling switching operation of a power switch in the converter, and a switch control method. An exemplary embodiment of the present invention generates a reference current corresponding to an output current of the converter and generates a control voltage that depends on the reference current. The exemplary embodiment controls an increase or a decrease of the control voltage and determines a switching frequency of the power switch according to the control voltage. The exemplary embodiment controls on-time of the power switch using a reference voltage determined according to a control current that depends on the reference current.",
            "METHOD AND APPARATUS FOR CONTROLLING WIRELESS POWER TRANSMISSION - A method and an apparatus for controlling wireless power transmission are provided. An apparatus for controlling wireless power transmission includes a controller configured to determine an output voltage of a power factor correction unit based on charging information of a battery, the power factor correction unit configured to correct an input voltage into the determined output voltage, and output a variable voltage, and a resonance unit configured to transmit power converted from the variable voltage to a wireless power reception apparatus."
        ],
        [
            "Published",
            "05-23-2013",
            "09-18-2014"
        ]
    ],
    "pageTitle": "Sang Cheol - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sang-cheol-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443023659,
    "recordOffset": 443001792,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sang-Cheol Moon, Daejeon KR 07-18-2013 METHOD AND APPARATUS FOR CONTROLLING WIRELESS PERSONAL AREA NETWORK (PAN) DEVICE - A method of controlling a wireless personal area network (PAN) device, such that the PAN device performs at least one from among a coordinator role, a router role, and an end device role in a plurality of networks by using a single physical layer includes setting a first role corresponding to a first network and a second role corresponding to a second network; acquiring activation interval information of the first network and the second network based on the first role and the second role that are set in correspondence to the first network and the second network, respectively; performing the first role during the activation interval of the first network based on the acquired activation interval information; and switching the first role to the second role and performing the second role during the activation interval of the second network. 20130183900 Published Description Patent application number Sang-Cheol Moon, Seoul KR 01-07-2010 SWITCH CONTROL DEVICE AND CONVERTER INCLUDING THE SAME - The present invention relates to a switch controller and a converter having the same. The converter according to the present invention includes a power transfer device that transmits input power to an output terminal as output power, a power switch connected to a first end of the power transfer device and that controls power transmission of the power transfer",
    "textAfterTable": "Sang-Cheol Nam, Seoul KR Patent application number Description Published 20090162743 Reserve Battery Having all Solid State Thin Film Battery - The present invention discloses a reserve battery having an all solid state thin film battery ( 06-25-2009 20100264017 METHOD FOR DEPOSITING CERAMIC THIN FILM BY SPUTTERING USING NON-CONDUCTIVE TARGET - A method for depositing a ceramic thin film by sputtering is provided to increase deposition rate of the ceramic thin film and to enhance the uniformity of a deposited thin film, which are accomplished by positioning a nonconductive target within a vacuum chamber, and applying an AC/RF power to the target to produce plasma within the chamber, followed by the application of a hybrid power in combination of an AC/RF power and a DC power to the target to proceed a sputtering process inside the vacuum chamber, such that the ceramic thin film is deposited on a substrate placed in the vacuum chamber. 10-21-2010 20100330411 THIN FILM BATTERY AND METHOD OF CONNECTING ELECTRODE TERMINAL OF THIN FILM BATTERY - Provided is a thin film battery, including: a base substrate; a cathode current collector pattern and an anode current collector pattern being formed on the base substrate and being electrically separate from each other; a cathode terminal and an anode terminal being directly bonded with the cathode current collector pattern and the anode current collector pattern; a cathode and an anode being disposed on the cathode",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}