{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are cops all around the school, in every building. Saint Aug does it's best to keep the students safe.",
            "There tons of organizations and activities for the students to participate in. Even on vacations the school has programs and activities for the the students which is fun. There are also places nearby that the students can visit",
            "If you love soul food then you will definitely enjoy the food. Though they try to be diverse when it comes to the meals.",
            "College is what you make of it and the same applies to dorm life. The school provided me with a room and allowed me to make it feel like home.",
            "The professors push you passed your limit to become a hard working, responsible, and organized student. Their goal is to prepare you for the real world, and they are definitely helping me.",
            "Saint Augustine's University is a small school, with this being said, if you enjoy being around the same people everyday then this is the school for you.",
            "Saint Augustine's University is a family oriented school that made me feel completely welcome. The faculty and staff did everything they could to help me financially. I love my school and wouldn't choose to go elsewhere."
        ]
    ],
    "pageTitle": "Saint Augustine's University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saint-Augustines-College/reviews?_escaped_fragment_=/show/50234",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910829160,
    "recordOffset": 910799509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12397=A nice school with a friendly campus, if you are a student who does not excel in big classrooms then Saint Augustine's College is for you. Professors at St. Aug like to be well acquainted with their students by providing study halls and exam reviews. I really enjoy learning at the Aug., 111560=© 2015, Cappex.com, LLC, 41536=We have many clubs and organizations. I would recommend to check our website www.st-aug.edu to check out our student handbook for specific names and details., 78622=Saint Aug is a small school. The classes are usually not to big. The teachers always make sure you have their contact info and will always help you., 37339=When homecoming comes around in October., 94202=There are cops all around the school, in every building. Saint Aug does it's best to keep the students safe., 88666=Saint Augustine's University is a very thriving school, with as much opportunity to give as any other University. The Campus is a good size and all about how you make it. I will rate Saint Aug a 7-10, 19322=SAU is one of the worst HBCUs' out. The school is in financial trouble due to the previous president and other faculty misusing funds, they unwisely decided to build a football stadium for a team that sucks and currently owes $650,000 to the contractors who stopped working because they werent getting paid, they laid off 30+ people and furloughed staff, 12 month employees will only get paid for 10 months, 11 Summer classes were cut, and they don't want to offer work-study, scholarships, or grants. Many students didn't return for the 2014 Spring Semester as they transferred and more are talking about not returning in the Fall. Freshmen enrollment is at 198 and if more don't enroll they will have more cuts. Majority of the staff here are very unprofessional & rude. I hate to say it but they act as ghetto as the surrounding neighborhoods. They are not equipped to teach the next generation of professionals. It's sad because not all the staff is like that but the bad outweighs the good. When you come in for Registration be prepared to get the run around and to be there all day!! It's very unorganized too Your paperwork will get lost..keep copies!!}",
    "textBeforeTable": "01/12/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 1 of 28 Shatara from Port Orchard, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Great for these types of students If you struggled in high school, but know that you can achieve and want to achieve than Saint Augustine's is the right school for you. The atmosphere is great for learning and the nuturing environment will assure that you do learn, as long as you want to. Tips for prospective students When shopping for your school, make sure it is a fit for not just you, but the family. Compare everything, classes, dorms, activities, access to off campus activities, and you will be sure to have made the right choice. Bang for the buck Considering it is a private college, the tuition is relatively low compared to other private colleges in the area. The campus is beautiful and the professors are of great prominence. Am enjoying being here I knew I wanted to experience living on campus, but living at Saint Augustine's has been just about the best experience ever. Am learning a lot It's hard to fail at this school. Their program Freshman Experience, keeps you in constant contact with advisors, professors, and tutors. You even have to check in with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}