{
    "relation": [
        [
            "Branch",
            "General merchants",
            "Grocers",
            "Produce, grain etc",
            "Textile",
            "Skins and furs",
            "Metal and machines",
            "Household wares",
            "Wood and heating materials",
            "Drinks",
            "Livestock",
            "Others",
            "Agents",
            "Total"
        ],
        [
            "Independent",
            "119",
            "100",
            "52",
            "67",
            "19",
            "15",
            "15",
            "12",
            "11",
            "7",
            "9",
            "17",
            "443"
        ],
        [
            "Family members",
            "370",
            "278",
            "235",
            "247",
            "82",
            "59",
            "42",
            "44",
            "43",
            "29",
            "33",
            "83",
            "1545"
        ],
        [
            "Total",
            "489",
            "378",
            "287",
            "314",
            "101",
            "74",
            "57",
            "56",
            "54",
            "36",
            "42",
            "100",
            "1988"
        ],
        [
            "Percent",
            "24.7",
            "19.0",
            "14.5",
            "15.8",
            "5.2",
            "3.8",
            "2.8",
            "2.7",
            "2.6",
            "1.6",
            "2.2",
            "5.1",
            "100.0"
        ]
    ],
    "pageTitle": "Kutno, Poland [Pages 11-58]",
    "title": "",
    "url": "http://www.jewishgen.org/yizkor/kutno/kut011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 522917487,
    "recordOffset": 522863644,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114959=Among the rabbis in the first half of the 19th century, Rabbi Mosze Aharon Kronzylber should be mentioned, who apparently served as rabbi after the death of Rabbi Eliezer Brisz and also Rabbi Mosze Jehuda Lajb (born in Łęczyca), who was the author of the essays \u0093Fresh Olive\u0094 (Warsaw 1851) and \u0093Glory of Jerusalem\u0094. At first he served as rabbi in Kowal, Sierpc, Dobrzyn and Łask. In 1857, he emigrated to Israel and settled in Jerusalem where he died in 1879[20]., 88849=Two sources are available concerning the burial society at that time: a short report in the Prussian document and the register of the burial society itself. The register is from the year 1808, but there are some entries from earlier dates, from the year 1755. The ledger relates that \u0093by secret\u0094 the previous one was taken from them; the reasons are not noted, but it is reasonable to assume that the matter is connected with the conquering Prussian authorities. The pages from 1755 and afterwards are from the old ledger, and apparently they were torn from the old book and bound together with the new one., 29736=According to the official list from the year 1796 the Jews of Kutno were busy in the following occupations:, 117687=In the Hebrew newspapers from the second half of the 19th century details were published about people and incidents characteristic of the way of life in those days. For example, the paper \u0093HaMagid\u0094, in 1861 (no. 16), in an article from Kutno, related that a new scroll of the law (the fourth) was brought to the synagogue, donated by the widow Bajle Zylberberg. She was a rich enough lady, since the first ones cost 6,000 Polish zloty. The celebration was commemorated generously - first there was a reception for the whole town, where, according to the reporter's notes, more than one thousand were present (men, women and children)., 54165=Additionally, the statistics under discussion surveyed the situation of the Jewish population. The organizer of the survey came to the conclusion that the Jewish situation was very serious following the heavy tax burden imposed by the land owners on the Jews of Kutno, and also due to the commercial monopoly on various necessities possessed by the land owners. As proof of that, the report mentioned the fact that the Jews had been forced to stop building the synagogue which was started thirty years previously, that is, about 1766., 9764=From the 18th century we have in our possession documentation about two rabbis from Kutno. The first of them, who lived at the end of the 17th century and the beginning of the 18th, was Rabbi Mosze Jekutiel Kaufman HaKohen, author of the book \u0093Shrewbread\u0094 and was the son-in-law of the Kalisz rabbi, Rabbi Abraham Abeleh Gombiner, author of \u0093Shield of Abraham\u0094. Rabbi Kaufman was born in Krotoszyn and died there in the year 1722 while serving as rabbi of the congregation[9]. His successor is thought to have been Rabbi Arie Lajb, son of the rabbi of Kalisz Rabbi Josef Chaim, who, in 1768, the community of Poznan appointed as a preacher and also at the same time served as a rabbi[10], 120289=This interesting happening, from the year 1886, was reported in an article in the newspaper \u0093Hamlitz\u0093: On a certain Sabbath, a new cantor who had come to the town was supposed to lead the prayers in the synagogue, but the heads of the congregation did not agree (the reasons were not given in the article). Therefore the cantor lead the prayer in the seminary and it was very nice. The next Sabbath the common crowd asked that the cantor lead the prayer in the synagogue. The matter was brought before the rabbi and according to the compromise that he suggested, the cantor would only lead prayers for the beginning of the Sabbath and the additional Bible reading in the synagogue. But the common crowd did not give up and a skirmish broke out in the synagogue which resulted in a scrimmage, the old cantor was driven off the lectern and even beaten up, and his condition \u0096 added the article \u0096 was serious. It is amazing how the feelings of the crowd got agitated over the prayers of a cantor when even the accepted authority of the town rabbi was not able to placate them., 83025=As will be seen, this figure of those liable for tax was only on paper, and undoubtedly changed after payment from each individual. Below the account is the signature of the Regent of Plock, and the date 8.5.1796., 101036=However, the Napoleonic wars caused the Jewish population in the town to dwindle, and in 1808 the official estimate of the Kutno community was no more than 1,357 persons. In the eight years since 1800 the size of the Jewish community had decreased by more than three percent, although among the Polish population the decrease was greater \u0096 from 877 souls to 748, which is a drop of 18 percent. At that time, the percentage of Jews in the town's population was 64.5., 143976=In the first decade of the 20th century the balance changed in favour of the Jews and in 1910 they comprised 63.0 percent of the town's population. However, with the emergence of independent Poland, there was a drastic change., 116587=On 31st May 1862 Jews were permitted to keep pharmacies and to be craftsmen; on 1st January 1863 the kosher meat tax was abolished, and two days later the day pass was cancelled \u0096 Jews had been required to hold a pass entitling them to go to Warsaw., 114304=During the time of Handelsman and shortly afterwards Dr. Feliks Orensztajn (1849-1916) served as doctor in Kutno and was highly esteemed. He was born in Warsaw and completed his studies at the Faculty of Medicine in 1873. The same year he worked in Kutno where he worked as doctor for thirty-four years, until 1907. He died in 1916 from typhus which he contracted while treating his patients., 99532=According to an order from the year 1797, the Jews in south-east Prussia were subject to a list of economic restrictions: trade in the villages was forbidden; wage earners were forbidden to deal in secondary occupations etc. The authorities struck out at Jewish autonomy by limiting the power of the communities and rabbis to religious matters alone, cancelling the boycott and the organizing contacts between the communities., 144224=In the census conducted in 1921, the population of the town was 15.976, from which 6,784 were Jews, that is, 42.5 percent. And in the following census in 1931 there was a further decrease. Out of a population of 23,368 souls in Kutno, the Jewish population contained only 6,440 people (according to their estimate), that is to say, no more than 27 percent., 50496=In the village 33 people were occupied in domestic service[28] \u0096 28 girls and 8 men, which is one servant to four families \u0096 that is to say, three times more than in town. Most of the male servants were employed by the lease distillers (16 out of 18), who were the highest class among the village Jews. Four of those kept two servants each (a girl and a male) and one, who also had a salt refining business, even had three. The shopkeeper also had two servants. In contrast, in town, only three families had two servants, and three servants were not found in any family at all. Only two of the bar tenders had servants and among the craftsmen, only one tanner had. Typical of the servants in the village was that the number of male servants was 2.5 greater than that of females \u0096 18:7. In the town it was an opposite relation \u0096 18 girl servants as opposed to 10 males. These differences can be explained by the dissimilar nature of the work. Men were required for the hard work conditions in the village breweries and distilleries, and also it can be assumed that Jewish girls did not tend to work in the villages. Male servants were mainly aged 20-30, whereas the girls were aged 13-16., 72209=The poll tax was paid by all those obliged to pay tax; it amounted to between 3 to 18 gold zloty and was on an average of 6 zloty per family. According to a law passed in parliament in 1775, the poll tax was determined at 3 florins for each person one year old and upwards. Levying and collection of the taxes was the business of the community but they did not actually abide by the amounts and fixed them according to the economic situation of the family. In 1796, in the Kutno community, this tax amounted to 1,654 florins., 11549=It turned out that, thanks to his past in politics, in the spring of 1807, Mosze ben Szmuel was appointed by the mayor of Warsaw, Paweł Bielinski, to the post of lobbyist for the Warsaw Jewish community council, the Kahal. However, because of this appointment an argument broke out between the mayor and the Kahal heads who did not approve and rejected him. The affair was discussed at the offices of the central authorities and in the end the mayor was forced to retreat from his intention[13]., 121492=Apparently, at certain times, outstandingly friendly relations existed between Jews and Christians, and this is proved by the catastrophic fire in 1875. On 19th March 1875 a fire broke out in some Jewish houses and six hundred families were destitute. In an article it is reported about the great help extended by the Christians in putting the fire out, and also how a group of amateur Polish actors dedicated the earnings from their show towards the damage. Owners of estates in the area offered flour and potatoes[25]. Normal relations also existed between the community and the last landowners in Kutno, the Zawadzkis. In 1891 when the lawyer Zawadzki died, the community laid a wreath of flowers on his grave[26]., 118827=Numbered among the big rich men in the town at this time was the lumber merchant Jacob Erdberg, who had business connections with the land owners and employed many Jewish families. In his will he left 3,000 roubles as a public charity. He died in 1873 and in a letter to \u0093HaMagid\u0094 newspaper his son in law, Fajwisz Weber, wrote that Christian notables from the town and surroundings came to the funeral. His wife Miriam was also very popular in the town.[23], 107239=During the time of the Polish rebellion (1830-1831) it was discovered that a Jew from Kutno, by the name of Szymon Bryn served in the secret Russian police and was a deputy agent of Matias Szlay one of the leading agents in the secret police in Warsaw. Szymon Bryn, or Shymele as he was known in Kutno, studied at the religious seminary in his youth and, since he knew a little Polish, was appointed secretary for the community. On a visit to Warsaw on community business he met Szlay who suggested to him that he should be a spy in Kutno. Szymon agreed and swore an oath that he would be faithful to the police and tell the truth. In reward for his service at first he received 3 red zloty (54 Polish gulden), and later 5 zloty. Apparently he submitted his reports in Yiddish and reported all that he saw and heard in Kutno. But it seems that he did not have anything significant to report. During the uprising the police archives fell into the hands of the rebels and so the name of Szymon Bryn came to light. In the spring of 1831 he was arrested and after interrogation his name was made public as a secret agent. The incident was no small sensation among the Jews of Kutno. Later on the authorities released him and from then on he was under police surveillance[9]., 116053=After Rabbi Lajb left, apparently Kutno remained without a rabbi for two years. However, in the month of Tevet 1860, Rabbi Israel Jehoszua Trunk, the famous genius, formerly rabbi in Pułtusk, was welcomed as rabbi. During the years of the reign of Alexander the Second the legal limitations which had been put on the Jews of Poland were lifted, and on 5th June 1862 a law was declared giving equal rights to Jews. The \u0093Revere\u0094 was cancelled and Jews were allowed to buy land in most of the towns in Poland., 122337=It is very likely that no wreath of flowers was laid on the grave of a young woman from Suwalki who devoted herself to the education of Jewish girls and who, in the same year 1891, killed herself with her own hand. This woman, after teaching at the gymnasium in Vilna arrived in Kutno with the intention of opening a school there for girls. Apparently the townspeople did not support her. Due to a shortage of funds \u0096 so she wrote in her farewell letter \u0096 she was unable to realize her wish. So she put an end to her life by swallowing poison[27]. Who was this woman, a pioneer in the field of education in the town? About this, the article we have does not tell at all., 84235=According to the report, the charter of rights dated 22nd November 1796, given by the King of Poland Stanislaw Augustus to the landlord of Kutno, served as a basis for the special contract (the Pacht Contract \u0096 leasing contract) between the land owner and the Jews. The date is apparently incorrect since Stanislaw Augustus relinquished his throne in 1795. It is likely that before us is a mistake by an illiterate scribe or a forgery., 6308=From the beginning Kutno was a private town, made up of the estates of landowners. In the 16th century it was the private property of the wife of the governor of Rawa Mazowiecka, who according to her personal request, in 1555, was granted by King Sigismund Augustus the right to hold a fair in the town. Undoubtedly, the setting up of a market affected the status of Kutno, but never the less the town remained unimportant, and around the year 1800 the entire population numbered altogether 2,378 souls (Jews and Christians)[4]., 10599=Jews from Kutno could be found in Warsaw during the second half of the same century. As is known, it was forbidden for Jews to live in this city, and only at the time when the Sejm parliament was meeting were they allowed to visit and trade, on condition that they had a \u0093daily pass\u0094 (which was a special permit) and which had to be purchased. Around the year 1784, a Jew from Kutno, Mosze ben Szlomo (Solomonowicz) served as commercial attaché for the Austrian ambassador in Warsaw and enjoyed his protection and exemption from a permit to be in the city[11]., 109045=Following the opening of the Kalisz railway and the Vienna track in 1845, Kutno turned into an important railway junction in the Plock district and also for the district of Kalisz, since these places had been cut off from a direct rail connection with Warsaw., 97276=The community of Kutno was no exception. Their loan was given by the land owner of Kutno. According to the report, in the year 1791 the Kutno community reached an agreement with the town lord \u0096 who was then the governor Gadomski \u0096 by which it had to pay a sum of 3,500 florins interest yearly. His successor, the lord Zantkowski, received as coverage for this sum, the rent from meat slaughtering leases which reached the sum of 2,600 florins a year. In this way, the yearly deficit was 900 florins. However, the Jews claimed to have paid in addition 500 florins, but the accounts were not finalized., 138965=In 1796 more than five percent of the Jewish population was unemployed and lived off charity, and in 1897 this group was only 0.2 percent. From this it can be learnt that the poverty that the Jewish population was sunk into at the end of the 18th century had diminished., 103875=However, the representatives did not accept the stand of the Principalities' authorities and continued their battle against the injustice. During the second half of the month of July, the heads of the Leszno, Poznan, Inowrocław and Kutno community councils met again in Leszno. Mosze Majzler, the Kutno representative, played an important part in this meeting, which attempted to persuade the government how honourable the demands of the Jewish population were[2]. While carrying out these activities, Majzler moved from Kutno to Leszno, where he fulfilled the post of civil representative for the community which was one of the most important in the grand duchy of Warsaw. At the beginning of 1811 an order was given stating that all questions to the government had to be made in Polish, but not one person could be found in Leszno who had reasonable command of the Polish language. The wealthy community, therefore, turned to the head of the community of Kutno, who was not only fluent in the Polish language but also it turned out that as civil representative for the government he was well known for good connections with influential people[3]. The community of Leszno requested Majzler to become their representative at a salary of 8 taler a week and in addition to that he would receive half a percentage on each wedding tax[4]., 136425=It is appropriate to mention the changes that took place in the occupational composition of the Jewish population in Kutno over one hundred years \u0096 1796 to 1897., 2015=May God take revenge!, 139348=Between the years 1897 and 1910 the Jewish population in Kutno grew by 3,900 persons, an increase of 73 percent and was, in that year, 63 percent of the population of Kutno. This growth cannot be attributed solely to natural increase which, at the end of the 19th century and the beginning of the 20th, reached an average of 16 per thousand., 147717=In the elections for the second Duma [parliament] in 1907 a group of Poalei Zion was active in the town., 165493=Copyright ©1999-2014 by JewishGen, Inc. Updated 7 Aug 2010 by LA, 139722=During these thirteen years, therefore, the natural increase was 1 per 100 persons. If this number is added to the number of Jews in 1897, the figure of 6445 is reached, while, in reality, the number of Jews in Kutno was 9,245 people. It turns out that the remaining 2,800 people represent Jews from other places who resided in Kutno., 105379=And so, in January 1812, Mosze Majzler signed, as one of the delegates for the Poznan district, on an agreement stating that the problems of the slaughtering tax and army service would be settled. In exchange for the Jewish representatives agreeing to put the tax up to 3 million zloty, the Jews were exempted from military service[5]. Majzler also continued in this position, also during the exciting years of Napoleon's journey to Russia[6]. After the abolishment of the grand duchy of Warsaw the district of Poznan was annexed to the large grand duchy of Poznan (1815). Then Majzler was heard of for the last time. On 13th August 1815 he gave a patriotic speech in honour of the Prussian king Friedrich Wilhelm and his commissioner in the great grand duchy of Poznan, Prince Anatoly Radziwill. The speech was published and printed (Imrei Shefer, Barcelona, 1815)**, 11230=Another Kutno Jew, Mosze ben Szmuel (Szmulowicz) was an arms supplier during the uprising in the streets of Warsaw (17th April, 1794) at the time of the Kosciuszko uprising and even offered the rebels a contribution \u0096 two horses and a cart[12]., 138139=But it must be taken into account that a certain proportion of craftsmen at the end of the 18th century were engaged at the very same time in trade, especially bars, and actually the percentage of Jews occupied in trade was higher than that recorded. However, even after this reservation, the fact remains that in 1796 more Jews were engaged in craft than a year later., 22134=It is possible to explain this lack of proportion in that the young girls married early and that the relation between boys and girls below the age of 14 was 166:152, while it changes among the older children to 28:13., 146741=The Lithuanians made up a special group; they settled in Kutno after the expulsion from Moscow in 1891. They brought with them the spirit of the metropolis to the quiet atmosphere of the small town and a freer relationship in the religious life. They were large rich merchants and industry magnates who covered the expenses of the community and for this reason were treated tolerantly by the town's people who were not strict regarding their immoral behaviour. Some of them even filled important posts in the community., 113268=In 1863 Handelsman journeyed abroad to look for weapons. There he came into contact with the Jewish agents, Goldsztajn and Kaliszer. On return to Poland he was arrested and sentenced to exile in Siberia. However, Count Graf, the deputy of the Czar, changed his sentence to three months imprisonment in the Dęblin fortress and police surveillance after serving the sentence. We do not know if indeed Handelsman was imprisoned in the fortress, but in any event, after he returned from going abroad, he stood trial again. This time he was sentenced to two years in prison. After serving his time he returned to Kutno; in 1909 he moved to Wloclawek and died there of old age in the year 1911[18]., 109870=Another banker, Szymon Teplic (1822-1894) settled in Kutno after liquidating his business in Warsaw and dealt in supplies for \u0093Konstancja\u0094, and was also partner in the sugar factory belonging to the well known financier Leopold Kronenberg[13]. His grand-daughter Lily converted to Christianity and entered a convent in France. If converts are being discussed, also the Frankensztajn family should be mentioned[14]. Leon Frankensztajn was a merchant in Kutno in the second half of the 18th century. His son Alexander Leon served as an inspector in the tobacco monopoly for the Congress Poland treasury. His grandson, Edward, held an important post at the Russian embassy in Brussels and was elevated to the Russian hereditary aristocracy. He was also known as a gifted violinist[15]., 101512=In negotiations with the grand duchy of Warsaw, the representative of the Jews of Kutno stood out: Head of the council, Mosze ben Jerimyahu Majzler. In 1809 he can be found as civil representative of Warsaw district, who, together with the delegates from Łęczyca and Lutomiersk, he fought for decreasing the burden of tax on kosher meat. This tax was implemented by state law on 25th March, 1809, for the amount of 3,300,000 zloty, and replaces all previous taxes. However this amount was beyond all the paying power of the Jewish population which had become impoverished during the wars. The amount of tax was 84 zloty per family, about four times the load that a family under Austrian rule had borne. All attempts by Majzler were fruitless., 9150=It was also stated in this document that there were 885 books at the disposal of the townsfolk and in the villages, 200 books[7]. The object of this book census, carried out at that time in Poland, was the collection of stamp tax on books which the state treasury imposed on Jews. Thanks to this book tax we know of the existence of a doctor in Kutno, around the year 1775. Stamp tax was collected that year on behalf of six books from this doctor who had a Polish name \u0096 Mark (probably Mordechai)[8]., 69990=This table shows in an outstanding way the assumption concerning the improved economic state of the Jewish village dwellers in contrast to that in the town. First of all, it can be seen that the number of the poor in the town is three times greater than in the village: 9.2:2.3. And is it to be wondered at, that in town, there were various charitable societies enabling a significant number of families lacking means of livelihood to exist? Therefore, in the village not one single person can be found who existed on public funds. The only one was the old tailor who was supported by his son. Also, in the village the number of not wealthy is smaller compared to that in the town 36.9:42.1. There were more rich families in the village than in the town \u0096 almost double: 7.9:4.6, 106521=The rabbi of Kutno, Rabbi Eliezer Brisz, was also connected with Leszno. He came from Leszno and served as rabbi in the \u0093young Synagogue\u0094 in Leszno. In 1820 his name can be found among the signatures on \u0093The Strong Arm\u0094, with the designation: Head of the law court of the Kutno community. Rabbi Eliezer Brisz died in Kutno on 5th Tishri 1830. He was extremely respected among his contemporaries. In a letter from the famous rabbi of Leszno, Rabbi Jakob Lorberbaum, to the citizens of Kutno, he requests them to allocate Rabbi Eliezer Brisz a weekly salary of 5 taler, and he writes about him: \u0093The great light, the sharp-minded, the skilled\u0094[8]., 111129=In the 30's the house owners of Kutno usually sent their children to learn secular subjects in Warsaw, and in the years 1830-1831, the brothers Icchak and Naftali Nelkin could be found at a rabbinical school in Warsaw (which got a name among the orthodox as a nest of unbelievers); at that time they were pupils in the second and third classes[16]., 8739=This corrected figure looks more accurate if it is compared to the number of Jews living there ten years later \u0096 in 1776. In that year an official document stated that there were 200 Jewish families living in the town and a further 187 in the neighbouring villages. If we calculate that, on the average, each family comprised five persons, we get 1,000 people in the town and 935 in the surroundings., 12128=Even tradesmen's' apprentices started to come to Warsaw to try their luck. In the year 1787 the Warsaw Gazette printed the following item about one of them, named Dawid: \u0093Instead of the homeless vagabond thanking the master tailor for his goodness, he stole from him and ran away\u0094[14]., 144591=In comparison with 1910, a peak year for the number of Jews, in all periods the number of Jews in the town grew smaller. In both actual figures and percentages, this was the result of events from the First World War and emigration to countries overseas in the 20th century. Even so, it must not be ignored that the decrease in the percentage of Jews in the town results from an artificial calculation based on administrative inclusion of areas in the town jurisdiction populated by Christians., 54710=The report further notes that since about 1791 the Jews had been feeling more \u0093fortunate\u0094, because at that time the taxes had been reduced and also since the land owner had received large sums of money from rich house owners for the community loans. In that way the community income had grown, as up till then fees from leasing the ritual slaughtering had been used to cover the debts., 143644=And so, throughout the entire 19th century there was an overwhelming majority of Jews in Kutno. In 1857 they comprised two thirds of the whole population, but at the end of the century the situation changed to the advantage of the Poles, and in the 1897 census the percentage of Jews decreased to half (50.7%)., 97887=An interesting detail has come to light \u0096 the Jews took the previous land owner to the law court (the Prussian court) in Torun. In this case, the Jews tried to prove that the land owner forced the agreement on them and that he illegally added further sums to the actual debt. The report notes that it is likely that from the outcome of the trial the land owner returned the rent from meat slaughtering for the whole of the year 1796 to the community., 108571=The economic prosperity of Congress Poland also reached Kutno. The first buds of industry which started blossoming in the last decade of the 18th century flourished well in the twenties of the 19th century[10] and the prayer shawl factory was awarded a silver medal[11] at the industrial fair which was held in Warsaw in the year 1828., 93634=The burial society held an important place in the community and to a certain extent was in competition with the community council itself. At times, the same people headed the two institutions at the same time (in 1808, Mosze Majzler headed the community council and at the same time was the caretaker of the burial society). As mentioned, the income from the ritual bath house was at the disposal of the society, and the society was informed of matters referring to charity, care of the sick, etc. Typical of the competing status of the burial society is a detail in the protocol from the year 1791 that three years previously (that is, in 1787) the poll tax of a village lease holder from Golmbow was reduced following cancellation of a loan of 300 zloty that he had borrowed in order to buy land for the extension of the cemetery. It is characteristic that the guarantee for this loan was the silver finials of the scroll of the Law., 111718=During the years of the Polish rebellion, in 1863, Dr. Josef Handelsman held an important post in the neighbourhood of Kutno, and this interesting personality deserves attention. Josef Handelsman completed his studies at high school in Warsaw in 1833, and in 1859 at the medical school in Petersburg. During the Crimean war he served as a doctor in the military hospital in Warsaw (Ujazdów), and in 1854 settled in Kutno. The young doctor quickly looked for a respected place in the society of the town, and owing to his specialty in brain inflammation diseases, many patients thronged to him and he gained a reputation among both Jews and land owners. When the rebellion broke out Dr. Handelsman was appointed head of the rebels for the whole area of Gostynin. He was very active in the rebellion and urged the Jews to cooperate with the rebels. One of them was Icik, servant of the Kutno merchant Hersz, who collected fees and donations from the Jews of Kutno for the rebels' funds. He collected 150 roubles from the merchant Senator, and from Kronzylber \u0096 120 roubles. It can be assumed that by his influence, feelings of friendship prevailed between the rebels and the Jews in the Kutno area. At the Christmas celebrations a toast was raised towards unity between all the faiths and classes. One of the rebels, by the name of Wiszniewski, was in charge of some craftsmen and among them some Jews; Dr. Handelsman went around the place secretly, tended the wounded in the camps near Gostynin, Łęczyca and Koñsk., 100281=The \u0093Juden-Reglement\u0094 (Jewish regulations) of the year 1797 hurt the Jewish population seriously. With the Prussian single mindedness and methods the police state attempted to destroy the Jewish life style, established for generations. Jews were especially hurt by interference into the internal workings of the communities. By a stroke of luck, this rule only lasted fourteen years., 87203=The community also maintained guest houses. The income was derived from a direct tax which brought in 6,539 florins and also from slaughtering tax, which it is remembered, brought in 3,200 florins in 1796. Together the income in 1796 reached a sum of 9,739 florins. Up to that time the land owner had levied the meat tax himself as compensation for the debt owed to him by the community. He collected 2,600 florins a year and only from 1796 onwards the fees from leased slaughtering went to the community treasury., 12477=Other \u0093wandering\u0094 Jews naturally chose to travel further away from Warsaw and, in 1820, it was possible to find Jews from Kutno at the famous markets then held in Frankfurt, Breslau and Leipzig. In order to pay for their expensive travels they borrowed money from Polish landowners[15]., 114030=His eldest son, the Polish historian, Prof. Marceli Handelsman, was born from his Christian wife, and was brought up from birth as a Christian. In 1944 he was murdered by the nationalist Polish underground N.S.Z. The younger son, Josef, was a high school teacher., 2670=The most ancient documentation of the presence of Jews in Mazowia dates from 1237 and concerns Jews from Plock. Following this, there is a gap of about two hundred years, until the year 1413 when the name of a Jew from Czersk (near Warsaw) appears in one of the documents., 86396=As leaders of the community the following appear in the documents: Szalom ben Meir, a rich textile merchant and lease holder for meat slaughter and butchery has been mentioned many times, Hirsz ben Lajbel[38], bar owner, and Wolf ben Chaim (a free wine merchant \u0093owing to special privileges from the land owner\u0094); also a tailor from the rich group \u0096 Szlomo ben Abraham. The statistics also refer to a synagogue and a religious seminary which were inside wooden buildings. Concerning the brick-built synagogue, whose building was started in 1766 and stopped owing to the difficult economic situation, this was already discussed previously (this synagogue was completed in the year 1799[39])., 142435=This most instructive table represents the growth rate of the Jewish population. In the second half of the 18th century, between the years 1776 and 1796, there was a great increase in the size of the Jewish population which reached 80 percent. And in the period from 1796 until 1808 the number decreased by a quarter. The reason for this happening springs from the Napoleonic wars and the political reverberations in the years 1796-1815. The Christian population in the town also decreased during that time., 12827=The charters of two artisans' guilds were also drawn up at the end of the 18th century (in the two last decades of that century) \u0096 one of the guilds involved was that of tailors, milliners and furriers, which was made official by landowner Gadomski in 1783. The other guild, \u0093the society of butchers\u0094, was certified by the landowner in 1791.[16], 82268=The number of families and occupations liable for tax in town and village together reached 337* [Translator's note: Later twice quoted as 336], and from the account made by the Prussian clerk (apparently \u0096 to be discussed later) the number owing taxes from the town and village population was greater \u0096 428. According to our calculations, the number of Jews reached 1452, from this exempted from tax: (1) elderly men aged 60-80 and (2) women with no age limit: 426 persons; (3) youth under the age of 14: 427 persons; (4) girls with no age limit: 230; (5) male servants younger than 14 years: 5; (6) female servants: 25;, 16234=From the same period \u0096 the last decade of the 18th century \u0096 a very illuminating document has been preserved, from which we are able to learn about the life of the Jewish community. This is a statistical record carried out in 1796 among the Jewish population by the new Prussian authorities in this area, when Kutno was annexed to the kingdom of Prussia, following the second partition of Poland in about 1793. This partition lasted until the year 1807, the year when the grand duchy of Warsaw was declared (1807-1815). This statistical record is fairly accurate and includes several categories.[17], 6909=As noted above, only from the second half of the 18th century do we have documents and historical sources regarding accounts of the Jewish settlement which allow us to paint a fairly clear picture of Jewish life in Kutno. At the beginning of the second half of the 18th century \u0096 in 1753 \u0096 Kutno was beleaguered by fire. The wooden huts quickly went up in flames and the town became a complete ruin. Ten years went by before Kutno was rebuilt. Then, the last Polish king, Stanislaw Augustus Poniatowski, granted count Zamojski permission to restore the town. According to the census of the Jewish population which was carried out in Poland between the years 1765 and 1766, the Jewish community in Kutno amounted to 928 persons, but, it turns out, this total includes Jews living in the nearby townlets, Żychlin and Gostynin[1-5], and also the Jews dwelling in the neighbouring villages. Therefore, how many Jews lived in Kutno alone cannot be determined for certain. The population census does not indicate the true number of this population owing to the feelings of distrust among the Jews towards every government census, whose aim was none other than to increase the tax burden. In his research, Prof. Rafael Mahler notes the conclusion that the population not included in the census reached an average of 20%[6]. From this, the upshot is that the number of Jews in Kutno and surroundings reached 1,115 souls, apart from infants below the age of one year who were not counted. Prof. Mahler estimates them to account for 6.35% of the population. The end result is that the number of Jews living in Kutno and the surrounding villages in the years 1765-1766 reached a total of 2,000 souls., 138530=The number of Jews living off community funds decreased. In 1897 the total number of clerks was no more than 1.5 percent, while in 1796 the number of clerks had reached almost 10 percent of all wage earners. In contrast, in the 19th century the part taken by transport and delivery workers was almost five times greater. Among the servants and female domestic workers no change was recorded \u0096 8.4 and 8.6 percent., 19398=According to official statistics from 1796, the Jewish population of Kutno was 1087 souls., 5529=It can be supposed that Jews arrived in Kutno no later than the second half of the 15th century. In the two neighbouring communities \u0096 Gąbin and Gostynin \u0096 Jews were already dwelling there in the first half of the 16th century.[2] From the middle of the 16th century Polish documents already mentioned names of Jewish merchants from Kutno, although, until the 18th century, most of the sources concerning all aspects of the lives of the Jews in this town are meagre. Interestingly, in 1685, we can find in Amsterdam a printer named Aszer ben Anszel Kutner, whose name without doubt bears witness to his home town[3]., 147271=So, the foundations of the patriarchal society began to shake and new times arrived and with them, new schemes. The new generation got caught up in national and social movements and in 1908 the literary society was founded, affiliated to the centre which is in Petersburg, which opened a library and organized reading evenings with the participation of authors such as Szalom Aleichem (1913), H. D. Nomberg, Hillel Zeitlin, and others., 102288=In his letter to the head of the community council of Poznan, dated 22nd October 1809, he wrote: To hear the reply of the minister of justice, nothing is left but for the mourner to rend his garment to pieces[1]. At the end of October 1809 Majzler attended a meeting of representatives of the Warsaw district communities, where there was a consultation session regarding the steps taken by the government to make changes in the distribution of the kosher meat tax between the various communities and the Warsaw community, in favour of the country towns. The trifling decreases made by the treasury to the Jewish residents in a number of districts (Łomża, Płock, Bydgoszcz) did not satisfy the Jewish delegates and they met once more in Warsaw, in mid July 1810, and paid a fee to have an audience with the prince, the state council and the chancellor. And in the end the chancellor agreed to call a meeting of representatives of the Jewish population in the area of the entire grand duchy, which was held in Warsaw at the end of March 1811. Majzler as present among them, as the representative of Kutno and, together with Eliezer Mosze Efraim from Inowroclaw was received for an interview with the chancellor in the name of the entire assembly. However, all suggestions to lighten the burden of taxes on the Jewish population, and to exempt them from military obligation (arguing that citizens not enjoying equal rights should not have to serve in the army) \u0096 all were rejected by the government., 142964=After the stabilisation of the national situation and the preparation of congress Poland (1815), a period of consistent growth took place which lasted the entire 19th century. In the first quarter (1808-1827) the Jewish population doubled in size and in the second quarter (1827-1857), by more than a third. It was similar for the next forty years (1857-1897)., 91725=The caretaker of the society had to stay overnight in the home of a sick person during the first days of the sickness; after that the society members did it, under the supervision of the monthly manager who summoned the members by little notes. Later on, the burial society also had its own hospital. As already noted, the burial society usually donated money to the poor, widows and also the elderly, caretakers and other lower rank religious staff. Going by the record of 1811, monthly support money amounted to 88 zloty. According to the Prussian document, in 1795-1796, the expenses of the society reached 840 zloty a year. Society income was derived from membership fees, from donations paid into the collection boxes at funerals, from monthly payments made by the members for the poor, from income from the mikveh [ritual bath house] built with money from the society, and also from the sale of burial plots. This last payment was paid according to the financial situation of the deceased. The highest payment made was during the Prussian rule \u0096 180 zloty \u0096 and the lowest was 3 zloty. Of course, funerals were also conducted free of charge. A member of the society did not pay more than 10 zloty even if he was very rich. The subscription fee for the son of a member was also 10 zloty (outsiders paid more); however, this could only be paid after marriage. The salary of the caretaker was paid from income from the ritual bath, from the collection box and an additional 30 zloty a year. From the document, his monthly salary was 300 zloty a year., 143346=The growth rate of the Christian population was almost parallel to that of the Jews, apart for the period 1857-1897 when the growth of the Christian population exceeded that of the Jews, even when the number of Jews grew nearly to thirty percent, the Christians increased by 158 percent., 82906=This gives a total of 1024 persons, leaving a total of 428 persons liable to pay tax (1452 less 1024 = 428)., 25244=So it can be seen from Table No. 2 that the number of married men is equal to that of the married women. The relation between the girls and boys of various ages is 92:68, which is a larger difference than that found in the town. It turns out that the village Jews tried as far as possible to send their daughters out of the village almost exclusively to protect them. Apparently these girls grew up in their relatives' homes in the town. This disproportion is especially marked among youngsters, girls and boys, over the age of 14: 8:5, and can also be explained by the custom of early marriages., 123312=According to a population census carried out in czarist Russia in 1897, 5,345 Jews were living in Kutno \u0096 2,611 men and 2,763 women, and the entire population of the town was 11,250 people. The percentage of Jews, therefore, reached 17.5%., 117102=In connection with these events festive prayers were offered in the synagogue and religious seminary in Kutno. The town Rabbi gave a sermon and Szlomo Icchak Oslowinski the cantor did not spare a special chant for the Czar, his representative in Poland the Grand Prince Constantine, and for the head of the civil administration Marquis Wielopolski, who supported the granting of equal rights to Jews at the price of their assimilation. It was he who persuaded the Czar to publish the ukases from 1862 and 1863[21]., 4973=The oldest document concerning the Jews of Kutno is dated 1513. In the same year, King Sigismund granted an \u0093iron charter\u0094 to three Jews from Kutno, specified in the document by their given names: Mosze, Solomon (Szlomo) and Lewek. This deed authorizes debtors' freedom from payment of their debts for a period of one year although from the date of this document it should not be assumed that Jewish settlement in Kutno was only established from the beginning of the 16th century.[1], 83249=Typical of the Prussian taxation system was the clerk's inability to make do with increasing the number of those liable for tax on paper from 336 to 428, but immediately increased the figure with a new account to 878 people, and, a few lines later, to 1251. According to this, everyone was liable for tax, even infants in the cradle. The impression is credible that the two last figures were personal calculations made by an over-zealous and faithful clerk whose intention was to squeeze the population as much as possible. This assumption is supported by the fact that these calculations were not signed by the regent as was the first reckoning. At all events, it is clear that the Prussian authorities increased the numbers of tax payers in comparison with the first list (the official one) if only that number of tax payers was greater by 27 percent than that in the days of the Polish authorities (428 : 337)., 109315=In 1852 Herman Epsztajn, the well known Jewish industrialist and banker, founded the \u0093Konstancja\u0094 plants \u0096 the largest sugar factories in Congress Poland. After his death the factories passed to his son, Mieczysław Epsztajn who managed them until his death in 1914[12]. His father's enterprise was liquidated after he died. The \u0093Konstancja\u0094 factory served as a source of much related employment for the Jews of Kutno \u0096 transport of raw materials, delivery of sugar to other towns, etc.}",
    "textBeforeTable": "Table 3b: Craft and free professions Ten Jews were occupied in the free professions: 4 barbers (who also served at the same time as wound dressers), 2 wound dressers and two musical instrument makers. If these occupations are included in the larger categories (primary and secondary) the following table is obtained: Therefore, 231 Jews made a livelihood from an occupation which was their main one \u0096 175 were independent workers and 56 were wage earners: assistants, servants, daily staff and messengers. Ten Jews (about 4 percent) were occupied in labour as a secondary job. 231 Total 4 Messenger 6 Daily staff 18 Various assistants 28 Domestic servant 2 Carter 7 Salt refiner 1 Binder 1 Dyer 1 Tanner 1 Belt maker 1 Lace maker 2 Button maker 2 Worker in felt* 3 Candle maker (primary occupation: 2; secondary: 1) 2 Engraver 2 Goldsmith 3 Comb maker 3 Artisan (non specialized) 5 Baker 4 Barber 9 Hat maker (primary occ:7; secondary: 2) 11 Butcher 15 Furrier 26 Shoemaker 74 Tailor (primary occupation) Table No.",
    "textAfterTable": "Liquor, smoking equipment 5     Market stall 21 16 5 Peddler 8     Grain 1     Horse trader 1     Foreign trader 1     Total 111     Four agents should be added to those making a living from trade \u0096 giving a total of 115 persons, that is, 25 percent of the population. As can be seen from the table, not a small number of persons were employed in trade as a secondary occupation \u0096 18% of all the merchants. If we compare these numbers with those occupied in crafts as a secondary job, we will get a relation of 18 : 4 . Therefore, the numbers of those employed in trade as a secondary occupation was 4.5 times greater than those in craft as a secondary occupation. The reason for this is obvious. Persons occupied in crafts have to have knowledge and skill in their special work, whereas vendors in the market or bar tenders in the inn do not need that. Indeed, we find that the bar and market stall owners make up the largest group of those having secondary occupations (14 out of 43). Trade in iron, couriers, and alcoholic drinks such as wine, liqueur and arak, was the monopoly of the land owner and was mostly leased out[23]. Trade in iron was leased out for 1,200",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}