{
    "relation": [
        [
            "3Q 2011 Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            ""
        ],
        [
            "Network Airlines",
            "Continental",
            "United",
            "American",
            "Delta",
            "Alaska",
            "US Airways",
            "6-Carrier Total"
        ],
        [
            "3Q 2010",
            "12.8",
            "13.3",
            "13.3",
            "13.0",
            "13.1",
            "12.6",
            "13.0"
        ],
        [
            "4Q 2010",
            "13.0",
            "13.4",
            "13.5",
            "13.0",
            "12.6",
            "12.7",
            "13.1"
        ],
        [
            "1Q 2011",
            "14.0",
            "13.8",
            "14.0",
            "13.8",
            "12.6",
            "13.8",
            "13.9"
        ],
        [
            "2Q 2011",
            "14.6",
            "14.3",
            "13.9",
            "14.1",
            "13.7",
            "13.8",
            "14.1"
        ],
        [
            "3Q 2011",
            "14.6",
            "14.6",
            "14.2",
            "14.1",
            "13.9",
            "13.6",
            "14.2"
        ],
        [
            "3rd Quarter Passenger Revenue $(Millions)",
            "3,269",
            "4,008",
            "4,816",
            "6,761",
            "842",
            "2,235",
            "21,932"
        ]
    ],
    "pageTitle": "3rd-Quarter 2011 Airline Financial Data: Network Airlines, Low-Cost Airlines and Regional Airlines All Report Profits | Bureau of Transportation Statistics",
    "title": "",
    "url": "http://www.rita.dot.gov/bts/sites/rita.dot.gov.bts/files/press_releases/2012/bts011_12/html/bts011_12.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 679049839,
    "recordOffset": 679014673,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29595=Ranked by 3rd Quarter 2011 Baggage Fee Revenue, 17129=Figure 1: Scheduled Passenger Airline Profit/Loss 1Q 2008-3Q 2011, 40421=Ranked by 3rd Quarter 2011 Reservation Change Fee Revenue, 181631=Ranked by 3rd Quarter 2011 Unit Revenue (Cents per ASM), 20459=The six network carriers posted a profit margin of 7.1 percent in the third quarter with a combined operating profit of $2.2 billion (Table 2).  Compared to last year, in the third quarter of 2010, the network carriers reported a profit margin of 10.5 percent with a profit of $3.0 billion. See Table 1 in third-quarter 2010 press release., 17496=Figure 2: Scheduled Passenger Airline Revenue from Baggage, Reservation Change Fees 1Q 2008-3Q 2011, 18218=BTS, a part of the Research and Innovative Technology Administration, reported that the network airlines reported an operating profit margin of 7.1 percent as a group in the July-to-September 2011 period. The low-cost group's profit margin was 6.0 percent, and the regional groups was 2.5 percent (Table 1). See Airline Financial Data Press Releases for historic data., 68036=Ranked by 3rd Quarter 2011 Ancillary Revenue, 22238=For other third-quarter 2011 financial data with comparisons to previous quarters for carrier groups and for the largest network, low-cost and regional airlines, see the following tables:, 24477=Financial and traffic data are preliminary and include data received by BTS as of Feb. 27. Revised carrier data and late data filings will be made available monthly on TranStats on the Monday following the second Tuesday of the month. Data are subject to revision., 210464=Ranked by 3rd Quarter 2011 Revenue Yield (Cents per RPM), 50689=* 15 carriers reported reservation cancellation fee revenue in 3Q 2011, 17933=Monday, March 12, 2012 - Scheduled passenger airlines reported a profit margin of 6.8 percent in the third quarter of 2011, down from the 10.4 percent profit margin in the third quarter of 2010, BTS reported today in a release of preliminary data (Table 1). , 79610=Ranked by Percent of 3rd Quarter 2011 Operating Revenue from Ancillary Revenue, 18666=As part of their third-quarter revenue, the airlines collected $898 million in baggage fees (Table 1A) and $603 million from reservation change fees (Table 1B) from July to September 2011., 24931=Ranked by 3rd Quarter 2011 Margin, 78840=** 27 carriers reported baggage fee, reservation change fee or miscellaneous operating revenue in 3Q 2011 (the sum of all carriers that reported in any one of the three categories)., 57000=Ranked by 3rd Quarter 2011 Miscellaneous Operating Revenue, 114290=** Mesa Airlines failed to file the 3Q 2011 quarterly financial report, 152753=Ranked by 3rd Quarter 2011 Unit Costs (Cents per ASM), 67474=** 27 carriers reported miscellaneous operating revenue in 3Q 2011, 24167=Airline financial data from the third quarter of 2011 and previous quarters are posted on the BTS website. Data are compiled from quarterly financial and monthly traffic reports filed with BTS by commercial air carriers., 56726=** Fee revenue for airlines reporting either baggage or reservation change fees. 16 airlines reported fees in 3Q 2011., 39871=* 16 carriers reported baggage fee revenue in 3Q 2011, 19017=In addition to baggage and reservation change fees, airlines reported ancillary revenue of $872 million from passengers and from other sources. This revenue category includes revenue from frequent flyer award program mileage sales and pet transportation fees (Table 1D). Total third quarter 2011 airline revenue from all ancillary sources that can be identified, including fees and frequent flyer sales was $2.381 billion, with Delta Air Lines reporting the most, $814 million (Table 1E).  , 114540=Ranked by 3rd Quarter 2011 Fuel Cost per ASM (Cents per ASM)}",
    "lastModified": "Fri, 31 Jul 2015 19:43:39 GMT",
    "textBeforeTable": "Excel | CSV (Operating Profit/Loss as Percent of Total Operating Revenue) Ranked by 3rd Quarter 2011 Margin Table 1: Passenger Airline System* Quarterly Operating Profit/Loss Margin (In Percent) Financial and traffic data are preliminary and include data received by BTS as of Feb. 27. Revised carrier data and late data filings will be made available monthly on TranStats on the Monday following the second Tuesday of the month. Data are subject to revision. Airline financial data from the third quarter of 2011 and previous quarters are posted on the BTS website. Data are compiled from quarterly financial and monthly traffic reports filed with BTS by commercial air carriers. This release consists of domestic and international, or system, financial reports for the airlines. For additional revenue and operating profit/loss numbers, go to the BTS home page and use the links in the Airline Industry box. Reporting Notes For additional fee data, see tables for baggage fees and reservation change fees. For additional Miscellaneous Operating Revenue data, go to BTS Schedule P-1.2. Passenger Revenue Yield Tables 17-20 Unit Revenues Tables 13-16 Unit Costs Tables 9-12 Fuel Costs Tables 5-8 Ancillary Revenue Compared to Total Operating Revenue Table 1F Ancillary Revenue Table 1E Miscellaneous Operating Revenue (frequent flyer award program mileage sales and pet transportation fees) Table 1D Fees Compared to Profit/Loss Table 1C Reservation Change Fees Table 1B Baggage Fees",
    "textAfterTable": "2 American 151.2 148.9 137.2 156.1 152.8 1.1 3 US Airways 131.8 125.5 120.9 134.8 128.8 -2.3 4 Continental 90.5 83.5 76.3 91.3 94.3 4.2 5 United 83.9 73.4 66.2 71.1 74.8 -10.8 6 Alaska 34.4 28.0 36.2 40.3 46.1",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}