{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "join a fraternity",
            "none",
            "great students nice campus enjoy the classes"
        ]
    ],
    "pageTitle": "University at Buffalo (UB) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-at-Buffalo/reviews?_escaped_fragment_=/show/20948",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902546887,
    "recordOffset": 902427842,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{86900=pretty average grades area accepted. around 1200-1700 is the medium i think., 567639=The campuses have emergency telephones dispersed throughout both North and South Campuses, University Police numbers are well known in the event of an emergency and most buildings require swipe access so that only faculty and students can enter. My only critique is that University Police expend too much energy in unjust ticket issuing instead of protecting the well-being of students. This leads to avoidable rape situations as I have witnesses in the Fall of 2013., 586897=Every April, Oozefest is held where players play a game of volleyball except not just any normal game. This game is played in mud and at the end of the game, players are filled form head to toe with mud., 225566=out of 10 stars i give UB 8. Campus is great and so is the diversity, However the university treats its students as if they are just their 8-digit person number. They are making adjustments but it is clear that UB2020 is the major goal of this institution. There is support available, and doing research is always encouraged and recommended. I would consider returning for another undergraduate degree., 267540=Every Parents weekend, which is in the middle of October, UB puts on a carnival with real rides followed by a bonfire and fireworks. It was a lot of fun to hang out with my family and a much needed break from classes. Every year, UB brings well known people to speak in a tradition known as the Distinguished Speaker's Series. Past speakers have included Lance Armstrong, and Bill Nye the Science Guy. Also, Every spring, the entire campus and alumni get fired up for a volleyball tournament known as Ooze Fest. It is basically playing volleyball in a giant mud pit. This will be my first year participating and I am super excited. There are also a lot of concerts and shows which are all free for students., 649245=© 2015, Cappex.com, LLC, 172940=Hm. This is a toughy. One of my favorite things about UB is that there are two big concerts every single year, one each semester. In the fall semester there is FallFest, and in the spring semester SpringFest. The venues are different each semester- one is dedicated to alternative/rock/pop music, while the other is geared toward rap/hip-hop/R&B. And these aren't your everyday bands and artists just getting on the map trying to make it big- most are already established. IE- 2 AM club and the white panda came for fallfest 2011 (check them out, pretty good stuff), and rick ross, tyga, and fabolous came for springfest 2012. Not to mention-free for all UB students and open to the public. No unusual locations I can think of. There are seats and chairs everywhere though- can you sit and enjoy the atmosphere, do some work, or even sleep wherever u want on campus (most of the time). There r fun events in the Student Union most times, so u can just walk in and join in on the fun before or after a class, and Seniors graduating do get to sign a giant metal bull as a class gift before they leave the school., 16683=If you got above a 1450 on the SAT, be sure to apply for the Presidential Scholarship. Otherwise, it doesn't matter because UB will inform you upon acceptance whether or not you qualify for their scholarships.}",
    "textBeforeTable": "07/08/2009 Reviewer is A current student here. 22 out of 23 people found this review useful. 1 person found this inaccurate. 1 of 147 Alyssa from East Aurora, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. University at Buffalo Reviews University at Buffalo › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Am enjoying being here I lived on campus my first year and I absolutely loved it. There are always new people to meet and plenty of activities going on all the time. Am learning a lot The professors are very knowledgeable and easy to get in touch with. Because there are so many students, there are a wide variety of classes to choose from. Login to rate or flag the reviews Emily from Watkins Glen, NY 08/12/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 2 of 147 Categories Comments Great for these types of students Good luck and have fun, University at Buffalo has soooo many wonderful things to offer their students. Tips for prospective students If you are living in residence halls make friends with the people on your floor. If you are off campus living I suggest you join a club.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}