{
    "relation": [
        [
            "What you'll get",
            "Instant access to Building the Serve from the Ground Up",
            "BTS Companion booklet",
            "On Court Exercise Drill sheet",
            "Key Sequential Elements Drill Sheet",
            "1 Swing Evaluation",
            "Total"
        ],
        [
            "Value",
            "$197",
            "$19.95",
            "$9.95",
            "$9.95",
            "$47",
            "$283.85"
        ],
        [
            "What You Pay",
            "$97",
            "$19.95 FREE",
            "$9.95 FREE",
            "$9.95 FREE",
            "$94 FREE",
            "$97"
        ]
    ],
    "pageTitle": "Building Your Serve From the Ground Up",
    "title": "",
    "url": "http://www.essentialtennisinstruction.com/bts_order/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437356939,
    "recordOffset": 437331127,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 02 Nov 2011 07:31:20 GMT",
    "textBeforeTable": "So how much does all this cost? First let’s do a quick review. This is not a book or DVD you see in the bookstore or tennis shop. This is an interactive online course designed to improve your serve from the ground up.  It is not about any other aspect of the game - just your serve.  It’s real simple to do Take a short video of your serve and send it in. We've provided simple step-by-step instructions, along with tutorials and even recommend a digital camera if you don't have one. It takes just a minute or two to shoot the video and less than a minute to upload it. EASY. Once received, I personally review your serve and provide you with structured feedback. That's it! My accountant said I have to have some limit – and 6 months is more than enough!! This is the best way for you to improve your serve, so I want incent you to get working straight away.",
    "textAfterTable": "How is the course structured? This course is unique, interactive, extensive, and all inclusive. If you faithfully practice the targeted drills, and gain a better understanding of the serve from the key sequential elements as well as the extensive articles – I guarantee you will improve. This is not about quick fixes or short cuts. If you are like me, you have already found out those do not work. The Building the Serve (BTS) Cycle is a proven, iterative, step-by-step process. For the best results possible, the course has been structured as follows: Step 1: Assess Your Own Serve This is where you fill out a short form to give me an idea of your experience, playing level, past injuries as well as your strengths and weaknesses as regards racquet speed, spin and placement. You only need to do this once but should definitely not be missed. Step 2: Take a Video & Submit Your Serve for Evaluation Ideally you want to video your serve using two to four swings from three different camera angles. Included are detailed guidelines to ensure you capture the correct angles for optimum results and how to easily send in your video for review. Step 3: Get Structured Feedback I will then use your own self assessment and the video, to personally complete your own Serve Evaluation Form, which directs you to specific and targeted drills, sequential positions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}