{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Love Valley-movies are shown here. We also have a sand volleyball court and new suites for freshman.",
            "Depends on students interests. Gym, rock climping, great library environment, different food places around town, movies, and shopping.",
            "There arre many jobs around this area and the school's career services can help you out also.",
            "Great campus. Close with community. Does not have a pricey tuition."
        ]
    ],
    "pageTitle": "University of West Georgia (UWG) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-West-Georgia/reviews?_escaped_fragment_=/show/19571",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928188763,
    "recordOffset": 928044463,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{593867=Center Pointe is nice. The Oaks are going to be new this upcoming Fall2013 so it'll be clean. All in all, the dorms are nice. The traditional dorms are going under renovations or have gone. If you can, try to get the newer rooms, but consider prices., 395237=Most of the dorms are your typical ones. New dorms are currently being built. They range in the $2000-$3000 a semester., 588644=Every single day at 2:30 pm everyone stops what they're doing & dances, no matter where you are!, 146360=fortunately the university of west georgia are building new and fresh freshman dorms for the incoming freshman of 2012. the dorms are very well kept and stay clean.the residents and residential assistants will make your dorm experience even better !, 383295=APPLY FOR EVERYTHING EARLY!!! And by early, I mean January. Most scholarship deadlines are in February, and housing options fill up so quickly that you won't know what hit you. Apply early., 543928=Every Fall Semester we have a parade for the freshmen class. We march to the flame and light the flame during the parade! There will be two surprises during the parade ;), 92766=The dorms are really nice, they are currently working on renovating and remodeling dorms that will be open during the 2012-2013 school year., 285332=2:30 dance time, you have to stop what your doing and dance any where, you are., 262682=Definitely sign up for orientation. There is a fee but it's so worth it; it's only May and I already have my fall schedule and student ID!, 447920=Each place you live will be different, you might get the crazy roommate or the obnoxious one, and there will always be the drunk loud mouths at 1:30 in the morning., 825092=© 2015, Cappex.com, LLC, 291163=Have not started any classes. Will not start until Fall of 2012. I went on rate my professer. I also asked around and most people say all the professers are very helpful. There is also alot of free tutoring on campus and help.}",
    "textBeforeTable": "11/29/2010 Reviewer is A current student here. 22 out of 25 people found this review useful. 1 of 187 Kelby from Cartersville, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. University of West Georgia Reviews University of West Georgia › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot I seem to learn something new everyday! Whether it's in class or one of the many different clubs or events offered here, the University of West Georgia teaches its students something important everyday. They have an abundance of classes to take depending on your interest and the teachers are extremely helpful and actually want to help! You don't find that at every school. Login to rate or flag the reviews Stephanie from Temple, GA 01/18/2010 Reviewer is A current student here. 21 out of 22 people found this review useful. 2 of 187 Categories Comments Great for these types of students Students that are interested in Sororities/Fraternities because they built a Greek village which has a ton of houses for the different sororities/fraternities. West Georgia has a great nursing program as well. Tips for prospective students As I have stated before, use your time wisely! The biggest change from high school to college is the responsibility. Set a pace for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}