{
    "relation": [
        [
            "Payment method",
            "",
            "Money order/Cashiers cheque"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "ebay template",
    "title": "",
    "url": "http://www.ebay.ca/itm/NEW-EUROPEAN-STYLE-ITALIA-MK-500W-ELECTRIC-SCOOTER-ANY-COLOR-/380863880904?pt=Scooters_Mopeds&hash=item58ad419ec8",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00120-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427700571,
    "recordOffset": 427653724,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45725=New for 2013, the Gio Italia (MK) 500W electric scooter is the perfect European-inspired upgrade to our reliable daily commuter scooters. This beautiful machine takes scooter style to a new dimension, something straight out of the tight streets of Milan, where scooters own the road. Powered by a 500W peak, 350W continuous brushless electric motor, this scooter has beautiful styling to go along with easy, smooth handling and plentiful power. The 48 Volt lead-acid battery system features dual 12AH batteries and will provide 50 kilometres of range on a single charge, great for a run of daily errands or school commute. The new style features six electric metallic-paint color schemes, including neon pink, electric blue, maroon, and jet black. The seat is a beautiful, rich tan leather and the uber-cool front body and headlight design is downright sexy. The smooth Euro lines and eye-pleasing body shape assure a stylish, cool ride..  , 46724=The 32 km/h top-speed is more than enough for getting around town on bike lanes, road shoulders, or pedestrian/bike paths. This full-size scooter can fit any adult or large youth and is simple and easy to use. It features heavy-duty front drum brakes and a rear EABS (Electronic Absorption Braking System) which recharges the battery when braking, extending range. The handlebars feature all the controls you expect out of a scooter, including front and rear brake levers, throttle, turn signals, horn, cruise control, high/low-beam headlights as well as large analog gauges and displays. And new for 2013, a digital LCD heads-up display tells you all the vitals you need to know when cruising around, including speed, batterly level, motor output, odometer and more. The front wheel features a six-spoke alloy wheel with a semi-gloss black finish. .  }",
    "textBeforeTable": "Payment details The seller will not accept returns for this item. Return policy details Return policy multiple provinces. Seller charges sales tax in Estimated sales tax Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 0 items available. Please enter a",
    "textAfterTable": "time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids Approximately: Current bid amount Approximately: + Shipping amount Approximately: Import charges:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}