{
    "relation": [
        [
            "File Type",
            "Developer",
            "Popularity",
            "Category"
        ],
        [
            "TatukGIS Editor Print Template File",
            "TatukGIS",
            "1.5 (2 Votes) Thanks for voting! Rare Uncommon Average Common Very Common",
            "Settings Files"
        ]
    ],
    "pageTitle": "TPL File Extension - Open .TPL Files",
    "title": "",
    "url": "http://fileinfo.com/extension/tpl",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 91431683,
    "recordOffset": 91423481,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "NEW: Open any file on your PC with File Viewer Tweet .TPL File Extension 5 File Associations Z Y X W V U T S R Q P O N M L K J I H G F E D C B A # Tutorial Videos Quiz Questions Software Programs Random Extension Developers Misc Backup Developer Disk Image Compressed Encoded Settings System Font Plugin Web GIS CAD Game Executable Database Spreadsheet Page Layout Camera Raw Vector Image Raster Image 3D Image eBook Video Audio Data Text Common File Types (adsbygoogle = window.adsbygoogle || []).push({}); Help Center",
    "textAfterTable": "File Format Description Template file created by various types of applications; saves the default settings for the page layout, written text, and other information for a document; used for generating documents with a similar style and structure. Example uses of template files include company letterhead templates and drawing templates. Program(s) that open .TPL files Windows Open with the original program that created the template Mac OS Open with the original program that created the template Updated 7/14/2011 Add Info Need to open a .TPL file? Try File Viewer for Windows.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}