{
    "relation": [
        [
            "Site",
            "InFusion",
            "Acme",
            "InFusion",
            "InFusion",
            "Acme"
        ],
        [
            "Product",
            "CRM Application Composer",
            "Payables",
            "Customer Center",
            "Payables",
            "Payables"
        ],
        [
            "User",
            "Hima",
            "Application Administrator",
            "Guillaume",
            "Implementation Consultant",
            "Implementation Consultant"
        ],
        [
            "Highest Available Level",
            "User",
            "User",
            "Product",
            "Site",
            "none"
        ],
        [
            "Active Profile Option Value",
            "Hindi",
            "American English",
            "French",
            "American English",
            "no value"
        ]
    ],
    "pageTitle": "Oracle Fusion Applications Incentive Compensation Implementation Guide",
    "title": "",
    "url": "http://docs.oracle.com/cd/E25178_01/fusionapps.1111/e20381/F354922AN22878.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74514503,
    "recordOffset": 74438638,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{154249=Even when the check box is selected, there are data source nodes that have a date range beyond the tree version's effective date range. For example, if the tree version is effective from Jan-01-2012 to Dec-31-2012, all nodes in the tree version must be effective from Jan-01-2012 to Dec-31-2012 at a minimum. It is acceptable for the nodes to be effective for a date range that extends partly beyond the tree version's effective date range (for example, the node data source value is effective from Dec-01-2011 to Mar-31-2013). It is not acceptable if the nodes are effective for none or only a part of the tree version's effective date range (for example, the node data source value are effective only from Jan-01-2012 to June-30-2012).}",
    "lastModified": "Thu, 20 Sep 2012 17:32:56 GMT",
    "textBeforeTable": "The profile option values for various user session contexts are as follows. Values at the site level take affect for any user unless overridden by a different value set at the more specific levels of product and user. Product level profile option values affect the way applications owned by a particular product code behave. In addition to user level profile option values in applications, selections may be available in the user preferences workspace. Hindi Hima User American English Application Administrator User American English CRM Application Composer Product French Customer Center Product American English InFusion Site Profile Option Value Level Value Level Name and user levels.\" cellspacing=\"0\" cellpadding=\"4\" border=\"1\" width=\"100%\"> option value at that level for language settings at site, product,",
    "textAfterTable": "Note More than one site level value is relevant in an enterprise with multiple tenants using a single instance of Oracle Fusion Applications. Effect of Changes to Profile Option Values Any change you make to a user level profile option has an immediate effect on the way applications run for that session. When you sign in again, changes made to your user level profile options in a previous session are still in effect. When you change profile option value at the product level and no user level values are set, you see the update immediately, but other users may not see the changed value until signing out and back in. When you change a profile option value and the new value affects other users, the change takes effect only when users sign in the next time. Changes to site level profile options take effect for any user session that is started after the setting has been changed. Changes to site or user level profile options do not affect any user sessions that are already in progress when the change is made. Changes to site or user level profile options take effect for any C or PL/SQL processes, such as scheduled jobs, that are launched after the setting has been changed. Profile option changes do not affect C or PL/SQL processes that are already running. Define Flexfields Flexfields: Overview A flexfield is an",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}