{
    "relation": [
        [
            "",
            "Tests",
            "ODIs",
            "T20Is",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "12",
            "15",
            "1",
            "146",
            "133",
            "59"
        ],
        [
            "Inns",
            "23",
            "15",
            "1",
            "",
            "",
            "59"
        ],
        [
            "Balls",
            "2902",
            "784",
            "24",
            "25154",
            "6129",
            "1187"
        ],
        [
            "Runs",
            "1431",
            "705",
            "45",
            "13158",
            "5002",
            "1452"
        ],
        [
            "Wkts",
            "53",
            "15",
            "2",
            "459",
            "180",
            "75"
        ],
        [
            "BBI",
            "6/48",
            "4/32",
            "2/45",
            "8/96",
            "4/25",
            "4/16"
        ],
        [
            "BBM",
            "8/150",
            "4/32",
            "2/45",
            "",
            "4/25",
            "4/16"
        ],
        [
            "Ave",
            "27.00",
            "47.00",
            "22.50",
            "28.66",
            "27.78",
            "19.36"
        ],
        [
            "Econ",
            "2.95",
            "5.39",
            "11.25",
            "3.13",
            "4.89",
            "7.33"
        ],
        [
            "SR",
            "54.7",
            "52.2",
            "12.0",
            "54.8",
            "34.0",
            "15.8"
        ],
        [
            "4w",
            "2",
            "1",
            "0",
            "",
            "6",
            "2"
        ],
        [
            "5w",
            "2",
            "0",
            "0",
            "13",
            "0",
            "0"
        ],
        [
            "10",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Chris Tremlett | England Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/countycricket2010/content/player/21650.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421701095,
    "recordOffset": 421664407,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66029=An impressive start to the 2004 season with Hampshire earned him a call up to England's preliminary squad for the ICC Champions Trophy, and the following year he was named in England's new 25-man development squad, ahead of the 2005 Ashes. He made his one-day debut during the 2005 NatWest Series - and was denied a hat-trick against Bangladesh only because the ball bounced off middle stump without dislodging the bails. Despite his domestic performances tailing off in the second half of the 2005 season and a suspicion that he tended to lose rhythm under pressure, Tremlett earned a call-up to the England squad for Pakistan before a hamstring injury ruled him out. It set the precedent for his international career. After injuries hampered international ambitions in 2006 he was named in the academy to be based in Perth during that winter's Ashes series, and was asked to join the squad for the subsequent one-day series. Though a surprising success for England it was a forgettable series for Tremlett, ended by another injury setback, which then delayed the start to his 2007 season. However, once back on the field he impressed enough to earn a call to the England Lions squad and was handed his Test debut against India at Lord's. Troubling the much-vaunted Indian batting line-up with uncomfortable bounce and lively pace, he looked set to be a key man as England looked to forge a new attack after the 2005 generation. Instead injury struck once more., 71854=Jun 24, 2014, 67984=In truth, his recall for the 2013/14 Ashes was one based more upon his pedigree in Australia than his unremarkable county form. Tremlett swiftly disappeared from the England recokoning, and no one could dispute that he was markedly down on pace from 2010/11. Surrey's battery of fast bowlers suited Tremlett, meaning that he did not need to risk further injury by playing every game. He was generally economical and occasionally incisive, taking five wickets in seven overs to inspire a turnaround victory against Gloucestershire in May 2014. His batting was also much improved: Tremlett came within ten runs of a maiden first-class hundred against Leicestershire, playing with a maturity and calmness his batting had previously lacked., 67534=After missing the 2007-08 winter tours he was included in England's ODI squad to face Scotland but a heel injury ended his hopes. After a frustrating 2009 season, where he played seven Championship matches, he left Hampshire for Surrey. It was a move that worked wonders and, after taking 48 Championship wickets, he earned a recall for the Ashes tour, that established his reputation as a high-class quick., 93662=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average, 65537=Tremlett comes from an esteemed cricketing family. He is the son of Tim Tremlett, the former Hampshire seamer, and the grandson of Maurice, who played for Somerset and England in the 1940s and 50s. He took a wicket with his first ball of first-class cricket, against New Zealand A in 2000 and after impressing for Hampshire made the England Under-19 tour of India in 2000-01, and a place in the first batch of Rod Marsh's academy intakes in 2001-02., 73547=Nov 21, 2013, 72731=Nov 23, 2013, 64927=An outstanding home series the following summer against Sri Lanka led to comparisons with Joel Garner but, having broken into the top ten rankings, a back injury ruled him out of three Tests against India in 2011. Though he played a Test in UAE against Pakistan the following winter he was not fully fit and had surgery to remedy his back problems soon after. Many believed that would be the end of his international career but he returned to play the first Test of England's unhappy Ashes tour in 2013-14, passing 50 Test wickets more than six years after his debut., 74655=NBC Denis Compton Award 2000, 74716=NBC Denis Compton Award 2001, 89572=4391 runs after 35, and 2354 outside top five, 64587=He is part of the strong pack of fast bowlers that have led England to the top of the world rankings and in 2010-11, after four years out of the Test side, Tremlett starred in England's series win in Australia taking 17 at 23.35, which included the Ashes-winning wicket to end 24 years of waiting., 74076=Chris Tremlett picked up his first Test wicket since July 2011, 85929=Numbers Game: Since 2009, teams batting first have a win-loss ratio which is 61% higher than it was between 2000 and 2008, 35048=Born September 2, 1981, Southampton, Hampshire}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "0 4 3 5 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 Tests 12 23 2902 1431 53 6/48 8/150 27.00 2.95 54.7 2 2 0 ODIs 15 15 784 705 15 4/32 4/32 47.00 5.39 52.2 1 0 0 T20Is 1 1 24 45 2 2/45 2/45 22.50 11.25 12.0 0 0 0 First-class 146 25154 13158 459 8/96 28.66 3.13 54.8 13 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}