{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "",
            "Pirates of the Caribbean: At World's End",
            "Knocked Up",
            "Shrek The Third",
            "Mr Brooks",
            "Spider-Man 3",
            "Waitress",
            "Gracie",
            "Bug",
            "28 Weeks Later",
            "Disturbia"
        ],
        [
            "This Week",
            "$43,188,000",
            "$29,284,000",
            "$26,704,000",
            "$10,020,000",
            "$7,500,000",
            "$2,025,000",
            "$1,363,000",
            "$1,220,000",
            "$1,200,000",
            "$1,127,000"
        ],
        [
            "%",
            "-62.4",
            "-",
            "-49.7%",
            "-",
            "-47.7%",
            "-34.2%",
            "-",
            "-62.4%",
            "-52.8%",
            "-41.7%"
        ],
        [
            "Last",
            "1",
            "-",
            "3",
            "-",
            "5",
            "5",
            "-",
            "2",
            "4",
            "8"
        ]
    ],
    "pageTitle": "Knocked Up Can't Knock Off Pirates | Movie News | Empire",
    "title": "",
    "url": "http://www.empireonline.com/news/story.asp?nid=20761",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420320387,
    "recordOffset": 420303233,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57016=Posted by Suzy R at 00:08 on 05 June 2007 | Report This Post, 54750=Posted by Lydia_H at 19:44 on 06 June 2007 | Report This Post, 56010=Posted by furrybastard at 02:04 on 05 June 2007 | Report This Post}",
    "textBeforeTable": "There was a David and Goliath battle at the US box office this weekend. In the giant corner we had the mighty, but mediocre, third in the Pirates of the Caribbean franchise; fighting for the little guy (ok, it’s still a studio movie, but it cost about 8p to make, so qualifies as little) was Knocked Up, a superb comedy from the team behind The 40 Year Old Virgin. The battle didn’t quite go Knocked Up’s way, but it can at least claim the moral victory. Pirates hauled in another $43.2million over the weekend, to bring its total $216.5million in two weeks. Again, these are big numbers but the total is considerably down on Dead Man’s Chest, which was at $258million at the same point last year. Knocked Up’s $29.3million may look a bit puny in comparison to that, but a $29.3million opening weekend for a movie without any real movie stars and a comedy at that, is very good indeed. The movie could boast at least one victory over Pirates. Opening on considerably less screens, Knocked Up boasted the higher screen average. So, in summary: Yay, Knocked Up; slightly oh dear, Pirates; well done US cinemagoers. The rest of the top ten, where nothing else much of consequence happened, looks like this:",
    "textAfterTable": "Have Your Say To comment on this, and all articles, register for free or login now. World Exclusive: The New Wall-E Trailer This kicks shiny metal butt! Jack Black Signs For Year One With Harold Ramis and Judd Apatow Your Comments RE: RE: I went to see Knocked Up last night, the cinema was packed full and it started at 2230! The film starts well enough and made me laugh regularly, but the second half is a real, dull slog, I was bored out of my mind",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}