{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2"
        ],
        [
            "Command or Action",
            "Server# scope bios",
            "Server /bios # show detail"
        ],
        [
            "Purpose",
            "Enters the BIOS command mode.",
            "Displays details of the BIOS status."
        ]
    ],
    "pageTitle": "Cisco UCS C-Series Servers Integrated Management Controller CLI Configuration Guide, Release 1.4 - Managing the Server [Cisco Integrated Management Controller] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/ucs/c/sw/cli/config/guide/1-4-1/b_Cisco_UCS_C-Series_CLI_Configuration_Guide_141/b_Cisco_UCS_C-Series_CLI_Configuration_Guide_141_chapter_011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 358825887,
    "recordOffset": 358801960,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Procedure You must log in with user or admin privileges to perform this task. Before You Begin Toggling the Locator LED Configuring BIOS Settings Managing the Flexible Flash Controller Configuring Power Policies Managing Server Power Shutting Down the Server Resetting the Server Managing the Server Boot Order Toggling the Locator LED for a Hard Drive Toggling the Locator LED This chapter includes the following sections: Managing the Server Restoring BIOS Defaults Configuring Server Management BIOS Settings Configuring Advanced BIOS Settings Configuring Main BIOS Settings Viewing BIOS Status Configuring BIOS Settings Resetting the Flexible Flash Controller Booting from the Flexible Flash Configuring the Flexible Flash Controller Properties Cisco Flexible Flash Managing the Flexible Flash Controller Configuring the Power Restore Policy Configuring the Power Cap Policy Power Capping Policy Viewing the Power Statistics Configuring Power Policies",
    "textAfterTable": "Step 3 Server /chassis # commit   Commits the transaction to the system configuration.   This example disables the chassis locator LED and commits the transaction: Server# scope chassis Server /chassis # set locator-led off Server /chassis *# commit Server /chassis # Toggling the Locator LED for a Hard Drive Before You Begin You must log in with user or admin privileges to perform this task. Procedure   Command or Action Purpose Step 1 Server # scope chassis   Enters chassis command mode.   Step 2 Server/chassis # scope hdd   Enters hard disk drive (HDD) command mode.   Step 3 Server /chassis/hdd # set locateHDD drivenum {1 | 2}  Where drivenum is the number of the hard drive whose locator LED you want to set. A value of 1 turns the LED on while a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}