{
    "relation": [
        [
            "Property",
            "Default Value",
            "Range of Values"
        ],
        [
            "Description",
            "HS_TRANSACTION_LOG",
            "Any valid table name"
        ]
    ],
    "pageTitle": "Initialization Parameters",
    "title": "",
    "url": "http://docs.oracle.com/cd/E18283_01/gateways.112/e12069/apd.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76437335,
    "recordOffset": 76415737,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 14 Aug 2010 15:00:30 GMT",
    "textBeforeTable": "HS_FDS_TRANSACTION_LOG DEBUG enables the tracing of detailed error messages that can be used for debugging. ON enables the tracing of error messages that occur when you encounter problems. The results are written by default to a gateway log file in LOG directory where the gateway is installed. OFF disables the tracing of error messages. The following values are valid: Specifies whether error tracing is turned on or off for gateway connectivity. OFF, ON, DEBUG Range of values OFF Default Value Description Property HS_FDS_TRACE_LEVEL Work in the sequential mode of Heterogeneous Services Change the syntax of the procedure execute statement for all existing stored procedures, to handle result sets Note: If you set this initialization parameter, you must do the following: Enables result sets to be returned from stored procedures. By default, all stored procedures do not",
    "textAfterTable": "Specifies the name of the table created in the non-Oracle system for logging transactions. For more information about the transaction model, see the HS_TRANSACTION_MODEL parameter. HS_FDS_FETCH_ROWS Property Description Default Value 100 Range of Values Any integer between 1 and 1000 Syntax HS_FDS_FETCH_ROWS=num HS_FDS_FETCH_ROWS specifies the fetch array size. This is the number of rows to be fetched from the non-Oracle database and to return to Oracle database at one time. This parameter will be affected by the HS_RPC_FETCH_SIZE and HS_RPC_FETCH_REBLOCKING parameters. HS_IDLE_TIMEOUT Property Description Default Value 0 (no timeout)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}