{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Japanese News",
            "NBC Today",
            "Good Morning America",
            "Home Shopping"
        ],
        [
            "Time",
            "5 am - 6 am",
            "5:40 am - 6:15 am",
            "4 am - 6 am",
            "4:30 am - 6 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/11/17/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 720302535,
    "recordOffset": 720231590,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121844=November 17: As the weather turns warmer get ready for an evening of Australian rock under the stars., 124775=Jan 4, 5: Popular South West fest back with Boy and Bear and Coolio., 261819=November 16 2012, 120824=November 17: One of the world's biggest bands graces new venue., 122906=November 17: Washington has announced a second show after a sell-out first round of events.., 125648=January 6: Summadayze is heading back to Perth, with the Chemical Brothers, Mark Ronson and Kimbra., 123798=November 17: The festival is just around the corner and the focus is now firmly on fine food and music., 171731=The future is so bright for Georgia May Jagger she has to wear shades., 248760=The Old Guy, Nov 16, 2012, 9:38PM, 249707=Rick, Nov 16, 2012, 9:25PM, 100327=Start your training for Run Melbourne 2013, to be held on Sunday, July 21.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: A creepy morality tale of corruption in local government, this series makes the shenanigans in Rats in the Ranks seem innocent and naive. Blackout: season final What's on TV Tonight What happens to Amsterdam's prostitutes when they age? What's on - Friday BIFF Challenges of parenthood form cornerstone of stage show. Standing up to trials of fatherhood Dave Hughes Write your BIFF film reviews - in 140 characters or fewer. Tweet us your opinion Film",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}