{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Well I am in their band so i really don't have time to actually go to all the events Southern has every now and then, but they are always having pageants, dances, and even movie night. Southern is a great place to be to meet new people from all around the world. It is really a great place to be.",
            "The food is great, i love having different choices to eat all the time, and Louisiana cooking is amazing.",
            "The dorms are roomy, very comfortable, and if you get home sick you can always organize the room the way you want it. You have a room mate that shares a room with you, and you never know who you might meet, maybe they even will become your best friend.",
            "Southern has the best Nursing program, and Honors College. We are always recognized for all our academic success and we also recently got a reward for being the best HBCU school!",
            "Be productive with your time!",
            "Southern University is a great school, full of different opportunities and so much more. The teachers are great and help you any way they can to make sure you understand what the class is about and the work they have assigned you to. Its a place where you can meet new people from everywhere, and it is also a great place to start a great path for your future."
        ]
    ],
    "pageTitle": "Southern University and A & M College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southern-University-and-A-M-College/reviews?_escaped_fragment_=/show/29262",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043060830.93/warc/CC-MAIN-20150728002420-00282-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898928499,
    "recordOffset": 898882070,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{202574=© 2015, Cappex.com, LLC, 57440=Just like a creole home, Southern offers wonderful food from the Cajun perspective., 127842=I would rate Southern University and A&M College a 9. I became a student in 2008, where I met students and teachers alike who were caring and uplifting. Southern University has taught me so much, I am sure that I am prepared for my future., 76880=I don't know of any yet. I will be an incoming freshman, come Fall 2012.}",
    "textBeforeTable": "07/28/2009 Reviewer is A current student here. 25 out of 26 people found this review useful. 1 of 52 Cassie from Greensburg, LA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "Categories Comments Great for these types of students SU is great for students seeking independence, assets that will prepare them for the professional world, students who seek great education quality, African Americans, students seeking degree in law-wonderful law school, and students who want to explore something different. Tips for prospective students Be prompt! Attend class-attendance is everything! Focus! Ask for help-it's one thing to be ignorant, it's another to remain ignorant, never be too prideful to ask for help, ask questions, it benefits you, and you may help someone else by doing so. Bang for the buck Get your money's worth. Some students may get frustrated and overwhelmed with college, but if you actually do the math, you're being paid to go to college and in the end you'll be the one getting paid for your skills acquired from college. Don't waste time, a lazy hand is for a poor man, a diligent hand holds wealth. Am enjoying being here I enjoy SU! Its a very comfortable environment, like home. There are special events like homecoming and the never ending parties, but if you're not comforable there are also more relaxing places like the library or the bluff. Am learning",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}