{
    "relation": [
        [
            "Simple Present Tense",
            "knit",
            "pat",
            "try",
            "hurry"
        ],
        [
            "Add:",
            "-ed",
            "-ed",
            "-ed",
            "-ed"
        ],
        [
            "Spell:",
            "knitted",
            "patted",
            "tried",
            "hurried"
        ]
    ],
    "pageTitle": "English Arts - The Principal Parts of Verbs",
    "title": "",
    "url": "http://www.hsunlimited.com/english-lessons/topic/principal-parts-of-verbs.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 515543157,
    "recordOffset": 515534955,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The past participle is put together with the helping verbs have, has, or had to make the three perfect tenses.              present perfect (I have clapped)              past perfect (I had clapped)              future perfect (I will have clapped) The past and past participle forms of most verbs are the same. You can see this in the chart above. These are the regular verbs. In all regular verbs, the past and past participle are made by adding \u0096d or \u0096ed to the simple present verb. climbed climbed climb added added add jumped jumped jump talked talked talk Principal Past Participle (same as simple past tense) Principal Past Tense (same as simple past tense) Principal Present Tense (same as simple present tense) The Principal Parts of Verbs Every verb has three main parts. These are called principal parts of the",
    "textAfterTable": "knit -ed knitted pat -ed patted try -ed tried hurry -ed hurried   Some verbs change their spelling this way: Simple Present Tense Add: Spell: say -d said pay -d paid lay -d laid Exercise: These are regular verbs. Change the verb forms if necessary and write the verbs in the correct columns.                                                                                                                                                                                                                  worry help pay end",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}