{
    "relation": [
        [
            "Test Case",
            "Simple",
            "",
            "Splitting",
            "",
            "Many lines",
            "",
            "",
            "Formatting",
            "",
            "Variables",
            ""
        ],
        [
            "Action",
            "[Documentation]",
            "No Operation",
            "[Documentation]",
            "No Operation",
            "[Documentation]",
            "...",
            "No Operation",
            "[Documentation]",
            "No Operation",
            "[Documentation]",
            "No Operation"
        ],
        [
            "Argument",
            "Simple documentation",
            "",
            "This documentation is a bit longer and",
            "",
            "Here we have",
            "an automatic newline",
            "",
            "*This is bold*, _this italic_ and",
            "",
            "Executed at ${HOST} by ${USER}",
            ""
        ],
        [
            "Argument",
            "",
            "",
            "it has been split into several columns.",
            "",
            "",
            "",
            "",
            "here is a link: http://robotframework.org",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Robot Framework User Guide",
    "title": "Test case documentation examples",
    "url": "http://robotframework.googlecode.com/hg/doc/userguide/RobotFrameworkUserGuide.html?r=2.7",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 201337487,
    "recordOffset": 201175310,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{838882=Generated on: 2012-03-14 13:12 UTC., 525702=Times must be given as timestamps in the format YYYY-MM-DD hh:mm:ss.mil, where all separators are optional and the parts from milliseconds to hours can be omitted. For example, 2008-06-11 17:59:20.495 is equivalent both to 20080611-175920.495 and 20080611175920495, and also mere 20080611 would work.}",
    "textBeforeTable": "In HTML files, the test data is defined in separate tables (see the example below). Robot Framework recognizes these test data tables based on the text in their first cell. Everything outside recognized tables is ignored. HTML format Different test data templates are available for HTML and TSV formats to make it easier to get started writing tests. Robot Framework test data is defined in tabular format, using either the hypertext markup language (HTML), tab-separated values (TSV), plain text, or reStructuredText (reST) formats. Robot Framework selects a parser for the test data based on the file extension. The extension is case-insensitive, and the recognized extensions are .html, .htm and .xhtml for HTML, .tsv for TSV, .txt for plain text, and .rst or .rest for reStructuredText. 2.1.2   Supported file formats Variable files to provide more flexible ways to create variables than resource files. Resource files with variables and higher-level user keywords. Test libraries containing the lowest-level keywords. In addition to this, there are: Test suite directories can have a special initialization file. A test suite directory can also contain other test suite directories, and this hierarchical structure can be as deeply nested as needed. A directory containing test case files forms a higher-level test suite. Such",
    "textAfterTable": "Log ${MESSAGE}   My Keyword /tmp         Another Test Should Be Equal ${MESSAGE} Hello, world! Keyword Action Argument Argument My Keyword [Arguments] ${path}   Directory Should Exist ${path}   Editing test data Test data in HTML files can be edited with whichever editor you prefer, but a graphic editor, where you can actually see the tables, is recommended. There is also a tool called RIDE available that is designed for editing the test data. Encoding and entity references HTML entity references (for example, &auml;) are supported. Additionally, any encoding can be used, assuming that it is specified in the data file. Normal HTML files must use the META element as in the example below:  <meta http-equiv=\"Content-Type\" content=\"text/html; charset=UTF-8\"> XHTML files should use the XML preamble as in this example:  <?xml version=\"1.0\" encoding=\"Big5\"?> If no encoding is specified, Robot Framework uses ISO-8859-1 by default. TSV format The TSV format can be used in Robot Framework's test data for all the same purposes as HTML. In a TSV file, all the data is in one large table.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}