{
    "relation": [
        [
            "Regulatory Area",
            "2C--Except Sitka Sound, and Ketchikan and Juneau non-subsistence marine waters areas",
            "",
            "",
            "",
            "2C--Sitka Sound",
            "",
            "",
            "",
            "",
            "",
            "2C--Ketchikan and Juneau non-subsistence marine waters areas",
            "",
            "",
            "",
            "3A--Including Chiniak Bay, but excluding Anchorage-Matsu-Kenai and Valdez non-subsistence marine waters areas",
            "",
            "",
            "",
            "3A--Anchorage-Matsu-Kenai and Valdez non-subsistence marine waters areas",
            "",
            "",
            "",
            "3B",
            "4A and 4B",
            "4C, 4D, and 4E"
        ],
        [
            "Permit Type",
            "SHARC",
            "Ceremonial Permit",
            "Educational Permit",
            "Community Harvest Permit",
            "SHARC",
            "",
            "Ceremonial Permit",
            "",
            "Educational Permit",
            "Community Harvest Permit",
            "SHARC",
            "Ceremonial Permit",
            "Educational Permit",
            "Community Harvest Permit",
            "SHARC",
            "Ceremonial Permit",
            "Educational Permit",
            "Community Harvest Permit",
            "SHARC",
            "Ceremonial Permit",
            "Educational Permit",
            "Community Harvest Permit",
            "SHARC",
            "SHARC",
            "SHARC"
        ],
        [
            "Retention Limits",
            "20 halibut per day per vessel and in possession",
            "25 halibut per permit",
            "25 halibut per permit",
            "no daily or possession limit",
            "September 1 through May 31: 10 halibut per day per vessel and in possession",
            "June 1 through August 31: 5 halibut per day per vessel and in possession",
            "September 1 through May 31: 25 halibut per permit",
            "June 1 through August 31: fishing under Ceremonial Permit not allowed",
            "25 halibut per permit",
            "fishing under Community Harvest Permit not allowed",
            "general subsistence halibut fishing not allowed",
            "25 halibut per permit",
            "25 halibut per permit",
            "fishing under Community Harvest Permit not allowed",
            "20 halibut per person per day and in possession",
            "25 halibut per permit",
            "25 halibut per permit",
            "no daily or possession limit",
            "general subsistence halibut fishing not allowed",
            "25 halibut per permit",
            "25 halibut per permit",
            "fishing under Community Harvest Permit not allowed",
            "20 halibut per person per day and in possession",
            "20 halibut per person per day; no possession limit",
            "no daily or possession limit"
        ]
    ],
    "pageTitle": "eCFR — Code of Federal Regulations",
    "title": "",
    "url": "http://www.ecfr.gov/cgi-bin/text-idx?node=50:11.0.2.11.1&rgn=div5",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 425476719,
    "recordOffset": 425296051,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{743826=Source: 69 FR 31535, June 4, 2004, unless otherwise noted., 926947=(8) Persons having access to confidential information may be subject to criminal and civil penalties for unauthorized use or disclosure of confidential information. See 18 U.S.C. 1905, 16 U.S.C. 1857, and NOAA/NMFS internal procedures, including NAO 216-100., 663787=[61 FR 35550, July 5, 1996. Redesignated at 72 FR 48510, Aug. 23, 2007], 31091=Source: 61 FR 35550, July 5, 1996, unless otherwise noted., 392785=(ii) Notwithstanding paragraphs (e)(4) and (e)(4)(i) of this section, halibut harvested outside Sitka Sound, as defined in paragraph (e)(1)(ii) of this section, may be retained onboard a charter vessel engaged in sport fishing, as defined in §300.61, for other species within Sitka Sound, as defined in paragraph (e)(1)(ii) of this section, from June 1 through August 31., 207579=(C) For each week or portion thereof that the vessel is in the exclusive economic zone of New Zealand, a report that covers the period from 12:01 a.m. on Monday to 12 midnight on the following Sunday must be submitted and received by noon of the following Wednesday (local time). The report must include the amount of the catch taken in the exclusive economic zone of New Zealand during the reporting period., 543403=[78 FR 75890, Dec. 12, 2013], 955551=(e) Observer coverage. (1) Until 24:00 UTC on December 31, 2014, a fishing vessel of the United States may not be used to fish with purse seine gear in the Convention Area without a WCPFC observer on board. This requirement does not apply to fishing trips that meet either of the following conditions:, 95189=[61 FR 35550, July 5, 1996, as amended at 74 FR 1620, Jan. 13, 2009], 167952=(i) If the expression of interest is for a vessel for which, as of the June 1st due date for submitting such expression of interest, NMFS has issued an application approval for the licensing period that starts that year (i.e., a renewal of the license is being sought), the expression of interest shall include:, 381161=(D) Information entered for each GAF caught and retained. The GAF permit holder must enter the following information for each charter vessel fishing trip in which GAF were retained under the authorization of the permit holder's GAF permit into the NMFS-approved electronic reporting system (see paragraphs (d)(4)(iii)(D)(1) through (9) of this section) by 11:59 p.m. (Alaska local time) on the last day of a charter fishing trip in which a charter vessel angler retained GAF:, 181168=(D) In the event that two or more vessels receive the same sum number of points under paragraphs (k)(4)(ii)(A) through (k)(4)(ii)(C) of this section, priority will be given to the vessel from which the greatest amount of fish, by weight, was landed or transshipped in United States ports, including ports located in any of the States, starting in calendar year 1988 and ending in the year prior to the year in which the applied-for licensing period starts, as determined by the Regional Administrator. In the event that that does not resolve the tie, priority will be given by lottery, which will be conducted by the Regional Administrator., 186910=(i) If there are any outstanding expressions of interest received by June 1st of the year preceding the year in which the licensing period begins or outstanding complete applications received by February 5th of the year in which the licensing period begins, NMFS will review all such outstanding expressions of interest and complete applications and pre-approve and approve applications for that license from among that pool as follows:, 726991=(2) The report must be faxed to (301) 713-2313 within 5 calendar days of receipt of the Russian permit., 859420=Pacific Islands Regional Administrator means the Regional Administrator, Pacific Islands Region, NMFS, 1845 Wasp Blvd., Bldg. 176, Honolulu, HI 96818, or a designee., 662890=[68 FR 23228, May 1, 2003. Redesignated and amended at 72 FR 48510, 48511, Aug. 23, 2007; 75 FR 18112, Apr. 9, 2010], 116703=(h) Pacific bluefin tuna commercial catch limits in the eastern Pacific Ocean for 2015-2016. The following is applicable to the U.S. commercial fishery for Pacific bluefin tuna in the Convention Area in the years 2015 and 2016., 184979=(B) No later than June 25th of the year in which the licensing period begins, NMFS will notify all such outstanding applicants of the pre-approvals, and for those applicants that submitted expressions of interest but not complete applications, also notify them of the date by which a complete application must be received in order to be issued an application approval (which will be calculated by NMFS to be no later than 194 days from the date of mailing of the notification of the pre-approval);, 178407=(4) Except as provided in paragraph (n) of this section, no later than July 16th of each year, NMFS will pre-approve applications from among the expressions of interest and complete applications that were received by June 1st of the current year for the licensing period that starts the following year as provided in this paragraph. If the number of expressions of interest and complete applications does not exceed the number of licenses available, all applications that meet the requirements of paragraphs (h)(4) and (h)(5) of this section and that satisfy the relevant requirements for licensing under the Act and this subpart will be pre-approved. If the number of expressions of interest and complete applications exceeds the number of licenses available, those that meet the requirements of paragraphs (h)(4) and (h)(5) of this section and that satisfy the relevant requirements for licensing under the Act and this subpart will be prioritized for pre-approval as follows:, 36892=NMFS Headquarters means NMFS, 1315 East-West Highway, Silver Spring, MD 20910. Attention: Office of International Affairs., 730794=(c) Protection of marine mammals. U.S. nationals and vessels fishing for Russian fishery resources may not harass, hunt, capture, or kill any marine mammal within the Russian EZ, attempt to do so, except as may be provided for by an international agreement to which both the United States and Russia are parties, or in accordance with specific authorization and controls established by the Russian Federation. The provisions of the Marine Mammal Protection Act (MMPA), 16 U.S.C. 1361 et seq. also apply to any person or vessel subject to the jurisdiction of the United States while in the Russian EZ, and it shall not be a defense to any violation of the MMPA that the person or vessel was acting in accordance with any permit or authorization issued by the Russian Federation., 167387=(4) Except as provided in paragraph (n) of this section, in order to obtain a pre-approval for a given licensing period, either an expression of interest or a complete application must be submitted to and received by the Regional Administrator no later than June 1st of the year preceding the year in which the licensing period begins., 109513=(i) From 0000 hours UTC on July 29 to 2400 hours UTC on September 28, or, 485402=(2) Application. An Alaska Native tribe may apply for a Ceremonial or Educational Permit by submitting an application to the Alaska Region, NMFS. Applications must be mailed to: Restricted Access Management Program, NMFS, Alaska Region, P.O. Box 21668, Juneau, AK 99802-1668., 607818=(b) An individual subject to these regulations intending to develop a new fishery shall notify the Assistant Administrator no later than July 1 of the year in which he or she intends to initiate the fishery and shall not initiate the fishery pending CCAMLR review., 65581=[64 FR 15, Jan. 4, 1999, as amended at 67 FR 64312, Oct. 18, 2002; 74 FR 65479, Dec. 10, 2009], 51506=International conservation and management measures means measures to conserve or manage one or more species of living marine resources that are adopted and applied in accordance with the relevant rules of international law, as reflected in the 1982 United Nations Convention on the Law of the Sea, and that are recognized by the United States., 746507=The “vessel list” is the list of U.S. vessels that are authorized to fish under the Treaty as amended in 2002. Only a vessel on the list for at least 7 days may engage in fishing in Canadian waters under the Treaty as amended in 2002. The owner of any U.S. vessel that wishes to be eligible to fish for albacore tuna under the Treaty as amended in 2002 must provide the Regional Administrator or his designee with the vessel name, the owner's name and address, phone number where the owner can be reached, the USCG documentation number (or state registration number if not documented), and vessel operator (if different from the owner) and his or her address and phone number. On the date that NMFS receives a request that includes all the required information, NMFS will place the vessel on the annual vessel list. NMFS will notify fishermen by a confirmation letter or email of the date the vessel was placed on the list. Because the vessel list will revert to zero vessels on December 31 of each year, the required information must be provided in the manner specified on an annual basis., 182634=(iii) The complete application was received by February 5th of the same year; and, 975216=[78 FR 58246, Sept. 23, 2013, as amended at 79 FR 64111, Oct. 28, 2014; 80 FR 43636, July 23, 2015], 33113=Assistant Administrator means the Assistant Administrator for Fisheries, National Oceanic and Atmospheric Administration, Department of Commerce, or a designee. Address: Room 14555, 1315 East-West Highway, Silver Spring, MD 20910., 980521=[80 FR 8816, Feb. 19, 2015], 556515=(4) The Fraser River Panel Area (U.S.) includes Puget Sound Management and Catch Reporting Areas 4B, 5, 6, 6A, 6B, 6C, 6D, 7, 7A, 7B, 7C, 7D, and 7E as defined in the Washington State Administrative Code at Chapter 220-22 as of June 27, 1986., 8079=e-CFR data is current as of July 30, 2015, 112811=(6) A fishing vessel of the United States of class size 4-6 (more than 182 metric tons carrying capacity) may not be used from 0000 hours on September 29 to 2400 hours on October 29 in the years 2014, 2015, and 2016 to fish with purse seine gear within the area bounded at the east and west by 96° and 110° W. longitude and bounded at the north and south by 4° N. and 3° S. latitude., 514049=(6) Qualifying period means the sport fishing season established by the International Pacific Halibut Commission (February 1 through December 31) in 2004 and 2005., 749249=The owner of any U.S. vessel that fishes for albacore tuna in Canadian waters under the Treaty as amended in 2002 must maintain and submit to the Regional Administrator a logbook of catch and effort of such fishing. The logbook form will be provided to the vessel owner as soon as practicable after the request to be placed on the list of vessels. The logbook must be submitted to the Regional Administrator within 15 days of the end of a trip, regardless of whether the trip ends by reentry to U.S. waters or entry to Canada's territorial sea, other Canadian waters in which fishing is not permitted, or a Canadian port. If the departure is due to exit to the high seas, the vessel operator must submit the logbook within 7 days of its next landing., 702188=This subpart implements the Agreement Between the Government of the United States of America and the Government of Canada on Fisheries Enforcement executed at Ottawa, Canada, on September 26, 1990 (Agreement), allowing each party to the Agreement to take appropriate measures, consistent with international law, to prevent its nationals, residents and vessels from violating those national fisheries laws and regulations of the other party. This subpart applies, except where otherwise specified in this subpart, to all persons and all places (on water and on land) subject to the jurisdiction of the United States under the Magnuson-Stevens Act. This includes, but is not limited to, activities of nationals, residents and vessels of the United States (including the owners and operators of such vessels) within waters subject to the fisheries jurisdiction of Canada as defined in this subpart, as well as on the high seas and in waters subject to the fisheries jurisdiction of the United States., 179400=(i) First priority will be given to expressions of interest and complete applications for vessels for which, as of June 1st of that year, application approvals have been issued by NMFS for the licensing period that starts that year (i.e., anticipated license renewal applications), provided that such vessels continue to satisfy the requirements for licensing under the Act and this subpart, and provided such vessels have no unsatisfied civil penalties or fines assessed by the Secretary under the Act that have become final., 118017=(iii) If greater than 425 metric tons are caught in 2015, as determined by NMFS, then the 2016 catch limit is calculated by subtracting the amount caught in 2015 from 600 metric tons., 79710=(i) Active status. As early as August 1 of each year, vessel owners or managing owners may request that a purse seine vessel qualified to be listed on the Vessel Register under paragraph (b)(2) of this section be categorized as active for the following calendar year. To request a purse seine vessel in excess of 400 st (362.8 mt) carrying capacity be listed on the Vessel Register and be categorized as active, the vessel owner or managing owner must submit to the Regional Administrator the vessel permit application and payment of the permit application fee and vessel assessment fee. To request a purse seine vessel of 400 st (362.8 mt) carrying capacity or less be listed on the Vessel Register and be categorized as active, the vessel owner or managing owner must submit to the Regional Administrator written notification including, but not limited to, a vessel photograph, the vessel information as described under paragraph (b)(3) of this section, and the owner or managing owner's signature and business telephone and fax numbers. If a purse seine vessel of 400 st (362.8 mt) carrying capacity or less is required by the Agreement on the IDCP to carry an observer, the vessel owner or managing owner must also submit payment of the vessel assessment fee to the Regional Administrator. Vessel permit applications and written notifications must be submitted by fax to (562) 980-4047. The Regional Administrator must receive the vessel permit application or written notification and payment of the permit application fee and vessel assessment fee no later than September 15 for vessels for which a DML was requested for the following year and no later than November 30 for vessels for which a DML was not requested for the following year. Submission of the vessel permit application or written notification and payment of the vessel assessment fee and permit application fee will be interpreted by the Regional Administrator as a request for a vessel to be categorized as active. The following restrictions apply to active status:, 844098=[78 FR 3346, Jan. 16, 2013], 789036=[61 FR 35550, July 5, 1996, as amended at 73 FR 31388, June 2, 2008], 193214=[75 FR 74644, Dec. 1, 2010], 623086=[65 FR 30016, May 10, 2000, as amended at 68 FR 23228, May 1, 2003; 72 FR 48509, Aug. 23, 2007; 75 FR 18112, Apr. 9, 2010], 752534=Source: 69 FR 67277, Nov. 17, 2004, unless otherwise noted., 180693=(C) 1 point will be assigned for each calendar year in which at least 3,000 metric tons of fish were landed or transshipped from the vessel in United States ports, including ports located in any of the States, as determined by the Regional Administrator. The applicable period shall run from 1988 through the last calendar year prior to the year in which the applied-for licensing period starts, and the total number of points assigned shall be no more than 5., 610636=[61 FR 35550, July 5, 1996, as amended at 72 FR 48509, Aug. 23, 2007], 575261=ACA means the Antarctic Conservation Act of 1978 (16 U.S.C. 2401 et seq.)., 493408=[68 FR 18156, Apr. 15, 2003], 624526=(b) Navigational lights and shapes. Each harvesting vessel must display the lights and shapes prescribed by the International Regulations for Preventing Collisions at Sea, 1972 (TIAS 8587, and 1981 amendment TIAS 10672), for the activity in which the harvesting vessel is engaged (as described at 33 CFR part 81)., 182197=(6) No later than March 7th of each year, NMFS will approve applications (for the licensing period that starts that year) that satisfy all of the following conditions:, 30693=Authority: 16 U.S.C. 951 et seq., 16 U.S.C. 1801 et seq., 16 U.S.C. 5501 et seq., 16 U.S.C. 2431 et seq., 31 U.S.C. 9701 et seq., 686993=(b) Application for certificate/permit. (1) An application for a permit must be submitted and signed by the vessel's owner. An application may be submitted at any time, but should be submitted to the Regional Administrator not less than 90 days in advance of its need. Applications for the ensuing calendar year should be submitted to the Regional Administrator by October 1., 602518=(ii) Cape Shirreff and the San Telmo Islands. This designation takes effect on May 1, 1995. Cape Shirreff is a low, ice-free peninsula towards the western end of the north coast of Livingston Island, South Shetland Islands, situated at 62°29′ S. lat., 60°47′ W. long., between Barclay Bay and Hero Bay. San Telmo Island is the largest of a small group of ice-free rock islets, approximately 2 km west of Cape Shirreff. The boundaries of the Cape Shirreff CEMP Protected Site are identical to the boundaries of the Site of Special Scientific Interest No. 32, as specified by ATCM Recommendation XV-7. No manmade boundary markers indicate the limits of the SSSI or protected site. The boundaries are defined by natural features and include the entire area of the Cape Shirreff peninsula north of the glacier ice tongue margin, and most of the San Telmo Island group. For the purposes of the protected site, the entire area of Cape Shirreff and the San Telmo Island group is defined as any land or rocks exposed at mean low tide within the area delimited by the map of SSSI No. 32 and available from the Assistant Administrator., 183578=(i) If the number of outstanding expressions of interest (i.e., expressions of interest that have not been pre-approved) received by June 1st of the year preceding the year in which the licensing period begins, plus the number of outstanding complete applications (i.e., complete applications that have not been approved) received by February 5th of the year in which the licensing period begins, exceeds the number of licenses available, NMFS will review all such outstanding expressions of interest and complete applications and apply the process described in paragraphs (k)(9)(i)(A) through (k)(9)(i)(C) of this section to pre-approve and approve applications from among that pool of applicants;, 101717=(b) Tuna catch limits in the longline fishery in the Convention Area. (1) Fishing seasons for all tuna species begin on January 1 and end either on December 31 or when NMFS closes the fishery for a specific species., 889425=[75 FR 3350, Jan. 21, 2010, as amended at 76 FR 73520, Nov. 29, 2011], 32160=The purpose of this part is to implement the fishery conservation and management measures provided for in the international treaties, conventions, or agreements specified in each subpart, as well as certain provisions of the Lacey Act Amendments of 1981. The regulations in this part apply, except where otherwise specified in this part, to all persons and all places subject to the jurisdiction of the United States under the acts implemented under each subpart., 750562=(b) The operator of a U.S. vessel that has been fishing under the Treaty as amended in 2002 must file a hail-out report to the Reporting Office within 24 hours of departing waters under the fisheries jurisdiction of Canada., 917068=[75 FR 3351, Jan. 21, 2010, as amended at 79 FR 64110, Oct. 28, 2014], 715113=Agreement means the Agreement Between the Government of the United States of America and the Government of the Union of Soviet Socialist Republics on Mutual Fisheries Relations, signed May 31, 1988., 192576=(n) Procedures for 2011-2012 licensing period. For the licensing period that starts June 15, 2011, and for that licensing period only, pre-approvals may not be sought and will not be issued by NMFS. NMFS will rank order those applications received by February 5, 2011, for the 2011-2012 licensing period by applying the criteria in paragraphs (k)(4)(i) and (k)(4)(ii) of this section, except that in lieu of using the criteria in (k)(4)(i), first priority will be given to applications for vessels that as of February 5, 2011, have valid licenses for the 2010-2011 licensing period., 744247=The regulations in this subpart govern fishing by U.S. vessels in waters under the fisheries jurisdiction of Canada pursuant to the 1981 Treaty Between the Government of the United States of America and the Government of Canada on Pacific Coast Albacore Tuna Vessels and Port Privileges as amended in 2002. Regulations governing fishing by Canadian vessels in waters under the fisheries jurisdiction of the United States pursuant to this Treaty as amended in 2002 are found at §600.530 of chapter VI of this title., 77347=(2) Requirements for inclusion of purse seine vessels on the vessel register. The tuna purse seine portion of the Vessel Register shall include, consistent with resolutions of the IATTC, only vessels that fished in the Convention Area prior to June 28, 2002. Inclusion on the tuna purse seine portion of the Vessel Register is valid through December 31 of each year. New tuna purse seine vessels may be added to the Vessel Register at any time to replace those previously removed by the Regional Administrator, provided that the total capacity of the replacement vessel or vessels does not exceed that of the tuna purse seine vessel or vessels being replaced., 106064=(e) Bycatch reduction measures. (1) As of January 1, 2012, bigeye, skipjack, and yellowfin tuna caught in the Convention Area by a fishing vessel of the United States of class size 4-6 (more than 182 metric tons carrying capacity) using purse seine gear must be retained on board and landed, except for fish deemed unfit for human consumption for reasons other than size. This requirement shall not apply to the last set of a trip if the available well capacity is insufficient to accommodate the entire catch., 31226=Editorial Note: Nomenclature changes to part 300 appear at 64 FR 44431, Aug. 16, 1999, and at 76 FR 59305, Sept. 26, 2011., 233607=[72 FR 6154, Feb. 9, 2007, as amended at 75 FR 74648, Dec. 1, 2010], 514266=(7) Recent participation period means the sport fishing season established by the International Pacific Halibut Commission (February 1 through December 31) in 2008., 361874=(ii) The permit expires at 11:59 p.m. (Alaska local time) on the day prior to 15 days prior to the end of the commercial halibut fishing season for that year;, 118215=(3) In 2015 and 2016, a 25 metric ton trip limit will be in effect until NMFS anticipates that catch will be within 50 metric tons of the catch limits, after which a 2 metric ton trip limit will be in effect upon publication of a notice in the Federal Register by NMFS., 675402=(hh) Ship, transport, offer for sale, sell, purchase, import, export, re-export or have custody, control, or possession of, any frozen Dissostichus species without verifiable documentation of the use of real-time C-VMS port-to-port by the vessel that harvested such Dissostichus species unless the Dissostichus species was harvested during a fishing trip that began prior to September 24, 2007., 343397=[61 FR 35550, July 5, 1996, as amended at 74 FR 11697, Mar. 19, 2009; 76 FR 14319, Mar. 16, 2011], 643229=[61 FR 35550, July 5, 1996, as amended at 65 FR 30017, May 10, 2000; 72 FR 48509, Aug. 23, 2007; 75 FR 18112, Apr. 9, 2010], 71651=Regional Vessel Register (hereafter referred to as Vessel Register) means the regional register of vessels authorized to fish for tuna and tuna-like species in the Convention Area, as established by the Inter-American Tropical Tuna Commission in June 2000., 331275=[61 FR 35550, July 5, 1996], 246021=Fishing week, for purposes of §300.65(d), means a time period that begins at 0001 hours, A.l.t., Monday morning and ends at 2400 hours, A.l.t., the following Sunday night., 752956=The regulations in this subpart are issued under the authority of the Atlantic Tunas Convention Act of 1975 (ATCA), Tuna Conventions Act of 1950, and Magnuson-Stevens Act. The regulations implement the recommendations of the International Commission for the Conservation of Atlantic Tunas (ICCAT) for the conservation and management of tuna and tuna-like species in the Atlantic Ocean and of the Inter-American Tropical Tuna Commission (IATTC) for the conservation and management of highly migratory fish resources in the Eastern Tropical Pacific Ocean, so far as they affect vessels and persons subject to the jurisdiction of the United States., 169671=(F) If the vessel is known, a statement of the total amount, in metric tons, of any tuna species landed or transshipped from the vessel at United States ports, including ports located in any of the States, for each of the calendar years 1988 through the current year., 796233=[73 FR 31388, June 2, 2008], 747613=[72 FR 19123, Apr. 17, 2007], 236657=This subpart implements the North Pacific Halibut Act of 1982 (Act) and is intended to supplement, not conflict with, the annual fishery management measures adopted by the International Pacific Halibut Commission (Commission) under the Convention between the United States and Canada for the Preservation of the Halibut Fishery of the Northern Pacific Ocean and Bering Sea (Convention)., 925723=(i) Providing the information promotes homeland security or national security purposes including the USCG's homeland security missions as defined in section 888(a)(2) of the Homeland Security Act of 2002 (6 U.S.C. 468(a)(2)); and, 60855=[64 FR 15, Jan. 4, 1999, as amended at 75 FR 3347, Jan. 21, 2010], 39460=[61 FR 35550, July 5, 1996, as amended at 76 FR 59305, Sept. 26, 2011], 259597=(iii) If any of the sport fishery subareas north of Cape Falcon, Oregon are not projected to utilize their respective quotas by September 30, NMFS may take inseason action to transfer any projected unused quota to another Washington sport subarea., 184369=(ii) If the number of outstanding expressions of interest received by June 1st of the year preceding the year in which the licensing period begins, plus the number of outstanding complete applications received by February 5th of the year in which the licensing period begins, does not exceed the number of licenses available:, 653013=(iii) May not serve as observers on any vessel or at any shoreside or floating stationary processing facility owned or operated by a person who previously employed the observers., 502140=[68 FR 18156, Apr. 15, 2003, as amended at 70 FR 16754, Apr. 1, 2005; 72 FR 30728, June 4, 2007; 72 FR 67669, Nov. 30, 2007; 73 FR 30524, May 28, 2008; 73 FR 52797, Sept. 11, 2008; 73 FR 54942, Sept. 24, 2008; 74 FR 21228, May 6, 2009; 74 FR 57110, Nov. 4, 2009; 75 FR 600, Jan. 5, 2010; 78 FR 75890, Dec. 12, 2013; 80 FR 35206, June 19, 2015], 751593=(4) The Regional Administrator has announced that the U.S. limit on fishing under the Treaty as amended in 2002 has been reached., 260773=(ii) Actual notice of inseason management actions will be provided by a telephone hotline administered by the West Coast Region, NMFS, at 206-526-6667 or 800-662-9825 (May through October) and by U.S. Coast Guard broadcasts. These broadcasts are announced on Channel 16 VHF-FM and 2182 kHz at frequent intervals. The announcements designate the channel or frequency over which the notice to mariners will be immediately broadcast. Since provisions of these regulations may be altered by inseason actions, sport fishers should monitor either the telephone hotline or U.S. Coast Guard broadcasts for current information for the area in which they are fishing., 391876=(i) Is prohibited from fishing for IFQ halibut with setline gear within Sitka Sound, as defined in paragraph (e)(1)(ii) of this section, from June 1 through August 31; and, 554482=(2) The waters included within the following boundaries: Beginning at Bonilla Point, Vancouver Island, thence along the aforesaid direct line drawn from Bonilla Point to Tatoosh Lighthouse, Washington, described in paragraph (1) of this definition, thence to the nearest point of Cape Flattery, thence following the southerly shore of Juan de Fuca Strait to Point Wilson, on Whidbey Island, thence following the western shore of the said Whidbey Island, to the entrance to Deception Pass, thence across said entrance to the southern side of Reservation Bay, on Fidalgo Island, thence following the western and northern shore line of the said Fidalgo Island to Swinomish Slough, crossing the said Swinomish Slough, in line with the track of the Great Northern Railway (Burlington Northern Railroad), thence northerly following the shoreline of the mainland to Atkinson Point at the northerly entrance to Burrard Inlet, British Columbia, thence in a straight line to the southern end of Bowen Island, then westerly following the southern shore of Bowen Island to Cape Roger Curtis, thence in a straight line to Gower Point, thence westerly following the shoreline to Welcome Point on Sechelt Peninsula, thence in a straight line to Point Young on Lasqueti Island, thence in a straight line to Dorcas Point on Vancouver Island, thence following the eastern and southern shores of the said Vancouver Island, to the starting point at Bonilla Point, as shown on the British Admiralty Chart Number 579, and on the U.S. Coast and Geodetic Survey Chart Number 6300, as corrected to March 14, 1930, copies of which are annexed to the 1930 Convention between Canada and the United States of America for Protection, Preservation, and Extension of the Sockeye Salmon Fishery in the Fraser River System as amended, signed May 26, 1930. [Note: U.S. Coast and Geodetic Survey Chart Number 6300 has been replaced and updated by NOAA Chart Number 18400.], 906970=[75 FR 3350, Jan. 21, 2010, as amended at 77 FR 71511, Dec. 3, 2012; 79 FR 77943, Dec. 29, 2014; 80 FR 8815, Feb. 19, 2015], 745277=Fishing under the Treaty as amended in 2002 means to engage in fishing for albacore tuna in waters under the fisheries jurisdiction of Canada seaward of 12 nautical miles from the baseline from which the territorial sea is measured., 574855=In addition to the terms defined in §300.2, in the Act, and in the Convention on the Conservation of Antarctic Marine Living Resources, done at Canberra, Australia, May 7, 1980 (Convention). Convention, the terms used in this subpart have the following meanings. If a term is defined differently in §300.2, such Act, or such Convention, the definition in this section shall apply., 117184=(2) In 2016, NMFS will publish a notice in the Federal Register announcing the 2016 catch limit. For the calendar year 2016, all commercial fishing vessels of the United States combined may capture, retain on board, transship, or land no more than the 2016 catch limit. The 2016 catch limit is calculated by adding any amount of the 425 metric ton catch limit that was not caught in 2015, as determined by NMFS, to 175 metric tons, except as follows:, 142924=Pacific Islands Forum Fisheries Agency or FFA means the organization established by the 1979 South Pacific Forum Fisheries Agency Convention., 953235=(d) Catch retention. (1) Based on its determination as to whether an adequate number of WCPFC observers is available for the purse seine vessels of all Members of the Commission as necessary to ensure compliance by such vessels with the catch retention requirements established by the Commission, NMFS will, through publication of a notice in the Federal Register, announce the effective date of the provisions of paragraph (d) of this section. The effective date will be no earlier than January 1, 2010., 773894=[73 FR 31385, June 2, 2008], 511943=(1) Applicant-selected year means the year in the qualifying period, 2004 or 2005, selected by the applicant for NMFS to use in determining the applicant's number of transferable and nontransferable permits., 392329=(4) No charter vessel shall engage in sport fishing, as defined at §300.61, for halibut within Sitka Sound, as defined in paragraph (e)(1)(ii) of this section, from June 1 through August 31., 948584=(1) For calendar year 2015 there is a limit of 1,828 fishing days., 117713=(i) If 175 metric tons or less are caught in 2015, as determined by NMFS, then the 2016 catch limit is 425 metric tons;, 831566=[78 FR 3344, Jan. 16, 2013], 738042=In addition to any fine, penalty, or forfeiture imposed by the Russian Federation, nationals and vessels of the United States violating the prohibitions of §300.156 are subject to the fines, penalties, and forfeitures and the adjudicative procedures provided in the Magnuson-Stevens Act, 16 U.S.C. 1858, 1860, 1861, and any other applicable laws and regulations of the United States., 769743=[69 FR 67277, Nov. 17, 2004, as amended at 71 FR 58163, Oct. 2, 2006; 73 FR 31385, June 2, 2008], 480011=(2) Application. A community or Alaska Native tribe may apply for a CHP by submitting an application to the Alaska Region, NMFS. Applications must be mailed to: Restricted Access Management Program, NMFS, Alaska Region, P.O. Box 21668, Juneau, AK 99802-1668. A complete application must include:, 713654=This subpart regulates U.S. nationals fishing in the Russian fisheries and implements the Agreement between the Government of the United States of America and the Government of the Union of Soviet Socialist Republics on Mutual Fisheries Relations, signed May 31, 1988., 807297=[76 FR 2024, Jan. 12, 2011, as amended at 78 FR 3342, Jan. 16, 2013], 870942=[75 FR 3349, Jan. 21, 2010], 887683=[77 FR 71510, Dec. 3, 2012], 63102=[64 FR 15, Jan. 4, 1999], 31668=Authority: 16 U.S.C. 2431 et seq., 31 U.S.C. 9701 et seq., 447896=(i) The Ketchikan Gateway Borough on May 18, 2008. This area encompasses all those islands bounded on the east, north, and west by Behm Canal, Behm Narrows, and Clarence Strait to its junction with Nichols Passage, and on the south by Nichols and Revillagigedo Channel to its junction with Behm Canal. The designated boundaries extend to the center line of Behm Canal, Behm Narrows, Clarence Strait, Nichols Passage, and Revillagigedo Channel, and include all the area of Revillagigedo, Gravina, Pennock, Betton, Grant and other Clover Passage and Naha Bay Islands, Hassler, Gedney, Black, Smeaton, Manzanita, Rudyerd, and Bold Islands, and all other offshore and adjacent islands and inlets thereto (see figure 2 to this subpart E)., 966506=(a) Establishment of bigeye tuna catch limit. There is a limit of 3,502 metric tons of bigeye tuna that may be captured in the Convention Area by longline gear and retained on board by fishing vessels of the United States during calendar year 2015., 109709=(2) A vessel owner, manager, or association representative of a vessel that is subject to the requirements of paragraph (f)(1) of this section must in 2014, 2015, and 2016 provide written notification to the Regional Administrator declaring to which one of the two closure periods identified in paragraph (f)(1) of this section his or her vessel will adhere in that year. This written notification must be submitted by fax at (562) 980-4047 or email at RegionalAdministrator.WCRHMS@noaa.gov and must be received no later than July 1 in each of the years 2014, 2015, and 2016. The written notification must include the vessel name and registration number, the closure dates that will be adhered to by that vessel, and the vessel owner or managing owner's name, signature, business address, and business telephone number., 952444=(B) During any period specified in a Federal Register notice issued by NMFS announcing that NMFS has determined that U.S. purse seine vessels have collectively made, or are projected to make, 3,061 FAD sets in the Convention Area in the area between 20° N. latitude and 20° S. latitude in 2015. The Federal Register notice will be published at least seven days in advance of the start of the period announced in the notice. NMFS will estimate and project the number of FAD sets using vessel logbooks, and/or other information sources that it deems most appropriate and reliable for the purposes of this section., 718644=Russian Federation or Russia means the governing entity that succeeded the Union of Soviet Socialist Republics, and that is the successor party to the Agreement of May 31, 1988., 881787=[77 FR 71509, Dec. 3, 2012], 980840=Source: 75 FR 59142, Sept. 27, 2010, unless otherwise noted., 36044=Magnuson-Stevens Act means the Magnuson-Stevens Fishery Conservation and Management Act, 16 U.S.C. 1801 et seq., 184709=(A) No later than June 15th of the year in which the licensing period begins, NMFS will pre-approve all such outstanding expressions of interest and complete applications that satisfy the relevant requirements for licensing under the Act and this subpart;, 930483=[75 FR 3352, Jan. 21, 2010], 947824=None of the requirements of this section apply in the territorial seas or archipelagic waters of the United States or any other nation, as defined by the domestic laws and regulations of that nation and recognized by the United States. All dates used in this section are in Universal Coordinated Time, also known as UTC; for example: the year 2013 starts at 00:00 on January 1, 2013 UTC and ends at 24:00 on December 31, 2013 UTC; and July 1, 2013, begins at 00:00 UTC and ends at 24:00 UTC., 34422=Exclusive Economic Zone or EEZ means the zone established by Presidential Proclamation 5030, dated March 10, 1983, as defined in 16 U.S.C. 1802(6)., 117847=(ii) If in 2015, greater than 300 metric tons and up to 400 metric tons are caught, as determined by NMFS, then the 2016 catch limit is 200 metric tons; or, 161867=(a) Each vessel fishing in the Licensing Area must have a license issued by the Administrator for the licensing period being fished, unless exempted by §300.39. Each licensing period begins on June 15 and ends on June 14 of the following year., 787435=[69 FR 67277, Nov. 17, 2004, as amended at 71 FR 58163, Oct. 2, 2006; 73 FR 31386, June 2, 2008; 74 FR 66586, Dec. 16, 2009], 235952=[72 FR 6155, Feb. 9, 2007], 846003=1982 Convention means the United Nations Convention on the Law of the Sea of 10 December 1982., 182836=(7) No later than March 17th of each year, NMFS will notify all applicants (for the licensing period that starts that year) who submitted complete applications by February 5th of that year, whether their applications have been approved under paragraph (k)(6) of this section, and in cases where they have not, whether their applications are being considered for approval under paragraph (k)(8) of this section., 392539=(i) No charter vessel shall retain halibut caught while engaged in sport fishing, as defined at §300.61, for other species, within Sitka Sound, as defined in paragraph (e)(1)(ii) of this section, from June 1 through August 31., 120803=This subpart implements the South Pacific Tuna Act of 1988 (Act) and the Treaty on Fisheries Between the Governments of Certain Pacific Island States and the Government of the United States of America (Treaty) and applies to persons and vessels subject to the jurisdiction of the United States., 636852=(3) Applications for a permit to harvest krill must be received by NMFS no later than June 1 immediately prior to the season in which the harvesting would occur. The applications must, to the extent possible, identify the products to be derived from the anticipated krill catch., 679627=[61 FR 35550, July 5, 1996, as amended at 65 FR 30017, May 10, 2000. Redesignated at 72 FR 48510, Aug. 23, 2007], 185836=(D) If and as long as the number of approvals plus outstanding (not voided) pre-approvals does not exceed the total number of licenses available under paragraph (c) of this section, NMFS will review all complete applications received after February 5th of the year in which the licensing period begins and before May 16th within the licensing period and, as they are received and in the order they are received (based on the day of receipt), will approve those applications that satisfy the requirements for licensing under the Act and this subpart until no more approvals are available. In the event that two or more complete applications are received on the same day, priority for approval will be given by lottery, which will be conducted by the Regional Administrator., 166562=(3) Except for the 2011-2012 licensing period, prior to submitting a complete application, an applicant may request pre-approval of an application by the Regional Administrator by submitting an expression of interest. A pre-approval of an application establishes that the applicant is eligible to be considered for one of the available licenses following timely submission of a complete application. Although submission of an expression of interest is entirely voluntary, applications that have not been pre-approved might not be eligible for approval if the number of applications exceeds the number of available licenses for a given licensing period. A pre-approval will be deemed to be void if the applicant fails to submit a complete application by the date established in paragraph (h)(6) of this section., 161434=[61 FR 35550, July 5, 1996, as amended at 72 FR 6149, Feb. 9, 2007; 75 FR 74643, Dec. 1, 2010; 79 FR 64110, Oct. 28, 2014], 350846=(2) Application timing. The Regional Administrator will not approve any Application for Transfer Between IFQ and GAF before annual IFQ is issued for each year or after one month prior to the closing of the commercial fishing season for that year. Applications to transfer GAF to IFQ will be accepted from August 1 through August 31 only., 620076=(ii) For frozen Dissostichus species, re-export documents will be generated upon verification of the use of real-time C-VMS port-to-port except for Dissostichus species harvested during fishing trips that began prior to September 24, 2007., 66400=The regulations in this subpart are issued under the authority of the Tuna Conventions Act of 1950 (Act). The regulations implement recommendations of the Inter-American Tropical Tuna Commission (IATTC) for the conservation and management of highly migratory fish resources in the Eastern Tropical Pacific Ocean so far as they affect vessels and persons subject to the jurisdiction of the United States., 939076=[75 FR 3354, Jan. 21, 2010], 952380=(A) From January 1 through February 28, 2015; and, 952014=(i) From July 1 through September 30, 2015; and, 66819=[69 FR 67277, Nov. 17, 2004], 253214=[61 FR 35550, July 5, 1996, as amended at 64 FR 52469, Sept. 29, 1999; 68 FR 18156, Apr. 15, 2003; 68 FR 47264, Aug. 8, 2003; 72 FR 30727, June 4, 2007; 72 FR 67669, Nov. 30, 2007; 73 FR 30523, May 28, 2008; 73 FR 52797, Sept. 11, 2008; 73 FR 54939, Sept. 24, 2008; 74 FR 11697, Mar. 19, 2009; 74 FR 21227, May 6, 2009; 74 FR 57109, Nov. 4, 2009; 75 FR 599, Jan. 5, 2010; 76 FR 6571, Feb. 7, 2011; 78 FR 75885, Dec. 12, 2013; 80 FR 35205, June 19, 2015], 573255=[61 FR 35550, July 5, 1996, as amended at 74 FR 44771, Aug. 31, 2009], 675929=[61 FR 35550, July 5, 1996, as amended at 65 FR 30017, May 10, 2000; 68 FR 23229, May 1, 2003. Redesignated and amended at 72 FR 48510, 48512, Aug. 23, 2007; 75 FR 18113, Apr. 9, 2010], 827609=[78 FR 3343, Jan. 16, 2013], 352734=(5) IFQ and GAF accounts. (i) Accounts affected by either a Regional Administrator-approved Application for Transfer Between IFQ and GAF or the return of unharvested GAF to IFQ on or after 15 calendar days prior to the closing of the commercial halibut fishing season for that year will be adjusted on the date of approval or return. Applications for Transfer Between IFQ and GAF that are transfers of GAF to IFQ that have been approved by the Regional Administrator will be completed not earlier than September 1. Any necessary permits will be sent with the notification of the Regional Administrator's decision on the Application for Transfer Between IFQ and GAF., 862539=WCPF Convention means the Convention on the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean (including any annexes, amendments, or protocols that are in force, or have come into force, for the United States) that was adopted at Honolulu, Hawaii, on September 5, 2000, by the Multilateral High-Level Conference on Highly Migratory Fish Stocks in the Western and Central Pacific Ocean., 180467=(B) 1 point will be assigned for each licensing period, starting with the 1988-1989 licensing period, in which a license had been issued for the vessel pursuant to the Act, for a total of no more than 10 points., 49904=This subpart implements the High Seas Fishing Compliance Act of 1995 (Act), which requires the Secretary to license U.S. vessels fishing on the high seas., 119760=[64 FR 44431, Aug. 16, 1999, as amended at 66 FR 49320, Sept. 27, 2001. Redesignated at 69 FR 67277, Nov. 17, 2004; 74 FR 1620, Jan. 13, 2009; 74 FR 61051, Nov. 23, 2009; 76 FR 68338, Nov. 4, 2011; 76 FR 68338, Nov. 4, 2011; 78 FR 33243, June 4, 2013; 79 FR 19489, Apr. 9, 2014; 79 FR 28451, May 16, 2014; 79 FR 56019, Sept. 18, 2014; 80 FR 38989, July 8, 2015], 752313=Authority: 16 U.S.C. 951-961 and 971 et seq.; 16 U.S.C. 1801 et seq., 84847=(iii) Inactive status. From August 1 through November 30 of each year, vessel owners or managing owners may request that purse seine vessels qualified to be listed on the Vessel Register under paragraph (b)(2) of this section be categorized as inactive for the following calendar year. To request a purse seine vessel in excess of 400 st (362.8 mt) carrying capacity be listed on the Vessel Register and categorized as inactive for the following calendar year, the vessel owner or managing owner must submit to the Regional Administrator payment of the associated vessel assessment fee. Payment of the vessel assessment fee consistent with inactive status will be interpreted by the Regional Administrator as a request for the vessel to be categorized as inactive. To request a purse seine vessel of 400 st (362.8 mt) carrying capacity or less be listed on the Vessel Register and categorized as inactive for the following calendar year, the vessel owner or managing owner must submit by mail to the Regional Administrator a written notification including, but not limited to, the vessel name and registration number and the vessel owner or managing owner's name, signature, business address, and business telephone and fax numbers. Payment of the vessel assessment fee is not required for vessels of 400 st (362.8 mt) carrying capacity or less to be categorized as inactive. At any time during the year, a vessel owner or managing owner may request that a purse seine vessel qualified to be listed on the Vessel Register under paragraph (b)(2) of this section be categorized as inactive for the remainder of the calendar year. To request a purse seine vessel in excess of 400 st (362.8 mt) carrying capacity be listed on the Vessel Register and categorized as inactive for the remainder of the calendar year, the vessel owner or managing owner must submit to the Regional Administrator payment of the associated vessel assessment fee. To request a purse seine vessel of 400 st (362.8 mt) carrying capacity or less be listed on the Vessel Register and categorized as inactive for the remainder of the calendar year, the vessel owner or managing owner must submit to the Regional Administrator written notification as described in this paragraph (payment of the vessel assessment fee is not required)., 603847=[61 FR 35550, July 5, 1996, as amended at 68 FR 23227, May 1, 2003], 659226=(d) Issuance. NMFS may issue a dealer permit or preapproval if it determines that the activity proposed by the dealer meets the requirements of the Act and that the resources were not or will not be harvested in violation of any CCAMLR conservation measure or in violation of any regulation in this subpart. No preapproval will be issued for Dissostichus species without verifiable documentation, to include VMS reports with vessel location and messages, of the use of real-time C-VMS port-to-port by the vessel that harvested such Dissostichus species, except for Dissostichus species harvested during fishing trips that began prior to September 24, 2007., 49130=[61 FR 35550, July 5, 1996, as amended at 73 FR 67809, Nov. 17, 2008], 489572=(C) A Ceremonial Permit may not be used within Sitka Sound from June 1 through August 31;, 796570=In addition to the prohibitions specified in §300.4, and §§600.725 and 635.71 of this title, it is unlawful for any person subject to the jurisdiction of the United States to violate any provision of this part, the Atlantic Tunas Convention Act, the Magnuson-Stevens Act, the Tuna Conventions Act of 1950, or any other rules promulgated under those Acts. It is unlawful for any person or vessel subject to the jurisdiction of the United States to:, 774982=[77 FR 52261, Aug. 29, 2012], 873554=(1) May not use the vessel for fishing, retaining fish on board, or landing fish in areas under the jurisdiction of a nation other than the United States unless any license, permit, or other authorization that may be required by such other nation for such activity has been issued with respect to the vessel., 978619=[77 FR 71513, Dec. 3, 2012], 666966=[72 FR 48511, Aug. 23, 2007, as amended at 75 FR 18113, Apr. 9, 2010], 592712=(c) The Marine Mammal Protection Act of 1972 (16 U.S.C. 1361 et seq.), the Endangered Species Act of 1973 (16 U.S.C. 1531 et seq.), the Migratory Bird Treaty Act (16 U.S.C. 701 et seq.), and their implementing regulations also apply to the harvesting and importation of AMLRs., 656353=[72 FR 48510, Aug. 23, 2007], 208935=(B) For each week or portion thereof that the vessel is in the exclusive economic zone of Solomon Islands, a report that covers the period from 12:01 a.m. on Monday to 12 midnight on the following Sunday must be submitted and received by noon of the following Tuesday (local time). The report must include the amount of the catch taken and the number of fishing days spent in the exclusive economic zone of Solomon Islands during the reporting period., 965947=[74 FR 38554, Aug. 4, 2009, as amended at 76 FR 82183, Dec. 30, 2011; 77 FR 71513, Dec. 3, 2012; 78 FR 30778, May 23, 2013; 79 FR 67362, Nov. 13, 2014; 79 FR 71331, Dec. 2, 2014; 80 FR 8815, Feb. 19, 2015; 80 FR 29223, May 21, 2015], 73393=[61 FR 35550, July 5, 1996, as amended at 64 FR 29133, May 28, 1999; 64 FR 44430, Aug. 16, 1999; 69 FR 67277, Nov. 17, 2004; 70 FR 19010, Apr. 12, 2005; 74 FR 1618, Jan. 13, 2009; 74 FR 61050, Nov. 23, 2009; 76 FR 287, Jan. 4, 2011; 76 FR 68337, Nov. 4, 2011; 79 FR 19489, Apr. 9, 2014; 80 FR 38989, July 8, 2015], 743677=Authority: Sec. 401, Pub. L. 108-219, 118 Stat. 616 (16 U.S.C. 1821 note)., 947263=[74 FR 38554, Aug. 4, 2009, as amended at 74 FR 64010, Dec. 7, 2009; 75 FR 3355, Jan. 21, 2010; 77 FR 51714, Aug. 27, 2012; 77 FR 71512, Dec. 3, 2012; 78 FR 30778, May 23, 2013; 79 FR 71331, Dec. 2, 2014; 80 FR 8815, Feb. 19, 2015], 223227=[61 FR 35550, July 5, 1996, as amended at 72 FR 6154, Feb. 9, 2007], 50353=In addition to the terms defined in section 300.2 and those in the Act and the Agreement to Promote Compliance with International Conservation and Management Measures by Fishing Vessels on the High Seas, adopted by the Conference of the Food and Agriculture Organization of the United Nations on November 24, 1993 (Agreement), the terms used in this subpart have the following meanings. If a term is defined differently in §300.2, the Act, or the Agreement, the definition in this section shall apply., 393177=(5) Setline gear may not be used in a 4 nm radius extending south from Low Island at 57°00.70′ N. lat., 135°36.57′ W. long. within Sitka Sound, as defined in paragraph (e)(1)(ii) of this section, from June 1 through August 31., 101986=(2) For each of the calendar years 2014, 2015, and 2016, there is a limit of 500 metric tons of bigeye tuna that may be captured and landed by longline gear in the Convention Area by fishing vessels of the United States that are over 24 meters in overall length., 844456=Source: 74 FR 38554, Aug. 4, 2009, unless otherwise noted., 210611=[72 FR 6151, Feb. 9, 2007], 94328=[61 FR 35550, July 5, 1996, as amended at 66 FR 49320, Sept. 27, 2001; 70 FR 19010, Apr. 12, 2005; 74 FR 1618, Jan. 13, 2009; 76 FR 287, Jan. 4, 2011; 76 FR 68337, Nov. 4, 2011; 79 FR 56018, Sept. 18, 2014], 574118=(a) This subpart implements the Antarctic Marine Living Resources Convention Act of 1984 (Act)., 549881=This subpart implements the Pacific Salmon Treaty Act of 1985 (16 U.S.C. 3631-3644) (Act) and is intended to supplement, not conflict with, the fishery regimes and Fraser River Panel regulations adopted under the Treaty between the Government of the United States of America and the Government of Canada Concerning Pacific Salmon, signed at Ottawa, January 28, 1985 (Treaty)., 813336=[76 FR 2024, Jan. 12, 2011, as amended at 78 FR 3343, Jan. 16, 2013], 769005=(l) Renewal. Persons must apply annually for a trade permit issued under this section. A renewal application must be submitted to NMFS, at an address designated by NMFS, at least 30 days before the permit expiration date to avoid a lapse of permitted status. NMFS will renew a permit provided that: the application for the requested permit is complete; all reports required under the Magnuson-Stevens Act, ATCA, and the Tuna Conventions Act of 1950 have been submitted, including those required under §§300.183, 300.185, 300.186, and 300.187 and §635.5 of this title; and the applicant is not subject to a permit sanction or denial under paragraph (i) of this section., 653206=(iv) May not solicit or accept employment as a crew member or an employee of a vessel, shoreside processor, or stationary floating processor while employed by an observer provider., 169953=(6) A complete application for a given licensing period may be submitted to the Regional Administrator at any time up to May 15th within the licensing period, but in order to be considered for approval in the event that more applications are received by the Regional Administrator than there are licenses available, a complete application must be received by the Regional Administrator as follows:, 745981=Treaty means the 1981 Treaty Between the Government of the United States of America and the Government of Canada on Pacific Coast Albacore Tuna Vessels and Port Privileges as amended in 2002., 109600=(ii) From 0000 hours UTC on November 18 to 2400 hours UTC on January 18 of the following year., 691411=(a) Arrival and departure reports. The operator of each vessel of the United States for which a certificate and permit have been issued under §300.123 must report by radio to the Port Captain, San Andres Island, voice radio call sign “Capitania de San Andres,” the vessel's arrival in and departure from treaty waters. Radio reports must be made on 8222.0 kHz or 8276.5 kHz between 8:00 a.m. and 12 noon, local time (1300-1700, Greenwich mean time) Monday through Friday., 538833=[74 FR 57110, Nov. 4, 2009], 907609=(1) SAC. Address: 1845 Wasp Blvd., Bldg. 176, Honolulu, HI 96818; telephone: 808-725-6100; facsimile: 808-725-6199; email: pidvms@noaa.gov; business hours: Monday through Friday, except Federal holidays, 8 a.m. to 4:30 p.m., Hawaii Standard Time., 332932=(e) Ceremonial and subsistence fishing for halibut by treaty Indians in subarea 2A-1 is permitted with hook-and-line gear from January 1 to December 31., 537616=[75 FR 600, Jan. 5, 2010, as amended at 75 FR 56909, Sept. 17, 2010; 78 FR 33650, June 4, 2013; 78 FR 75890, Dec. 12, 2013; 80 FR 35207, June 19, 2015], 845520=In addition to the terms defined in §300.2 and those in the Act and in the Convention on the Conservation and Management of Highly Migratory Fish Stocks in the Western and Central Pacific Ocean, with Annexes (WCPF Convention), which was adopted at Honolulu, Hawaii, on September 5, 2000, by the Multilateral High-Level Conference on Highly Migratory Fish Stocks in the Western and Central Pacific Ocean, the terms used in this subpart have the following meanings., 587691=NSF means National Science Foundation, 4201 Wilson Boulevard, Arlington, VA 22230., 143158=Regional Administrator means the Regional Administrator, Pacific Islands Region, NMFS, 1845 Wasp Blvd., Bldg. 176, Honolulu, HI 96818, facsimile: 808-725-5215, or a designee., 109141=(f) Purse seine closures in the Convention Area. (1) A fishing vessel of the United States of class size 4-6 (more than 182 metric tons carrying capacity) may not be used to fish with purse seine gear in the Convention Area for 62 days in each of the years 2014, 2015, and 2016 during one of the following two periods:, 801013=Source: 76 FR 2024, Jan. 12, 2011, unless otherwise noted., 697932=The fishing year for fishing in treaty waters begins on January 1 and ends on December 31., 836802=[76 FR 2024, Jan. 12, 2011. Redesignated and amended at 78 FR 3343, 3345, Jan. 16, 2013], 188322=(ii) If there are no outstanding expressions of interest received by June 1st of the year preceding the year in which the licensing period begins and no outstanding complete applications received by February 5th of the year in which the licensing period begins, if and as long as the number of approvals plus outstanding (not voided) pre-approvals does not exceed the number of licenses available, NMFS will review all complete applications received after February 5th of the year in which the licensing period begins and before May 16th within the licensing period and, in the order they are received (based on the day of receipt), will approve those applications that satisfy the requirements for licensing under the Act and this subpart until no more approvals are available. In the event that two or more complete applications are received on the same day, priority for approval will be given by lottery, which will be conducted by the Regional Administrator., 969247=(e) Announcement of catch limit being reached and fishing prohibitions. NMFS will monitor retained catches of bigeye tuna with respect to the limit established under paragraph (a) of this section using data submitted in logbooks and other available information. After NMFS determines that the limit is expected to be reached by a specific future date, and at least seven calendar days in advance of that specific future date, NMFS will publish a notice in the Federal Register announcing that specific prohibitions will be in effect starting on that specific future date and ending December 31 of that calendar year., 764545=[61 FR 35550, July 5, 1996, as amended at 73 FR 31385, June 2, 2008], 210963=While a vessel is in the Licensing Area, a Limited Area closed to fishing, or a Closed Area, a recent and up-to-date copy of the International Code of Signals (INTERCO) shall be on board and accessible at all times. The operator shall comply with the 1989 Food and Agricultural Organization standard specifications for the marking and identification of fishing vessels. The international radio call sign of the vessel shall be painted in white on a black background, or in black on a white background, and be clear, distinct, and uncovered, in the following manner:, 681930=Authority: 16 U.S.C. 1801 et seq., 100441=[61 FR 35550, July 5, 1996, as amended at 64 FR 29133, May 28, 1999; 64 FR 44430, Aug. 16, 1999; 66 FR 49320, Sept. 27, 2001. Redesignated and amended at 69 FR 67277, Nov. 17, 2004; 74 FR 1620, Jan. 13, 2009; 74 FR 61051, Nov. 23, 2009; 76 FR 68337, Nov. 4, 2011; 76 FR 68337, Nov. 4, 2011; 78 FR 33243, June 4, 2013; 79 FR 28451, May 16, 2014; 79 FR 56018, Sept. 18, 2014; 80 FR 38989, July 8, 2015], 253989=Annual management measures may be added and modified through adoption by the Commission and publication in the Federal Register by the Assistant Administrator, with immediate regulatory effect. Such measures may include, inter alia, provisions governing: Licensing of vessels, inseason actions, regulatory areas, fishing periods, closed periods, closed areas, catch limits (quotas), fishing period limits, size limits, careful release of halibut, vessel clearances, logs, receipt and possession of halibut, fishing gear, retention of tagged halibut, supervision of unloading and weighing, and sport fishing for halibut. The Assistant Administrator will publish the Commission's regulations setting forth annual management measures in the Federal Register by March 15 each year. Annual management measures may be adjusted inseason by the Commission., 370769=(d) Charter vessels in Commission regulatory area 2C and 3A—(1) General requirements—(i) Logbook submission. For a charter vessel fishing trip during which halibut were caught and retained on or after the first Monday in April and on or before December 31, Alaska Department of Fish and Game (ADF&G) Saltwater Sport Fishing Charter Trip Logbook data sheets must be submitted to the ADF&G and postmarked or received no later than 14 calendar days after the Monday of the fishing week (as defined in 50 CFR 300.61) in which the halibut were caught and retained. Logbook sheets for a charter vessel fishing trip during which halibut were caught and retained on January 1 through the first Sunday in April, must be submitted to the ADF&G and postmarked or received no later than the second Monday in April., 748908=[76 FR 73520, Nov. 29, 2011], 591674=[61 FR 35550, July 5, 1996, as amended at 65 FR 30015, May 10, 2000; 68 FR 23227, May 1, 2003; 72 FR 48508, Aug. 23, 2007; 75 FR 18111, Apr. 9, 2010], 803249=[78 FR 3342, Jan. 16, 2013], 379040=(3) A GAF permit holder must submit a GAF landings report by 11:59 p.m. (Alaska local time) on the last calendar day of a fishing trip for each day on which a charter vessel angler retained GAF authorized by the GAF permit held by that permit holder., 622176=(5) For frozen Dissostichus species, verification of the use of real-time C-VMS port-to-port except for Dissostichus species harvested during fishing trips that began prior to September 24, 2007; and, 218165=[61 FR 35550, July 5, 1996, as amended at 72 FR 6153, Feb. 9, 2007], 700154=(c) Closed season. During the period July 1 through September 30 of each year, the treaty waters of Serrana and Roncador are closed to the harvest or possession of conch., 57383=[61 FR 35550, July 5, 1996, as amended at 64 FR 15, Jan. 4, 1999], 170365=(i) No later than February 5th of the year in which the licensing period begins; or, 255585=(b)(1) Each year, before January 1, NMFS will publish a proposal to govern the recreational fishery under the CSP for the following year and will seek public comment. The comment period will extend until after the Commission's annual meeting, so the public will have the opportunity to consider the final area 2A total allowable catch (TAC) before submitting comments. After the Commission's annual meeting and review of public comments, NMFS will publish in the Federal Register the final rule governing sport fishing in area 2A. Annual management measures may be adjusted inseason by NMFS., 860531=Special Agent-In-Charge (or SAC) means the Special-Agent-In-Charge, NOAA Office of Law Enforcement, Pacific Islands Division, 1845 Wasp Blvd., Bldg. 176, Honolulu, HI 96818; tel: 808-725-6100; facsimile: 808-725-6199; email: pidvms@noaa.gov, or a designee., 116984=(1) For the calendar year 2015, all commercial fishing vessels of the United States combined may capture, retain, transship, or land no more than 425 metric tons in the Convention Area., 865836=[72 FR 18405, Apr. 12, 2007, as amended at 74 FR 64010, Dec. 7, 2009; 75 FR 3347, Jan. 21, 2010; 77 FR 71509, Dec. 3, 2012; 78 FR 30778, May 23, 2013; 79 FR 64110, Oct. 28, 2014; 80 FR 8815, Feb. 19, 2015], 181823=(5) Except as provided in paragraph (n) of this section, no later than July 26th of each year, NMFS will send notifications by mail to all applicants that submitted expressions of interest or complete applications by June 1st of that year, indicating whether their applications (for the licensing period that starts the following year) have been pre-approved.}",
    "textBeforeTable": "Applicable national law means any of the laws of Pacific Island Parties in the following table and any regulations or other instruments having the force of law implemented pursuant to these laws: Administrator means the individual or organization designated by the Pacific Island Parties to act on their behalf under the Treaty and notified to the United States. In addition to the terms defined in §300.2, in the Act, and in the Treaty, and unless the context requires otherwise, the terms used in this subpart have the following meanings. If a term is defined differently in §300.2, the Act, or the Treaty, the definition in this section shall apply. §300.31   Definitions. Back to Top This subpart implements the South Pacific Tuna Act of 1988 (Act) and the Treaty on Fisheries Between the Governments of Certain Pacific Island States and the Government of the United States of America (Treaty) and applies to persons and vessels subject to the jurisdiction of the United States. §300.30   Purpose and scope. Back to Top Authority: 16 U.S.C. 973-973r. Subpart D—South Pacific Tuna Fisheries Back to Top [64 FR 44431, Aug. 16, 1999, as amended at 66 FR 49320, Sept. 27, 2001. Redesignated at 69 FR 67277, Nov. 17,",
    "textAfterTable": "NEW ZEALAND Territorial waters; waters within 6 nautical miles of outer boundary of territorial waters; all waters to west of New Zealand main islands and south of 39° South latitude; all waters to east of New Zealand main islands south of 40° South latitude; and in respect of Tokelau: areas within 12 nautical miles of all island and reef baselines; twelve and one half nautical miles either side of a line joining Atafu and Nukunonu and Faka'ofo; and coordinates as follows:     Atafu: 8°35′10″ S, 172°29′30″ W     Nukunonu: 9°06′25″ S, 171°52′10″ W 9°11′30″ S, 171°47′00″ W     Faka'ofo: 9°22′30″ S, 171°16′30″ W NIUE Territorial sea and within 3 nautical miles of Beveridge Reef, Antiope Reef",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}