{
    "relation": [
        [
            "Citing Patent",
            "US4470194 *",
            "US5113572 *",
            "US5361484 *",
            "US5577315 *",
            "US5621963 *",
            "US5685058 *",
            "US5752306 *",
            "US5864937 *",
            "US6004627 *",
            "US6017275 *",
            "US6524387",
            "US6779700",
            "US6968945",
            "US7344058",
            "US8616818",
            "US20050000835 *",
            "EP1847351A1 *",
            "WO1996001167A1 *",
            "WO1998030339A1 *"
        ],
        [
            "Filing date",
            "Sep 13, 1982",
            "Oct 17, 1990",
            "Dec 20, 1991",
            "Jun 6, 1995",
            "Jun 6, 1995",
            "Jun 6, 1995",
            "Jun 6, 1995",
            "Dec 20, 1996",
            "Jan 7, 1997",
            "Jul 3, 1995",
            "Apr 23, 1999",
            "Feb 20, 2001",
            "Jul 13, 2004",
            "Jun 21, 2006",
            "Feb 17, 2011",
            "Jul 13, 2004",
            "Apr 13, 2007",
            "Jul 3, 1995",
            "Jan 6, 1998"
        ],
        [
            "Publication date",
            "Sep 11, 1984",
            "May 19, 1992",
            "Nov 8, 1994",
            "Nov 26, 1996",
            "Apr 22, 1997",
            "Nov 11, 1997",
            "May 19, 1998",
            "Feb 2, 1999",
            "Dec 21, 1999",
            "Jan 25, 2000",
            "Feb 25, 2003",
            "Aug 24, 2004",
            "Nov 29, 2005",
            "Mar 18, 2008",
            "Dec 31, 2013",
            "Jan 6, 2005",
            "Oct 24, 2007",
            "Jan 18, 1996",
            "Jul 16, 1998"
        ],
        [
            "Applicant",
            "Omega Officine Meccaniche S.P.A.",
            "The Ball And Socket Manufacturing Company Of Delaware, Inc.",
            "The Boeing Company",
            "The Boeing Company",
            "The Boeing Company",
            "The Boeing Company",
            "The Boeing Company",
            "Direct Tool, Inc.",
            "Nylok Fastener Corporation",
            "Loctite (Ireland) Limited",
            "Nylon Corporation",
            "National Nail Corp.",
            "National Nail Corp.",
            "National Nail Corporation",
            "Raytheon Company",
            "Bruins Roger C.",
            "S.M.A.R.T. S.R.L.",
            "Loctite Ireland Ltd",
            "Nylok Fastener Corp"
        ],
        [
            "Title",
            "Device for slipping washers and like onto shanks of screws and the like",
            "Machine and method for automatically assembling buttons",
            "Method of guiding a rivet around a curve",
            "Method of upsetting rivets",
            "Differential capacitance in an electromagnetic riveter",
            "Method for direct insertion of a headed rivet into a countersunk hole",
            "Method for upsetting a headed rivet by differential initiation of opposed electromagnetic rivet drivers",
            "Bolt and washer assembly machine and method of assembly",
            "Method and apparatus for applying a coating to the head/shank junction of externally threaded articles",
            "Apparatus for inserting pins",
            "Powder feed apparatus and process for the application of a thermoplastic resin onto a fastener",
            "Cap assembly and cap feeder for automatic fastener driver",
            "Cap assembly and cap for automatic fastener driver",
            "Automatic washer feeder for automatic nailer",
            "Gripping washer having one or more deformable gripping tabs and method for reducing foreign object debris",
            "Cap assembly and cap feeder for automatic fastener driver",
            "Improved device for fitting washers on a blank",
            "Pin etc. placement",
            "Method and apparatus for applying a coating to the head-shank junction of externally threaded articles"
        ]
    ],
    "pageTitle": "Patent US4309787 - Methods and apparatuses for assembling washer members with fastener members - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4309787?ie=ISO-8859-1&dq=4316055",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981921.1/warc/CC-MAIN-20150728002301-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475119747,
    "recordOffset": 475081828,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It should also be further understood that the helix angle should preferably be as small as possible which would provide for high speed operation. When the helix angle is small and the length through which the shank of the fastener is to be moved is substantial, the length of the arcuate cams 26', 26\" must be increased. As can be seen in the apparatus 540, two assembly wheels have been utilized to extend the effective length of the helical cam. It should be understood that if the fastener is to be moved greater shank lengths, the diameter of the assembly wheels may be increased or additional subsequent assembly wheels may be provided. It should be understood that it is within the contemplation of this invention that a feeder wheel be used to feed the fasteners 542 into the primary assembly wheel 574 and accordingly eliminate the need for the hook portion 587 to allow the cam surface 28' to be positioned further inwardly. Accordingly, the cam surface 28' may extend radially inwardly of the center 250a' of the fastener 542. As seen in FIG. 23, the present invention also provides means 506' for ejecting washers from the primary assembly wheel 574 when no fastener is present. As the assembly wheel 576 continues to rotate, the cam surface 518' is shaped to cam the washer fastener assembly out of the pocket 580 and onto a pair of",
    "textAfterTable": "US7344058 Jun 21, 2006 Mar 18, 2008 National Nail Corporation Automatic washer feeder for automatic nailer US8616818 Feb 17, 2011 Dec 31, 2013 Raytheon Company Gripping washer having one or more deformable gripping tabs and method for reducing foreign object debris US20050000835 * Jul 13, 2004 Jan 6, 2005 Bruins Roger C. Cap assembly and cap feeder for automatic fastener driver EP1847351A1 * Apr 13, 2007 Oct 24, 2007 S.M.A.R.T. S.R.L. Improved device for fitting washers on a blank WO1996001167A1 * Jul 3, 1995 Jan 18, 1996 Loctite Ireland Ltd Pin etc. placement WO1998030339A1 * Jan 6, 1998 Jul 16, 1998 Nylok Fastener Corp Method and apparatus for applying a coating to the head-shank junction of externally threaded articles * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}