{
    "relation": [
        [
            "Citing Patent",
            "US7267694 *",
            "US7682330",
            "US7815589",
            "US7846174",
            "US7896911 *",
            "US8029557",
            "US8100931",
            "US8128677",
            "US8137301",
            "US8162871",
            "US8167894",
            "US8303669",
            "US8323243",
            "US8500821",
            "US8529431",
            "US8529597",
            "US8603188",
            "US8603189",
            "US8628583",
            "US8672831",
            "US8673020",
            "US8800842 *",
            "US8801599",
            "US8834405",
            "US8840655",
            "US8864809",
            "US8876800",
            "US8894670",
            "US8979941",
            "US8992410",
            "US9055998",
            "US9084669",
            "US20050075622 *",
            "US20050080491 *",
            "US20110004237 *",
            "US20110301690 *",
            "US20120004590 *",
            "US20120067937 *",
            "US20130184813 *"
        ],
        [
            "Filing date",
            "Nov 30, 2004",
            "",
            "",
            "Aug 8, 2006",
            "Dec 12, 2007",
            "Jun 19, 2009",
            "Oct 29, 2010",
            "Jun 11, 2009",
            "May 26, 2009",
            "",
            "Aug 8, 2007",
            "",
            "Mar 20, 2009",
            "Jun 19, 2009",
            "Aug 11, 2009",
            "May 19, 2010",
            "Jul 15, 2010",
            "Jul 15, 2010",
            "Sep 14, 2012",
            "Dec 20, 2011",
            "Jul 20, 2012",
            "Sep 16, 2011",
            "Dec 27, 2013",
            "Jun 28, 2011",
            "Aug 8, 2007",
            "Aug 8, 2007",
            "Dec 17, 2010",
            "Aug 13, 2009",
            "Aug 8, 2007",
            "Nov 3, 2011",
            "Jul 24, 2012",
            "Dec 10, 2013",
            "Nov 30, 2004",
            "Nov 30, 2004",
            "",
            "",
            "",
            "Sep 16, 2011",
            "Mar 5, 2013"
        ],
        [
            "Publication date",
            "Sep 11, 2007",
            "Mar 23, 2010",
            "Oct 19, 2010",
            "Dec 7, 2010",
            "Mar 1, 2011",
            "Oct 4, 2011",
            "Jan 24, 2012",
            "Mar 6, 2012",
            "Mar 20, 2012",
            "Apr 24, 2012",
            "May 1, 2012",
            "Nov 6, 2012",
            "Dec 4, 2012",
            "Aug 6, 2013",
            "Sep 10, 2013",
            "Sep 10, 2013",
            "Dec 10, 2013",
            "Dec 10, 2013",
            "Jan 14, 2014",
            "Mar 18, 2014",
            "Mar 18, 2014",
            "Aug 12, 2014",
            "Aug 12, 2014",
            "Sep 16, 2014",
            "Sep 23, 2014",
            "Oct 21, 2014",
            "Nov 4, 2014",
            "Nov 25, 2014",
            "Mar 17, 2015",
            "Mar 31, 2015",
            "Jun 16, 2015",
            "Jul 21, 2015",
            "Apr 7, 2005",
            "Apr 14, 2005",
            "Jan 6, 2011",
            "Dec 8, 2011",
            "Jan 5, 2012",
            "Mar 22, 2012",
            "Jul 18, 2013"
        ],
        [
            "Applicant",
            "Gi Dynamics, Inc.",
            "Gi Dynamics, Inc.",
            "Gi Dynamics, Inc.",
            "Bfkw, Llc",
            "Innovasc Llc",
            "Vysera Biomedical Limited",
            "Bfkw, Llc",
            "Intact Vascular LLC",
            "Gi Dynamics, Inc.",
            "Gi Dynamics, Inc.",
            "Coherex Medical, Inc.",
            "Gi Dynamics, Inc.",
            "Innovasc Llc",
            "Vysera Biomedical Limited",
            "Bfkw, Llc",
            "Coherex Medical, Inc.",
            "Vysera Biomedical Limited",
            "Vysera Biomedical Limited",
            "Gi Dynamics, Inc.",
            "Bfkw, Llc",
            "Vysera Biomedical Limited",
            "Thomas E. Menzel",
            "Bfkw, Llc",
            "Gi Dynamics, Inc.",
            "Coherex Medical, Inc.",
            "Coherex Medical, Inc.",
            "Vysera Biomedical Limited",
            "Bfkw, Llc",
            "Coherex Medical, Inc.",
            "Vysera Biomedical Limited",
            "Bfkw, Llc",
            "Gi Dynamics, Inc.",
            "Gi Dynamics, Inc.",
            "Gi Dynamics, Inc.",
            "Peter Schneider",
            "Innovasc Llc",
            "Barosense, Inc",
            "Menzel Thomas E",
            "Cardiaq Valve Technologies, Inc."
        ],
        [
            "Title",
            "Bariatric sleeve",
            "Intestinal sleeve",
            "Methods and apparatus for anchoring within the gastrointestinal tract",
            "Bariatric device and method",
            "Device and method for tacking plaque to blood vessel wall",
            "Esophageal valve",
            "Bariatric device and method",
            "Device and method for tacking plaque to a blood vessel wall",
            "Bariatric sleeve",
            "Bariatric sleeve",
            "Methods, systems and devices for reducing the size of an internal tissue opening",
            "Methods and apparatus for anchoring within the gastrointestinal tract",
            "Device and method for opening blood vessels by pre-angioplasty serration and dilatation of atherosclerotic plaque",
            "Esophageal valve device for placing in the cardia",
            "Bariatric device and method",
            "Devices for reducing the size of an internal tissue opening",
            "Medical device suitable for treating reflux from a stomach to an oesophagus",
            "Medical device suitable for treating reflux from a stomach to an oesophagus",
            "Methods and apparatus for anchoring within the gastrointestinal tract",
            "Bariatric device and method",
            "Esophageal valve device for placing in the cardia",
            "Internal gastric bander for obesity",
            "Bariatric device and method",
            "Intestinal sleeve",
            "Systems and devices for reducing the size of an internal tissue opening",
            "Systems and devices for reducing the size of an internal tissue opening",
            "Urological device",
            "Mucosal capture fixation of medical device",
            "Devices for reducing the size of an internal tissue opening",
            "Urological device",
            "Bariatric device and method for recipient with altered anatomy",
            "Methods and apparatus for anchoring within the gastrointestinal tract",
            "Bariatric sleeve",
            "Bariatric sleeve delivery devices",
            "Minimal surface area contact device for holding plaque to blood vessel wall",
            "Endovascular staple",
            "Satiation pouches and methods of use",
            "Internal gastric bander for obesity",
            "Body cavity prosthesis"
        ]
    ],
    "pageTitle": "Patent US7087088 - Methods and apparatus for regulating the flow of matter through body tubing - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7087088?dq=7,403,220",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484946387,
    "recordOffset": 484906184,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6447=Band 1202 may be expanded in direction R to engage anchors 1210 and 1220 with biological tissue of a biological passage. When band 1202 expands in direction R, it may also expand in directions P. When band 1202 expands in directions P, upper lobes such as lobe 1208 may move farther apart from each other, lower lobes such as lobe 1218 may move farther apart from each other, and connecting portions such as portion 1228 may move farther apart from each other. During the expansion of band 1200, upper lobe 1208 and lower lobe 1218 may move in directions X and Y (shown in FIG. 12), respectively. During expansion of band 1202, plane MAP, and any anchor or anchors positioned in or near plane MAP, may be stationary or nearly stationary with respect to the biological passage in which apparatus 1200 is deployed.}",
    "TableContextTimeStampAfterTable": "{119681=In some embodiments, balloon 3390 may have a uniform compliance. In some of those embodiments, anchor 3310 may be crimped by balloon dilation. For example, the size of band 3302 may be chosen so that when band 3302 is maximally expanded, anchor 3310 is partially engaged in wall 2028. As balloon 3390 continues to dilate, regions 3380 may expand “around” and apply an axial crimping force to anchor 3310 as described above., 91086=Central axis C passes through bore 1230 of band 1202. In some embodiments, anchor 1210 may extend in a direction that has components parallel to axis C and radial direction R. In some embodiments, anchor 1210 may extend in a direction that is extends in (or nearly in) radial direction R., 120716=In some embodiments, anchor 3310 may be self-crimping. For example, balloon 3390, which in self-crimping embodiments may have compound or uniform compliance, may push anchor 3310 radially away from the center of lumen 2022 into wall 2028. The curvature of prongs 3330 (or, in the case of angled prongs like 2830, the angle of the prongs) may be selected to cause anchor 3310 to close in response to being radially driven into wall 2028., 160429=Apparatus 6600 may include band 6602 that may be secured against wall 2028. One or more fingers such as finger 6620 may extend from band 6602 into lumen 2022. Finger 6620 may be flexible. In some embodiments, finger 6620 may include one or more fibers. In some embodiments, finger 6620 may include one or more surface area enhancing features such as feature 6622., 120200=In some embodiments of the invention, band 3302 may have compound compliance. A first compliance may dominate when band 3302 is expanded toward wall 2028 and when anchor 3310 is partially engaged in wall 2028. A second compliance may dominate when anchor 3310 are crimped. The second compliance may be less than the first compliance to “bind” balloon 3390 to cause portions 3380 to generate axial forces on anchors 3310., 92446=One or more of anchors 1210 and 1220 may engage biological tissue. Band 1202 may be allowed to contract in direction I to draw the tissue toward axis C. (Direction I is the opposite of radial direction R, but is shown separately from direction R for the sake of clarity.) During contraction, upper lobes such as lobe 1208 may move closer to each other, lower lobes such as lobe 1218 may move closer to each other, and connecting portions such as portion 1228 may move closer to each other. During contraction of band 1202, plane MAP, and any anchor or anchors positioned in or near plane MAP, may be stationary or nearly stationary with respect to the biological passage in which apparatus 1200 is deployed. Barb 1212 may secure tissue to anchor 1210 during contraction. Barb 1212 may continue to secure tissue to anchors 1210 after contraction is complete., 32238=This claims the benefit of copending U.S. Provisional Patent Applications Nos. 60/293,345, filed May 24, 2001, and 60/350,394, filed Jan. 22, 2002, which are hereby incorporated by reference herein in their entireties., 88376=In some embodiments, anchor 1210 may be present on or near medial axial plane MAP. Plane MAP may be on or near the longitudinal center of apparatus 1200. In some embodiments, one or more anchors may be present on band 1202 not on or near plane MAP. In some of those embodiments, one or more anchors may be present on the lobes. (Although plane MAP is shown in connection with apparatus 1200, plane MAP may be shown in connection with other embodiments of the invention to illustrate aspects of those embodiments that may correspond to aspects of apparatus 1200.), 105607=In some embodiments, head 2014 may be positioned in wall 2028 near inner face 2032 to avoid applying stress to the portion of wall 2028 near outer surface 2036 when anchor 2110 is drawn toward lumen 2022. In some embodiments, head 2014 may be positioned in wall 2028 near outer surface 2036 to enable head 2014 to be supported by a large portion of the tissue of wall 2028 when anchor 2110 is drawn toward lumen 2022., 118565=In some embodiments, balloon 3390 may include central region 3304 having a compliance greater than the compliance of regions 3306 and 3308. In those embodiments, as balloon 3390 is dilated in the second dilation stage, regions 3306 and 3308 may expand more than central region 3304. Some embodiments may include balloon portions 3380, which may be near the transitions between regions of different compliances. Portions 3380 may apply force to anchor 3310 to crimp anchor 3310 into a secure configuration. Anchor 3310 may be permanently secured, or locked, into wall 2028., 90900=Similarly, ends A and B will be used to illustrate aspects of other embodiments of the invention that may correspond to aspects of apparatus 1200., 89006=Lower lobe 1218 and upper lobe 1208 may be open in directions Y and X, respectively. The presence of open lobes is a feature that may be referred to as “open cell” design. The number of upper and lower lobes present between ends A and B may be less than or greater than the number shown. Lower lobe 1218 may be coupled to upper lobe 1208 by a connecting portion such as connecting portion 1228. In some embodiments, one or more anchors may be present on one or more connecting portions., 84867=In some embodiments, a retracted anchor may extend in the distal direction as does anchor 1106. In some embodiments, a retracted anchor may extend in the proximal direction as does anchor 1107. In some embodiments, a retracted anchor may extend in the radial direction (not shown). Balloon 1102 may be partially inflated to retain and position band 1100. The position of balloon 1102 may be controlled by catheter shaft 1108., 100401=Any suitable mechanism for allowing a connecting member such as 1528 to reduce movement in directions X and Y when band 1502 expands or contracts may be used. For example, a connecting member may be a flexible coil coupled to rigid members 1550 and 1560. When band 1502 expands, the coil may expand. When band 1502 contracts, the coil may contract. Some embodiments of the invention may include a connecting member that has reciprocating elements that may cause the connecting member to lengthen or shorten in response to 20 band expansion and contraction, respectively. In some embodiments, connecting members 1528 may be referred to as “transition” members.}",
    "textBeforeTable": "Patent Citations Thus it is seen that improved apparatus and methods for reducing the diameter of a portion of a biological passage have been provided. Apparatus and methods for lining a portion of a biological passage have been provided. Apparatus and methods deploying a baffle in a portion of a biological passage have been provided. One skilled in the art will appreciate that the present invention can be practiced by other than the described embodiments, which are presented for purposes of illustration and not of limitation, and the present invention is limited only by the claims which follow. It will be appreciated by one skilled in the art that any feature illustrated with or without a reference numeral in any of the FIGS. herein, including, but not limited to, any anchor, portion of an anchor, band, portion of a band, liner, portion of a liner, finger, and/or portion of a finger, if present in an embodiment of the invention, may include any suitable attribute or suitable combination of attributes shown (with or without a reference numeral) or described in connection with any of the embodiments herein. . Member 6930 may include one or more surfaces such as surface 6940. FIG. 69 shows finger 6900 that may be included in an apparatus such as 6600. Finger 6900 may have tip 6920 which may project toward lumen 2022. In some embodiments, finger 6900 may taper",
    "textAfterTable": "US7267694 * Nov 30, 2004 Sep 11, 2007 Gi Dynamics, Inc. Bariatric sleeve US7682330 Mar 23, 2010 Gi Dynamics, Inc. Intestinal sleeve US7815589 Oct 19, 2010 Gi Dynamics, Inc. Methods and apparatus for anchoring within the gastrointestinal tract US7846174 Aug 8, 2006 Dec 7, 2010 Bfkw, Llc Bariatric device and method US7896911 * Dec 12, 2007 Mar 1, 2011 Innovasc Llc Device and method for tacking plaque to blood vessel wall US8029557 Jun 19, 2009 Oct 4, 2011 Vysera Biomedical Limited Esophageal valve US8100931 Oct 29, 2010 Jan 24, 2012 Bfkw, Llc Bariatric device and method US8128677 Jun 11, 2009 Mar 6, 2012 Intact Vascular LLC Device and method for tacking plaque to a blood vessel wall US8137301 May 26, 2009 Mar 20, 2012 Gi Dynamics,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}