{
    "relation": [
        [
            "Date",
            "Dec 27, 1985",
            "Feb 16, 1988",
            "Oct 31, 1990",
            "Sep 26, 1994",
            "Dec 7, 1998",
            "Sep 20, 2004"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: KABUSHIKI KAISHA TOSHIBA, 72, HORIKAWA-CHO, SAIWAI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:TANAKA, SHIGERU;REEL/FRAME:004499/0136 Effective date: 19851219",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            ""
        ]
    ],
    "pageTitle": "Patent US4673823 - Apparatus for operating cycloconverters in parallel fashion - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4673823?dq=5,729,594",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476108063,
    "recordOffset": 476077316,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations (8) Where respective cycloconverters are individually operated under a light load condition or under a heavy load condition, a distribution control is carried out to circulate current in the cycloconverters operated under the light load condition and to circulate less current in the cycloconverters operated under the heavy load condition, thus making it possible to prevent the current capacity of the converter from being increased. (7) Where circulating currents in respective cycloconverters are increased under the condition of a light load operation, a control is effected to decrease the number of distributed capacitors connected of the power factor compensating capacitor depending upon the magnitude of the circulating current command value, thus improving the operation efficiency. (6) Where the sum of a lagging reactive power of the entirety of the cycloconverter system exceed the capacity of the power factor compensating capacitor due to an overload operation, a control is conducted to maintain circulating current command values delivered to the respective cycloconverters at fixed values unequal to zero, thus always realizing an operation without losing the characteristic of the circulating current type cycloconverter. (5) It is possible to operate a plurality of cycloconverters with a high efficiency at the same time. (4) There is no possibility that an unnecessary circulating curren will flow, thus making it possible to reduce the capacity of power transformers or converters. (3) The capacity of the power factor compensating capacitor connected at the",
    "textAfterTable": "Siemens Aktiengesellschaft Method and apparatus for controlling inverters in parallel operation US4363101 * Apr 28, 1980 Dec 7, 1982 Westinghouse Electric Corp. Computerized power demand control in an electrochemical plant US4418380 * Sep 24, 1981 Nov 29, 1983 Tokyo Shibaura Denki Kabushiki Kaisha Method and apparatus for controlling the circulating current of a cycloconverter US4441032 * Jan 21, 1982 Apr 3, 1984 Hitachi, Ltd. Converter control apparatus for parallel connected multi-terminal direct current system US4529925 * Dec 16, 1983 Jul 16, 1985 Tokyo Shibaura Denki Kabushiki Kaisha Reactive power compensating cycloconverter US4570214 * Mar 29, 1984 Feb 11, 1986 Tokyo Shibaura Denki Kabushiki Kaisha Reactive power control cycloconverter JPS5914988A * Title not available * Cited by examiner Referenced by",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}