{
    "relation": [
        [
            "Citing Patent",
            "US7860038 *",
            "US8102849",
            "US8248982",
            "US8437275",
            "US8462667",
            "US8667144 *",
            "US8674957",
            "US8767620 *",
            "US8797581 *",
            "US8879471",
            "US8947199",
            "US9014042",
            "US9065876",
            "US20090031035 *",
            "US20110170573 *",
            "US20120032981 *",
            "US20120320413 *",
            "US20130109313 *",
            "US20130109314 *",
            "US20130346207 *",
            "US20140313550 *",
            "EP2587848A1 *",
            "WO2009142627A1 *",
            "WO2009150492A1 *",
            "WO2012059434A1 *"
        ],
        [
            "Filing date",
            "Oct 3, 2006",
            "Feb 12, 2009",
            "Nov 24, 2010",
            "Dec 11, 2009",
            "Aug 13, 2012",
            "Jul 24, 2008",
            "Feb 2, 2012",
            "Sep 21, 2009",
            "Mar 26, 2012",
            "Oct 18, 2011",
            "Jun 11, 2008",
            "Oct 28, 2011",
            "Jan 5, 2012",
            "Jul 24, 2008",
            "Sep 21, 2009",
            "Aug 4, 2010",
            "Mar 26, 2012",
            "",
            "Oct 27, 2011",
            "Dec 13, 2012",
            "Jul 1, 2014",
            "Sep 13, 2012",
            "May 20, 2008",
            "Jun 11, 2008",
            "Oct 28, 2011"
        ],
        [
            "Publication date",
            "Dec 28, 2010",
            "Jan 24, 2012",
            "Aug 21, 2012",
            "May 7, 2013",
            "Jun 11, 2013",
            "Mar 4, 2014",
            "Mar 18, 2014",
            "Jul 1, 2014",
            "Aug 5, 2014",
            "Nov 4, 2014",
            "Feb 3, 2015",
            "Apr 21, 2015",
            "Jun 23, 2015",
            "Jan 29, 2009",
            "Jul 14, 2011",
            "Feb 9, 2012",
            "Dec 20, 2012",
            "May 2, 2013",
            "May 2, 2013",
            "Dec 26, 2013",
            "Oct 23, 2014",
            "May 1, 2013",
            "Nov 26, 2009",
            "Dec 17, 2009",
            "May 10, 2012"
        ],
        [
            "Applicant",
            "Microsoft Corporation",
            "Qualcomm, Incorporated",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Intel Corporation",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Electronics And Telecommunications Research Institute",
            "Brother Kogyo Kabushiki Kaisha",
            "Nokia Corporation",
            "Freescale Semiconductor, Inc.",
            "Institut National Des Sciences Appliquees De Lyon",
            "Qualcomm Incorporated",
            "Qualcomm Incorporated",
            "Electronics And Telecommunications Research Instit",
            "Tina Hackwell",
            "Brother Kogyo Kabushiki Kaisha",
            "Nokia Corporation",
            "Nokia Corporation",
            "Emily H. Qi",
            "Brother Kogyo Kabushiki Kaisha",
            "Nokia Corporation",
            "Qualcomm Incorporated",
            "Freescale Semiconductor, Inc.",
            "Ecole Normale Superieure De Lyon"
        ],
        [
            "Title",
            "Wireless support for portable media player devices",
            "Association procedure to enable multiple multicast streams",
            "Wireless support for portable media player devices",
            "Remote wireless service invocation with efficient power use on target wireless device",
            "Combined device and service discovery technique in stations supporting tunneled direct link setup (TDLS)",
            "Wireless architecture for traditional wire based protocol",
            "User input device for wireless back channel",
            "Method and apparatus for managing device discovery in wireless system",
            "Wireless communication device for establishing wireless connection with external device",
            "Method, apparatus, and computer program product for filtering list in wireless request",
            "Method and apparatus for enabling communication between a first device and at least one further device",
            "System and method for discovering surroundings for communicating objects",
            "User input back channel from a wireless sink device to a wireless source device for multi-touch gesture wireless displays",
            "Wireless architecture for traditional wire based protocol",
            "Method and apparatus for managing device discovery in wireless system",
            "Electronic Book With Configurable Display Panels",
            "Wireless communication device",
            "Method, apparatus, and computer program product for discovery of wireless networks",
            "Method, apparatus, and computer program product for stopping reception of discovery responses in wireless networks",
            "Wireless communication device and methods for synched distributed advertisement for device-to-device discovery",
            "Wireless communication device",
            "Method, apparatus, and computer program product for discovery of wireless networks",
            "Managing discovery in a wireless peer-to-peer network",
            "Method and apparatus for enabling communication between a first device and at least one further device",
            "System and method for discovering surroundings for communicating objects"
        ]
    ],
    "pageTitle": "Patent US20080031210 - Wireless support for portable media player devices - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20080031210?dq=5,072,412",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491791983,
    "recordOffset": 491762611,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6419=A timing diagram that illustrates a power save data transfer operation is shown in FIG. 13. A waveform 1300 illustrates operations in a portable media player device A, and a waveform 1310 illustrates operations in a portable media player device B. Device A and device B listen for probe request packets on a discovery channel during synchronized discovery windows 1320. At the end of the discovery window 1320 at time 1322, the devices switch from the discovery channel to a data channel and a data window announcement is sent from device A to device B. A heartbeat packet may be sent from device B to device A. Data packets are sent and received during a data window 1330 which may be relatively short in comparison with a discovery period 1332. Devices A and B then switch to power save mode during a time 1340 until the next discovery period begins. In the example of FIG. 13, the discovery window 1320 is 100 msec, the data window 1330 is 100 msec and the discovery period 1332 is 2000 msec.}",
    "TableContextTimeStampAfterTable": "{107741=1) The wireless module adjusts the starting time of its discovery window to be the same as device A's (the former of the ad hoc network) based on the active discovery result or the data window announcement, step 1200., 40972=2. Provisional Application Ser. No. 60/835,618, filed Aug. 4, 2006 and entitled “SYNCHRONIZATION BETWEEN WIRELESS DEVICES WHILE SAVING POWER.”, 108008=2) In the discovery window, the wireless module stays awake and parks at the discovery channel to perform passive discovery as described above, step 1202., 40806=1. Provisional Application Ser. No. 60/835,614, filed Aug. 4, 2006 and entitled “MANAGING ASSOCIATIONS IN AD HOC NETWORKS.”, 108212=3) The wireless module switches to the data channel, step 1204, that has been advertised in device A's (former) portable media player probe response packet by the time the data window starts. At this time, the wireless module sets the size of the current data window to Data Window Size, which is configured by the upper layer., 111295=7) When the next Discovery Window starts, the wireless module switches to the discovery channel and performs passive discovery, step 1202, as described above. Thus, passive discovery and data transfer are performed concurrently in a time sharing manner., 104147=1) The wireless module stays awake and parks at its own discovery channel in its discovery window to perform passive discovery, step 1100, as described above., 104616=3) The wireless module sends out a portable media player data window announcement packet, step 1104, immediately after the channel switch is completed., 111598=8) Steps 2) to 7) (steps 1202-1210) are repeated until the device leaves the ad hoc network., 104355=2) When the discovery window ends, the wireless module starts the data window. It immediately switches to the data channel, step 1102, that has been advertised in its portable media player probe response packet., 110843=5) The wireless module starts sending and receiving data packets to and from the ad hoc network former, step 1208., 109048=Otherwise, the wireless module receives a portable media player data window announcement packet, step 1206, from the former (device A) and does the following:, 106846=6) When the next Discovery Window starts, the wireless module switches to the discovery channel and performs passive discovery, step 1100, as described above. Thus, passive discovery and data transfer are performed concurrently in a time sharing manner., 106376=4) After sending out the data window announcement packet, the wireless module is ready for data packet receiving and sending, step 1106., 107149=7) Steps 1) to 6) (steps 1100-1108) are repeated until the ad hoc network does not have any joiner or is terminated., 40438=This application claims the benefit of Provisional Application Ser. No. 60/835,617, filed Aug. 4, 2006, which is hereby incorporated by reference in its entirety., 106562=5) When the current data window expires, the wireless module stops sending and receiving packets and turns off its wireless radio, step 1108, for power saving. If the data window is sufficiently long, power saving may not be achieved., 111007=6) When the current data window expires, the wireless module stops sending and receiving data packets and turns off its wireless radio for power saving, step 1210. If the data window is sufficiently long, power saving may not be achieved.}",
    "textBeforeTable": "Referenced by Having thus described several aspects of at least one embodiment of this invention, it is to be appreciated various alterations, modifications, and improvements will readily occur to those skilled in the art. Such alterations, modifications, and improvements are intended to be part of this disclosure, and are intended to be within the spirit and scope of the invention. Accordingly, the foregoing description and drawings are by way of example only. The above description and the accompanying drawings provide examples of values for various parameters, such as timing parameters. It will be understood that such values are given by way of example only and are not in any way limiting as to the scope of the invention. If a portable media player device is set to stop file sending, the device issues a disconnect call to wireless module as described above. Then it can immediately stop the file sending operation. Stop Sending File The file transfer applications on both file receiver (ad hoc former) and file sender (joiner) turn on the high speed data transfer mode before the data transfer starts in order to achieve a short file sending time. Operate in Sending File If a portable media player device is set to send a file to another portable media player device, the local device issues a connection call as described",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 370/338 International Classification H04W8/00, H04W84/18 Cooperative Classification Y02B60/50, H04W52/0229, H04W84/18, H04W8/005 European Classification H04W52/02T4A, H04W8/00D Legal Events Date Code Event Description Oct 26, 2006 AS Assignment Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ABHISHEK, ABHISHEK;SHEN, HUI;RUAN, JIANDONG;AND OTHERS;REEL/FRAME:018438/0102;SIGNING DATES FROM 20060928 TO 20061002 Owner name: MICROSOFT CORPORATION, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ABHISHEK, ABHISHEK;SHEN, HUI;RUAN, JIANDONG;AND OTHERS;SIGNING DATES FROM 20060928 TO 20061002;REEL/FRAME:018438/0102 May 28, 2014 FPAY Fee payment Year of fee payment: 4 Dec 9, 2014 AS Assignment",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}