{
    "relation": [
        [
            "Citing Patent",
            "US6484062 *",
            "US6656041",
            "US6702767",
            "US6783084 *",
            "US6899486",
            "US6962496",
            "US7154579",
            "US7249719 *",
            "US7269573 *",
            "US7331868",
            "US7347815",
            "US7562816 *",
            "US7578741",
            "US7578783 *",
            "US7789756",
            "US7883264 *",
            "US8090244",
            "US8295529",
            "US8897629",
            "US9005001",
            "US9076306",
            "US20040068547 *",
            "US20040131509 *",
            "US20040191750 *",
            "US20050032568 *",
            "US20050127207 *",
            "US20100270388 *",
            "US20100309434 *",
            "WO2002102433A2 *",
            "WO2003011416A2 *",
            "WO2003068018A1 *",
            "WO2003088627A2 *",
            "WO2006042972A1 *"
        ],
        [
            "Filing date",
            "Nov 30, 1999",
            "Oct 12, 2000",
            "Sep 25, 2001",
            "Nov 20, 2001",
            "Jul 14, 2003",
            "Jun 14, 2002",
            "Sep 27, 2004",
            "Aug 28, 2003",
            "Jul 13, 2000",
            "Sep 13, 2002",
            "Feb 12, 2003",
            "Dec 18, 2006",
            "Sep 10, 2004",
            "Feb 4, 2005",
            "",
            "Sep 26, 2005",
            "Jan 9, 2009",
            "Aug 28, 2007",
            "Jan 27, 2012",
            "Nov 3, 2011",
            "Feb 14, 2008",
            "Feb 6, 2002",
            "Aug 28, 2003",
            "Jun 14, 2002",
            "Sep 10, 2004",
            "Aug 9, 2004",
            "Apr 23, 2010",
            "Feb 9, 2009",
            "Jun 14, 2002",
            "Aug 2, 2002",
            "Feb 12, 2002",
            "Apr 7, 2003",
            "Oct 19, 2005"
        ],
        [
            "Publication date",
            "Nov 19, 2002",
            "Dec 2, 2003",
            "Mar 9, 2004",
            "Aug 31, 2004",
            "May 31, 2005",
            "Nov 8, 2005",
            "Dec 26, 2006",
            "Jul 31, 2007",
            "Sep 11, 2007",
            "Feb 19, 2008",
            "Mar 25, 2008",
            "Jul 21, 2009",
            "Aug 25, 2009",
            "Aug 25, 2009",
            "Sep 7, 2010",
            "Feb 8, 2011",
            "Jan 3, 2012",
            "Oct 23, 2012",
            "Nov 25, 2014",
            "Apr 14, 2015",
            "Jul 7, 2015",
            "Apr 8, 2004",
            "Jul 8, 2004",
            "Sep 30, 2004",
            "Feb 10, 2005",
            "Jun 16, 2005",
            "Oct 28, 2010",
            "Dec 9, 2010",
            "Dec 27, 2002",
            "Feb 13, 2003",
            "Aug 21, 2003",
            "Oct 23, 2003",
            "Apr 27, 2006"
        ],
        [
            "Applicant",
            "Hyun Kim",
            "Igt",
            "Nelson R. Douglas",
            "R. Douglas Nelson",
            "Eric L. Wetzel",
            "Quest International Servces B.V.",
            "Selander Raymond K",
            "The Dial Corporation",
            "Symbol Technologies, Inc.",
            "Igt",
            "Razz Serbanescu",
            "International Business Machines Corporation",
            "Igt",
            "Jurgen Klein",
            "Igt",
            "Liva Valentino L",
            "S.C. Johnson & Son, Inc.",
            "Bcinet, Inc.",
            "Scent Sciences Corporation",
            "Igt",
            "Igt",
            "Yong-Hee Kang",
            "He Mengtao Pete",
            "Houri Jean-Pierre Graziano",
            "Griswold Chauncey W.",
            "Xerox Corporation",
            "Inventec Appliances Corp.",
            "Koninklijke Philips Electronics N.V.",
            "Philippe Durand",
            "Iorgulescu Avram Vlad",
            "Pe Petz Electro Gmbh & Co Kg",
            "Joseph Manne",
            "Presensia"
        ],
        [
            "Title",
            "Computer system for stress relaxation and operating method of the same",
            "Gaming device for changing a player's environment",
            "Multisensory stimulation system and method",
            "Method and apparatus for olfactory stimulation",
            "Pen with a scented housing",
            "Recognition of scents in fragrances",
            "Fragrance delivery for multimedia systems",
            "Method and apparatus for a multiple source vapor-dispensing device",
            "Virtual-product presentation system",
            "Wagering gaming device providing physical stimulation responses to various components of the gaming device",
            "Method and apparatus for converting sense-perceived thoughts and actions into physical sensory stimulation",
            "Integrating touch, taste, and/or scent with a visual interface of an automated system for an enhanced user experience",
            "Wagering gaming device providing physical and visual stimulation responses to various components of the gaming device",
            "Sensory experience method and apparatus",
            "Wagering gaming device having simulated control of movement of game functional elements",
            "Method and apparatus for personal product delivery",
            "Volatile material dispenser",
            "Gaming headset with integrated microphone and adapted for olfactory stimulation",
            "Scent delivery apparatus",
            "Wagering gaming device having simulated control of movement of game functional elements",
            "Wagering gaming device providing physical stimulation responses to various components of the gaming device",
            "Method for processing moving image/contents overlay, electronic mail processing method using the same, and computer-readable storage medium for storing program for execution of either of them",
            "Method and apparatus for a multiple source vapor-dispensing device",
            "Recognition of scents in fragrances",
            "Wagering gaming device providing physical and visual stimulation responses to various components of the gaming device",
            "Micromechanical dispensing device and a dispensing system including the same",
            "Atmosphere simulation method and electronic apparatus having a function of simulating an atmosphere",
            "Fragrance dispenser",
            "Recognition of scents in fragrances",
            "Substance and microclimate simulator",
            "Device for storing and releasing odorous substances, flavors or the like",
            "Portable scent delivery device",
            "Multisensory animated picture"
        ]
    ],
    "pageTitle": "Patent US6169595 - Multimedia linked scent delivery system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6169595?dq=4740761",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472652399,
    "recordOffset": 472599570,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6029=One group that has studied this problem (Jamison D. K. and Villemonte JR. Junction Losses in Laminar and Transitional Flows. Proc. Am. Soc Civil Engineers. Hydraulics Div.July 1971, pg. 1045-1063) has reorganized this equation so that the heat loss terms are equated to the head loss terms. The equation for the total loss through the tee can be expressed in terms of kinetic energy and head losses through the two branches of the tee: hFm = ( ρ γ + α  V 2 2  g ) 1  Q1 Qm + ( ρ γ + α  V 2 2  g ) 2  Q1 Qm - ( ρ γ + α  V 2 2  g ) m - hf1  Q1 Qm - hf2  Q2 Qm - hfm ( 17 )}",
    "TableContextTimeStampAfterTable": "{225420=Jamison and Villemonte (Jamison D. K. and Villemonte JR. Junction Losses in Laminar and Transitional Flows. Proc. Am. Soc Civil Engineers. Hydraulics Div.July 1971, pg. 1045-1063) determined the loss coefficients for laminar divided flow in a tee. Let Vm be the flow entering the tee, V1 the flow exiting the straight part of the tee, V2 the flow exiting the side branch of the tee. Let Rm, R1, R2 be the corresponding reynolds numbers for those three segments. This side branch will be the nasal branch described above., 249738=The next step is to use the value of “BUTTON” as one of the indices of an n x m matrix called “FRAME(i,j)”. The index i is replaced by the value of the variable button. Thus the i'th index refers to a row in the matrix FRAME which contain frame values for the moving image which was indexed by the variable BUTTON. The value of FRAME(BUTTON,O) for the specified movie, is the starting address for the series of frame intervals that make up the film. Each frame interval is defined as a group of video frames where the corresponding valve settings are constant. Each video can be divided up into a series of frame intervals: FRAME(BUTTON,j)→FRAME(BUTTON,j+1). The next step in the algorithm is to determine which interval the current frame falls into FRAME(BUTTON,j)→FRAME(BUTTON,j+1). 2000 bytes following the address for FRAME(BUTTON,0) are available for the variables FRAME(BUTTON,0)→FRAME(BUTTON,n). The value of n, for a specific movie, is the total number of frame intervals where valve settings for this invention remains constant., 241400=FIG. 6 a shows the entire electronic circuitry which allows the microcontroller to control the scent releasing device in conjunction with an analog video signal. The input 88 to the free standing microprocessor 34 is a VCR or television 39 or other videographic NTSC signal (or other compatible signal). FIG. 6 shows a magnified view of a commercially supplied microprocessor which can be used in the circuit shown in 6 a. The input can also come from a larger motion picture generating device such as that used in a movie theatre or drive-in. A schematic of the video signal is shown in the figure. It can be seen that there are different digital synchronization signals (such as the front porch or back porch, as well as analog video signal. Each one of these signals has a characteristic single voltage or voltage range. The standard video signal goes from one volt peak to peak. This voltage is broken up into 140 even divisions referred to as IRE's( Institute of Radio Engineer's) units. There are 7.1429 millivolts per IRE., 84205=Now we will calculate the mole fraction of A in the gas stream exiting the fragrance chamber based on the gas flow rate. For this example the smallest gas flow rate which will reliably produce turbulent flow will be used. For tubing with a radius of 1 cm a gas flow rate of 500 cc/sec will produce flow with a reynolds number of 2143.Thus this is the lowest gas flow which will produce turbulent flow in a smooth tubing system., 32235=This application is a continuation of U.S. patent application Ser. No. 08/887,622 filed Jul. 3, 1997, now U.S. Pat. No. 5,949,522 issued Sep. 7, 1999, which in turn claimed the priority of U.S. Provisional Application Ser. No. 60/021,190 filed Jul. 3, 1996., 244397=As shown in FIG. 6 a BSII pin 0 connects to the “data in” port of the shift register 92. BS pin 1 connects to the clock pin labelled “clk”. The third connection is from BS pin 2 to the “latch” pin on the register 92. Thus 8 bits of data can be “latched on” to the 8 output pins Qa through QH. Until new data is latched onto the shift register these output pins QA through QH remain in the data states that they are set. The output from these pins goes to an industrial power switch 94 labelled LM1921. It can be seen from the figure that the output from the shift register goes to pin 5 of the DC switch 94, which turns the switch on or off. The supply voltage goes through pin 1 Vcc. It passes out through pin 2 which leads to Vout.}",
    "textBeforeTable": "Patent Citations Thus the scope of the invention should be determined by the appended claims and their legal equivalents, rather than by the examples given. Another use of the system would be as an adjunct to sedation or anxiety treatment for patients, whereby a specific scent or a combination of scents which are known to produce anxiolysis could be used with or without soothing video images or music. Another use of the system would be for the burgeoning field of aroma therapy. In this case the aromatherapist could preprogram a specific sequence of scents for their patient to smell over a specific period of time.This embodiment of the invention would not require the video or music interface to the nicrocontroller. This invention could also be modified to produce scents in conjunction with music alone rather than video images. In this case the output from a CD player or cassette player would be fed into the microcontroller. In the case of the CD output there is an embedded signal which indicates the track and section of the CD which is being played. The voltage output from a cassette player can be used to indicate the beginning and end of the tape as well as specific pieces of music. In addition to the electronic timer and the speed of the tape player, the exact position on the tape can be available to the microcontroller. This will then lead to the",
    "textAfterTable": "US7331868 Sep 13, 2002 Feb 19, 2008 Igt Wagering gaming device providing physical stimulation responses to various components of the gaming device US7347815 Feb 12, 2003 Mar 25, 2008 Razz Serbanescu Method and apparatus for converting sense-perceived thoughts and actions into physical sensory stimulation US7562816 * Dec 18, 2006 Jul 21, 2009 International Business Machines Corporation Integrating touch, taste, and/or scent with a visual interface of an automated system for an enhanced user experience US7578741 Sep 10, 2004 Aug 25, 2009 Igt Wagering gaming device providing physical and visual stimulation responses to various components of the gaming device US7578783 * Feb 4, 2005 Aug 25, 2009 Jurgen Klein Sensory experience method and apparatus US7789756 Sep 7, 2010 Igt Wagering gaming device having simulated control of movement of game functional elements US7883264 * Sep 26, 2005 Feb 8, 2011 Liva Valentino L Method and apparatus for personal",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}