{
    "relation": [
        [
            "Date",
            "May 12, 2005",
            "Dec 9, 2005",
            "Jun 12, 2008",
            "Dec 14, 2010",
            "Apr 24, 2013",
            "May 10, 2013",
            "Jul 24, 2013",
            "Jul 24, 2013",
            "Apr 29, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "CC",
            "AS",
            "REMI",
            "SULP",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: CEDARA SOFTWARE CORPORATION, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ACCOMAZZI, VITTORIO;LAZAROWICH, RENEE;BARLOW, CHRISTOPHER J.;AND OTHERS;REEL/FRAME:016363/0425;SIGNING DATES FROM 20050208 TO 20050219 Owner name: CEDARA SOFTWARE CORPORATION, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ACCOMAZZI, VITTORIO;LAZAROWICH, RENEE;BARLOW, CHRISTOPHER J.;AND OTHERS;REEL/FRAME:016284/0810;SIGNING DATES FROM 20050208 TO 20050219",
            "Owner name: CEDARA SOFTWARE CORP., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ACCOMAZZI, VITTORIO;LAZAROWICH, RENEE;BARLOW, CHRISTOPHER J.;AND OTHERS;REEL/FRAME:017108/0972;SIGNING DATES FROM 20051024 TO 20051121",
            "Owner name: MERRICK RIS, LLC, ILLINOIS Free format text: SECURITY AGREEMENT;ASSIGNOR:CEDARA SOFTWARE CORP.;REEL/FRAME:021085/0154 Effective date: 20080604",
            "",
            "Owner name: JEFFERIES FINANCE LLC, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNORS:MERGE HEALTHCARE INCORPORATED;MERGE ASSET MANAGEMENT CORP.;MERGE ECLINICAL INC.;AND OTHERS;REEL/FRAME:030281/0510 Effective date: 20130423",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: MERGE SH HOLDINGS, INC., WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: MERGE ECLINICAL INC., WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: GUGGENHEIM CORPORATE FUNDING, LLC, AS COLLATERAL A Free format text: PATENT SECURITY AGREEMENT;ASSIGNORS:MERGE HEALTHCARE INCORPORATED;MERGE ASSET MANAGEMENT CORP.;MERGE ECLINICAL INC.;AND OTHERS;REEL/FRAME:032784/0644 Effective date: 20140429 Owner name: REQUISITE SOFTWARE INC., WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: MERGE HEALTHCARE SOLUTIONS INC., WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: MERGE HEALTHCARE INCORPORATED, ILLINOIS Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: MERGE INTERACTIVE, INCORPORATED, WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: MERGE ASSET MANAGEMENT CORP., WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429 Owner name: MERGE SF HOLDINGS, INC., WISCONSIN Free format text: TERMINATION AND RELEASE OF SECURITY INTEREST (PATENTS) (REEL 030281/FRAME 0510);ASSIGNOR:JEFFERIES FINANCE LLC, AS COLLATERAL AGENT;REEL/FRAME:032784/0850 Effective date: 20140429"
        ]
    ],
    "pageTitle": "Patent US7596267 - Image region segmentation system and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7596267?ie=ISO-8859-1&dq=7,453,150",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467747379,
    "recordOffset": 467716127,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6476=The algorithm to obtain the connectivity of a voxel to a seed point is depicted by the flow chart shown in FIG. 4. The sequence of steps composing the algorithm is indicated by the sequence of blocks 202 to 210. In block 202 the algorithm starts by selecting an unvisited path from the seed point to the voxel. The selection of a path may be performed by any suitable algorithm although the algorithm described by Dellepiane et al. in “Nonlinear Image Labeling for Multivalued Segmentation”, IEEE Transactions on Image Processing, Vol. 5, No. 3, March 1996, pp. 429-446, has been found to be particularly useful.}",
    "TableContextTimeStampAfterTable": "{32774=This application claims priority to U.S. Provisional Patent Application Ser. No. 60/450,975 filed on Feb. 28, 2003, the entire contents of which are incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described by way of a particular embodiment thereof, it should be noted that modifications may be applied to the present particular embodiment without departing from the scope of the present invention and remain within the scope of the appended claims. At block 522, the user, analyzing display 26, evaluates if the desired structure is displayed, if not, the user may return to block 518 to set a new threshold value to further expand or shrink the displayed structure. At block 520, the program 30 uses display 26 to show the user the structure associated with the selected threshold. At block 518, the user sets, using still user interface 24, the threshold representing the lowest connectivity value to be considered. It should be noted that if the user has set an expected volume at block 516, an optimal threshold value will have already been selected, though the user can still modify that value if so desired. At block 516, the user has the option to set, using the user interface 24, an expected volume in order to automatically compute the optimal threshold. At block 514, the program 30 computes the connectivity values according to Equation 6 in accordance with the path weight value set at block 510. It should be noted that Equation 6 is performed on the modified data-set, meaning the output of block",
    "textAfterTable": "G06T7/00S1, G06K9/46A3, G06K9/34R Legal Events Date Code Event Description May 12, 2005 AS Assignment Owner name: CEDARA SOFTWARE CORPORATION, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ACCOMAZZI, VITTORIO;LAZAROWICH, RENEE;BARLOW, CHRISTOPHER J.;AND OTHERS;REEL/FRAME:016363/0425;SIGNING DATES FROM 20050208 TO 20050219 Owner name: CEDARA SOFTWARE CORPORATION, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ACCOMAZZI, VITTORIO;LAZAROWICH, RENEE;BARLOW, CHRISTOPHER J.;AND OTHERS;REEL/FRAME:016284/0810;SIGNING DATES FROM 20050208 TO 20050219 Dec 9, 2005 AS Assignment Owner name: CEDARA SOFTWARE CORP., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ACCOMAZZI, VITTORIO;LAZAROWICH, RENEE;BARLOW, CHRISTOPHER J.;AND OTHERS;REEL/FRAME:017108/0972;SIGNING DATES FROM 20051024 TO 20051121 Jun 12, 2008 AS Assignment Owner name: MERRICK RIS, LLC, ILLINOIS Free format text: SECURITY AGREEMENT;ASSIGNOR:CEDARA SOFTWARE CORP.;REEL/FRAME:021085/0154 Effective date: 20080604 Dec 14, 2010 CC Certificate of correction",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}