{
    "relation": [
        [
            "Citing Patent",
            "US7401353 *",
            "US7559082 *",
            "US7594259 *",
            "US7676675 *",
            "US8191131",
            "US8443101 *",
            "US8677469 *",
            "US8819201 *",
            "US20040148524 *",
            "US20040250130 *",
            "US20050005165 *",
            "US20090109886 *",
            "US20110113483 *",
            "EP1492299A2 *",
            "WO2007134023A2 *"
        ],
        [
            "Filing date",
            "Oct 21, 2003",
            "Jun 25, 2003",
            "Sep 15, 2004",
            "Jun 6, 2003",
            "Aug 23, 2006",
            "Apr 9, 2010",
            "Mar 30, 2006",
            "Aug 7, 2008",
            "Oct 21, 2003",
            "Jun 6, 2003",
            "Jun 25, 2003",
            "Oct 16, 2008",
            "Nov 11, 2009",
            "May 12, 2004",
            "May 8, 2007"
        ],
        [
            "Publication date",
            "Jul 15, 2008",
            "Jul 7, 2009",
            "Sep 22, 2009",
            "Mar 9, 2010",
            "May 29, 2012",
            "May 14, 2013",
            "Mar 18, 2014",
            "Aug 26, 2014",
            "Jul 29, 2004",
            "Dec 9, 2004",
            "Jan 6, 2005",
            "Apr 30, 2009",
            "May 12, 2011",
            "Dec 29, 2004",
            "Nov 22, 2007"
        ],
        [
            "Applicant",
            "Stonesoft Corporation",
            "Microsoft Corporation",
            "Nortel Networks Limited",
            "Microsoft Corporation",
            "International Business Machines Corporation",
            "The United States Of America As Represented By The Secretary Of The Navy",
            "Fujitsu Limited",
            "At&T Intellectual Property I, L.P.",
            "Stonesoft Corporation",
            "Billharz Alan M.",
            "Microsoft Corporation",
            "Canon Kabushiki Kaisha",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Mistletoe Technologies Inc"
        ],
        [
            "Title",
            "Detecting and blocking malicious connections",
            "Method of assisting an application to traverse a firewall",
            "Method and system for enabling firewall traversal",
            "Architecture for connecting a remote client to a local client desktop",
            "Obscuring authentication data of remote user",
            "Method for identifying and blocking embedded communications",
            "Firewall device",
            "Method and apparatus for providing routing and access control filters",
            "Detecting and blocking malicious connections",
            "Architecture for connecting a remote client to a local client desktop",
            "Method of assisting an application to traverse a firewall",
            "Wireless communication apparatus and method of controlling the same",
            "Virtual host security profiles",
            "Method of assisting an application to traverse a firewall",
            "Portable firewall"
        ]
    ],
    "pageTitle": "Patent US20040128545 - Host controlled dynamic firewall system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040128545?dq=6462713",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474127491,
    "recordOffset": 474103555,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49767=[0037] FTP uses two different modes of operation, normal and passive. In normal FTP, the client sends a request for FTP along with the random port number on which it wants the server to send the data to be transferred. The FTP server then opens a data connection to the client on this port, usually between 1024-5000. This type of FTP is also called active FTP because the server actively opens a connection back to the client. In passive FTP, the server sends the port number on which it will send to the client the data to be transferred. The client then opens a data connection on the server on the indicated port. Since the server does not actively open a data connection on the client, this type of connection is called passive FTP.}",
    "textBeforeTable": "Patent Citations [0047] The description of the present invention has been presented for purposes of illustration but is not intended to be exhaustive or limited to the disclosed embodiments. Many modifications and variations will be apparent to those of ordinary skill in the art. The embodiments were chosen to explain the principles of the invention and its practical applications and to enable others of ordinary skill in the art to understand the invention in order to implement various embodiments with various modifications as might be suited to other contemplated uses. [0046] A method is generally conceived to be a self-consistent sequence of steps leading to a desired result. These steps require physical manipulations of physical quantities. Usually, though not necessarily, these quantities take the form of electrical or magnetic signals capable of being stored, transferred, combined, compared, and otherwise manipulated. It is convenient at times, principally for reasons of common usage, to refer to these signals as bits, values, parameters, items, elements, objects, symbols, characters, terms, numbers, or the like. It should be noted, however, that all of these terms and similar terms are to be associated with the appropriate physical quantities and are merely convenient labels applied to these quantities. [0045] It is important to note that while the present invention has been described in the context of a fully functioning data processing system, those of ordinary skill in",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US7401353 * Oct 21, 2003 Jul 15, 2008 Stonesoft Corporation Detecting and blocking malicious connections US7559082 * Jun 25, 2003 Jul 7, 2009 Microsoft Corporation Method of assisting an application to traverse a firewall US7594259 * Sep 15, 2004 Sep 22, 2009 Nortel Networks Limited Method and system for enabling firewall traversal US7676675 * Jun 6, 2003 Mar 9, 2010 Microsoft Corporation Architecture for connecting a remote client to a local client desktop US8191131 Aug 23, 2006 May 29, 2012 International Business Machines Corporation Obscuring authentication data of remote user US8443101 * Apr 9, 2010 May 14, 2013 The United States Of America As Represented By The Secretary Of The Navy Method for identifying and blocking embedded communications US8677469",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}