{
    "relation": [
        [
            "Citing Patent",
            "US6161106 *",
            "US6229664 *",
            "US6342986",
            "US6356404",
            "US6430124",
            "US6603629 *",
            "US6683744",
            "US6721120",
            "US6775088",
            "US6785073",
            "US6882497",
            "US7054095 *",
            "US7154697",
            "US7520047",
            "US7911740",
            "US20020021523 *",
            "US20050007704 *",
            "EP1014349A2 *"
        ],
        [
            "Filing date",
            "Jul 28, 1998",
            "Aug 24, 1998",
            "Dec 8, 2000",
            "Jun 4, 1999",
            "Dec 17, 1999",
            "Jul 22, 1998",
            "Jul 19, 2001",
            "Apr 27, 2001",
            "Oct 31, 2001",
            "Apr 27, 2001",
            "Mar 4, 2002",
            "Apr 24, 2001",
            "Aug 9, 2004",
            "Sep 8, 2006",
            "Sep 8, 2006",
            "Apr 24, 2001",
            "Aug 9, 2004",
            "Dec 8, 1999"
        ],
        [
            "Publication date",
            "Dec 12, 2000",
            "May 8, 2001",
            "Jan 29, 2002",
            "Mar 12, 2002",
            "Aug 6, 2002",
            "Aug 5, 2003",
            "Jan 27, 2004",
            "Apr 13, 2004",
            "Aug 10, 2004",
            "Aug 31, 2004",
            "Apr 19, 2005",
            "May 30, 2006",
            "Dec 26, 2006",
            "Apr 21, 2009",
            "Mar 22, 2011",
            "Feb 21, 2002",
            "Jan 13, 2005",
            "Jun 28, 2000"
        ],
        [
            "Applicant",
            "Motorola, Inc.",
            "International Business Machines Corporation",
            "Seagate Technology Llc",
            "Seagate Technology Llc",
            "Thomson Licensing, Sa",
            "Excel Precision, Inc.",
            "Fuji Electric Co., Ltd.",
            "Seagate Technology Llc",
            "Seagate Technology Llc",
            "Seagate Technology Llc",
            "Seagate Technology Llc",
            "Canon Kabushiki Kaisha",
            "Seagate Technology Llc",
            "Xyratex Technology Limited",
            "Xyratex Technology Limited",
            "Koh Ishizuka",
            "Seagate Technology Llc",
            "Deutsche Thomson-Brandt Gmbh"
        ],
        [
            "Title",
            "Perishable media system and method of operation",
            "Head-disk interface tester with optically servo controlled rotary voice coil motor actuator",
            "Servo writing with simultaneous biasing of magneto-resistive read elements",
            "Simultaneously biasing multiple magneto-resistive read elements",
            "Apparatus for scanning optical recording media having a scanner and a travel measuring device",
            "Non-contact servo track writing apparatus and method",
            "Magnetic disk evaluation apparatus and method",
            "Prediction and cancellation of cage frequency in a disc drive",
            "Vertically-oriented servo track writer and method",
            "Identification and cancellation of cage frequency in a hard disc drive",
            "Track closure error cancellation for a disc drive",
            "Displacement detection apparatus, and magnetic recording apparatus and encoder using the displacement detection apparatus",
            "Vertically-oriented servo track writer and method",
            "Method and apparatus for loading a read/write head to a spinstand",
            "Apparatus and method for receiving and positioning a read/write head to a disk in a test apparatus",
            "Displacement detection apparatus, and magnetic recording apparatus and encoder using the displacement detection apparatus",
            "Vertically-oriented servo track writer and method",
            "Apparatus for reading from and/or writing to optical recording media"
        ]
    ],
    "pageTitle": "Patent US5774295 - Servo track writing technique - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5774295?dq=6,332,126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465858907,
    "recordOffset": 465833513,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations For the above, and other, reasons, it is expected that the servotrack writing apparatus 10, the general servotrack writing process 100, and the detailed servotrack writing process 150 of the present invention will have widespread industrial applicability. Therefore, it is expected that the commercial utility of the present invention will be extensive and long lasting. Implementations of the invention are easily assembled using presently available materials and means. While some precision optical and laser components are required, they are of relatively common and available types in the servotrack writer industry. The other components of the invention are quite common, widely available, and inexpensive. It can therefore be expected that relatively little additional burden will be imposed upon the industry, in exchange for the considerable benefit which the invention provides. The invention uses principles of mechanics, electronics, and optics which are well understood in the computer disk drive industry. Rapid and wide acceptance can therefore be anticipated as the invention is applied in new production facilities, and minimal change and disruption are to be expected when the invention is used to upgrade existing production facilities. As with many manufacturing process, dimensional variations in the workpiece and components thereof must be expected. Further, assembly of such workpieces must be carried out at high production speeds, where mounting variations of both the workpiece in test fixtures and of tester components upon the workpiece can occur. The present invention permits",
    "textAfterTable": "US7154697 Aug 9, 2004 Dec 26, 2006 Seagate Technology Llc Vertically-oriented servo track writer and method US7520047 Sep 8, 2006 Apr 21, 2009 Xyratex Technology Limited Method and apparatus for loading a read/write head to a spinstand US7911740 Sep 8, 2006 Mar 22, 2011 Xyratex Technology Limited Apparatus and method for receiving and positioning a read/write head to a disk in a test apparatus US20020021523 * Apr 24, 2001 Feb 21, 2002 Koh Ishizuka Displacement detection apparatus, and magnetic recording apparatus and encoder using the displacement detection apparatus US20050007704 * Aug 9, 2004 Jan 13, 2005 Seagate Technology Llc Vertically-oriented servo track writer and method EP1014349A2 * Dec 8, 1999 Jun 28, 2000 Deutsche Thomson-Brandt Gmbh Apparatus for reading from and/or writing to optical recording media * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}