{
    "relation": [
        [
            "Citing Patent",
            "US5536576 *",
            "US5662963 *",
            "US6105502 *",
            "US6454688 *",
            "US7973099",
            "WO2000020218A1 *"
        ],
        [
            "Filing date",
            "May 19, 1994",
            "Dec 11, 1995",
            "Oct 2, 1998",
            "Oct 26, 1999",
            "Oct 19, 2007",
            "Oct 1, 1999"
        ],
        [
            "Publication date",
            "Jul 16, 1996",
            "Sep 2, 1997",
            "Aug 22, 2000",
            "Sep 24, 2002",
            "Jul 5, 2011",
            "Apr 13, 2000"
        ],
        [
            "Applicant",
            "Iwao Hishida",
            "Iwao Hishida",
            "Sawgrass Systems, Inc.",
            "Tokai Rubber Industries, Ltd.",
            "Polyone Corporation",
            "Sawgrass Systems Inc"
        ],
        [
            "Title",
            "Colored, thermoplastic resin pellets",
            "Method for preparing colored thermo plastic resin pellets",
            "Reactive ink printing process",
            "Charging roll whose outermost layer contains grafted carbon",
            "Pre-processed thermoplastic compound",
            "Reactive ink printing process"
        ]
    ],
    "pageTitle": "Patent US5316885 - Pulverulent ink and printing methods - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5316885?dq=7181427",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473465987,
    "recordOffset": 473439714,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17514=Printing equipment, which utilizes processes where images are formed through thermal transfer printing and the ink sheets are regenerated with electrostatic energy, has been proposed in Japanese patent Laid-Open No. 209178/1989. An ink sheet regeneration method has been disclosed in Japanese patent Laid-Open No. 209179/1989., 20095=(4) 100 to 70 mole % of a compound having at least two active hydrogen atoms reactive with isocyanate and/or isothiocyanate groups at a molar ratio of the components (1) and (2) to the components (3) and (4) of between 1:1 and 1:20, and, 37841=Further, it is preferable in order to obtain a resin free from unreacted isocyanate groups that the molar ratio of the iso(thio)cyanate compound comprising the component (1) and (2) to the active hydrogen compounds comprising the component (3) and (4) lie between 1:1 and 1:20., 23448=(4) 100 to 70 mole % of a compound having at least two active hydrogen atoms reactive with isocyanate and/or isothiocyanate groups at a molar ratio of the components (1) and (2) to the components (3) and (4) of between 1:1 and 1:20, and wherein at least 30% of the whole linkages in which an isocyanate or isothiocyanate group participates are thermally dissociating linkages (hereinafter called \"thermally dissociating polyurethane\" or \"resin for shell\"). According to the present invention, it is preferable that the thermally dissociating linkage be one formed by the reaction between a phenolic hydroxyl or thiol group and an isocyanate or isothiocyanate group, for example a thermally dissociating urethane linkage which dissociates into an isocyanate group and a hydroxyl group at a certain temperature and well known in the field of coating materials as \"blocked isocyanate\"., 46132=Examples of the polyhydric alcohol ester include glycerin stearate, glycerin ricinoleate, glycerin monobehenate, sorbitan monostearate, propylene glycol monostearate and sorbitan trioleate. Examples of the silicone varnish include methylsilicone varnish and phenylsilicone varnish. Examples of the aliphatic fluorocarbon include low polymers of tetrafluoroethylene and hexafluoropropylene or fluorinated surfactants described in Japanese Patent Laid-Open No. 124428/1978., 18078=However, printing quality cannot be stabilized through the process of forming ink sheets by fusing pulverulent ink. Therefore, methods to improve this point, such as by adding dispersion agents to the ink, have been disclosed in Japanese patent Laid-Open Nos. 78593/1990 and 78594/1990. Japanese patent Laid-Open No. 78595/1990 propose adding anti-oxidizing agents to the ink in order to prevent ink layer deterioration., 21522=(4) 100 to 70 mole % of a compound having two active hydrogen atoms to react with the isocyanate and isothiocyanate groups of (1) and,(2); at a molar ratio of (1) and (2) to (3) and (4) in the range between 1:1 and 1:20, at least 30 percent of all the linkages involved in the isocyanates and the isothiocyanates in the resin product being thermally associating. The powder ink is advantageously used in a method for printing an image on a substrate, which comprises forming an image by a thermally transferring printing method and regenerating an ink sheet with electrostatic energy.}",
    "textBeforeTable": "Patent Citations It is evident in Table 1 that the pulverulent inks of the invention 1, 2, 3, 4 and 5 can be used and serve for printing at a smaller amount of energy than the comparative ink 2. The comparative inks 1 and 3 cannot be completely reclaimed on an ink sheet because of too a hard shell thereof in strength and therefore causes irregularity in image density when an energy of 20 mJ/mm2 applied to the thermal head. The powder inks 1 to 5 of the invention produced an printed image density of 1.4 even after 50 cycles or times of reproduction or reclaiming. On the other hand, the comparative ink 2 produced only a decreased density after 20 cycles.  TABLE 1______________________________________ Energy necessary to impress ther- mal heads when a printing density of 1.4 is obtained (mJ/mm2).powder ink 1 7.5powder ink 2 8.0powder ink 3 6.5powder ink 4 7.0powder ink 5 6.2comparative Not specified since there are den-powder ink 1 sity irregularities through ink sheet reproduction disorder even at 20 mJ/mm2.comparative 18.0powder ink 2comparative Not specified since there are den-powder ink 3 sity irregularities through ink sheet reproduction disorder even at 20 mJ/mm2.comparative Not specified since there are den-powder ink 4 sity irregularities through ink sheet reproduction disorder even at 20 mJ/mm2.______________________________________ In the printing of a solid, an amount of energy applied to the thermal head necessary for obtaining",
    "textAfterTable": "2 Progress in Organic Coatings, 3 (1975) 73-99 Wicks, Jr. pp. 73, 99. 3 * The Thermal Dissociation of Blocked Toluene Diisocyanates Griffin and Willwerth, vol. 1, No. 4, Dec. 1962, pp. 265 268. 4 The Thermal Dissociation of Blocked Toluene Diisocyanates Griffin and Willwerth, vol. 1, No. 4, Dec. 1962, pp. 265-268. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5536576 * May 19, 1994 Jul 16, 1996 Iwao Hishida Colored, thermoplastic resin pellets US5662963 * Dec 11, 1995 Sep 2, 1997 Iwao Hishida Method for preparing colored thermo plastic resin pellets US6105502 * Oct 2, 1998 Aug 22, 2000 Sawgrass Systems, Inc. Reactive ink printing process US6454688 * Oct 26, 1999 Sep 24, 2002 Tokai Rubber",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}