{
    "relation": [
        [
            "Date",
            "Apr 7, 1994",
            "Nov 24, 1997",
            "Jan 5, 1999",
            "Jun 13, 1999",
            "Aug 24, 1999",
            "Nov 9, 1999",
            "Feb 18, 2005"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "LAPS",
            "FP",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: COOPERSURGICAL, CONNECTICUT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KAISER, MARK S.;POTOCKY, CLIFFORD F.;REEL/FRAME:006933/0316 Effective date: 19940323",
            "Owner name: KEYBANK NATIONAL ASSOCIATION, NEW YORK Free format text: SECURITY AGREEMENT;ASSIGNOR:COOPERSURGICAL, INC.;REEL/FRAME:008811/0228 Effective date: 19970915",
            "",
            "",
            "Effective date: 19990613",
            "",
            ""
        ]
    ],
    "pageTitle": "Patent US5423813 - Resectoscope and electrode assembly - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5423813?dq=7125605",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989301.17/warc/CC-MAIN-20150728002309-00028-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 492167119,
    "recordOffset": 492142310,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Certain changes may be made in the above described resectoscope assemblage without departing from the scope of the invention involved and it is intended that all matter contained in the description thereof or shown in the accompanying drawings shall be interpreted as illustrative and not in a limiting sense. After having described the construction of the foregoing resectoscope it is believe that its operation is self-evident. The central block assembly 34 has an opening 96 adapted to removably receive the proximal end 83 of the electrode assembly 18. An electrode contact 98 has an opening 100 for reception of the electrode end and is therefore aligned with a passage (not shown) communicating with opening 96. The contact 98 is pivotally mounted by pin 102 to a High Frequency (HF) connector pin contact 104 that has a threaded opening 106 for connection to a High Frequency (HF) cable pin 108. A plug 110 covers the opening. A depressible push button 112 fits into an opening in the block 34 and is retained for limited sliding movement by retaining screw 114. A spring 116 mounted in the block tends to bias the contact 98 upwardly. When the electrodes' proximal end 83 is desired to be inserted, the push button 112 is depressed so that the opening 100 is in registry with opening 96. To latch the electrode assembly 18, the button 112 is released and the spring 116",
    "textAfterTable": "US3910279 * Jun 19, 1974 Oct 7, 1975 Olympus Optical Co Electrosurgical instrument US3939839 * Jun 26, 1974 Feb 24, 1976 American Cystoscope Makers, Inc. Resectoscope and electrode therefor US3942530 * Sep 4, 1974 Mar 9, 1976 Akademiet For De Tekniske Videnskaber, Svejsecentralen Prostate resectoscope having ultrasonic scanning US3973568 * Feb 12, 1975 Aug 10, 1976 Iglesias Jose J Stabilized cutting loop for resectoscope with unimpaired vision of the operative field US3990456 * Apr 22, 1975 Nov 9, 1976 Iglesias Jose J Anti-arcing resectoscope loop US4024869 * Dec 8, 1975 May 24, 1977 Richard Wolf Gmbh Resectoscopes US4030502 * Dec 5, 1975 Jun 21, 1977 Jose Juan Iglesias Anti-arcing resectoscope US4060087 * Jun 11, 1976 Nov 29, 1977",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}