{
    "relation": [
        [
            "Date",
            "Nov 30, 2001",
            "Mar 31, 2004",
            "Aug 27, 2007",
            "Aug 29, 2007",
            "Aug 29, 2007",
            "Jul 21, 2011",
            "Sep 21, 2011",
            "Apr 30, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "FPAY",
            "SULP",
            "FPAY",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: STMICROELECTRONICS, INC., TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:LANE, FRED P.;GOZZINI, GIOVANNI;SIEGEL, HARRY M.;REEL/FRAME:012346/0649;SIGNING DATES FROM 20011127 TO 20011129",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Owner name: AUTHENTEC, INC., FLORIDA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:UPEK, INC.;REEL/FRAME:026944/0942 Effective date: 20110901",
            "Owner name: APPLE INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:AUTHENTEC, INC.;REEL/FRAME:035552/0286 Effective date: 20130210"
        ]
    ],
    "pageTitle": "Patent US6693441 - Capacitive fingerprint sensor with protective coating containing a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6693441?dq=6437692",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472848839,
    "recordOffset": 472829553,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The protective coating 34 described above can be employed with various configurations of sensing elements and sensing circuitry. The inclusion of conductive particles in a thin polymeric coating is particularly useful in capacitive fingerprint sensors, as described herein. From the foregoing description, those skilled in the art will envision other applications of the basic inventive concept. Although preferred embodiments have been described in detail, it should be understood that various changes, substitutions and alterations can be made therein without departing from the spirit and scope of the invention as defined by the appended claims. Each individual pixel of the sensing array typically occupies an area of about 50 microns by 50 microns. In a typical fingerprint sensor, the entire sensing surface of which surface 14 is a part is rectangular and has dimensions of 12.8 mm by 18.0 mm. Thus, there may be over 90,000 pixels in a typical fingerprint sensor, which enables a very high resolution of the digitized fingerprint image to be achieved. Since an individual pixel can be addressed and its output read in less than a microsecond, an entire fingerprint image can be captured in less than one-tenth of a second. Each of the digitized values of the pixel outputs can be stored in a memory or compared to previously stored fingerprint data in memory. A gray scale image of a detected or previously stored fingerprint can be output to a display",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US7250774 * Sep 11, 2002 Jul 31, 2007 Sony Corporation Fingerprint sensor US7316167 * Mar 25, 2005 Jan 8, 2008 Fidelica, Microsystems, Inc. Method and apparatus for protection of contour sensing devices US7339448 Dec 14, 2004 Mar 4, 2008 Freudenberg-Nok General Partnership Water resistant encoding material US7437953 Jun 13, 2007 Oct 21, 2008 Deconde Keith T Method and apparatus for protection of contour sensing devices US7474104 * Nov 8, 2006 Jan 6, 2009 International Business Machines Corporation Wafer-to-wafer alignments US7584068 * Feb 22, 2007 Sep 1, 2009 Teradyne, Inc. Electrically stimulated fingerprint sensor test method US7849751 * Feb 15, 2005 Dec 14, 2010 Clemson University Research Foundation Contact sensors and methods for making same",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}