{
    "relation": [
        [
            "Date",
            "Nov 23, 1994",
            "Nov 21, 1995",
            "Feb 26, 2002",
            "Apr 22, 2005",
            "Feb 28, 2006",
            "Mar 29, 2006",
            "Apr 28, 2008",
            "May 12, 2008",
            "Feb 19, 2010"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: MPR TELTECH LTD. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:WRIGHT, ANDREW S.;REEL/FRAME:007240/0834 Effective date: 19941118 Owner name: MCCAW CELLULAR COMMUNICATIONS, INC., WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MPR TELTECH LTD.;REEL/FRAME:007240/0836 Effective date: 19941118",
            "Owner name: AT&T WIRELESS SERVICES, INC, WASHINGTON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCCAW CELLULAR COMMUNICATIONS, INC;REEL/FRAME:007725/0802 Effective date: 19951108",
            "Year of fee payment: 4",
            "Owner name: CINGULAR WIRLEESS II, LLC,GEORGIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CINGULAR WIRELESS II, INC.;REEL/FRAME:017546/0612 Effective date: 20041027 Owner name: CINGULAR WIRELESS II, INC.,GEORGIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NEW CINGULAR WIRELESS SERVICES, INC. F/K/A AT&T WIRELESS SERVICES, INC.;REEL/FRAME:017555/0711 Effective date: 20041027",
            "Year of fee payment: 8",
            "Owner name: CINGULAR WIRELESS II, LLC,GEORGIA Free format text: CERTIFICATE OF CONVERSION;ASSIGNOR:CINGULAR WIRELESS II, INC.;REEL/FRAME:017696/0375 Effective date: 20041027",
            "Owner name: AT&T MOBILITY II, LLC, GEORGIA Free format text: CHANGE OF NAME;ASSIGNOR:CINGULAR WIRELESS II, LLC;REEL/FRAME:020863/0670 Effective date: 20070420",
            "Owner name: AT&T MOBILITY II LLC, GEORGIA Free format text: CHANGE OF NAME;ASSIGNOR:AT&T MOBILITY II, LLC;REEL/FRAME:020936/0370 Effective date: 20070830",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5809083 - Differentially encoded pilot word system and method for wireless ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5809083?dq=6985872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474945535,
    "recordOffset": 474912764,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55374=In an alternative embodiment, illustrated by dashed lines in FIG. 4, the differentially encoded pilot word generator 412 and pilot word inserter 416' are alternatively provided upstream from the constellation mapper 408 (after the interleaver 406), and the pilot word inserter 416' periodically inserts digital values (generated by the differentially encoded pilot word generator 412) that correspond to the differentially encoded pilot words. The constellation mapper 408 then generates the pilot symbols of the differentially encoded pilot words. Illustratively for a pilot word consisting of the consecutive symbols 104 and 106 in FIG. 1, the pilot word inserter 416' would insert the binary values 00112 and 11002 into the data stream., 28470=Every signaling interval, the transmitter transmits one of a plurality of possible \"symbols,\" with each symbol being a signal (at the carrier frequency) that has a certain phase and amplitude. Each symbol (i.e., each unique amplitude-phase combination) represents one or more bits of information in accordance with a given modulation technique. With 8-PSK, for example, one of eight possible symbols is transmitted every signaling interval, with each symbol having a unique phase (and fixed amplitude) that corresponds to a three bit value (since 23 =8). Illustratively, phase offsets of 0, 45, 90, 135, 180, 225, 270 and 315 degrees may represent binary values of 0002, 0012, 0102, 0112, 1002, 1012, 1102, and 1112 respectively. Similarly, with 16 QAM, each of 16 symbols has a unique phase-amplitude combination that represents a unique four bit value.}",
    "textBeforeTable": "Patent Citations While various embodiments of the system and method of the present invention have been described, it should be understood that these embodiments have been presented by way of example only, and are not intended to limit the scope of the present invention. Thus, the breadth and scope of the present invention should be defined only in accordance with the following claims and their equivalents. As will be apparent to those skilled in the art, various modifications to the symbol stream format used by the system can be made without departing from the spirit of the invention. By way of example, the transmitter could be designed to transmit a differentially encoded pilot word every nth pilot period (for example, every third pilot period), and to transmit only a single pilot symbol during pilot periods for which no differentially encoded pilot word is transmitted. Such a modification to the symbol stream would desirably reduce the bandwidth occupied by pilot symbols, but would increase the average synchronization time. To further increase reliability, the comparator 632 may include logic to detect cumulative summation values that are close in value after N iterations, to thereby detect results that have a high probability of error. Additional iterations can then be performed to ensure reliable pilot word detection. Referring to FIG. 7A, after one iteration (i.e., twelve signaling intervals T), the twelve difference values vary in magnitude, and the position of the pilot",
    "textAfterTable": "9 * WO,A,93 09622 (Motorola, Inc.) 13 May 1993. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5974100 * Nov 26, 1997 Oct 26, 1999 Motorola, Inc. Method and apparatus in a communication receiver for compensating for channel amplitude and phase distortion US6044480 * Dec 6, 1996 Mar 28, 2000 Ncr Corporation Message generation and verification for a communication network US6078626 * Sep 24, 1997 Jun 20, 2000 Ericsson Inc. Methods and systems for communicating information using separable modulation constellations US6085103 * Feb 19, 1997 Jul 4, 2000 Ericsson, Inc. Compensating for fading in analog AM radio signals US6424678 * Aug 1, 2000 Jul 23, 2002 Motorola, Inc. Scalable pattern methodology for multi-carrier communication systems",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}