{
    "relation": [
        [
            "Fiscal year",
            "97",
            "97",
            "97",
            "",
            "98",
            "98",
            "98",
            "",
            "99",
            "99",
            "99",
            "",
            "00",
            "00",
            "00",
            "00",
            "",
            "01",
            "01",
            "01",
            ""
        ],
        [
            "Sale Name",
            "Burnt Flat Thinning",
            "Hiack Thinning",
            "Upper Drift Thinning",
            "Fiscal year totals",
            "Upper Niagara Thinning",
            "Alder Treatment",
            "Little Nestucca Thinning",
            "Fiscal year totals",
            "Burnt Last Thinning",
            "Alder Treatment",
            "Lower Drift Thinning",
            "Fiscal year totals",
            "Hebo Remains Thinning",
            "Alder Treatment",
            "Salmon River Thinning",
            "Miscellaneous sales",
            "Fiscal year totals",
            "Alder Treatment",
            "Devil's Lake Thinning",
            "Miscellaneous stands",
            "Fiscal year totals"
        ],
        [
            "Stand Description",
            "Off-site stands",
            "Young managed stands",
            "Young managed stands",
            "",
            "Off-site stands",
            "",
            "Young managed stands",
            "",
            "Off-site stands",
            "",
            "Young managed stands",
            "",
            "Off-site stands",
            "",
            "Young managed stands",
            "Natural regeneration stands",
            "",
            "",
            "Young managed stands",
            "Natural regeneration stands",
            ""
        ],
        [
            "Acres",
            "185",
            "109",
            "160",
            "454",
            "150",
            "75",
            "300",
            "525",
            "200",
            "90",
            "300",
            "590",
            "120",
            "90",
            "260",
            "160",
            "630",
            "90",
            "600",
            "160",
            "850"
        ],
        [
            "Estimated Volume (MMBF)",
            "3.4",
            "1.6",
            "1.3",
            "6.3",
            "3.3",
            "1.3",
            "2.4",
            "7.0",
            "4.0",
            "1.6",
            "2.5",
            "8.1",
            "2.4",
            "1.6",
            "1.8",
            "1.1",
            "6.9",
            "1.6",
            "4.2",
            "1.4",
            "7.2"
        ]
    ],
    "pageTitle": "NCAMA Appendices",
    "title": "",
    "url": "http://www.fsl.orst.edu/ncama/guidapp.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444033647,
    "recordOffset": 444013911,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25945=In 1974, Congress established the Cascade Head Scenic-Research Area, which includes the western half of the experimental forest, the Salmon River estuary, and contiguous private lands. This designation added several grassy coastal headlands and the estuary to the mature forest ecosystems already part of the experimental forest. The result has been a more diverse set of habitats available for research on coastal ecosystems., 12198=Table 8 identifies the short-term harvest for the Marys Peak portion of the AMA. The specific projects identified for fiscal years 1996 and 1997 will provide enough timber volume to meet the Probable Sale Quantity (PSQ) that was developed for the full decade 1994-2003. Additional projects are anticipated for 1998, 1999, and 2000, but are not yet identified.    , 65891=The following list is current as of January 1, 1997. Please contact any of these persons for more information about the Northern Coast Range AMA or its activities.    , 34708=Challenge Cost-Share Agreements are authorized under the Interior and Related Agencies Appropriations Act of 1992. The Act authorizes the Forest Service to cooperate with other parties to develop, plan, and implement projects that are beneficial to the parties and that enhance Forest Service activities. Projects can be financed with matching funds from cooperators. Cooperators may be public and private agencies, organizations, institutions, and individuals (Forest Service Manual, 1587.12)., 36497=Cooperative Research and Development Agreements are authorized under the Federal Technology Transfer Act. This Act authorizes the Forest Service, where appropriate, to transfer federally owned or originated technology to state and local governments and to the private sector. The Act authorizes an agreement between one or more federal laboratories and one or more nonfederal parties under which the Forest Service, provides personnel, services, facilities, equipment, or other resources with or without reimbursement. This Act does not authorize transfer of funding by the Forest Service to nonfederal parties. The nonfederal parties may provide funds, personnel, services, facilities, equipment, and other resources toward the conduct of specified research and development projects that are consistent with the mission of the Forest Service (Forest Service Manual 1587.14)., 38081=A memorandum of understanding (MOU) is the instrument used for a written plan between the Federal government and other parties for carrying out their separate activities in a coordinated and beneficial manner and for documenting a framework for cooperation. A letter of intent may be used in place of a MOU, only when the activities involve a foreign government and the foreign government will not accept the title of MOU to document a framework for cooperation. Memoranda of Understanding and letters of intent are not fund-obligating documents and cannot be used when the intent is to exchange funds, property, services, or anything of value. Under a MOU or letter of intent each party directs its own activities and uses its own resources (Forest Service Manual 1586, BLM Manual 1786).    , 28785=Tillamook County:         Bay City                    Beaver                     Blaine         Cape Meares            Cloverdale               Garibaldi         Hebo                          Lee's Camp            Neskowin         Netarts                     Oceanside                Oretown         Pacific City                Pleasant Valley      Tierra del Mar         Tillamook, 43834=The following are some of the types of projects that may be performed using K-V funding (Forest Service Handbook 2409.19):, 26381=Together the Cascade Head Experimental Forest and Scenic-Research Area ensure the protection and encourage the study of significant areas; promote more sensitive relations between people and their environment; and provide present and future generations with the use and enjoyment of an area of diverse beauty. The area was designated a Biosphere Reserve as part of the United Nations Man and the Biosphere Reserve system in 1980.  , 42852=Another avenue available to finance activities on National Forest System lands is through the Knutson-Vandenberg Act (K-V) of June 9, 1930, as amended by the National Forest Management Act of October 22, 1976. This Act is the authority for requiring purchasers of National Forest timber to make deposits to finance sale-area-improvement activities to protect and improve the future productivity of the renewable resources of forest lands within timber sale areas. Activities include operations to improve conditions on the timber sale area, maintenance and construction for restoration, timber stand improvement, and other improvements related to range, wildlife and fish habitat, soil and watershed, and recreation values. Sale-area improvement activities must be carried out only on lands with full National Forest status and on lands administered in accordance with the laws, rules, and regulations applicable to National Forest lands (Forest Service Handbook 2409.19)., 14435=Table 9 displays short-term harvest projections for Tillamook. Acres and volumes for 1996 and 1997 are more definite than those for 1998. The figures for 1999 and 2000 are projected targets.  , 47337=For fiscal year 1995 (October 1994 through September 1995), volunteers for the Hebo Ranger District contributed about 6,777 hours of work with an estimated value of $90,800. The majority of volunteer work was in recreation related projects with 6,280 total hours for an estimated value of $80,900. Project work in fish and wildlife, range, and timber management contributed to the total with 560 hours for an estimated value of $9,880., 37531=Interagency and Intraagency Agreements deal with other federal agencies. An interagency agreement is used when one federal agency is in a position to provide materials, supplies, equipment, work, or services of any kind that another agency needs to accomplish its mission. Intraagency agreements may be used when one District or Resource Area is in a position to provide materials, supplies, equipment, work, or services of any kind to another District or Area to accomplish its mission (Forest Service Manual 1585, BLM Manual 5010)., 25478=The Experimental Forest, located on a prominent headland on the Pacific Ocean north of Lincoln City, was established by the Forest Service in 1934 to represent typical Sitka spruce-western hemlock forests found along the Oregon Coast. An active research program, managed by the Pacific Northwest Research Station, has been ongoing in this 11,980-acre forest ever since. Numerous long-term studies begun in the 1930s, 1940s, and 1950s are still active today.}",
    "textBeforeTable": "  Table 7. Short Term Harvest Projections: Siuslaw National Forest - Hebo Ranger District U.S. Forest Service, Hebo Ranger District   As stated in chapter 4, the AMAs are expected to continue to produce a harvest of timber. Estimates of long-term yield for the three management units in the North Coast AMA are presented in chapter 5. Tables 7, 8, and 9 display short-term timber sale plans for the Hebo Ranger District, the Marys Peak Resource Area, and the Tillamook Resource area.     Harvest Projections   APPENDIX B:     Some techniques will work better than others; in fact, if an adequate range of techniques is applied, we would expect that some will probably fail to achieve our objectives. Successful application of adaptive management includes the need to take risks--and to learn from both our \"failures\" and our \"successes.\" Learning, the cornerstone of adaptive management, provides the motivation needed to change standards and guidelines where necessary, and to adjust policies and management activities as needed to better manage complex ecosystems.     The three-way partnership has multiple benefits: it combines on-the-ground knowledge of the land managers, the scientific knowledge and methods of the scientists, and the local knowledge of the citizen-owners of the public forests. The partnership also taps into the ideas, values, and creativity of all three. Answers to some",
    "textAfterTable": "        Bureau of Land Management, Marys Peak Resource Area Table 8 identifies the short-term harvest for the Marys Peak portion of the AMA. The specific projects identified for fiscal years 1996 and 1997 will provide enough timber volume to meet the Probable Sale Quantity (PSQ) that was developed for the full decade 1994-2003. Additional projects are anticipated for 1998, 1999, and 2000, but are not yet identified.     Table 8. Short-term harvest projections - Marys Peak Resource Area   Fiscal year  Sale Name Management Allocation Acres Estimated Volume, MMBF 96  Sand Creek Density Management  AMA  75  1.78 97 Callahan Cr. Density Management  AMA  145  2.10 98 LSR/AMA  85  0.747 99 LSR/AMA  85  0.747 00 LSR/AMA  85  0.747       Bureau of Land Management, Tillamook Resource Area Table 9 displays short-term harvest projections for Tillamook. Acres and volumes for 1996 and 1997 are more definite than those for 1998. The figures for 1999 and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}