{
    "relation": [
        [
            "Video Card",
            "ATI Radeon HD 5850",
            "NVIDIA GeForce GTX 460",
            "AMD Radeon HD 6850",
            "AMD Radeon HD 6870",
            "ATI Radeon HD 5870",
            "NVIDIA GeForce GTX 560 Ti",
            "NVIDIA GeForce GTX 570",
            "ATI Radeon HD 6970",
            "NVIDIA GeForce GTX 580",
            "NVIDIA GeForce GTX 590",
            "AMD Radeon HD 6990",
            "NVIDIA GeForce GTX 650 Ti BOOST",
            "NVIDIA GeForce GTX 650 Ti",
            "NVIDIA GeForce GTX 670",
            "NVIDIA GeForce GTX 680",
            "NVIDIA GeForce GTX 690",
            "NVIDIA GeForce GTX 780",
            "Sapphire Radeon R9 270X Vapor-X",
            "MSI Radeon R9 290X",
            "NVIDIA GeForce GTX 780 Ti"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Ambient",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C",
            "20°C"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Idle Temp",
            "39°C",
            "26°C",
            "42°C",
            "39°C",
            "33°C",
            "27°C",
            "32°C",
            "35°C",
            "32°C",
            "33°C",
            "40°C",
            "26°C",
            "26°C",
            "26°C",
            "26°C",
            "30°C",
            "28°C",
            "26°C",
            "34°C",
            "31°C"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Loaded Temp",
            "73°C",
            "65°C",
            "77°C",
            "74°C",
            "78°C",
            "78°C",
            "82°C",
            "81°C",
            "70°C",
            "77°C",
            "84°C",
            "73°C",
            "62°C",
            "71°C",
            "75°C",
            "81°C",
            "80°C",
            "68°C",
            "95°C",
            "82°C"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Max Noise",
            "7/10",
            "4/10",
            "7/10",
            "6/10",
            "7/10",
            "5/10",
            "7/10",
            "6/10",
            "6/10",
            "6/10",
            "8/10",
            "4/10",
            "3/10",
            "3/10",
            "3/10",
            "4/10",
            "3/10",
            "4/10",
            "8/10",
            "3/10"
        ]
    ],
    "pageTitle": "NVIDIA GeForce GTX 780 Ti Video Card Review GTX 780 Ti GeForce GTX 780 Ti, Graphics Card, NVIDIA, Olin Coles, Review",
    "title": "",
    "url": "http://benchmarkreviews.com/8468/nvidia-geforce-gtx-780-ti-video-card-review/12/?cbg_tz=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 27053663,
    "recordOffset": 27023942,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48663=10 November 2013 at 10:23 PM (UTC -7) Link to this comment, 18305=7 November 2013, 42246=7 November 2013 at 10:12 PM (UTC -7) Link to this comment, 54209=12 November 2013 at 10:05 AM (UTC -7) Link to this comment, 40495=7 November 2013 at 7:57 AM (UTC -7) Link to this comment, 46863=10 November 2013 at 9:33 PM (UTC -7) Link to this comment, 51312=9 November 2013 at 2:52 PM (UTC -7) Link to this comment, 51975=I read your article and it is bias no ultra hd 4k numbers and lower resolution for some games higher for others. The 290X is a god send it made Nvidia have to adjust there prices and that is more important then anything. If it was not for Amd you would be paying 1200 for that 780GTX TI. Amd gives us 780 GTX performance for 399.00 with R290 while Nvidia gave it to us for 649.00 with the GTX 780. The 290x is the future with some tweaking it will be the card of the future. With Ultra HD 4k on the horizon the extra memory will come into play and again Nvidia keeps sticking it to its customers by giving us 3 gb instead of 4gb or 6 gb like the titan which is what this card will need in 4k game play. That G-sync is a joke since none of the top Monitors provide it. I bet you ran the 290x in quiet mode. You did not even use the new drivers from AMD betas 9.2 also. Amd’s mantle will also improve the gaming experience and with all the game manufactures programing for the AMD chips since all the game systems use them now it will leave NVidia out in the cold. I’m not a Fan boy of either but will give credit will credit is due Nvidia Has given game players the shaft for a while with over priced video cards and we can thank AMD for giving NVidia a reality check. Thank you AMD for not fucking us like Nvidia has for along time with over priced video cards. I also own a over price EVGA classified 780 GTX card. You got once NVidia never again waiting for 290x Asus matrix that will be a hot video card., 44671=8 November 2013 at 6:47 AM (UTC -7) Link to this comment, 41269=Hmm … it looks like: – It beats the Titan handily (unless the 3gb of VRAM runs out) – At lower resolutions, and more important at 2560×1440 it beats the 290X}",
    "lastModified": "Wed, 29 Jul 2015 09:53:03 GMT",
    "textBeforeTable": "The temperatures illustrated below are absolute maximum values, and do not represent real-world temperatures created by video games or graphics applications: Using a modified version of FurMark’s “Torture Test” to generate maximum thermal load, peak GPU temperature is recorded in high-power 3D mode. FurMark does two things extremely well: drives the thermal output of any graphics processor much higher than any video games realistically could, and it does so with consistency every time. Furmark works great for testing the stability of a GPU as the temperature rises to the highest possible output. This section reports our temperature results subjecting the video card to maximum load conditions. During each test a 20°C ambient room temperature is maintained from start to finish, as measured by digital temperature sensors located outside the computer system. GPU-Z is used to measure the temperature at idle as reported by the GPU, and also under load. GeForce GTX 780 Ti Temperatures These results position the GTX 780 Ti among the least power-hungry top-end video cards we’ve tested under load, but much more impressive is that it’s achieved by a flagship GTX-series product. If you’re familiar with electronics, it will come as no surprise that less power consumption equals less heat output as evidenced by our thermal results below… Measured at the lowest reading, GeForce GTX 780 Ti consumed a mere 12W at idle. NVIDIA’s average TDP is specified as 250W, however our real-world stress tests using 3D Mark Vantage caused this video",
    "textAfterTable": "As we’ve mentioned on the pages leading up to this section, NVIDIA’s Kepler architecture yields a much more efficient operating GPU compared to previous designs. This becomes evident by the low idle temperature, and translates into modest full-load temperatures. While NVIDIA’s reference design works exceptionally well at cooling the GK110 GPU on GeForce GTX 780 Ti, consumers should expect add-in card partners to advertise unnecessarily excessive over-cooled versions for an extra premium. 82°C after ten minutes at 100% load using Furmark’s Torture Test is nothing at all, and is nowhere close to this card’s 95°C thermal threshold (which the R9 290X could actually reach). SKIP TO PAGE: << PREVIOUS       1. NVIDIA GeForce GTX 780 Video Card Review2. First Look: GeForce GTX 7803. Video Card Testing Methodology4. DX11: 3DMark115. DX11: Aliens vs Predator6. DX11: Batman Arkham City7. DX11: Battlefield 38. DX11: Battlefield 49. DX11: Lost Planet 210. DX11: Metro 203311. DX11: Unigine Heaven 3.012. Temperature and Power Consumption13. GeForce GTX 780 Conclusion       NEXT >> Related Items: NVIDIA GeForce GT 610 Video Card On Linux Review NVIDIA GeForce GTX 780Ti Video",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}