{
    "relation": [
        [
            "Year",
            "2015",
            "2014",
            "2013",
            "2012",
            "2011",
            "2010",
            "2009",
            "Career Totals"
        ],
        [
            "Club",
            "Portland Timbers",
            "Portland Timbers",
            "Portland Timbers",
            "Portland Timbers",
            "Portland Timbers",
            "D.C. United",
            "D.C. United",
            "-"
        ],
        [
            "GP",
            "20",
            "17",
            "27",
            "19",
            "25",
            "11",
            "28",
            "147"
        ],
        [
            "GS",
            "14",
            "12",
            "21",
            "14",
            "22",
            "11",
            "25",
            "119"
        ],
        [
            "G",
            "1",
            "5",
            "7",
            "1",
            "2",
            "0",
            "3",
            "19"
        ],
        [
            "MINS",
            "1232",
            "1058",
            "1972",
            "1224",
            "1973",
            "924",
            "2265",
            "10648"
        ],
        [
            "A",
            "4",
            "1",
            "6",
            "1",
            "2",
            "2",
            "3",
            "19"
        ],
        [
            "SHTS",
            "27",
            "24",
            "49",
            "25",
            "19",
            "4",
            "29",
            "177"
        ],
        [
            "SOG",
            "11",
            "11",
            "18",
            "9",
            "6",
            "1",
            "11",
            "67"
        ],
        [
            "FC",
            "24",
            "25",
            "35",
            "23",
            "29",
            "11",
            "52",
            "199"
        ],
        [
            "OFF",
            "9",
            "6",
            "11",
            "1",
            "2",
            "0",
            "6",
            "35"
        ],
        [
            "Y",
            "3",
            "2",
            "3",
            "3",
            "6",
            "2",
            "8",
            "27"
        ],
        [
            "R",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Rodney Wallace | Portland Timbers",
    "title": "",
    "url": "http://www.timbers.com/players/rodney-wallace?quicktabs_=stats",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 751162751,
    "recordOffset": 751130548,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9119=Acquired in a trade for midfielder Dax McCarty on Nov. 24, 2010, Wallace was originally a first-round selection (6th overall) of D.C. United in the 2009 MLS SuperDraft out of the University of Maryland. As both a defender and mid­fielder, Wallace played 39 regular-season games and made 36 starts over his two years with D.C. United (2009-10), compiling three goals and five assists., 1820=COLLEGE: Enjoyed a standout collegiate career at the Uni­versity of Maryland, leading the Terrapins to the 2008 NCAA national championship ... Started all 46 games he played in over two seasons at Maryland (2007-08) ... Recorded 10 goals and four assists in the college ranks ... Named to the All-Atlantic Coast Conference second team as a sophomore (2008) after being selected to the All-ACC Freshman Team following his first collegiate season in 2007 ... Was the only first-year player to start all 21 games for the Terps in 2007 and finished the season second on the team in goals (7)., 3694=2009: Started 25 of his 28 league games as a rookie for D.C. United, playing as both a defender and midfielder ... Recorded three goals and three assists during the regular-season and led the team with 3,117 minutes played across all competitions ... Became one of the steadiest players on the squad, appearing in 38 games (30 starts) in all com­petitions during the campaign and logging a total of three goals and five assists ... A member of Generation adidas, was selected No. 6 overall in the 2009 MLS SuperDraft by D.C. United., 7892=2013: Started in 21 of his 27 matches during the regular season, setting career-highs with seven goals and six assists ... Led the team with three game-winning goals during the regular season ... His six assists were second-most on the team ... Was named an MLS All-Star through a vote of the players and selected to the inactive roster for the 2013 AT&T MLS All-Star Game ... Was a four-time MLSsoccer.com Team of the Week selection during the regular season, garnering honors in Weeks 9, 11, 13 and 17 ... Was also named FutbolMLS.com's Latino de la Jornada three times in Weeks 9, 11 and 17 ... Scored the game-tying goal in second-half stoppage time in a 1-1 draw at Seattle on March 16, entering the match as a substitute in the 80th minute ...  His equalizing strike was named MLS Goal of the Week for Week 3 ... Tallied the game-winning goal in a 3-2 road win at Sporting KC on April 27 ... Tallied his second game-winning goal on the road this season in a 2-0 victory against D.C. United, his former club, on May 25 at RFK Stadium ... His goal against United was voted the MLS Goal of the Week for Week 13 ... Became the first Timbers MLS player to record three assists in one match, aiding in a 3-0 win over the Colorado Rapids at JELD-WEN Field on June 23 ... Started two matches during the club's run to the semifinals of the 2013 Lamar Hunt U.S. Open Cup, featuring in the quarterfinal match agianst FC Dallas on June 2 and the semifinal at Real Salt Lake on Aug. 7 ... Started all four of the club's matches during the 2013 MLS Cup Playoffs, playing 300 minutes and registering two assists ... Recorded both assists in a 3-2 win over Seattle Sounders FC on Nov. 7 in Leg 2 of the Western Conference Semifinals, including one on the game-winning goal by Futty Danso in the 47th minute ... Was one of just two players to record a multi-assist game during the 2013 MLS Cup Playoffs ... Received multiple call-ups by the Costa Rica National Team during the 2013 season, and was on the Tico's roster for the 2013 CONCACAF Gold Cup., 5809=2012: Started five consecutive matches Sept. 15-Oct. 7, including three in the midfield ... Assisted on Danny Mwanga's first goal against San Jose on Sept. 19 ... Scored his first league goal of the season to give the club a 1-1 draw with Seattle on Sept. 15 ... Marked his 75th career MLS appearance, coming on as a second-half sub at New York on Aug. 19 ... Made his first MLS appearance since June 30 and his first MLS start since May 20 in a 2-2 draw at Toronto FC on Aug. 15 ... Had missed time due to national team duty and various injuries ... Recorded an assist in a MLS Reserve League match against Chivas USA on July 29 ... Scored a goal in an exhibition against Aston Villa on July 24 ... Tied club single-game high with three shots on goal against Columbus on May 5 ... Started on April 7 against Chivas USA, but sustained a left ankle sprain in the first half ... Was subbed out of the match at halftime ... Started at left back in five straight matches (March 12-April 7)., 3123=INTERNATIONAL: Had a dramatic international debut on Sept. 2, 2011, scoring the game-winning goal for Costa Rica in a 1-0 win over the United States in a friendly at The Home Depot Center in Carson, Calif. ... Has earned 14 caps for the Costa Rica National Team ... He featured in three 2014 World Cup qualifying matches for the Ticos in 2012, including two matches against Mexico (Sept. 7 and 11) as Costa Rica earned a spot to the final round of qualifying in 2013 ... Scored his second international goal with a left-footed strike in the 41st minute of a 2-0 win against Venezuela in a friendly on Dec. 23, 2011 ... Helped Costa Rica claim the 2013 Copa Centroamericana in January 2013, playing in all five matches and scoring a goal during the tournament ... Scored the game’s lone goal in a 1-0 win over El Salvador in the semifinal to clinch the Tico’s place in the final ... By winning the competition, Costa Rica qualified for the 2013 CONCACAF Gold Cup ... Named to Costa Rica's 23-player roster for the 2013 CONCACAF Gold Cup ... Started Group Stage matches July 10 vs. Cuba at JELD-WEN Field and July 16 vs. the United States ... Called up by Costa Rica for FIFA 2014 World Cup qualifiers from June 7-18 and Oct. 11-15, but did not make an appearance., 4788=2011: Registered two goals and two assists in 25 matches (22 starts) for the Timbers ... Became the first Timbers player to score in consecutive matches, when he tucked the ball away in the 55th minute of a 3-2 win over FC Dal­las April 17 ... Scored in the home opener April 14 against Chicago, in which the Timbers won 4-2 ... Was named to the MLSsoccer.com Team of the Week for Week 5 after scoring in back-to-back games ... Started the first 19 matches of the season at left back ... Assisted Bright Dike’s goal Aug. 17 against Sporting KC ... Set up the opening goal by Kenny Cooper in a 1-1 draw with D.C. United on Oct. 19 ... Played in three games with the Timbers Reserves ... Logged a goal and an assist in a 5-1 win over the Chivas USA Reserves at JELD-WEN Field Sept. 27 ... Acquired by Portland in a trade with D.C. United Nov. 24, 2010., 8714=2014: Tallied five goals and an assist in 17 appearances (12 starts) during the 2014 season ... Netted his first career brace in a 2-1 win over San Jose on Oct. 4 ... Registered one assist in four appearances (one start) in CONCACAF Champions League play ... Tallied his first goal of the season Aug. 9 against Chivas USA, becoming the only player to score a goal in each of Portland's first four MLS seasons ... Made one start in two appearances in the U.S. Open Cup ... Logged his first regular-season start on June 27 against Sporting KC ... Made his 2014 Timbers debut, playing 80 minutes in a 3-0 win over Orlando City U23s in the U.S. Open Cup on June 17 ... Played two games on loan with USL PRO side Arizona United SC, scoring a goal in a 2-1 loss against Dayton on June 11.}",
    "lastModified": "Wed, 29 Jul 2015 20:19:26 GMT",
    "textBeforeTable": "Career Statistics (Regular Season) MLS Game Log Player Stats Stats Read More PERSONAL: Played with former Timbers midfielder Jeremy Hall at Maryland ... Enjoys watching movies. COLLEGE: Enjoyed a standout collegiate career at the Uni­versity of Maryland, leading the Terrapins to the 2008 NCAA national championship ... Started all 46 games he played in over two seasons at Maryland (2007-08) ... Recorded 10 goals and four assists in the college ranks ... Named to the All-Atlantic Coast Conference second team as a sophomore (2008) after being selected to the All-ACC Freshman Team following his first collegiate season in 2007 ... Was the only first-year player to start all 21 games for the Terps in 2007 and finished the season second on the team in goals (7). INTERNATIONAL: Had a dramatic international debut on Sept. 2, 2011, scoring the game-winning goal for Costa Rica in a 1-0 win over the United States in a friendly at The Home Depot Center in Carson, Calif. ... Has earned 14 caps for the Costa Rica National Team ... He featured in three 2014 World Cup qualifying matches for the Ticos in 2012, including two",
    "textAfterTable": "Career Statistics (Post Season) Year Club GP GS G MINS A SHTS SOG FC OFF Y R 2013 Portland Timbers 4 4 0 299 2 7 2 12 3 1 0 View More Regular Season Date Match Result Appearance MINS G A SHTS SOG FC FS Y R 7/25/2015 POR @ DAL L 1-4 Started 64 0 0 0 0 4 0 0 0 7/18/2015 VAN @ POR T 1-1 Subbed on 23 0 0 1 0 1 0 1 0 7/11/2015 POR @ PHI L 0-3 Started 73 0 0 1 0 1 1 0 0 7/05/2015 SJ @ POR W 0-1 Subbed on",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}