{
    "relation": [
        [
            "Code",
            "LG",
            "SB",
            "R",
            "Y",
            "W",
            "Pk",
            "Go",
            "Bl",
            "Or",
            "DG",
            "Br",
            "P",
            "DP",
            "G",
            "FB",
            "FG"
        ],
        [
            "colour Name",
            "Light Grey",
            "Sky Blue",
            "Red",
            "Yellow",
            "White",
            "Pink",
            "Golden Rod",
            "Blue",
            "Orange",
            "Dark Grey",
            "Brown",
            "Purple",
            "Deep Pink",
            "Green",
            "Fire Brick",
            "Forest Green"
        ],
        [
            "Sample",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "RGB Values",
            "[200,200,200]",
            "[143,143,255]",
            "[240, 0, 0]",
            "[255,200, 50]",
            "[255,255,255]",
            "[255,192,203]",
            "[218,165, 32]",
            "[ 0, 0,255]",
            "[255,165, 0]",
            "[128,128,144]",
            "[165, 42, 42]",
            "[160, 32,240]",
            "[255, 20,147]",
            "[ 0,255, 0]",
            "[178, 34, 34]",
            "[ 34,139, 34]"
        ],
        [
            "Hexadecimal",
            "C8C8C8",
            "8F8FFF",
            "F00000",
            "FFC832",
            "FFFFFF",
            "FFC0CB",
            "DAA520",
            "0000FF",
            "FFA500",
            "808090",
            "A52A2A",
            "A020F0",
            "FF1493",
            "00FF00",
            "B22222",
            "228B22"
        ]
    ],
    "pageTitle": "RasMol V2.7.5 Manual",
    "title": "",
    "url": "http://rasmol.org/doc/rasmol.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 13,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 201052555,
    "recordOffset": 200966581,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Thanks to translations by Fernando Gabriel Ranea in late 2000 and early 2001, RasMol is now capable of rendering most menu items and messages in Spanish. Jean-Pierre Demailly provided French translations of menus and messages in January 2001. Giuseppe Martini and Giovanni Paolella with contributions by A. Davassi, M. Masullo and C. Liotto provided Italian translations of menus and messages in March 2001.}",
    "TableContextTimeStampAfterTable": "{5621=RasMol 2.7.5 incorporates changes by T. Ikonen, G. McQuillan, N. Darakev and L. Andrews (via the neartree package). Work on RasMol 2.7.5 supported in part by grant 1R15GM078077-01 from the National Institute of General Medical Sciences (NIGMS), U.S. National Institutes of Health and by grant ER63601-1021466-0009501 from the Office of Biological & Environmental Research (BER), Office of Science, U. S. Department of Energy. RasMol 2.7.4 incorporated changes by G. Todorov, Nan Jia, N. Darakev, P. Kamburov, G. McQuillan, and J. Jemilawon. Work on RasMol 2.7.4 supported in part by grant 1R15GM078077-01 from the NIGMS/NIH and grant ER63601-1021466-0009501 from BER/DOE. RasMol 2.7.3 incorporates changes by Clarice Chigbo, Ricky Chachra, and Mamoru Yamanishi. Work on RasMol 2.7.3 supported in part by grants DBI-0203064, DBI-0315281 and EF-0312612 from the U.S. National Science Foundation and grant DE-FG02-03ER63601 from BER/DOE. The content is solely the responsibility of the authors and does not necessarily represent the official views of the funding organizations., 361205=[19] Bruce A. Johnson, \"MSURF: A Rapid and General Program for the Representation of Molecular Surfaces\", Journal of Molecular Graphics, Vol.5, No.3, pp.167-169, September 1987., 361022=[18] Chris Schafmeister, \"Fast Algorithm for Generating CPK Images on Graphics Workstations\", Journal of Molecular Graphics, Vol.8, No.4, pp.201-206, December 1990., 71717=Last modified: 30 September 2000, 356596=The UNIX implementation of RasMol supports BSD-style socket communication. An identical socket mechanism is also being developed for VMS, Apple Macintosh and Microsoft Windows systems. This should allow RasMol to interactively display results of a computation on a remote host. The current protocol acts as a TCP/IP server on port 21069 that executes command lines until either the command 'exit' or the command 'quit' is typed. The command exit from the RasMol server, the command 'quit' both disconnects the current session and terminates RasMol. This functionality may be tested using the UNIX command 'telnet <hostname> 21069'., 359595=[10] Khaled Belhadj-Mostefa, Ron Poet and E. James Milner-White, \"Displaying Inter-Main Chain Hydrogen Bond Patterns in Proteins\", Journal of Molecular Graphics, Vol.9, No.3, pp.194-197, September 1991., 358925=[7] Conrad C. Huang, Eric F. Pettersen, Teri E. Klein, Thomas E. Ferrin and Robert Langridge, \"Conic: A Fast Renderer for Space-Filling Molecules with Shadows\", Journal of Molecular Graphics, Vol.9, No.4, pp.230-236, December 1991., 61293=  <signature of Ty Coon>, 1 April 1989   Ty Coon, President of Vice, 360841=[17] Jean-Michel Cense, \"Exact Visibility Calculation for Space-Filling Molecular Models\", Journal of Molecular Graphics, Vol.9, No.3, pp.191-193, September 1991., 358449=[4] David Bacon and Wayne F. Anderson, \"A Fast Algorithm for Rendering Space-Filling Molecule Pictures\", Journal of Molecular Graphics, Vol.6, No.4, pp.219-220, December 1988., 339331=The only record types that are of major interest to the RasMol program are the ATOM and HETATM records which describe the position of each atom. ATOM/HETATM records contain standard atom names and residue abbreviations, along with sequence identifiers, coordinates in Ångstrom units, occupancies and thermal motion factors. The exact details are given below as a FORTRAN format statement. The \"fmt\" column indicates use of the field in all PDB formats, in the 1992 and earlier formats or in the 1996 and later formats., 360390=[14] J. Foley, A. van Dam, S. Feiner and J. Hughes, \"Computer Graphics: Principles and Practice\", 2nd Edition, Addison Wesley Publishers, 1990., 23511=                    GNU GENERAL PUBLIC LICENSE                        Version 2, June 1991, 360725=[16] Thomas Porter,\"Spherical Shading\", Computer Graphics Vol.12, ACM SIGGRAPH, pp.282-285, 1978., 358094=[2] Arthur M. Lesk, \"Protein Architecture: A Practical Approach\", IRL Press Publishers, 1991., 359954=[12] Mike Carson and Charles E. Bugg, \"Algorithm for Ribbon Models of Proteins\", Journal of Molecular Graphics, Vol.4, No.2, pp.121-122, June 1986., 358643=[5] David C. Richardson and Jane S. Richardson, \"The Kinemage: A tool for Scientific Communication\", Protein Science, Vol.1, No.1,pp.3-9, January 1992., 359439=[9] Michael L. Connolly, \"Solvent-Accessible Surfaces of Proteins and Nucleic Acids\", Science, Vol.221, No.4612, pp.709-713, August 1983., 358813=[6] Mike Carson, \"RIBBONS 2.0\", Journal of Applied Crystallography, Vol.24, pp.958-961, 1991., 357947=[1] Nelson Max, \"Computer Representation of Molecular Surfaces\", IEEE Computer Graphics and Applications, pp.21-29, August 1983., 23885= Copyright (C) 1989, 1991 Free Software Foundation, Inc.                        59 Temple Place, Suite 330, Boston, MA  02111-1307  USA  Everyone is permitted to copy and distribute verbatim copies  of this license document, but changing it is not allowed., 71758=IUCr Policy Copyright (C) 2000 International Union of Crystallography, 359228=[8] Wolfgang Kabsch and Christian Sander, \"Dictionary of Protein Secondary Structure: Pattern Recognition of Hydrogen-Bonded and Geometrical Features\", Biopolymers, Vol.22, pp.2577-2637, 1983., 19815=RasMol Copyright © Roger Sayle 1992-1999 Version 2.6x1 Mods Copyright © Arne Mueller 1998 Versions 2.5-ucb and 2.6-ucb Mods Copyright © UC Regents/ModularCHEM Consortium 1995, 1996 RasTop 1.3 Copyright © Philippe Valadon 2000 Version 2.7.0, 2.7.1, 2.7.1.1, 2.7.2, 2.7.2.1, 2.7.2.1.1, 2.7.3, 2.7.3.1, 2.7.4, 2.7.4.1, 2.7.4.2, 2.7.5, 2.7.5.1 Mods Copyright © Herbert J. Bernstein 1998-2009, 125587=The RasMol 'dots' command is used to generate a van der Waals' dot surface around the currently selected atoms. Dot surfaces display regularly spaced points on a sphere of van der Waals' radius about each selected atom. Dots that would are 'buried' within the van der Waals' radius of any other atom (selected or not) are not displayed. The command 'dots on' deletes any existing dot surface and generates a dots surface around the currently selected atom set with a default dot density of 100. The command 'dots off' deletes any existing dot surface. The dot density may be specified by providing a numeric parameter between 1 and 1000. This value approximately corresponds to the number of dots on the surface of a medium sized atom., 338108=If you do not have the PDB documentation, you may find the following summary of the PDB file format useful. The Protein Data Bank is a computer-based archival database for macromolecular structures. The database was established in 1971 by Brookhaven National Laboratory, Upton, New York, as a public domain repository for resolved crystallographic structures. The Bank uses a uniform format to store atomic coordinates and partial bond connectivities as derived from crystallographic studies. In 1999 the Protein Data Bank moved to the Research Collaboratory for Structural Biology., 362259=[24] Sydney R. Hall, \"The STAR File: a New Format for Electronic Data Transfer and Archiving\", Journal of Chemical Information and Computer Sciences, Vol. 31, 326-333, 1991., 361979=[22] Adobe Systems Inc., \"PostScript Language Reference Manual\", Addison-Wesley Publishers, Reading, Mass., 1985., 360552=[15] J. Cleary and G. Wyvill, \"Analysis of an Algorithm for Fast Ray Tracing using Uniform Space Subdivision\", The Visual Computer, Vol.4, pp.65-83, 1988., 58553=    You should have received a copy of the GNU General Public License     along with this program; if not, write to the Free Software     Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA, 358258=[3] Per J. Kraulis, \"MOLSCRIPT: A Program to Produce both Detailed and Schematic Plots of Protein Structures\", Journal of Applied Crystallography, Vol.24, pp.946-950, 1991., 361438=[20] Frances C. Bernstein et al., \"The Protein Data Bank: A Computer-Based Archival File for Macromolecular Structures\", Journal of Molecular Biology, Vol.112, pp.535-542, 1977., 359816=[11] Mike Carson, \"Ribbon Models of Macromolecules\", Journal of Molecular Graphics, Vol.5, No.2, pp.103-106, June 1987., 338699=PDB file entries consist of records of 80 characters each. Using the punched card analogy, columns 1 to 6 contain a record-type identifier, the columns 7 to 70 contain data. In older entries, columns 71 to 80 are normally blank, but may contain sequence information added by library management programs. In new entries conforming to the 1996 PDB format, there is other information in those columns. The first four characters of the record identifier are sufficient to identify the type of record uniquely, and the syntax of each record is independent of the order of records within any entry for a particular macromolecule., 9089=The original RasMol manual was created by Roger Sayle. In July 1996, Dr. Margaret Wong of the Chemistry Department, Swinburne University of Technology, Australia, made extensive revisions to the RasMol 2.5 manual to accurately reflect the operation of RasMol 2.6. Eric Martz of the University of Massachusetts made further revisions. In May 1997, William McClure of Carnegie Mellon University reorganized the HTML version of the manual into multiple sections which could be downloaded quickly and added use of frames. Portions of the 2.7.1 version of the RasMol manual were derived with permission from William McClure's version using Roger Sayle's rasmol.doc for version 2.6.4 as the primary source. Changes have been made in August 2000 for RasMol version 2.7.2, January 2001 for RasMol version 2.7.1.1, April 2001 for RasMol version 2.7.2.1 and February 2005 for RasMol version 2.7.3 and November 2007, January 2008 and March 2008 for RasMol version 2.7.4., 361634=[21] Arthur Dalby, James G. Nourse, W. Douglas Hounshell, Ann K. I. Gushurst, David L. Grier, Burton A. Leland and John Laufer, \"Description of Several Chemical File Formats Used by Computer Programs Developed at Molecular Design Limited\", Journal of Chemical Information and Computer Sciences, Vol.32, No.3, pp.244-255, 1992., 360120=[13] H. Iijima, J. B. Dunbar Jr. and G. Marshall, \"Calibration of Effective van der Waals Atomic Contact Radii for Proteins and Peptides\", Proteins: Structure, Functions and Genetics, Vol.2, pp.330-339,1987.}",
    "lastModified": "Sat, 18 Jul 2009 02:39:05 GMT",
    "textBeforeTable": "Command Reference Inter-Process Communication (IPC) Start-up Initialisation Files Dimensions within RasMol Command Line Interface Dials Box Picking Scroll Bars Mouse Controls RasMol's Window Running RasMol on the Apple Macintosh/PPC Running RasMol Under Microsoft Windows Running RasMol Under UNIX or VMS General Operation Introduction Copying Notices Table of Contents IMPORTANT This version is based directly on RasMol version 2.7.4.2, on RasMol version 2.7.4.1, on RasMol version 2.7.4, on RasMol version 2.7.3.1, on RasMol vesion 2.7.3, on RasMol version 2.7.2.1.1, on RasMol version 2.7.2, on RasMol version 2.7.1, on RasMol version 2.6_CIF.2, on RasMol version 2.6x1, on RasMol version 2.6.4, and RasMol 2.5-ucb and 2.6-ucb. Please read the file NOTICE for important notices which apply to this package and for license terms (GPL or RASLIC). THIS IS A PRELIMINARY RELEASE INVOLVING EXTENSIVE MODIFICATIONS ***** USE WITH CAUTION ****** with contributions by A. Davassi, M. Masullo and C. Liotto provided Italian translations of menus and messages in March 2001. and Giovanni Paolella provided French translations of menus and messages in January 2001. Giuseppe Martini in late 2000 and early 2001, RasMol is now capable of rendering most menu items and messages in Spanish.",
    "textAfterTable": "ShadePower Shadow SlabMode Solvent Specular SpecPower Stereo SSBonds Strands Transparent UnitCell VectPS Write Atom Expressions Predefined Sets Colour Schemes File Formats File Machine-Specific Support Bibliography RasMol Copyright © Roger Sayle 1992-1999 Version 2.6x1 Mods Copyright © Arne Mueller 1998 Versions 2.5-ucb and 2.6-ucb Mods Copyright © UC Regents/ModularCHEM Consortium 1995, 1996 RasTop 1.3 Copyright © Philippe Valadon 2000 Version 2.7.0, 2.7.1, 2.7.1.1, 2.7.2, 2.7.2.1, 2.7.2.1.1, 2.7.3, 2.7.3.1, 2.7.4, 2.7.4.1, 2.7.4.2, 2.7.5, 2.7.5.1 Mods Copyright © Herbert J. Bernstein 1998-2009 rasmol@rasmol.org All rights reserved. Use of copyright notice does not imply publication or disclosure. The information supplied in this document is believed to be true but no liability is assumed for its use or for the infringements of the rights of the others resulting from its use. Information in this document is subject to change without notice and does not represent a commitment on the part of the supplier. Notices This software has been created from several sources. Much of the code is from RasMol 2.6, as created by Roger Sayle. See: http://www.dcs.ed.ac.uk/home/rasmol The torsion angle code, new POVRAY3 code and other features",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}