{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Film",
            "Divergent",
            "Muppets Most Wanted",
            "Mr. Peabody & Sherman",
            "300: Rise of an Empire",
            "God’s Not Dead",
            "Need For Speed",
            "The Grand Budapest Hotel",
            "Non-Stop",
            "The LEGO Movie",
            "The Single Mom’s Club"
        ],
        [
            "Weekend",
            "$56,000,000",
            "$16,514,000",
            "$11,700,000 (-46.4)",
            "$8,665,000 (-54.9)",
            "$8,564,000",
            "$7,781,000 (-56.4)",
            "$6,750,000 (+85.5)",
            "$6,346,000 (-40.2)",
            "$4,115,000 (-46.6)",
            "$3,100,000 (-61.6)"
        ],
        [
            "Per Screen",
            "$14,228",
            "$5,170",
            "$3,244",
            "$2,809",
            "$10,979",
            "$2,498",
            "$22,204",
            "$2,155",
            "$1,645",
            "$1,653"
        ],
        [
            "",
            "$56,000,000",
            "$16,514,000",
            "$81,002,000",
            "$93,753,000",
            "$8,564,000",
            "$30,404,000",
            "$12,961,000",
            "$78,261,000",
            "$243,352,000",
            "$12,910,000"
        ]
    ],
    "pageTitle": "Weekend Box Office Report: 'Divergent' Tops 'Muppets'",
    "title": "",
    "url": "http://999ktdy.com/weekend-box-office-report-divergent/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 1583391,
    "recordOffset": 1559479,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "If the main goal of ‘Divergent‘ was to snag a large portion of the audience for ‘The Hunger Games,’ it looks like it succeeded. Although it didn’t reach the absurd heights of Katniss’ two movies, Shailene Woodley‘s dystopian adventure effortlessly nabbed the number one spot and, unless something bad happens next week, announced the arrival of a new big franchise. Summit Share on Twitter Share on Facebook ScreenCrush March 23, 2014 12:24 PM | By Jacob Hall Weekend Box Office Report: ‘Divergent’ Leaves ‘Muppets Most Wanted’ in the Dust Contest Rules Birthday Card Hurricanes Legal Authority Wellness Wednesdays Sailaway 2015 jeep jaunt Ed Sheeran Live",
    "textAfterTable": "  With a $56 million opening, ‘Divergent’ announced its arrival with a bang, especially since its budget is relatively modest by blockbuster standards. Unless its audience turns on it next week, the already-announced next film in the series should arrive on schedule. It’s the exact kind of hit that the extremely talented Woodley, the heir-apparent to Emma Stone and Jennifer Lawrence, has been waiting for and proof that kids just can’t get enough of young girls battling evil governments in twisted futures. Meanwhile, ‘Muppets Most Wanted‘ opened in second place with a disappointing $16 million, which already has some declaring that Kermit and company’s grand comeback has already ended. While that’s not a great number, the film was made for only $50 million and it may have a shot of making that number back if the winds blow in the right direction. It’s rough, but the next few weeks will be the big deciding factor in the Muppets’ fate. There were two other big surprises this weekend. The first of them is the almost-unknown ‘God’s Not Dead’ launching itself into the fifth spot with $8 million. The other success was ‘The Grand Budapest Hotel,’ which jumped up 85%, earning $6 million in seventh place for a total of $12 million. If its legs remain strong, it should replicate the sleeper success of ‘Moonrise Kingdom’ from two years ago. Everything else fell where you’d expect it to fall. ‘Mr. Peabody",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}