{
    "relation": [
        [
            "Full Name",
            "Bloomberg U.S. Financial Conditions Index",
            "Bloomberg U.S. Financial Conditions Index Plus",
            "Cleveland Financial Stress Index",
            "Morgan Stanley Financial Conditions Index U.S.",
            "Financial Market Stress Index",
            "National Financial Conditions Index",
            "Adjusted National Financial Conditions Index",
            "St. Louis Fed Financial Stress Index",
            "Kansas City Financial Stress Index",
            "Citi Financial Conditions Index",
            "I.M.F. U.S. Financial Conditions Index",
            "I.M.F. U.S. Financial Stress Index"
        ],
        [
            "Short Name",
            "BFCI",
            "BFCI+",
            "CFSI",
            "MS FCI",
            "CLN FSI",
            "NFCI",
            "ANFCI",
            "STLFSI",
            "KCFSI",
            "Citi FCI",
            "IMF FCI",
            "IMF FSI"
        ],
        [
            "Frequency Aggregation",
            "D-WA",
            "D-WA",
            "D-WA",
            "D-WA",
            "W-FPC",
            "W-FPC",
            "W-FPC",
            "W-FPC",
            "M-FPC",
            "M-WA",
            "M-DFM",
            "M-WA"
        ],
        [
            "Start Year",
            "1994",
            "1994",
            "1991",
            "1995",
            "1994",
            "1973",
            "1973",
            "1993",
            "1990",
            "1983",
            "1994",
            "1980"
        ],
        [
            "Year Est.",
            "2009",
            "2009",
            "2009",
            "N/A",
            "2003",
            "2006",
            "2006",
            "2009",
            "2009",
            "2000",
            "2009",
            "2011"
        ],
        [
            "Reference",
            "Rosenberg (2009)",
            "Rosenberg (2009)",
            "Oet et al. (2011)",
            "",
            "Carlson et al. (2012)",
            "Brave and butters (2010)",
            "Brave and butters (2010)",
            "Kliesen Smith (2010)",
            "Hakkio Keeton (2009)",
            "D'Antonio (2008)",
            "Matheson (2011)",
            "Cardarelli et al. 2011"
        ],
        [
            "Data Source",
            "Bloomberg",
            "Bloomberg",
            "Cleveland Fed",
            "Bloomberg",
            "Authors",
            "Chicago Fed",
            "Chicago Fed",
            "St. Louis Fed",
            "Kansas City Fed",
            "Citi Research",
            "Author",
            "Authors"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - Assessing and Combining Financial Conditions Indexes",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/feds/2013/201339/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450200575,
    "recordOffset": 450167571,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12427=The severity and the economic impact of the 2008 financial crisis have led to a proliferation of indexes that proxy for financial conditions or financial stress, which we collectively refer to as financial conditions indexes (FCIs). In this paper we evaluate whether FCIs can predict stock returns or innovations to macroeconomic variables over a one-month or a one-quarter horizon. We focus on predictability over relatively short horizons in order to capture the effect that the health of the financial system has on the broader economy, rather than longer run predictability arising from business cycle fluctuations. In addition, we suggest a simple procedure for aggregating the various FCIs into a single proxy for financial conditions., 714=Table 2 reports summary statistics for the FCIs, together with their value at the end of September 2008. For most FCIs, the September 2008 value was in the worst 10% of the 1995-2012 sample, with the exception of the Morgan Stanley index, which mainly deteriorated into October 2008. Pairwise correlations among the FCIs (see Table 3) range between 22% and 96%, with the majority being above 70%., 7487=Our predictability analysis relies on simple predictive regressions of a set of stock returns or innovations to macroeconomic variables on lagged FCI values. We keep the indexes in levels, instead of using changes, because the authors uniformly emphasize that their FCIs are ordinal measures of financial conditions/stress. Relative to Hatzius, Hooper, Mishkin,Schoenholtz, and Watson (2010), who also evaluate the predictive power of several FCIs, we study predictability at a monthly as well as quarterly horizon, in order to minimize the risk that we find predictability arising from business cycle effects. Second, we study a larger number of FCIs and a larger number of financial and macroeconomic variables. Third, we explicitly discuss whether the predictability that arises in coincidence with the 2008 financial crisis is hard-wired in the FCIs, in the sense that the variables included in the FCIs may have been chosen on the basis of whether they experienced large fluctuations in 2007 and 2008. Finally, as described in the next paragraph, we assess the statistical significance of predicability with a methodology that is robust to biases generated by the high persistence that typically characterizes FCIs., 11674=We find that most FCIs can predict monthly and quarterly returns on the S&P 500 and on a portfolio of financial companies, and also innovations to a number of macroeconomic variables - but only if the period around the 2008 financial crisis is included (2007-2012). Such narrow predictability could be the result of threshold effects, in that financial conditions matter only after they deteriorate sufficiently.1 A second possibility is that the FCIs we consider have predictive power because they typically include variables that, like the TED spread, had unusually large movements during the 2008 crisis, and such variables were included in the FCIs precisely because of their pronounced fluctuations in 2007 and 2008. Figure 1 shows the times series of the TED spread from 1986 onwards, and it clearly highlights the uniquely high level that characterized the 2008 financial crisis. A third possibility is that some of the predictive power is the result of non-synchronous data: most FCIs, for instance, include VIX, an implied volatility index derived from options on the S&P 500. These options trade for 15 minutes after trading on the underlying index ends (4:15pm versus 4:00pm Eastern Time), with the consequence that VIX on day t contains information that will be reflected in stock prices only on day t+1 - a fact that can generate spurious predictability., 14666=We first present the results that focus on whether FCIs can predict stock returns in Tables 5 through 9. For each portfolio/FCI combination we report the coefficient on the FCI ( ) and the regression root mean squared error (RMSE). We show an asterisk next to a coefficient when the coefficient is statistically significant, that is when the Campbell and Yogo (2006) 90% confidence interval does not include zero. Table 5 shows results for the 1995-2012 sample, and it indicates that 11 of the 12 FCIs can predict returns on the finance industry portfolio, that four can predict the S&P 500, and that the Morgan Stanley index can predict returns on the finance and three additional industry portfolios. There is noticeable dispersion in the RMSEs across industry portfolios for a given FCI, with the construction and services portfolios generally showing the largest RMSE and the finance the lowest, but the RMSEs are remarkably similar across FCIs for a given portfolio. The statistically significant coefficients have the expected negative sign, indicating that higher financial stress is followed by lower returns.}",
    "TableContextTimeStampAfterTable": "{8311=The first set of results, reported in Table 10, focuses on one-month ahead predictability, with the sample running from 1995 to 2012.8 The Chicago Fed, St. Louis Fed, Kansas City Fed, and IMF FCI indexes predict all the variables. Most other indexes predict at least 3 of the 6 variables, with only IMF FSI having statistically insignificant coefficients throughout. When the sample excludes the 2008 financial crisis (Table 11), however, the evidence in favor of predictability is weak, with most indexes being able to predict only one macroeconomic variable - typically industrial production. Similar conclusions can be drawn when focusing on quarterly horizons, as shown in Tables 12 and 13 (only the Morgan Stanley index can predict more variables in the short sample than in the full sample)., 9260=One possible reason why the predictability we find in the 1995-2012 sample is not robust to the exclusion of 2007-2012 is that it is subject to threshold effects, in that only poor financial conditions can predict future returns or macroeconomic conditions. In Figure 3 we show a scatter plot of innovations to log-changes of total inventory against the St. Louis FCI, where observations for which the index is above its 80 percentile are highlighted in color. Red triangles indicate an observation from between 2007 and 2012 and green squares indicate an observation from outside that range., 9974=The evidence in Figure 3 is not supportive of a threshold effect, in that the negative relationship between FCI and log-changes in inventories is only evident in the observations from the recent crisis. We argue that the \"recent financial crisis effect\" arises either (1) because predictability is only present when investors expect that large dislocations are approaching (for instance, correlations can change, and FCIs ultimately measure correlations); or (2) because the variables underlying the many FCIs constructed after the 2008 crisis were chosen based on their movements during the crisis.9 It is difficult to empirically assess the merit of (1) and (2) above, not least because only one major financial crisis is included in the sample., 39003=The plot shows a scatter of innovations to log-changes in total inventories against the St. Louis Fed's Financial Stress Index. The green squares and red triangles correspond to observations for which the index is above its 80 th percentile, with the red triangles indicating an observation from between 2007 and 2012 and the green squares indicating an observation from oustide that range. July 1995 to June 2012, 16193=It is, of course, possible for these regressions to yield a low R if index does not span the remaining FCIs because it is a radically better proxy for financial conditions. As noted above, the overlap and the encompassing nature of the variables that underlie the different indexes makes such a possibility unlikely. Table 14 reports the adjusted R s of the regressions described above, which we run on two different samples, 1995-2006 and 1995-2012. The rankings in the two samples are quite similar, with the St. Louis FCI, in particular, having a noticeable margin on the other indexes. We use the ranking to select the five FCIs with the highest adjusted R for further aggregation. The two Bloomberg FCIs are ranked among the top five when the sample includes the period surrounding the 2008 financial crisis, however, given that the two indexes are built in a similar way, and that BFCI+ ranks noticeably worse than BFCI in the shorter sample, we exclude BFCI+ from the set of best-performing indexes. We replace BFCI+ with the Kansas City index, which ranks sixth in the 1995-2012 sample, and fifth when excluding the years around the 2008 financial crisis., 24420=A comparison of VIX and the CFCI shows that the two track each other quite well, with the exception of the period between mid-2007 and late 2008, when VIX remains stable, and the CFCI shows a largely steady deterioration in financial conditions. In addition, the CFCI points to loose financial conditions in the second half of the 1990s until late 1998, while, over the same period, VIX points to slowly deteriorating conditions starting in 1995. In Figure 6 we plot the 24-month exponentially-weighted rolling correlation between VIX changes and changes in the CFCI, where observations are weighted so that the weight decays by 50% every 12 months (see Figure 6 for details). The correlation is initially low, but it jumps to about 80% with the Russian default in August 1998. With the exception of two relatively short periods in late 2000 and 2005/2006, it stays mostly above 50%, and it has been around 80-90% since the events of the late summer of 2008., 23186=The results in Table 15 show that the first principal component of the St. Louis Fed, Bloomberg, Chicago Fed, and Citi indexes has the lowest average squared deviations in all columns (A) to (E): hence we consider such combination as our Composite FCI (CFCI). Figure 4 highlights that the CFCI follows the general pattern of the individual FCIs, but its volatility exhibits different regimes depending on whether financial conditions are loose or tight. The three panels of Figure 5 show the CFCI against three alternative proxies for financial conditions: the St. Louis Fed index, which is the best performing individual FCI, the first principal component of the St. Louis Fed and of the index with the lowest correlation with STLFSI (the MS FCI), and the implied volatility index VIX, which is one of the variables underlying many FCIs. The CFCI tracks the STLFSI closely, although the latter is less volatile in the years following the bull market of the late 1990s. The first principal component of STLFSI and of MS FCI is more volatile than the CFCI, especially in the earlier part of the sample, and it points to much more improved conditions than the CFCI in early 2008, just before the crisis gained full traction., 6327=The conclusions that we can draw from monthly returns also carry over to quarterly returns, for which results are reported in Tables 8 and 9. The number of FCIs with predictive power for returns on the S&P 500 or on the financial industry portfolio in the 1995-2012 sample is 5. Similar to the monthly analysis, returns on the remaining industry portfolios are not predictable. Excluding the first day of each quarter when computing the returns (untabulated results) does not change the statistical significance of the coefficients, although restricting the sample to the pre-crisis period (1995-2006, Table 9 all but eliminates the predictability, with the exception of the Morgan Stanley index, which can now predict returns on 5 portfolios. Note that the coefficients for the Morgan Stanley index are positive, while they were negative at the monthly horizon in the full sample (Table 5). The positive sign is consistent with the possibility that, already at the quarterly horizon, the predictive power of the Morgan Stanley index may be due to business cycle predictability - poor current financial conditions imply that, over a medium/long horizon, economic and financial conditions are more likely to improve than to further deteriorate, and stock returns will likely be positive., 5664=The severity of the 2008 financial crisis naturally raises the question of whether the predictive power of the FCIs mainly arises from the events that started in early 2007, or whether it is also present in the broader sample. In Table 7 we report the coefficients and RMSEs estimated over the 1995-2006 sample, and the results highlight that, essentially, there is no predictability left. Later in this section we discuss whether the lack of predictive power outside of the 2008 crisis is due to predictability only being there during periods of financial stress, or whether it is the result of the FCIs being tailored to the recent financial crisis.}",
    "lastModified": "Thu, 20 Feb 2014 21:47:38 GMT",
    "textBeforeTable": "Table 1: Summary descriptions of the 12 FCIs. The graph shows the exponentially-weighted correlation (black dotted line) between monthly changes in the volatility index VIX and monthly changes in the Composite FCI, together with the VIX index, which is standardized for scale reasons (red dashed line), and the Composite FCI (CFCI, blue solid line). The correlation is calculated on the basis of a 24-month rolling window, where the weights decay by 50% every 12 months. Specifically, the weights assigned to observations {t i}23i-0 are given by : 1/0.75 × σ × (1 σ) i, where σ = 1 e (ln(4))/24) Figure 6 Data Figure 6: Exponentially-weighted correlation between VIX changes and changes in the Composite FCI Each of the three panels show the Composite FCI (CFCI, blue line) against one of three alternative proxies for financial conditions: the St. Louis Fed index (top panel), which is the individual FCI that best summarizes the information in the remaining FCIs (see Table 14); the first principal component of the St. Louis Fed index and of the index that is least correlated with the St. Louis Fed index (the Morgan Stanley FCI (middle panel); and the implied volatility index VIX (bottom panel). VIX data are from the CBOE. Figure 5 Data",
    "textAfterTable": "Table 2: Summary statistics of the 12 FCIs. The table shows the mean, median, 10th and 90th percentiles, peak crisis value (September 2008), total observations, and 90% confidence interval for the AR(1) autoregressive root (see Campbell and Yogo (2006) ). July 1995 to June 2012.   Mean Median 10th 90th Value on Sept. 2008 # obs 90% CI for AR root Daily:BFCI 0.426 0.060 -0.887 1.910 7.651 4435 0.922 0.996 Daily:BFCI+ 0.264 -0.057 -1.237 1.782 5.980 4435 0.901 0.986 Daily:CFSI 0.138 0.024 -1.065 1.613 2.592 4435 0.939 1.004 Daily:MS FCI 0.075 -0.139 -1.144 1.718 0.764 4429 0.834 0.947 Weekly:CLN FSI -4.311 -4.625 -7.264 -0.660 -0.001 887 0.923 0.997 Weekly:NFCI -0.361 -0.534 -0.783 0.229 1.847 887 0.936 1.002",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}