{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "g",
            "47",
            "52",
            "36",
            "56",
            "191"
        ],
        [
            "ab",
            "154",
            "187",
            "120",
            "201",
            "662"
        ],
        [
            "r",
            "23",
            "19",
            "16",
            "37",
            "95"
        ],
        [
            "h",
            "34",
            "53",
            "27",
            "59",
            "173"
        ],
        [
            "2b",
            "7",
            "11",
            "5",
            "12",
            "35"
        ],
        [
            "3b",
            "1",
            "-",
            "-",
            "1",
            "2"
        ],
        [
            "hr",
            "2",
            "4",
            "1",
            "2",
            "9"
        ],
        [
            "rbi",
            "22",
            "36",
            "12",
            "25",
            "95"
        ],
        [
            "bb",
            "25",
            "12",
            "6",
            "24",
            "67"
        ],
        [
            "k",
            "34",
            "20",
            "22",
            "22",
            "98"
        ],
        [
            "sb",
            "-",
            "2",
            "1",
            "5",
            "8"
        ],
        [
            "cs",
            "1",
            "1",
            "-",
            "-",
            "2"
        ],
        [
            "avg",
            ".221",
            ".283",
            ".225",
            ".294",
            ".261"
        ],
        [
            "obp",
            ".342",
            ".329",
            ".321",
            ".374",
            ".344"
        ],
        [
            "slg",
            ".318",
            ".406",
            ".292",
            ".393",
            ".361"
        ]
    ],
    "pageTitle": "Scott Donaghue - Quinnipiac",
    "title": "",
    "url": "http://www.quinnipiacbobcats.com/sports/bsb/2013-14/bios/donaghue_scott_9b0g?view=career&pos=h",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 675178967,
    "recordOffset": 675163042,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1957=As a Freshman: Appeared in and started 47 games…Hit .221 (34-154), with two HRs, 22 RBI, and 23 runs scored…Recorded seven doubles, a triple, and a HR on the year…Scored his first collegiate run in the second inning of a loss to Fordham on Mar. 2…Had his first collegiate hit on a double in the second inning of a loss to Richmond on Mar. 10…Drove in his first collegiate run in the ninth inning of a loss to Richmond on Mar. 11…Scored three runs, walked and doubled in a two-game series with William & Mary on Mar. 13/14…Had eight hits, two walks and a run scored in a weekend series with Wagner on Mar. 16-18…Scored three times and reached base three times against Fairleigh Dickinson on Mar. 23…Doubled, scored, and drove in two runs in a loss to Fairfield on Mar. 27…Singled, doubled, and homered against Connecticut on Apr. 9 while driving in and scoring two runs each…Drove in 11 runs in six games in a span from Apr. 9 to Apr. 15…Had a two-RBI HR in the third inning of a 13-4 win over Long Island on May 6., 3564=As a Sophomore: Started in 52 of the 53 games he appeared in…Hit .283 (53-187) with a team high four home runs, 11 doubles, 19 runs scored, and a team leading 36 RBI…Became the first Quinnipiac player to drive in seven runs in a game since Jeff Mainetti had seven RBI's against Fairleigh Dickinson on Mar. 26, 2013...Had three straight multiple hit games totaling seven hits in a three game series against Richmond on Mar. 9-10… Was the first Quinnipiac player to appear in the NEIBA All-Star Game since Kyle Nisson played in 2011...Had two hits against Akron on March 16…Recorded three hits against Monmouth on March 23…Had two singles and a double against Sacred Heart on April 6...Hit two home runs and drove in four against Hartford on April 16…Donaghue's two-homer game was the first at Quinnipiac since Chris Migani did it against Wagner on Apr. 21, 2011. In addition, it was the first time since Apr. 6, 2007 that Quinnipiac hit back-to-back home runs in a game. On that date, Peter Kummerfeldt and Wilson Matos connected to lead-off the fourth inning before Randy Gress and Jeff Mainetti went back-to-back in the sixth in a 15-1 win against Fairleigh Dickinson...Had four hits including two doubles and two RBI against Notre Dame on April 20…Recorded two hits and scored two runs against Wagner on April 27… Had two hits, one home run, and three RBI against UMASS on May 1…Recorded two hits, a grand slam, scored two runs, and had seven RBI against Central Connecticut on May 10… Had two hits and scored two runs against Central Connecticut on May 12., 312=Personal: Son of Hugh and Donna Donaghue…Has two brothers, Chris and Sean…Joins high school teammate Matthew Lorenzetti on the 2012 Quinnipiac baseball team…Undecided major…Born in Secaucus, N.J., 73=Career Stats (Updated Jan. 23, 2014)}",
    "TableContextTimeStampAfterTable": "{210892=275 Mt. Carmel Ave. Hamden, CT 06518-1908}",
    "textBeforeTable": "Scott Donaghue 4 4 Related Bios Nicholas Arcabascio Matthew Batten Gary Binkiewicz Mike Blumenthal Nic Civale Matt DeRosa Gregory Egan Nick Fabrizio Vincent Guglietti Wyatt Hamilton Lou Iannotti Thomas Jankins Dale Long Matthew Lorenzetti Ryan Nelson Matthew Oestreicher Matthew Osieja Mike Palladino Rob Pescitelli Brian Ruditys Joseph Scaglione Brandon Shileikis Kevin Sustad Justin Thomas More 2014 City Series Schedule PSA Questionnaire Summer Prospect Showcase|History/Stat Archives|Coaches|News|Statistics|Schedule/Results|Roster|Home IMaGinE IceCats Step |",
    "textAfterTable": "HBP SH SF Donaghue, Scott Fr. 2011-12 Infield 47 154 23 34 0.221 7 1 2 49 0.318 22 - - 25 34 4 2 1 Donaghue, Scott So. 2012-13 Infield 52 187 19 53 0.283 11 0 4 76 0.406 36 2 3 12 20 3 3 5 Career Totals - - - 99 341 42 87 0.255 18 1 6 125 0.367 58 2 3 37 54 7 5 6",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}