{
    "relation": [
        [
            "With-in",
            "0 to 5 Days",
            "6 to 10 Days",
            "11 to 15 Days",
            "16 to 20 Days",
            "20 + Days",
            "Totals"
        ],
        [
            "1999",
            "208",
            "24",
            "12",
            "9",
            "31",
            "284"
        ],
        [
            "2000",
            "780",
            "241",
            "77",
            "29",
            "152",
            "1279"
        ],
        [
            "2001",
            "858",
            "307",
            "109",
            "34",
            "68",
            "1376"
        ],
        [
            "2002",
            "724",
            "121",
            "39",
            "21",
            "98",
            "1003"
        ],
        [
            "2003",
            "1327",
            "90",
            "10",
            "5",
            "52",
            "1484"
        ],
        [
            "2004",
            "1463",
            "101",
            "22",
            "3",
            "15",
            "1604"
        ],
        [
            "2005",
            "1456",
            "103",
            "24",
            "8",
            "17",
            "1608"
        ],
        [
            "2006",
            "943",
            "68",
            "13",
            "1",
            "8",
            "1033"
        ],
        [
            "2007",
            "1451",
            "175",
            "37",
            "18",
            "16",
            "1697"
        ],
        [
            "2008",
            "1645",
            "128",
            "12",
            "5",
            "13",
            "1803"
        ]
    ],
    "pageTitle": "Semi-Annual Reports to WSDOT IV | Washington Division | Federal Highway Administration",
    "title": "",
    "url": "http://www.fhwa.dot.gov/wadiv/preports/semiannual_iv.cfm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450533559,
    "recordOffset": 450525745,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21925=These charts show the formal timeframes from 2001 to present for endangered species act (ESA) consultations for the US Fish & Wildlife Service (USF&WS) and the National Oceanic & Atmospheric Administration–Fisheries Service (NMFS) beginning with consultations in April 2001. Each diamond point represents the number of days needed for completion of a formal consultation for a specific project. Formal consultation is entered into when a project is determined \"likely to adversely affect\" a listed endangered species (some of the most encountered on projects are chinook, coho, sockeye, and chum salmon; bull trout; bald eagles, and marbled murrelets). Formal consultations are required to be completed with 135 days (90 days for consultation and 45 days to prepare a biological opinion (BO))., 20937=This table reflects the number of authorizations / modifications approved within certain timeframes since 1999. For federal fiscal year (FY) 2008 our approval has increased to 91% (1645/1803) up from FY 2007's 86% (1451/1697) within the first five (5) days. The 91% exceeded our goal of 90%! This is attributed to being fully staffed, as well as the emphasis placed on timely approvals. (Note: the FY begins on October 1 and ends on September 30 of the following year. ), 14722=This chart shows the timeliness of approval of documented categorical exclusions (DCEs) by quarters for FYs 2007 and 2008 (FY 2009 will be reported in the next issue). As the chart depicts, we are approving the majority of DCEs within the first 10 days of receipt., 13862=This chart shows the timeliness of approval for emergency relief (ER) damage inspection reports. Our goal is to ap-prove 90% of these reports within 10 days of receipt. We did not meet our goal in the 3rd/4th quarters of FY 2008. This is attributed to the Washington Division revising its long-standing policy to not pay for \"debris removal.\" After evaluating the Division's policy against new ER guidance from HQ we modified our policy to cover costs associated with debris removal within the roadway prism. Many debris removal ER damage inspection reports were held for several weeks while the Division's policy was being reevaluated resulting in the longer than usual time for approval., 160=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000}",
    "textBeforeTable": "Timeliness of Authorizations / Modifications This chart shows the timeliness of approval for right-of-way (R/W) certifications 3 (approval of certifications 1 and 2 have been delegated to WSDOT). In order to authorize the advertisement of a project for construction, the State must certify the R/W has been cleared, per 23 CFR 635.309. A certification 3 means there are some parcels where rights have not been obtained and there may be some displacees remaining. Certification 3s are to be used infrequently. Our goal is to take action on / approve 90% of certification 3s within 10 days of receipt. I-5 Widening, Rush Road to 13th Street, Temporary Construction accesses (two) approved on July 14 and August SR-519 Intermodal Access Phase II, Interchange Modification approved on August 7, 2008 (eight days after receipt) Access Actions I-5 Active Traffic Management project \"Design Matrix\" approved July 31, 2008 (12 days after receipt) Tacoma HOV \"Nalley Valley\" projects deviations (seven) approved on April 9, 2008 (six after six days and one on the same day of receipt) I-405, 112th Avenue SE to SE 8th Widening deviations (two) approved on May 20 and September 22, 2008 (both on same day of receipt) I-405, SR-520 to I-5 Widening deviations (four) approved on April 25 (three) and June 10, 2008 (all on the same day of receipt) I-405 Braided Ramps deviation approved on August 20, 2008",
    "textAfterTable": "This table reflects the number of authorizations / modifications approved within certain timeframes since 1999. For federal fiscal year (FY) 2008 our approval has increased to 91% (1645/1803) up from FY 2007's 86% (1451/1697) within the first five (5) days. The 91% exceeded our goal of 90%! This is attributed to being fully staffed, as well as the emphasis placed on timely approvals. (Note: the FY begins on October 1 and ends on September 30 of the following year. )   Endangered Species Act (ESA) Formal Consultation Data These charts show the formal timeframes from 2001 to present for endangered species act (ESA) consultations for the US Fish & Wildlife Service (USF&WS) and the National Oceanic & Atmospheric Administration–Fisheries Service (NMFS) beginning with consultations in April 2001. Each diamond point represents the number of days needed for completion of a formal consultation for a specific project. Formal consultation is entered into when a project is determined \"likely to adversely affect\" a listed endangered species (some of the most encountered on projects are chinook, coho, sockeye, and chum salmon; bull trout; bald eagles, and marbled murrelets). Formal consultations are required to be completed with 135 days (90 days for consultation and 45 days",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}