{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5"
        ],
        [
            "Command or Action",
            "configure Example: RP/0/RSP0/CPU0:router# configure",
            "interface type interface-path-id Example: RP/0/RSP0/CPU0:router(config)# interface gigabitethernet 0/1/0/1",
            "ipv4 address ip-address mask [secondary] Example: RP/0/RSP0/CPU0:router(config-if)# ipv4 address 192.168.99.1 255.255.255.0",
            "ipv6 address ipv6-prefix/prefix-length [eui-64] Example: RP/0/RSP0/CPU0:router(config-if)# ipv6 address 2001:0DB8:c18:1::3/64",
            "Use the commit or end command."
        ],
        [
            "Purpose",
            "Enters global configuration mode.",
            "Specifies the interface type and number, and enters interface configuration mode.",
            "Specifies a primary or secondary IPv4 address for an interface.",
            "Specifies the IPv6 address assigned to the interface and enables IPv6 processing on the interface. A slash mark (/) must precede the prefix-length , and there is no space between the ipv6-prefix and slash mark.",
            "commit—Saves the configuration changes and remains within the configuration session. end—Prompts user to take one of these actions: Yes— Saves configuration changes and exits the configuration session. No—Exits the configuration session without committing the configuration changes. Cancel—Remains in the configuration session, without committing the configuration changes."
        ]
    ],
    "pageTitle": "Cisco ASR 9000 Series Aggregation Services Router IP Addresses and Services Configuration Guide, Release 5.1.x - Implementing Network Stack IPv4 and IPv6 [Cisco ASR 9000 Series Aggregation Services Routers] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/routers/asr9000/software/asr9k_r5-1/addr_serv/configuration/guide/b_ipaddr_cg51xa9k/b_ipaddr_cg51xa9k_chapter_01001.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371400599,
    "recordOffset": 371358181,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93940=The ipv6-prefix argument in the ipv6 address command must be in the form documented in RFC 2373 in which the address is specified in hexadecimal using 16-bit values between colons., 16437=0:0:0:0:0:0:0:1, 114075=If you are configuring Intermediate System-to-Intermediate System (IS-IS) across a serial line, you should configure the serial interfaces as unnumbered, which allows you to conform with RFC 1195, which states that IP addresses are not required on each interface., 94721=The ipv6-address argument in the ipv6 address link-local command must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 10784=IPv6, formerly named IPng (next generation) is the latest version of the Internet Protocol (IP). IP is a packet-based protocol used to exchange data, voice, and video traffic over digital networks. IPv6 was proposed when it became clear that the 32-bit addressing scheme of IP version 4 (IPv4) was inadequate to meet the demands of Internet growth. After extensive discussion, it was decided to base IPng on IP but add a much larger address space and improvements such as a simplified main header and extension headers. IPv6 is described initially in RFC 2460, Internet Protocol, Version 6 (IPv6) Specification issued by the Internet Engineering Task Force (IETF). Further RFCs describe the architecture and services supported by IPv6., 18804=An IPv6 address prefix, in the format ipv6-prefix/prefix-length , can be used to represent bit-wise contiguous blocks of the entire address space. The ipv6-prefix argument must be in the form documented in RFC 2373, in which the address is specified in hexadecimal using 16-bit values between colons. The prefix length is a decimal value that indicates how many of the high-order contiguous bits of the address compose the prefix (the network portion of the address). For example, 2001:0DB8:8086:6502::/32 is a valid IPv6 prefix., 16792=0:0:0:0:0:0:0:0, 44752=In IPv6, the minimum link MTU is 1280 octets. We recommend using an MTU value of 1500 octets for IPv6 links., 28318=A link-local address is an IPv6 unicast address that can be automatically configured on any interface using the link-local prefix FE80::/10 (1111 1110 10) and the interface identifier in the modified EUI-64 format. Link-local addresses are used in the neighbor discovery protocol and the stateless autoconfiguration process. Nodes on a local link can use link-local addresses to communicate; the nodes do not need site-local or globally unique addresses to communicate. Figure 1shows the structure of a link-local address.}",
    "textBeforeTable": "DETAILED STEPS 5.    Use the commit or end command. 4.    route-tag [ route-tag value ] ipv4 address ipv4-address mask [secondary] 3.    Do one of the following: 2.    interface type interface-path-id 1.    configure SUMMARY STEPS The route tag feature is already available for static routes and connected routes (interfaces) wherein the route tags are matched to policies and redistribution can be prevented. The Route-Tag Support for Connected Routes feature that attaches a tag with all IPv4 and IPv6 addresses of an interface. The tag is propagated from the IPv4 and IPv6 management agents (MA) to the IPv4 and IPv6 address repository managers (ARM) to routing protocols, thus enabling the user to control the redistribution of connected routes by looking at the route tags, by using routing policy language (RPL) scripts. This prevents the redistribution of some interfaces, by checking for route tags in a route policy. Route-Tag Support for Connected Routes interface GigabitEthernet 0/5/0/0: 10.2.1.2/16 interface GigabitEthernet 0/4/0/0: 10.2.1.1/16 interface GigabitEthernet 0/3/0/0: 10.1.1.2/8",
    "textAfterTable": "Fallback VRF Virtual Routing and Forwarding (VRF) is an IP technology that allows multiple instances of a routing table to coexist on the same router at the same time. Because the routing instances are independent, the same or overlapping IP addresses can be used without conflict. If the destination prefix of a data packet does not match any routes in VRF, a default route is used to lookup the global routing table. However, using a default route needs an explicit next hop which may not be efficient. A better option is to configure a fallback VRF route so that if the destination does not have a match in the VRF table, the fallback VRF table is used. The fallback VRF can either be the global routing table or any other non-global VRF table. You can configure a fallback VRF only on Cisco ASR 9000 Enhanced Ethernet Line Cards. How to Implement Network Stack IPv4 and IPv6 This section contains the following procedures: Assigning IPv4 Addresses to Network Interfaces Configuring IPv6 Addressing Assigning Multiple IP Addresses to Network Interfaces Configuring IPv4 and IPv6 Protocol Stacks Enabling IPv4 Processing on an Unnumbered Interface Configuring ICMP Rate Limiting Configuring IPARM Conflict Resolution Configuring Fallback VRF",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}