{
    "relation": [
        [
            "Patent application number",
            "20090110504",
            "20090220745"
        ],
        [
            "Description",
            "CUTTING TOOL USING ONE OR MORE MACHINED TOOL TIPS WITH DIFFRACTIVE FEATURES - A cutting tool assembly having a tool post capable of lateral movement along a work piece to be cut and a shank on the tool post holding at least one machined tool tip and possibly other tool tips. The tool tip has diffractive features in contact with the work piece in order to machine macro-scale features having nano-scale features. The machined work piece can be used to make articles having diffractive features such as optical films having lenslets.",
            "CUTTING TOOL USING ONE OR MORE MACHINED TOOL TIPS WITH DIFFRACTIVE FEATURES IN A CONTINUOUS OR INTERRUPTED CUT FAST TOOL SERVO - A cutting tool assembly having a tool post capable of lateral movement along a work piece to be cut and an actuator with at least one machined tool tip and possibly other tool tips. The actuator provides for control of the movement of the tool tip in an x-direction into and out of the work piece in order to make continuous or discontinuous diffractive features in it. The machined work piece can be used to make articles having diffractive features such as optical films having lenslets."
        ],
        [
            "Published",
            "04-30-2009",
            "09-03-2009"
        ]
    ],
    "pageTitle": "Clements, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/clements-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441275019,
    "recordOffset": 441247230,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jeffrey E. Clements, Oakdale, MN US 05-13-2010 Adjustable Stepladder - A stepladder with four individually adjustable, self-locking rails so that the ladder can be placed on uneven terrain then safely adjusted to maintain level orientation. The ladder rails will consist of four pairs of outer and inner rails. Each outer and inner rail pair is designed with profiles that when brought together will lock into one another providing stability yet minimal friction. Each inner rail is held in place by a spring-loaded lever with attached hooks. The spring forces the hooks to be engaged with an adjustment bracket that is fixed to the outer rail. A foot will be fixed to the bottom of each inner rail. Each foot will have arched surfaces along 2 perpendicular horizontal axes so that consistent surface area contact is maintained with the ground regardless of the angle of the ground. On a level surface, when the ladder is in an un-adjusted state, the four inner rails are designed to be extended with respect to the outer rails providing equal distance between each step and reducing weight and production costs. 20100116592 Published Description Patent application number Jeffrey David Clements, Hartford, WI US 05-13-2010 MULTI-WELL PLATE AND METHOD OF MANUFACTURE - A method of manufacture and assembly of multiwell plates employing targeted radiation at an interface in order to achieve bonding is disclosed. The method accommodates glass and polymer attachment as",
    "textAfterTable": "Jerry M. Clements, Simpsonville, KY US Patent application number Description Published 20110289751 Field Erectable Abatement System Methods - Various methods and apparatus are disclosed that relate to an abatement system. Some methods and apparatus relate to one or more aspects of a field erectable abatement system. The field erectable abatement system may include a plurality of prefabricated skeleton segments that may be transported to a location and field erected at the location. One or more skin segments may also optionally be provided and optionally be coupled to the skeleton segments prior to being transported to the location. 12-01-2011 20110289861 Field Erectable Abatement System - Various methods and apparatus are disclosed that relate to an abatement system. Some methods and apparatus relate to one or more aspects of a field erectable abatement system. The field erectable abatement system may include a plurality of prefabricated skeleton segments that may be transported to a location and field erected at the location. One or more skin segments may also optionally be provided and optionally be coupled to the skeleton segments prior to being transported to the location. 12-01-2011 John Clements, East Meadow, NY US Patent application number Description Published 20090177480 System And Method For Identifying Targeted Consumers Using Partial Social Security Numbers - A system and method are used to identify a targeted consumer. The system includes a partial social security",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}