{
    "relation": [
        [
            "Citing Patent",
            "US8508949 *",
            "US8969734 *",
            "US9048565 *",
            "US20100302751 *",
            "US20120196493 *",
            "US20140370725 *"
        ],
        [
            "Filing date",
            "Aug 11, 2008",
            "Feb 16, 2012",
            "Jun 12, 2013",
            "Aug 11, 2008",
            "",
            "Jun 12, 2013"
        ],
        [
            "Publication date",
            "Aug 13, 2013",
            "Mar 3, 2015",
            "Jun 2, 2015",
            "Dec 2, 2010",
            "Aug 2, 2012",
            "Dec 18, 2014"
        ],
        [
            "Applicant",
            "Rosenberger Hochfrequenztechnik Gmbh & Co. Kg",
            "Advanced Interconnections Corp.",
            "Ironwood Electronics, Inc.",
            "Rosenberger Hochfrequenztechnik Gmbh & Co. Kg",
            "Advanced Interconnections Corp.",
            "Ironwood Electronics, Inc."
        ],
        [
            "Title",
            "Multiple micro HF-contact arrangement",
            "Terminal assembly with regions of differing solderability",
            "Adapter apparatus with deflectable element socket contacts",
            "Multiple Micro HF-Contact Arrangement",
            "Terminal assembly with regions of differing solderability",
            "Adapter apparatus with deflectable element socket contacts"
        ]
    ],
    "pageTitle": "Patent US8167630 - High density connector and method of manufacture - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8167630?dq=patent:6144888",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484356871,
    "recordOffset": 484309305,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29439=This application is a continuation of U.S. application Ser. No. 12/352,227 filed Jan. 12, 2009 now U.S. Pat. No. 7,802,999, entitled “High Density Connector and Method of Manufacture”, which is a continuation of U.S. application Ser. No. 11/668,435 filed Jan. 29, 2007 now U.S. Pat. No. 7,476,110, entitled “High Density Connector and Method of Manufacture”, which is a continuation of U.S. application Ser. No. 11/272,212 filed Nov. 10, 2005 now U.S. Pat. No. 7,168,964, entitled “High Density Connector and Method of Manufacture”, which is a divisional of U.S. patent application Ser. No. 09/953,631, now U.S. Pat. No. 7,186,123, filed Sep. 14, 2001, entitled “High Density Connector and Method of Manufacture”, which is a continuation of U.S. patent application Ser. No. 09/284,230, filed Jul. 7, 1999, now U.S. Pat. No. 6,325,644 entitled “High Density Connector and Method of Manufacture”, which is a 371 of PCT/US97/18354 filed Oct. 10, 1997 and a continuation of U.S. patent application Ser. No. 08/728,194 filed Oct. 10, 1996, now U.S. Pat. No. 6,024,584, and a continuation of U.S. patent application Ser. No. 08/777,579 filed Dec. 31, 1996, now U.S. Pat. No. 6,164,983, and a continuation of U.S. patent application Ser. No. 08/777,806 filed Dec. 31, 1996, now U.S. Pat. No. 6,358,068, and a continuation of U.S. patent Ser. No. 08/778,380 filed Dec. 31, 1996, now U.S. Pat. No. 6,079,991, and a continuation of U.S. patent application Ser. No. 08/778,398 filed Dec. 31, 1996, now U.S. Pat. No. 6,093,035.}",
    "textBeforeTable": "Patent Citations Therefore, the present invention should not be limited to any single embodiment, but rather construed in breadth and scope in accordance with the recitation of the appended claims. While the present invention has been described in connection with the preferred embodiments of the various figures, it is to be understood that other similar embodiments may be used or modifications and additions may be made to the described embodiment for performing the same function of the present invention without deviating therefrom. Further, the arrangements described can be used with respect to components other than connectors, that comprise housings formed of insulative materials which carry elements to be fused onto a PWB or other electrical substrate. It will be appreciated that electrical connector and the method of its manufacture has been described in which the connector that can utilize BGA technologies for mounting on a PWB. Surprisingly and unexpectedly it was also found that there was a relatively high degree of uniformity in the profiles of the solder balls and, in particular, in the weights and/or volume of the solder balls. c and 28 d. There was only one short between adjacent signal contacts and good connections were made between the contacts and the solder balls and between the solder balls and the boards at all other points. FIGS. 28 a and 28 b. Cross sectional electron microscope photographs were taken",
    "textAfterTable": "US2702255 Apr 14, 1951 Feb 15, 1955 American Motors Corp Surface treated plastic materials and method for producing same US2740075 Jun 16, 1954 Mar 27, 1956 Metal rectifier assemblies US2794176 May 21, 1953 May 28, 1957 Utica Drop Forge & Tool Corp Terminal construction US2879977 Jul 11, 1957 Mar 31, 1959 Trought Associates Inc Mounting device US2938068 Oct 28, 1957 May 24, 1960 Itt Electrical connectors US2980881 Apr 14, 1958 Apr 18, 1961 United Carr Fastener Corp Connector and snap-in contact therefor US3020650 Nov 20, 1959 Feb 13, 1962 Acf Ind Inc Dynamic servo driven magnetostrictive delay line US3022481 Feb 26, 1960 Feb 20, 1962 Stepoway Theodore Electrical connector US3130351 Sep 14, 1961 Apr 21, 1964 George J Giel Modular circuitry apparatus US3172718 Mar 20, 1963",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}