{
    "relation": [
        [
            "Citing Patent",
            "US6958685 *",
            "US7104438 *",
            "US7148793 *",
            "US7202777 *",
            "US7231274",
            "US7271733 *",
            "US7336164",
            "US7369043 *",
            "US7385485",
            "US7487671 *",
            "US7508299",
            "US7561035 *",
            "US7612665 *",
            "US7688216",
            "US7705719 *",
            "US7750798 *",
            "US7791460 *",
            "US7994904 *",
            "US8296006 *",
            "US9094536 *",
            "US20040135681 *",
            "US20050024192 *",
            "US20050087593 *",
            "US20050110626 *",
            "US20100026518 *",
            "US20140106687 *",
            "US20140118134 *",
            "US20140266661 *",
            "EP2028026A2"
        ],
        [
            "Filing date",
            "Aug 1, 2003",
            "Oct 22, 2003",
            "Jan 30, 2004",
            "Dec 16, 2004",
            "May 9, 2005",
            "Nov 16, 2004",
            "Feb 23, 2006",
            "May 11, 2005",
            "Mar 18, 2005",
            "Aug 18, 2007",
            "Mar 18, 2005",
            "Sep 8, 2003",
            "Sep 14, 2004",
            "Mar 10, 2004",
            "Sep 18, 2007",
            "Sep 18, 2007",
            "Jun 22, 2006",
            "Oct 1, 2008",
            "Nov 28, 2006",
            "Mar 11, 2013",
            "Dec 15, 2003",
            "Aug 1, 2003",
            "Oct 22, 2003",
            "Nov 16, 2004",
            "",
            "Mar 11, 2013",
            "Sep 3, 2013",
            "Mar 15, 2013",
            "Jul 22, 2008"
        ],
        [
            "Publication date",
            "Oct 25, 2005",
            "Sep 12, 2006",
            "Dec 12, 2006",
            "Apr 10, 2007",
            "Jun 12, 2007",
            "Sep 18, 2007",
            "Feb 26, 2008",
            "May 6, 2008",
            "Jun 10, 2008",
            "Feb 10, 2009",
            "Mar 24, 2009",
            "Jul 14, 2009",
            "Nov 3, 2009",
            "Mar 30, 2010",
            "Apr 27, 2010",
            "Jul 6, 2010",
            "Sep 7, 2010",
            "Aug 9, 2011",
            "Oct 23, 2012",
            "Jul 28, 2015",
            "Jul 15, 2004",
            "Feb 3, 2005",
            "Apr 28, 2005",
            "May 26, 2005",
            "Feb 4, 2010",
            "Apr 17, 2014",
            "May 1, 2014",
            "Sep 18, 2014",
            "Feb 25, 2009"
        ],
        [
            "Applicant",
            "Siemens Vdo Automotive Corporation",
            "The Goodyear Tire & Rubber Company",
            "Trw Automotive Us Llc",
            "Denso Corporation",
            "Lear Corporation",
            "S.N.R. Roulements",
            "Dymos Co., Ltd.",
            "Ford Global Technologies, Llc",
            "Infineon Technologies Ag",
            "Silicon Valley Micro C Corp.",
            "Infineon Technologies Ag",
            "Ntn Corporation",
            "Ntn Corporation",
            "Ntn Corporation",
            "Denso Corporation",
            "Denso Corporation",
            "Denso Corporation",
            "Hyundai Motor Company",
            "Calsonic Kansei Corporation",
            "Vega Grieshaber Kg",
            "Pacific Industrial No., Ltd.",
            "Vdo Automotive Corporation",
            "Benedict Robert L.",
            "S.N.R. Roulements",
            "Endres + Hauser Flowtec Ag",
            "Vega Grieshaber Kg",
            "Samsung Electronics Co., Ltd.",
            "Continental Automotive Systems, Inc.",
            "Silicon Valley Micro C Corporation"
        ],
        [
            "Title",
            "Asynchronous localization signals for tire pressure monitoring system",
            "Method of integrating tire identification into a vehicle information system",
            "Tire parameter sensing system having auto-location feature and associated method",
            "Tire condition monitoring system",
            "Method of programming a tire monitoring system",
            "System and method for determining at least one parameter of at least one rotating member by means of reference and speed signals",
            "Tire pressure monitoring system and sensor therefor",
            "Method and apparatus for automatically identifying the location of pressure sensors in a tire pressure monitoring system",
            "Smart time tire monitoring system",
            "Tire parameter monitoring system with sensor location using magnetic fields",
            "Wireless network time stamp system and method",
            "Wireless sensor system and bearing assembly equipped with the same",
            "Wireless sensor system and bearing assembly having built-in wireless sensor",
            "Wireless sensor system and wheel support bearing assembly utilizing the same",
            "Wheel position detecting device and tire air pressure detecting device using the same",
            "Wheel position detecting device that verifies accuracy of detection using trigger signal reception strength and tire air pressure detecting device including the same",
            "Tire pressure monitoring system with reliable wireless communication between wheel-based transceivers and vehicle body-based transceiver",
            "System for automatically recognizing locations of respective tires",
            "Tire pressure monitoring device",
            "Power supply system for a field device with a radio module",
            "Tire condition monitoring apparatus",
            "Asynchronous localization signals for tire pressure monitoring system",
            "Method of integrating tire identification into a vehicle information system",
            "System and method for determining at least one parameter of at least one rotating member by means of reference and speed signals",
            "Measuring system having a sensor module and a transmitter module",
            "Power supply system for a field device with a radio module",
            "Tire pressure monitoring system",
            "Methods, systems and devices for integration of tire pressure monitoring sensors with a tire pressure monitoring system",
            "Tire parameter monitoring system with sensor location using magnetic fields"
        ]
    ],
    "pageTitle": "Patent US6838985 - System and method for remote tire pressure monitoring with low frequency ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6838985?dq=5579430",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472228459,
    "recordOffset": 472204183,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30147=This application claims the benefit of U.S. provisional application Ser. No. 60/367,191, filed Mar. 25, 2002.}",
    "textBeforeTable": "Patent Citations While various embodiments of the invention have been illustrated and described, it is not intended that these embodiments illustrate and describe all possible forms of the present invention. Rather, the words used in the specification are words of description rather than limitation, and it is understood that various changes may be made without departing from the spirit and scope of the invention. Indeed, many alternatives, modifications, and variations will be apparent to those skilled in the art in light of the foregoing description, and the present invention is intended to embrace all such alternatives. From the foregoing description, it can be seen that the present invention provides an improved system and method for remote vehicle tire pressure monitoring. The system and method of the present invention use low frequency initiators to trigger or initiate transmission of wireless tire information signals from tire mounted transmitters, thereby providing for automatic identification of tire locations, without the need for initialization or sign-up operations. The system and method of the present invention also use such low frequency initiators to eliminate data collision and increase tire transmitter battery life, as well as to provide for recharging of tire transmitter batteries. , including the execution of a subset of the steps shown and/or the execution of one or more steps simultaneously. FIG. 2 is exemplary of the method (40) of the present invention. In that regard, the",
    "textAfterTable": "US5483827 Jun 3, 1994 Jan 16, 1996 Computer Methods Corporation Active integrated circuit transponder and sensor apparatus for sensing and transmitting vehicle tire parameter data US5485381 Feb 4, 1993 Jan 16, 1996 Robert Bosch Gmbh Navigation system for land vehicles US5500637 Feb 22, 1994 Mar 19, 1996 Kabushiki Kaisha Tokai Rika Denki Seisakusho Abnormal condition signal transmitting device for a rotating body US5515014 Nov 30, 1994 May 7, 1996 At&T Corp. Interface between SAW filter and Gilbert cell mixer US5531109 Jul 11, 1994 Jul 2, 1996 Tsagas; Nicolaos Indicator of the air pressure in the pneumatic tires of a vehicle based on a capacitive coupling US5562787 May 30, 1995 Oct 8, 1996 Bridgestone/Firestone, Inc. Method of monitoring conditions of vehicle tires US5573610 May 30, 1995 Nov 12, 1996 Bridgestone/Firestone, Inc. Tires containing a monitoring device for monitoring an engineering condition therein US5573611 May 30, 1995 Nov 12, 1996 Bridgestone/Firestone, Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}