{
    "relation": [
        [
            "Citing Patent",
            "US6608772 *",
            "US6975552 *",
            "US7057201",
            "US7830221",
            "US7872902",
            "US8050127 *",
            "US8143966",
            "US8279698 *",
            "US8594114",
            "US20050041512 *",
            "US20050094461 *",
            "US20120051167 *"
        ],
        [
            "Filing date",
            "Aug 29, 2002",
            "Aug 19, 2003",
            "Sep 2, 2004",
            "Jan 25, 2008",
            "Aug 18, 2008",
            "Jun 30, 2009",
            "Oct 12, 2010",
            "Oct 31, 2011",
            "May 29, 2008",
            "Aug 19, 2003",
            "Sep 2, 2004",
            "Oct 31, 2011"
        ],
        [
            "Publication date",
            "Aug 19, 2003",
            "Dec 13, 2005",
            "Jun 6, 2006",
            "Nov 9, 2010",
            "Jan 18, 2011",
            "Nov 1, 2011",
            "Mar 27, 2012",
            "Oct 2, 2012",
            "Nov 26, 2013",
            "Feb 24, 2005",
            "May 5, 2005",
            "Mar 1, 2012"
        ],
        [
            "Applicant",
            "Mitsubishi Denki Kabushiki Kaisha",
            "Micron Technology, Inc.",
            "Infineon Technologies Ag",
            "Micron Technology, Inc.",
            "Qimonda Ag",
            "Hynix Semiconductor Inc.",
            "Micron Technology, Inc.",
            "Hynix Semiconductor Inc.",
            "Promos Technologies Pte. Ltd.",
            "Kim Tae H.",
            "Martin Perner",
            "Joong-Ho Lee"
        ],
        [
            "Title",
            "Low-power semiconductor memory device",
            "Hybrid open and folded digit line architecture",
            "Integrated semiconductor memory",
            "Coupling cancellation scheme",
            "Integrated circuit with bit lines positioned in different planes",
            "Semiconductor memory device",
            "Coupling cancellation scheme",
            "Semiconductor memory device",
            "Shielding of datalines with physical placement based on time staggered access",
            "Hybrid open and folded digit line architecture",
            "Integrated semiconductor memory",
            "Semiconductor memory device"
        ]
    ],
    "pageTitle": "Patent US6304479 - Shielded bit line architecture for memory arrays - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6304479?dq=6,272,646",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486839931,
    "recordOffset": 486824039,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Having described preferred embodiments for a shielded bit line architecture for memory arrays (which are intended to be illustrative and not limiting), it is noted that modifications and variations can be made by persons skilled in the art in light of the above teachings. It is therefore to be understood that changes may be made in the particular embodiments of the invention disclosed which are within the scope and spirit of the invention as outlined by the appended claims. Having thus described the invention with the details and particularity required by the patent laws, what is claimed and desired protected by Letters Patent is set forth in the appended claims. The present invention has been illustratively presented in terms of a folded bit line architecture; however, other architectures may be employed which can benefit by the present invention. Referring to FIG. 11, an illustrative diagram is shown for quantifying the effects of surrounding components on a signal on bitline 212 2′. Each line labeled in FIG. 11 represents the effect on voltage that each corresponding component of FIG. 10 has on the signal on bitline 212 2′. Sense amplifier 216 1 advantageously sees a relative loss of only −2.0, indicted in box 229. This relative term is a multiplier, which represents a multiple of a coupling percent. A bar 217 is indicated showing the relative differential measured by sense amplifier 216 1 due to the coupling",
    "textAfterTable": "US6608772 * Aug 29, 2002 Aug 19, 2003 Mitsubishi Denki Kabushiki Kaisha Low-power semiconductor memory device US6975552 * Aug 19, 2003 Dec 13, 2005 Micron Technology, Inc. Hybrid open and folded digit line architecture US7057201 Sep 2, 2004 Jun 6, 2006 Infineon Technologies Ag Integrated semiconductor memory US7830221 Jan 25, 2008 Nov 9, 2010 Micron Technology, Inc. Coupling cancellation scheme US7872902 Aug 18, 2008 Jan 18, 2011 Qimonda Ag Integrated circuit with bit lines positioned in different planes US8050127 * Jun 30, 2009 Nov 1, 2011 Hynix Semiconductor Inc. Semiconductor memory device US8143966 Oct 12, 2010 Mar 27, 2012 Micron Technology, Inc. Coupling cancellation scheme US8279698 * Oct 31, 2011 Oct 2, 2012 Hynix Semiconductor Inc. Semiconductor memory device US8594114 May 29, 2008",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}