{
    "relation": [
        [
            "Cited Patent",
            "US3766579 *",
            "US3802004 *",
            "US3864768 *",
            "US3925835 *",
            "US3983587 *"
        ],
        [
            "Filing date",
            "Jun 21, 1971",
            "Dec 29, 1971",
            "Jul 13, 1973",
            "Jul 1, 1974",
            "Sep 23, 1975"
        ],
        [
            "Publication date",
            "Oct 23, 1973",
            "Apr 9, 1974",
            "Feb 11, 1975",
            "Dec 16, 1975",
            "Oct 5, 1976"
        ],
        [
            "Applicant",
            "E Shields",
            "J Whitney",
            "Said Fraige By Said Read",
            "William Pennington",
            "Gorran Jody A"
        ],
        [
            "Title",
            "Water bed",
            "Fluid containing mattress",
            "Water mattress with internal float tube",
            "Frameless safety water bed",
            "Wheel or geriatrics chair cushion"
        ]
    ],
    "pageTitle": "Patent US4150447 - Mattress construction - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4150447?dq=5,778,372",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479245999,
    "recordOffset": 479227474,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39218=In a second subassembly, the sheets associated with the tube 17, such as the sheets 29 and 31, can be joined as disclosed and claimed by Craig S. Miller in copending application Ser. No. 763,305 filed Jan. 28, 1977, now abandoned. However, prior to formation of the seal 32 which encloses the tubular cavity 19, the seal 42 can be formed between the sheets forming the tube 17, such as the sheet 29 and 31, and the sheet 37 of the envelope 21. This seal 42 is illustrated in FIG. 4 wherein it will be noted that the sheet 37 is defined by edges 65. In this embodiment, the marginal portions 39 of the sheet 37 extend between the seal 42 and the edges 65., 20808=Watermattresses of this type have been provided with unitary sheet configurations and a preferred lap seam construction as disclosed by B. Kuss in U.S. Pat. No. 3,753,823. A highly desirable bladder configuration providing a relatively square corner construction is disclosed by Craig S. Miller in copending application Ser. No. 754,015 filed Dec. 23, 1976 now U.S. Pat. No. 4,115,886.}",
    "textBeforeTable": "Patent Citations Although the mattress and method of construction associated with this invention have been disclosed with reference to specific embodiments and method steps, it will be understood that the invention can be otherwise embodied and constructed so that the scope of the invention should be ascertained only with reference to the following claims. The novel valve 47 which extends into the cavity 23 provides means for bleeding air from the cavity 23 as the bladder 13 and the tube 17 are being filled. In accordance with this preferred method, the mattress 11 is provided with structural characteristics which provide significant advantages over the mattresses of the prior art. The double wall construction throughout the mattress results in a high degree of integrity while permitting the flexibility needed to accommodate the significant stresses associated with the pressures of the water in the mattress. With the attachment of a water bladder 13 to the envelope 21 on a single side of the mattress, the side portions 26 and at least one of the top or bottom walls of the bladder 13 are free to move relative to the tube 17 and the envelope 21. Each of the tube 17 and the bladder 13 is retained in its preferred location within the envelope 21 by a single heat seal, the seals 42 and 28 respectively. In some embodiments, these means of attachment can be provided by merely extending the various",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4346489 * Jun 3, 1980 Aug 31, 1982 Mcmullan James P Foldable waterbed US4547919 * Feb 17, 1983 Oct 22, 1985 Cheng Chung Wang Inflatable article with reforming and reinforcing structure US4745649 * Sep 16, 1985 May 24, 1988 Wang Cheng C Inflatable article with edge concealing means US5412821 * Nov 18, 1991 May 9, 1995 Span-America Medical Systems, Inc. Pressure relief support system for a mattress US6505366 * Jul 20, 1999 Jan 14, 2003 Kjersti B. Lied Adjustable supporting device, intended for a premature infant in an incubator US6857152 * Jul 14, 2004 Feb 22, 2005 Andy S. Chow Water bed structure",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}