{
    "relation": [
        [
            "Citing Patent",
            "US6137623 *",
            "US6233088",
            "US6275320",
            "US6373632",
            "US6396620",
            "US6586738",
            "US6927894",
            "US7026602",
            "US7092144",
            "US7619809",
            "US8960929 *",
            "US20100177414 *",
            "WO2001067156A2 *"
        ],
        [
            "Filing date",
            "Mar 17, 1998",
            "Aug 10, 2000",
            "Sep 27, 1999",
            "Aug 25, 2000",
            "Oct 30, 2000",
            "Apr 13, 2001",
            "May 22, 2002",
            "May 29, 2003",
            "May 6, 2005",
            "Jul 26, 2006",
            "Jul 10, 2009",
            "",
            "Mar 1, 2001"
        ],
        [
            "Publication date",
            "Oct 24, 2000",
            "May 15, 2001",
            "Aug 14, 2001",
            "Apr 16, 2002",
            "May 28, 2002",
            "Jul 1, 2003",
            "Aug 9, 2005",
            "Apr 11, 2006",
            "Aug 15, 2006",
            "Nov 17, 2009",
            "Feb 24, 2015",
            "Jul 15, 2010",
            "Sep 13, 2001"
        ],
        [
            "Applicant",
            "Mcnc",
            "Mcnc",
            "Jds Uniphase, Inc.",
            "Axsun Technologies, Inc.",
            "Mcnc",
            "Mcnc",
            "E-Vision, Llc",
            "Research Triangle Institute",
            "Intellimats, Llc",
            "E-Vision, Llc",
            "Thales",
            "Thales",
            "Axsun Tech Inc"
        ],
        [
            "Title",
            "Modulatable reflectors and methods for using same",
            "Methods for modulating a radiation signal",
            "MEMS variable optical attenuator",
            "Tunable Fabry-Perot filter",
            "Electrostatically actuated electromagnetic radiation shutter",
            "Electromagnetic radiation detectors having a micromachined electrostatic chopper device",
            "Mirror assemblies incorporating variable index of refraction materials",
            "Electromagnetic radiation detectors having a microelectromechanical shutter device",
            "Mirror assemblies incorporating variable index of refraction materials",
            "Mirror assemblies incorporating variable index of refraction materials",
            "Device for correcting optical defects of a telescope mirror",
            "Device for Correcting Optical Defects of a Telescope Mirror",
            "Tunable fabry-perot filter"
        ]
    ],
    "pageTitle": "Patent US5757562 - Mirror with reflection coefficient variable spatially in amplitude and in phase - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5757562?dq=6322901",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476955631,
    "recordOffset": 476939669,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations With a mirror of this kind four independent laser beams (passing through openings 11 through 14) can be combined into a single beam. FIG. 5 shows the amplitude distribution of the reflection coefficient. In this case, the function of the mirror is given by the following equation: ##EQU6## with: ##EQU7## x and v are the coordinates of the current point of the mirror in the rectangular system of axes Oxy, Δ12 is the distance between the plates 1 and 2, Δ22A is the distance between the plates 2 and 2A, αx and αy are the local angles of inclination of the plate 2 relative to the plate 1, βx and βy are the angles of inclination of the plate 2A relative to the plate 1. The three plates 1, 2 and 2A are rectangular in shape. The plate 1 may be displaced parallel to the axis X--X (arrows 7) and the plates 2 and 2A may be deformed (for example by fluid pressure) to assume cylindrical shapes (shown in dashed line). The generatrices of the cylindrical shapes of the two plates 2 and 2A are orthogonal. FIG. 4 is a schematic showing an embodiment of the mirror of the invention with three partially or highly reflecting plates 1, 2 and 2A. From the foregoing it will be understood that using the FIG. 1 mirror with two rectangular plates fixed along two opposite edges, and therefore of",
    "textAfterTable": "US6927894 May 22, 2002 Aug 9, 2005 E-Vision, Llc Mirror assemblies incorporating variable index of refraction materials US7026602 May 29, 2003 Apr 11, 2006 Research Triangle Institute Electromagnetic radiation detectors having a microelectromechanical shutter device US7092144 May 6, 2005 Aug 15, 2006 Intellimats, Llc Mirror assemblies incorporating variable index of refraction materials US7619809 Jul 26, 2006 Nov 17, 2009 E-Vision, Llc Mirror assemblies incorporating variable index of refraction materials US8960929 * Jul 10, 2009 Feb 24, 2015 Thales Device for correcting optical defects of a telescope mirror US20100177414 * Jul 15, 2010 Thales Device for Correcting Optical Defects of a Telescope Mirror WO2001067156A2 * Mar 1, 2001 Sep 13, 2001 Axsun Tech Inc Tunable fabry-perot filter * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}