{
    "relation": [
        [
            "Date",
            "Sep 5, 1997",
            "Jul 28, 2003",
            "Jul 27, 2007",
            "Dec 12, 2008",
            "Jul 22, 2010",
            "Jul 21, 2011",
            "Apr 27, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: FUJITSU LIMITED, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:TAKEMAE, YOSHIHIRO;TAGUCHI, MASAO;MATSUZAKI, YASUROU;AND OTHERS;REEL/FRAME:008794/0024 Effective date: 19970822",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: FUJITSU MICROELECTRONICS LIMITED, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FUJITSU LIMITED;REEL/FRAME:021998/0645 Effective date: 20081104 Owner name: FUJITSU MICROELECTRONICS LIMITED,JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FUJITSU LIMITED;REEL/FRAME:021998/0645 Effective date: 20081104",
            "Owner name: FUJITSU SEMICONDUCTOR LIMITED, JAPAN Free format text: CHANGE OF NAME;ASSIGNOR:FUJITSU MICROELECTRONICS LIMITED;REEL/FRAME:024982/0245 Effective date: 20100401",
            "Year of fee payment: 12",
            "Owner name: SOCIONEXT INC., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:FUJITSU SEMICONDUCTOR LIMITED;REEL/FRAME:035508/0637 Effective date: 20150302"
        ]
    ],
    "pageTitle": "Patent US6028816 - System configured of synchronous semiconductor device for adjusting timing ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6028816?dq=5166694",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00297-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481980383,
    "recordOffset": 481925542,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It will thus be understood from the foregoing description that according to the present invention, even if the received clock and the input signal are out of phase with each other due to the difference in transmission time through signal routes, the input signal is retrieved free of phase displacement. The input establishment time, therefore, can be reduced to a minimum length required for circuit operation. In addition, the signal retrieved and output is resynchronized, thereby eliminating both the out-of-phase condition and an operation error at the same time. FIG. 82 is a diagram showing a configuration of the clock generating circuit and the signal input circuit of a semiconductor device according to a 17th embodiment. FIG. 83 is a time chart showing the operation of the 17th embodiment. A clock generating circuit 610, a dummy input circuit 620 and an input circuit 630 are identical to the corresponding circuits in the 15th embodiment. The difference of this embodiment from the 15th embodiment resides in the provision of a PLL circuit 680. According to the first embodiment, the input signal is effective for a predetermined length of time before and after the rising edge of the external clock. In spite of this, the input signal may remain effective for a predetermined length of time about the phase displaced with respect to the leading or falling edge of the external clock. As shown in FIG. 83, in",
    "textAfterTable": "Jan 22, 1996 Feb 10, 1998 Mitsubishi Denki Kabushiki Kaisha Semiconductor memory device capable of high speed plural parallel test, method of data writing therefor and parallel tester US5768213 * Jun 24, 1996 Jun 16, 1998 Samsung Electronics Co., Ltd. Clock generating circuit for use in semiconductor memory device EP0575691A2 * Jan 21, 1993 Dec 29, 1993 International Business Machines Corporation Compact phase recovery scheme using digital circuits EP0653860A2 * Oct 28, 1994 May 17, 1995 International Business Machines Corporation Digital phase alignment and integrated multichannel transceiver employing same GB2127594A * Title not available GB2297209A * Title not available GB2316208A * Title not available WO1994020898A1 * Mar 9, 1994 Sep 15, 1994 Apple",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}