{
    "relation": [
        [
            "Date",
            "Mar 21, 2007",
            "Mar 22, 2007",
            "Mar 26, 2007",
            "Mar 27, 2007",
            "Mar 28, 2007",
            "Aug 7, 2008",
            "Nov 12, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: ROHM AND HAAS COMPANY, PENNSYLVANIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:PALLI, SUBBA REDDY;KAPITSKAYA, MARIANNA ZINOVJEVNA;KUMAR, MOHAN BASAVARAJU;AND OTHERS;REEL/FRAME:019041/0846;SIGNING DATES FROM 20010606 TO 20010608",
            "Owner name: RGH, LLC, PENNSYLVANIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:ROHM AND HAAS COMPANY;REEL/FRAME:019048/0587 Effective date: 20030516",
            "Owner name: UNIVERSITY OF PITTSBURGH MEDICAL CENTER, PENNSYLVA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NEW RHEOGENE I, LLC;REEL/FRAME:019062/0531 Effective date: 20030730 Owner name: NEW RHEOGENE I, LLC, PENNSYLVANIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:RGH LLC;REEL/FRAME:019061/0594 Effective date: 20030519",
            "Owner name: RHEOGENE HOLDINGS, INC., PENNSYLVANIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:UNIVERSITY OF PITTSBURGH MEDICAL CENTER;REEL/FRAME:019063/0844 Effective date: 20030730 Owner name: RHEOGENE, INC. (A DELAWARE CORPORATION), PENNSYLVA Free format text: MERGER;ASSIGNOR:RHEOGENE, INC.;REEL/FRAME:019069/0147 Effective date: 20041222 Owner name: RHEOGENE, INC., PENNSYLVANIA Free format text: LICENSE;ASSIGNOR:RHEOGENE HOLDINGS, INC.;REEL/FRAME:019063/0966 Effective date: 20030731",
            "Owner name: INTREXON CORPORATION, VIRGINIA Free format text: MERGER;ASSIGNOR:RHEOGENE, INC. (DE CORPORATION);REEL/FRAME:019073/0507 Effective date: 20070103",
            "Owner name: RHEOGENE, INC. (DE CORPORATION), DELAWARE Free format text: MERGER;ASSIGNOR:RHEOGENE HOLDINGS, INC.;REEL/FRAME:021356/0581 Effective date: 20041222",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7531326 - Chimeric retinoid X receptors and their use in a novel ecdysone receptor ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7531326?dq=7,003,515",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485238395,
    "recordOffset": 485156052,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6553=FIGS. 6-8 show the results of these analyses. The MmRXR-LmUSP chimera was the best partner for CfEcR (11,000 fold induction, FIG. 6), DmEcR (1759 fold induction, FIG. 7). For all other EcRs tested, the RXR chimera produced higher background levels in the absence of ligand (see FIG. 8). The CfEcR/chimeric RXR-based switch (switch 1.13) was more sensitive to non-steroid than PonA whereas, the DmEcR/chimeric RXR-based switch (switch 1.20) was more sensitive to PonA than non-steroid. Since these two switch formats produce decent levels of induction and show differential sensitivity to steroids and non-steroids, these may be exploited for applications in which two or more gene switches are desired.}",
    "TableContextTimeStampAfterTable": "{104458=In a specific embodiment, two DNA sequences are “substantially homologous” or “substantially similar” when at least about 50% (preferably at least about 75%, and most preferably at least about 90 or 95%) of the nucleotides match over the defined length of the DNA sequences. Sequences that are substantially homologous can be identified by comparing the sequences using standard software available in sequence data banks, or in a Southern hybridization experiment under, for example, stringent conditions as defined for that particular system. Defining appropriate hybridization conditions is within the skill of the art. See, e.g., Sambrook et al., 1989, supra., 115110=The two-hybrid ecdysone receptor-based gene expression modulation system may be either heterodimeric and homodimeric. A functional EcR complex generally refers to a heterodimeric protein complex consisting of two members of the steroid receptor family, an ecdysone receptor protein obtained from various insects, and an ultraspiracle (USP) protein or the vertebrate homolog of USP, retinoid X receptor protein (see Yao, et al. (1993) Nature 366, 476-479; Yao, et al., (1992) Cell 71, 63-72). However, the complex may also be a homodimer as detailed below. The functional ecdysteroid receptor complex may also include additional protein(s) such as immunophilins. Additional members of the steroid receptor family of proteins, known as transcriptional factors (such as DHR38 or betaFTZ-1), may also be ligand dependent or independent partners for EcR, USP, and/or RXR. Additionally, other cofactors may be required such as proteins generally known as coactivators (also termed adapters or mediators). These proteins do not bind sequence-specifically to DNA and are not involved in basal transcription. They may exert their effect on transcription activation through various mechanisms, including stimulation of DNA-binding of activators, by affecting chromatin structure, or by mediating activator-initiation complex interactions. Examples of such coactivators include RIP140, TIF1, RAP46/Bag-1, ARA70, SRC-1/NCoA-1, TIF2/GRIP/NCoA-2, ACTR/AIB1/RAC3/pCIP as well as the promiscuous coactivator C response element B binding protein, CBP/p300 (for review see Glass et al., Curr. Opin. Cell Biol. 9: 222-232, 1997). Also, protein cofactors generally known as corepressors (also known as repressors, silencers, or silencing mediators) may be required to effectively inhibit transcriptional activation in the absence of ligand. These corepressors may interact with the unliganded ecdysone receptor to silence the activity at the response element. Current evidence suggests that the binding of ligand changes the conformation of the receptor, which results in release of the corepressor and recruitment of the above described coactivators, thereby abolishing their silencing activity. Examples of corepressors include N-CoR and SMRT (for review, see Horwitz et al. Mol Endocrinol. 10: 1167-1177, 1996). These cofactors may either be endogenous within the cell or organism, or may be added exogenously as transgenes to be expressed in either a regulated or unregulated fashion. Homodimer complexes of the ecdysone receptor protein, USP, or RXR may also be functional under some circumstances., 27770=The PR1-a promoter from tobacco is induced during the systemic acquired resistance response following pathogen attack. The use of PR1-a may be limited because it often responds to endogenous materials and external factors such as pathogens, UV-B radiation, and pollutants. Gene regulation systems based on promoters induced by heat shock, interferon and heavy metals have been described (Wurn et al., 1986, Proc. Natl. Acad. Sci. USA 83: 5414-5418; Arnheiter et al., 1990, Cell 62: 51-61; Filmus et al., 1992, Nucleic Acids Research 20: 27550-27560). However, these systems have limitations due to their effect on expression of non-target genes. These systems are also leaky., 63376=The appropriate stringency for hybridizing nucleic acids depends on the length of the nucleic acids and the degree of complementation, variables well known in the art. The greater the degree of similarity or homology between two nucleotide sequences, the greater the value of Tm for hybrids of nucleic acids having those sequences. The relative stability (corresponding to higher Tm) of nucleic acid hybridizations decreases in the following order: RNA:RNA, DNA:RNA, DNA:DNA. For hybrids of greater than 100 nucleotides in length, equations for calculating Tm have been derived (see Sambrook et al., supra, 9.50-0.51). For hybridization with shorter nucleic acids, i.e., oligonucleotides, the position of mismatches becomes more important, and the length of the oligonucleotide determines its specificity (see Sambrook et al., supra, 11.7-11.8)., 184324=Nucleic acid array technology is a useful technique for determining differential mRNA expression. Such technology includes, for example, oligonucleotide chips and DNA microarrays. These techniques rely on DNA fragments or oligonucleotides which correspond to different genes or cDNAs which are immobilized on a solid support and hybridized to probes prepared from total mRNA pools extracted from cells, tissues, or whole organisms and converted to cDNA. Oligonucleotide chips are arrays of oligonucleotides synthesized on a substrate using photolithographic techniques. Chips have been produced which can analyze for up to 1700 genes. DNA microarrays are arrays of DNA samples, typically PCR products, that are robotically printed onto a microscope slide. Each gene is analyzed by a full or partial-length target DNA sequence. Microarrays with up to 10,000 genes are now routinely prepared commercially. The primary difference between these two techniques is that oligonucleotide chips typically utilize 25-mer oligonucleotides which allow fractionation of short DNA molecules whereas the larger DNA targets of microarrays, approximately 1000 base pairs, may provide more sensitivity in fractionating complex DNA mixtures., 31173=Growth, molting, and development in insects are regulated by the ecdysone steroid hormone (molting hormone) and the juvenile hormones (Dhadialla, et al., 1998, Annu. Rev. Entomol. 43: 545-569). The molecular target for ecdysone in insects consists of at least ecdysone receptor (EcR) and ultraspiracle protein (USP). EcR is a member of the nuclear steroid receptor super family that is characterized by signature DNA and ligand binding domains, and an activation domain (Koelle et al. 1991, Cell, 67:59-77). EcR receptors are responsive to a number of steroidal compounds such as ponasterone A and muristerone A. Recently, non-steroidal compounds with ecdysteroid agonist activity have been described, including the commercially available insecticides tebufenozide and methoxyfenozide that are marketed world wide by Rohm and Haas Company (see International Patent Application No. PCT/EP96/00686 and U.S. Pat. No. 5,530,028). Both analogs have exceptional safety profiles to other organisms., 24523=This application is a section 371 national phase filing of International Application No. PCT/US02/05706, which has an international filing date of 20 Feb. 2002 and claims benefit and priority to U.S. Provisional Patent Application No. 60/269,799 filed 20 Feb. 2001, U.S. Provisional Patent Application No. 60/294,814 filed 31 May 2001 and U.S. Provisional Patent Application No. 60/294,819 filed 31 May 2001, each of which, including the sequence listings and tables submitted in electronic form in lieu of paper, is hereby incorporated by reference in its entirety., 104151=Accordingly, the term “sequence similarity” in all its grammatical forms refers to the degree of identity or correspondence between nucleic acid or amino acid sequences of proteins that may or may not share a common evolutionary origin (see Reeck et al., 1987, Cell 50:667)., 103425=As used herein, the term “homologous” in all its grammatical forms and spelling variations refers to the relationship between proteins that possess a “common evolutionary origin,” including proteins from superfamilies (e.g., the immunoglobulin superfamily) and homologous proteins from different species (e.g., myosin light chain, etc.) (Reeck et al., 1987, Cell 50:667.). Such proteins (and their encoding genes) have sequence homology, as reflected by their high degree of sequence similarity. However, in common usage and in the instant application, the term “homologous,” when modified with an adverb such as “highly,” may refer to sequence similarity and not a common evolutionary origin., 76745=Vectors may be introduced into the desired host cells by methods known in the art, e.g., transfection, electroporation, microinjection, transduction, cell fusion, DEAE dextran, calcium phosphate precipitation, lipofection (lysosome fusion), use of a gene gun, or a DNA vector transporter (see, e.g., Wu et al., 1992, J. Biol. Chem. 267: 963-967; Wu and Wu, 1988, J. Biol. Chem. 263: 14621-14624; and Hartmut et al., Canadian Patent Application No. 2,012,311, filed Mar. 15, 1990)., 111418=The term “sequence analysis software” refers to any computer algorithm or software program that is useful for the analysis of nucleotide or amino acid sequences. “Sequence analysis software” may be commercially available or independently developed. Typical sequence analysis software will include but is not limited to the GCG suite of programs (Wisconsin Package Version 9.0, Genetics Computer Group (GCG), Madison, Wis.), BLASTP, BLASTN, BLASTX (Altschul et al., J. Mol. Biol. 215:403-410 (1990), and DNASTAR (DNASTAR, Inc. 1228 S. Park St. Madison, Wis. 53715 USA). Within the context of this application it will be understood that where sequence analysis software is used for analysis, that the results of the analysis will be based on the “default values” of the program referenced, unless otherwise specified. As used herein “default values” will mean any set of values or parameters which originally load with the software when first initialized., 57035=The term “fragment” will be understood to mean a nucleotide sequence of reduced length relative to the reference nucleic acid and comprising, over the common portion, a nucleotide sequence identical to the reference nucleic acid. Such a nucleic acid fragment according to the invention may be, where appropriate, included in a larger polynucleotide of which it is a constituent. Such fragments comprise, or alternatively consist of, oligonucleotides ranging in length from at least 6, 8, 9, 10, 12, 15, 18, 20, 21, 22, 23, 24, 25, 30, 39, 40, 42, 45, 48, 50, 51, 54, 57, 60, 63, 66, 70, 75, 78, 80, 90, 100, 105, 120, 135, 150, 200, 300, 500, 720, 900, 1000 or 1500 consecutive nucleotides of a nucleic acid according to the invention., 79224=It is also possible to introduce a vector in vivo as a naked DNA plasmid (see U.S. Pat. Nos. 5,693,622, 5,589,466 and 5,580,859). Receptor-mediated DNA delivery approaches can also be used (Curiel et al., 1992, Hum. Gene Ther. 3: 147-154; and Wu and Wu, 1987, J. Biol. Chem. 262: 4429-4432)., 29482=Immunosuppressive molecules such as FK506, rapamycin and cyclosporine A can bind to immunophilins FKBP12, cyclophilin, etc. Using this information, a general strategy has been devised to bring together any two proteins simply by placing FK506 on each of the two proteins or by placing FK506 on one and cyclosporine A on another one. A synthetic homodimer of FK506 (FK1012) or a compound resulted from fusion of FK506-cyclosporine (FKCsA) can then be used to induce dimerization of these molecules (Spencer et al., 1993, Science 262:1019-24; Belshaw et al., 1996, Proc Natl Acad Sci USA 93:4604-7). Gal4 DNA binding domain fused to FKBP12 and VP16 activator domain fused to cyclophilin, and FKCsA compound were used to show heterodimerization and activation of a reporter gene under the control of a promoter containing Gal4 binding sites. Unfortunately, this system includes immunosuppressants that can have unwanted side effects and therefore, limits its use for various mammalian gene switch applications., 59968=A nucleic acid molecule is “hybridizable” to another nucleic acid molecule, such as a cDNA, genomic DNA, or RNA, when a single stranded form of the nucleic acid molecule can anneal to the other nucleic acid molecule under the appropriate conditions of temperature and solution ionic strength (see Sambrook et al., 1989 infra). Hybridization and washing conditions are well known and exemplified in Sambrook, J., Fritsch, E. F. and Maniatis, T. Molecular Cloning: A Laboratory Manual, Second Edition, Cold Spring Harbor Laboratory Press, Cold Spring Harbor (1989), particularly Chapter 11 and Table 11.1 therein (entirely incorporated herein by reference). The conditions of temperature and ionic strength determine the “stringency” of the hybridization., 77258=A polynucleotide according to the invention can also be introduced iii vivo by lipofection. For the past decade, there has been increasing use of liposomes for encapsulation and transfection of nucleic acids in vitro. Synthetic cationic lipids designed to limit the difficulties and dangers encountered with liposome mediated transfection can be used to prepare liposomes for in vivo transfection of a gene encoding a marker (Felgner et al., 1987, Proc. Natl. Acad. Sci. U.S.A. 84: 7413; Mackey, et al., 1988, Proc. Natl. Acad. Sci. U.S.A. 85: 8027-8031; and Ulmer et al., 1993, Science 259: 1745-1748). The use of cationic lipids may promote encapsulation of negatively charged nucleic acids, and also promote fusion with negatively charged cell membranes (Felgner and Ringold, 1989, Science 337: 387-388). Particularly useful lipid compounds and compositions for transfer of nucleic acids are described in International Patent Publications WO95/18863 and WO96/17823, and in U.S. Pat. No. 5,459,127. The use of lipofection to introduce exogenous genes into the specific organs in vivo has certain practical advantages. Molecular targeting of liposomes to specific cells represents one area of benefit. It is clear that directing transfection to particular cell types would be particularly preferred in a tissue with cellular heterogeneity, such as pancreas, liver, kidney, and the brain. Lipids may be chemically coupled to other molecules for the purpose of targeting (Mackey, et al., 1988, supra). Targeted peptides, e.g., hormones or neurotransmitters, and proteins such as antibodies, or non-peptide molecules could be coupled to liposomes chemically.}",
    "textBeforeTable": "Patent Citations , the presence of retinoic acid increased the sensitivity of CfEcR-DEF to non-steroidal ligand. At a non-steroid ligand concentration of 0.04 μM, there is very little induction in the absence of 9-cis-retinoic acid, but when 1 μM 9-cis-retinoic acid is added in addition to 0.04 μM non-steroid, induction is greatly increased. FIG. 12 As shown in Briefly, GAL4CfEcR-DEF, pFRLuc and VP16HsRXRβ-(1-8)-LmUSP-(9-12)-EF (chimera #9) were transfected into NIH3T3 cells and the transfected cells were treated with 0, 0.04, 0.2, 1, 5 and 25 μM non-steroidal ligand (GSE) and 0, 1, 5 and 25 μM 9-cis-retinoic acid (Sigma Chemical Company). The reporter activity was measured at 48 hours after adding ligands. This Example demonstrates the effect of introduction of a second ligand into the host cell comprising an EcR/chimeric RXR-based inducible gene expression modulation system of the invention. In particular, Applicants have determined the effect of 9-cis-retinoic acid on the transactivation potential of the GAL4CfEcR-DEF/VP16HsRXRβ-(1-8)-LmUSP-(9-12)-EF (βchimera 9; switch 1.27) gene switch along with pFRLuc in NIH 3T3 cells in the presence of non-steroid (GSE) for 48 hours. Example 6 ). FIG. 11 ). Conversely, DmEcR in combination with chimera 11 responded well to PonA but not to non-steroid (see FIG. 10 The selection of a particular chimeric RXR ligand binding domain can also influence the performance EcR in response to a particular ligand. Specifically, CfEcR in",
    "textAfterTable": "Jan 20, 1998 The Salk Institute For Biological Studies Methods of using novel steroid hormone orphan receptors US5723329 Nov 8, 1994 Mar 3, 1998 The Salk Institute For Biological Studies DNA encoding retinoid receptor X (RXR) alpha and gamma; corresponding vectors and host cells US5880333 Jan 21, 1998 Mar 9, 1999 Novartis Finance Corporation Control of gene expression in plants by receptor mediated transactivation in the presence of a chemical ligand US5919667 Jun 20, 1996 Jul 6, 1999 The Salk Institute For Biological Studies Modular assembly retroviral vectors and uses thereof US5939442 Jun 7, 1995 Aug 17, 1999 The Salk Institute For Biological Studies Modulations of peroxisome proliferator activated receptor-γ, and methods for the use thereof US5989863 Oct 14, 1998 Nov 23, 1999 Incyte Pharmaceuticals, Inc. Human ankyrin family protein US6013836 May 22, 1995 Jan 11, 2000 Rohm And Haas Company Insecticidal N'-substituted-N,N'-disubstitutedhydrazines US6025483 Jun 5, 1996 Feb 15, 2000 The Regents Of The University",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}