{
    "relation": [
        [
            "Date",
            "22 Dec 1982",
            "21 Nov 1989",
            "25 Jan 1994",
            "19 Jun 1994",
            "30 Aug 1994"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: BAYERISCHE MOTOREN WERKE AKTIENGESELLSCHAFT MUNICH Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:PROSKE, ARNOST;WEISHAUPT, WALTER;REEL/FRAME:004078/0486 Effective date: 19821210",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 19940622"
        ]
    ],
    "pageTitle": "Patent US4595902 - Anti-theft apparatus for vehicles - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4595902",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485117214,
    "recordOffset": 485100820,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While we have shown and described several embodiments in accordance with the present invention, it is understood that the same is not limited thereto but is susceptible to numerous changes and modifications as known to one having ordinary skill in the art, and we therefore do not wish to be limited to the details shown and described herein, but intend to cover all such modifications as are encompassed by the scope of the appended claims. Instead of sending the secondary signal only during the transmission of the code signal it is also possible, for example, to operate transmitter 10' continuously or run it at frequent short intervals independently of the transmission of the code signal. This has the advantage that the code signal, even if it does not reach receiver 2 and, in the case described above, activates transmitter 10', is overlapped with the jamming signal. Thus, overlapping of the code signal upon the jamming signal is independent of the accuracy of aim of the rightful vehicle user. Thus, either the jamming signal alone sent from transmitter 10' can be received outside of receiver 2 for a short period of time or, if within the transmission field of transmitter 8, the jamming signal overlapped with the code signal. Under no circumstances can the code signal transmitted by transmitter 8 be received alone outside of receiver 2, regardless of the location from which transmission system 7 sends",
    "textAfterTable": "US4307400 * 29 Sep 1968 22 Dec 1981 The United States Of America As Represented By The Secretary Of The Navy Electronic countermeasures system and method of utilizing the same US4383242 * 4 Jun 1979 10 May 1983 Tmx Systems Limited Automobile anti-theft system US4397034 * 26 Mar 1981 2 Aug 1983 Sperry Corporation Low probability of intercept transmitting apparatus DE2437314A1 * 2 Aug 1974 12 Feb 1976 Thomas Schubert Electronic anti-theft switch for car - with coded light signal key and photosensitive cell on window of car DE2926304A1 * 29 Jun 1979 29 Jan 1981 Daimler Benz Ag Security lock and theft alarm for motor vehicle - has electronic transmitter and receiver linked by non-electrical circuit * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4794268",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}