{
    "relation": [
        [
            "Citing Patent",
            "US7291098 *",
            "US7497813 *",
            "US7497814 *",
            "US7547268 *",
            "US7614983 *",
            "US7625322 *",
            "US7708672",
            "US7815554",
            "US7850580 *",
            "US7871357",
            "US8137248 *",
            "US8771153",
            "EP2072090A1 *"
        ],
        [
            "Filing date",
            "Apr 25, 2006",
            "Jun 27, 2006",
            "Sep 4, 2007",
            "Jun 13, 2006",
            "Nov 6, 2007",
            "Sep 19, 2007",
            "Dec 20, 2007",
            "Dec 20, 2007",
            "Dec 7, 2007",
            "Dec 20, 2007",
            "Mar 3, 2009",
            "Feb 8, 2011",
            "Dec 18, 2008"
        ],
        [
            "Publication date",
            "Nov 6, 2007",
            "Mar 3, 2009",
            "Mar 3, 2009",
            "Jun 16, 2009",
            "Nov 10, 2009",
            "Dec 1, 2009",
            "May 4, 2010",
            "Oct 19, 2010",
            "Dec 14, 2010",
            "Jan 18, 2011",
            "Mar 20, 2012",
            "Jul 8, 2014",
            "Jun 24, 2009"
        ],
        [
            "Applicant",
            "Krull Mark A",
            "Krull Mark A",
            "Krull Mark A",
            "Krull Mark A",
            "Krull Mark A",
            "Krull Mark A",
            "Precor Incorporated",
            "Precor Incorporated",
            "Johnson Health Tech Co., Ltd.",
            "Precor Incorporated",
            "Krull Mark A",
            "Icon Ip, Inc.",
            "Precor Incorporated"
        ],
        [
            "Title",
            "Exercise dumbbell methods and apparatus",
            "Methods for adjusting weight resistance to exercise",
            "Adjustable weight exercise dumbbell",
            "Exercise resistance methods and apparatus",
            "Apparatus for adjusting weight resistance to exercise",
            "Exercise weight adjustment methods and apparatus",
            "Incremental weight and selector",
            "Weight stack selector",
            "Resistance exercise apparatus",
            "Weight stack selector",
            "Exercise resistance apparatus",
            "Exercise weight bar with rotating handle and cam selection device",
            "Incremental weight and selector"
        ]
    ],
    "pageTitle": "Patent US7060011 - Exercise resistance methods and apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7060011?dq=4052565",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468997071,
    "recordOffset": 468970579,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5912=FIG. 1 shows an exercise weight stack machine 1700 constructed according to the principles of the present invention. The weight stack machine 1700 generally includes a frame 1610, a base member 1741, a vertical stack of weights 1642–1644 underlying the base member 1741, and first and second weight assemblies 1750 and 1770 disposed on opposite sides of the base member 1741. The two assemblies 1750 and 1770 show two different ways to selectively engage weights disposed on opposite sides of a base member (in this case, the top plate 1741).}",
    "TableContextTimeStampAfterTable": "{102393=Assuming that the base 2310 weighs ten pounds, and the plates 2380 weigh two and one-half pounds each, and the plates 2390 weight five pounds each, the dumbbell 2300 is capable of providing balanced weight resistance of ten pounds to sixty-five pounds in increments of five pounds. If balance is not a critical concern, the plates 2380 could alternatively weigh one and one-quarter pounds each in order to provide increments of two and one-half pounds (with the five pound increments provided by engaging an additional plate 2390 on only one end of the dumbbell 2300)., 62466=Those skilled in the art will recognize that the assembly 1770 holds the weights 1771 in place prior to selection; keeps the weights 1771 spaced apart to ensure proper selection; supports the weights 1771 during exercise motion; and returns the weights 1771 to their proper location at the conclusion of exercise motion; and further, requires a relatively smaller diameter selector rod (in combination with the bar), and does not require guides extending along the weights' path of travel. Moreover, the assembly 1770 uses injection molded parts to eliminate milling procedures which might otherwise be required during manufacture., 74061=Axially spaced, rectangular notches 1865 are cut into the “inboard” side of each end portion of the rail 1860, thereby leaving axially spaced fingers or spacers 1868. The notches 1865 are sized and configured to slidably receive respective weight plates 1881 and 1882. Also, for reasons described below, axially spaced, triangular notches 1869 are cut into the upper “inboard” face on the intermediate portion of the rail 1860., 58956=The box 1757 is movably mounted within a housing 1759 and is supported from below by shock absorbing springs 1758. The springs 1758 are disposed between the bottom wall of the box 1757 and the bottom wall of the housing 1759. The springs 1758 bias the box 1757 upward against pegs which project inward from the end walls of the box 1757. The shock absorbing springs 1658 are provided to accommodate downward impact which might occur at the conclusion of an exercise stroke., 87503=The handle 2145 is sized and configured for grasping and is rigidly interconnected between opposite side members 2142 and 2143. The first selector rod 2120 has parallel prongs 2121 which are interconnected at one end by a generally U-shaped handle 2122 that extends perpendicularly away from the prongs 2121. Similarly, the second selector rod 2130 has parallel prongs 2131 which are interconnected at one end by a generally U-shaped handle 2132 that extends perpendicularly away from the prongs 2131. The prongs 2121 and 2131 are inserted through holes in (and thereby movably connected to) the side members 2142 and 2143., 91806=The slots are bounded by downwardly converging sidewalls to encourage return of the base 2141 to its proper position relative to any “unselected” weights. The weights are selected by moving the two selector rods 2120 and 2130 relative to one another and into or out of the holes in the “opposite side” weights. Any “unselected” weights remain in place on a stand or other support when the base 2141 is lifted away from the stand. It may be desirable to bevel leading edges to encourage proper insertion of parts which move relative to one another. For example, a lower distal portion of each spacer 2170 and 2180 may be made relatively thinner, and an upper distal portion of each weight 2150 and 2160 may be made relatively thinner, in order to provide a more forgiving tolerance as the former are lowered into adjacent and alternating positions relative to the latter., 28590=This application is a continuation of U.S. patent application Ser. No. 09/796,220, filed on Feb. 28, 2001 (U.S. Pat. No. 6,733,424), which in turn is (1) a continuation-in-part of U.S. patent application Ser. No. 09/519,269, filed on Mar. 7, 2000 (U.S. Pat. No. 6,629,910), which in turn, is a continuation of U.S. patent application Ser. No. 08/939,845, filed on Sep. 29, 1997 (U.S. Pat. No. 6,033,350); and (2) a continuation-in-part of U.S. patent application Ser. No. 09/747,214, filed on Dec. 21, 2000 (U.S. Pat. No. 6,402,666), which in turn, discloses subject matter entitled to the earlier filing date of U.S. Provisional No. 60/171,813, filed on Dec. 21, 1999., 54774=A knob 1781 and a gear 1782 are mounted on the base member 1741 and rotate together about a common axis of rotation relative to the base member 1741. Diametrically opposed portions of the gear 1782 engage respective rods 1783 and 1784 which are movably mounted on the base member 1741 by means of respective supports 1723 and 1724. Gear teeth are provided on the rods 1783 and 1784 to engage the teeth on the gear 1782 in such a manner that rotation of the latter causes the former to move in opposite directions relative to the base member 1741. Gear teeth are disposed only on discrete portions of the rods 1783 and 1784 so as to limit travel of the rods 1783 and 1784 relative to the base member 1741. Another way to impose this sort of limitation is to secure stops to the rods 1783 and 1784. An indicator 1798 is provided on the base member 1741 to cooperate with indicia on the knob 1781 and/or the gear 1782 to indicate the orientation of both relative to the base member 1741., 73191=Each distal end of the rail 1860 has a protruding, rectangular tab 1864 that is sized and configured for insertion into a respective slot 1846 in a respective outer end plate 1840. Also, a separate circular hole 1866 extends into each end of the rail 1860 to receive a respective screw 1806. In this regard, each hole 1866 is arranged to align with a respective hole 1848 in a respective end plate 1840 when the associated tab 1864 is disposed inside the corresponding slot 1846. In other words, the rails 1860 are rigidly interconnected between the inner end plates 1830 and the outer end plates 1840, thereby defining opposite end weight housings, and each strut 1850 provides reinforcement for a respective weight housing., 53974=Holes 1703 and 1704 are formed through the base member 1741 (and through the weights 1642–1644) to accommodate respective guide rods 1613 and 1614. Another hole 1706 is formed through the base member 1741 (and through the weights 1642–1644) to accommodate a selector rod of the type known in the art and fastened to the top plate 1741. Transverse holes extend through the selector rod and align with transverse holes 1649 through the weights 1642–1644 to accommodate a selector pin. One end of a cable 1616 is connected to the selector rod by means of a catch 1602. An opposite end of the cable 1616 is connected to a force receiving member., 65710=On a preferred embodiment, the underlying weights 1642 are relatively heavy (e.g. thirty pounds each), and the opposite side weights 1751 or 1771 are relatively light (e.g. three pounds per pair). The provision of six thirty-pound weights beneath the top plate and nine three-pound weights, together with a thirty pound top plate, provides resistance to exercise which (i) ranges from thirty pounds to two hundred and thirty-seven pounds and (ii) is adjustable in balanced, three pound increments (or out of balance one and one-half pound increments, if opposite side weights are not engaged in pairs). In the event that a counterweight is provided to offset the weight of the top plate, the same weights would provide resistance to exercise ranging from zero pounds to two hundred and seven pounds., 83649=Members 2057 and 2059 are mounted to opposite sides of the plate 2054 to maintain proper spacing between the weights 2050, and also, to interconnect the weights 2050 in a manner which discourages relative movement in a direction parallel to the handle 2045 but does not interfere with upward movement of an inside weight relative to an adjacent outside weight. Each member 2057 projects away from the handle 2045 and provides a downwardly opening slot 2058. Each member 2059 projects toward the handle 2045 and provides a T-shaped rail sized and configured to slide into the slot 2058 on an adjacent weight. A similar member 2057 is also mounted on the outwardly facing side of each side member 2042 or 2043 to receive the T-shaped rail on the “inwardmost” weight., 103043=The foregoing embodiment 2300 may also be described in terms of an adjustable exercise weight system, comprising: a base which includes a handle and weight supports at opposite ends of the handle; weights sized and configured for engagement by the weight supports; and selector rods which are movable axially relative to the handle and into engagement with any of the weights at respective ends of the handle. The selector rods may be nested within sidewalls which form the weight supports and/or may be stored between the weights. In addition and/or the alternative, secondary weights may be provided for selection by alternative means and without interfering with operation of the selector rods. One such secondary system includes opposite side selector segments which are simultaneously movable into engagement with respective secondary weights and/or are radially offset relative to an intermediate segment interconnected therebetween., 59532=Those skilled in the art will recognize that the assembly 1750 holds the weights 1751 in place prior to selection; keeps the weights 1751 spaced apart to ensure proper selection; supports the weights 1751 during exercise motion; and returns the weights 1751 to their proper location at the conclusion of exercise motion. Additional advantages of this embodiment 1750 include the elimination of guides extending along the weights' path of travel, and the ability to use a relatively smaller diameter selector rod (in combination with the bar)., 80441=The base member 2041 includes a handle 2045 sized and configured for grasping and rigidly interconnected between opposite side members 2042 and 2043. The first selector rod 2020 has parallel prongs 2021 which are interconnected at one end by a generally U-shaped handle 2022 that extends perpendicularly away from the prongs 2021. Similarly, the second selector rod 2030 has parallel prongs 2031 which are interconnected at one end by a generally U-shaped handle 2032 that extends perpendicularly away from the prongs 2031. The prongs 2021 and 2031 are movably connected to the side members 2042 and 2043., 85720=Advantages of the embodiment 2000 include that the handle 2040 is relatively more accessible, and that relative few assembly steps are required to manufacture the dumbbell 2000. Given the relatively complicated configuration of the weights 2050 and 2060, it may be desirable to injection mold the exterior of the weights 2050 and 2060 and disposed a relatively heavier material in the interior thereof., 94488=Yet another design consideration is the configuration of the weights on any particular assembly. For example, those skilled in the art may recognize the desirability of making the an upper half or a lower half of the weights a different size, and/or locating the handle slightly off center relative to the weights, in order to compensate for the weight of the selector rods and/or the portions removed from the upper portions of the weights. Those skilled in the art will also recognize that these two eccentricities may be engineered to more or less balance each other. The spacers 2170 and 2180 are shown “offset” for purposes of illustration, recognizing that the weight of the spacers may render this “offset” insignificant in the embodiment shown.}",
    "textBeforeTable": "Patent Citations Those skilled in the art will also recognize that features of various methods and/or embodiments may be mixed and matched in numerous ways to arrive at still more variations of the present invention. Recognizing that those skilled in the art are likely to derive many additional embodiments and/or improvement from this disclosure, the scope of the present invention should be limited only to the extent of the following claims. The weights may be constrained to move through defined paths. Furthermore, additional weights may be disposed in a stack beneath the base member, and a selector rod may be inserted through the stacked weights. Moreover, the selector rod may be configured to rotate into engagement with a desired number of stacked weights. In this case, a rack of gear teeth may be provided on each of the first bar and the second bar; a gear may be rotatably mounted on the base member between the rack on the first bar and the rack on the second bar (to constrain the first bar and second bar to move in opposite directions); and the output shaft of a motor may be moved from a first position, engaging the gear, to a second position, engaging the selector rod. A handle may be provided on the base member, preferably disposed between the weights on the first side and the weights on the second side. A groove may be",
    "textAfterTable": "US6719674 * Jan 15, 2003 Apr 13, 2004 Mark A. Krull Adjustable weight exercise methods and apparatus US6733424 * Feb 28, 2001 May 11, 2004 Mark A. Krull Exercise resistance methods and apparatus US6746381 * Dec 21, 2000 Jun 8, 2004 Mark A. Krull Exercise weight selection methods and apparatus US6749547 * Feb 28, 2001 Jun 15, 2004 Mark A. Krull Weight selection methods and apparatus US6855097 * Apr 18, 2002 Feb 15, 2005 Mark A. Krull Adjustable mass exercise methods and apparatus US6896645 * May 9, 2002 May 24, 2005 Mark A. Krull Exercise resistance methods and apparatus US6899661 * Oct 7, 2003 May 31, 2005 Mark A. Krull Exercise resistance methods and apparatus US6902516 * Mar 7, 2003",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}