{
    "relation": [
        [
            "Leg",
            "Upwind",
            "Downwind",
            "Upwind",
            "Downwind",
            "Inward"
        ],
        [
            "Track",
            "105°",
            "300°",
            "110°",
            "280°",
            "220°"
        ],
        [
            "Alt (ft)",
            "1200",
            "900",
            "600",
            "400",
            "400"
        ],
        [
            "Start time (UTC)",
            "20:58:00",
            "21:12:44",
            "21:22:07",
            "21:28:53",
            "21:37:30"
        ],
        [
            "End time (UTC)",
            "21:05:09",
            "21:16:20",
            "21:25:15",
            "21:32:52",
            "21:38:55"
        ]
    ],
    "pageTitle": "20030904 I1 mission",
    "title": "",
    "url": "http://www.aoml.noaa.gov/hrd/Storm_pages/fabian2003/20030904I1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 292548025,
    "recordOffset": 292539823,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5019=After completion of the stepped descent sequence (2200 UTC), we resumed the figure four flight pattern. This pass through began on the NW side of Fabian, four GPS drops in the NW eyewall, circle in the eye as AVAPS prepared for more drops, and then fly outbound through the SE eyeall again dropping four dropsondes. There was again concentric eyewall pattern with double peaked flight level winds (110 kt each on NW side and 115 kt [inner]/105 kt [outer] on the SE side), while the SFMR had peak winds of about 80 kt in the outer eyewall and 90 kt on the inner eyewall. Throughout the flight, the surface RMW was just slightly inward of the flight level wind maximum. We returned to St.Croix at 9:00 PM AST., 2981=At this point (2045 UTC), we found a candidate region for the stepped descent in the NE side (front quadrant) of the hurricane. The stepped descent was done in coordination with 43 and included the following legs:, 1693=The plane left St.Croix at 1:00 PM AST (1700 UTC). We first conducted the box and circle calibration manuevers for the BAT probe (1740 to 1800 UTC). Right after that Jeff French announced that the BAT probe was having problems measuring winds. (It turned out later that Jeff was able to get considerable good data from the BAT probe.) At 1900 UTC, we attempted to find a place in the SW quadrant of Fabian to do the stepped descent, but decided to postpone this portion until later in the flight when a good rainfree region could be found. We proceeded with the coordinated figure four, going through the SW eyewall and launching our four sondes and two AXBTs, circling in the eye to allow AVAPS to prepare to launch another round of sondes, then proceeding through the NE eyewall and again launching our four sondes and two AXBTs. The radar depicted a concentric eyewall structure with two peaks in winds at flight level (80 kt outer/90 kt inner) and a single peak at the SFMR (80 kt) on the SW side. Peak flight level winds were about 130 kt on the NE side with a large area of at least 120 kt, though there was some problem with the SFMR on this side of the storm (interference with the AXBT signal?).}",
    "textBeforeTable": "Mission Summary 20030904I1 Aircraft 43RF CBLAST mission into Hurricane Fabian 2003",
    "textAfterTable": "Leg Track Alt (ft) Start time (UTC) End time (UTC) Upwind 105° 1200 20:58:00 21:05:09 Downwind 300° 900 21:12:44 21:16:20 Upwind 110° 600 21:22:07 21:25:15 Downwind 280° 400 21:28:53 21:32:52 Inward 220° 400 21:37:30 21:38:55 As can be seen from the stepped leg summary and the figure, it was difficult to fly for the requested 20 nmi legs over the same region. This was because of moving and developing rainbands in this portion of the storm. In general, the legs were done over surface winds around 35-45 kt, with a couple spots to 50 kt. A leg down to 200 feet was not possible nor were cross wind legs possible because of the limited clear area to work with in the hurricane. After completion of the stepped descent sequence (2200 UTC), we resumed the figure four flight pattern. This pass through began on the NW side of Fabian, four GPS drops in the NW eyewall, circle in the eye as AVAPS prepared for more drops, and then fly outbound through the SE eyeall again dropping four dropsondes. There was again concentric eyewall pattern with double peaked flight",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}