{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13"
        ],
        [
            "Nation",
            "Soviet Union",
            "Austria",
            "Finland",
            "Switzerland",
            "Sweden",
            "United States",
            "Norway",
            "Italy",
            "Germany",
            "Canada",
            "Japan",
            "Hungary",
            "Poland"
        ],
        [
            "Gold",
            "7 *",
            "4",
            "3",
            "3",
            "2",
            "2",
            "2",
            "1",
            "1",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Silver",
            "3",
            "3",
            "3",
            "2",
            "4",
            "3",
            "1",
            "2",
            "0",
            "1",
            "1",
            "0",
            "0"
        ],
        [
            "Bronze",
            "6",
            "4",
            "1",
            "1",
            "4",
            "2",
            "1",
            "0",
            "1",
            "2",
            "0",
            "1",
            "1"
        ],
        [
            "Total",
            "16",
            "11",
            "7",
            "6",
            "10",
            "7",
            "4",
            "3",
            "2",
            "3",
            "1",
            "1",
            "1"
        ]
    ],
    "pageTitle": "Cortina d'Ampezzo (Italy) 1956 Winter Olympics | 1956 Winter Olympics Medal Table",
    "title": "",
    "url": "http://www.mapsofworld.com/sports/olympics/history/cortina-d-ampezzo-italy-1956-winter-olympic-games.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00094-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 576314243,
    "recordOffset": 576298636,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2184=Venue: 1956 Winter Summer Games were held at Stadio Olympica in Cortina d'Ampezzo in Italy. Stadio Olympica is an indoor ice hockey arena . The arena with a capacity of 12,000 spectators was built in 1955 . All the skating events, ice hockey games and the opening and closing ceremonies of the 1956 Winter Summer Games were held in this arena., 2552=The Seventh Winter Olympics: The 1956 Winter Olympics were officially known as the VII Olympic Winter Games. The games were held in Cortina d'Ampezzo, a town and commune in Belluno province in Veneto in the Northern Italy. This city was chosen as the venue of the 1944 Winter Summer Games also which were cancelled due to World War II ., 863=A Brief Description of the Cortina d'Ampezzo Winter Summer Games, 1956: The Seventh Winter Summer Games were held from 26 th January to 5 th February in Cortina d'Ampezzo, in Italy . The games were officially opened by Giovanni Gronchi. The athletes uttered the Olympic oath led by Giuliana Chenal-Minuzzo. In the stadium the Olympic Flame was lit by Guido Caroli . USSR participated in this Winter Summer Games for the first time and they became the overall winners., 1809=Participants: 694 participants from 30 countries competed in the 1956 Winter Summer Games . The countries were Australia, Austria, Belgium, Bolivia, Bulgaria, Canada, Chile, Czechoslovakia, Finland, France, Great Britain, Greece, Hungary, Iceland, Italy, Iran, Japan, Korea, Lebanon, Liechtenstein, Netherlands, Norway, Poland, Romania, Spain, Sweden, Switzerland, Turkey, United Team of Germany, United States, USSR and Yugoslavia., 1345=Events: There were 24 events in 4 sports in the seventh Winter Summer Games in 1956. The sports were alpine skiing, bobsleigh, figure skating, ice hockey, Nordic skiing, cross-country skiing, Nordic combined, ski jumping and speed skating.}",
    "TableContextTimeStampAfterTable": "{10002=Contact - Kartik Suri (+91- 9910492371 IST)}",
    "textBeforeTable": "  1956 Winter Olympics Medal Table   A Brief Description of the Cortina d'Ampezzo Winter Summer Games, 1956: The Seventh Winter Summer Games were held from 26 th January to 5 th February in Cortina d'Ampezzo, in Italy . The games were officially opened by Giovanni Gronchi. The athletes uttered the Olympic oath led by Giuliana Chenal-Minuzzo. In the stadium the Olympic Flame was lit by Guido Caroli . USSR participated in this Winter Summer Games for the first time and they became the overall winners. Medal Count: USSR won the highest number of medals with 16 medals in total ( 7 gold, 3 silver, 6 bronze medals ). Italy, the host country won 3 medals (1gold and 2 silver medals). Events: There were 24 events in 4 sports in the seventh Winter Summer Games in 1956. The sports were alpine skiing, bobsleigh, figure skating, ice hockey, Nordic skiing, cross-country skiing, Nordic combined, ski jumping and speed skating. Participants: 694 participants from 30 countries competed in the 1956 Winter Summer Games . The countries were Australia, Austria, Belgium, Bolivia, Bulgaria, Canada, Chile, Czechoslovakia, Finland, France, Great Britain, Greece, Hungary, Iceland, Italy, Iran, Japan, Korea, Lebanon, Liechtenstein, Netherlands, Norway, Poland, Romania, Spain, Sweden, Switzerland, Turkey, United Team of Germany, United States, USSR and Yugoslavia. Venue: 1956 Winter Summer Games were held at Stadio Olympica in Cortina d'Ampezzo in Italy.",
    "textAfterTable": "  Winter Olympic Games Medal Table   2010 Winter Olympics Medal Table 1968 Winter Olympics Medal Table 2006 Winter Olympics Medal Table 1964 Winter Olympics Medal Table 2002 Winter Olympics Medal Table 1960 Winter Olympics Medal Table 1998 Winter Olympics Medal Table 1956 Winter Olympics Medal Table 1994 Winter Olympics Medal Table 1952 Winter Olympics Medal Table 1992 Winter Olympics Medal Table 1948 Winter Olympics Medal Table 1988 Winter Olympics Medal Table 1936 Winter Olympics Medal Table 1984 Winter Olympics Medal Table 1932 Winter Olympics Medal Table 1980 Winter Olympics Medal Table 1928 Winter Olympics Medal Table 1976 Winter Olympics Medal Table 1924 Winter Olympics Medal Table 1972 Winter Olympics Medal Table",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}