{
    "relation": [
        [
            "Candidate",
            "Desmond",
            "Freeman",
            "Gonzalez",
            "Pence",
            "Puig"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "AVG",
            ".280",
            ".307",
            ".300",
            ".264",
            ".394"
        ],
        [
            "HR",
            "15",
            "9",
            "14",
            "13",
            "8"
        ],
        [
            "RBI",
            "49",
            "56",
            "58",
            "43",
            "19"
        ],
        [
            "SB",
            "10",
            "0",
            "0",
            "13",
            "5"
        ],
        [
            "OPS",
            ".822",
            ".858",
            ".842",
            ".759",
            "1.061"
        ]
    ],
    "pageTitle": "Nationals teammates sing Final Vote candidate Ian Desmond's praises | nationals.com",
    "title": "",
    "url": "http://m.nationals.mlb.com/news/article/53354130",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00001-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 150906847,
    "recordOffset": 150878225,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1081=WASHINGTON -- Nationals right-hander Jordan Zimmermann, a member of the 2013 National League All-Star team, was surprised to learn that teammate Ian Desmond ranked fourth in the 2013 All-Star Game Final Vote sponsored by freecreditscore.com. Desmond trails Braves first baseman Freddie Freeman, Dodgers outfielder Yasiel Puig and Giants outfielder Hunter Pence. Dodgers first baseman Adrian Gonzalez sits in fifth place., 536=Desmond, 27, is clearly the best player on the Nationals this year. Besides playing outstanding defense, he leads Washington in home runs and RBIs. It helped that he had a hot month of June during which he drove in 28 runs.}",
    "TableContextTimeStampAfterTable": "{5453=Mobile voting in the U.S. and Canada is open to everyone. In the U.S., to receive the Final Vote mobile ballot, text the word \"VOTE\" to 89269. To vote for Desmond, simply text message N1 to 89269. In Canada, fans should text N1 to 101010. Standard message and data rates may apply., 2935=\"He shows up to the field ready to play. One of the funny things I've seen this year is, we have a 1 o'clock day game. I get there at 8:30 and he is already in full uniform,\" Strasburg said. \"It's refreshing to see. This is a job to everybody, and he treats it like it is a game, but something that he really loves. He lives and breathes baseball. You can see it with his play out there.\", 4959=There will be an extra treat for fans who participate in the Final Vote online. If you are not a current MLB.TV subscriber (MLB.TV or MLB.TV Premium), you are eligible to receive a 14-day free trial of MLB.TV from July 12-26. If you are a current MLB.TV subscriber (MLB.TV or MLB.TV Premium), you will receive a 15-percent discount to the MLB.com Shop. MLB.com will send an email on Friday to all Final Vote voters with instructions on how to redeem the applicable offer.}",
    "textBeforeTable": "NL Candidates BY THE NUMBERS Desmond, 27, is clearly the best player on the Nationals this year. Besides playing outstanding defense, he leads Washington in home runs and RBIs. It helped that he had a hot month of June during which he drove in 28 runs. WASHINGTON -- Nationals right-hander Jordan Zimmermann, a member of the 2013 National League All-Star team, was surprised to learn that teammate Ian Desmond ranked fourth in the 2013 All-Star Game Final Vote sponsored by freecreditscore.com. Desmond trails Braves first baseman Freddie Freeman, Dodgers outfielder Yasiel Puig and Giants outfielder Hunter Pence. Dodgers first baseman Adrian Gonzalez sits in fifth place. 0 COMMENTS + | MLB.com By Bill Ladson / Print Email Nats sing All-Star hopeful Desmond's praises Nats sing All-Star hopeful Desmond's praises Full Game Coverage",
    "textAfterTable": "* Stats entering July 11 \"Ian has unbelievable numbers, and he has been playing great lately,\" Zimmermann said. \"Hopefully he can pick up some ground and we can get him in there.\" The numbers don't tell the whole story about Desmond. Teammate Stephen Strasburg is amazed by Desmond's work ethic. Desmond is often one of the first players at the ballpark. \"He shows up to the field ready to play. One of the funny things I've seen this year is, we have a 1 o'clock day game. I get there at 8:30 and he is already in full uniform,\" Strasburg said. \"It's refreshing to see. This is a job to everybody, and he treats it like it is a game, but something that he really loves. He lives and breathes baseball. You can see it with his play out there.\" Strasburg is also impressed by Desmond's knowledge of the game of baseball. \"His baseball IQ is definitely through the roof,\" Strasburg said. \"He likes to lead by example, just like Zim [Ryan Zimmerman]. There isn't too much talk -- no showmanship. He just goes out there and gets the job done. You have to respect that.\" Rookie Anthony Rendon considers Desmond a mentor. A third baseman by trade, Rendon credits Desmond for helping him make the adjustments at second base. \"He is a tremendous leader. It's always good when you have teammates that can help you out and throws",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}