{
    "relation": [
        [
            "1 cm 0.4 inches",
            "30.9",
            "27.9",
            "22.5",
            "4.1",
            "0.4",
            "0.1",
            "3.6",
            "18.0",
            "25.3",
            "132.7"
        ],
        [
            "5 cm 2.0 inches",
            "26.2",
            "24.3",
            "16.9",
            "2.1",
            "0.2",
            "0.0",
            "2.1",
            "11.3",
            "19.9",
            "102.9"
        ],
        [
            "",
            "January",
            "February",
            "March",
            "April",
            "May",
            "September",
            "October",
            "November",
            "December",
            "Year"
        ],
        [
            "10 cm 3.9 inches",
            "18.8",
            "16.8",
            "12.6",
            "1.0",
            "0.1",
            "0.0",
            "1.5",
            "5.7",
            "12.8",
            "69.2"
        ],
        [
            "20 cm 7.9 inches",
            "9.9",
            "9.7",
            "7.1",
            "0.5",
            "0.0",
            "0.0",
            "0.0",
            "1.5",
            "5.2",
            "33.9"
        ]
    ],
    "pageTitle": "Edmonton AB Snowfall Totals & Snow Accumulation Averages - Current Results",
    "title": "Average total days per month and year in Edmonton with snow depth of at least 1, 5, 10 or 20 cm on the ground",
    "url": "http://www.currentresults.com/Weather/Canada/Alberta/Places/edmonton-snowfall-totals-snow-accumulation-averages.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990217.27/warc/CC-MAIN-20150728002310-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 401218551,
    "recordOffset": 401210349,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{394=All the numbers are long-term historical averages based on weather data gathered from 1981 to 2010 at the Edmonton City Centre Airport.}",
    "TableContextTimeStampAfterTable": "{7224=Environment Canada. Meteorological Service of Canada. Canadian Climate Normals. 1981-2010 Climate Normals & Averages., 2663=Big snowstorms of over ten cm a day normally occur once or twice a year. But major blizzards that dump 25 cm or more in one day are rare events that don't happen every year. Storms this severe are most likely to appear in April., 16808=Copyright © 2015 Current Results Nexus, 2054=The first snowfall of winter for Edmonton usually arrives in October, but can show up as early as September or even August., 2191=The season's last snowfall typically happens in April or May although in some years a late snow lands in June., 2315=Only in July is Edmonton is normally free of snow every year., 7446=Environment Canada. National Climate Data and Information Archive. Canadian Climate Normals or Averages 1971-2000.}",
    "textBeforeTable": "For about 133 days, or one-third of the year, Edmonton has at least a centimetre of snow on the ground. In mid-winter the snowpack averages 18 cm deep. How Much Snow Normally Accumulates in Edmonton (adsbygoogle = window.adsbygoogle || []).push({}); 0.2 1.7 7.0 Year 0.0 0.0 0.7 December 0.0 0.3 1.1 November 0.0 0.3 0.8 October 0.0 0.0 0.1 September 0.0 0.2 0.3 May 0.1 0.4 1.0 April 0.0 0.2 1.1 March 0.0 0.1 0.5 February 0.0 0.3 1.5 January 25 cm 9.8 inches 10 cm 3.9 inches 5 cm 2.0 inches   Number of days per month and year on average in Edmonton with a total snowfall of at least 5, 10 or 20 centimetres Big snowstorms of over ten cm a day normally occur once or twice a year. But major blizzards that dump 25 cm or more in one day are rare events that don't happen every year. Storms this severe are most likely to appear in April. Most days of snowfall in Edmonton leave less than five centimetres (2 inches) of fresh snow on the ground. For seven days a year on average, the amount of new snow totals at least five cm. How Many",
    "textAfterTable": "Reference Environment Canada. Meteorological Service of Canada. Canadian Climate Normals. 1981-2010 Climate Normals & Averages. Environment Canada. National Climate Data and Information Archive. Canadian Climate Normals or Averages 1971-2000.  Share More on Weather in Alberta Edmonton Temperatures: Averages by Month Alberta Snowfall Averages Average Temperatures Throughout Alberta Precipitation Averages for Places in Alberta Days of Sunshine a Year in Alberta Weather Averages Canada > Alberta > Alberta Snowfall Banff Calgary Edmonton Jasper More Places Canadian Cities Temperature Sun Precipitation Snow Wind Humidity Provinces Alberta British Columbia Nova Scotia Ontario Quebec MORE > Canadian Extremes Coldest",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}