{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,099 topics 2,124,082 replies",
            "85,553 topics 1,153,665 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,539 topics 466,165 replies",
            "22,766 topics 196,288 replies",
            "4,270 topics 60,440 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,217 replies"
        ],
        [
            "Last Post Info",
            "Duke o Death Being For peop... By Cyper A minute ago",
            "Reasons why GTA IV is bette... By Mr. Fahrenheit A minute ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 23 hours ago",
            "Whats your favorite/hated r... By Kristian. 18 hours ago",
            "[SNP] farewell my love [And... By chomi30 50 minutes ago",
            "Which Vehicle Do You Prefer? By PhillBellic An hour ago",
            "Which Vehicle Do You Prefer? By PhillBellic An hour ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "GTA: RPG By RedDagger 7 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=120&t=344821&p=1058062976",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103609191,
    "recordOffset": 103587817,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19029=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 108370=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14488=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16797=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47375=Bing, Google, K20, SARDYNA108, Google Mobile, Paul_silvana10910, The_Riddler, Yahoo, hotline.n.w.refn, AaronMcG95, Fachuro, Russell_Brand, PhillBellic, mcfarplays, Halal Cyborg, FRArom, IIOctaneII, C64fanatic, 7 day survivor, allgaguzzi, GourangaMaster, Obey-n-Survive, Ondr4H, RedDagger, MGgames100, ashbashbluesfan, Mastah, Phyxsius-, Jinx., kuusko, Gonad McDangle, Jon3s, lunchxbles, aka_senior_84, Ivan1997GTA, lebongjames187, Cyper, PANiC ATTACK3R, the_wabz, machine4578, gta4_player, rjmthe2nd, Mr. Fahrenheit, Bone34, Dellers, Lewis Jephson, Receptor, Oldsmobile_85, m3tal z_DKI, shmok2, Lay, mirthless, Mister Pink, Lester-The-Molester, Officer620, mrtommygunwhite, Pavle, xGeoThumbs, Irisframe, KonfliQ, incognito32, Jeansowaty, iNero, Cognoscenti, Kampret, Kanue, Zondar, frodzet, iProGam3r, sheepy111, Issik, SmilingjacK420, Fuzzknuckles, BeckermannDewitt, dueldeluxe, toxluv, kirg1234, Days Are Gone, raggazam, NightSpectre, Nerfgoth, Killeurdu08, dxivilea, Dns2K, dkluin, Owl Man, yello cactus, Josivers, SantanaA26_, Superfrogger, Tilley, dragoon371, alex8b, SKARFACE, MrManquet, Claude Liberty, Prywatne, GeneralSteve93, PierreHo, slipstream87, svanderman, Mista_J42c, Fenton, size_m, Cameron Star, Rico UK, stroup, Scuba 21, whywontyoulisten, AgentExeider, Shadowfennekin, knightsgarage, RiseAgainBH, ZombieRambo, jerryinohio78, quadro09, richard42, v1p3r_eddy, circum, TheUnholy, SaL_Leone, Stephan90, funmw2, bobinrg, arewenotmen, JuZ 75, CMGreger, Gummy , Katabasis, TheSteppinRazor, N050, Svip, Real Blood 1, Rented, Vicer Exciser, SpooferJahk, asilcenk, DOCTOR USS875, Brutal Trout, Nuggets, Street Mix, Sneakerhead., Havok-303, JimmyFantastic, bmw740i, BlackMilk, gizmonomono, iddqdvie, Officer Garza, The Hero, King Rossey, Jay, CrysisAverted, Bombshock, blusunone, Fonshway, hamxod, Im Ricky I Win, NBAKingzFan10, DJS, Fattypack, bigjpc777, TheIceWarrior, TJGM, Colbydogs, PentagonSteeringWheel, ashank975, RaptorDaptor, TheMcSame, jaykillcee, Terroryaki, missanthropy, MrForz, WestsideOutlaw187, BoeserBengel83, Phoenix_Poop, RStarFan, Retired Mafia, Zonnex, Valtiel150, Corndog93, Vadim M., JoeFury1997, khalilx45, Mika_0013, Alvarez, JackhammahNZ, Dondara, Officer Cop, (OO)SKYLINE(OO), //XP//, Dante9231, Th3MaN1, Pawelo, coorslightzombie, XTREME0235, Mr Walker, Furious_Wave, Ezza., PSNSammy1, UnbrokenChainz, Ryan_Codebreaker, Tylomon, Hunter241, Eqaulo, FacingGaming, Rendy Specter(Riandy), Marticus, eimaj1779, kzstone, Rucke, Failure, gfen, Apex., boppa_, Pyro_Indigo, Bane X01, Grampa' Soldier, Willplanb_, REXX93, RJSanModder, RWWPL, 9478=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 21143=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12769=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 47 minutes ago By longhurstgb The Paleto Bay Mayors Offic... 613,646 replies 15,196 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Owl Man Rate the car above you thread 2,280,765 replies 113,300 topics This is a general discussion forum for Grand Theft",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,454 topics 416,592 replies Car sound problem By Jeansowaty 23 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}