{
    "relation": [
        [
            "Date",
            "Mar 6, 2000",
            "Dec 18, 2006",
            "Jan 4, 2011",
            "Mar 7, 2013",
            "Oct 9, 2014",
            "Dec 31, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: CREDIT SUISSE AG, NEW YORK Free format text: SECURITY INTEREST;ASSIGNOR:ALCATEL-LUCENT USA INC.;REEL/FRAME:030510/0627 Effective date: 20130130",
            "Owner name: ALCATEL-LUCENT USA INC., NEW JERSEY Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CREDIT SUISSE AG;REEL/FRAME:033949/0531 Effective date: 20140819",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6591373 - Uniform configuration controller for replicated component systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6591373?dq=patent:4807115",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438044271733.81/warc/CC-MAIN-20150728004431-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471013343,
    "recordOffset": 470959064,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{358332=The logical unit group (LUG) relationship is created between component instances through a dialog window shown in FIG. 10. The administrator names the particular LUG in fill-in window 1001(e.g., Bgroup) and then specifies in the Minimum Availability window 1002 the minimum number of such components that need to be active (e.g., 1), and in the Maximum Availability window 1003, the maximum number of components that are to be active (e.g.,. 3) in any configuration. Each configuration can have plurality of LUGs. Each LUG, when established through the dialog window of FIG. 10 creates a LUG button in a palette (not shown) on the canvas window screen, similar to the buttons 802. Once a LUG button is created, that particular LUG relationship is established in the canvas window by clicking the mouse on that LUG button, and then clicking on a first component and dragging the mouse to a second component in that LUG relationship. All the components with that same LUG relationship are similarly defined}",
    "textBeforeTable": "Patent Citations In the claims hereof any element expressed as a means for performing a specified function is intended to encompass any way of performing that function including, for example, a) a combination of circuit elements which performs that function or b) software in any form, including, therefore, firmware, microcode or the like, combined with appropriate circuitry for executing that software to perform the function. The invention as defined by such claims resides in the fact that the functionalities provided by the various recited means are combined and brought together in the manner which the claims call for. Applicants thus regards any means which can provide those functionalities as equivalent to those shown herein. The functions of the various elements shown in the FIGS., including functional blocks labeled as “processors” may be provided through the use of dedicated hardware as well as hardware capable of executing software in association with appropriate software. When provided by a processor, the functions may be provided by a single dedicated processor, by a single shared processor, or by a plurality of individual processors, some of which may be shared. Moreover, explicit use of the term “processor” or “controller” should not be construed to refer exclusively to hardware capable of executing software, and may implicitly include, without limitation, digital signal processor (DSP) hardware, read-only memory (ROM) for storing software, random access memory (RAM), and non-volatile storage. Other hardware, conventional and/or custom, may also",
    "textAfterTable": "US6859889 * Feb 27, 2001 Feb 22, 2005 Mitsubishi Denki Kabushiki Kaisha Backup system and method for distributed systems US6931546 * Aug 30, 2000 Aug 16, 2005 Network Associates, Inc. System and method for providing application services with controlled access into privileged processes US7024548 * Mar 10, 2003 Apr 4, 2006 Cisco Technology, Inc. Methods and apparatus for auditing and tracking changes to an existing configuration of a computerized device US7716719 Apr 21, 2005 May 11, 2010 Mcafee, Inc. System and method for providing application services with controlled access into privileged processes US7797679 * Aug 31, 2006 Sep 14, 2010 Research In Motion Limited System and method for providing a parameter for an application operating on an electronic device US7856572 * Nov 16, 2005 Dec 21, 2010 Nec Corporation Information processing device, program thereof, modular type system operation management system, and component selection method US8365146 Jul 23,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}