{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Down town Greensburg!",
            "Cove is awesome!",
            "Even though there is no air-conditioning in some of the dorms, the dorms are nice with nice roommates.",
            "The teachers do care about your education, and they will always take care of you.",
            "Apply ahead of time. Go on a tour. Love it.",
            "It is an AMAZING college. The teachers are kind, helpful, and know their students by name. Parking is not the best, but the beauty of the school makes up for it."
        ]
    ],
    "pageTitle": "Seton Hill University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Seton-Hill-University/reviews?_escaped_fragment_=/show/66861",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043058631.99/warc/CC-MAIN-20150728002418-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908966523,
    "recordOffset": 908927485,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{144182=© 2015, Cappex.com, LLC, 1611=The student to teacher ratio is about 16:1. You will have more of an opportunity to have one on one learning experience. Also there are no teaching assistants or student teachers, they are all professionals., 53525=Seton Hill University, founded by the Sisters of Charity in 1885, is a coeducational Catholic liberal arts university in Greensburg, Pennsylvania. Consider in the top 15 schools in the North.}",
    "textBeforeTable": "11/29/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 9 out of 9 people found this review useful. 1 of 33 Madeline from Hudson, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "Great for these types of students Music, art, theatre, psychology, English Tips for prospective students Talk to people when and if you come visit. Take a tour of the buildings and performing and visual arts centers, both inside and out. Look to see if the school will fit your major well and if you feel that you will get a good, hands on education here. You'll know if the school is right for you once you've seen it. Bang for the buck Seton Hill isn't exactly cheap, but the students here are given many opportunities to further their education using the best resources around like computer labs, some of which are open 24/7, projectors in every classroom, and more. It is an older school, so the buildings and dorms here are old, but I think that the older buildings give the school a much more cozy feel. My one friend lives in a dorm with hardwood floors, and it feels a lot like a home. Am enjoying being here Seton Hill has hit me as a friendly school from the start. Everyone here is so nice and it's really easy to make friends! The faculty is great; they try to get to know you as a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}