{
    "relation": [
        [
            "Citing Patent",
            "US6385864 *",
            "US6510624 *",
            "US6671979",
            "US6694648",
            "US6976321",
            "US7206718",
            "US7451555",
            "US7461470",
            "US7681333",
            "US7762008",
            "US7917981",
            "US8490297",
            "US20140020264 *"
        ],
        [
            "Filing date",
            "Mar 16, 2000",
            "Sep 8, 2000",
            "Feb 1, 2002",
            "Jul 19, 2002",
            "Nov 7, 2003",
            "Sep 21, 2005",
            "Nov 30, 2005",
            "Oct 26, 2005",
            "Oct 26, 2005",
            "Sep 7, 2006",
            "Nov 4, 2008",
            "Oct 10, 2008",
            "Jul 17, 2012"
        ],
        [
            "Publication date",
            "May 14, 2002",
            "Jan 28, 2003",
            "Jan 6, 2004",
            "Feb 24, 2004",
            "Dec 20, 2005",
            "Apr 17, 2007",
            "Nov 18, 2008",
            "Dec 9, 2008",
            "Mar 23, 2010",
            "Jul 27, 2010",
            "Apr 5, 2011",
            "Jul 23, 2013",
            "Jan 23, 2014"
        ],
        [
            "Applicant",
            "Nike, Inc.",
            "Nikola Lakic",
            "Venanzio Cardarelli",
            "Julie Eriksen",
            "Nikola Lakic",
            "Diapedic, L.L.C.",
            "Nikola Lakic",
            "The Timberland Company",
            "The Timberland Company",
            "The Timberland Company",
            "Nikola Lakic",
            "Ginger Guerra",
            "Nike, Inc."
        ],
        [
            "Title",
            "Footwear bladder with controlled flex tensile member",
            "Inflatable lining for footwear with protective and comfortable coatings or surrounds",
            "Air flow shoe system",
            "Metatarsal arch support",
            "Adjustable air cushion insole with additional upper chamber",
            "Method for design and manufacture of insoles",
            "Methods of making adjustable air cushion insoles and resulting products",
            "Shoe footbed system and method with interchangeable cartridges",
            "Shoe footbed system with interchangeable cartridges",
            "Extreme service footwear",
            "Methods of making adjustable air cushion insoles and resulting products",
            "Integrated, cumulative-force-mitigating apparatus, system, and method for substantially-inclined shoes",
            "Article Of Footwear Having A Flexible Fluid-Filled Chamber"
        ]
    ],
    "pageTitle": "Patent US6092310 - Fluid filled insole - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6092310?dq=6,108,703",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480746915,
    "recordOffset": 480716973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18726=This application is a continuation-in-part of application Ser. No. 08/687,787 filed Jul. 19, 1996, now U.S. Pat. No. 5,878,510 which is a continuation-in-part of application Ser. No. 08/047,685 filed on Apr. 15, 1993, now abandoned.}",
    "textBeforeTable": "Patent Citations While the preferred embodiment of the present invention has been shown and described, it is to be understood that various modifications and changes could be made thereto without departing from the scope of the appended claims. The features that distinguish the current invention from the prior art is further the specific location of the flow deflectors and restrictors in the forefoot, midfoot and hindfoot regions, enabling a flow of fluid matched to the anatomical structure of the feet. The flow deflectors and restrictors and their following flow passages ensure directional stability during locomotion by enabling a controlled circulation of liquid that is matched to the anatomical structure of the normal foot. This is important since uncontrolled liquid circulation would result in unstable walking, unstable weight distribution, discomfort, and potentially the development of foot abnormalities. Directional stability, as achieved by the designed liquid circulation of the invention and as distinguishable over the prior art, ensures an anatomical locomotion pattern for the wearer, because the weight is anatomically distributed on the foot. The insole can alleviate the problems involved in over-supination and over-pronation, i.e., where the user's feet are turning abnormally either to the medial, inner side or the lateral, outer side of the foot (\"asymmetric feet\"). The combination of distribution of weight pressure and directionally stabilizing fluid circulation also supports a functionally correct take-off; a factor crucial for walking or running in a physiologically correct manner. The",
    "textAfterTable": "US3871117 * Apr 17, 1973 Mar 18, 1975 Richmond Rex E Fluid filled insoles US3892077 * Apr 19, 1974 Jul 1, 1975 Hunter Philip Robert Insole US3922801 * Jul 16, 1973 Dec 2, 1975 Zente Patrick Thomas Liquid filled orthopedic apparatus US3990457 * Aug 14, 1975 Nov 9, 1976 Curiel Products Corporation Podiatric insole US4100686 * Sep 6, 1977 Jul 18, 1978 Sgarlato Thomas E Shoe sole construction US4115934 * Feb 11, 1977 Sep 26, 1978 Hall John M Liquid shoe innersole US4123855 * Aug 10, 1977 Nov 7, 1978 Thedford Shirley C Fluid filled insole US4183156 * Sep 6, 1977 Jan 15, 1980 Robert C. Bogert Insole construction for articles of footwear",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}