{
    "relation": [
        [
            "Citing Patent",
            "US7870386",
            "US7917771 *",
            "US8140857",
            "US8272064 *",
            "US8364980",
            "US8615661 *",
            "US8683223",
            "US8832445 *",
            "US20050114671 *",
            "US20070113292 *"
        ],
        [
            "Filing date",
            "Apr 29, 2004",
            "Jun 9, 2008",
            "Dec 11, 2007",
            "Nov 16, 2005",
            "Jan 13, 2012",
            "Mar 20, 2003",
            "Nov 15, 2012",
            "Feb 25, 2005",
            "Mar 20, 2003",
            "Nov 16, 2005"
        ],
        [
            "Publication date",
            "Jan 11, 2011",
            "Mar 29, 2011",
            "Mar 20, 2012",
            "Sep 18, 2012",
            "Jan 29, 2013",
            "Dec 24, 2013",
            "Mar 25, 2014",
            "Sep 9, 2014",
            "May 26, 2005",
            "May 17, 2007"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "The Boeing Company",
            "International Business Machines Corporation",
            "Blackberry Limited",
            "International Business Machines Corporation",
            "Blackberry Limited",
            "Research In Motion Ltd.",
            "The Boeing Company"
        ],
        [
            "Title",
            "Method for permanent decryption of selected sections of an encrypted document",
            "Method for selective encryption within documents",
            "Method for selective encryption within documents",
            "Automated rule generation for a secure downgrader",
            "System for selective encryption within documents",
            "System and method for transmitting and utilizing attachments",
            "Selective encryption within documents",
            "System and method for handling secure messages",
            "System and method for transmitting and utilizing attachments",
            "Automated rule generation for a secure downgrader"
        ]
    ],
    "pageTitle": "Patent US7484107 - Method for selective encryption within documents - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7484107?dq=7565338",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475207703,
    "recordOffset": 475184111,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is important to note that while the present invention has been described in the context of a fully functioning data processing system, those skilled in the art will appreciate that the processes of the present invention are capable of being distributed in the form of instructions in a computer readable medium and a variety of other forms, regardless of the particular type of medium used to carry out the distribution. Examples of computer readable media include media such as EPROM, ROM, tape, paper, floppy disc, hard disk drive, RAM, and CD-ROMs and transmission-type of media, such as digital and analog communications links. Furthermore, if a section of the document is supposed to be decryptable with more than one key, then multiple copies of that section would be included in the document file, each copy encrypted with a different key. There would of course be some tag information that indicated that the particular section is duplicated and encrypted with different keys. This would be used to have some parts of the document encrypted for department A viewing, for example, and other non-disjoint parts for viewing by department B. Additionally, tag information may have been added to indicate the text space consumed by the decrypted plain text. This would have been used to more properly format an unencrypted portion so that surrounding information is not displaced from its original page or position in the document.",
    "textAfterTable": "US7003664 * Mar 12, 2002 Feb 21, 2006 Sony Corporation Signal recording medium, content signal generation apparatus, content signal reproduction method, and content signal reproduction apparatus US7103915 * Jul 27, 2001 Sep 5, 2006 Digital Doors, Inc. Data security system and method US7178033 * May 31, 2002 Feb 13, 2007 Pss Systems, Inc. Method and apparatus for securing digital assets US7322047 * Dec 31, 2002 Jan 22, 2008 Digital Doors, Inc. Data security system and method associated with data mining US20020051545 * Jul 19, 2001 May 2, 2002 Ogilvie John W.L. Encryption multiplexing US20020159594 * Mar 12, 2002 Oct 31, 2002 Teruhiko Kori Signal recording medium, content signal generation apparatus, content signal reproduction method, and content signal reproduction apparatus US20030110131 * Feb 12, 2002 Jun 12, 2003 Secretseal Inc. Method and architecture for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}