{
    "relation": [
        [
            "Date",
            "Mar 12, 2008",
            "Mar 3, 2010",
            "Nov 29, 2013",
            "Apr 20, 2014",
            "Jun 10, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: SCAN COIN INDUSTRIES AB,SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:AAS, PER CHRISTIAN;LIPPERT, JOHN- HAAKON;REEL/FRAME:020636/0012 Effective date: 20080312",
            "Owner name: SCAN COIN AB,SWEDEN Free format text: CHANGE OF NAME;ASSIGNOR:SCAN COIN INDUSTRIES AB;REEL/FRAME:024017/0895 Effective date: 20090421",
            "",
            "",
            "Effective date: 20140420"
        ]
    ],
    "pageTitle": "Patent US7699155 - Apparatus for receiving and distributing cash - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7699155?dq=PCT/US01/05609",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472716851,
    "recordOffset": 472682807,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30312=This application is a divisional of U.S. patent application Ser. No. 10/025,336 filed Dec. 19, 2001, now U.S. Pat. No. 7,066,335, and is a continuation of U.S. patent application Ser. No. 11/111,588, filed Apr. 21, 2005 now abandoned, which application is a continuation of U.S. patent application Ser. No. 10/025,336. The entire disclosure of U.S. patent application Ser. No. 10/025,336 and the entire disclosure of U.S. patent application Ser. No. 11/111,588 are incorporated herein in their entirety by this reference.}",
    "textBeforeTable": "Patent Citations All publications and patents mentioned in the above specification are herein incorporated by reference. Various modifications and variations of the described compositions and methods of the invention will be apparent to those skilled in the art without departing from the scope and spirit of the invention. Although the invention has been described in connection with specific preferred embodiments, it should be understood that the invention should not be unduly limited to such specific embodiments. Indeed, various modifications of the described modes for carrying out the invention which are obvious to those skilled in mechanics, engineering, electronics or related fields are intended to be within the scope of the following claims. In additional embodiments, the cash handling system of the present invention finds use in an international airport in cash exchange applications. Travelers arriving from another country enter cash (e.g., from their home country or Euros in an EU country or a combination) and receive cash of the destination country or Euros in an EU country, or a combination. The automated nature of the apparatus of the present invention, as well as its capability to input and output multiple currencies, make it particularly suited for such an application. The apparatus of the present invention additionally finds use in bank settings (e.g., as an ATM or operated by a bank teller). In particular, the apparatus finds utility in banks in EU countries. Customers in such",
    "textAfterTable": "Jun 25, 1974 Jul 20, 1976 Ibm Corporation Transaction terminal with unlimited range of functions US3998237 Apr 25, 1975 Dec 21, 1976 Brandt, Inc. Coin sorter US4010766 Dec 8, 1975 Mar 8, 1977 Ncr Corporation Change dispensing apparatus US4108518 Mar 31, 1977 Aug 22, 1978 Angst Edy P Banquet food serving apparatus US4150740 Oct 11, 1977 Apr 24, 1979 Glory Kogyo Kabushiki Kaisha Money exchanging system US4304247 Mar 12, 1980 Dec 8, 1981 Billcon Corporation Of America Differential speed coin sorter US4337864 Feb 22, 1980 Jul 6, 1982 Docutel Corporation Currency note dispensing system US4403900 Jan 16, 1981 Sep 13, 1983 Builders Equipment Company Pallet storing and distributing apparatus US4412550 May 7, 1981 Nov 1, 1983 Laurel Bank Machine Co., Ltd. Coin accumulator assembly US4479049 Jan 5, 1982 Oct",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}