{
    "relation": [
        [
            "Citing Patent",
            "US5543334 *",
            "US5693540 *",
            "US5837557 *",
            "US5889679 *",
            "US6054334 *",
            "US6068892 *",
            "US6194235 *",
            "US6289291 *",
            "EP1184901A1 *",
            "WO2003041157A2 *"
        ],
        [
            "Filing date",
            "Dec 15, 1994",
            "May 31, 1996",
            "Mar 14, 1997",
            "Jul 15, 1997",
            "Sep 12, 1997",
            "May 13, 1999",
            "Jan 12, 2000",
            "Dec 17, 1998",
            "Feb 22, 2001",
            "Sep 19, 2002"
        ],
        [
            "Publication date",
            "Aug 6, 1996",
            "Dec 2, 1997",
            "Nov 17, 1998",
            "Mar 30, 1999",
            "Apr 25, 2000",
            "May 30, 2000",
            "Feb 27, 2001",
            "Sep 11, 2001",
            "Mar 6, 2002",
            "May 15, 2003"
        ],
        [
            "Applicant",
            "Kabushiki Kaisha Toshiba",
            "Altera Corporation",
            "Advanced Micro Devices, Inc.",
            "Integrated Device Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "Micron Technology, Inc.",
            "United Microelectronics Corp.",
            "Advantest Corporation",
            "Cree Inc"
        ],
        [
            "Title",
            "Method of screening semiconductor device",
            "Method of fabricating integrated circuits",
            "Semiconductor fabrication method of forming a master layer to combine individually printed blocks of a circuit pattern",
            "Fuse array control for smart function enable",
            "Methods and structures for pad reconfiguration to allow intermediate testing during manufacture of an integrated circuit",
            "Methods and structures for pad reconfiguration to allow intermediate testing during manufacture of an integrated circuit",
            "Method of fabricating and testing an embedded semiconductor device",
            "Statistical method of monitoring gate oxide layer yield",
            "Method of manufacturing semiconductor integrated circuit having multilayer wiring structure",
            "Large area silicon carbide devices and manufacturing methods therefor"
        ]
    ],
    "pageTitle": "Patent US5444000 - Method of fabricating integrated circuit with improved yield rate - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5444000?dq=6,406,777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 464326895,
    "recordOffset": 464303997,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56082=FIG. 11 shows the stage for conducting the operation test on a gate array with temporary wires. In FIG. 11, character A designates a block having one or a plurality of gates, numeral 1101 a gate array having one or a plurality of blocks A, and numerals 111, 112 externally-connected removable temporary wires making up conductor wires which have different layers. Defective gates are identified by switching the signals of the conductor wires 111, 112 and conducting the operation test while scanning the gate array., 58790=FIGS. 16A to 16C show block diagrams showing a method of fabricating integrated circuits in which blocks are connected in accordance with the customer specification. In FIGS. 16A to 16C, numerals 1601, 1602, 1603, 1604, 1605 designate blocks having certain functions which may or may not be different from each other. Numeral 1606 designates a test circuit for testing each block. Numeral 161 designates temporary wires for testing the blocks, and numeral 162 main wires. After acceptance of the customer specification, the intended integrated circuits can be fabricated simply by wiring the blocks that have been subjected to the block test from the state described in FIG. 16B, and therefore the lead time before successful development can be reduced considerably., 57056=FIG. 13 shows the stage for conducting a gate array test with temporary wires according to another embodiment. In FIG. 13, character A designates a block including one or a plurality of gates, numeral 1301 a gate array including one or a plurality of blocks A, numerals 1302, 1303 gate array test circuits, and numerals 131, 132, 133 conductor wires making up removable temporary wires. The test is conducted while scanning the gate array by the test circuits 1302, 1303 thereby to identify defective gates., 57583=FIG. 14 is a diagram showing normally operating blocks connected by main wires with the temporary wires for the test removed. In FIG. 14, numeral 1301 designates a gate array, numerals 1302, 1303 gate array test circuits, and numeral 141 main wires. In the main wiring setup, defective blocks are removed with normal blocks connected by direct writing using the electron beam direct writing machine in accordance with the result of the gate array test., 56618=FIG. 12 is a diagram showing the main wiring of normally-operating blocks from which the temporary wires for the operation test are removed. In FIG. 12, numeral 1101 designates a gate array and numeral 121 main wires. With the main wires, defective blocks are removed and normal blocks connected by direct writing the electron beam direct writing machine in accordance with the result of the gate array operation test.}",
    "textBeforeTable": "Patent Citations It will thus be understood from the foregoing description that according to the present invention, defective blocks can be removed without any redundancy circuit for replacing defective blocks with conforming spare blocks. As a result, the yield rate of integrated circuits is improved without increasing the circuit size or the operation delay time for redundancy. As described above, as far as the chip is preserved while the conductive wires connected for the block test are removed after the block test, all that is required for subsequent processes is to connect the necessary blocks in accordance with the customer specification, resulting in a considerably reduced development lead time. FIGS. 16A to 16C show block diagrams showing a method of fabricating integrated circuits in which blocks are connected in accordance with the customer specification. In FIGS. 16A to 16C, numerals 1601, 1602, 1603, 1604, 1605 designate blocks having certain functions which may or may not be different from each other. Numeral 1606 designates a test circuit for testing each block. Numeral 161 designates temporary wires for testing the blocks, and numeral 162 main wires. After acceptance of the customer specification, the intended integrated circuits can be fabricated simply by wiring the blocks that have been subjected to the block test from the state described in FIG. 16B, and therefore the lead time before successful development can be reduced considerably. FIG. 15 is a flowchart for explaining the method",
    "textAfterTable": "US5543334 * Dec 15, 1994 Aug 6, 1996 Kabushiki Kaisha Toshiba Method of screening semiconductor device US5693540 * May 31, 1996 Dec 2, 1997 Altera Corporation Method of fabricating integrated circuits US5837557 * Mar 14, 1997 Nov 17, 1998 Advanced Micro Devices, Inc. Semiconductor fabrication method of forming a master layer to combine individually printed blocks of a circuit pattern US5889679 * Jul 15, 1997 Mar 30, 1999 Integrated Device Technology, Inc. Fuse array control for smart function enable US6054334 * Sep 12, 1997 Apr 25, 2000 Micron Technology, Inc. Methods and structures for pad reconfiguration to allow intermediate testing during manufacture of an integrated circuit US6068892 * May 13, 1999 May 30, 2000 Micron Technology, Inc. Methods and structures for pad reconfiguration to allow intermediate testing during manufacture of an integrated circuit US6194235 * Jan 12, 2000",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}