{
    "relation": [
        [
            "Date",
            "Sep 27, 2001",
            "May 31, 2005",
            "May 30, 2008",
            "Jul 30, 2012",
            "Dec 14, 2012",
            "Feb 5, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20121214"
        ]
    ],
    "pageTitle": "Patent US6831783 - Diffractive optical element and optical system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6831783?ie=ISO-8859-1&dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471277179,
    "recordOffset": 471256624,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16456=In a refracting optical system, use has heretofore been made of a method of decreasing chromatic aberration by a combination of glass materials differing in dispersion. In contrast, a method of decreasing chromatic aberration by providing a diffractive optical element (hereinafter referred to also as DOE) having the diffracting action on a lens surface or in a portion of an optical system is disclosed in such literature as SPIE, Vol. 1354, International Lens Design Conference (1990), Japanese Patent Application Laid-Open No. 4-213421 (corresponding U.S. Pat. No. 5,044,706), Japanese Patent Application Laid-Open No. 6-324262, etc. These utilize the physical phenomenon that on the refracting part and the diffracting part of the optical system, chromatic aberration appears in opposite directions.}",
    "textBeforeTable": "Patent Citations Also, while in the present embodiment, the DOE is disposed in the projection optical system, this is not restrictive, but if one or more DOE's is disposed on a common optical path of the three primary color lights from the light source, the one or more DOE's may be disposed anywhere on the common optical path of the three primary color lights. While in the present embodiment, a monochromatic light source such as a laser is used as the light source, this is not restrictive, but a white light source may be used or a diffraction-type light modulating element such as a grating light valve may be used as the light modulating element. The construction of Embodiment 3 of the present invention is shown in FIG. 9. FIG. 9 shows a cross-section of a color image displaying optical system, and the reference numeral 18 designates a monochromatic light source such as a laser, the reference numeral 19 denotes a DMD (digital micromirror device) which is a reflection type light modulating element, the reference numeral 20 designates a light intercepting surface, the reference numeral 21 denotes an optical system, the reference numeral 22 designates a projection optical system having therein the DOE1 according to Embodiment 1, and the reference numeral 23 denotes a screen. Although in FIG. 9, for simplification, there is shown an optical system in which only one monochromatic light source such as a laser",
    "textAfterTable": "Aug 29, 1996 Dec 5, 2000 Olympus Optical Company Ltd. Diffractive optical element US6215596 Sep 13, 1999 Apr 10, 2001 Canon Kabushiki Kaisha Optical element, optical device provided therewith, and method for evaluating optical element US6262846 Jul 24, 1998 Jul 17, 2001 Canon Kabushiki Kaisha Diffractive optical element and optical system having the same US6621640 * Apr 3, 2001 Sep 16, 2003 Canon Kabushiki Kaisha Projection display apparatus US20010015848 Sep 14, 1999 Aug 23, 2001 Takehiko Nakai Diffractive optical element and optical system having the same EP0898182A2 * Aug 13, 1998 Feb 24, 1999 Canon Kabushiki Kaisha Diffractive optical element and optical system having the same EP0902304A2 Sep 7, 1998 Mar 17, 1999 Canon Kabushiki Kaisha Diffractive optical element and optical system having the same JP2000098118A Title not available JPH1144808A",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}