{
    "relation": [
        [
            "Cited Patent",
            "US4007450 *",
            "US4215407 *",
            "US4274139 *",
            "US4333144 *",
            "US4412285 *",
            "US4432057 *"
        ],
        [
            "Filing date",
            "Jun 30, 1975",
            "Aug 22, 1972",
            "Apr 16, 1979",
            "Feb 5, 1980",
            "Apr 1, 1981",
            "Nov 27, 1981"
        ],
        [
            "Publication date",
            "Feb 8, 1977",
            "Jul 29, 1980",
            "Jun 16, 1981",
            "Jun 1, 1982",
            "Oct 25, 1983",
            "Feb 14, 1984"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Westinghouse Electric Corp.",
            "International Business Machines Corporation",
            "The Bendix Corporation",
            "Teradata Corporation",
            "International Business Machines Corporation"
        ],
        [
            "Title",
            "Data sharing computer network",
            "Combined file and directory system for a process control digital computer system",
            "Digital telecommunication network having improved data processing systems",
            "Task communicator for multiple computer system",
            "Multiprocessor intercommunication system and method",
            "Method for the dynamic replication of data under distributed system control to control utilization of resources in a multiprocessing, distributed data base system"
        ]
    ],
    "pageTitle": "Patent US4635189 - Real-time distributed data-base management system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4635189?dq=5,845,077",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00097-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485386203,
    "recordOffset": 485358937,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While a wide variety of other procedures and additional procedures can be used in the invention, it should be understood that changes can be made without departing from the spirit or scope of the invention. Thus, this invention is not to be limited to the specific embodiment discussed and illustrated herein, but rather by the following claims. The RTDM procedure thus permits an extremely flexible data base management system that uniquely provides for improved performance in a real-time distributed processing system. Processing speed is enhanced by the fact that each application program uses absolute addresses for all references to memory in its processor, and the RTDM procedure similarly uses absolute addresses into the Source Processor for a variable when obtaining a current copy of the variable's VALUE. Maintainability of the system is enhanced by the use of a master symbol table containing references to the absolute address of each program statement referring to each variable. Reliability is enhanced by completely specifying a request for the current VALUE of a variable and storing that request in each pertinent processor. Moreover, system communications overhead and local memory requirements are reduced by only storing in each processor copies of those variables actually used in the processor. Lastly, if, as a result of the test in step 308, the Requesting Processor determines that the VALUE is locally stored and has a local destination, but that the Requesting Processor is not",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4769772 * Feb 28, 1985 Sep 6, 1988 Honeywell Bull, Inc. Automated query optimization method using both global and parallel local optimizations for materialization access planning for distributed databases US4777589 * Jun 28, 1985 Oct 11, 1988 Hewlett-Packard Company Direct input/output in a virtual memory system US4853843 * Dec 18, 1987 Aug 1, 1989 Tektronix, Inc. System for merging virtual partitions of a distributed database US4855906 * Oct 23, 1987 Aug 8, 1989 Allen-Bradley Company, Inc. System for handling unsolicited messages from lower-tier controllers US4858146 * Aug 13, 1986 Aug 15, 1989 The Babcock & Wilcox Company Automated design of structures using a finite element database US4864497 * Apr 13, 1988",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}