{
    "relation": [
        [
            "Date",
            "Mar 26, 1990",
            "Apr 4, 1990",
            "Dec 9, 1993",
            "Jan 24, 1997",
            "Jun 20, 1997",
            "May 12, 1998",
            "Dec 29, 1998",
            "Mar 18, 1999",
            "Sep 8, 1999",
            "Sep 8, 1999",
            "Feb 15, 2000",
            "Apr 10, 2000",
            "Apr 15, 2002",
            "Apr 30, 2002"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "REMI",
            "FP",
            "AS",
            "FPAY",
            "SULP",
            "PRDP",
            "AS",
            "FPAY",
            "REMI"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Expired due to failure to pay maintenance fee",
            "Assignment",
            "Fee payment",
            "Surcharge for late payment",
            "Patent reinstated due to the acceptance of a late maintenance fee",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed"
        ],
        [
            "Description",
            "Owner name: SPIESS, G. PETER Free format text: ASSIGNMENT OF A PART OF ASSIGNORS INTEREST;ASSIGNOR:LANG, RICHARD A.;REEL/FRAME:005262/0991 Effective date: 19900323 Owner name: WALTERS, LISA Free format text: ASSIGNMENT OF A PART OF ASSIGNORS INTEREST;ASSIGNOR:LANG, RICHARD A.;REEL/FRAME:005262/0991 Effective date: 19900323",
            "Owner name: EXPLORE TECHNOLOGY, INC., AN AZ CORP., ARIZONA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:WALTERS, LISA;SPEISS, G. PETER;LANG, RICHARD A.;REEL/FRAME:005274/0916;SIGNING DATES FROM 19900327 TO 19900328",
            "Year of fee payment: 4",
            "Owner name: INSTANT VIDEO TECHNOLOGIES, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LANG, RICHARD A., ON BEHALF OF EXPORE TECHNOLOGY, INC.;REEL/FRAME:008321/0817 Effective date: 19970110",
            "Owner name: IMPERIAL BANK, CALIFORNIA Free format text: SECURITY INTEREST;ASSIGNOR:INSTANT VIDEO TECHNOLOGIES, INC.;REEL/FRAME:008568/0893 Effective date: 19970523",
            "",
            "Effective date: 19981016",
            "Owner name: INSTANT VIDEO TECHNOLOGIES, INC., CALIFORNIA Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:IMPERIAL BANK;REEL/FRAME:009827/0286 Effective date: 19990310",
            "Year of fee payment: 8",
            "",
            "Effective date: 19991231",
            "",
            "Year of fee payment: 12",
            ""
        ]
    ],
    "pageTitle": "Patent US4963995 - Audio/video transceiver apparatus including compression means - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4963995?dq=inventor:%22Arthur+R.+Hair%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463891467,
    "recordOffset": 463849996,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69367=A second and preferred type of optical disc to be used in AVRU 11 is an erasable optical disc. This disc has full read/write/erase capabilities. With this disc, AVRU 11 has the same record/playback capabilities as a conventional VCR. As an example, erasable optical discs are used in Steven Jobs' \"Next\" machine as described in Infoworld, Volume 10, issue 42, pages 51 and 93, Oct. 17, 1988. In addition, the digital format and the random access capabilities of the erasable disc (and of the CD-ROM and WORM) provide additional benefits as will be discussed in a later part of this specification., 84879=VCR-ET 10 includes audio/video transmitter/receiver 22 which is typically a modem. Advantageously, the modem may be used to communicate an audio/video program over conventional phone lines in a manner similar to that described above with respect to optical fibers. The term modem is derived directly from its functionality as a modulator-demodulator which allows transfer of the audio/video signal over the standard telephone line. Modems are commonly available for computers and are currently available in the form of a single integrated circuit. As an example, Sierra Semiconductor offers a 2400 baud single chip modem under its part number SC111006. Representative manufacturers of these single modem IC's can be found in the Apr. 14, 1988 issue of Engineering Design News (EDN), pages 124-125. Some of these single modem IC's have the added capability of generating the tones for dialing a phone number. The destination phone number ma be entered by means of an optional keyboard/keypad 45 incorporated in the video recorder 10 of the invention. Output port 46 of transmitter/receiver 22 connects directly to the telephone line. (It is noted that the band width of a conventional phone line is at present much narrower than the signal band width of an optical fiber, and thus the data transmission rate on telephone lines is much slower than the transmission rate for an optical fiber. Accordingly, the time required to communicate a video program over a conventional phone line may exceed the time it takes to view the program.), 74597=The process of converting either from analog to digital or from digital to analog requires memory for intermediate storage. Random Access Memory(RAM) 29 serve in this capacity. For this purpose either a DRAM (Dynamic RAM) or a SRAM (static RAM) may be employed. An example of a DRAM is the TI (Texas Instruments) TMX4C1024; an example of a SRAM is the INMOS IMS-1203. RAM 29 should have sufficient capacity to store at least two full uncompressed frames (e.g., about 472 KB)., 68788=A first type of optical disc may comprise a WORM (Write Once Read Many) optical disc. This device has the unique capability of writing on the disc permanently. A laser is used to burn a pit in the media or to change the magnetic or optical properties of the media. A lower-powered laser is then used to read the data from the disc. Data, in this case, is permanently recorded; it may neither be erased nor written over. A further description of this technology can be found in the November 1988 issue of The Electronic System Design magazine (ESD) page 55-56., 75092=The CPU (Central Processing Unit) 28 is a microprocessor which controls the digitization process of VCU 12. CPU 28 works with controller 27 to control and communicate with the other elements of the VCU. There are numerous commercially available microprocessors that are appropriate for this application. The Intel 80286, Intel 80386, Motorola 68020, and Motorola 68030 are examples. A more complete description of the microprocessors can be found in the Oct. 27, 1988 issue of Electronic Design News (EDN), pages 231 and 242, or in the applicable data sheets., 72420=Compression of the digital data defining a video frame and the reverse process (decompression) are accomplished by compressor/decompressor 26. Various algorithms may be employed in the compression process which enable the representation of a series of numbers by a reduced number of digits. As an example, compression algorithms like CCITT Group IV may be used. Existing compression algorithms, like CCITT Group IV, are available on a single integrated circuit. One example of an appropriate compression/decompression circuit on a single integrated circuit is the AMD (Advanced Micro Devices) 7971. The 7971 is described in the Am7971A data sheet, published by AMD in 1988, and incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations An improved audio/video recorder with significantly expanded functional capabilities is thus provided in accordance with the stated objects of the invention and although but a single embodiment of the invention has been illustrated and described, it will be apparent to those skilled in the art that various changes and modifications may be made therein without departing from the spirit of the invention or from the scope of the appended claim. For example, the VCR-ET can be constructed so as to be portable. Thus, it could be carried to a location along with a video camera where it is desired to record a program, and then taken to another location where it is used to edit the program. Other modifications will be apparent to those skilled in the art in light of the present specification. All of the foregoing operations, to the extent they relate to the editing, playback, reception and/or transmission of video signals are also analogous to the VCR-ET's capabilities with regard to analog or digital signals containing only audio material. All of the foregoing operations are performed with enhanced quality and efficiency by virtue of the digital, rather than analog, storage and transmission modes and the compressed data storage mechanism, with additional advantages of improved cost and reliability afforded in the case of tape to tape (or other media to media) program transfers by virtue of the requirement for only a single tape deck",
    "textAfterTable": "Oct 10, 1995 Shaw; Venson M. System for producing a video-instruction set utilizing a real-time frame differential bit map and microblock subimages US5485197 * Sep 22, 1994 Jan 16, 1996 Ictv, Inc. Carousel display US5485219 * Apr 18, 1994 Jan 16, 1996 Depromax Limited Electric service to record transmissions without recording commercials US5508733 * Feb 12, 1993 Apr 16, 1996 Kassatly; L. Samuel A. Method and apparatus for selectively receiving and storing a plurality of video signals US5526034 * May 3, 1993 Jun 11, 1996 Ictv, Inc. Interactive home information system with signal assignment US5541917 * Sep 12, 1994 Jul 30, 1996 Bell Atlantic Video and TELCO network control functionality US5550578 * Oct 6, 1994 Aug 27, 1996 Ictv, Inc. Interactive and conventional television information system US5550863 * Oct 8, 1993",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}