{
    "relation": [
        [
            "Citing Patent",
            "US5883837 *",
            "US5973966 *",
            "US6154404 *",
            "US6314014 *",
            "US6864529",
            "US6868025",
            "US7161838",
            "US7295463",
            "US7400526 *",
            "US7453717 *",
            "US7700430",
            "US7796454",
            "US7933147",
            "US7961494 *",
            "US7995372",
            "US8605493",
            "US8897059",
            "US20040179414 *",
            "USRE45035",
            "USRE45189",
            "WO2001045108A1 *",
            "WO2003077256A2 *"
        ],
        [
            "Filing date",
            "Sep 29, 1997",
            "Dec 1, 1998",
            "Jul 20, 1999",
            "Dec 16, 1999",
            "Aug 23, 2001",
            "Mar 10, 2003",
            "Nov 9, 2004",
            "Feb 11, 2005",
            "Jun 28, 2006",
            "Feb 9, 2006",
            "Sep 25, 2007",
            "Dec 29, 2007",
            "Dec 31, 2007",
            "Sep 30, 2008",
            "Mar 13, 2009",
            "May 22, 2012",
            "Jul 13, 2011",
            "Mar 10, 2003",
            "Jul 3, 2013",
            "Aug 10, 2012",
            "Dec 11, 2000",
            "Mar 5, 2003"
        ],
        [
            "Publication date",
            "Mar 16, 1999",
            "Oct 26, 1999",
            "Nov 28, 2000",
            "Nov 6, 2001",
            "Mar 8, 2005",
            "Mar 15, 2005",
            "Jan 9, 2007",
            "Nov 13, 2007",
            "Jul 15, 2008",
            "Nov 18, 2008",
            "Apr 20, 2010",
            "Sep 14, 2010",
            "Apr 26, 2011",
            "Jun 14, 2011",
            "Aug 9, 2011",
            "Dec 10, 2013",
            "Nov 25, 2014",
            "Sep 16, 2004",
            "Jul 22, 2014",
            "Oct 14, 2014",
            "Jun 21, 2001",
            "Sep 18, 2003"
        ],
        [
            "Applicant",
            "Sgs-Thomson Microelectronics, S.R.L.",
            "Sgs - Thomson Microelectronics, S.R.L.",
            "Samsung Electronics Co., Ltd.",
            "Ovonyx, Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Sharp Laboratories Of America, Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Samsung Electronics Co., Ltd.",
            "Infineon Technologies Ag",
            "Stmicroelectronics S.A.",
            "Samsung Electronics Co., Ltd.",
            "Industrial Technology Research Institute",
            "Industrial Technology Research Institute",
            "Sandisk 3D Llc",
            "Kabushiki Kaisha Toshiba",
            "Higgs Opl. Capital Llc",
            "Kabushiki Kaisha Toshiba",
            "Sharp Laboratories Of America, Inc.",
            "Higgs Opl. Capital Llc",
            "Higgs Opl. Capital Llc",
            "Ovonyx Inc",
            "Micron Technology Inc"
        ],
        [
            "Title",
            "Reading circuit for semiconductor memory cells",
            "Reading circuit for semiconductor memory cells",
            "Integrated circuit memory devices having sense amplifier driver circuits therein that improve writing efficiency",
            "Programmable resistance memory arrays with reference cells",
            "Thin film transistor memory device",
            "Temperature compensated RRAM circuit",
            "Thin film transistor memory device",
            "Phase-changeable memory device and method of manufacturing the same",
            "Memory element, memory read-out element and memory cell",
            "Three-state memory cell",
            "Phase-changeable memory device and method of manufacturing the same",
            "Sensing circuit of a phase change memory and sensing method thereof",
            "Sensing circuit of a phase change memory and sensing method thereof",
            "Non-volatile multi-level re-writable memory cell incorporating a diode in series with multiple resistors and method for writing same",
            "Resistance change memory device with stabilizing circuit coupled in series with selected resistance change memory cell",
            "Phase change memory",
            "Resistance change memory device that stores a reversible resistance value as data",
            "Temperature compensated RRAM circuit",
            "Verification circuits and methods for phase change memory array",
            "Writing system and method for phase change memory",
            "Programmable resistance memory arrays with reference cells",
            "Programmable conductor random access memory and method for sensing same"
        ]
    ],
    "pageTitle": "Patent US5787042 - Method and apparatus for reading out a programmable resistor memory - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5787042?dq=5726663",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471946863,
    "recordOffset": 471919555,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38006=An example of a resistance memory system of the character generally described above is described more completely in U.S. patent application Ser. No. 08/704,953 of Donald M. Morgan (\"Morgan\"), filed Aug. 26, 1996, and entitled \"Memory and Apparatus for Reading/Writing Data In a Memory System including Programmable Resistors\", which disclosure is expressly incorporated herein by reference. In the memory system disclosed in Morgan, the comparison circuits contain an isolation circuit, a helper flip-flop (comparator), and a precharge circuit. These components function together to compare a reference resistance to the programmed resistance of a memory cell. Based upon the comparison results, the comparison circuit produces a logic signal output indicating whether the memory cell is storing a binary \"1\" or a binary \"0\".}",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art that various modifications and variations can be made in the method of the present invention and in construction of the preferred embodiments without departing from the scope or spirit of the invention. Other embodiments of the invention will be apparent to those skilled in the art from consideration of the specification and practice of the invention disclosed herein. It is intended that the specification and examples be considered as exemplary only, with the true scope and spirit of the invention being indicated by the following claims. From the foregoing description, it is seen that, by virtue of detectors 18 and 20, the FF1 and FF2 node voltages are detected on the rise, i.e., their leading edges, to determine whether the data bit stored in a resistive memory element is a \"1\" or a \"0\", and the helper flip-flop 12 is fired immediately upon detecting a definitive difference in FF1 and FF2 node voltages. While the time required for one or the other of the FF1 and FF2 node voltages to achieve the trip voltage Vt may vary from memory cell to memory cell and array to array, the present invention does not require the artificial delay imposed on the FHFF signal in the comparison circuit 200 of FIG. 2. Thus, comparison 300 advantageously accommodates a shorter readout cycle that is uniquely tailored to the readout response",
    "textAfterTable": "US5414271 * Nov 7, 1991 May 9, 1995 Energy Conversion Devices, Inc. Electrically erasable memory elements having improved set resistance stability US5457649 * Aug 26, 1994 Oct 10, 1995 Microchip Technology, Inc. Semiconductor memory device and write-once, read-only semiconductor memory array using amorphous-silicon and method therefor US5481128 * Apr 20, 1995 Jan 2, 1996 United Microelectronics Corporation Structure for flash memory cell US5488584 * Aug 26, 1994 Jan 30, 1996 Micron Technology, Inc. Circuit and method for externally controlling signal development in a serial access memory US5523970 * Jun 16, 1994 Jun 4, 1996 International Business Machines Incorporated Non-volatile memory utilizing a thin film, floating gate, amorphous transistor US5534711 * Apr 19, 1995 Jul 9, 1996 Energy Conversion Devices, Inc. Electrically erasable, directly overwritable, multibit single cell memory elements and arrays fabricated therefrom US5534712 * Aug 21, 1995",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}