{
    "relation": [
        [
            "Cited Patent",
            "US3186253 *",
            "US3232136 *",
            "US3304107 *",
            "US3352580 *",
            "US3643292 *",
            "US4035866 *",
            "US4370898 *",
            "US4435011 *"
        ],
        [
            "Filing date",
            "Jan 31, 1962",
            "Dec 22, 1960",
            "Aug 6, 1962",
            "Apr 27, 1965",
            "Aug 21, 1969",
            "Apr 23, 1976",
            "Aug 20, 1980",
            "Mar 22, 1982"
        ],
        [
            "Publication date",
            "Jun 1, 1965",
            "Feb 1, 1966",
            "Feb 14, 1967",
            "Nov 14, 1967",
            "Feb 22, 1972",
            "Jul 19, 1977",
            "Feb 1, 1983",
            "Mar 6, 1984"
        ],
        [
            "Applicant",
            "Rene Ramillon",
            "Bahmuller Wilhelm",
            "Bahmuller Wilhelm",
            "Kurz Rudolf",
            "Otto Mayer",
            "Ferro Manufacturing Corporation",
            "Toyoto Jidosha Kogyo Kabushiki Kaisha",
            "Nissan Motor Company, Limited"
        ],
        [
            "Title",
            "Pivotal system for lever arms",
            "Adjustable hinge fitting for collapsible stands, reclining chairs, and the like",
            "Adjustable joint, especially for chairs, beds, cots, and the like",
            "Adjustable joint",
            "Automatically interlockable hinge fitting",
            "Seat recliner hinge assembly",
            "Adjustable fastening device",
            "Seat with a dual-adjustable armrest"
        ]
    ],
    "pageTitle": "Patent US4655501 - Armrest of a seat - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4655501?dq=6317900",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986646.29/warc/CC-MAIN-20150728002306-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466102742,
    "recordOffset": 466086348,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In accordance with this invention as described above, the armrest having a seat capable of being allowed to incline at an arbitrary angle together with being capable of locking at the housing position and the position used, can be provided. Further, in this invention, the first cam and the ratchet wheel may be integrally formed with the second cam and the ratchet wheel without forming a separate body. Still further, a torsion spring, air cylinder or the like may be used in place of a coil spring as said return spring. The same effect as the above embodiment can be obtained even in these cases. Then, the actions of the above devices will be described according to FIG. 3 to FIG. 10. The FIG. 3 and FIG. 7 denote states wherein the armrest is housed in the seat back. In FIG. 7, the numeral 21 is a seat back disposed in upright at the rear side of a seat cushion 22 and the armrest 23 is positioned in parallel to the seat back 21. In this state, as shown in FIG. 3, the second cam 10 and pawl 9 rotate toward ratchet teeth 7 side by bias of the return spring 12, thereby engaging the pawl 9 with the ratchet wheel to lock the rotation of the armrest frame 1 downward. At this time, the third cam 13 is positioned at the side of the small",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4946226 * Jul 24, 1989 Aug 7, 1990 Hoover Universal, Inc. Vehicle seat assembly with attitude adjustable armrest US5058240 * Jun 19, 1989 Oct 22, 1991 Keiper Recaro, Inc. Composite inertia latch for vehicle seat back US5076645 * Sep 25, 1990 Dec 31, 1991 Tachi-S Co., Ltd. Armrest for vehicle seat US5489143 * Sep 6, 1994 Feb 6, 1996 Suncall Corporation Arm rest device US5597209 * May 11, 1995 Jan 28, 1997 Hoover Universal, Inc. Adjustable vehicle seat armrest with a ratchet US5658043 * Dec 28, 1995 Aug 19, 1997 Lear Corporation Inertia lock for side-mounted armrest US5702157",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}