{
    "relation": [
        [
            "Date",
            "May 16, 2006",
            "Feb 4, 2009",
            "Dec 6, 2010",
            "Mar 8, 2013",
            "Mar 14, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PERCEPTION RAISONNEMENT ACTION EN MEDECINE, FRANCE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:LAVALLEE, STEPHANE;REEL/FRAME:017912/0171 Effective date: 20060510",
            "Owner name: UNIVERSITE JOSEPH FOURIER, FRANCE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PERCEPTION RAISONNEMENT ACTION EN MEDECINE;REEL/FRAME:022205/0235 Effective date: 20090204",
            "Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PERCEPTION RAISONNEMENT ACTION EN MEDECINE (PRAXIM);REEL/FRAME:025456/0764 Effective date: 20100414 Owner name: UNIVERSITE JOSEPH FOURIER, FRANCE",
            "Owner name: MINMAXMEDICAL, FRANCE Effective date: 20130228 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:UNIVERSITE JOSEPH FOURIER;REEL/FRAME:029956/0242",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7618419 - Method and system of computer assistance for the reduction of a fracture - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7618419?dq=6,411,947",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 489738083,
    "recordOffset": 489715333,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43010=“Calibration method for determining the physical location of the ultrasound image plane” by Amin D V, Kanade T, DiGioia A M, Jaramaz B, Nikou C, LaBarca R S, Moody J E. Proceedings of the Fourth International Conference of Medical Image Computing and Computer-Assisted Intervention (MICCAI 2001), Utrecht, The Netherlands, October, 2001, 43379=According to a variation, a three-dimensional model of the surface of healthy femur 10 may be used and modified according to the two-dimensional images obtained by ultrasound scanning. An example of a method for deforming a three-dimensional model of the surface of a bone is described in documents “Incorporating a Statistically Based Shape Model into a System for Computer-Assisted Anterior Cruciate Ligament Surgery” by M. Fleute, S. Lavallee, R. Julliard (Medical Image Analysis. 1999 September, 3(3): 209-222) and U.S. Patent Application Publication No. 2005/0101966A1, published May 12, 2005. (The above cited documents being incorporated by reference in their entirety). As an example, the contour of femur 10 is determined for each two-dimensional image and the three-dimensional model of the femur is deformed to have it match the contours thus extracted from the two-dimensional images. Such an operation may be automatically performed by a computer. The three-dimensional model may be used to help the identification of the contour of femur 10 on the two-dimensional images, taking the three-dimensional model as a staring point for the search for the femur contour on the two-dimensional images., 25889=The present application claims priority to French Patent Application No. 05/50148 filed Jan. 18, 2005, the disclosure of which is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations The above mentioned patents, applications, and publications are hereby expressly incorporated by reference in their entirety. The embodiments of the present invention are shown and described for purposes of illustration only and not for purposes of limitation. While there have been shown, described, and pointed out fundamental novel features of the invention as applied to several embodiments, it will be understood that various omissions, substitutions, and changes in the form and details of the devices illustrated, and in their operation, may be made by those skilled in the art without departing from the spirit and scope of the invention. Substitutions of elements from one embodiment to another are also fully intended and contemplated. It is also to be understood that the drawings are not necessarily drawn to scale, but that they are merely conceptual in nature. The invention is defined solely with regard to the claims appended hereto, and equivalents of the recitations therein. In operation, the bone holder having a third locatable element is used to statically position the bone, i.e., the third bone element during the reduction procedure. The advantage of the bone holder is that the third bone model can be generated without having to attach a locatable element to the third bone element. In another embodiment, the present invention provides for a computer assisted system in support of repairing a bone fracture. The system includes a first locatable",
    "textAfterTable": "US8380471 * Aug 3, 2011 Feb 19, 2013 The Cleveland Clinic Foundation Method and apparatus for preparing for a surgical procedure US8565853 Aug 13, 2007 Oct 22, 2013 DePuy Synthes Products, LLC Simulated bone or tissue manipulation US8683669 May 13, 2011 Apr 1, 2014 I-Shou University Bone plate manufacturing method US8731885 * Jan 18, 2013 May 20, 2014 The Cleveland Clinic Foundation Method and apparatus for preparing for a surgical procedure US20110082367 * Aug 6, 2010 Apr 7, 2011 Luca Regazzoni Method and apparatus for reducing malalignment of fractured bone fragments US20120022657 * Jan 26, 2012 Iannotti Joseph P Method and apparatus for preparing for a surgical procedure US20130072821 * Sep 16, 2011 Mar 21, 2013 Mako Surgical Corp. Systems and methods for measuring parameters in joint replacement surgery * Cited by examiner",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}