{
    "relation": [
        [
            "Date",
            "Dec 6, 1983",
            "Sep 30, 1987",
            "Sep 11, 1991",
            "Aug 11, 1992",
            "Nov 14, 1995",
            "Apr 7, 1996",
            "Jun 18, 1996"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: NATIONAL RESEARCH DEVELOPMENT CORPORATION, 66-74 V Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:EVANS, DAVID M.;WEIGHTMAN, BARRY O.;REEL/FRAME:004197/0947 Effective date: 19830301 Owner name: NATIONAL RESEARCH DEVELOPMENT CORPORATION, A BRITI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:EVANS, DAVID M.;WEIGHTMAN, BARRY O.;REEL/FRAME:004197/0947 Effective date: 19830301",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: BRITISH TECHNOLOGY GROUP LIMITED, ENGLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:NATIONAL RESEARCH DEVELOPMENT CORPORATION;REEL/FRAME:006243/0136 Effective date: 19920709",
            "",
            "",
            "Effective date: 19960410"
        ]
    ],
    "pageTitle": "Patent US4441489 - Orthopaedic splints - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4441489?dq=5,266,072",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00057-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482329351,
    "recordOffset": 482309873,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23677=FIG. 4 shows another modification relative to FIG. 1 in which the middle plate, differentiated by reference numeral 24, is disposed to adopt a palmar location relative to the finger., 15361=The invention has in fact been developed primarily for use in treatment of the so-called mallet deformity. This deformity is discussed in the book \"The Hand: Operative Plastic and Reconstructive Surgery\", edited by Barron and Saad, and published by Churchill Livingston, 1980. This book indicates that a mallet deformity is the result of injury, open or closed, to the extensor tendon distal to the proximal interphalangeal joint, hereinafter referred to as the PIP joint. Conventional treatment for mallet deformity is said to comprise splinting of the DIP joint in slight hyperextension. This splinting is appropriate in the case of a closed deformity, possibly after an initial period involving a cast extending to the forearm, or following surgery in the case of an open deformity., 17628=Normally each of said first and second portions will include at least one plate curved to seat in palmar or dorsal disposition over a phalanx, with at least said first portion having strapping to hold the same so seated., 23879=Clearly yet other variations are possible. For example, the proximal plate could also adopt a palmar location, but it is preferred that such a location be avoided for the distal plate so that the tactile facility is retained. The members 11 can be integrated by formation from one piece of material, with this piece extending across the proximal and/or distal plate to reinforce the same. The splint need not involve hingeing and spring action from a common structure, although this can clearly be simple and convenient in manufacture. Lastly, the supportive hinge and spring functions of the plates and members may, within the limit in terms of simplicity of structure, be served by a one-piece moulding of plastics material.}",
    "textBeforeTable": "Patent Citations Clearly yet other variations are possible. For example, the proximal plate could also adopt a palmar location, but it is preferred that such a location be avoided for the distal plate so that the tactile facility is retained. The members 11 can be integrated by formation from one piece of material, with this piece extending across the proximal and/or distal plate to reinforce the same. The splint need not involve hingeing and spring action from a common structure, although this can clearly be simple and convenient in manufacture. Lastly, the supportive hinge and spring functions of the plates and members may, within the limit in terms of simplicity of structure, be served by a one-piece moulding of plastics material. FIG. 4 shows another modification relative to FIG. 1 in which the middle plate, differentiated by reference numeral 24, is disposed to adopt a palmar location relative to the finger. The preferred locations just discussed can be reasonably well attained by the provision of a very modest range of sizes of splint to suit different fingers. The overall proportions and dimensions of the splint are preferably such that, in use, the distal and proximal straps 13 are respectively located close to the end of the finger and the PIP joint, and the plate 12 is located towards the proximal end of the associated phalanx and may be slightly longitudinally upwardly inclined to seat against the adjacent knuckle.",
    "textAfterTable": "Orthopedic splint arrangement US4932396 * Apr 15, 1988 Jun 12, 1990 Garris Cynthia G Elliptical ring splint with spacer US4945902 * Dec 15, 1988 Aug 7, 1990 Bissell Health Care Corporation Progressive static flexion device for phalanges US5020524 * Aug 3, 1989 Jun 4, 1991 Donohue Patrick T Modular digital traction system US5038764 * Dec 20, 1989 Aug 13, 1991 Camp International, Inc. Orthotic splint US5095897 * Sep 21, 1990 Mar 17, 1992 Clark E Nelson Orthopedic splint and method of constructing same US5167612 * Jul 30, 1990 Dec 1, 1992 Bonutti Peter M Adjustable orthosis US5213094 * Apr 17, 1991 May 25, 1993 Bonutti Peter M Orthosis with joint distraction US5230699 * Feb 18, 1992",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}