{
    "relation": [
        [
            "Date",
            "Mar 9, 1998",
            "May 7, 2002",
            "Oct 3, 2002",
            "Oct 3, 2002",
            "May 3, 2006",
            "Oct 18, 2006",
            "Dec 12, 2006"
        ],
        [
            "Code",
            "FPAY",
            "REMI",
            "FPAY",
            "SULP",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "",
            "",
            "Effective date: 20061018"
        ]
    ],
    "pageTitle": "Patent US5355811 - Adjustable leg supported mouse pad - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5355811?dq=system+for+measuring+web+traffic&ei=Lg8FT__TIIr-sQKzxaGRCg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985140.15/warc/CC-MAIN-20150728002305-00204-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483915727,
    "recordOffset": 483893751,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In compliance with the statute, the invention has been described in language more or less specific as to structural features. It should be understood, however, that the invention is not limited to the specific features shown since the means and construction shown comprises the preferred forms of putting the invention into effect. The invention is, therefore, claimed in any of its forms or modifications within the legitimate and valid scope of the amended claims, appropriately interpreted in accordance with the doctrine of equivalents. After the saddle structure 30 has been properly positioned on the user's thigh 91, the mouse pad 12 is then fastened to the saddle structure 30 by interconnecting the pads 19 of hook connector located on the bottom surface 16 of the mouse pad 12 with the pad 65 of complimentary loop connector material located on the medial planar surfaces 42 and 52 on the support members 40, 50, respectively. After the lap supported mouse pad has been properly engaged on the user's leg 90, the user is then able to use a mouse 94 on the mouse pad 12. Next, the second support member 50 is aligned over the lateral aspect of the user's thigh and attached to the flexible panel 32. The position of the second support member 50 on the flexible panel 32 is adjusted so that the opposite ends of the mouse pad 12 are sufficiently supported by the",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US5513576 * Jan 3, 1995 May 7, 1996 Ward; Thomas A. Adjustable lap table US5520119 * May 26, 1994 May 28, 1996 Eisenberg; Seth G. Fast food lap tray US5533697 * Nov 9, 1994 Jul 9, 1996 Mark A. Krull Mouse pad with beverage holder US5593128 * Feb 16, 1995 Jan 14, 1997 Odom; Patricia B. Lap supported computer mouse surface US5720226 * Sep 25, 1995 Feb 24, 1998 Padovano; Diane Gail Object retaining device US5765795 * Nov 15, 1995 Jun 16, 1998 Alex; Paul J. Deformable computer mouse pad US5779211 * Dec 12, 1996 Jul 14, 1998 Bird; Peter D. Personal mouse pad",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}