{
    "relation": [
        [
            "Date",
            "Feb 25, 1999",
            "Jan 29, 2001",
            "Aug 26, 2004",
            "Dec 1, 2008",
            "Oct 19, 2009",
            "Oct 2, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CORNELL RESEARCH FOUNDATION, INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ADAMS, SCOTT G.;REED, BRYAN W.;SHAW, KEVIN A.;AND OTHERS;REEL/FRAME:009804/0724;SIGNING DATES FROM 19990212 TO 19990215",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: KIONIX, INC., NEW YORK Free format text: NUNC PRO TUNC ASSIGNMENT;ASSIGNOR:DAVIS, TIMOTHY J.;REEL/FRAME:023390/0106 Effective date: 20091012",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6239473 - Trench isolation for micromechanical devices - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6239473?dq=inassignee:Temic",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478427135,
    "recordOffset": 478393142,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24413=Microelectromechanical systems (MEMS) refers to a technology in which electrical and mechanical devices are fabricated at substantially microscopic dimensions utilizing techniques well known in the manufacture of integrated circuits. Present commercial applications of MEMS technology are predominantly in pressure and inertial sensing, with an emphasis on automotive applications thereof. For an introduction to the use of MEMS technology for sensors and actuators, see for example the article by Bryzek et al. in IEEE Spectrum, May 1994, pp. 20-31., 23680=This application claims the benefit of U.S. Provisional application No. 60/071,390 filed Jan. 15, 1998, the disclosure of which is incorporated herein by reference., 23864=This invention was made with government support under contract number F30602-97-2-0104 awarded by DARPA. The government holds certain rights in the invention., 59143=In FIG. 2B, the isolation trenches are filled using thermal oxidation or CVD techniques to create two isolation segments. The filling process results in a thick dielectric layer 212 and indentations 214 in the surface of the dielectric 216, producing two solid isolation segments that are to be incorporated within the micromechanical structure. To remove the indentations, the surface is planarized using a deposition and etchback process. FIG. 2C shows the results of the planarization, which has removed most or all of the surface indentations 214, leaving minimal features 220 in the areas where the isolation trenches exist. The dielectric 218 thickness will remain as a masking material and an insulating material for the final microstructure, and must therefore retain good electrical and mechanical qualities. The thickness of dielectric layer 218 is preferably 0.5-10 um., 45789=Referring to FIG. 1A, a silicon wafer 102 is provided with a dielectric layer 104, preferably silicon dioxide (oxide). The silicon wafer can be of arbitrary doping, resistivity, and crystal orientation, since the process depends only on reactive ion etching to carve and form the structures. The layer 104 serves the function of protecting the silicon surface of the wafer during an isolation trench etch to follow, and thus represents a masking layer only. This masking layer can be formed from any number of techniques, including thermal oxidation of silicon or chemical vapor deposition (CVD). The typical thickness of the masking layer 104 is 0.5-1.0 um. A photoresist 106 is then spun onto the wafer and exposed and developed using standard photolithography techniques to define the isolation trench pattern 108. Reactive ion etching is used to transfer the photoresist pattern to the mask layer 104, as at 110, exposing the silicon surface 112. Typically, the silicon dioxide mask is etched in a Freon gas mixture, for example CHF3 or CF4. High etch rates for silicon dioxide etching are achieved using a high density plasma reactor, such as an inductively coupled plasma (ICP) chamber. These ICP chambers use a high power rf source to sustain the high density plasma and a lower power rf bias on the wafer to achieve high etch rates at low ion energies. Oxide etch rates of 200 nm/min and selectivities to photoresist greater than 1:1 are common for this hardware configuration., 26465=Deep reactive ion etching techniques developed specifically for the MEMS industry have enabled a greater range of functionality for bulk micromachining. Processes such as those described in U.S. Pat. No. 5,501,893 are now supplied by commercial etch vendors specifically for bulk micromachining. These processes provide silicon etch rates in excess of 2 um/min with vertical profiles and selectivity to photoresist greater than 50:1 or selectivity to silicon oxide greater than 100:1. This enables bulk micromachined structures to span the range from several microns deep to essentially the thickness of an entire wafer (>300 um).}",
    "textBeforeTable": "Patent Citations Although the invention has been described in terms of preferred embodiments, it will be apparent to those of skill in the art that numerous variations and modifications may be made without departing from the true spirit and scope thereof, as set forth in the following claims. At this juncture the integrated circuit and circuit components are fabricated in accordance with known practice. As illustrated in FIG. 6E, the location of the isolation segment 620 is spaced away from that of the integrated circuit, and its presence has no effect on the circuit fabrication processes. The integrated circuit incorporates a metal pad 622 shown connected to a sample junction 624. Also created during the circuit fabrication is a dielectric passivation layer 626 and a contact region 628. The passivation layer 626 may be used as the micromechanical device insulator or replaced with a similarly deposited dielectric. The process then proceeds as described in FIGS. 5E-5H. In FIG. 6F, vias 630 and 632 are created in the resist 634 and are transferred through the dielectric 626 to expose the integrated circuit metal pad 622 and contact region 628. After the resist is stripped, a metal layer 636, preferably aluminum, is sputter deposited in FIG. 6G, contacting the integrated circuit metal pad 622 at the surface 638 and the silicon beam contact region 628 at the surface 640. In FIG. 6H, the metal is coarsely patterned in the region",
    "textAfterTable": "Method of formation of an air gap within a semiconductor dielectric by solvent desorption US5770645 Aug 2, 1996 Jun 23, 1998 Duke University Medical Center Polymers for delivering nitric oxide in vivo US5804084 Oct 11, 1996 Sep 8, 1998 Sandia Corporation Use of chemical mechanical polishing in micromachining US5847454 Sep 22, 1994 Dec 8, 1998 Cornell Research Foundcatton, Inc. Electrically isolated released microstructures US5998816 * Sep 10, 1997 Dec 7, 1999 Mitsubishi Denki Kabushiki Kaisha Sensor element with removal resistance region * Cited by examiner Non-Patent Citations Reference 1 \"Embedded Interconnect & Electrical Isolation for High-Aspect-Ratio, SOI Inertial Instruments\", Timothy J. Brosnihan, James M. Bustillo, Albert P. Pisano & Roger T. Howe, Berkeley Sensor & Actuator Sensor, 1997; pp. 637-640. 2 \"Micromachines on the march\", Janusz Bryzek, Kurt Petersen & Wendell McCulley, IEEE Spectrum, May 1994; pp. 20-31.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}