{
    "relation": [
        [
            "Citing Patent",
            "US5737281 *",
            "US6210169 *",
            "US7612876 *",
            "US8157568 *",
            "US8385618 *",
            "US20110002514 *",
            "WO2009074676A2 *"
        ],
        [
            "Filing date",
            "Mar 5, 1996",
            "Jan 31, 1997",
            "May 29, 2008",
            "May 22, 2008",
            "Dec 12, 2008",
            "Dec 12, 2008",
            "Dec 12, 2008"
        ],
        [
            "Publication date",
            "Apr 7, 1998",
            "Apr 3, 2001",
            "Nov 3, 2009",
            "Apr 17, 2012",
            "Feb 26, 2013",
            "Jan 6, 2011",
            "Jun 18, 2009"
        ],
        [
            "Applicant",
            "Sony Corporation",
            "Lasersight Technologies, Inc.",
            "The Boeing Company",
            "Tsutomu Hara",
            "Technolas Perfect Vision Gmbh",
            "Technolas Perfect Vision Gmbh",
            "Technolas Perfect Vision Gmbh"
        ],
        [
            "Title",
            "Data writing method and device of semiconductor device",
            "Device and method for simulating ophthalmic surgery",
            "Systems and methods for characterizing laser beam quality",
            "Ophthalmologic model",
            "Determination and monitoring of laser energy",
            "Determination and monitoring of laser energy",
            "Determination and monitoring of laser energy"
        ]
    ],
    "pageTitle": "Patent US5387106 - Solid state artificial cornea and method for UV laser sculpting - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5387106?ie=ISO-8859-1&dq=7,177,838",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474688571,
    "recordOffset": 474661352,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18950=It was discovered in or about 1981, that the corneal epithelium exhibits an unusual sensitivity to 193 nm laser light. Laser light of this wavelength was shown to be capable of etching organic substrates in or about 1982. It was then shown that this etching effect would similarly occur with biological tissue. More particularly, in 1983, in a series of experiments, (Trokel, S., Srinivasan, R. and Branen, B., Am. J. Opthal. 96:710 (1983)) the corneal stroma was ablated with an accuracy comparable to organic substrates., 37433=The excimar laser has a great potential for clincal application in corneal surgery. The corneal stroma, which is composed primarily of an extracellular matrix with few cells and with no blood vessels is an excellent biological target for UV ablation. To establish this technique among other standard techniques, reliable long term studies are necessary. A permanent and accurate record of the corneal ablation process provides the means for such a study., 35896=The third method involves noncontact trephination of recipient and donor corneas for the epikeratoplasty operation. Since the first successful keratoplasty, performed by E. Zirm in 1906, the basic surgical technique has not changed. Despite advantages in manual and motorized mechanical trephine design, high and irregular astigmatism still is a major factor limiting the functional results of penetration keratoplasty.}",
    "textBeforeTable": "Patent Citations All such embodiments and variations are believed to be within the sphere and scope of the present invention as defined by the claims appended hereto. Other embodiments and variations of the invention are possible within the scope of the present description. For example, while the use of an EPROM like array 32 to detect and integrate UV radiation is preferred, other detection and integration methodologies may be utilized. FIG. 10 shows an artificial cornea in the form of a quantity of UV curable resin 61 supported on a vertically adjustable platform 63 within a cup 65. Portions of the resin 61 which are irradiated 61' become cured, the platform 63 is then lowered for irradiating the next layer of uncured resin 61. The curing profile then provides an indication of the radiation exposure of the artificial cornea. In this embodiment no computer is required. In the embodiments of FIGS. 11 and 12, a CCD camera 71 is used to detect UV exposure. In the embodiment of FIG. 11, a UV sensitive CCD camera is used to directly detect the UV exposure. In the embodiment of FIG. 12, the UV radiation is applied to a sheet of UV sensitive material 73 which phosphoresces in response to being irradiated. A standard CCD camera 71 is then used to detect the phosphorescencess thereby generated. The output of the camera 71 in the embodiments of FIGS. 11 and 12 is",
    "textAfterTable": "US5098426 * Feb 6, 1989 Mar 24, 1992 Phoenix Laser Systems, Inc. Method and apparatus for precision laser surgery DE2832847A1 * Jul 26, 1978 Feb 14, 1980 Sigma Instr Gmbh Safety device for laser endoscope - has beam directed onto converter connected to comparison circuit to test radiation level before use GB2141225A * Title not available * Cited by examiner Non-Patent Citations Reference 1 \"A Refractive and Histopathologic Study of Excimer Laser Keratectomy in Primates\" by Robert A. Del Pero, MD, Joan E. Gigstad, MD, Alfred D. Roberts, MD, Gordon K. Klintworth, MD, Clifford A. Martin, Ph.D., Francis A. L'Esperance, Jr., MD, and Daniel M. Taylor, MD, American Journal of Ophthalmology, Apr. 1990, vol. 109, No. 4, pp. 419-429. 2 \"A Rotating Slit Delivery System for Excimer Laser Refractive Keratoplasty\" by Khalil Hanna, MD, J. C. Chastang, Yves Pouliquen, MD, Gilles Renard, MD, Louis Asfar and George O. Waring III, MD,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}