{
    "relation": [
        [
            "Date",
            "Dec 10, 1998",
            "Aug 6, 2002",
            "Oct 10, 2002",
            "Nov 25, 2003",
            "Apr 14, 2005",
            "Sep 20, 2005",
            "Jun 6, 2006",
            "Jul 22, 2008",
            "Jan 12, 2009",
            "May 28, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "AS",
            "AS",
            "FPAY",
            "CC",
            "RR",
            "B1",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Certificate of correction",
            "Request for reexamination filed",
            "Reexamination certificate first reexamination",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: NETWORK TECHNOLOGIES, INC., OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:RAFFERTY, JARROD S.;CRADDOCK, ELIZABETH L.;REEL/FRAME:009663/0035 Effective date: 19981208",
            "",
            "Owner name: VIDEO PRODUCTS, INC., OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:JAGATICH, CARL;REEL/FRAME:013380/0590 Effective date: 20020831",
            "",
            "Year of fee payment: 4",
            "",
            "Effective date: 20051223",
            "Free format text: THE PATENTABILITY OF CLAIMS 8-15 IS CONFIRMED. CLAIMS 1 AND 3-7 ARE DETERMINED TO BE PATENTABLE AS AMENDED. CLAIM 2, DEPENDENT ON AN AMENDED CLAIM, IS DETERMINED TO BE PATENTABLE. NEW CLAIMS 16-39 ARE ADDED AND DETERMINED TO BE PATENTABLE.",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6324605 - Computer and peripheral switch with USB - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6324605?dq=6,049,612",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483867767,
    "recordOffset": 483847767,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19624=Universal Serial Bus (USB) is a peripheral bus standard developed by the PC and telecom industry, including Compaq, DEC, IBM, Intel, Microsoft, NEC and Northern Telecom. USB defines a bus and protocols for the connection of computer peripherals to computers (and to each other). “Universal Serial Bus Specification”, Compaq, Intel, Microsoft, NEC, Revision 1.1, Sep. 23, 1998, describes USB and its implementation and is incorporated herein by reference. Proposed and actual USB devices include keyboards, mice, telephones, digital cameras, modems, digital joysticks, CD-ROM drives, tape and floppy drives, digital scanners, printers, MPEG-2 video-base products, and data digitizers and other relatively low bandwidth devices. USB supports data rates of up to 12 Mbits/sec.}",
    "textBeforeTable": "Patent Citations It should be evident that this disclosure is by way of example and that various changes may be made by adding, modifying or eliminating details without departing from the fair scope of the teaching contained in this disclosure. The invention is therefore not limited to particular details of this disclosure except to the extent that the following claims are necessarily so limited. It should also be noted that for KVM switches there is also a switched video path (not shown) between the computers and remote monitors (which may also include on-screen displays from the switch 10). Because of the high bandwidth requirements, video is typically directly switched with a crosspoint switch under the control of the controller 18. For the ease of understanding, the flow of data has been described as from the peripherals to the computers, but in the preferred embodiment, the flow of data is bidirectional. This is particularly important when using USB devices that are output or bidirectionally oriented (e.g., modem, printer, scanner, audio device). It should be noted that while the preferred embodiment uses a data bus as the switcher to move information between selected modules, it is also possible to connect the modules using a crosspoint switch, parallel address, shift registers or any other signal routing techniques known in the art. The peripheral interfaces translate the specific signals to a common “language”, a switcher routes the signals to the proper computer",
    "textAfterTable": "US5734334 Aug 17, 1995 Mar 31, 1998 I-Cube, Inc. Programmable port for crossbar switch US5752032 Nov 21, 1995 May 12, 1998 Diamond Multimedia Systems, Inc. Adaptive device driver using controller hardware sub-element identifier US5758099 May 29, 1996 May 26, 1998 International Business Machines Corporation Plug and play protocol for bus adapter card US5761447 Jun 14, 1997 Jun 2, 1998 International Business Machines Corp. Adaptor connection apparatus for simultaneously connecting a plurality of adaptors to diverse bus architectures US5761448 Aug 30, 1996 Jun 2, 1998 Ncr Corporation Physical-to-logical bus mapping scheme for computer systems having multiple PCI bus configuration US5768568 Jan 30, 1997 Jun 16, 1998 International Business Machines Corp. System and method for initializing an information processing system US5781748 Jul 19, 1996 Jul 14, 1998 Compaq Computer Corporation Computer system utilizing two ISA busses coupled to a mezzanine bus US5784702 Feb 27, 1997 Jul 21, 1998 Internatinal Business",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}