{
    "relation": [
        [
            "Citing Patent",
            "US7415019",
            "US7436789",
            "US7463612",
            "US7466665 *",
            "US7532585 *",
            "US7656886",
            "US7672307",
            "US7742425 *",
            "US7830885",
            "US7840662 *",
            "US7898957",
            "US8072904 *",
            "US8149734",
            "US8160078 *",
            "US8174968",
            "US8248961 *",
            "US8275866 *",
            "US8345544 *",
            "US8495201",
            "US8683020",
            "US8693345 *",
            "US8724516 *",
            "US8767533",
            "US8774147",
            "US8914491",
            "US8923163 *",
            "US8995447",
            "US8996679",
            "US20040264422 *",
            "US20050041627 *",
            "US20050041628 *",
            "US20050094574 *",
            "US20050094576 *",
            "US20090125620 *",
            "US20100011244 *",
            "US20130089002 *",
            "US20130094366 *",
            "US20130250809 *",
            "US20130290471 *",
            "US20140328215 *",
            "US20140355454 *",
            "EP2592872A1 *"
        ],
        [
            "Filing date",
            "Jan 23, 2004",
            "Jul 27, 2004",
            "Oct 18, 2004",
            "Jun 25, 2003",
            "Oct 13, 2004",
            "Oct 3, 2005",
            "Jan 23, 2004",
            "Jun 26, 2006",
            "Oct 5, 2007",
            "Mar 28, 2008",
            "Nov 2, 2006",
            "Oct 5, 2007",
            "Oct 31, 2007",
            "May 15, 2008",
            "Oct 5, 2007",
            "Feb 15, 2007",
            "Dec 19, 2007",
            "Jun 3, 2005",
            "Aug 21, 2012",
            "Feb 25, 2006",
            "Oct 12, 2011",
            "Oct 6, 2011",
            "May 7, 2012",
            "Feb 23, 2012",
            "Jul 1, 2013",
            "May 3, 2013",
            "Mar 13, 2012",
            "Mar 24, 2014",
            "Jun 25, 2003",
            "Jan 23, 2004",
            "Jan 23, 2004",
            "Oct 13, 2004",
            "Oct 18, 2004",
            "Dec 19, 2007",
            "Aug 28, 2007",
            "",
            "Oct 12, 2011",
            "Jun 29, 2012",
            "Apr 27, 2012",
            "May 3, 2013",
            "Sep 4, 2012",
            "Oct 17, 2012"
        ],
        [
            "Publication date",
            "Aug 19, 2008",
            "Oct 14, 2008",
            "Dec 9, 2008",
            "Dec 16, 2008",
            "May 12, 2009",
            "Feb 2, 2010",
            "Mar 2, 2010",
            "Jun 22, 2010",
            "Nov 9, 2010",
            "Nov 23, 2010",
            "Mar 1, 2011",
            "Dec 6, 2011",
            "Apr 3, 2012",
            "Apr 17, 2012",
            "May 8, 2012",
            "Aug 21, 2012",
            "Sep 25, 2012",
            "Jan 1, 2013",
            "Jul 23, 2013",
            "Mar 25, 2014",
            "Apr 8, 2014",
            "May 13, 2014",
            "Jul 1, 2014",
            "Jul 8, 2014",
            "Dec 16, 2014",
            "Dec 30, 2014",
            "Mar 31, 2015",
            "Mar 31, 2015",
            "Dec 30, 2004",
            "Feb 24, 2005",
            "Feb 24, 2005",
            "May 5, 2005",
            "May 5, 2005",
            "May 14, 2009",
            "Jan 14, 2010",
            "Apr 11, 2013",
            "Apr 18, 2013",
            "Sep 26, 2013",
            "Oct 31, 2013",
            "Nov 6, 2014",
            "Dec 4, 2014",
            "May 15, 2013"
        ],
        [
            "Applicant",
            "Samsung Electronics Co., Ltd.",
            "Sarnoff Corporation",
            "Motorola, Inc.",
            "Motorola, Inc.",
            "Samsung Electronics Co., Ltd.",
            "Chin-Tau Lea",
            "Samsung Electronics Co., Ltd.",
            "The Boeing Company",
            "AT&T Intellectual Property II, LLP",
            "EMC(Benelux) B.V., S.A.R.L.",
            "The Hong Kong University Of Science And Technology",
            "At&T Intellectual Property Ii, L.P.",
            "At&T Intellectual Property Ii, L.P.",
            "Telcordia Technologies, Inc.",
            "At&T Intellectual Property Ii, L.P.",
            "Canon Kabushiki Kaisha",
            "At&T Intellectual Property I, L.P.",
            "Sony Corporation",
            "At&T Intellectual Property I, L.P.",
            "Coco Communications Corp.",
            "Mayflower Communications Company, Inc.",
            "Rockwell Collins, Inc.",
            "At&T Intellectual Property Ii, L.P.",
            "Dahrwin Llc",
            "At&T Intellectual Property, I, L.P.",
            "Telefonaktiebolaget L M Ericsson (Publ)",
            "Telcordia Technologies, Inc.",
            "Coco Communications Corp",
            "George Calcev",
            "Samsung Electronics Co., Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Samsung Electronics Co., Ltd.",
            "Fonseca Benedito J.Jr.",
            "John Gregory Klincewicz",
            "France Telecom",
            "Rockwell Collins, Inc.",
            "Mayflower Communications Comnpany, Inc.",
            "Cisco Technology, Inc.",
            "Rajat Venkatesh",
            "Telefonaktiebolaget L M Ericsson (Publ)",
            "Telcordia Technologies, Inc.",
            "Insta Elektro GmbH"
        ],
        [
            "Title",
            "Apparatus and method for collecting active route topology information in a mobile ad hoc network",
            "Ad Hoc wireless node and network",
            "Method and apparatus for route discovery within a communication system",
            "Method and apparatus for route discovery within a communication system",
            "Method of electing a leader in an ad-hoc network",
            "Non-blocking internet backbone network",
            "Apparatus and method for transparent layer 2 routing in a mobile ad hoc network",
            "Neural network-based mobility management for mobile ad hoc radio networks",
            "Communication network apparatus and method",
            "Dynamically managing a network cluster",
            "Non-blocking destination-based routing networks",
            "Communication network apparatus and method",
            "Communication network apparatus and method",
            "Inter-local peer group (LPG) routing method",
            "Communication network apparatus and method",
            "Communication apparatus and communication layer role deciding method",
            "Assigning telecommunications nodes to community of interest clusters",
            "Information processing system and method, information management apparatus and method, information processing apparatus and method, recording medium, and program product",
            "Assigning telecommunications nodes to community of interest clusters",
            "Naming system layer",
            "Dynamic management of wireless network topology with diverse traffic flows",
            "Unifying connected dominating set using localized two hop information with a flexible dominating factor",
            "Communication network apparatus and method",
            "Asynchronous wireless dynamic ad-hoc network",
            "Assigning telecommunications nodes to community of interest clusters",
            "Fast opportunistic distributed resource reallocation for established connections in a multihop network",
            "Inter-local peer group (LPG) routing method",
            "Naming system layer",
            "Method and apparatus for route discovery within a communication system",
            "Apparatus and method for collecting active route topology information in a mobile AD HOC network",
            "Apparatus and method for transparent layer 2 routing in a mobile ad hoc network",
            "Method of electing a leader in an ad-hoc network",
            "Method and apparatus for route discovery within a communication system",
            "Assigning telecommunications nodes to community of interest clusters",
            "Method of routing data in a network comprising nodes organized into clusters",
            "UCDS: Unifying Connected Dominating Set Using Localized Two Hop Information with a Flexible Dominating Factor",
            "Dynamic management of wireless network topology with diverse traffic flows",
            "Region-based route discovery in reactive routing networks",
            "Managing transfer of data from a source to a destination machine cluster",
            "Fast opportunistic distributed resource reallocation for established connections in a multihop network",
            "Communication Node Operable to Estimate Faults in an Ad Hoc Network and Method of Performing the Same",
            "Method for operating a multi-hop connection network"
        ]
    ],
    "pageTitle": "Patent US20030204625 - Hierarchical mobile ad-hoc network and methods for performing reactive ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030204625?dq=5537618&ei=urENT6-uEoHegQe698i5Bw",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483603943,
    "recordOffset": 483567177,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43670=[0005] One challenge to the advancement of ad-hoc network development is that of extending such networks to encompass large numbers of nodes. One prior art attempt to do so utilizes “spine” routing, such as in the optimal spine routing (OSR) approach disclosed by Das et al. in “Routing in Ad-Hoc Networks using Minimum Connected Dominating Sets,”IEEE Int. Conf. On Commun. (ICC '97), 1997. In this approach, a spine or “virtual backbone” is defined such that each network node is no more than one hop from a spine node. Global topology (link state) is maintained at each spine node, and a link-state routing algorithm is run at each spine node to produce current routes to every destination., 44414=[0006] Another related approach is clustered spine routing (CSR), which is disclosed by Das et al. in “Routing in Ad-Hoc Networks using a Spine,”IEEE Int. Conf. On Computer Commun. and Networks (IC3N '97), 1997. this approach is intended to extend the applicability of spine routing to larger network sizes by grouping the nodes in clusters and adding a second hierarchical level to the OSR approach. Yet another approach is known as partial knowledge spine routing (PSR) which is disclosed by Sivakumar et al. in “The Clade Vertebrata: Spines and Routing in Ad-Hoc Networks,”IEEE Symposium On Computer and Commun., 1998., 86677=[0065] In either event, once selected the best route may then be stored in a routing cache or table. By way of example, the path metric used to select the cluster-level route may be which delivery route includes the least number of cluster leader nodes (i.e., which one has includes the least number of clusters 12). Of course, other metrics, such as the QoS metrics noted above, may also be used. One particularly advantageous approach to selecting routes using QoS parameters is described in a co-pending U.S. application entitled “METHODS AND SYSTEM FOR DETERMINING QUALITY OF SERVICE (QoS) ROUTING FOR MOBILE AD HOC NETWORKS,” attorney docket number GCSD-1201 (51264), filed Apr. 29, 2002, which is assigned to the present assignee and is incorporated herein in its entirety by reference. Once the source cluster leader node 21 has determined the best cluster level route, it may then be forwarded to the requesting source node 14 in a cluster level route reply (CLRREP) message, at Block 57.}",
    "textBeforeTable": "Patent Citations [0113] Many modifications and other embodiments of the invention will come to the mind of one skilled in the art having the benefit of the teachings presented in the foregoing descriptions and the associated drawings. Therefore, it is understood that the invention is not to be limited to the specific embodiments disclosed, and that modifications and embodiments are intended to be included within the scope of the appended claims. [0112] As may be seen in FIG. 3, the fourth level 18 includes a single cluster which may advantageously provide a convenient reference for determining a high-level route from the cluster leader node 21 of the source cluster to the cluster leader node 32 of the destination cluster. More particularly, since this single cluster includes the source and destination leader node clusters 21, 32, the high-level route may be determined therebetween using the various steps outlined above. The high-level route may, in turn, be used to determine the cluster-level route for the second hierarchical level. That is, the cluster-level route may include at least the clusters having respective cluster leader nodes along the high-level route, here the cluster leader nodes 21, 24, and 32. [0111] Furthermore, the cluster-level route request may have a different type for each hierarchical cluster level. More particularly, at a specific level the message is sent to the ALN for that level. Additionally, with respect",
    "textAfterTable": "US20100011244 * Aug 28, 2007 Jan 14, 2010 France Telecom Method of routing data in a network comprising nodes organized into clusters US20130089002 * Apr 11, 2013 Rockwell Collins, Inc. UCDS: Unifying Connected Dominating Set Using Localized Two Hop Information with a Flexible Dominating Factor US20130094366 * Oct 12, 2011 Apr 18, 2013 Mayflower Communications Comnpany, Inc. Dynamic management of wireless network topology with diverse traffic flows US20130250809 * Jun 29, 2012 Sep 26, 2013 Cisco Technology, Inc. Region-based route discovery in reactive routing networks US20130290471 * Apr 27, 2012 Oct 31, 2013 Rajat Venkatesh Managing transfer of data from a source to a destination machine cluster US20140328215 * May 3, 2013 Nov 6, 2014 Telefonaktiebolaget L M Ericsson (Publ) Fast opportunistic distributed resource reallocation for established connections in a multihop network US20140355454 * Sep 4, 2012",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}