{
    "relation": [
        [
            "Citing Patent",
            "US6915275",
            "US6954736",
            "US6965877 *",
            "US7039606",
            "US7054837",
            "US7072843",
            "US7120596",
            "US7171379",
            "US7516090 *",
            "US7546257",
            "US7558745",
            "US7698146",
            "US7747457",
            "US7870030 *",
            "US7925568",
            "US8190462",
            "US8266011",
            "US8352324",
            "US8751336",
            "US8781942 *",
            "US20020077954 *",
            "US20020083196 *",
            "US20020152183 *",
            "US20040210510 *",
            "US20050015305 *"
        ],
        [
            "Filing date",
            "Jun 7, 2001",
            "Mar 23, 2001",
            "Jun 7, 2001",
            "Mar 23, 2001",
            "May 28, 2004",
            "Mar 23, 2001",
            "Mar 23, 2001",
            "Mar 23, 2001",
            "Jul 19, 2003",
            "Jul 12, 2005",
            "Mar 10, 2004",
            "Apr 24, 2002",
            "Feb 14, 2006",
            "Sep 4, 2001",
            "Apr 10, 2003",
            "Jan 25, 2007",
            "Oct 12, 2011",
            "Jan 7, 2011",
            "Oct 7, 2004",
            "Aug 3, 2006",
            "Dec 14, 2000",
            "Dec 27, 2000",
            "Apr 17, 2001",
            "Mar 10, 2004",
            "Jul 19, 2003"
        ],
        [
            "Publication date",
            "Jul 5, 2005",
            "Oct 11, 2005",
            "Nov 15, 2005",
            "May 2, 2006",
            "May 30, 2006",
            "Jul 4, 2006",
            "Oct 10, 2006",
            "Jan 30, 2007",
            "Apr 7, 2009",
            "Jun 9, 2009",
            "Jul 7, 2009",
            "Apr 13, 2010",
            "Jun 29, 2010",
            "Jan 11, 2011",
            "Apr 12, 2011",
            "May 29, 2012",
            "Sep 11, 2012",
            "Jan 8, 2013",
            "Jun 10, 2014",
            "Jul 15, 2014",
            "Jun 20, 2002",
            "Jun 27, 2002",
            "Oct 17, 2002",
            "Oct 21, 2004",
            "Jan 20, 2005"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Restaurant Services, Inc.",
            "International Business Machines Corporation",
            "Restaurant Services, Inc.",
            "Restaurant Services, Inc.",
            "Restaurant Services, Inc.",
            "Restaurant Services, Inc.",
            "Restaurant Services, Inc.",
            "Sap Ag",
            "Restaurant Services, Inc.",
            "Volt Information Sciences, Inc.",
            "Volt Information Sciences Inc.",
            "Volt Information Sciences, Inc.",
            "Ais Management Gmbh",
            "Volt Information Sciences, Inc.",
            "Volt Information Sciences, Inc.",
            "Torrenegra Ip, Llc",
            "Ais Management Gmbh",
            "Restaurant Services, Inc.",
            "Genesys Telecommunications Laboratories, Inc.",
            "Slaight Thomas H.",
            "David Moyers",
            "A.T. Kearney, Inc.",
            "Cullen Andrew A.",
            "Sumit Agarwal"
        ],
        [
            "Title",
            "Managing customization of projects prior to manufacture in an electronic commerce system",
            "System, method and computer program product for order confirmation in a supply chain management framework",
            "Brokering and facilitating consumer projects in an e-commerce system",
            "System, method and computer program product for contract consistency in a supply chain management framework",
            "System, method and computer program product for utilizing market demand information for generating revenue",
            "System, method and computer program product for error checking in a supply chain management framework",
            "System, method and computer program product for landed cost reporting in a supply chain management framework",
            "System, method and computer program product for normalizing data in a supply chain management framework",
            "Dynamic attributes",
            "System, method and computer program product for utilizing market demand information for generating revenue",
            "Method of and system for enabling and managing sub-contracting entities",
            "System and method for collecting and providing resource rate information using resource profiling",
            "Computer system and method for facilitating and managing the project bid and requisition process",
            "Method and system for managing invitations to bid",
            "Computer system and method for producing analytical data related to the project bid and requisition process",
            "System and method for internet based procurement and administrative management of workers",
            "Method, system and apparatus for matching sellers to a buyer over a network and for managing related information",
            "Method and system for managing invitations to bid",
            "E-catalogue ordering for a supply chain management system",
            "System and method for matching electronic proposals to electronic requests",
            "Sourcing system and method",
            "Generating responses in EDI systems",
            "Print supply marketplace using pricing model",
            "Method of and system for enabling and managing sub-contracting entities",
            "Dynamic attributes"
        ]
    ],
    "pageTitle": "Patent US20030208434 - On-line system and method for analyzing vendor proposals in response to a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030208434?dq=6,408,309",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473767951,
    "recordOffset": 473745834,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24628=[0001] This application claims the benefit of priority of U.S. Provisional Patent Application Serial No. 60/211,719, filed on Jun. 15, 2000, and is related to Applicant's co-pending applications, identified as Attorney Docket Nos. 878-006, 878-007, 878-008 and 878-011. Each of these applications, including the above-referenced provisional application, is incorporated by reference herein as fully as if set forth in its entirety.}",
    "textBeforeTable": "Patent Citations [0058] While only certain features of the invention have been illustrated and described herein, many modifications, substitutions, changes or equivalents will now occur to those skilled in the art. It is therefore, to be understood that this application is intended to cover all such modifications and changes that fall within the true spirit of the invention. [0057] Once a product is shipped to the purchaser, the vendor may be required, depending on the terms of the purchase order, to perform additional services. These services may include installation, maintenance, monitoring, instruction, etc. Thus, processor 108 is also configured to employ additional functionality for the purposes of maintaining vendor performance metrics. These features are discussed in greater detail in Applicant's co-pending patent application, identified as Attorney Docket No. 878-009 (which as previously mentioned, is incorporated by reference herein). [0056] At step 710, the vendor creates an invoice. Preferably, the vendor accesses template manager module 122, which is configured to maintain an invoice template. The fields of the invoice template are populated by information that was also employed to populate the purchase order. At step 712, the invoice is transmitted by the vendor to the buyer's accounting department. At step 714, the vendor transmits the highly specialized item which is the subject of the purchase order to the purchaser at an address determined by both parties. [0055] At",
    "textAfterTable": "US8352324 Jan 7, 2011 Jan 8, 2013 Ais Management Gmbh Method and system for managing invitations to bid US8751336 Oct 7, 2004 Jun 10, 2014 Restaurant Services, Inc. E-catalogue ordering for a supply chain management system US8781942 * Aug 3, 2006 Jul 15, 2014 Genesys Telecommunications Laboratories, Inc. System and method for matching electronic proposals to electronic requests US20020077954 * Dec 14, 2000 Jun 20, 2002 Slaight Thomas H. Sourcing system and method US20020083196 * Dec 27, 2000 Jun 27, 2002 David Moyers Generating responses in EDI systems US20020152183 * Apr 17, 2001 Oct 17, 2002 A.T. Kearney, Inc. Print supply marketplace using pricing model US20040210510 * Mar 10, 2004 Oct 21, 2004 Cullen Andrew A. Method of and system for enabling and managing sub-contracting entities US20050015305 * Jul",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}