{
    "relation": [
        [
            "Date",
            "May 23, 2002",
            "Feb 13, 2003",
            "Jun 27, 2005",
            "Dec 6, 2005",
            "Aug 1, 2009",
            "Nov 4, 2009",
            "Feb 12, 2010",
            "Feb 24, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: WALKER DIGITAL, LLC, CONNECTICUT Free format text: INVALID RECORDING;ASSIGNORS:WALKER, JAY S.;JORASCH, JAMES A.;GELMAN, GEOFFREY M.;AND OTHERS;REEL/FRAME:012938/0437;SIGNING DATES FROM 20020411 TO 20020412 Owner name: WALKER DIGITAL, LLC, CONNECTICUT Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WALKER, JAY S.;JORASCH, JAMES A.;GELMAN, GEOFFREY M.;ANDOTHERS;REEL/FRAME:013072/0121;SIGNING DATES FROM 20020411 TO 20020508",
            "",
            "",
            "",
            "Owner name: EMERSON, DAVID, MISSOURI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INTELLISTROBE SAFETY SYSTEMS, L.L.C.;REEL/FRAME:023032/0126 Effective date: 20090706",
            "Owner name: IGT,NEVADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:WALKER DIGITAL, LLC;REEL/FRAME:023456/0940 Effective date: 20090810",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7094149 - Methods and systems for facilitating play at a gaming device by means of ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7094149?dq=7,103,380",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00268-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478366247,
    "recordOffset": 478311937,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6494=The associated person identifier 1006 stores an identification of an associated person, if any, that the player has designated as the person to be provided with the benefit defined by the offer. The associated person identifier 1006 may comprise any information sufficient to identify an associated person. An associated person identifier stored in the associated person identifier field 1006 may correspond to or be the same as one or more of the associated person identifiers stored in the associated person identifier field 408 of the player database 425 (FIG. 5) and/or the associated person field 602 of the associated person database 430 (FIG. 6). As illustrated in table 450, more than one associated person identifier may be stored in association with a particular player identifier 1002. Further the same associated person identifier 1004 may be stored in association with more than one player identifier 1002.}",
    "TableContextTimeStampAfterTable": "{211287=Process 1100 begins with step 1105 which comprises monitoring a condition of the gaming device. Conditions of a gaming device that may be monitored are described above with reference to the available offers database 435 (FIG. 7). In step 1110 it is determined that a condition of a gaming device satisfies an offer criterion of an offer (e.g., as indicated in the available offers database 435). It may be that a condition of the gaming device satisfies an offer criterion of more than one offer. In such a case all of the offers may be selected in step 1110 or a subset of the offers may be selected in step 1110 (e.g., the offer associated with a subsidizing entity having the highest rank is selected). Once an offer is selected, the player information associated with the player playing at the gaming device is retrieved in step 1115. Such player information may comprise the type of player information stored in player database 425. In an alternate embodiment of step 1115 player information may be obtained via questions presented to the player at the gaming device. Such information may also be gathered to supplement and/or confirm the information stored in the player database 425., 75137=U.S. patent application Ser. No. 10/120,529, entitled “METHOD AND APPARATUS FOR OFFERING FORWARD COMMITMENT AGREEMENTS”, filed Apr. 10, 2002 in the name of Walker et al.;, 150651=The special date 608 and special date description 610 may be utilized to (i) increase the acceptance rate of an offer by customizing the offer towards a particular player (e.g., a player may be more likely to accept an offer that incorporates people and dates relevant to the player's life); (ii) select one of a plurality of available offers to provide to the player (e.g., if there is a choice between an offer that defines a benefit of a dinner in the casino's restaurant on the night of the offer and another offer that defines a gift certificate to a popular merchant, the latter offer is an offer that is more appropriate if the benefit is to be provided to a person other than a player); and/or (iii) aid the determination of the most effective timing of the offer towards the player (e.g., the system may determine to provide a particular offer because the current date is within a predetermined time of a special date). For example, assuming it is determined that a special date corresponding to an associated player designated by a particular player is approaching (e.g., is within one month of the current date) an offer may be selected and/or customized to take advantage of this fact. In this example, if it is determined that a player had designated an associated person “John” with an associated special date of September 01 (the current date being August 02) and a special date description of “birthday”, the system may output an offer to the player inviting the player to commit to a specified obligation in order to obtain a specified benefit for John because John's birthday was coming up in less than a month. If the benefit in the example is a gift certificate to a merchant, the player may accept the offer after being reminded that John's birthday is coming up and that the gift certificate might make a good gift for John. The player may view the offer as an opportunity to avoid an upcoming cost (i.e., the cost of buying John a birthday present), which may prove to be a powerful incentive. The casino or other operator implementing the methods of the present invention may also earn the player's goodwill in making such an offer by reminding him of an upcoming event and providing a suggestion for a present., 215993=In step 1135 the player is prompted to enter the security phrase associated with the player identifier inserted into the gaming device. Such a security phrase may be retrieved from the record corresponding to the player identifier in the player database 425 (FIG. 5). This step may be especially important in embodiments where the offer defines an obligation that is not to be performed at the gaming device, defines a benefit to be provided to the player before the player satisfies the obligation defined by the offer, and/or defines a penalty to be assessed to the player associated with the player identifier inserted into the gaming device., 209144=The status of benefit 1010 stores an indication of whether the benefit defined by the offer of a given record has or has not been provided. As discussed above, a benefit may be provided to the player or to an associated person. Thus a status of “provided” indicates that the benefit has been provided to the player if no associated person is indicated in the record and that the benefit has been provided to the associated person if one or more associated persons are indicated in the record. In an embodiment wherein a benefit, or portion of a benefit, is provided to both a player and an associated person or to more than one associated person, a separate indication for each of the persons to whom the benefit is to be provided may be stored. As also discussed above, a benefit may be provided at the time a player commits to an obligation and/or at the time a player satisfies the obligation. If a benefit is provided at the time a player commits to an obligation but the player subsequently fails to satisfy the obligation a penalty may be assessed. Such an example is illustrated in the second record of table 450. In the example of this record the system may, upon determining that the status of the benefit is “provided” and the status of the obligation is “failed” retrieve the penalty corresponding to the offer based on the offer identifier. The system may then assess the penalty as appropriate., 74270=This application is a continuation-in-part application of U.S. patent application Ser. No. 09/521,869, entitled SLOT MACHINE ADVERTISING/ SALES SYSTEM AND METHOD, filed Mar. 8, 2000 in the name of Walker et al. which issued as U.S. Pat. No. 6,390,917B1 on May 21, 2002; which is a continuation application of U.S. patent application Ser. No. 08/769,085, entitled SLOT MACHINE ADVERTISING/SALES SYSTEM AND METHOD, filed Dec. 18, 1996 in the name of Walker et al. and issued Feb. 13, 2001 as U.S. Pat. No. 6,186,893., 213838=If it is determined, in step 1120, that the player information does not satisfy the player-related prerequisite corresponding to the selected offer the process 1100 continues to step 1155. In step 1155 it is determined whether there is another offer available the offer criterion of which is satisfied by a condition of the gaming device. For example, if more than one offer was initially identified in step 1110 one of the remaining offers that was not previously selected may be selected in step 1155. If another offer is available, the process 1100 returns to step 1120 where it is determined whether the player related information previously obtained satisfied the player-related prerequisite corresponding to the offer selected in step 1155. It may be necessary to obtain additional information from the player in order to determine whether the player-related prerequisite is satisfied. If this is so, one or more questions may be presented to the player to obtain the necessary additional information., 133422=The comp points 518 stores an indication of the amount of comp points that a player is currently entitled to. Comp point programs are a common method for a casino to reward players by awarding points to players as a reward for certain gambling behavior that a casino finds desirable. Although the comp points programs differ from casino to casino, in a typical comp point program a player accumulates comp points based on (i) the length of time or a number of game plays at a gaming device or table game; (ii) the average wager of a player; and/or (iii) for playing a particular gaming device or group of gaming devices. As the player accumulates comp points the player may exchange some or all of the comp points for goods or services specified by the comp point program. For example, a player may exchange 1000 comp points for a dinner at a casino restaurant. As the player exchanges comp points for a good or service the exchanged comp points are deducted from the player's comp point balance reflected in field 518 of table 425. In some comp point programs the rewards are defined in terms of dollar amounts rather than points. In yet other comp point programs the points are exchangeable into dollar amounts based on a schedule defined by the casino, allowing the player to convert the accumulated points into dollar amounts and then use the dollar amounts to purchase goods or services from the casino., 218644=If, in step 1140, it is determined that the player identity is verified the process 1100 proceeds to step 1145 where an indication of the player's commitment to the offer is stored (e.g., in the accepted offer tracking database 450). The process 1100 then proceeds to step 1150 where the benefit is provided to the player. Step 1150 may comprise determining what the benefit to be provided to the player is (e.g., by accessing the available offers database 435 based on the offer identifier of the offer accepted by the player). The status of the benefit may accordingly be updated in the accepted offer tracking database 450., 218272=If it is determined in step 1160 that an alternate offer will not be output, the process 1110 loops back to step 1100. Additionally, a message may be output to the player currently playing at the gaming device indicating that he is not the player identified by the player tracking card inserted into the gaming device., 75340=U.S. patent application Ser. No. 10/112,712, entitled “SYSTEM AND METHOD FOR ADVERTISING/SALES AT A GAMING DEVICE”, filed Mar. 29, 2002 in the name of Walker et al., which issued as U.S. Pat. No. 6,890,256 on May 10, 2005., 208295=The status of obligation 1008 stores an indication of the status of the obligation defined by the offer of a given record. The example statuses illustrated in table 450 are (i) a status of “satisfied” (indicating that the player has satisfied the obligation); (ii) a status of “failed” (indicating that the player has failed to satisfy the obligation); (iii) a status of “in progress” (indicating that the player is currently attempting to satisfy the obligation); and a status of “pending” (indicating that a player has not yet attempted to satisfy an obligation but has time remaining to do so before the player is considered to have failed to fulfill the obligation). Other appropriate statuses may be understood by one of ordinary skill in the art and are within the scope of the present invention., 216692=If in step 1140, it is determined that the player's identify has not been successfully verified (e.g., the player entered or selected a security phrase that does not correspond to the security phrase corresponding to the player identifier) the process 1100 proceeds to step 1160. In step 1160 it is determined whether an alternate offer is to be output to the player. For example, it may be determined in step 1160 whether an offer that was identified in step 1110 does not present some of the concerns described above (e.g., the offer defines an obligation that must be performed at the gaming device, the benefit defined by the offer is not provided to the player until the player satisfies the obligation, and there is no penalty defined by the offer) this alternate offer may be presented to the player. Alternatively, one or more offers specifically targeted to such a scenario (i.e., where the identity of the player has not been verified) may be selected. Such a specifically targeted offer may comprise an offer where the obligation, for example, comprises a registration by the player currently playing at the gaming device with the casino for a player tracking card. Additional information related to the player currently playing at the gaming device may also be gathered in determining whether an alternate offer is available. In one embodiment, the provision by the player of such additional information (e.g., demographic information) may serve to satisfy an obligation of an alternate offer., 212594=Once the player information is obtained it is determined, in step 1120, whether the player information satisfied the player-related prerequisite corresponding to the offer selected in step 1110 above. If the player information does satisfy the player-related prerequisite the process 1100 continues to step 1125, where the offer is presented to the player. An offer may be presented to a player in various ways. Examples of how an offer may be presented to a player include but are not limited to (i) a visual presentation (which may be accompanied by audio) on a screen associated with the gaming device; (ii) an audio presentation via a microphone associated with the gaming device; (iii) printing of the offer or outputting of the offer on paper; and (iv) an oral presentation by an employee of a casino. The presentation of the offer to the player may be preceded by a step of pausing the game play of the gaming device the player is playing. For example, the current round of the game the player is playing may be momentarily paused and a visual presentation of the offer overlaid or superimposed on a screen of the gaming device on which the outcomes of the game are presented., 73892=This application claims the benefit of provisional application (i) Ser. No. 60/283,080, filed Apr. 11, 2001, entitled “PREVENTING UNDETECTED SUBSTITUTION AT SLOT MACHINES”; (ii) Ser. No. 60/283,074, filed Apr. 11, 2001, entitled “CROSS SUBSIDY SLOT MACHINES”; and (iii) Ser. No. 60/283,081, filed Apr. 11, 2001, entitled “WIN COMPS FOR FRIENDS”., 214941=Once the offer is presented to the player in step 1125, it is determined in step 1130 whether an acceptance of the offer is received from the player. If an acceptance is received, the process 1100 proceeds to step 1135. If an acceptance of the offer is not received in step 1130 (or a rejection of the offer is received) the process 1100 loops back to step 1105, where a condition of the gaming device is monitored. In an alternate embodiment the process 1100 may proceed to step 1155 and a determination of whether there is another offer available may performed if an acceptance of the offer is not received in step 1130. In yet another alternate embodiment, if it is determined in step 1130 that a player acceptance has not been received, a modification of the previously presented offer may be performed and the offer may be presented again in its modified form to the player (e.g., the value of the benefit of the offer may be increased)., 206268=The offer identifier 1004 stores information uniquely identifying an offer that was accepted by the player identified by the player identifier of the same record. The offer identifier 1004 may comprise, for example, an alphanumeric code. An offer identifier stored in the offer identifier field 1004 may correspond to or be the same as one or more offer identifiers stored in offer identifier field 700 in the available offers database 435 (FIG. 7). An offer identifier stored in the offer identifier field 1004 may be used to determine, for example, (i) the benefit to be provided to the player that accepted the offer of the same record, (ii) any additional requirements of the offer that the player is to abide by, or (iii) what penalty, if any, is to be assessed to the player and/or an associated person designated by the player.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described with respect to a preferred embodiment thereof, those skilled in the art will note that various substitutions may be made to those embodiments described herein without departing from the spirit and scope of the present invention. 5. Conclusion If, in step 1140, it is determined that the player identity is verified the process 1100 proceeds to step 1145 where an indication of the player's commitment to the offer is stored (e.g., in the accepted offer tracking database 450). The process 1100 then proceeds to step 1150 where the benefit is provided to the player. Step 1150 may comprise determining what the benefit to be provided to the player is (e.g., by accessing the available offers database 435 based on the offer identifier of the offer accepted by the player). The status of the benefit may accordingly be updated in the accepted offer tracking database 450. If it is determined in step 1160 that an alternate offer will not be output, the process 1110 loops back to step 1100. Additionally, a message may be output to the player currently playing at the gaming device indicating that he is not the player identified by the player tracking card inserted into the gaming device. If in step 1140, it is determined that the player's identify has not been successfully verified (e.g., the player entered or selected a",
    "textAfterTable": "Charitable contribution centralization system and apparatus US5615109 May 24, 1995 Mar 25, 1997 Eder; Jeff Method of and system for generating feasible, profit maximizing requisition sets US5636346 May 9, 1994 Jun 3, 1997 The Electronic Address, Inc. Method and system for selectively targeting advertisements and programming US5697844 Mar 8, 1996 Dec 16, 1997 Response Reward Systems, L.C. System and method for playing games and rewarding successful players US5721827 Oct 2, 1996 Feb 24, 1998 James Logan System for electrically distributing personalized information US5759101 Apr 11, 1994 Jun 2, 1998 Response Reward Systems L.C. Central and remote evaluation of responses of participatory broadcast audience with automatic crediting and couponing US6021362 Feb 17, 1998 Feb 1, 2000 Maggard; Karl J. Method and apparatus for dispensing samples and premiums US6119101 Jan 17, 1997 Sep 12, 2000 Personal Agents, Inc. Intelligent agents for electronic commerce US6186893 Dec 18, 1996 Feb 13, 2001",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}