{
    "relation": [
        [
            "Date",
            "Jan 14, 2000",
            "Aug 26, 2003",
            "May 20, 2005",
            "May 20, 2009",
            "Jun 28, 2013",
            "Nov 20, 2013",
            "Jan 7, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20131120"
        ]
    ],
    "pageTitle": "Patent US6320122 - Electromagnetic interference gasket - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6320122?dq=7222078",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989042.37/warc/CC-MAIN-20150728002309-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487558263,
    "recordOffset": 487537229,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations In addition, the present invention is not constrained to any particular type of stitching. There are numerous types of stitches that are well-known in the art and any one or combination of these can be used. For illustration purposes, FIGS. 12A-12C illustrate examples of other types of stitch patterns that can be used. It should be noted that although the present invention has been described with respect to an electronic enclosure, the present invention can be easily adapted for use in a shielded room, shielding cabinets, or in any other type of device requiring EMI and/or RF shielding. In addition, the present invention is not constrained for use with I/O connectors and can be used with any application that requires EMI shielding. The foregoing description, for purposes of explanation, used specific nomenclature to provide a thorough understanding of the invention. However, it will be apparent to one skilled in the art that the specific details are not required in order to practice the invention. In other instances, well known circuits and devices are shown in block diagram form in order to avoid unnecessary distraction from the underlying invention. Thus, the foregoing descriptions of specific embodiments of the present invention are presented for purposes of illustration and description. They are not intended to be exhaustive or to limit the invention to the precise forms disclosed, obviously many modifications and variations are possible in view of the above",
    "textAfterTable": "4 http://www.chomerics.com, Low-Cost Conductive Elastomer EMI Gaskets, CHOMERICS, pp. 1—2. (no date). Referenced by Citing Patent Filing date Publication date Applicant Title US6663431 * Aug 30, 2002 Dec 16, 2003 International Business Machines Corporation Shielding in a power connector US6858794 * May 21, 2003 Feb 22, 2005 Dell Products L.P. Perforated EMI gasket US6943287 * Mar 31, 2004 Sep 13, 2005 Molex Incorporated Shielding cage with improved EMI shielding gasket construction US8203083 * Apr 17, 2008 Jun 19, 2012 Nano Interface Technology Electromagnetic wave shielding heat-radiation sheet and manufactured method thereof US8238119 * Sep 9, 2010 Aug 7, 2012 Kabushiki Kaisha Toshiba Electronic device US8302928 * Oct 29, 2007 Nov 6, 2012 Panasonic Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}