{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Forum FAQ & Help Topics This forum addresses Frequently Asked Questions regarding general use of the forum software.",
            "Studio Operations and Making Work Making, decorating and firing ceramic art. Moderated By: Preston Rice",
            "Clay and Glaze Chemistry Recipes, clay and glaze chemistry, glazing techniques. Moderated By: John Baymore",
            "Equipment Use and Repair Use and maintenance of kilns, wheels, pug mills, slab rollers, etc. Moderated by: Bruce Ciske",
            "Business, Marketing, and Accounting Marketing, selling, accounting, website development. Moderated By: Mea Rhee",
            "Educational Approaches and Resources Discussions for students and educators in the ceramic arts.",
            "Aesthetic Approaches and Philosophy Critical theory and commentary on contemporary ceramics",
            "Potters Council Operations and Benefits Moderated by Steven Branfman",
            "Ceramic Events of Interest Exhibitions, Sales, Workshops, and other ceramic-related events."
        ],
        [
            "Stats",
            "2 topics 0 replies",
            "3,280 topics 35,219 replies",
            "2,305 topics 19,469 replies",
            "190 topics 2,163 replies",
            "491 topics 6,095 replies",
            "338 topics 3,558 replies",
            "169 topics 2,611 replies",
            "380 topics 4,280 replies",
            "319 topics 531 replies"
        ],
        [
            "Last Post Info",
            "Our Most Frequently Asked Q... By Jennifer Harnetty 11 Mar 2014",
            "Looking For A New Clay Body By SunsetBay Today, 10:39 AM",
            "How Much Do You Stay Within... By Patat Today, 10:37 AM",
            "Olympic Torchbearer Gas Kiln By sarahwarth@yahoo.com Today, 10:27 AM",
            "On Your Mark, Get Set...chr... By Chantay 31 Jul 2015",
            "Newbie Discouraged But Pers... By Newtoclay54** Today, 10:00 AM",
            "Pots in Movies By Daydreamer Arts Yesterday, 06:37 PM",
            "Qotw: What Makes Something... By Judith B Today, 05:12 AM",
            "2015 Workhouse Clay Nationa... By Workhouse Ceramics Program Yesterday, 02:11 PM"
        ]
    ],
    "pageTitle": "Ceramic Arts Daily Community",
    "title": "",
    "url": "http://community.ceramicartsdaily.org/index/page__s__2f713b17e27c88dd354f880a4d85b828",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 51665519,
    "recordOffset": 51651774,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26797=Happy 1st of The Hottest Month of the Year, bawahahaa. I'm with ya of that Cavy, it's been hot as hell, and it's making any pottery work taxing. I have to fire after 8pm. Any throwing gets done with all the doors open and fan pointing at me mug. Autumn, in South Texas, comes about mid to late November. Stay well. Stay cool. hugs to your guinea., 19480=DirtRoads - Yesterday, 11:10 PM, 21514=Workhouse Ceramics Program - Yesterday, 02:11 PM, 22478=Mark C. - Yesterday, 12:16 PM, 18595=Celia UK - Today, 06:20 AM, 20474=Diz - Yesterday, 06:26 PM}",
    "textBeforeTable": "Toggle Ceramic Arts Daily Forums Ceramic Arts Daily Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected More Gallery Members Forums Ceramic Arts Daily View New Content   Gallery Help Files Members Forums Search section:",
    "textAfterTable": "Recent Topics Cleaning Kiln Shelves Celia UK - Today, 06:20 AM Transformer On Paragon Kiln? DirtRoads - Yesterday, 11:10 PM Double Dip Flakes Off When Drying Diz - Yesterday, 06:26 PM 2015 Workhouse Clay National-Lorton Virginia Workhouse Ceramics Program - Yesterday, 02:11 PM",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}