{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,183 topics 2,127,184 replies",
            "85,566 topics 1,154,277 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,773 replies",
            "5,997 topics 75,836 replies",
            "50,560 topics 466,376 replies",
            "22,767 topics 196,356 replies",
            "4,275 topics 60,588 replies",
            "1,127 topics 8,223 replies",
            "3,615 topics 116,084 replies"
        ],
        [
            "Last Post Info",
            "Gang Life in Los Santos By thafablifee46 15 minutes ago",
            "GTA IV Has more consistent... By jeter2 41 minutes ago",
            "The Ultimate 100% Save File... By Militia 22 hours ago",
            "Which Vehicle Do You Prefer? By EekhoornSWAG 8 hours ago",
            "Things that can be done at... By Kristian. An hour ago",
            "Carl Johnson Appreciation T... By roadrage19 23 minutes ago",
            "Preffered Platform for VC?... By rob2021 5 hours ago",
            "What if GTA III had new music? By thedriver111 2 hours ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "Best GTA Protagonist By Sid Phuge 2 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=222&t=219305&p=3258656",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106624583,
    "recordOffset": 106598863,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{94291=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47946=Google, Bing, Yahoo, Jinx., ~Tiger~, Retired Mafia, Mona Sax, Zonnex, Street Mix, redpoint, doubleg213, Triton460, FrikkenZz, Sid Phuge, JAKEBAB, Kippers, robban, s2n vaniish, allinclusive, Blankerz, Blackbird88, Junko Enoshima, Coleco, The_Gardener, dice, M8Gaming, Owl Man, lydianduck, ErMerGerd, dr.krap, VODKAH, xTrendSs, JRC99, ViciousSpirit, Google Mobile, Oxea, Tycek, stew5556, CrysisAverted, Bombshock, SaL_Leone, AdusPL, C64fanatic, Im Ricky I Win, -Z31N-, Z i X, kulomet333, missitalia21, deceptik0n, Z5_Zeus, Cringlebert Fishtybuns, Bloodysak, javiEmma, lslseph, MrRyanMcCall, Marticus, Anotic, AgentExeider, qzance88, Delboy1983, Fozzie_420, Dr. MAR!O, o_Marvelous, Parikshit Singh, CJPNE, ARC8_1982, Finn 7 five 11, Grampa' Soldier, FlacidJack, Officer Vic, GTA564, Sveittjpong, Rooster1983, TheIceWarrior, Verstappen, Lonely_Screwdriver, one55, stretchx9, Shooter Hex, Hyde Original, M4k3, Lester-The-Molester, Tony_Florence, ALMOST610, alex3, RM76, kcchief1981, BreakBeatBuddha, dTrutha, YngDady, arewenotmen, roboticsuperman, Furry_Monkey, uncaged, Kai650, v1p3r_eddy, Pevenaider, ClaudeSpeed1911, pizt, Foppezão, Amistrulez, PSgtaplayer1, Days Are Gone, D.A., BeckermannDewitt, Lubas, Facebook, Lil_Timmis, Spectacus, VanillaKilla, R3QQ, paulhv2, TobISIS, Phnx., Y_Draig_Bryste, Piperka, PS3KillsThe360, IDredMan, iNero, A3mode, Khaisz, slayso, Viper5900, Mason2003, super_slav, Sariska, Saint_Jackie, Crypain, hornedturtle, size_m, KyloW13, roadrage19, ngazi, Extreme_Wrestler, In Bed With Jed, MaxX2905, betapl, ol_dirty_b101, k2x, Bender.ㅤ, kudisanga, SpooferJahk, jollythecat, thewhitehammer99, Wolftickets, p-s-3x, VeraVanderpump, TheOddGamerYT, dehan, SuperKingBender, ClareXoBearrx3, elidc, TG_Stig, el capito, joe1606, ric-013, MightyMax, JeepXJFreak98, lpgunit, Opzeker, Corndog93, MrMadMike, PTdumptruck, ChrissyBoi87, progamer1258, aleex96, Wombater, gallardo555, Lennie., Killeurdu08, thafablifee46, Denvas, CataniaTiger, 9513=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 12884=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 16745=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 21139=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 14429=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18991=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 13 minutes ago By RavingWithJesus The Cherry Popper Ice Cream... 614,704 replies 15,220 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By redpoint This game has become extrem... 2,292,908 replies 113,764 topics This is a general discussion forum for Grand Theft Auto",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,517 topics 416,589 replies [SA] Crashes & Their Ca... By Shooter Hex 6 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}