{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,147 topics 2,125,881 replies",
            "85,560 topics 1,154,072 replies",
            "1,071 topics 11,072 replies",
            "4,218 topics 64,767 replies",
            "5,996 topics 75,824 replies",
            "50,548 topics 466,282 replies",
            "22,767 topics 196,328 replies",
            "4,274 topics 60,510 replies",
            "1,127 topics 8,221 replies",
            "3,608 topics 115,705 replies"
        ],
        [
            "Last Post Info",
            "I know San Andreas isn'... By Cheatz_N_Trickz A minute ago",
            "Characters who needed more... By Phoenix_Poop 16 minutes ago",
            "6 Star Wanted Level Survival? By Militia 20 hours ago",
            "Is Victor Vance the most hu... By crashrock2 3 hours ago",
            "Unique Vehicles By Militia 3 hours ago",
            "The Chain Game V2 110th Rou... By SalvatoreCJ1903 15 minutes ago",
            "In what order did you do th... By Raiel An hour ago",
            "Cool Things You Didn't... By Canadian Badass 4 hours ago",
            "The incredible Arachnid By Sektor An hour ago",
            "Why everyone hates Luis Lopez? By Xing of Virtue 2 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=98&t=124050&p=1579742",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 115205287,
    "recordOffset": 115183543,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14246=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 114334=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 16555=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47668=Bing, iamcornholio, Yahoo, Saliva, OrionSR, NotAHipster, Google, Icantthinkofonew, CMCSAVAGE, Cheatz_N_Trickz, STEEZYR, OverdrivePedal, Kixa, GuerrilleroESP, s2n vaniish, Stoney0503, joe grizzly, Jambbaah, ap4321, dice, SAVILLAIN, Google Mobile, scania970, Xing of Virtue, Bucybumkin, donpajek, Josivers, UltimateAntic, FUBAR1991, incognito32, BrownieBear, Miss Blossom, MovingTarget268, Z i X, drzayas, TCMike, makeyourself187, Robaldinio, Sea Bear, doubleg213, ab5olut10n, GTAKid667, 10_STAX, BeckermannDewitt, svanderman, Cognoscenti, raka89, W2B, shmok2, RmpTebow15, Th3MaN1, Nugsy, R.Rezzrax, josephene123, Epic., LordMarvel, Mika_0013, onoudint, DISTRICT7642, Majestic81, Official General, 4sinayousefi, Mustangs1753, RiseAgainBH, Johnix1, darthdrillbit, Lester-The-Molester, Randy93, mirthless, The Mysterious One, Mister P, Kakaoen404, ARC8_1982, TG_Stig, Shy, smiffy84, Ukeman5, =OG4life=, Lc gta, Sliderv2, Lonewolvez, LeopardGecko, The_Anti-tragedy, jollythecat, RealGroovyMotion, Claude Liberty, SQH, Mach1bud, Warlord., blackindia, jrl51592, TheMariusz700_PL, Cjs3315, Verlotsky, Aqua97, almico, CaptainMental, m3tal z_DKI, zerGoot, freaklore1, MaidenOfWar, FedoraTheExplora, M4k3, Jax765, Maxandmov, hoopz71, ten-a-penny, Non Fiction, DonSpeedy, Wybo76, TomVDC, CraigMac1876, am30, Johnny Alpha, CoDman182, icecoldkilla1467, LSSDLSPD, I Love Anna Kournikova, uncut751, Trash99, jimmy8309, bLiNg.LK-YMF-420, TheRealCMPUNKFan, starblind94, hotline.n.w.refn, PhiSig, Victim 057, OuttaMyMind, Liquid715, Elfsarecoming, NikkoCharger, Dev522, iSwedge, Euda, mudajama, Cyberzone2, meta187, Flight180Victm, grasmanek94, Riqitch8, DumbForum, rlr149, CyberGhost101, beretta-gt88, SSKYZX, Quinn_flower, Gtaultimatefanboy, quadro09, toxluv, Viiision, Ocelot., DemolitionMan, synn8773, missanthropy, Junior_Djjr, GTAV112, The Yokel, Phoenix_Poop, alchemist3321, Bender.ㅤ, Swoorup, gfen, AdvancedShoe, Ezekeil2Ofive17, Ethenal, VRZD, FreshPrinceOfLosSantos, ShenLong Kazama, a indian llama, arewenotmen, Mastah, CarimboHanky, L0SS4NT0SK1LL3RV, pokeydoughnut65, dkluin, frodzet, LDHalcrow1215, MIXAZZZ, Xorthian, goblinthegnome, GTA717, TWOGUN, Fozzie_420, GoCyclones, Nem Wan, diamond-optic, Yan22, Biker647, Ettayaa_Ghost, sjaak327, Stephan90, Niobium, FlexPiTo, alexindex57, StoreytaleFM, Vega LVI, Sleepingmonster, Captain Sensib1e, 89ShadowUK, RedDagger, WazLah, Jinx., Total Failure, A_Glorious_Spoon, GTASA-Pilot, Edmachine, JCX1992, Tomasak, EVILpotato, Jvaz615, Andreaz1, Winning001, Street Mix, HipsterHillbilly, Mad_Driver10, Omar_DmX, Red Lynx 23, Gutslab, GTASanAndreasV, imDKZH, santtuu74., Misunderstood, Forty-Five-Auto, Carface80, chef_archie, Schleemil, ChrissyBoi87, 7nvd, Blood_94, *Lola, crashoverride93, THE_ENDRMAN_007, jtate724, Retired Mafia, Sky_Light12, DaWiesel, KI3RO98, Nutduster, Rt001, Facebook, superfreak18, madmax4073, U.N.K.N.O.W.N, Terra_S4, Cheepnis, Noclue_42, PhilosophicalZebra, lord tammerlain, jeremy81385, jerryinohio78, Earleys, 9422=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18839=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20961=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12650=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By joe grizzly The Duping Crew 613,933 replies 15,208 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Robaldinio Let's have a chat about... 2,287,076 replies 113,547 topics This is a general discussion forum for Grand Theft Auto Online. Help &",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,484 topics 416,708 replies GTA SA NIGHTCLUBS By L0sEngelzLOver 33 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}