{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,183 topics 2,127,174 replies",
            "85,566 topics 1,154,277 replies",
            "1,071 topics 11,084 replies",
            "4,218 topics 64,773 replies",
            "5,997 topics 75,836 replies",
            "50,560 topics 466,375 replies",
            "22,767 topics 196,356 replies",
            "4,275 topics 60,588 replies",
            "1,127 topics 8,223 replies",
            "3,615 topics 116,079 replies"
        ],
        [
            "Last Post Info",
            "Can you run it = Not trusta... By RedIndianRobin A minute ago",
            "GTA IV Has more consistent... By jeter2 2 minutes ago",
            "The Ultimate 100% Save File... By Militia 22 hours ago",
            "Which Vehicle Do You Prefer? By EekhoornSWAG 8 hours ago",
            "Things that can be done at... By Kristian. An hour ago",
            "SAN ANDREAS THEATRE By D418 An hour ago",
            "Preffered Platform for VC?... By rob2021 5 hours ago",
            "What if GTA III had new music? By thedriver111 An hour ago",
            "What do you hate of GTA 2? By Cerium A day ago",
            "Lets play a game of \"Wo... By svanderman 32 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=98&t=119616&p=3596082",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106870783,
    "recordOffset": 106847057,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16647=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 92927=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14331=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18717=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 12786=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 47562=LuizLopezIV, Bing, Furry_Monkey, Yahoo, Omoplataha, RedIndianRobin, Google, Rippir1600, IvI Ph03nix IvI, Triton460, JoeyDeacan, Demoz, Days Are Gone, Randy93, Lonewolvez, Karoi, Prywatne, SharoFFenstein, arewenotmen, ji.Ruichi, soule561, CjLosSantos, nLytin, MrRyanMcCall, SlavaRak, SuperKingBender, JimmyFantastic, qzance88, GamingWolf1724, Terra_S4, longhurstgb, swooshboy, Spectacus, jeter2, Claude Liberty, SM64Guy, Jinx., Sunblessed, miclin, Dr. MAR!O, ol_dirty_b101, Retired Mafia, size_m, oleg_aka_djmeg, Hylskriksen, yojc, Saint_Jackie, 7nvd, SolidEevee, Google Mobile, Sea Bear, Zoolock, VinceDark, March 10th, ayananosh983, elgato213, sivispacem, Shmoopy, StrykerY, Oxea, hitman774, gta3masta5000, BoJack Cognac, Vadim M., SaL_Leone, TheIceWarrior, Rysir, hamxod, Ivan1997GTA, EMEUTIER, titanic3000000, sotosj, Ukeman5, U WOT M8???, spaceeinstein, emiliumium, JRC99, G{}{}@ngsTer, DMK7, robban, zoso80, Forty-Five-Auto, AndrewDeSanta, kudisanga, Wolftickets, fawk_faber, IDredMan, ZEST, Marwin, Craank_AG, ClaudeSpeed1911, deadman23, D418, MeatSafeMurderer, MarioSonic2987, Flash525, catmandoza, MGT86, hornedturtle, FFwd11, Bms842, Aqua97, Slasherr, RaptorDaptor, Street Mix, MightyMax, Hyde Original, timason, maxx1013, doubleg213, jollythecat, Facebook, MIGta, NikoB08, A Paradox from 94, BeckermannDewitt, el carlitos, dwestos, Scuba 21, Kai650, RDH1983, Solim11, mahey31, Insincere, Lc gta, LeatherJohnny, The Yokel, mitsuwa16, KlIIUMlNATl, Stormingz, Killeurdu08, babylon5, Marcin6, R3QQ, pogo_01, Archangel0934, Verstappen, TovarishTony, Ronzilla187, CrysisAverted, Lil_Timmis, Tony_Florence, gallardo555, GeneralSteve93, TiberiusMcQueen, filthstar0, statistic, Bxx88, judge dread 24, Jackorias, A_Glorious_Spoon, dyons, bamsaidcam, toerage, Choppers, OrionSR, kai824, SonofUgly, Shadowfennekin, juarez, Lester-The-Molester, This Guy Is Here, 9416=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20865=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By longhurstgb The Paleto Bay Mayors Offic... 614,700 replies 15,220 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Triton460 2x RP and GTA$ Pacific... 2,292,875 replies 113,764 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,517 topics 416,588 replies Problem with missions By Skash 44 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}