{
    "relation": [
        [
            "S",
            "",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "M",
            "",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "T",
            "",
            "4",
            "11",
            "18",
            "25",
            ""
        ],
        [
            "W",
            "",
            "5",
            "12",
            "19",
            "26",
            ""
        ],
        [
            "T",
            "",
            "6",
            "13",
            "20",
            "27",
            ""
        ],
        [
            "F",
            "",
            "7",
            "14 The Montagnards: The Green Berets' Secret Vietnam Warriors",
            "21",
            "28",
            ""
        ],
        [
            "S",
            "1",
            "8",
            "15",
            "22",
            "29",
            ""
        ]
    ],
    "pageTitle": "Past Events | Patriots Point News & Events | Page 2",
    "title": "",
    "url": "http://www.patriotspoint.org/news_events/events/category/public-event/past/page/2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 644234071,
    "recordOffset": 644219408,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9347=Patriots Point Naval & Maritime Museum will host its popular ‘Pay What You Can’ Weekend January 5-6.  For this weekend only, normal parking and admission fees will be waived and visitors will be invited to explore the museum for any price they can afford., 24935=On May 17, 21 of the remaining crewmembers of the USS Franklin – all WWII veterans – will gather with their families for their final reunion aboard the USS Yorktown.  In honor of this historic reunion, Patriots Point will host a series of events and educational programs throughout the day to allow the public an opportunity to speak with and hear from these heroes, including a memorial service, special educational program with the veterans and ‘meet and greet’ opportunity., 15569=Patriots Point Naval and Maritime Museum invites the public to visit on Sunday, February 10 from 10 a.m. – 4 p.m. for the second “Open Cockpit Sunday” of 2013., 20841=Patriots Point will host the 2013 Sweetgrass Music Festival on Saturday, March 16.  The day begins with a 5k run at 9 a.m.  Music starts at 10 a.m. and continues through 9 p.m.  , 7581=Patriots Point Naval and Maritime Museum invites the public to visit on Sunday, December 16 from 10 a.m. – 4 p.m. for the return of “Open Cockpit Sunday.”  This is the fourth Open Cockpit Sunday Patriots Point has hosted since the program began last year., 11207=Patriots Point Naval and Maritime Museum invites the public to visit on Sunday, January 20 from 10 a.m. – 4 p.m. for the first “Open Cockpit Sunday” of 2013.  This is the fifth Open Cockpit Sunday Patriots Point has hosted since the program began in 2011.  Normal admission rates apply for this special event., 18376=In celebration of the contributions of African Americans throughout our nation’s history, Patriots Point’s Institute of History, Science and Technology invites the public to attend a special symposium entitled, “Jenkins, Jazz and Jammin’ in Times of War and Peace” on Friday, February 22 at 10 a.m. The program is free and open to the public and will be streamed live on the Patriots Point website and into Charleston County School District classrooms.}",
    "textBeforeTable": "September Aug 2015 July Upcoming Events iCal Import Next Events » « Previous Events United States 29464, Mount Pleasant, SC, 40 Patriots Point Road, Address: 866-831-1720 Phone: Patriots Point Venue: December 8, 2012 5:00 pm End: December 8, 2012 10:00 am Start: Patriots Point will kick of Pinewood Derby Races aboard the USS Yorktown!  This special program will be offered to overnight campers each month and is one you won’t want to miss!",
    "textAfterTable": "View all » Search Search for: Categories History News and Events Newsletter Patriots Point Photos Weekend Scouts Photo Gallery Please specify a Flickr ID for this gallery More Photos Video Gallery Archives Archives Select Month July 2015 June 2015 May 2015 April 2015 March 2015 February 2015 January 2015 December 2014 November 2014 October 2014 September 2014 August 2014 July 2014 June 2014 May 2014 April 2014 March 2014 February 2014 January 2014 December 2013 November 2013 October 2013",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}