{
    "relation": [
        [
            "Parallel",
            "Will does or talks about something he regrets.",
            "Rachel's first...",
            "A glee club member has a date with an LGBT character.",
            "Rachel gives Finn hell.",
            "Something happens that relates to Rachel and Finn's relationship.",
            "Blaine and Kurt stay distant."
        ],
        [
            "1x14",
            "He makes out with Shelby",
            "Rachel's mother, Shelby, makes her first appearance.",
            "Finn goes on a date with Brittany and Santana.",
            "She sings Gives You Hell to him.",
            "They start dating then break up.",
            "N/A"
        ],
        [
            "2x14",
            "He drunk-dials Sue",
            "Rachel's first time having a party and drinking alcohol.",
            "Rachel goes on a date with Blaine.",
            "She hangs all over him while drunk.",
            "Rachel is needy to him when drunk, claiming she will do \"anything\" for him.",
            "Blaine doubts about his sexuality and this leads to a confrontation between him and Kurt."
        ],
        [
            "3x14",
            "He reveals he contemplated suicide.",
            "Rachel's first wedding.",
            "N/A",
            "She makes him angry about the nude photo Sebastian made of him.",
            "They almost get married.",
            "N/A"
        ],
        [
            "4x14",
            "He regrets leaving Emma with all the planning for the wedding and dismissing her stress.",
            "Rachel's first pregnancy scare.",
            "Tina attends Will and Emma's wedding with Blaine.",
            "She mentions her and Brody moving in together.",
            "After singing We've Got Tonite, they have sex and Rachel has a pregnancy scare.",
            "Kurt and Blaine are together in Will and Emma's wedding but stay \"just friends.\""
        ],
        [
            "5x14",
            "N/A",
            "Rachel's first own chauffeur",
            "N/A",
            "N/A",
            "N/A",
            "Blaine moves with Kurt and they realize they can't get enough self space, so Blaine moves out."
        ]
    ],
    "pageTitle": "Season Parallels - Glee Wiki",
    "title": "",
    "url": "http://glee.wikia.com/wiki/Season_Parallels?page=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 13,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 104818535,
    "recordOffset": 104758509,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{154745=2011, 224846=April joins New Directions and wins them over (The Rhodes Not Taken), 155022=2015, 150312=2010, 178771=April in Last Name (The Rhodes Not Taken), 228389=Jan to Liz (All or Nothing), 225015=April helps them with Fleetwood Mac week (Rumours), 142533=2011, 150391=2011, 142329=2009, 142743=2014, 219628=Brody on Cassandra July, 221525=Maybe This Time with April - Audition for New Directions (The Rhodes Not Taken), 142654=2012, 154826=2012, 150565=2013, 142434=2010, 150482=2012, 154929=2013}",
    "lastModified": "Thu, 16 Jul 2015 08:03:54 GMT",
    "textBeforeTable": "Episode One Episodes [show] Contents Comments183 History Edit pages on this wiki 1,743 Season Parallels Recent changes Random page Watchlist Wiki Activity Add a Page Add a Photo Add a Video Contribute Birthdays Suggestion Box Wiki Awards Glee Wiki Update",
    "textAfterTable": "Puck and Lauren Someone gets a slushie in the face. Rachel Kurt Finn Marley N/A Unique A new faculty member is introduced. Will Sue Shannon Beiste Nancy Bletheim Cassandra July N/A Janet Millie Rose A faculty member is accused of doing something inappropriate. Sandy is accused for touching Hank inappropriately Beiste is falsely accused of touching Brittany inappropriately N/A Cassandra is accused of being drunk in class. Figgins is accused of various misdeeds that were planted by Sue. N/A A male member of the glee club has left. N/A Matt Sam Rory Joe (possibly) N/A A song is sung in the courtyard. N/A Empire State of Mind It's Not",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}