{
    "relation": [
        [
            "Video",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            "Link",
            ""
        ],
        [
            "Date",
            "4/8/2015",
            "3/21/2015",
            "2/16/2015",
            "1/29/2015",
            "12/18/2014",
            "11/29/2014",
            "10/6/2004",
            "9/26/2014",
            "9/3/2014",
            "8/23/2014",
            "8/6/2014",
            ""
        ],
        [
            "Race",
            "Federico Tesio Stakes",
            "Private Terms Stakes",
            "Miracle Wood Stakes",
            "Frank Whiteley Jr Stakes",
            "AlwOC",
            "Remsen Stakes - G2",
            "AlwOC",
            "MSW",
            "MSW",
            "MSW",
            "MSW",
            ""
        ],
        [
            "Track",
            "Pimlico",
            "Laurel Park",
            "Laurel Park",
            "Laurel Park",
            "Laurel Park",
            "Aqueduct",
            "Laurel Park",
            "Laurel Park",
            "Delaware Pk",
            "Timonium FG",
            "Penn National",
            ""
        ],
        [
            "Distance",
            "1 1/16m",
            "1 1/8 m",
            "1 mile",
            "7 f",
            "1 mile",
            "1 1/8 m",
            "1 mile",
            "1 1/16 m",
            "5 f",
            "6 1/2 f",
            "5 1/2 f",
            ""
        ],
        [
            "Finish",
            "1",
            "2",
            "4",
            "4",
            "1",
            "5",
            "3",
            "1",
            "3",
            "3",
            "3",
            ""
        ]
    ],
    "pageTitle": "TBA 4 | 2016 Preakness",
    "title": "",
    "url": "http://www.preakness.com/race-info/contenders/6/TBA%204?page=0%2C1&quicktabs_1=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00233-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 658610793,
    "recordOffset": 658594399,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11140=            A sophomore son of Student Council, Bodhisattva could become the second straight California-bred horse to win the Preakness, following 2014 Horse of the Year California Chrome. The last previous Cal-bred to take the middle jewel of the Triple Crown was Snow Chief in 1986., 10452=            It was the fourth straight stakes race and fifth overall for the chestnut, who was unable to catch winner Bridget’s Big Luvy in the 1 1/8-mile Private Terms March 21 after giving up the lead and fading to fourth in the one-mile Miracle Wood February 16., 9662=            Maryland-bred Deputed Testamony in 1983 is the only Tesio winner to repeat in the Preakness. In all, 18 of 33 Tesio winners have gone on to the Preakness including Kid Cruz, who was eighth in 2014., 10795=            Bodhisattva, which in Buddhism means ‘enlightened being,’ made his Pimlico debut in the 1 1/16-mile Federico Tesio April 18, rallying after giving up the lead in mid-stretch to defeat Noteworthy Peach in Old Hilltop’s traditional Preakness prep.}",
    "TableContextTimeStampAfterTable": "{13171=            As a trainer, Corrales has won more than 250 races including highs of 59 victories in 2011 and $1,027,906 in purse earnings in 2014. , 2034=2/16/2015, 9042=            Maryland’s leading rider in 2014 with 167 victories at Laurel Park and Pimlico, the Delaware native will celebrate his 21st birthday on Preakness day, May 16., 2621=1/29/2015, 12753=            Corrales was introduced by Sipp to Andy Stronach, son of Eclipse Award-winning owner and breeder Frank Stronach, whose racetrack holdings including Pimlico and Laurel Park. In 2011, Andy Stronach asked Corrales if he would like to train for his father and now handles nearly 30 horses for the family in addition to other clients., 861=4/8/2015, 9966=            He won 11 of 143 races in 2012 before riding 140 winners from 919 mounts in 2013, his first full season as a pro. Last year, McCarthy finished with 263 victories from 1,389 mounts and more than $8.1 million in purse earnings, including his first two graded stakes victories: the Boiling Springs (G3) with Munirah and the Delaware Oaks (G2) with Fortune Pearl., 11612=            Born in Panama, the 55-year-old Corrales came to the United States in 1976 as a jockey and won 1,031 of 6,860 races in North America between 1981 and 1993, reaching career highs of 206 victories and $972,180 in purse earnings in 1988., 11910=            After riding without much success and dealing with weight issues, Corrales moved his tack to Washington state in 1984 on the advice of fellow rider and now trainer Wesley Ward, who would go on to win the Eclipse Award as top apprentice that year. In 1985, Corrales set a record with 138 wins at Playfair Race Course in Spokane, and followed up with 190 in 1986., 9275=            McCarthy is the son of retired jockey Mike McCarthy, a highly respected rider who won 2,907 races from 1982-2002 riding mostly on the Mid-Atlantic circuit. Trevor knew he wanted to be a jockey at the age of 6 and began tailing his father to the barn when he turned to training., 6081=8/23/2014, 31602=© 2016, 3783=11/29/2014, 1446=3/21/2015, 10414=            McCarthy broke his wrist in a December 20 spill at Laurel Park and didn’t return until mid-March at Gulfstream Park., 6658=8/6/2014, 3209=12/18/2014, 16104=            Adena Springs has earned seven Eclipse Awards as outstanding breeder (2004-08, 2010-11) while Frank Stronach also won in 2000. Stronach (1997-99) and Adena (2005-08, 2010) has also been recognized as outstanding breeder in Canada with           eight Sovereign Awards., 16506=            The Stronach family and Adena Springs have bred and/or campaigned more than 200 stakes winners, including winners of two of the three U.S. Classic races and all three classics in Canada. Among the runners are 12 champions in two countries, including Horse of the Year and Hall of Famer Ghostzapper and 2007 Eclipse champion Ginger Punch., 9641=            After galloping horses for Fair Hill, Md.-based trainer Graham Motion while in high school, Trevor McCarthy made his professional debut at Pimlico in the spring of 2011 and finished the year with one win and won second from five starts., 5512=9/3/2014, 4367=10/6/2004, 4940=9/26/2014}",
    "lastModified": "Tue, 04 Aug 2015 01:24:49 GMT",
    "textBeforeTable": "Past Performances ›› 2 of 3 ‹‹ 9/26/2014 10/16/2014 11/29/2014 12/18/2014 ›› 1 of 2   Jim McCue photo Jim McCue photo Jim McCue photo",
    "textAfterTable": "Jockey Trevor McCarthy             Maryland’s leading rider in 2014 with 167 victories at Laurel Park and Pimlico, the Delaware native will celebrate his 21st birthday on Preakness day, May 16.             McCarthy is the son of retired jockey Mike McCarthy, a highly respected rider who won 2,907 races from 1982-2002 riding mostly on the Mid-Atlantic circuit. Trevor knew he wanted to be a jockey at the age of 6 and began tailing his father to the barn when he turned to training.             After galloping horses for Fair Hill, Md.-based trainer Graham Motion while in high school, Trevor McCarthy made his professional debut at Pimlico in the spring of 2011 and finished the year with one win and won second from five starts.             He won 11 of 143 races in 2012 before riding 140 winners from",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}