{
    "relation": [
        [
            "Ano",
            "1965",
            "1965",
            "1966",
            "1967",
            "1968",
            "1969",
            "1969",
            "1969",
            "1969",
            "1970",
            "1971",
            "1971",
            "1972",
            "1972"
        ],
        [
            "Single",
            "\"The Girl On the Billboard\"",
            "\"The Belles of the Southern Belle\"",
            "\"Women Do Funny Things to Me\"",
            "\"A Dime At a Time\"",
            "\"Looking At the World Through a Windshield\"",
            "\"Good Time Charlie's\"",
            "\"Be Glad\"",
            "\"There Wouldn't Be a Lonely Heart In Town\"",
            "\"Workin' Like the Devil For the Lord\"",
            "\"A Lover's Question\"",
            "\"Philadelphia Fillies\"",
            "\"Dozen Pairs of Boots\"",
            "\"Crying In the Rain\"",
            "\"But I Do\""
        ],
        [
            "Álbum",
            "The Girl On the Billboard",
            "The Girl On the Billboard",
            "Doodle-Oo-Doo-Doo",
            "Our Way of Life",
            "Looking At the World",
            "Down At the Goodtime Charlie's",
            "Down At the Goodtime Charlie's",
            "Big Daddy Del",
            "Friends and Neighbors",
            "The Best 2",
            "Del Reeves",
            "Del Reeves",
            "His Greatest Hits",
            "His Greatest Hits"
        ],
        [
            "U.S. Country",
            "#1",
            "#4",
            "#9",
            "#12",
            "#5",
            "#3",
            "#5",
            "#12",
            "#33",
            "#14",
            "#9",
            "#31",
            "#54",
            "#65"
        ],
        [
            "U.S. Pop",
            "#96",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Del Reeves – Wikipédia, a enciclopédia livre",
    "title": "",
    "url": "https://pt.wikipedia.org/wiki/Del_Reeves",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865406515,
    "recordOffset": 865394253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13357=Franklinn Delano \"Del\" Reeves (Sparta, Carolina do Norte, 14 de Julho de 1932 - 1 de Janeiro de 2007) foi um cantor de música country norte-americano, mais conhecido pelas suas canções da década de 1960. Tornou-se num dos cantores masculinos de Country dessa década. Reeves deveu o seu nome ao presidente Franklin Delano Roosevelt, que fora nomeado pelo Partido Democrático para ser o seu candidato a presidente alguns dias antes do nascimento do cantor., 2476=Del Reeves morreu aos 74 anos, devido a um enfisema pulmunar, no Dia de Ano Novo de 2007., 6651=O seu sucesso continuou ao durante o resto da década de 1960. Canções que se tornaram hits nesta época são \"Be Glad\" e \"Good Time Charlie's.\", 7961=Tudo começou a mudar quando Reeves assinou contrato com a United Artists Records. O trabalho que ele fez para a \"United Artists\" é provavelmente o seu trabalho mais conhecido. Ele finalmente conseguiu um bom score com o seu êxito de 1961, \"Be Quiet Mind\". Mais tarde, em 1965, teve o seu primeiro #1 hit nas tabelas, com \"The Girl on the Billboard\". O seu seguinte, \"The Belles of the Southern Belle\" fez o \"Country Top Five\". Durante esta época, ele e a sua esposa tornaram-se numa equipa de escrita de canções. O duo escreveu canções para as preferências de Rose Maddox, Carl Smith e Roy Drusky, para nomear alguns., 9751=Del Reeves é provavelmente melhor conhecido pela sua cota de êxitos da década de 1960. Ele provou que se podia tornar num cantor country pelas suas próprias qualidades e ter sucesso, com canções como \"The Girl on the Billboard\" e \"The Belles of Southern Bell\", ambas pontos altos da sua carreira. Reeves foi um excelente vocalista e podia cantar mais que melodias de novidade como provou com a sua \"Looking at the World through a Windshield\" de 1968., 9109=Em 1954, assinou um contrato com a Capitol Records. Mais tarde, ainda na década de 1950, gravou para a Decca Records, tal como para a Reprise Records e a Columbia Records., 5073=O seu último grande sucesso foi em \"The Philadelphia Fillies.\" A sua carreira entrou em declínio em meados da década de 1970 e a partir de então começou a sair lentamente da música country. De qualquer forma, ele gravou alguns duetos com Billie Jo Spears em 1976., 3905=Em 1979, deixou a sua carreira musical para prosseguir uma carreira como executivo musical. De facto, ele desempenhou um grande papel na assinatura de Billy Ray Cyrus. Reeves continuo a gravar na década de 1980, embora menos que noutras épocas e para pequenas editoras., 3441=Del Reeves juntou-se ao Grand Ole Opry em 1966, onde continuou a actuar até aos seus últimos anos. A sua última actuação na Opry foi em Agosto de 2002., 5719=Na década de 1970, cortou uma série de duetos com Bobby Goldsboro e Penny DeHaven. Também regressou à televisão, apresentando o programa, Del Reeves' Country Carnival.}",
    "lastModified": "Sun, 05 Jul 2015 07:16:49 GMT",
    "textBeforeTable": "Singles[editar | editar código-fonte] Discografia[editar | editar código-fonte] Foi-lhe dado o apelido de The Doodle-Oo-Doo-Doo Kid por ele acrescentar a frase \"doodle-oo-doo-doo\" aos seus vocais e linhas de guitarra em muitas das suas canções. Del Reeves deu créditos a bem-conhecidos e lendários cantores country como Ernest Tubb, Roger Miller e Johnny Cash como as maiores influências para a sua carreira musical. Trivialidades[editar | editar código-fonte] Del Reeves morreu aos 74 anos, devido a um enfisema pulmunar, no Dia de Ano Novo de 2007. Morte[editar | editar código-fonte] Del Reeves juntou-se ao Grand Ole Opry em 1966, onde continuou a actuar até aos seus últimos anos. A sua última actuação na Opry foi em Agosto de 2002. Em 1979, deixou a sua carreira musical para prosseguir uma carreira como executivo musical. De facto, ele desempenhou um grande papel na assinatura de Billy Ray Cyrus. Reeves continuo a gravar na década de 1980, embora menos",
    "textAfterTable": "Álbuns seleccionados[editar | editar código-fonte] Ano Álbum 1965 The Girl On the Billboard 1965 Doodle-Oo-Doo-Doo 1966 Sings Jim Reeves 1966 Special Delivery 1966 Santa's Boy 1967 Stuttin' My Stuff 1967 The Little Church In the Dell 1967 Our Way of Life 1968 The Best 1968 Looking At the World 1969 Wonderful World of Country Music 1969 Down At the Goodtime Charlie's 1969 Friends and Neighbors 1970 Big Daddy Del 1970 Country Concert 1970 The Best 2 1971 Del Reeves 1972 Before Goodbye 1973 Trucker's Paradise 1974 Live At the Palomino Club 1974 The Very Best 1975 With Strings and Things 1976 By Request (com Billie Jo Spears) 1976 10th Anniversary 1980 Let's Got to Heaven Tonight",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}