{
    "relation": [
        [
            "Funds",
            "Destra Preferred and Income Securities",
            "Destra Preferred and Income Securities",
            "Destra Preferred and Income Securities",
            "Destra Focused Equity",
            "Destra Focused Equity",
            "Destra Focused Equity",
            "Destra Dividend Total Return",
            "Destra Dividend Total Return",
            "Destra Dividend Total Return"
        ],
        [
            "Share Class",
            "A",
            "I",
            "C",
            "A",
            "I",
            "C",
            "A",
            "I",
            "C"
        ],
        [
            "Ordinary Income Distribution",
            "0.1053",
            "0.1090",
            "0.0953",
            "-",
            "-",
            "-",
            "0.1252",
            "0.1402",
            "0.0890"
        ],
        [
            "Short-Term Capital Gain",
            "-",
            "-",
            "-",
            "0.2580",
            "0.2580",
            "0.2580",
            "0.0795",
            "0.0795",
            "0.0795"
        ],
        [
            "Long-Term Capital Gain",
            "-",
            "-",
            "-",
            "0.2049",
            "0.2049",
            "0.2049",
            "0.1583",
            "0.1583",
            "0.1583"
        ],
        [
            "Total Distribution",
            "0.1053",
            "0.1090",
            "0.0953",
            "0.4629",
            "0.4629",
            "0.4629",
            "0.3630",
            "0.3780",
            "0.3267"
        ]
    ],
    "pageTitle": "Destra Funds Declare their Year-End Distributions",
    "title": "",
    "url": "http://destracapital.com/news/destra-funds-declare-their-quarterly-distributions4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 68342735,
    "recordOffset": 68334636,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3567=Lisle, IL, December 27th, 2013 – The Destra Funds distributed by Destra Capital Investments LLC are pleased to announce the declaration of their year-end distributions. The table below summarizes the distribution schedule for each Fund declaring a distribution. The distributions will be paid on December 30, 2013 to shareholders of record as of December 26, 2013, with an ex-dividend date of December 27, 2013.}",
    "textBeforeTable": "Lisle, IL, December 27th, 2013 – The Destra Funds distributed by Destra Capital Investments LLC are pleased to announce the declaration of their year-end distributions. The table below summarizes the distribution schedule for each Fund declaring a distribution. The distributions will be paid on December 30, 2013 to shareholders of record as of December 26, 2013, with an ex-dividend date of December 27, 2013. December 27, 2013 Destra Funds Declare their Year-End Distributions advisors literature and prospectus breakpoints funds partners people investors advisor login latest news contact us funds about home Destra Capital Investments   TERMS AND CONDITIONS You have represented that you are visiting this site as an Investment Advisor and by confirming this representation above, you acknowledge that you will be shown information intended",
    "textAfterTable": "Past performance is not indicative of future performance. To the extent any portion of the distribution is estimated to be sourced from something other than income, such as return of capital, the source would be disclosed on a Section19(a)-1 letter located on the under the \"Literature\" tab. A distribution rate that is largely comprised of sources other than income may not be reflective of the Fund’s performance. Destra Capital Investments LLC is an investment distributor that specializes in connecting financial advisors with original and differentiated strategies. Destra partners with premier institutional investment managers who are uniquely positioned to pursue superior performance while seeking to manage downside risk. The company’s strategies are currently available through sub-advised mutual funds. Destra is headquartered in Lisle, IL. Destra Capital Advisors LLC, the investment adviser to the Funds, is an affiliate of Destra Capital Investments. Destra Capital Investments does not offer tax advice. The tax information contained herein is general and is not exhaustive by nature. It was not intended or written to be used, and it cannot be used by any taxpayer, for the purpose of avoiding penalties that may be imposed on the taxpayer under U.S. federal tax laws. Federal and state tax laws are complex and constantly changing. Please consult your tax professional or financial adviser for more information regarding your tax situation. All funds involve risk and investors should consider the investment objective and policies, risk considerations, charges and ongoing expenses of an investment carefully",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}