{
    "relation": [
        [
            "Trade Date",
            "10/7/98",
            "9/8/97",
            "11/14/97",
            "7/28/00",
            "4/13/98"
        ],
        [
            "# Shares",
            "39.8147",
            "54.2636",
            "17.424",
            "8.2519",
            "8.52"
        ],
        [
            "Ticker",
            "MEL",
            "INTC",
            "JNJ",
            "PEP",
            "CPB"
        ],
        [
            "Cost/Share",
            "35.51",
            "24.92",
            "81.00",
            "47.51",
            "53.69"
        ],
        [
            "Price",
            "42.71",
            "30.40",
            "96.76",
            "44.24",
            "30.30"
        ],
        [
            "Total % Ret",
            "23.83%",
            "22.55%",
            "22.28%",
            "(6.36%)",
            "(39.59%)"
        ]
    ],
    "pageTitle": "Fool.com: Low-Cost Investing Options [Drip] May 3, 2001",
    "title": "",
    "url": "http://www.fool.com/dripport/2001/dripport010503.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 18,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990177.43/warc/CC-MAIN-20150728002310-00261-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 452880067,
    "recordOffset": 452863673,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18545=Because these commissions add up ($6.99 per month comes to $83.88 per year, and then compound that at 11% annually to see what you're potentially losing), I would use these programs primarily to buy stocks that you believe will aggressively outperform the S&P 500 index fund, as well as outperform stocks that you can buy in free Drip accounts. And those may be difficult to find. Johnson & Johnson, which has a free Drip, has grown sales and net income 10.5% annualized over the past 100 years, while the stock has risen 19% annualized since it went public in 1944., 10563=You know when you receive your credit card statement and you can't believe how all those little charges add up to such a large total bill? Investing commissions add up that way, too, until eventually they can eat several percentage points from your annual return. Over many years, commissions can amount to tens of thousands of dollars -- lost -- or even more. Low-cost investing is a way to avoid these costs, and helps you achieve above-average returns. There are several ways to invest smartly, simply, and inexpensively. Many investors begin to invest with modest sums of money, and would like to add more money (whatever they can afford) to the stock market every month, averaging into holdings. Did you know that you can invest this way for very low ongoing costs, or almost no cost at all? Today we outline some low-cost investing options available to you. We do not include stuffing money in your mattress as a low-cost option, or the piggy bank -- both lose to inflation. The S&P 500 index fund This little beauty can be your friend for life. It almost certainly won't betray or disappoint you if you give it enough time, and it will likely make you wealthy over decades. $10,000 invested in the S&P 500 fifty years ago is worth more than $5 million today. The S&P 500 index has returned approximately 11% annualized, with dividends reinvested, since 1926. A majority of managed mutual funds consistently under-perform the S&P 500 index fund partly because they charge fees of a few percentage points annually. The best S&P 500 index funds charge annual fees as low as 0.18%. That's what Vanguard recently charged for its S&P index fund -- it's the cheapest index fund provider that we know. Plus, did you know that some index funds let you begin with as little as $500 if you agree to automatically invest $50 monthly? Offers differ, but most investment service companies now provide S&P 500 index funds. Just make sure that all the fees involved in an index fund don't add up to more than about 1% of your investment. Also, if you're putting this money away for retirement, consider opening your account as a tax-benefited IRA. Talk about low cost, low worry, relatively low long-term risk, and great long-term potential! The S&P index fund is strategy enough for most investors. Other index funds The S&P index fund is the tip of the iceberg. Hundreds of other index funds exist, from high-tech funds to electric utility funds. Just be careful. The point of buying an index fund is to keep your risk and cost low while optimizing returns. Buying pure sector funds can result in long-term routs and involve higher fees. That said, if you believe in an industry such as biotechnology, for instance, you might want to continue putting 90% of your money into the S&P 500 index, and the other 10% in a diversified (25 to 40 stock) biotech index fund. Ideally, concentrating some money in an especially promising industry could handsomely boost your return by the time you're ready to sail into the sunset. Ask your investment service provider about its array of index funds, and, again, look at the fees involved. For more on index funds, see the Fool's index fund center. Direct Stock Purchase and Dividend Reinvestment Plans (Drips) So far, these plans have been the Drip Port's sole investment vehicle, and they've served us exceptionally well. More than 1,200 companies offer dividend reinvestment or direct stock purchase programs, whereby you buy stock direct from the company, typically at zero commission. All of our active Drip accounts -- Intel (Nasdaq: INTC), Johnson & Johnson (NYSE: JNJ), Pepsi (NYSE: PEP) and Mellon Financial (NYSE: MEL) -- allow us to make minimum monthly investments ranging from $25 to $100 without any commission. These plans usually mean that you can invest whatever money you can and buy partial shares, without any onetime cost or ongoing cost. Most of these plans also reinvest dividends without charge. To enroll in Drips, you typically need to be a registered shareholder of one share of the company's stock. There are various ways to buy your first share (and there are hundreds of companies to choose from), as we explain here. Plans vary, so get details on each company plan. Some have fees, which should be avoided., 15999=Owning a few free Drips could complement your S&P 500 index fund investment. Or, if you're really up on your knowledge, an investment strategy consisting of a handful of Drips alone could work well for you. You'll keep costs very low. Low-cost, specialized brokerage services In the past 18 months, two new services in particular have launched to offer low-cost investing. One is ShareBuilder and the other is BUYandHOLD. If you want to regularly buy individual stocks that don't offer Drips, which includes most high-tech leaders such as Microsoft (Nasdaq: MSFT) or Dell (NYSE: DELL), then these brokerages may be your best bet. BUYandHOLD requires only $20 to open an account and provides free IRA accounts, too. ShareBuilder has no minimum balance to start. Both allow you to buy fractional shares of stock in small to large amounts; both provide free dividend reinvestment; and both provide automatic investment plans, whereby money is automatically invested in various stocks that you choose on a set schedule. That's convenient. What do these services cost? Yesterday, BUYandHOLD announced a change to its cost structure. Starting June 1, BUYandHOLD will cost $14.99 per month for as many trades as you wish, or $6.99 per month, which allows you two trades per month. To keep this ongoing $6.99 monthly commission reasonable (meaning at around 2% of your investment amount at the most), you need to invest at least $350 per month. If you invest at least twice monthly, two trades for $6.99 is lower than you find at other discount brokers, and if you trade more than twice monthly under the $6.99 plan, each additional trade is $2.99. The company makes trades three times daily.}",
    "textBeforeTable": "5/3/01 as of ~8:30:00 PM EDT Drip Portfolio Jeff Fischer owns the stocks in the Drip Portfolio, four of which were mentioned above. He's been known to reuse gift wrapping paper. The Motley Fool has a full disclosure policy. Remember to invest as regularly as you can, keep your costs to a minimum to maximize your returns, and adhere to a long-term strategy that you enjoy. Until next time, stay cheap! So, unless you believe that you're buying the next Microsoft or Dell early, sticking with index funds or free Drips in great companies will probably reward you more than buying more speculative companies and paying",
    "textAfterTable": "Overall Return -- total % Gained (Lost)   Day Week Month Year To Date Since Inception (7/28/1997) Drip (0.96%) 1.18% 0.90% (6.74%) 15.50% Comparable S&P 500 n/a n/a n/a n/a 7.00% S&P 500 (1.49%) (0.36%) (0.07%) (5.43%) 33.00% S&P 500 (DA) (1.46%) (0.35%) (0.07%) (5.33%) 35.62% NASDAQ (3.35%) 3.40% 1.42% (13.13%) 36.74% Internal Rate of Return -- Annualized Rate of % Gained (Lost)   Since Inception (7/28/1997) Drip 6.91% vs. S&P 500 3.27%",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}