{
    "relation": [
        [
            "Platform",
            "Windows and Mac OS",
            "Windows and Mac OS",
            "Windows",
            "Windows",
            "Windows"
        ],
        [
            "Software Title",
            "JMP",
            "SPSS",
            "SAS",
            "Stata",
            "SUDAAN"
        ],
        [
            "Version",
            "10",
            "22",
            "9.4",
            "11",
            "10"
        ],
        [
            "Available in Labs",
            "Software is installed in all Hunter College Public Computer Labs throughout the college.",
            "Software is installed in all Hunter College Public Computer Labs throughout the college.",
            "Software is installed in many Hunter College Public Computer Labs throughout the college.",
            "Software is installed in some Hunter College Computer Labs.",
            "Software is installed in some Hunter College Computer Labs."
        ],
        [
            "Free for Students",
            "JMP is a site license software package available to all Hunter College Students. Download is available here.",
            "SPSS Grad Pack is a discounted version of SPSS for Students. Click here for details about purchasing the SPSS Grad Pack.",
            "No",
            "No",
            "No"
        ],
        [
            "Free for Staff",
            "JMP is a site license software package available to all Hunter College Staff. Download is available here.",
            "SPSS is available for all Hunter College CUNY Tagged Staff computers. Staff can use SPSS off-campus by using the built in Commuter License Checkout Feature.",
            "Contact the Help Desk to request an install on a Hunter College CUNY Tagged computer",
            "Contact the Help Desk to request a Price Quote",
            "Contact the Help Desk to request a Price Quote"
        ],
        [
            "Free for Faculty",
            "JMP is a site license software package available to all Hunter College Faculty. Download is available here.",
            "SPSS is available for all Hunter College CUNY Tagged Faculty computers. Faculty can use SPSS off-campus by using the built in Commuter License Checkout Feature.",
            "Contact the Help Desk to request an install on a Hunter College CUNY Tagged computer",
            "Contact the Help Desk to request a Price Quote",
            "Contact the Help Desk to request a Price Quote"
        ],
        [
            "Where to get Software",
            "JMP is a site license software package available to all Hunter College Faculty, Staff and Students. Download is available here.",
            "Contact the Help Desk to request an install on a Hunter College CUNY Tagged computer.",
            "Contact the Help Desk to request an install on a Hunter College CUNY Tagged computer.",
            "Contact the Help Desk to request a Price Quote",
            "Contact the Help Desk to request a Price Quote"
        ]
    ],
    "pageTitle": "Software — Hunter College",
    "title": "",
    "url": "http://www.hunter.cuny.edu/it/it-services/software",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 503116411,
    "recordOffset": 503098909,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  Core Software Some licenses have additional rights relating to home use - see the notes at the end of the table where this is indicated. Statistics Security Scientific Qualitative Office & Productivity Music Mathematics Geography Art & Media Core Software Jump to a section: audience::Faculty topic::Top 10 services for faculty, audience::Staff, topic::Top 10 services for students, audience::Students, topic::Top 10 services for staff, topic::Software, — filed under: Software Info  ",
    "textAfterTable": "Windows and Mac OS RealPlayer 16 Software is installed in all Hunter College Public Computer Labs throughout the college. Available to everyone as a Free Download Windows Windows Media Player 11 Software is installed in all Hunter College Public Computer Labs throughout the college. Available to everyone as a Free Download Windows and Mac OS Adobe Flash Player Latest Release Software is installed in all Hunter College Public Computer Labs throughout the college. Available to everyone as a Free Download Windows and Mac OS Apple Quicktime Latest Release Software is installed in all Hunter College Public Computer Labs throughout the college. Available to everyone as a Free Download Windows and Mac OS Adobe Reader XI Software is installed in all Hunter College Public Computer Labs throughout the college. Available to everyone as a Free Download Windows and Mac OS McAfee 8.8 Software is installed in all Hunter College Public Computer Labs throughout the college. Available as a free download from the CUNY Portal",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}