{
    "relation": [
        [
            "Sr.",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "",
            ""
        ],
        [
            "Room Type",
            "Executive Room",
            "Semi Deluxe",
            "Deluxe",
            "Amrta Suite",
            "Amrta Suite Deluxe",
            "Extra Guest",
            "",
            ""
        ],
        [
            "Single",
            "1350/-",
            "1600/-",
            "1850/-",
            "2350/-",
            "2600/-",
            "450 / Person",
            "",
            ""
        ],
        [
            "Double",
            "1600/-",
            "1850/-",
            "2100/-",
            "2600/-",
            "2850/-",
            "",
            "",
            ""
        ],
        [
            "",
            "Centrally Air Cooled",
            "AC",
            "AC",
            "AC",
            "AC",
            "Per Person",
            "",
            ""
        ]
    ],
    "pageTitle": "Hotel in Nagpur | Budget Hotel in Nagpur | Best Hotel In Nagpur | Two Star Hotel In Nagpur |Chip Rates Hotels Nagpur | nagpur tour | hotels in nagpur india | Amrta Hotel Nagpur",
    "title": "",
    "url": "http://hotelamrta.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 116744357,
    "recordOffset": 116736155,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "  It is for all classes a luxurious stay with all amenties but still reasonably priced Single, Double rooms, Centrally Air Cooled, Air Conditioned rooms and suite rooms also. (27 Centrally Air Cooled Room, 7 Deluxe Air Conditioned rooms & 8 Air Conditioned Suite.) The hotel not only offers facilities like pick-up & drop from station / airport / bus-stand, self direct facility. TV with multiple satellite channels but also facility like same day laundry, doctor on call, luxury taxi's for your transport, travel desk management services and 24 hrs Check out facility. We have a Multi Cuisine/ Veg Cuisine Restaurant which we have dedicated to our HOTEL AMRTA guest only. It offers a wide range of pure – Multi Cuisine/ Veg Cuisine from each & every part of the country. We also have an open terrace restaurant for you to enjoy a breezeful night dinner.The great advantage of hotel amrta is once you enter the hotel you are at home and when come out of the hotel you are in the best and the most popular market area of Nagpur. The most",
    "textAfterTable": "FACILITIES Centrally located in heart of the City. 1.5 k.m. from the Railway Station, and 6 k.m. from Airport. All Rooms Air Conditioned or Centrally Air Cooled. Elevator for all floors. Attached Bathroom with Hot and cold Water round the Clock. Doctor on call. Laundry & dry cleaning, same day services. Luxury Taxis available on request.   View Details   Hotel in Nagpur  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}