{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Not the university price but the teachers are phenomenal!",
            "It is located right by El Cariso Park; which has workout areas and marked running paths.",
            "It is close by to everything! Panda Express, Dennys, Mc Donalds, etc.",
            "No dorms, but plenty of homes around the area are renting out to Mission students.",
            "The introduction classes are pretty easy but the general courses are demanding and you learn a lot. Do not expect to breeze through them!",
            "Learn the staff by name and they will remember you too! It is not what you know, it is WHO you know and they will help you when you need it!",
            "Los Angeles Mission College is like a small town, everyone knows everyone. Everyone is very helpful and enjoys working with students to help them achieve their goals. The staff really has a good hold on what they are expected of."
        ]
    ],
    "pageTitle": "Los Angeles Mission College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Los-Angeles-Mission-College/reviews?_escaped_fragment_=/show/28682",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892095683,
    "recordOffset": 892071152,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78644=The people there are really friendly and open. Sylmar is not really a huge place for hanging out, but there are gyms, parks, and other places to go. Also there are malls about 15 minutes away., 87373=Los Angeles Mission College is a small college that is surrounded by the Sylmar Mountains. The college is perfect for those who are not ready to attend a four year university in terms of undecided major, low tuition, or simply want to save money on their education. This college also improved in terms of education due to the addition of their S.T.E.M. Center building., 97470=© 2015, Cappex.com, LLC, 56963=We have a new caffeteria just opened in 2012 with very good proportioned healthy food. There is a wide variety of choices from pizza, salads,chicken etc.}",
    "textBeforeTable": "07/13/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 26 Sydney from Lake View Terrace, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Campus Safety very peaceful campus Great for these types of students Interested in Culinary arts . Share any unusual traditions or locations on campus there is always a fee market on Sundays i believe ,and during school hours, on the field, they also have some people outside selling merchandise Bang for the buck fair pricing cant complain especially if you have fafas help. What to do for fun There's a big park right next to it where you can swim have a cook out and there's also a golf course on the other side. Then the school have a great big gym; very state of the art . Food and Dining Delicious cafeteria Dorm Life no dorms Tips for prospective students Classes are not expensive and the new campus is beautiful. I will continue to go there In three sentences A very laid back environment i would give it 4 out of 5 in rating.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}