{
    "relation": [
        [
            "Address/ Res/Fam",
            "My. R./18/18",
            "",
            "",
            "So.RR/19/19",
            "",
            "",
            "",
            "",
            "",
            "Mardis Ferry Rd./30/30",
            "",
            ""
        ],
        [
            "Name",
            "William S. Gwin",
            "Kate L. Gwin",
            "Peter K. Gwin",
            "Marion B. Vardaman",
            "Mattie B. Vardaman",
            "John S. Vardaman",
            "Kathleen Vardaman",
            "Margie Vardaman",
            "Thad Vardaman",
            "George V. Hebb",
            "Clint Hebb",
            "Sallie B. Hebb"
        ],
        [
            "Relat. 2HoH",
            "head",
            "dau",
            "son",
            "head",
            "wife",
            "son",
            "dau",
            "dau",
            "son",
            "head",
            "bro",
            "sis"
        ],
        [
            "Race/ Sex",
            "wm",
            "wf",
            "wm",
            "wm",
            "wf",
            "wm",
            "wf",
            "wf",
            "wm",
            "wm",
            "wm",
            "wf"
        ],
        [
            "Age",
            "61",
            "35",
            "21",
            "41",
            "36",
            "11",
            "8",
            "7",
            "4",
            "50",
            "52",
            "42"
        ],
        [
            "MStat/ YrsMd",
            "wd",
            "s",
            "s",
            "m1/14",
            "m1/14",
            "s",
            "s",
            "s",
            "s",
            "s",
            "s",
            "s"
        ],
        [
            "ChBn/ ChLvg",
            "",
            "",
            "",
            "",
            "4/4",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "POB S/F/M",
            "AL/AL/AL",
            "AL/AL/England",
            "AL/AL/England",
            "AL/AL/AL",
            "AL/AL/SC",
            "AL/AL/AL",
            "AL/AL/AL",
            "AL/AL/AL",
            "AL/AL/AL",
            "TN/VA/KY",
            "TN/VA/KY",
            "TN/VA/KY"
        ],
        [
            "Occupation/ profession",
            "O.I.",
            "",
            "Railroad Tel. operator",
            "Railroad foreman",
            "",
            "",
            "",
            "",
            "",
            "farmer",
            "farm laborer",
            "none"
        ],
        [
            "John M. Gwin Comments",
            "This is William Sutton Gwin, my g-grandfather. I have no idea what the initials \"O. I.\" are for. This was his last census.",
            "Kate Lula Gwin",
            "Peter King Gwin",
            "I have no idea who these people are, but it is interesting that they are living next door to my g-grandfather, whose son, James Basset Gwin, would marry Adrian Belle Vardaman, and Jim and Ada would become my grandparents.",
            "",
            "",
            "",
            "",
            "",
            "Lucy Jane Gwin married Lawson Hebb, related to this family, no doubt.",
            "",
            ""
        ]
    ],
    "pageTitle": "GwinWmSutton.htm",
    "title": "",
    "url": "http://www.gwingenealogy.net/GENEALOGY/SURNAMES/Gwin/GwinWmSutton.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487997619,
    "recordOffset": 487935459,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{159857=26.04--Kate Lula Gwin b. 4 Jul 1874; age 6 in the 1880 Wilsonville Census; d. 22 Aug 1953 in Tuscaloosa Co. [Vol. 36, Certif. 17519, Roll 5]; never married; she was living in Wilsonville when her dad, Wm. Sutton Gwin, died on 11 Sep 1916., 182083=24.04--William Gwin (middle name unk.)--b. 18 Dec 1820 at Cahaba, AL; d. 29 April 1889 at Wilsonville, AL, buried there also; m. 12 May 1842 to RoseAnna \"Roe\" Carlisle Jones Wilson (b. 22 Aug. 1822, d. 29 Mar 1907 at Tampa, Fla., buried at Wilsonville, AL). [October 1999--Barbara Ward wrote: Found a marriage record Dallas Co. (AL) for a Wm. Guin and Rosa Ann Wilson 13 May 1842.]; In 1900, Roe reports having had ten children, three of whom were still living;, 31796=above, l-r, front:  Gwin cousins, Demopolis, AL, summer 1931--Adrian,15; twins Jim and George, 9; Walter, 1; Ida Mae, 13; and Julia, 16; rear: driver unk. -- Photos probably taken by Adrian's and Julia's oldest brother, James B. Gwin II, 191500=Updated 29 Mar 2014 with information regarding Findagrave.com and Facebook.com discoveries; also, living descendants were marked \"[PRIVATE]\" , 16684=29.02--David Adam Hanson, b. 3 Sep 1974; d. Sunday, 8 Jan 2006, in Hueytown, Jefferson Co., AL; bd. Crestview Mem. Gardens, Adamsville, Jefferson Co., AL--Find A Grave Memorial# 43528253; m. DeLina Pate [PRIVATE]; no ch., 117849=[John Gwin Note: A 1907 letter to my grandfather, Jim Gwin, from his mom, Ida Gwin, seems to substantiate with all but complete certainty that the following letter from Laura Baker is correct:, 184735=23.04--John Gwin (middle name unk.)--b. in what was then NC but soon became TN, probably Sevier Co., on 7 Nov 1792; d. 7 Mar 1877 at Wilsonville, Ala.; m. 8 Apr 1812 in Blount Co., Tenn., by Joseph Walker, JP (and brother of the bride), to Jane Walker, d.o. Thomas Walker, Sr., and Elizabeth Magill, both of Virginia; nine known children;}",
    "TableContextTimeStampAfterTable": "{104558=Selma, Alabama: Times Book and Job Office (T. J. Appleyard, Manager), 1879  Reprinted in 1978 by the The Reprint Company, Publishers, Spartanburg, South Carolina, 120297=1900 Census, Wilsonville, Ala Shelby County - Precinct 9 family 6/6 is William S. Gwin June 1848 51 M32 Ala; Ala; Ala; Ida E. wife May 1845 55 M32 CH: 12/8 Ala England England; George H Feb 1882  18 S ; Al Al Al. Nellie D Apr 188713; Al Al Al. Peter K. Oct 1888; Al Al Al., 94563=His command was formed in line of battle, dismounted, the 17th Indiana Mounted Infantry on the right, and next, from right to left, the 123rd Illinois, the 98th Illinois Mounted Infantry, the 4th Ohio Calvary, and the 4th Michigan Calvary, comprising 1500 officers and men. They had to charge across open ground 600 yards to the works, exposed to the fire of artillery and musketry, and that part of the line they were to attack was manned by Armstrong's brigade, regarded as the best of Forrest's corps, and numbering 1500 strong.  Long's division sprang forward in an unfaltering manner. Its flanks had some difficulty crossing a ravine and marshy soil, but in less than 15 minutes it had swept over the works and driven the Confederates in confusion toward the city. But the loss was considerable, and among the wounded was Gen. Long himself, who was temporarily succeeded in command by Col. Mint., 116812=From: \"M. Jo Goodwin\" <goodwin@ipa.net> Date: Sat Sep 27, 2003  08:41:26 PM US/Mountain To: \"John Gwin\" <jmcdgwin@zianet.com> Subject: Texana Wilson, 88586=While growing up in Selma I explored the breastworks east of the Range Line Road, played in a house in Burnsville where Lt. Gen. N.B. Forrest is reputed to have pulled a marauding Federal soldier out from under a bed where he promptly shot him, sawed lumber from cypress trees from the Blue Girth Swamp containing metal from the battle, and witnessed the salvage of guns from the adjacent Alabama River. I call this essay \"The First Battle of Selma\" because there has since been another battle, almost 100 years later, that may have been much more significant in the minds of men, the March across the Pettus Bridge in 1964., 102049=On the 9th, Wilson's forces commenced evacuating the place by crossing the river on pontoons, and by the 10th his entire force had succeeded in crossing the river. Thousands of negroes had flocked to the Federal camps, of all ages and sex, and after crossing the river, four regiments were organized out of the able-bodied black men in and around the Federal camps. To these regiments proper officers were assigned, and those unable to bear arms were driven from the camps.   Gen. Wilson, in speaking of these regiments said, \"that in addition to subsisting themselves upon the country, they would march thirty-five miles in a day, and frequently forty.\" About four hundred wounded Federal soldiers were left behind in Selma, all huddled together in the different stories of the present hardware store of John K. Goodwin., 107728=   1988 i. Kyrah Leigh MARABLE (Private).    1989 ii. William Marshall MARABLE II (Private)., 118391=1900 Census, Wilsonville, Ala Shelby County - Precinct 9 family 6/6 is William S. Gwin June 1848 51 M32 Ala; Ala; Ala; Ida E. wife May 1845 55 M32 CH: 12/8 Ala England England; George H Feb 1882  18 S ; Nellie D Apr 188713; Peter K. Oct 1888 all kids Al Al Al., 90862=Finally, in the winter of 1865, through the advice of Gen. Thomas, who commanded the department of Tennessee, Gen. Grant selected Maj. Gen. J. H. Wilson, a prudent and sagacious officer, for the task of capturing Selma, with an independent command. After a careful canvas of the question, Gen. Wilson selected from the Federal army of the west, a force of about thirteen thousand men, and encamped them at Gravel Springs on the Tennessee River. After a thorough drilling and equipment unsurpassed by any cavalry force of the world, on the evening of the 17th of March, 1865, this splendidly mounted and equipped force was ordered to march on the next morning. The Tennessee River was crossed, the force composed of the first, second and third divisions, commanded respectively by Gens. McCook, Long, and Upton, were in motion to strike a blow that would be felt by the Confederacy. After burning the University of Alabama in Tuscaloosa and destroying the iron works in Tannehill and Montevallo, this force moved on through the mountainous country of Alabama, and with scarcely any opposition, until the first day of April, at Ebenezer Church, near Dixie Station, on the Alabama and Tennessee railroad, 27 miles from Selma, Gen. Forrest made a stand; where it is said that Gen. Forrest and the brave Capt. Taylor, of the 17th Indiana Regiment had a running fight of over 300 yards, resulting in the death of Taylor---Forrest falling back upon Selma, pressed hard. On the night of the 10th of April, this force camped at Plantersville, 22 miles from Selma.  Here Gen. Wilson was informed by spies from Selma, that it was the intention of Dick Taylor (Commander of Confederate forces) to evacuate the place and make no defense---that Forrest himself advised it, and for a time led Gen. Wilson to believe he would meet with no resistance at Selma. (Wilson's headquarters house is still standing in Plantersville)., 89985=The capacities and importance of Selma, in its relation to the Confederate movement, had been notorious in the North, and too great to be overlooked by the Federal authorities, as early as 1862.  But to reach it with a Federal force baffled the ingenuity of the federal Generals.  As the place grew in importance, the greater the necessity to reach it with a Federal force.  Gen. Sherman first made an effort to reach it, but after advancing as far as Meridian, within one hundred and seven miles, retreated to the Mississippi River; Gen. Grierson, with a cavalry force from Memphis, was intercepted and returned; Gen. Rousseau made a dash in the direction of Selma, but was misled by his guides and struck the railroad forty miles east of Montgomery., 113177=----- Original Message ----- From: John Gwin Sent: Monday, May 26, 2003 2:54 PM To: Jerry Hill Subject: Re: Memorial Day, 114564=Do you know the address, or can you give me directions to the place on a map?  I'm going there in July and have NO IDEA where to start looking. Your e.mail is a light in the darkness for me!  I do know that Grandpa Sutt and Grandma Ida are buried there, and I've been there to see their graves and have pictures, but I'd love to know much more:  What did he do?  Where did they live?, 101293=The 2,700 prisoners, comprising almost every man in the city, were huddled together in a large stockade just north of the Selma and Meridian railroad track, on the east of the Range Line Road, near where the Matthews cotton factory now stands.This stockade was built and had been used by the Confederates. In this pen, in which a dry place scarcely large enough for a man to lay down could not be found, were the prisoners kept until Saturday morning, when they were all paroled and allowed to go wherever they pleased or could. On the 6th of April Gen. Wilson met Gen. Forrest at Cahaba, for the purpose of arranging for an exchange of prisoners, but no definite arrangement was effected., 97950=While matters were going on thus on the outside, it would be well for us to look on and see what was taking place on the inside.  Gen. Wilson's visit had been expected for ten days, but the Confederate forces were so scattered over the country, and especially the cavalry part of it, that to centre a force at Selma was utterly impossible. Gen. Forrest's forces had been reduced to a mere handful, and really, the only reliable force in reach was Gen. Armstrong's, numbering only about fifteen hundred. There were a large number of \"boom-proof\" officers and stragglers in the city, upon whom little reliance could be placed.  But on Saturday it was determined that the place should be defended. Everybody who could walk was called upon to go to the breastworks, with whatever arms could be procured.  Squads of armed men were traversing the streets and examining various buildings for soldiers to go to the breastworks, sparing nothing that wore pantaloons, and by Sunday, 12 o'clock, there were collected in the ditches around the city, about four thousand persons, not more than two thousand of them reliable, to meet a force of nine thousand of the flower of the Federal army, and equipped in a manner unexampled in the history of ancient or modern armies.  Confederate Gen. Dick Taylor left the city as fast as a steam engine could take him, about twelve o'clock on Sunday, leaving command of the city divided between Gens. Forrest, Adams and Armstrong, and as the latter had control of the only real force in the fight, was gallant enough to meet the invaders at the point of the first attack, on the Summerfield road, and Long's division felt the result.  A large number of the women and children had been sent out of the city.  A number of the quartermasters, too, had gone with their supplies, mostly to Meridian.  The assault was made, and no one who comprehended affairs could doubt the result. The Federal forces, with the flush of victory, entered the city in the hour of night, and terrible scenes of plunder and outrages were witnessed in every direction., 105955=   281 i. Mary H. MARABLE was born about 1846 in Walton Co., Georgia.    282 ii. Martha B. MARABLE was born about 1848 in Walton Co., Georgia., 118092=1900 is Rebecca C. Gwin, living as HOH next door to William S. Gwin.  She is Aug 1822 77 widow 10/3 Al Al Al.  This could be Rose Ann C. Wilson Gwin. These are on the first pg of Wilsonville Census, Shelby Co, Ala, Prec. 9., 119968=1900 is Rebecca C. Gwin, living as HOH next door to William S. Gwin.  She is Aug 1822 77 widow 10/3 Al Al Al.  This could be Rose Ann C. Wilson Gwin. These are on the first pg of Wilsonville Census, Shelby Co, Ala, Prec. 9., 92814=On Sunday morning, the 2nd of April, 1865, this force was again in motion, the advance arriving in view of the city about twelve o'clock, and Gen. Wilson himself arriving about 1 o'clock. The guns mounted, the movement of soldiers, and various other demonstrations inside the breastworks, were too plain to leave resistance in doubt, and by four o'clock, the whole force was in position to make the attack.  Gen C. C. Andrews, who was in the force, gives the following account of the assault on the city by Gen.Wilson., 87737=Because of its central location, production facilities and rail connections, the advantages of Selma as a site for production of cartridges, saltpetre, powder, shot and shell, rifles, cannon and steam rams soon became apparent to the Confederacy. By 1863 just about every war material was manufactured within the limits of Selma, employing at least ten thousand people within the city limits. The hull was laid for at least one Confederate ironclad, the Tennessee, and millions of dollars worth of army supplies were accumulated in and distributed from Selma., 112307=Let me stop writing and see what kind of pictures are still on my moniter that I can send you now. Wilsonville is a small town.  But we are full of history.  Genealogy is my hobby, so I maybe can tell you a bit about the place.  I lost my husband to Parkinson's disease March 29, 2002.  We waited upon him here at our residence.  I have two sons only: John Stanley lives at Gardendale, Ala.; Jerry Rand lives here next to me.  All my Tinneys are dead except me.  The Smiths are all dead with exception of Herbert.  He lives in Birmingham, Ala., 113682=On Monday, May 26, 2003, at 01:00 PM, Jerry Hill wrote:, 107140=   1283 i. Martha Nell MARABLE (Private).    +1284 ii. William Grover MARABLE., 117276=1900 5 June, Wilsonville, Shelby County, Pre. 9; #64/64 Pope, John F, Aug1853, 46 M 19 Al Al Al all; Jamile? K. Pope, wife Apr 1860 40 M 19 ch: 7/5; Purnisa A. Pope dau Aug 1882 17; Leon C. Pope son Aug 1885 14; Elgin? J. Pope son Aug 1888 11; Frank  Pope, Dec 1890 9; Mildred W. Pope dau Aug 1897 2; Louise Pope dau Nov 1899 6/12; Texana Wilson, WF  Sept 1854 45 Single - there are black servants listed as well; Williams and Woods surnames., 106272=   283 i. Margret E. MARABLE was born about 1859 in Walton Co., Georgia.    +284 ii. George Marshall MARABLE. GMM married Nell Densler Gwin, d/o William Sutton Gwin and Ida Eliza Basset.    +285 iii. William Isaac MARABLE., 105446=He was married first to Prudence S. JENNINGS on 26 Sep 1831 in Clarke Co., Georgia. George MARABLE and Prudence S. JENNINGS had the following children:, 117164=Just a quick message to tell you I have found Texana in 1900 census, 88334=The following is a verbatim account of the Battle of Selma, excerpted from the book by John Hardy, History of Selma, 1879.* The syntax is his, and I have added a few locations for positions described., 104255=With the fall of Selma and the evacuation of Richmond, Va., on the same day, Sunday, 2nd April, 1865, did the Confederacy fall.\"    , 105737=He was married second to Sarah Ann EARLY on 22 Sep 1824 in Oglethorpe Co., Georgia., 111137=I have a picture of that home that was in family pictures.  There are several on the front porch area.  I do not know who they are. (I will send you a copy by E-mail.)  I  remember when the home looked like that.  My Grandmother Louisa E. Lowery died there soon after living there in 1910.  The children were young and wanted to not live there any longer.}",
    "lastModified": "Tue, 01 Apr 2014 22:04:37 GMT",
    "textBeforeTable": "From the 1, 6 Jun 1900 Census of Wilsonville, Shelby Co., AL Some Pertinent Census Data   Now even more added May 2009: I discovered on the internet Don Varner's site on Cambria Co., PA. When I contacted him, he was able to access the above information from his database on Chauncey Hoffman and his family, who is now clearly seen to be our Chauncey.] More added Apr 2007: I didn't know it at the time, of course, but this last tells me that the Chauncey Hoffman in the 1930 census above is almost certainly the same. When the 1940 census becomes available in 2010 or so, we'll know for sure. My dad, Adrian Sutton Gwin, told me 14 Jul 2000 that Mary Elizabeth was the oldest of the three (b. about 1912); PKG Jr. (\"Little Pete\") was",
    "textAfterTable": "Mary E. Gwin daughter wf Jun 1893/6 s AL/AL/AL From the 22 Jun 1900 Census of Yavapai Co., AZ Terr. Address/ Res/Fam Name Relat. 2HoH Race/ Sex DOB/Age MStat/ YrsMd ChBn/ ChLvg POB S/F/M Occupation/ profession",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}