{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Be careful while attending.",
            "None",
            "There are clubs but as far as I know they are unorganized.",
            "Future Transfer students",
            "None that I could notice.",
            "People at ACCD will generally be more reserved because they mainly want to transfer.",
            "Workout!",
            "the food is not very healthy.",
            "None",
            "I met many teachers that also teach at 4 yr universities.",
            "Enjoy your time there but be aware of transfer opportunities.",
            "The campuses provided by ACCD are just fine but comparatively smaller to 4 yrs. Professors generally want to help the students succeed and will usually be available. This is a great school to save money at."
        ]
    ],
    "pageTitle": "San Antonio College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Antonio-College/reviews?_escaped_fragment_=/show/83179",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900413991,
    "recordOffset": 900323541,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{330766=San Antonio College doesn't have dorms at the time but is always keeping you to date to the closest and cheapest apartments to the campus. Our Ranger newspaper has actually just decided to come up with dorms for the Fall of 2013 and applications are being taken., 472563=They have a mall area, a fiesta room, and upstairs from that is a game room. Every week they have stands or people come out and it is a lot of fun. In December they have a snow day. They do karaoke, boxing matches and all sorts of kind of things., 387315=I do not live in dorms, but dorms are being built near the college as I speak. The colleges should be completed by 2014-Spring., 478728=12 credits cost me 800ish while 15 this semester is 1044 you better be a indistrict student, 364369=There are no dorms at San Antonio College. But in Fall 2013 there will be Tobin Lofts provided to students who would like to rent them. The lofts are conveniently positioned across the street from campus. From the looks of construction, the lofts will look amazing when complete., 561568=© 2015, Cappex.com, LLC, 380237=Brand new dorms that are opening right next to campus in fall 2013., 27517=sac is offering so much more than what they first did when i attened in 2003. i love the fact that everything is spread out and doesnt seem so cluttered, and no one has to walk shoulder to shoulder like some colleges. also very clean!!!!, 429017=I started attending SAC in Spring 2013. I registered last minute and was running around like a chicken with its head cut off. It was a little stressful because I had no clue of what I was doing or where I should have been. If it hadn't been for my sister who had started a semester before me, I don't think I would have enrolled. But all in all, once the craziness settled down and I started my classes things were good. I would rate this school with 4 out of 5 stars., 442915=As San Antonio College is a community college, most of the students are commuting to and from. Beginning Fall 2013, SAC will open their own version of dorms called the Tobin Lofts. They're basically apartments, having different floor plans that can accommodate up to 4 persons comfortably, complete with WiFi, furnishing options, cafeteria, utilities, pool area, fitness center, etc. They also have a designated parking garage separate from the SAC garage. You don't actually have to be a SAC student to room there, as you can live there as long as you are enrolled at a college institution in San Antonio.}",
    "textBeforeTable": "01/17/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 141 Lucianna from San Antonio, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am learning a lot The professors at San Antonio college are extremely well rounded, diverse, and impressive! I have yet to feel like I am not learning anything from them. Without great teachers, you have a lesser chance of getting a personally useful education, so why not get a good education? You're paying for it, so take a chance and learn something! There is a wide variety of classes offered at San Antonio college, so take advantage of it and learn as much as you can with some very interesting professors by your side. Login to rate or flag the reviews Sherri from San Antonio, TX 01/14/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 141 Categories Comments Great for these types of students Students looking to save a lot of money, students looking to brush up on basic reading / writing / math skills that they may have struggled with in high school, students who don't care about dorm life but want",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}