{
    "relation": [
        [
            "Statistic",
            "Income Elasticity",
            "Own-Price Elasticity",
            "Loading Coefficient",
            "No. Cointegration vectors",
            "JB",
            "AR",
            "ARCH"
        ],
        [
            "VAR lags: 8",
            "4.09*",
            "-1.72",
            "0.01",
            "2",
            "Y",
            "Y",
            "Na"
        ],
        [
            "VAR lags: 6",
            "3.79*",
            "-1.52*",
            "0.01",
            "1",
            "Y",
            "Y",
            "Y"
        ],
        [
            "VAR lags: 4",
            "2.57*",
            "-0.75*",
            "-0.03*",
            "0",
            "Y",
            "Y",
            "Y"
        ],
        [
            "VAR lags: 2",
            "0.68",
            "+0.35",
            "0.00",
            "0",
            "Y",
            "Y",
            "Y"
        ]
    ],
    "pageTitle": "FRB: Estimating Elasticities for U.S. Trade in Services",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/ifdp/2005/836/ifdp836.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442927727,
    "recordOffset": 442896825,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{197996=Table A6:  Long-run Income and Price Elasticities for Imports of Fares - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 301115=Table A10:  Long-run Income and Price Elasticities for Imports of Travel - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 223468=Figure A4:  Long-run Income and Price Elasticities for Aggregate Exports and Imports of Transportation Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 274941=Figure A5:  Long-run Income and Price Elasticities for Aggregate Exports and Imports of Travel Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 39808=Hendry, D. F. and J. Doornik, 1999, Empirical Econometric Modelling Using PcGive, London: Timberlake., 30341=Using quarterly observations from 1987 to 2001, I obtain elasticity estimates for the general and specific formulations (liberal and conservative). To address the question of how \"general is the general model,\" I use alternative general models that differ solely in their lag lengths: 4, 6, and 8 quarters. For each specification, I test for congruency (residuals exhibiting normality, serial independence, and homoskedasticity). To explore the role of estimation methods, I use ordinary least squares (OLS), instrumental variables (IV), and Johansen's, 39404=Goldstein, M. and M. Khan, 1985, \"Income and Price Effects in Foreign Trade,\" in R. Jones and P. Kenen (eds.), Handbook of International Economics, Amsterdam: North-Holland., 119079=Figure A2:  Long-run Income and Price Elasticities for Exports and Imports of Other Private Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 334529=6.  This asymmetry was noted first by Houthakker and Magee in 1969; Goldstein and Khan (1985) and Marquez (2002) review the associated literature. Recent papers on this asymmetry were presented at the 2004 ASSA meetings in the session \"Income and Price Elasticities in World Trade: 35 Years Later.\" Return to text, 41643=Reeve, T., 2001, \"Trade in Services,\" Federal Reserve Board, mimeo., 276658=Table A9:  Long-run Income and Price Elasticities for Exports of Travel - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 173415=Table A5:  Long-run Income and Price Elasticities for Exports of Fares - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 332149=*  Corresponding author's e-mail address is jaime.marquez@frb.gov Previous versions of this paper have been presented at the Federal Reserve Board, George Mason University, Johns Hopkins-SAIS, the 2004 Meetings of the International Economics and Finance Society and of the Midwest International Economics Group, the World Bank, the Woodrow Wilson Center, and the 2005 meetings of the Computer in Economics and Finance Society. I would like to thank Neil Ericsson, Joe Gagnon, Dale Henderson, David Hendry, Cathy Mann, and Trevor Reeve for their detailed comments. The calculations are based on PcGets; see Hendry and Krolzig (2001) and PcGive; see Hendry and Doornik (1999). The views in this paper are solely the responsibility of the authors and should not be interpreted as reflecting the views of the Board of Governors of the Federal Reserve System or of any other person associated with the Federal Reserve System. This paper can be downloaded without charge from Social Science Research Network electronic library at http://www.ssrn.com/ Return to text, 40857=Mann, C., 1999, Is the U.S. Trade deficit Sustainable? Washington DC: Institute for International Economics., 39625=Granger, C. and D. H. Hendry, 2004, \"A Dialogue Concerning a New Instrument for Econometric Modeling,\" Econometric Theory, forthcoming., 120788=Table A3:  Long-run Income and Price Elasticities for Exports of Other Private Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 40522=Johansen, S., 1988, \"Statistical Analysis of Cointegration Vectors,\" Journal of Economic Dynamics & Control, 12, 231-254., 54450=Table 2:  Long-run Income and Price Elasticities for Exports and Imports of Services - 1987-2001: Alternative Estimation Methods - Selected Formulations** (Standard errors), 333310=1.  See Bryant, Holtham, and Hooper (1988), Burger (1989), and Mann (1999, 2004).  Return to text, 67615=Figure A1:  Income and Price Elasticities for Aggregate Exports and Imports of Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 41003=Mann, C., 2004, \"The US Current Account, New Economy Services, and Implications for Sustainability,\" Review of International Economics, 12, 262-276., 40092=Hendry, D. F. and H. Krolzig, 2003, \"New Developments in Automatic General-to-specific Modeling,\" in B. Stigum (ed.), Econometrics and the Philosophy of Economics, Princeton: Princeton University Press., 145244=Table A4:  Long-run Income and Price Elasticities for Imports of Other Private Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 29553=For disaggregation to matter, relative prices should exhibit different trends and trade shares should change in relative importance. Figure 2 shows that these conditions are met for U.S. trade in services. For example, the relative price for imports of other private services declines steadily whereas the relative prices for imports of fares rises steadily. Further, travel exports had, until 1996, the largest share of total exports of services, exceeding 30 percent. Since then, exports of other private services have become the category with the largest share: nearly 45 percent in 2001. The counterpart to this increase is the decline in the export share of other transportation services: from 20 percent to 10 percent., 313=Board of Governors of the Federal Reserve System International Finance Discussion Papers Number 836, August 2005 --- Screen Reader Version*, 41749=van Welsum, D., 2003, \"International Trade in Services: Issues and Concepts,\" Birkbeck College London, mimeo., 333897=4.  Net exports of goods and net exports of services were quite close to zero from 1930 to 1976.  Return to text, 69321=Table A1:  Long-run Income and Price Elasticities for Exports of Aggregate Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 41199=Marquez, J., 2002, Estimating Trade Elasticities, Dordrecht: Kluwer Academic Publishers., 39066=Deardorff, A., S. Hymans, R. Stern, and C. Xiang, 2001, \"Forecasting U.S. Trade in Services,\" in R. Stern, ed., Services in the International Economy: Measurement and Modeling, Sector and Country Studies, and Issues in the WTO Services Negotiations, Ann Arbor: University of Michigan Press., 9389=One can simplify equation (2) further by recognizing two properties of the data. First, since 1970, the average rate of change of the real effective value of the dollar has been close to zero (figure 1) and thus I set . Second, prior to 1976, net exports of goods were balanced meaning that . 4 With these properties, equation (2) becomes, 40695=Kimura, F. and H. Lee, 2004, \"The Gravity Equation in International Trade in Services,\" Kangwon National University, mimeo., 41464=Phillips, P., 2004, \"Automated Discovery in Econometrics,\" Cowles Foundation Discussion Paper No. 1469, New Haven, Yale University., 249634=Table A8:  Long-run Income and Price Elasticities for Imports of Transportation- 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 93485=Table A2:  Long-run Income and Price Elasticities for Imports of Aggregate Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 41325=Mirza, D. and G. Nicoletti, 2004, \"Is there Something Special About Trade in Services?\" OECD, mimeo., 336042=11.  All of the data for services, both in current and constant prices come from the Survey of Current Business prepared by the Bureau of Economic Analysis (BEA). The data for trade in real terms begin in 1987. The components for Defense and Royalties are excluded as they do not involve arm's length negotiations. These components represent a small share of the aggregate services. Return to text, 171712=Figure A3:  Long-run Income and Price Elasticities for Aggregate Exports and Imports of Fare Services - 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms, 39947=Hendry, D. F. and H. Krolzig, 2001, Automatic Econometric Model Selection Using PcGets, London: Timberlake., 38762=Bryant, R., G. Holtham, and P. Hooper, 1988, External deficits and the Dollar, Washington, DC: Brookings Institution., 38917=Burger, A. (ed.), 1989, U.S. Trade deficit: Causes, Consequences, and Cures, Boston, MA: Kluwer Academic Press., 40342=Houthakker, H. and S. Magee, 1969, \"Income and Price Elasticities in World Trade,\" Review of Economics and Statistics, 51, 111-125., 225199=Table A8: Long-run Income and Price Elasticities for Exports of Transportation- 1987-2001: Alternative Estimation Methods and Automated Specification Algorithms}",
    "lastModified": "Tue, 30 Sep 2008 17:28:23 GMT",
    "textBeforeTable": "GDP Growth Rates Figure 1:  U.S. External Balances, Incomes, and the Real Exchange Rate van Welsum, D., 2003, \"International Trade in Services: Issues and Concepts,\" Birkbeck College London, mimeo. Reeve, T., 2001, \"Trade in Services,\" Federal Reserve Board, mimeo. Phillips, P., 2004, \"Automated Discovery in Econometrics,\" Cowles Foundation Discussion Paper No. 1469, New Haven, Yale University. Mirza, D. and G. Nicoletti, 2004, \"Is there Something Special About Trade in Services?\" OECD, mimeo. Marquez, J., 2002, Estimating Trade Elasticities, Dordrecht: Kluwer Academic Publishers. Mann, C., 2004, \"The US Current Account, New Economy Services, and Implications for Sustainability,\" Review of International Economics, 12, 262-276. Mann, C., 1999, Is the U.S. Trade deficit Sustainable? Washington DC: Institute for International Economics. Kimura, F. and H. Lee, 2004, \"The",
    "textAfterTable": "2.47* Transportation 0.92* 0.99* 1.12* 0.86* 0.73 0.65* 0.73* 0.36* Travel 1.48* 1.30* 1.12* 1.32* 1.07* 1.08* 1.09* 1.09* Aggregate Trade 1.29* 1.67* 0.00 1.69* 1.47* 1.37* 1.37* 1.36* Table 1:  Long-run Elasticities for Trade in Services Sensitivity to Single-Equation Estimation Method Selected Specificationsa - Panel B:  Price Elasticity Category Exports: OLS: General Exports: OLS: Specific Exports: IV: General Exports: IV: Specific Imports: OLS: General Imports: OLS: Specific Imports: IV: General Imports: IV: Specific Other Private +0.48 -1.08* +0.35",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}