{
    "relation": [
        [
            "Name",
            "Robert Barnett",
            "William Montgomery Sr.",
            "Samuel Briggs"
        ],
        [
            "Acreage",
            "400",
            "1400",
            "1400"
        ],
        [
            "Settlement",
            "April 1779",
            "1776",
            "1776"
        ],
        [
            "Watercourse",
            "Dicks River",
            "Green River",
            "Dicks River"
        ],
        [
            "Date",
            "29 January 1780",
            "29 January 1780",
            "29 January 1780"
        ]
    ],
    "pageTitle": "B1James",
    "title": "",
    "url": "http://freepages.genealogy.rootsweb.ancestry.com/~berry/newupload/pages/B2a.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 95377359,
    "recordOffset": 95312432,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1574=Last Revised: 03/09/2014}",
    "TableContextTimeStampAfterTable": "{7055=Augusta County, Virginia Deed Book 13, page 94 John McClure ( ) and Mary ( ) to John Davis £43, 100 acres in forks of James and his part of a tract of 200 acres formerly belonging to Robert Armstrong, deceased. Teste: James Crow, John and James Berry Delivered: Jno. Davis, November 1775., 75322=10 Aug. 1789564, 8256=1 June 1770569, 223333=Table XXXIX36,968 William Montgomery Land Purchases in Lincoln County, Virginia 1779 - 1782, 188919=     While John and Hannah’s presence in the Castlewood area of Fincastle County, Virginia is confirmed through at least 1775 from various military and civil records, other military records combined with Washington County court records and a daughter’s birth record reveal that the family moved to Kentucky County, Virginia sometime between 1777 and 1780. Court records from Lincoln County, Virginia, a county derived from Kentucky County in 1780, strongly suggest that John Berry qualified for early Kentucky preemption rights, thus further bracketing John and Hannah’s move to Kentucky as taking place sometime in mid to late 1777 and before May 1779, and more likely between 01 January 1778 and May 1779.10,20,196,555,556,558,559,564,847,848,850, 68265=18 June 1784847, 83161=24 Aug. 1793565, 36896=Thomas Berry Jr ‘Jocky’ and His Descendants, Biographical and Historical Memoirs of Northwest Louisiana Claiborne Parish Trails, (Shreveport, LA), Vol. 7, No. 4; Nov. 1992, page 134 Birth of Joseph Berry in Fincastle County, Virginia (1 April 1773 – 1834), 154415=      The settlers appealed to the Virginia government for military assistance. Lord Dunmore, the Royal Governor of Virginia, alarmed by the escalating frontier violence, and invested with a desire to confirm Virginia’s territorial claims, sought action. By mid July the House of Burgesses granted approval for him to mobilize the militia and prosecute a war against the Indians, and with this approval, Dunmore quickly developed a plan to bring the fight to the enemy. He raised two militia armies, composed of a northern and southern command. The northern command, composed of elements from the local counties in the West Augusta District of Virginia (approximately the area of modern day northern West Virginia), as well as from affected areas in Pennsylvania and Maryland, which was to head west and south from their base at Fort Pitt. Dunmore, himself intended to lead this group. The southern command, composed primarily of Virginia militia units from Fincastle, Botetourt and Augusta counties and led by Col. Anthony Lewis, a French and Indian War veteran, was to march down the Kanawha River valley. Here both armies intended to combine, then tackle Cornstalk’s army of combined Shawnee, Mingo, Delaware and Ottawa warriors.885,895,896,897, 130574=   On 5 January 1773 many of the Scotch-Irish settlers in the Ebbing and Sinking Springs congregations in the Holston valley of Fincastle County put together a petition requesting the services of their Presbyterian minister, Charles Cummings, who still presided over the Tinkling Springs congregation back in Augusta County. (Figure 35) Among the signers were several members of the extended Berry family, Thomas, James William and John. Of particular interest here is that only one John Berry signed the petition even though two John Berry can be documented as living in the area at that time. Quite clearly some of the petition signers had been living in the area for several years, as shown in Anthony Bledsoe’s 1770 Botetourt County tithable list, but the early January 1773 signing date, in the middle of winter, strongly suggests that any new arrivals must have moved into the area after that date. (Figure 111) Any new arrival, specifically John Berry, in order to have signed the document by 3 January 1773, would had to have been in the area at least by late 1772. During colonial times, when contemplating moving, it was not uncommon for people to harvest their last crop in the fall before picking up stakes and setting off for new lands. Travel was usually much easier in the fall than in the winter, and a new household could be set up while the weather was still tolerable. With John Berry being a signer of this document, although it is not specifically cited in any source, it seems quite logical to assume that this John Berry had moved to the area in the fall of 1772. The question of which John Berry this represents is a bit more problematical, and the lack of any of the diagnostic markers requires that a subjective assignment be made based on logical assumptions. The assumption here utilized is that, while the signer could have been either John and Hannah or John and Jane, given the fact that John and Hannah soon moved to Kentucky and that John and Jane spent the rest of their lives in this area, and had a strong association with the Presbyterian church in the area, coupled with the fact that both John and Jane were buried in the cemetery of that church, lends credence to the assignment of this entry to the John Berry who married Jane Campbell.56, 2196=     John Berry grew up with his four sisters and two brothers on the family farm on Moffet’s Creek, and, at an unknown date, probably in the mid 1760s, married Hannah ? (unknown last name). Their oldest known child, William Berry, was born in the fall of 1765, so their marriage probably took place in late 1764 or early 1765. By the summer of 1770 John and Hannah, whose family now consisted of one, and possibly two, children, moved to the forks of the James, an area just south of the Borden Grant, where they bought some land. By late 1772, however, after trouble with the Cherokee in southwest Virginia had subsided some, they sold that land and moved to what would soon become Fincastle County in the Holston Valley. They purchased land from the Loyal Land Company in the Wolf Hills settlement, near present day Abingdon, Virginia, most likely after having been discovered by Loyal land agents on their lands and faced with the choice of buying or moving. They only stayed there for a few years, moving to the vicinity of William Russell’s fortified location at Castlewood, in present day Russell County, sometime in 1774. In the fall John Berry participated in the Battle of Point Pleasant as part of a local militia unit. By the spring of 1780, and most likely earlier, probably sometime between January and May of 1779, they moved farther westward, specifically, to the part of Kentucky County, Virginia, which eventually was split off to form Lincoln County, where they remained for the rest of their lives., 8813=10 Oct. 1770211, 170683=     Eventually, after the Watauga siege was lifted, the Cherokee withdrew from the area, and the settlers quickly reoccupied the territory. Col. Christian, leading a force of 1,800 Virginia and North Carolina militia, soon launched a punitive raid against the Cherokee, coordinated with similar raids by the North and South Carolina militias. From October through December Col. Christian’s army marched southward into the heart of Cherokee territory, burning villages, destroying crops, capturing British supplies and killing livestock as a force of North Carolina militia and another force of South Carolinians, approached from farther south and to the east, doing the same in a giant pincer movement. All of the major Cherokee towns were destroyed in the process with obviously devastating effects due to the oncoming winter season. Another, much smaller punitive expedition was mounted in April 1777. The Cherokee sued for peace, which ended the expedition, and made additional territorial cessions that were formalized in a treaty with the North and South Carolinians in May 1777 and the Virginians in July 1777. In these agreements, the Cherokee gave up all of their claims to contested lands in the Nolichucky, Watauga, Holston and New River valleys in addition to other territorial cessions with North and South Carolina. Col. Christian’s casualties were very light, resulting in only one killed and several wounded, with several of the latter being Berry men. At the close of the campaign Col. Christian withdrew, stationing 600 men at the Long Island of the Holston and 80 men at Rye Cove for longer term defensive militia duty. The rest were mustered out of service. A hostile element of frustrated and disgruntled Cherokee, led by Dragging Canoe, broke away from the main group of Cherokee and withdrew to the Chickamauga Creek area in the vicinity of modern day Chattanooga, Tennessee, located at a well known British trading post. From this base they continued to be supplied with arms, especially after the Georgia colony fell to British troops in late 1778, and this allowed them to continue hostile actions against the settlers.570,868,869,870, 88008=31 May 1801565, 65567=18 June 1784196,847, 20077=1772750,843, 83680=27 Jan 1794566, 230171=10 Feb 1781, 229693=01 April 1780, 59733=21 Nov. 1781196, 77497=20 July 1790564,847, 35768=Survey Record Book 1, Washington County, Virginia, page 374 Samuel Duff - 139 ac - on both sides of Woolf Creek, a branch of Holstein River Commissioners Certificate - by the great road - December 21, 1787...Samuel Duff, assignee of John Berry, assignee of Thomas Berry, assignee of Andrew Colvin, assignee of William McMullan - 139 ac - on Woolf Creek surveyed February 11, 1774, actual settlement made in 1772, 219948=29 January 1780, 149526=     A John Berry appears on one of Captain William Russell’s three Fincastle County militia lists in 1774, and this unit participated in the Battle of Point Pleasant. As shown by court and land records from this time period, John Berry was not a particularly common name in southwestern Virginia during the early to mid 1770s, and with there being only two known John Berrys, both related to each other, and both living in the area, this, no doubt this is one of them. His presence in a Clinch River valley militia list requires some understanding on the role of the militia in frontier life during this time period. Most militia captains had one company to command, but William Russell had three, which is a testament to his political and military importance on the southwestern Virginia frontier. Since each militia company constituted settlers who either lived in the closest fort or in the area near that fort, the obvious conclusion is that John Berry lived somewhere in the lower Clinch valley near one of the four forts built by the elements of the Fincastle militia under Captain William Russell’s command. He probably even participated in the building and garrisoning of one or more of the forts. It is interesting to note that he was the only member of the Berry clan living in the Clinch valley. The bulk of the extended Berry family had settled farther east in the Holston valley. Many, if not most, of these Clinch valley settlers were staging themselves for an eventual move into Kentucky. Given the fact that John Berry sold his Loyal Land Company property in the Holston Valley and knowing that moving to Kentucky is precisely what John and Hannah Berry did a few years later, it seems highly likely this record represents John and Hannah Berry. The next challenge is to determine which fort John Berry lived closest to. As shown in Figure 125, Rye Cove and Blackmore’s Fort were the farthest south militia-run defensive structures and consisted of a small group of families, including Blackmores. It is probably a safe bet to assume that this group of people constituted, predominantly, extended families, and with no known connections to the Blackmores, it is unlikely that John Berry lived at or near Blackmore’s Fort. One of Captain Russell’s three militia lists contained several Blackmores, so it probably represents the unit at that fort. One of Captain Russell’s other militia units had John Duncan and Samuel Porter as members, who are known to have lived near the Glade Hollow Fort. In fact, their names appear on a Glade Hollow Fort militia list spanning the time from 29 August to 6 November 1774, so it is safe to interpret this list as representing the Glade Hollow militia members. Finally, it is documented that William Russell took most of the men living near the Castlewood settlement to the Point Pleasant battle, and this is the unit in which John Berry served as a private. In an interesting side note, Daniel Boone, elevated to the rank of captain, commanded the militia members that remained behind to guard the remaining forts and settlers while William Russell took his troops to battle. Since John Berry’s company participated in the battle of Point Pleasant, it can be safely assumed that he lived near the fort known as Russell’s Fort at Castlewood at least by the fall of 1774 and possibly a bit earlier.148,885,975, 78150=20 July 1790847, 215041=     The original plan called for around 2,000 troops, with Fayette, Jefferson and Lincoln Counties supplying 156, 300 and 600 men, respectively. Another 1,000 militia soldiers were to be supplied by Berkley, Hampshire, Monongalia and Ohio counties. The Kentucky troops were to gather at the falls of the Ohio on 15 March 1781, and there meet up with the rest of the force which was to have rendezvoused at Fort Pitt (Pittsburgh) earlier in the month. Unfortunately, the effort was plagued by the same delays as the previous expeditions, mostly involving the reluctance of the western counties to supply the requested number of troops and supplies. General Clark eventually left Fort Pitt in early August 1781 with only 400 men and expected to unite with a reduced force of Kentucky militia at the falls of the Ohio in order to carry out a modified campaign of harassment against the warring tribes. In late August, after the annihilation of a force of about 100 Pennsylvania troops attempting to catch up with and merge with Clark’s force, the entire campaign quickly collapsed.1041,1042,1043,1044  , 183076=     From mid 1773 to late 1775 there are several Fincastle court records in which a John Berry was sued by several individuals. Since he failed to appear in court, both monetary judgments were made against John Berry. In one case, two merchants sued for payment, presumably of goods delivered but not paid for, and in another case John Berry was sued on a replevin bond, which is a legal method of recovering personal property that has been unlawfully taken. The lack of diagnostic indicators makes it quite difficult to properly assign these entries. In this report, the are tentatively assigned to the John Berry who married Hannah, mostly based on the fact that they soon left the area, although the interpretation is not firm. John Berry can be further documented as living near William Russell’s fort at Castlewood in modern day Russell County, somewhere along the Clinch River drainage through the summer and fall of 1774 when he served in the militia from that area during the Point Pleasant Campaign. (Figure 82) After the battle, he made a public service claim for a gun he had lost during the campaign. This claim was made to the state-sponsored commission handling payment to the militia and those who provided material support during the campaign. This commission was established in mid July 1775, and public hearings were held throughout the fall of 1775 where the various claims were presented to them. Since a public service claim was submitted by John Berry when the commission met in Fincastle County, it can be reasonably asserted that he was still living in Fincastle County, and probably still in the vicinity of William Russell’s Castlewood fortification. These records, then, clearly show that John and Hannah Berry were still living in Fincastle County, Virginia, probably near Castlewood, through 1775. Logan’s Fort, originally called St. Asaph’s Fort, was established in Kentucky in the late spring of 1775 by Col. Benjamin Logan and others, although John and Hannah Berry were not among that group of original settlers. The Kentucky land where John and Hannah eventually settled, however, was on Hanging Fork Creek, which is very close to Logan’s Fort. (Figure 124) During the Indian unrest in Kentucky during 1777, a militia was formed by Captain Benjamin Logan at Logan’s Fort, presumably containing a listing of all able bodied males to aid in the defense of their frontier homes. There was no John Berry on this list, so it can be safely assumed that the family was not yet in the area by the summer of 1777.20,196,556,564,847,848,850,884,885,1031,1032, 78707=16 Feb. 1791122, 235074=     As noted above, the presence of three individuals named John Berry living in Lincoln County during the early 1780s complicates the assignment of source records to a particular individual. Elements of these data entries that would allow accurate record assignment fall into two categories: the fact that each individual lived in a geographically distinct part of Lincoln County and that the county was subdivided in 1785 to form Mercer County. Any records providing an identification of a particular part of the county where one of the John Berrys lived would allow a reasonably accurate assignment of the records to that individual. Since both the Chaplin Creek and Harrodsburg John Berrys lived in the part of Lincoln County that would become Mercer County, any Lincoln County John Berry records can confidently be assigned to John and Hannah Berry. From the early summer of 1784 through the early winter of 1785, four county court records document John Berry’s jury duty. Since no geographic discriminator is overtly provided, and the time period covers the period prior to the formation of Mercer County, at least on the surface, assignment of these records seems rather problematical. However, the composition of the juries provides the necessary geographic key. The presence of Thomas Montgomery, Samuel Briggs, John Buchanan and James Logan on these juries, all, of whom, owned land in the Logan’s Fort area, seems to suggest that these juries were drawn from that area. Based on this, all of these entries can be assigned to John and Hannah Berry. This analytical conclusion is supported by the fact that John Berry continued his Lincoln County jury duty through 1787, several years after Mercer County was formed., 92274=     Due to a lack of primary source data, neither the date nor the place of John Berry’s birth are not known with certainty, but, based on the birth date of his oldest child, William Berry, and the little information that is available about the early movements of John’s parents and his maternal grandfather, William MaGill, it can be surmised that his birth probably occurred in the early 1740s, possibly as late as 1742 and probably in Lancaster County, Pennsylvania. John Berry’s father, William Berry, married Jane MaGill, a daughter of William MaGill, Sr., and William's brother, James, married Jane’s sister, Elizabeth Eleanor MaGill. So, two of William MaGill, Sr.’s daughters married two Berry brothers, then each of these Berry-MaGill families had a son named John Berry which has caused an immense amount of confusion for their descendants in accurately tracking these lineages. Unfortunately, there is very little data on the Berry family for the late 1730s and early 1740s time period. There is , however, a limited amount of data documenting William MaGill’s trail, so reasonable assumptions can be made for the timing of John Berry’s maternal grandfather, William MaGill’s, movements, and, hence, for the location of John Berry’s parents around the time he was born., 120555=     When they appear in primary source records only with their first and last name it is exceedingly difficult to accurately differentiate them, and great care must be taken to assure that the correct assignment is made. There are, however, three diagnostic features that, when present, allow a clear differentiation and a firm basis for assigning specific primary source records to the correct individual. First, there is the “Orphan Issue”. One of the John Berrys was an orphan as documented by Augusta County court proceedings from the early 1750s. As evidenced by Augusta County records, orphan status is a rather rare occurrence in Berry source records from this era, so any source material that identifies one of them as having been an orphan allows for a definitive identification. Second, there are the “Botetourt County Land Records”. One of the John Berrys married a woman named Hannah ? (unknown last name) and the other married Jane Campbell, so when records contain the name of their spouse, a definitive differentiation and accurate correlation to land acquisition and tithable data is quite easy. Third, are the various “Fincastle and Washington County Records”. While both John Berrys moved from Botetourt County to what would soon become Fincastle County, Virginia in late 1772, John and Hannah soon moved on to Lincoln County, Kentucky in the late 1770s while John and Jane spent the rest of their lives in the Fincastle/Washington County area. Both men can be traced through will, land, court and tax records, and, in John and Jane’s case, their land can be traced as it passed into the hands of their children after their deaths.  , 230737=17 Dec 1781, 67137=The Kentucky Genealogist, Vol. 13, No. 4, October – Dec. 1971 At a court continued and held for Lincoln County, page 189 John Warford, Pltf., against Ebenezer Miller, Excr. of Clough Overton, Deceased, and Robert Moseby, Defts. In Debt. This day came Parties by their Attornies and thereupon came also a Jury, to wit: James Forbes, Stephen Fischer, John Smith, Charles Reynolds, Samuel Briggs, John Buchannon, Thomas Montgomery, Robert Herrald, George Davidson, Joseph Russell, John Berry and Thomas Pitman, who being elected, tried and sworn well and truly to try the issue joined, withdrew and after some time came into Court and returned their Verdict in these words. to wit: “We of the Jury do find for the Plaintiff Two Hundred and Ninty five pounds Damages.” It is therefore considered by the Court that the plaintiff recover against the Defendant his Damages aforesaid assessed and his Costs by him in this behalf expended., 82086=23 June 1791565, 72189=21 Mar. 1787847, 38403=Botetourt County, Virginia Deed Book 1, page 526 LDS Microfilm # 30702, Botetourt County Virginia Deed Book 1, volumes 1 and 2, 1770 - 1780 This indenture made the eighteenth day of June in the year of our lord one thousand seven hundred and seventy three between John Berry of the county of Botetourt of the one part and Samuel McNabb of the aforesaid of the other part Witnesseth that the said John Berry for and in consideration of the sum of five shillings current money of Virginia to him in hand paid by the said Samuel McNabb at or before the sealing and delivery of these presents the receipt whereof is hereby acknowledged hath granted bargained sold and by these presents doth grant bargain and sell unto the said Samuel McNabb one certain tract or parcel of land containing seventy nine acres lying and being in the county of Botetourt on the south side of James River and is bounded as follows viz Beginning at a white oak and ash on the river below the head of a spring corner to John Jones land and thence with a line of the same south thirty two degrees west one hundred and twenty poles to a black oak south seventy nine degrees west twenty two poles to a black oak and gum south five degrees east thirty poles to a hickory south seventy four degrees east ninety eight poles to a black oak and white oak north fifty five degrees east twenty four poles to two white oaks north fifty degrees east forty eight poles to a black oak and chestnut oak north thirty five degrees west sixty eight poles near to two poplars in a line of his old survey north fifty three degrees east seventy seven poles to an ash and white oak on the river and thence up the same ninety seven poles to the beginning And all houses buildings orchards ways waters watercourses profits commodities hereditaments and appurtenances whatsoever unto the said premises hereby granted or any part thereof belonging or in any wise appurtances and the reversion and reversions remainder and remainders rents issues and profits thereof To have and to hold the said seventy nine acres of land and all singular other the premises hereby granted and the appurtenances unto the said Samuel McNabb his heirs executors and administrators and assigns from the day before the date hereof and during the full term and time of one whole year from thence and conveying fully to be complete and ended(?) yielding and paying therefore the rent of one peppercorn on Lady Day next if the same shall be lawfully demanded so the intent and purpose that by virtue of these presents and of the statute for transferring leases into possession the said Samuel McNabb may be in actual possession of the premises and be enabled to except and take a grant and release of the reversion and inheritance thereof to him and his heirs In witness whereof the said John Berry hath hereunto set his hand and seal the day and year first above written John Berry Hannah Berry Signed and delivered in the presence of John Floyd Harry Innis John Todd Jr, 25796=3 Sept. 1772196,56,838, 211892=George Rogers Clark’s 1781 Campaign, 139790=     The final John Berry record in question is a 1777 Washington County court record that promoted John Berry, among others, to the rank of lieutenant in the Washington County Virginia militia. Three pieces of information are necessary to correctly assign this entry: an understanding of the “Historic Background” affecting the “overmountain” settlers, The King’s Mountain Plunder Record- a Washington County court case stemming from the Battle King’s Mountain, which took place in the fall of 1780, and the “Timing of John and Hannah Berry’s Move to Kentucky”., 18095=Augusta County, Virginia Colonial Land Office Patent Virginia Land Office Patents No. 40, 1771-1772, p. 585, Reel 39 George the Third ye to all ye know ye that for divers good cause & consideration of the sum of five shillings of good and lawful money for our use paid to the Receiver General of our Revenues in this colony said dominion of Virginia We have given granted and confirmed and by these presents for us our heirs & successors Do give grant and confirm unto John Berry one certain tract or parcel of land containing forty eight acres lying and being in the county of Botetourt on the south side of the James River and is bounded as follows, to wit, Beginning at three hickory saplins corner to the land of George Wilson and with a line of the same south seventy four degrees east one hundred poles to a black oak and three pines on a hill north fifty five degrees east twenty six poles to two white oaks north fifty degrees east forty eight poles to a red oak and chestnut oak thence north thirty five degrees west sixty eight poles to near two poplars in a line of his old survey and with the same south fifty three degrees west ninety two poles to two white oaks and a hickory north fifty two degrees west thirty poles to two black oaks west twenty two poles to two black oaks in a line of Skidmore’s land and with the same to the beginning. With all ye to have hold and be held ye yielding and paying ye in witness ye witness our trusty and welbeloved William Nelson Esquire President of our Counsel and Commander in Chief of our said colony and dominion at Williamsburg under the seal of our said colony the third day of August one thousand seven hundred and seventy one in the eleventh year of our reign. W. Nelson, 85560=8 Aug. 1797847, 51116=Lord Dunmore’s Little War of 1774, His Captains and their Men Who Opened up Kentucky & the West to American Settlement, by Warren Skidmore with Donna Kaminsky Fincastle County Militia The part of Fincastle County that became Russell County THIS COMPANY WAS AT POINT PLEASANT. Captain William Russell He was paid £130 10 sh for 261 days at 10 sh per diem. Lieutenant: Isaac Shelby, Benjamin Roberts Ensign Thomas Inglis Sergeants: William Scott, John Douglas, Andrew Terrence, William Mainsel, William Dunn, Richard Price Privates: George Armstrong; Thomas Bell; James Bailey; John Berry; Richard Burk; John Bradley; Henry Boyer; Samuel Bonifield; Peter Burns; William Brian; Dennis Begley; Nicholas Bother; Joseph Collins; John Calbert; James Christian; Edward Conner; Alexander Chambers; John Coy; Joel Dauss; William Doyle; James Dunn; William Doyle [alias] Scumpy; Andrew Full; Charles Fielder; George Flin; Thomas Groce; James Grannel; Adam Hance; William Hall; Thomas Hamilton; James Bridge; Samuel Richards; Henry Louther; John Stother; Benjamin Torman; Richard Wade; John Welch; Joseph Whitaker; David Willson; Patrick Gary; Henry Anderson; Jerrard Trotter; Andrew Dunn; George Smith; George Oxer; Francis McConel; Mathew Latimer; Dennis Neall; Ezekiel Buchanan; John Long; Samuel Moore; James Elliot; Richard Benson; William Champ; James Simpson; Thomas Pitman; Thomas Welch; Thomas Welch, Junior; Michael Madden; Peter Druell; David McGee; Charles Secret; Joseph Robinson; Joseph Hall; John Lafferty; Joseph Locke; Thomas Teas; Jeremiah Jenkins; Thomas Lewis; Timothy McNamara; John Moore; John McElvane; Patrick McDowell; Donald McDonald; Patrick McCain; William McManus; John McCashlin; James McCollister; David Nowland; Edward Nash; Thomas Norton; Robert Owens (deserted); Daniel Ormsby; Hugh Parks (deserted); James Fowler (scout); William McCollister; Edward Yates; Henry Moore; John Snoddy; Thomas Quirk; Joseph Moore; David Colhoun, Alexander Montgomery, Abraham McClaylund, Samuel Walker, William Russell, Junior, John Bracksdale (Barksdale), 229216=31 March 1780, 29574=3 Sept. 1772, 110=     John Berry was probably born sometime in the early 1740s although the exact date of his birth is not known with certainty. The place of his birth is equally ambiguous, since the whereabouts of his parents (William Berry and Jane MaGill) has not been established at that time from primary source records. The Berry family probably did not arrive in the Augusta County area before 1742, since none of them appear in Augusta County records before that time, and, probably more importantly, no Berrys can be found in the 1742 Augusta County militia list. Consequently, at least until that time, they were probably living near the family of William MaGill, who appears to have been living in the Lancaster County, Pennsylvania at the time. William MaGill Sr.’s location is important, because he was the father of John Berry’s mother, Jane MaGill. William MaGill does not appear in Augusta County, Virginia records until 1746, and was probably living in Pennsylvania, which is where his second wife was known to be in 1738. (Figures 119 and 120) Because of this, if John Berry was born prior to 1742, which seems likely, his place of birth was probably Lancaster County, Pennsylvania. By 1746, though, when his parents obtained a 145 acre tract of land on Moffet’s Creek in the northern part of the Borden Grant in Augusta County, Virginia, the family was definitely living in Virginia. In fact, since they were probably squatting on the land they eventually purchased, a common situation of the time, this Berry family was probably already living in the area between 1742 and 1746. (Figures 8 and 10, Table 2), 181653=     The evidence of the date and place of the birth of John and Hannah Berry’s children provide several known points for conducting an accurate assessment of this family’s move to Kentucky. No children are recorded for John and Hannah during the period from 1773 to 1778, but, between 1778 and 1787, they added six more kids to their brood. In the spring of 1778 Sally Berry was born, followed by Mary (Polly) Berry in 1779 and Hannah Berry in the late spring of 1780. While the birth places for Sally and Polly are given only as Virginia, Hannah’s birthplace was documented from mid 19th century family records written by a grandson of John and Hannah as being Lincoln County, Kentucky, which confirms the presence of John and Hannah Berry in Kentucky by 1780 at the very minimum. The remaining three children, Margaret (born in 1782), Jane (born in 1786) and John (born in 1787), are all documented as having been born in Lincoln County, Kentucky. Jane Berry’s birthplace is further pinpointed as taking place in the village of Stanford, which is known as being located near the site of Logan’s Fort.20,556, 206449=1781 Lincoln County Records – Militia Payroll Data, 82641=25 Sept. 1792565, 53994=7 Feb. 1775844, 60780=19 Oct. 1782199, 135545=     The third problematical Fincastle County John Berry record consists of a 139 acre land purchase on Wolf Creek, a tributary of the South Fork of the Holston River. The land was surveyed in the early winter of 1774 with actual settlement made in 1772. It was resurveyed in 1781 and that record reveals a lengthy ownership history. The final owner was Samuel Duff, but he had been assigned the land by John Berry, and the trail of assignees included Thomas Berry, Andrew Colvin and William McMullan. Of much more critical interest is the fact that it was a Loyal Land Company sale made directly to John Berry. The Loyal Land Company was a private organization that had been granted large allotments of land and a fairly limited time period in which to sell those lands. The time frame had been interrupted by the French and Indian War and was unofficially extended after the war. The land cost was £3 per 100 acres plus some service fees and a land survey charge of just over £3. Most of the company’s sales were to squatters, and, in fact, company representatives typically identified company land by the simple fact that squatters were there. These people were then forced to pay up or move on. With a settlement date of 1772, a survey date of 1774, a Loyal Land Company sale to John Berry, a subsequent transfer of ownership, and the fact that John and Hannah Berry soon moved on to the Logan’s Fort area of Kentucky County, Virginia, it seems logical to assign this record to John and Hannah Berry. This property can be located on Figure 22 as the 139 acre tract eventually purchased in 1781 by Samuel Duff along Wolf Creek. This situation most likely did not sit well with John Berry, and may have been a factor in eventually John and Hannah soon deciding to move on to Kentucky. Further supporting the assignment of this land to the John and Hannah Berry lineage is that fact that John and Jane can be documented by Washington County land survey records to have met the minimum requirements for settlement on a separate tract of land along the South Fork of the Holston River in 1770. Since they were still living in the forks of the James at his time, actual settlement most likely constituted the planting of a corn crop or maybe the construction of a crude living structure, as was the common practice of the time. John and Jane finally acquired title to that land in the early 1780s, long after John and Hannah had moved on to Kentucky. In fact, they spent the rest of their lives there on the Holston River, so it seems highly unlikely that they would have also laid claim to another noncontiguous land parcel a year or two later. This data is examined in more detail in subsequent paragraphs.856  , 190445=     Kentucky County was eliminated in the fall of 1780, and replaced with Lincoln, Fayette and Jefferson Counties (Figure 67). Logan’s Fort, Harrodsburg and Boonesborough, the three principal settlements in the area, subsequently fell under the territory of Lincoln County as did the drainage basins of the Green River, Carpenters Creek, Harrod’s Creek, Dick’s River, Logan’s Fork, Hanging Fork and much of Chaplin’s Creek, all, of which, are important in examining and evaluating John Berry related Lincoln County records. Since John Berry was living in this area, he began appearing in Lincoln County court and militia records from 1781 until his death in 1790. A close examination of the early Lincoln County records, as well as early Kentucky land records clearly demonstrate that there were two other John Berrys living in the Lincoln County area by the early 1780s. These records, as well as the historical background of the region, must be closely examined so that all of these John Berry Lincoln County records can be differentiated and accurately assigned. While Lincoln County was formed in late 1780, John Berry does not appear in any county records until 1781, although those records are quite sparse. The 1781 Lincoln County records for John Berry consist of a pauper warrant record, militia payroll records and an estate appraisal. Since the pauper records are the most convoluted in nature, they will be examined first.884, 55918=(17 Mar. 1778 - 25 Mar. 1876), 127107=     The actual tithable list for the 1771 Forks of the James District is not alphabetical, so, at least to some extent, it probably shows individuals as they were encountered by list owner as he, or his agent, rode from farm to farm creating the list of people to be taxed. This clearly indicates that at least some of the people in this listing were probably next door neighbors. John Jones (the step father of the John Berry who married Jane Campbell), the John Berry who married Hannah, as well as a James Berry, are all listed immediately adjacent to each other. The other John Berry lived somewhat farther away from this Berry/Jones group, as evidenced by his nonadjacent occurrence in the list and that he was further identified as owning 100 acres of land. Based on the documented 120 acre Augusta County land acquisition by John and Jane Berry in 1768, the latter John Berry tithable list entry containing the acreage most likely represents John Berry and Jane (Campbell) Berry. That interpretation is further confirmed by the 1775 sale of that particular parcel of land in which both John and Jane Berry are identified as the sellers. Furthermore, several 1771 land acquisitions and subsequent sales quite clearly show that John and Hannah Berry owned land adjacent to John Jones, clearly identifying this John Berry as the individual in the 1771 tithable list listed adjacent to John Jones. John Berry began the process of purchasing his own land by having 48 acres on the south side of the James River surveyed. He didn’t actually acquire title to the land until August of 1771, which explains why he does not appear as a landowner in the 1771 Botetourt County tithable list. At an unknown date, but probably after the 1771 tithable lists had been taken, he also purchased 75 acres of land adjacent to the 48 acres he had surveyed, so, by the end of 1771 he owned 123 acres of land on the south side of the James River.56,196,557,568,836,838,841,843, 198180=     Two other John Berrys can be shown to be living in Lincoln County in the early 1780s, so the available records must be closely examined in order to accurately differentiate them. One lived along Chaplin’s Fork and the other in the vicinity of Fort Harrodsburg. The John Berry (~1759 – 1795) who eventually lived on Chaplin’s Fork was the son of Richard Berry (1734 – 1798) and Rachel Shipley. Richard Berry was born in Maryland and emigrated to eastern Virginia, possibly in the Lunenburg County area at least by the early 1750s where records show that he served in the Virginia militia. All of the family history documentation that can be found for Richard Berry at the present time note that in 1780 he sold his farm and moved his family to the part of Jefferson County, Virginia that would eventually become Washington County, Kentucky. Land acquisition records from Virginia and Kentucky allow some cross verification and refinement of the timing and location of that move, in late 1779. Neither Richard Berry, nor his son John, however, obtained preemption certificates, which means that they had not arrived in Kentucky before May of 1779. As shown in Table XXXVII, the earliest data that both father and son bought land in Lincoln County was late 1780, although Richard Berry had also obtained land in land that would become Jefferson County at a somewhat earlier date. Richard Berry’s first land purchase is documented by a land entry in the fall of 1779 on Beech Creek for 600 acres in the part of Jefferson County that would eventually become part of Washington County. The land wasn’t surveyed for four and a half years for some reason. While not definitive, it does seem to indicate that at least Richard Berry was probably in Kentucky by the fall of 1779, but the original entry certainly could have been made while he was still in eastern Virginia. Whether or not his family was also there cannot be determined from this data, but it was on this land that Richard Berry eventually settled, so his family was probably not far behind. For his first Lincoln County land purchase, the entry and survey dates are from late 1780 and early 1781 and are quite close to each other in time, only ten months apart. The patent was granted about a year after the survey, so the entire process took less than two years, unlike his Jefferson County property. A second Lincoln County land warrant was purchased by him in the summer of 1782, which also presents some unique difficulties in interpretation. It appears that from 1782 through 1784 several entries were filed covering the entire area of the 865.5 acre land parcel identified in the warrant, but only one tract, a rather small 49.5 acre tract was actually surveyed and patented, at least as far as can be determined from the available Kentucky and Virginia land records. The importance of this information, however, is that it established the presence of Richard Berry in Kentucky, possibly as early as late 1799, although that record is for land in Jefferson County, not Lincoln County. The fact that Richard Berry lived at the Beech Fork property in Jefferson County and not on his Doctors Fork land in what was originally Lincoln County and would eventually become Mercer County is further substantiated in his will where he stipulates that one of his sons sell the Mercer County land and give the money to the heirs of his son John Berry, who had passed away in the mid 1790s.36,968,1035,1036,1037,1038,1039  , 230259=23 June 1781, 93780=     As noted in William Magill’s biographic essay, he was born in either Scotland or northern Ireland in the late 1600s, and by the mid to late 1720s had emigrated to Bucks County, Pennsylvania. At an unknown date, but at least by 1746, he had moved to Augusta County, Virginia, apparently, by way of Lancaster County, Pennsylvania. Since he doesn’t appear to have left many tracks, William MaGill, Sr.’s journey from Bucks County, Pennsylvania to Augusta County, Virginia can be reconstructed only from a few scattered pieces of reliable data connected by a general understanding of the conditions that prevailed in this part of the American colonies during this particular time period. It seems quite probable that, when he left Bucks County, William MaGill, Sr. took the main road from there to the Lancaster and/or Carlisle area, where there were thriving Scotch-Irish communities. He most likely stayed in these areas, at least for awhile, and this could be where he encountered the Berry family. What is more certain is that this is where Margaret Gass, soon to be his second wife, was living. Margaret Gass had been widowed in 1734 in Lancaster County, Pennsylvania, and in 1738 can be documented as living in Carlisle, Pennsylvania, a Scotch-Irish enclave in Lancaster County just west of the Susquehanna River. (Figure 119) It seems quite likely that Margaret Gass and William MaGill must have encountered each other there, sometime between 1738 and 1746, the latter date being when William MaGill’s presence in Augusta County, Virginia can first be documented. (Figure 120) Based on the absence of any Berry or MaGill family members in the 1742 Augusta County Virginia militia list, it is a reasonable assumption to conclude that neither the Berrys nor the MaGills had yet arrived in Virginia from Pennsylvania by that date. However, one of William MaGill’s son in laws, Hugh Campbell, was already in Augusta County by 1742, since he did appear in the 1742 Militia List, so it is quite possible that the rest of the extended family group, probably including the two Berry/MaGill families, was not far behind. Carlisle, Lancaster County, Pennsylvania, lay astride the Great Wagon Road, the main north/south emigrant route running the entire length of a great elongated valley (typically referred to as \"The Great Valley\") between the Blue Ridge Mountains to the east and the Allegheny Mountains to the west. With the opening of the Beverley and Borden Grants in Augusta County, Virginia in the late 1730s and early 1740s, there seems to have been a general exodus of Scotch-Irish from the Lancaster County, Pennsylvania area to the Shenandoah Valley of Virginia, and it is not difficult to imagine William MaGill, Sr., as well as his two Berry sons in law and their young children, participating in this movement. Consequently, while not firmly documentable with primary source records, the weight of the indirect evidence suggests a birth place of Lancaster County, Pennsylvania for John Berry. 21,100,107,108,110,111,112,115,116,126,169,204,265,314,321,335,336,337,339,340,314,342,343,344,345,346,347,350,351,, 50124=Survey Record Book 1, Washington County, Virginia, page 374 James Montgomery - 400 ac - Commissioners Certificate - on the west side of Woolf Creek, the waters of Holstein River - beginning at the foot of the Great knobs corner to Samuel Duff's land - by shelving rocks on the bank of Woolf creek - corner of the tract by preemption right - near the foot of the said knobs - August 27, 1785...James Montgomery - 400 ac - on the south side of the Great knobs on Hunt's and Woolf Creek, joining John Berry, James Phillips, James Doren, Nicholas Fain, David Carr, George Berry and James McFarran, includes his settlement - actual settlement made in 1782 -, 5920=~1763, 229306=4 May 1780, 243378=848,968,1052,1053, 85736=Lincoln County Virginia/Kentucky Order Book 5, 1794 - 1801, page 127, in Lincoln County Kentucky Records, Volume III The persons appointed to view the best way for a road from Lincoln County Courthouse to McWhorter's Mill on Green River returned their report as follows. Beginning at McWhorter's Mill, then nearly with the present way through the lands of Christopher Rife, Abraham Wilson and the heirs of John Carpenter, dec'd, to near the Pine Lick, from thence as marked through the lands of John Greenlee, Hugh Logan and Josiah Huntsman to Archibald McKinney's and through his land with the ridge road through the lands of Alexander Gay, Joseph Briggs, Nathan Huston, Eleazer Givens, Robert Givens, Mary Givens, Hannah Berry and Joshua Moore to where the said ridge road intersects the Great Road from Carpenter’s Station to Lincoln Courthouse, and with the said road to Stanford. Ordered that the proprietors of the land through which the road would pass be summoned to appear., 38113=18 June 1773196,56,841, 216789=     The final bit of 1781 John Berry related Lincoln County source data consists of an estate appraisal record in which John Berry and three other men evaluated the property of a recently deceased neighbor. All three of the other appraisers, Robert Barnett, William Montgomery and Samuel Briggs lived in the Logan’s Fort area (Table XXXVIII) where John and Hannah eventually purchased land. In addition, one of them, Samuel Briggs, had worked on a road crew with John Berry back in Fincastle County in 1773. The Logan’s Fort area was also where several Drake family members, other Lincoln County pauper warrant recipients, lived, so this court record ties in many other John Berry related source documents. In addition, one of John and Hannah’s children, Jennie, was recorded as being born in Stanford in 1786, and the land eventually purchased by John and Hannah Berry was on Hanging Fork in the near vicinity of Logan’s Fort. Quite clearly, the Logan’s Fort John Berry represents John and Hannah Berry. It should also be noted that both the Green River and Dick’s River, where the other estate appraisers (Barnett, Montgomery and Briggs) obtained their land, are located nearby present day Stanford. In fact, all three of these appraisers had been granted preemption certificates on the same day, most likely since they all filed the same day at the same place when the Virginia Land Commissioners met there in early 1780. This body of evidence clearly supports the assignment of this record to John and Hannah Berry.20,562,564,851  , 88968=3 Mar. 1802199, 57035=Mar. - Apr. 1781560, 228736=15 Oct 1779, 7540=8 Nov. 1767 - 177020, 556,564,848, 78327=Lincoln County Virginia/Kentucky Order Book No 3, 1786 - 1791, page 510 The last will of John Casey, dec'd, was proved by John McGill, Hannah Berry and Esther Dougherty, witnesses thereto, and ordered recorded., 88487=23 Aug. 1802565, 87412=2 March 1801846, 63727=Ledger of Samuel Finley Campbell, 1845 Will of John Berry Family Registry of James & Peggy Campbell and John B. Campbell & Cynthia Black and Journals of John B. Campbell & Thomas B. Campbell Sue Wilson, Wichita, Kansas Family History Data in the Files of Donna Fischer Margaret (Peggy) Berry born in Lincoln County, Kentucky (4 Dec. 1782 - 17 Feb. 1869), 35599=1772169, 202213=Table XXXVII 968,1035 Richard & John Berry Land Acquisitions in Lincoln and Jefferson Counties, Virginia, 158458=     When Col. Lewis arrived at the designated meeting point, he received orders to join Dunmore, who was located about 50 miles to the north near the mouth of the Hocking River. (Figure 91) Cornstalk, most likely realizing that he was seriously outnumbered, decided that his best hope for success was to strike each army separately, before they were able to combine. Consequently, on the night of 9 October, his warriors crossed the Ohio River to prepare for the attack. The army of the southern command was at that time encamped on the point of land between the Kanawha and Ohio Rivers, known as Point Pleasant. A well timed assault on this position would find them in a very vulnerable position - with their backs to the river. The next morning, 10 October 1774, as Col. Lewis was preparing to break camp and march northward to merge with the northern command, Cornstalk’s warriors began the attack as the sun rose. The initial action was focused on a small detachment of about 150 soldiers, which took heavy losses, but the engagement soon escalated into a full-scale assault. The fighting continued throughout the entire day, becoming increasingly intense and desperate, and characterized at times by vicious and desperate hand to hand combat. As the day wore on Cornstalk’s warriors seemed to be gaining the upper hand, but the overwhelming firepower of the Virginians proved to be very effective. In order to relieve the pressure of the attack, some of Col. Lewis’ men, led by Isaac Shelby who would eventually become the first governor of Kentucky, were sent on a successful flanking maneuver along the east side of Crooked Creek, a Kanawha tributary. Cornstalk misinterpreted the movement as representing the arrival of Dunmore’s reinforcements, and broke off the fighting in order to avoid further losses, which were already quite severe. By nightfall, the Indians gave up the attack and withdrew across the river, dumping the bodies of their fallen comrades into the river to prevent mutilation by the soldiers. Losses on both sides were quite significant. Dunmore, learning of the outcome of the battle, moved the bulk of his force close to the Shawnee village of Chillicothe, established temporary quarters, which he named Camp Charlotte, on some open ground along the Scioto River in modern day Pickaway County, Ohio, and ordered Col. Lewis to meet him there with 100 men. A treaty was quickly reached with the Shawnee, in which they ceded their claims south of the Ohio River.885,895,896,897, 70029=19 Oct. 1785847, 48697=11 Feb. 1774844, 177338=     Attacks and atrocities continued back and forth in the region throughout 1777 as bands of Shawnee and Cherokee repeatedly attacked the few, scattered Kentucky settlements. A militia was created at Logan’s Fort in mid 1777, as well at the other two major settlements, and both Virginia and North Carolina sent militia units to Logan’s Fort and Boonesborough to protect the settlers from the wrath of the natives, since both colonies had settlers occupying the region. From the settler’s point of view, all able bodied males would have been required to join the nearest militia unit in the middle of such a crisis, and John Berry’s absence from this 1777 militia list most likely means that he was not yet living in the area. Consequently, this places a lower date, 1777, on John and Hannah Berry’s move to Kentucky. i.e. their move most likely did not occur before that date. The violence abated again in the fall of 1778, and pioneer life in the Kentucky settlements, as well as immigration of American settlers, returned again to a temporary normalcy. With the paucity of primary source records from this time period, and the majority of that data being land records, further refinement of the timing of John and Hannah’s move to Kentucky requires an understanding of Virginia land laws in relation to the settlement of Kentucky, an understanding of the changing county boundaries and close scrutiny of all available county records.858, 229783=05 May 1781, 165322=     In July 1776, as open conflict between the American rebels and the British homeland erupted, the British, along with their Indian allies, developed a plan to eradicate settlers from these valleys once and for all. An assembled force of 700 warriors, predominantly Cherokee, but also including Shawnee, Delaware and Mohawk warriors was split into two groups. The dissident Cherokee chief Dragging Canoe was to attack the Nolichucky and Watauga settlements with half of the warriors while Raven was to lead the rest up the Clinch and Holston valleys to break up those settlements. Getting word of the impending attacks, the southernmost settlements along the Nolichucky River were abandoned and the refugees fled northward to the protection of the only nearby fortified positions - Eaton’s Fort near the Long Island of the Holston River and the fort on Watauga Creek (Watauga Fort). Finding the Nolichucky settlements abandoned, Dragging Canoe split his force again, sending Old Abram to lead an attack against the settlements on the Watauga Creek while he took the bulk of his force, nearly 200 warriors, to assault Eaton’s fort. (Figure 66) At this time the North Carolina settlements were governed by Virginia authority, so they looked to their neighbors in Fincastle County, Virginia for assistance. As the Nolichucky refugees poured into the two fortifications, word of the Indian onslaught was sent out to the nearby Virginia militia units at Thompson’s Fort, Edmiston’s Fort, Cocke’s Fort, Shelby’s Fort and the settlements near Wolf Creek. The next day, 20 July 1776, 170 members of the Virginia militia from in and around these locations quickly concentrated at Eaton’s Fort. Rather than wait for the inevitable defensive battle, or worse yet, sitting behind walls as the Cherokee looted their properties and killed stragglers, the militia army opted to go on the offensive and attack the approaching force. Two divisions marched toward Long Island, about seven miles away. Several miles short of their target a small group of Indians, loaded with plunder was encountered and attacked. As the Indians fled back to the nearby main Cherokee force, the militia, expecting a quick attack, fell back about a mile toward high ground. The counter attack came quickly as the main Cherokee force soon caught up with the settlers. Finding the settlers in apparent retreat, the Indians attacked, expecting an easy victory from an enemy that appeared to be in retreat already. The militia quickly formed a quarter mile long line of battle along the crest of a small ridge as the Cherokee attacked their center and left flank. The fighting soon devolved to bitter hand to hand combat, lasting from 30 to 45 minutes, but ending as quickly as it began with the rapid withdrawal of the Indian force. The militia suffered no losses and only two four minimally wounded men, while Indian losses were somewhat higher, with at least 13 known dead and many more wounded. Dragging Canoe was seriously wounded during the clash and soon withdrew his force form the field. Meanwhile, after an initial unsuccessful assault on Fort Watauga, Old Abram’s force settled into siege, but failed to overcome the fort’s defenses, and after two weeks, gave up. This battle of Long Island Flats, was the first clash of the Revolutionary War that took place west of the mountains and, especially coupled with the follow-up campaign, was considered to be an overwhelming victory for the settlers.462,570,867, 238032=     In his will, written in the summer of 1789, John Berry identified all of his children by name, directed that his property in Fayette County be divided between his oldest sons James and William and that his personal property be divided among all of his daughters. He also dictated that his acreage in Lincoln County, which he did not describe, should be divided between his youngest sons Joseph and John, but that his wife, Hannah, should be allowed to spend the rest of her days there before the land was sold. This obviously positively demonstrates that John Berry had already purchased his land near Logan’s Fort. Since there are no records of a direct sale between the government of Virginia and John Berry for the tract, he clearly had to have purchased it from a second party. Less than a year later John’s father, William Berry, passed away leaving an equal monetary sum to each of John and Hannah’s children. For the next twelve years, until 1803, Hannah Berry appears in the Lincoln County personal property tax record lists as the head of a household containing no males over the age of 21, clearly showing that her sons had moved out of the house and were on their own. Beginning in 1791 both William and James Berry began appearing in the Lincoln County tax records as the head of their own households, thus confirming Hannah’s tax data. One son, Joseph, continued to live at home until he turned 21, and, most likely, her youngest son, John, was living with her, as well. Since she suddenly disappeared from these records in 1803, it is presumed that she passed away, and the farm on which she lived passed into the hands of her sons, John and Joseph Berry. The tax records also show that Hannah owned a few horses, and, until 1794, a small herd of cattle. Presumably the cattle were sold off or given to her children after 1794. This group of records also provides information on the Lincoln County land that John and Hannah had purchased. This acreage, where their house was located, consisted of 150 acres on Hanging Fork and was part of a tract originally purchased from the Virginia colonial government by William Montgomery by means of a Treasury Warrant. Kentucky/Virginia land records (Table XXXIX) show that William Montgomery purchased a total of 500 acres of land along the stream divide between the Green River drainage basin and Hanging Fork for a total price of £790. That price calculates to a value of £1.58/acre, so, assuming no profit at all, which is unlikely, 150 acres of that combined parcel would have cost John Berry around £237. William Montgomery started the land acquisition process in the winter and spring of 1781, and received patents for the two tracts in June and December of 1782, so, while John Berry could have already been squatting on the land, the earliest he could have purchased his 150 acres, and gained personal ownership, would have been mid 1782. Hannah appears in the Lincoln County marriage records in the early winter of 1794 when she consented to the marriage of her daughter Sarah Berry, who was only 19 years old at the time, thus requiring parental approval. Hannah appeared in the records again 1797 when the county court ordered road construction along her property, making her responsible for road maintenance. The road description began at McWhorter’s Mill on the Green River, passed along several properties on the way to John Carpenter’s land, also known as Carpenter’s Station, which is located several miles west of the present town of Hustonville in the southwestern corner of modern day Lincoln County, then continued along the ridge road, probably a road running along the drainage divide between Carpenter Creek and Hanging Fork, to where it intersected the road from Carpenters Station to the Lincoln County Courthouse and Stanford. John and Hannah Berry’s property appears to have been located somewhere along the segment of the ridge road between Carpenters Station and the present town of Hustonville, so it was situated along the south and western part of the present day Lincoln County, which matches the description for William Montgomery’s land, part of which was purchased by John and Hannah. Among the landowners mentioned along the route are John Carpenter, John Greenlee, Josiah Huntsman and Hugh Logan. As noted above John Carpenter owned land just west of modern day Hustonville along Carpenters Creek, which drains directly into the Green River to the south a few miles and falls directly on the opposite side of the drainage divide from Hanging Fork. Both John Greenlee and Josiah Huntsman owned land along Hanging Fork, and Hugh Logan, the brother of Benjamin Logan, one of the principal founders of Logan’s Fort, owned land along the wagon road from Hustonville to Logan’s Fort.10,20,36,555,558,564,565,, 103086=     During the colonial period, taxes, referred to as tithables, were imposed upon qualifying individuals (primarily free white males at least 16 years of age) who lived within a defined geographic area, here referred to as a tithable district. When Botetourt County was created, one of the first duties for the county court was to establish geographic boundaries for the tithable districts contained within the county boundaries. A prominent person, usually living within each district, was also assigned the responsibility of identifying all potential tax payers, and, presumably, to collect the taxes. Rather than affecting only land and property owners, as a property tax does, however, the tithables functioned as a tax imposed upon individuals who actually lived within a specified area, whether they owned the land on which they lived or not. Basically, this was a “head tax” – a tax on whatever qualifying individual was living in a specific area, so absentee landowners were not included on tithable lists. A related level of organization within each county was the militia company. All able bodied males within the colony were required to join the militia, and while militia units were organized on a county basis, overall command and control was in the hands of the royal provincial executive and legislative bodies, and, in particular, the royal governor. On the local level, militia units were organized into companies composed of settlers living within loosely-defined geographic areas within each tax district. Each company was commanded by a militia captain operating within a strict chain of command. In the early 1770s, depending on its size, areal extent and population density, each tithable district possessed one or more militia companies within its boundaries. The militia captains commanding these companies provided their political and military leaders with a list of the taxable (and draftable) males, who were, in most cases, heads of families living within their assigned areas. Without a doubt, the county court-designated tithable lists were intimately interwoven with the state-operated militia organizations. Although not all of these records have survived to the twenty first century, a number of them have, and they have serendipitously provided succeeding generations with valuable information on the families moving into and through these areas during this era of mass migration.56,241,242,864,1151,1152, 69203=Lincoln County Virginia/Kentucky Order Book No 2, 1785 - 1786, page 19 John Seeright of the demise of John Barksdale, an infant under 21 years of age, by his Guardians John Cowan and Joseph Davis v John Kinkaid, on ejectment for one message, one tenement and 1,000 acres of land in Lincoln County, Parish of Kentucky. There came a jury composed of James Davis, James Logan, James Thompson, James Knox, John Edmundson, John Berry, George Davidson, Thomas Montgomery, Joseph Scott, Edward Worthington, John Patterson and William Crawford, who found the defendant guilty of trespass and ejectment as complained, and to plaintiff to recover the same and costs., 148026=The 1774 Battle of Point Pleasant, 49926=14 Aug. 178169, 8432=Botetourt County, Virginia First Surveys A List of Surveys made and recorded in Botetourt before the 27th of June 1770 by Wm. Preston S.B.C. John Berry 48 acres On the south side of James River, 85124=13 May 1797565, 221238=     Virginia and Kentucky land records for William Montgomery are also useful in differentiating the John Berrys. William Montgomery Jr. and Sr., father and son, spent around £2000 between 1776 and 1782 in the process of obtaining title to 4000 acres of land in the area of Lincoln County along the drainage divide between the Green River and Kentucky Rivers just a few miles south of Logan’s Fort at present day Stanford. (Table XXXIX). In fact William Montgomery Sr. built a fortified station, known as Montgomery’s Station, on this land. The headwaters of Carpenter Creek, which drains into the Green River, and Dicks River, which drains into the Kentucky River, are just south of Logan’s Fort. In addition, the drainage divide between Hanging Fork, which also drains into the Kentucky River, and the Green River drainage basin is also in this area. Robert Barnett, one of the 1781 estate appraisers, was an adjacent landowner to William Montgomery Jr. and is noted in land records as living near Petitt’s Station, a fortified site about 2 ½ miles south of Montgomery’s Station. Several other Montgomery family members also obtained land in this area at the same time. William Montgomery Jr. purchased 500 acres of this land along the Green River/Hanging Fork drainage divide in 1781, finally obtaining patent on the lands in mid and late 1782, and it must have been 150 acres of this 500 acre plot that was later purchased by John and Hannah Berry. Based on the totality of the data it seems inescapable to conclude that the John Berry from the 1781 Lincoln County estate appraisal represents John and Hannah Berry.36,457,968,1034,1039  , 54787=17 Mar. 1778 10,20,555,558,848, 15116=11 Feb. 177120,550, 556,564, 16195=Augusta County, Virginia Colonial Land Office Patent Virginia Land Office Patents No. 40, 1771-1772, p. 597, Reel 39 George the Third ye to all ye know ye that for divers good cause & consideration of the sum of five shillings of good and lawful money for our use paid to the Receiver General of our Revenues in this colony said dominion of Virginia We have given granted and confirmed and by these presents for us our heirs & successors Do give grant and confirm unto John Berry one certain tract or parcel of land containing seventy five acres lying and being in the county of Augusta on the south side of the James River and is bounded as followeth, to wit, Beginning at a red oak and a poplar on the south side of the river corner to a tract of land surveyed for John Buchanan and running thence with a line of the said land South thirty degrees East one hundred and sixty poles to a hickory and two white oaks North fifty three degrees East one hundred and seventy poles to an ash and white oak on the river and up the river to the beginning With all ye to have hold and be held ye yielding and paying ye in witness ye witness our trusty and welbeloved William Nelson Esquire President of our Counsel and Commander in Chief of our said colony and dominion at Williamsburg under the seal of our said colony the third day of August one thousand seven hundred and seventy one in the eleventh year of our reign. W. Nelson, 228824=21 June 1781, 186590=     In late December 1776 Fincastle County, Virginia was dissolved and replaced by three counties, Montgomery, Washington and Kentucky with Kentucky County occupying the territory of what would eventually become the state of Kentucky (Figure 65). One of the items of business when the Washington County court met in February of 1777 was to recommend promotions to the rank of lieutenant for a number of local militia members, no doubt based upon their actions in the recent armed conflicts with the natives. Six of the names on this list had also been signers of the Cummins petition, and one of these names was John Berry, but the question is – which John Berry was this? There are several factors that allow for an accurate assignment of this record. First of all, Washington County records from May of 1783 note that a militia unit under the command of Lt. John Berry, stole a hog, no doubt butchering and eating it, while involved in the Kings Mountain campaign in October 1780. There are no records for more than one John Berry being promoted to lieutenant in Washington County, and, as of the fall of 1780, and again in the spring of 1783 when the Washington County lawsuit took place, the John Berry who married Jane Campbell was still living in Washington County. Based on the birth information for their daughter Hannah, John and Hannah Berry were living in Kentucky County by April of 1780, which was several months before the Battle of King’s Mountain was fought. Furthermore, Lincoln County did not contribute any militia units to the King’s Mountain campaign, so the Washington County John Berry promotion clearly refers to the John Berry who married Jane Campbell. Another element of negative evidence also indirectly supports the date of John and Hannah Berry’s move to Kentucky. After 1777, all John Berry entries in the Washington County area can be confidently assigned either to John and Jane Berry or a son of Thomas Berry (a Berry relative) bearing the same given name.441,884  , 71086=Descendants of John Allen Givens and Jane Berry Will of John Berry Family Registry of James & Peggy Campbell and John B. Campbell & Cynthia Black and Journals of John B. Campbell & Thomas B. Campbell Sue Wilson, Wichita, Kansas Family History Data in the Files of Donna Fischer Jane (Jennie) Berry born in Stanford, Lincoln County, Virginia (8 Jan. 1786 - 3 July 1866), 59233=The Kentucky Genealogist, Vol. 13, No. 4, October – Dec. 1971 At a court held for Lincoln County, Kentucky Ordered that Robert Barnett, William Montgomery, Samuel Briggs and John Berry or any three of them, being first sworn, do appraise the estate of James Smith, deceased, and return the appraisement to the Court., 75499=Lincoln County, Virginia Will Records Book No. 1, page 189 In The name of God amen. I John Berry of Lincoln County and State of Virginia being of sound and disposing mind and memory do make and ordain this my last will and testament in manner and form following that is to say first I will that all my Debts and funeral Charges be paid by my Executrix herein after named also I Give and Devise unto my two sons James and William their heirs & assigns forever all that tract of land containing three hundred acres laying on the waters of lickin Crick which I bought of William McCrachin to be eaqually Divided between my two sons above mentioned and as to my movable Estate I will and Order that It be equally Divided between my Daughters: Betsy, Polly, Sally, Hannah, Peggy & Jane and their portions to be Delivered to them at the time they shall arrive to years of their lawful ages. Also I give and devise unto my two sons Joseph and John all that tract of land my family now lives on in Lincoln County and State of Virginia and their heirs and assigns forever, but not meaning or intend that they or Either of them shall have any Demands on the last mentioned lands until the Death or marriage of Hannah my wife and will and order that she my said wife have the hole and sole use and benefit of the plantation aforesaid during the time of her natural life or so long as she Contains my widdow and lastly I do make and Constitute hannah my wife Executrix to this my last will and testament and trustee for my Children. In Witness Whereof I have set my hand & seal this 10th day of august 1789., 142918=    The immediate post French and Indian War era along the length of the American colonial frontier was one marked by westward expansion of English settlers, and one of increasing concern by both the Cherokee and Shawnee Nations who had occupied these lands for at least a century. In order to address this concern the English king issued the Proclamation of 1763 which forbade English settlers from expanding westward from the headwaters of rivers that drained into the Atlantic. The basis of this agreement was to mollify the tribes by officially decreeing that all English settlers must keep out of Kentucky, as well as southwestern Virginia. The Treaty of Fort Stanwix in 1768 between the English and the Iroquois, established the English/Indian (Iroquois) boundary at the Ohio River, thus, tacitly allowing the white settlement of Kentucky with the hope of keeping the inevitable tide of invading humanity out of the Iroquois homelands north of the river. Unfortunately, the Shawnee, who actually occupied the ground, were not included in any of the negotiations or agreements. Concurrently, after suffering significant manpower losses from a pivotal territorial battle with the Chickasaws along the western edges of their territories in 1769, the Cherokees found themselves in a very weakened position, soundly defeated by competitors on the western margins of their territory and forced to negotiate territorial claims with the Europeans encroaching from the east. With the Lochaber Treaty of 1770, an agreement similar to the Stanwix treaty, English negotiators effectively re-established the boundary between white and Cherokee lands, moving it significantly west of the line set by the 1763 agreement. Not unexpectedly, this sparked a rapid influx of European settlers, mostly from the North Carolina and Virginia colonies. These new immigrants created numerous settlements and fortifications in the Holston, Clinch and Powell valleys, with cabins and defensive fortifications appearing southward as far as present day northeastern Tennessee. The bulk of the immigrants settled in the Holston valleys (the North, Middle and South forks of the river), since it was larger, provided more opportunities for settlement, and was typically the first valley encountered by the new European settlers streaming in from Virginia. A significantly smaller number of people settled in the Clinch valley and only a few made it as far west as the Powell valley.462,570,865,866,885,895,896,897  , 5521=~1742, 56061=28 April 1780 20,556,564,848,850, 86895=28 June 1800565, 133212=     Another of the problematical Fincastle County records consists of a road order from 8 September 1773, and of particular interest are the names on that list. Nearly all of the men on the segment of road that John Berry was ordered to work on were also included on the Cummings Petition from several months earlier in the year. More importantly, though, is the fact that two of the names on the road order, Samuel Briggs and Benjamin Logan, were also the names of the early settlers of Logan’s Fort (St. Asaph’s) in Kentucky County, Virginia, including Benjamin Logan, one of the original founders and namesake of the fort. The importance of this connection lies in the fact that John and Hannah appear to have moved to Kentucky in late 1777 and they ended up living very close to Logan’s Fort. In addition, to Samuel Briggs and Benjamin Logan, George Clark, Thomas Montgomery and John Kennedy were signers of the Cummings Petition and are also listed as early settlers of Logan’s Fort in Kentucky. It seems quite logical to assume that these men, while working on the road crew, would take the opportunity to discuss emigrating to the new lands opening up in Kentucky. On that basis, it seems logical to assign this road order entry to John and Hannah Berry.56,844, 114285=     When Botetourt County was formed in 1770, it was generally assumed that the county would be subdivided in the near future as the southwestern part of the Virginia colony was becoming increasingly populated with Virginians migrating out of relatively densely settled areas of the colony. In the same year that Botetourt County was created, the British government, in an effort to appease their American colonists, concluded a treaty with the Cherokee tribes in which the latter ceded large tract of land, including much of the upper Holston and Clinch River valleys. What followed was a rapid influx of English settlers into the area, and it was the subsequent population boom that, only two years later in 1772, led to the carving out of Fincastle County from Botetourt County, significantly reducing the latter county in areal extent. (Figure 65) It was right around this time, late 1772 and early 1773, that John Jones, John Berry’s neighbor and the step father of his first cousin, the John Berry who married Jane Campbell, passed away in Botetourt County, and at that time that both John Berrys joined the horde of settlers migrating out of Botetourt into the newly open lands of the Holston and Clinch River valleys within the newly formed Fincastle County.57,447,570, 56467=Ledger of Samuel Finley Campbell, 1845 Birth of Hannah Berry (28 April 1780 - 2 June 1864) in the part of Kentucky County, Virginia that in the fall of 1780 became Lincoln County, Virginia, 84675=9 May 1794565, 203108=Land Office Treasury Warrant # 5997 £80 for 200 acres On the South Fork of the Doctors Fork in Lincoln County Entered: 01 Aug 1780 Surveyed: 05 May 1781 Granted: 01 June 1782, 210422=     The pauper records, as outlined above, identified settlers who were too poor to pay for the 400 acres of land that they were entitled to by virtue of their early settlement in the area. Neither Richard Berry nor his son John appear to have had a money problem, since both of them paid fairly significant sums of cash for their land warrants. Richard Berry does not appear in the pauper records, and the John Berry that does appear in these records is clearly not Richard Berry’s son. While there is a possibility that these records represent the Harrodsburg John Berry, there is no other data to document his existence in Kentucky. Furthermore, John and Hannah were definitely in Kentucky at an early date. The Fincastle County records for the John Berry married to Hannah document a man who had been sued on several occasions for nonpayment of debt. Consequently, with the Chaplin’s Creek John Berry eliminated based on a late arrival date in Kentucky, the early whereabouts of the Harrodsburg John Berry being unknown, and a documented cash flow problem for John and Hannah Berry, the 1781 court pauper records can be confidently assigned to the John and Hannah Berry.968  , 230813=01 Dec 1782, 106040=     In January 1770 Botetourt County was formed from Augusta County, and the area known as the “forks of the James”, where John and Hannah lived, fell under the jurisdiction of the new county. (Figure 65) On the 10th of May in 1770, at one of the first meetings of the court for the newly established Botetourt County, the boundaries of the tithable districts were defined and list “owners” were assigned to each district. Based on the legal descriptions provided by the court, and a comparison to the basic topography and hydrology of the area, as represented in Figure 111, the district boundaries were designed to conform to the major drainage basins of the region. The 1770 tithable districts of Stephen Trigg, Andrew Woods, William Christian, Benjamin Estill and William McKee were defined within the James River drainage basin, except for an inclusion of settlements along the Greenbrier River in Botetourt County which were placed within William Christian’s list. John Bowman and Philip Love’s districts were located within the upper and lower portions of the Roanoke River drainage basin. The districts of Walter Crocket, William Herbert and William Ingles were defined as being within the New River basin, and Anthony Bledsoe and Robert Doak’s districts were situated within the Holston River drainage basin. On 11 June 1771, the Botetourt County Court reassigned list owners for some of the established tithable districts, possibly modifying some of the district boundaries slightly, and in 1772 the list owners were revised again. Furthermore, the militia captains within each district did not remain constant through this period, all, of which, has caused some difficulty in making year to year list correlations. In order to more easily reference specific districts over time, as well as the subordinate areas within these districts (here referred to as subdistricts), each has been identified with a hydrologic-related name as shown in Figures 111, 112 and 121. As far as the tithable lists themselves are concerned, there is not complete preservation. Tithable lists from only three of the twelve tithable districts established in 1770 have survived to the present day although most of the tithable records for 1771 and 1772 are still extant. Despite the drawbacks, the lists are extremely valuable tools in tracing the movement of people during the early 1770s, particularly in light of the fact that tithable lists for some of the areas covered by these lists when Fincastle County was created in 1773 have not survived.241,242,750, 74595=Ledger of Samuel Finley Campbell, 1845 John P. Berry, August 1869 Obituary Will of John Berry William C. Berry, b. 23 June 1811, Wilson Co, Tennessee, Portrait and Biographical Album of Des Moines County, Iowa Descendants of Charles Campbell and Mary Trotter, Family Files of Jeanette Jahnz Family History Data in the Files of Donna Fischer John P. Berry born in Lincoln County, Virginia, 232685=     The only John Berry Lincoln County records for 1783 consist of several payments to a John Berry for supplying horses that had been lost in a battle with the Indians known as Estill’s Defeat. Since there were three John Berrys living in Lincoln County at the time, John and Hannah, the Fort Harrodsburg John Berry and the Chaplin Creek John Berry, and the data entries do not supply enough information to allow an accurate differentiation, these records cannot be positively assigned to John and Hannah Berry. At best only a tentative assignment is possible. In the spring of 1782 the British began preparing for another invasion of the Kentucky settlements. A group of Wyandot warriors, apparently unable to wait for the offensive to begin, set out on their own to attack the settlements in the Boonesbourough area. On the 20th of March they assaulted Estill’s Station, a well known fortified station located in Fayette County not far from Boonesborough. Captain James Estill, a local militia leader and owner of Estill’s Station had been out on patrol with his militia unit at the time, and, after receiving word of the attack, pursued the attackers through the snow as they withdrew northward. Two days later Captain Estill’s group caught up with the Wyandot band and engaged them in what would become known as the Battle of Little Mountain. After several hours of fighting, which involved hand to hand combat, the militia withdrew, leaving Captain Estill and a number of his men, the count varies from six to eight, dead on the field. Due to the rather high casualties, the engagement became known as Estill’s Defeat. The engagement took place in Fayette County, outside the jurisdiction of Lincoln County, as was the location of Estill’s Station, but Captain James Estill, was able to utilize Lincoln County assets due to his position as a Lincoln County militia officer.1047,1048,1049,1050,1051, 195433=     John Berry was listed as one of the first group of people who qualified for Lincoln County’s easy payment plan. Lincoln County records from the fall of 1781 note that John Berry, along with a number of other citizens, were able to prove to the satisfaction of the Lincoln County court that they had not been able to procure lands at the state price (mainly because they had no cash), so a surveyor was ordered to lay off a 400 acre tract for each approved individual. This court record provides sufficient documentation, good enough at least for the Lincoln County courts to accept, that a John Berry had arrived in the area sometime between 1 January 1778 and May of 1779. It should be noted that several of the men who appeared on the 1777 Logan’s Fort militia list, specifically, Benjamin Drake, John Drake Sr., John Drake Jr., John Phillips and Richard Glover, were also included, along with John Berry, in this Lincoln County pauper warrant for settlers who had been unable to afford the cost of their lands. The fact that John Berry appeared among this group of cash strapped settlers who lived in the Logans Fort area, suggests that he was probably living in that area as well. Since John and Hannah Berry were known to have been living in the area by at least the spring of 1780 and no other John Berrys can be documented in the area prior to that time, it seems highly likely that this entry represents John and Hannah Berry. Consequently, the birth record and this pauper warrant brackets the time of John and Hannah’s move from Fincastle County to Kentucky County, Virginia as taking place between 1 January 1778 and May 1779. In light of this information and analysis, it seems that the birth place for their daughter Mary, originally written as merely being in Virginia, must have been Kentucky County, Virginia.20,196,556,564,847,848,850,1034, 54170=Fincastle and Kentucky County, Virginia-Kentucky, Records and History, Volume 1 Fincastle County Order Book, p. 124 James Berry vs John Berry and William McGaughey on replevin bond, defendants (John Berry and William McGaughey) not appearing, judgment granted plaintiff for 4 pounds, 10 shillings 6 pence to be discharged by the payment of 2 pounds 15 shillings 3 pence with interest from June 22 1774 and costs, 65801=The Kentucky Genealogist, Vol. 13, No. 4, October – Dec. 1971 At a court continued and held for Lincoln County, page 189 Daniel Sullivan, Pltf, against Robert Patterson, Admr. of Arthur Lindsay, Deceased, Deft. In Debt. This day came Parties by their Attornies and thereupon came also a Jury, to wit: James Forbes, Stephen Fisher, John Smith, Charles Reynolds, Samuel Briggs, John Buckhannon, Thomas Montgomery, Robert Herrald, George Davidson, Joseph Russell, John Berry and Thomas Pittman, who being elected, tried and sworn well and truly to try the issue joined, withdrew and after some time came into Court and returned their Verdict in these words. to wit: “We of the Jury do find for the Plaintiff Forty three pounds Damages.” It is therefore considered by the Court that the plaintiff recover against the said Defendant his Damages aforesaid assessed and his Costs by him in this behalf expended., 63380=4 Dec. 1782 20,556,564,851, 48078=2 Nov. 1773844, 64322=25 Mar. 17831010, 228901=01 Sep 1782, 20350=A Seed Bed of the Republic, Early Botetourt, A Study of Pioneers in the Upper (Southern) Valley, Virginia Botetourt County, Virginia Tithables, 1770 – 1782, 1783 – 1789, Reel 149, The Library of Virginia, Land Tax Records, 1782-1900 A List of Tithables taken by James McGavock from James River to Buffalo Creek Mountain to Mountain for 1772 Stephen Arnold (3), John Arnold (1), Henery Avis (1), James Anderson (1), James Arnold (1), Malcom Allen (1), Alexander Boyd (9), John Berry (1), James Barton (2), Henery Bowyer (2), Patrick Brown (1), Hugh Brown (1), Hugh Barclay (4), John Berry (1), James Berry (1), Samuel Barclay (1), James Barclay (1), Alexander Boggs (1), Michel Bowyer (1), James Cartmill (1), John Cartmill (1), Henery Cartmill (2), John Cowarden (2), Charles Camron (1), Jacob Cleet (1), Palser Cleet (1), Mathias Cleet (1), Michael Cleet (1), William Chapman (1), Dennis Conner (1), John Croddy (1), William Craford (1), Capt. James Cloyd (1), David Cloyd (1), George Campbell (1), George Camins (1), William Cross (1), Joseph Dennis (1), George Dougherty (1), William Dougherty (1), James Dougherty (1), James Dredder (1), ? (1), Nathaniel Evans (1), Bejamin Estill (4), Samuel Ferguson (2), George Francisko (3), Michael Francisko (1), Edward Green (1), James Green (1), James Gilmour (5), John Gilmour (2), William Greenlee (1), John Greenlee (4), Edwd Gallahan (1), John Gibson (1), Thomas Heatherly (1), John Hickman (2), Saml Hickman (1), Thomas Harris, John Hitchens (1), Edward Harkins (1), David Leard (1), Cornelius Levine (1), Culley Logan (1), John Lucus (1), Hugh Logan (1), John Logan (2), Thomas Logan (2), William Logan (1), Samuel Linsey (3), John Maxwell (2), James Maxwell (1), William Maxwell (2), Thomas Maxwell (1), Samuel McNabb (1), James Moore (2), James McCown (1), Jame McElhiney (1), Robert Moffet (1), Richard Mathews (2), John Mathews (1), William Mathews (2), Edward McGinnis (1), John murray (2), Samuel Miller (1). John McCoy (1), George McKnight (1), James McGavock (2), Joseph McBride (1), Henery Miller (1), James McCorun (1), John Mitchel (3), Arthur McClure (2), James Neal, William Neal, John Peery Sr, John Peery Jr (1), Thomas Peery (1), Audly Paul (2), John Poage (2), William Poague (1), Robert Poague (1), John Paxton (2), Stephen Redmon (1), John Robinson (1), William Robinson (1), Joseph Reed (1), Christian Roads (1), John Richey (1), Robison Isabells (1), John Sterling (1), Robert Shannon (1), David Scott (2), John Scott (1), James Scott (1), Willerm Skilleron (3), James Skidmore (1), Thomas Stephenson (1), David Smyth (3), James Simpson (4), George Skileron and overseer (10), Geiorge Sally (2), Alexander Stuart (3), Edward Trimines (1), Christian Talby (1), George Taylor (1), James Taylor (1), John Tilery (3), Christian Vineyard (1), David Wallace (1), Samuel Walker Jr (2), John Walker (2). John White (1), George Wilson (1), Jonathon Whitly (4), James Whitley (2), John Ward (1), John White (1), 17862=3 Aug. 1771557,838, 109300=     John Berry appeared once in the 1771 and twice in the 1772 Botetourt County tithable lists, and in each of these three tax lists there are two John Berrys, which means that two individuals bearing the name of John Berry were being identified. As documented by several Botetourt County deed records, one of these represents the John Berry who married Jane Campbell and the other represents the John Berry who married Hannah ? (unknown last name). In 1771 both John Berrys were included on Benjamin Estill’s list, here referred to as “The Forks of the James District”, which, according to the Botetourt County court records, was located in the valley between the mountain uplifts as along both forks of the James River. (Figures 112, 121 and 123) It should be noted that the John Berry acreage shown in Figure 123 does not represent this John Berry’s land, but that of his cousin who married Jane Campbell. In 1772, both John Berrys first appeared in James McGavock’s list, who, apparently took over “The Forks of the James District” tithable list from Benjamin Estill that year, but later in 1772 they both appeared in the Lower Holston Valley District, which was one of Robert Doaks’ tithable lists in the Holston Valley of southwestern Virginia. (Figures 115 and 122) Although the military units were not differentiated, both of the John Berrys appeared on the Holston valley militia list of either Captain Looney or Captain Bledsoe. The Botetourt tithable data clearly demonstrate that both John Berrys lived in the forks of the James area in 1771 and early 1772, but moved to southwestern Virginia later in 1772. John and Hannah’s third child, Elizabeth (Betsy) Berry, was born in the early winter of 1771, which was during the time period that the family was still living in the forks of the James River.20,241,242,556,564,750, 59057=16 May 1781196, 173596=     In the early 1770s Kentucky was still a hunting ground for both whites and Indians, sparsely populated with bands of Shawnee hunters from the north, Cherokee hunters from the south and the white Long Hunters from the eastern side of the Appalachian Mountains. Virginia claimed the territory and, beginning in 1773, politically organized it as part of Fincastle County. The Virginia governing elite planned on using the area as bounty land for veterans of the most recent colonial conflict, known in America as the French and Indian War, and soon sent surveyors out to begin measuring and parceling out land for ultimate distribution as Treasury Warrants and bounty lands. The first attempt at white settlement of Kentucky occurred in 1773 when Daniel Boone led a group of predominantly North Carolina families into the vast uncharted territories. An atrocity in which several young men of the group were captured, tortured and murdered by Shawnee warriors began a cycle of violence that quickly spun out of control throughout the region. In Kentucky and the surrounding areas, 1773 and 1774 came to be characterized by uncontrollable and increasing violence between Indians and whites, leading ultimately to Dunmore’s War and the Battle of Point Pleasant in the fall of 1774. While the battle was far from an overwhelming victory for the encroaching white settlers, it brought a temporary and uneasy peace to the region. Taking advantage of the lull in fighting, surveyors flooded Kentucky, marking the best land in the rich Bluegrass Region for Virginia’s war veterans. It was in the fall of 1774 that James Harrod led a group of Pennsylvanians into the area and began building a fort at what would soon become known as Harrodsburg. (Figure 124) The fall of 1774 also saw Richard Henderson begin negotiations with the Cherokee on a private purchase of Kentucky land. In the spring of 1775 the deal was sealed at Sycamore Shoals on the Watauga River, a tributary of the Holston River in modern day Tennessee, and, immediately thereafter, Daniel Boone led a group of North Carolina and Virginia families through the Holston, Clinch and Powell river valleys, between the elongated ridges of what are now known as the Great Smoky Mountains, to the Cumberland Gap, and then northward and westward to settle at a place they called Boonesborough in the middle of the Bluegrass Island on the Kentucky River. (Figure 124) Eventually, this route and its variations, would become known as the Wilderness Trail. Following closely behind, Benjamin Logan led another group of settlers into Kentucky, but, just south of Boonesborough, they veered off toward the Ohio River to create a settlement along the extreme southern edge of what would eventually be called the Bluegrass Region at what would soon be called Logan’s Fort near Dix/Dicks River, a southern tributary of the Kentucky River and its feeder river, the Hanging Fork. (Figure 124) Squatters, surveyors and hunters flooded into Kentucky through the rest of 1775. By the winter unrest between the Shawnee and the new white arrivals erupted into another round of violence that lasted several more years. The flavor this time, however, was somewhat different in that the British now aided, armed, supplied and advised the Indians in their attacks on these western American settlements.858  , 153342=    In 1774, the territory between the Monongahela and Ohio Rivers was claimed by both the Pennsylvania and Virginia colonies, and Dunmore’s War, a short campaign against the Shawnee, was fought as much to protect the settlers on the frontier from the Shawnee and their Mingo allies as it was to ensure Virginia’s control over this area. The Shawnee were also responsible for many of the attacks on settlers in southwestern Virginia, in particular, a flare up of hostilities which briefly emptied the Holston Valley of white settlers in 1771, so the militia units from these areas were also called up to participate in a campaign against their Shawnee tormentors.885,895,896,897, 78884=Rockbridge County, Virginia Will Book 1, pages 429-430 In the Name of God Amen I William Berry Sr of Rockbridge County and State of Virginia Being weak in body But of perfect Memory thanks be Given to the almighty God for the same and Calling to mind the Mo[rta]lity of my Body an knowing that it is appointed for all men once to Die Mak[e and] Ordain this my last will and testament in the manner and form following first I Recommend my Soul into the hands of God that gave it and my body to the [ground] to be Buried in a Christian and desent Manner at the Diseration of my Exec[cutor] and as tutching Such worldly Estate as it hath pleased God to bless me with in th[e] I Give and Dispose of the Same in Manner and form following Im promist I Give [and] Bequeath to my son James Berry the one half of this Plantation thu and my s[on] William Berry now lives on to him his heirs & assigns forever and the other half of s[aid] to my son William Berry & his heirs and assigns forever orterwies my son William Berry is to have it at his Choice to pay sd James Berry the just sum of one hundred fifty pounds after my just Debts is paid and retain the whole of sd lands for Ever also my Negrow man Namd Ralph after my Death is to be Valued By sd James and William Berry or Some other fit persons chosen for that Purpose and the price of s[aid] Negrow to be Equally Divided Betwixt the sd James and William Berry or their he[irs] still referring to William Berry his choice like the of the land I also Beq[ueath] to my son John Berrys heirs the Just sum of five Pounds I required that my s[ons] James and William Berry Each is to pay fifty shillings to the heirs of s[on] John Berry now Deceased I Bequeath to my Daughter Mary Berry my W[earing] Coat and her Coalt and a Saddle and two cows and two heifers those to [have] her Choice with her Bed and furniture and the rest of my houshold furnitu[re] such as puter and pots I allow to be Divided between my two Daughters Mary and Jane Berry My Negrow wench named Ann I Leave to my Daughter Mary Berry to be hers and her Assigns forever the rest of Moveble Estate I allow to be Divided Between my two sons James and William Berry Excepting one Mare Named Trim that I allow to Become the property of my Son James Berry at my Decease Likewise to my Daughter Jane Berry I Bequeath five shillings sterling in Room of her Birthright and to my Daughter Nancy McCampble I bequeath five shillings sterling in Room of her Burthright Likewise my Daughter Mary is to have her Mentainence off the planatation and I Do Constitute and appoint my two Sons James & William Berry Executors of this my last will and testament in Witness whereof I Have Set my hand and Seal this sixteenth Day of February in the Year of our lord one thousand seven hundred & Ninety one. Signd Seald Published Pronounced and Delivered by the sd William Berry Senr William Berry (X his mark) to be his last will and Testament in Presents of John Berry Chs Berry, 49306=6 May 1774844, 72366=Lincoln County Virginia/Kentucky Order Book No 3, 1786 - 1791, page 35 John Brown, John Preston and John Breckenridge, Executors of William Preston, dec'd, who with Andrew Lewis and William Campbell, both dec'd, were Executors of John Bohannon, Dec'd v Valentine Harman, on debt. There came a jury composed of John McGill, John Berry, Walter Dewitt, James Robinson, George Hems, John James, John William How, Marvel Nash, Samuel Emerson, William Dryden, Hugh Ross and James McClure, who found that the defendant had paid the debt. On the motion of the plaintiff by his attorney, the verdict of the jury is set aside and a new trial granted upon plaintiff paying the costs of this trial, it appearing to the court that the verdict is contrary to the evidence., 7922=Middle Tennessee Connections, Will of John Berry Family History Data in the Files of Donna Fischer Birth of James Berry (~1767/1770 - ?) in Augusta County, Virginia, 115966=     Just over a year after John and Hannah had purchased their land parcels in the forks of the James, they began selling it. In the late summer of 1772, John and Hannah sold their 48 acre parcel to their neighbor, John Jones, and less than a year after that, in the late spring of 1773, they sold the other parcel (79 acres) to Samuel McNabb, who was also listed in the 1770 Botetourt County tithable list, and, therefore, was a somewhat nearby resident. While they could have still been living in James River area when they sold their first plot, by the time they sold their second plot, based on the evidence of the Botetourt County tithable records, they were definitely living the part of southwestern Virginia included within Fincastle County. Their next child, Joseph Berry, was born in the spring of 1773, and, consequently, since the family had moved to the Holston valley by that time, in Fincastle County.56,196,557,568,836,838,841,843, 220271=1776, 70206=Lincoln County Virginia/Kentucky Order Book No 2, 1785 - 1786, page 115 Parmenus Briscoe to pay John Berry 100 pounds tobacco for four days attendance as a witness for him against Caldwell. Also to pay William Crowdus 75 pounds tobacco for three days attendance. George Caldwell to pay William Henry 50 pounds of tobacco for two days attendance as witness for him., 70740=8 Jan. 178620,562,564,851, 119724=On several occasions from the late 1760s through at least the middle to late 1770s, both John Berrys lived in the same county. Both John Berrys lived in the forks of the James area in Augusta and Botetourt Counties in the late 1760s and early 1770s, and both then moved to the Lower Holston valley of Botetourt and later Fincastle County in late 1772., 60957=Fayette County Kentucky Records, Record Book A, p.1 That on October 19, 1782 William McCracken since deceased, executed bond for conveyance of 300 acres in Clark County next to Samuel Henderson to John Berry. \"I, William McCracken of County of Lincoln, State of Virginia, am bound unto John Berry, this 19th day of October 1782; conditioned, I have sold to said Berry 300 acres of land on Stoner Fork of Licking, said land obtained by virtue of settlement and preemption. said Berry to have choice of my spring on the whole tract if he attend to surveying of same.\" (signed) William McCracken. Witnessed by Cyrus McCracken and Senaca McCracken., 138465=     The fourth problematical Fincastle County John Berry record constitutes a militia listing for 1774. A John Berry was included on Captain William Russell’s militia list for service in the Battle of Point Pleasant against the Shawnees and their allies which took place on 10 October 1774 at the point where the Kanawha River empties into the Ohio River in present day West Virginia. William Russell’s company was recruited from settlers living in and around his private fort at Castlewood, which is located in the Clinch River valley. (Figure 82) Since John Berry and Jane Campbell spent their lives in the Wolf Creek settlements along the South Fork of the Holston River near modern day Abingdon, in Washington County, Virginia, it does not seem likely that they were living in further west in the Clinch River valley. Furthermore, Castlewood served as a jumping off point for settlers migrating westward to Kentucky, which is exactly what John and Hannah Berry did by the mid to late 1770s. Consequently, it seems logical to assign this militia record to John and Hannah Berry.885, 203413=Land Office Treasury Warrant # 13803 £1371 for 865.5 acres On both sides of the Doctors fork on the Chapling in Mercer County Entered: 14 Aug 1782 Surveyed: 27 Dec 1793 Granted: 25 June 1795 Entered: 10 Feb 1783 – 400 acres Entered: 02 Feb 1784 – 456.5 acres, 73471=Lincoln County Virginia/Kentucky Order Book No 3, 1786 - 1791, page 38 William Calmes Smith v Andrew Fallin, on trespass, assault and battery. There came a jury composed of James McClure, Henry Cook, William Goggin, John Berry, Thomas Kennedy, William Dougherty, William Montgomery, John McGill, Philip Hammond, William Baird, Thomas Baird, Thomas Ball and William McCormak, who found that the defendant is guilty as alleged and assessed damages of 30 pounds. Verdict accordingly, plus costs., 15500=Ledger of Samuel Finley Campbell, 1845 Family History Data in the Files of Donna Fischer Will of John Berry Elizabeth (Betsy) Berry born in Botetourt County, Virginia (11 Feb. 1771 - 9 Aug 1838), 229381=01 June 1782, 125047=My grandfather, John Berry, married Jane Campbell, I think in Virginia, and perhaps were born in that state though I think both were of Irish descent. They married not far from 1765. I think grandfather was left an orphan quite young, and was an only child. Grandmother had brothers, William, Charles, and Robert. I have no correct knowledge of their history more than William died in Virginia without children. Grandfather died about middle age. Grandmother was 85 or 90, lived a long while with my father and died there. Their children, most of them born in Washington Co., Virginia, were, I believe, as follows: first William, Hugh, Sarah, John, Thomas, Jane, Nancy, and James., 228424=29 June 1780, 58569=George Rogers Clark and His Men: Military Records 1778-1784 Lt. Pettot Company Militia, Lincoln County, Virginia A Pay role of Lieut. Benjn. Pettot Company of Lincoln Militia in Actual Service by Order of Col. John Logan to Guard the Frontier 1781 (doc #167) 22 May – 21 June 1781 John Berry, 6394=16 Oct. 176520,555, 42061=Botetourt County, Virginia Deed Book 1, page 526 LDS Microfilm # 30702, Botetourt County Virginia Deed Book 1, volumes 1 and 2, 1770 - 1780 This indenture made the ninteenth day of June in the year of our lord one thousand seven hundred and seventy three between John Berry of the county of Botetourt of the one part and Samuel McNabb of the aforesaid of the other part Witnesseth that for and in consideration of the sum of thirty five pounds current money of Virginia the said John Berry in hand paid by the said Samuel McNab at or before the sealing and delivery of these presents the receipt whereof he doth thereby acknowledge and thereof doth release acquit and discharge the said Samuel McNab his heirs executors and administrators by these presents he the said John Berry hath granted bargained and sold aliened released and confirmed and by these presents doth grant bargain sell alien release and confirm unto the said Samuel McNab in his actual possession now being by virtue of a bargain and sale to him thereof made by the said John Berry for one whole year by indenture bearing the date the day next before the day of the date of these presents and by force of the statute for transferring uses into possession and his heirs one certain tract or parcel of land containing seventy nine acres lying and being in the county of Botetourt on the south side of James River and is bounded as follows (viz) Beginning at a white oak and ash on the river below the head of a spring corner to John Jones land and thence with a line of the same south thirty two degrees west one hundred and twenty poles to a black oak south seventy nine degrees west twenty two poles to a black oak and gum south five degrees east thirty poles to a hickory south seventy four degrees east ninety eight poles to a black oak and white oak north fifty five degrees east twenty four poles to two white oaks north fifty degrees east forty eight poles to a black oak and chestnut oak north thirty five degrees west sixty eight poles near to two poplars in a line of his old survey north fifty three degrees east seventy seven poles to an ash and white oak on the river and thence up the same ninety seven poles to the beginning And all houses buildings orchards ways waters watercourses profits commodities hereditaments and appurtenances whatsoever to the said premises hereby granted or in any part thereof belonging or in any wise appertaining and the reversion and reversions remainder or remainders rents issues and profits thereof and also all the estate right title interest use trust property claim and demands whatsoever of them the said John Berry of in and to the said premises and all deeds evidences and writings touching or in any wise concerning the same To have and to hold the said seventy nine acres of land and all singular other the premises hereby granted and released and every part and parcel thereof with their and every of their appurtenances unto the said Samuel McNab his heirs and assigns forever to the only proper use and behoos of him the said Samuel McNab and of his heirs and assigns forever and he the said John Berry for himself his heirs executors administrators doth covenant promise and grant to and with the said Samuel McNab his heirs and assigns by these presents that the said John Berry now at the time sealing and delivering these presents is seized of a good sure perfect and indefeasable estate of inheritance in the fee simple of and in the premises hereby granted and released and that he hath good power of and absolute authority to grant and convey the same to the said Samuel McNab in manner and form aforesaid and that the said premises are now and forever hereafter shall remain and be free & clear of and from all former and other gifts grants bargains sales dower rights & title of dower judgements to executors and title troubles charges & incumbrances whatsoever made done committed or suffered by the said John Berry or any other person or persons whatsoever the quitrents here after to grow due and payable to our soverign lord the king his heirs and successors for and in respect of the said premises on by excepted and foreprized (?) and lastly that the said John Berry and his heirs all and singular the premises hereby granted & released with their appurtenances unto the said Samuel McNab & his heirs and assigns against him the said John Berry and all and every other person or persons whatsoever shall and will warrant and forever defend by these presents John Berry Hannah Berry In witness whereof the said Jno Berry hath hereunto set his hand and seal the day and year first above written, sealed and delivered in the presence of Jno H Cloyd Harry Innis John Todd At a court held in Botetourt County 10th day of November 1779 these indentures of lease and release were proved by the oaths of Jno Floyd Harry Innis & Jno Todd Jr and ordered to be recorded Teste David May, 212169=     From 1775 through 1792 all able bodied men living in the Kentucky District were required to be connected to the local military command, which typically meant joining the militia unit based at the closest fortified station. Typical duties involved garrisoning the forts and stations, building houses, cultivating the fields and supplying food through hunting, as well as participation in raids and pursuit of attackers. Pressure was applied to comply and those failing to do so were often forced to leave the protection of the local fort or station. As evidenced by his participation in the 1781 Lincoln County militia, however, John Berry, clearly, did not fall into the category of settlers who shirked these duties. In the fall of 1780 with the splitting of Kentucky County into three parts, Col. John Bowman was reaffirmed as the overall commander of all Kentucky county militia units, and each resulting county, Fayette, Jefferson and Lincoln, was assigned its own militia officers. At the first meeting of the newly formed Lincoln County court on 16 Jan 1781 Col. John Bowman was appointed to the position of County Lieutenant, John Cowan was identified as one of ten militia company captains, Benjamin Pettit was named as one of eight lieutenants and Anthony Sodowski awarded the position of constable or sergeant for Captain Cowan’s Company. In the same month, Virginia Governor Thomas Jefferson commissioned Col. George Rogers Clark as a general to lead an expedition composed of Virginia troops from the Kentucky counties of Fayette, Lincoln, Jefferson, as well as Pennsylvanians from the former Virginia territory in Berkley, Hampshire, Monongalia and Ohio counties for a campaign against the British regional headquarters in Detroit. From their outpost in Detroit the British had been recruiting and supplying the native tribes, primarily Shawnee, Mingo, Delaware and Wyandot war parties, to conduct raids against the frontier settlements in an effort to drive the settlers out and force the Americans to divert precious military resources away from what the British considered to be the main theater of the war. George Rogers Clark believed that an assault on the British headquarters would ultimately secure Kentucky for the Americans, and ever since his successful campaign against British outposts at Kaskaskia and Vincennes, he had pursued the final solution of capturing Detroit. Several previous attempts had been canceled or failed due to insufficient supplies and troops, and, ultimately, that was to be the fate of this expedition.1041,1042,1043  , 219755=April 1779, 29941=Botetourt County, Virginia Deed Book 1, page 496 LDS Microfilm # 30702, Botetourt County Virginia Deed Book 1, volumes 1 and 2, 1770 - 1780 This indenture made the third day of September in the year of our lord one thousand seven hundred and seventy two between Jno Berry and Hannah his wife of the County of Botetourt of the one part and Jno Jones Senior of the said county of the other part Witnesseth that for and in consideration of the sum of thirty pounds current money of Virginia to the said Jno Berry and Hannah Berry in hand paid by the said Jno Jones on or before the sealing and delivery of these presents the receipt whereof they do hereby acknowledge and thereof doth release request and discharge the said Jno Jones and his heirs executors and administrators by these presents they the said Jno Berry and Hannah Berry  his wife hath granted bargained sold aliened received and confirmed and by these presents doth grant bargain sell alien release and confirm unto the said Jno Jones in his active possession now being by virtue of a bargain and sale to him thereof made by the said Jno Berry and Hannah Berry  for one whole year by indenture bearing date the day next before the day of the date of these presents and by force of the statute for transferring leases into possession and his heirs one certain tract or parcel of land containing forty four acres lying and being on the south side of James River in the county of Botetourt being part of a tract belonging to John Berry and is bounded as follows viz Beginning at a red oak and ash on the river corner to Skidmore’s land and thence in a line of the same south thirty degrees east one hundred and thirty six poles to two black oaks west twenty two poles to two black oaks south five degrees east thirty poles to three hiccory saplins corner to George Wilson’s land and in a line of the same south seventy four degrees east one hundred poles to a black oak pine North fifty five degrees east two poles to a white oak and black oak and north seventy five degrees west ninety eight poles to a hiccory North five degrees west thirty poles to a black oak (?) and lynn North seventy nine degrees East twenty poles to a black oak & north thirty two degrees East one hundred and twenty poles to a white oak and ash on the river below the head of a spring and thence up the river one hundred and twenty five poles to the beginning And all houses buildings orchards ways waters watercourses profits commodities hereditaments and appurtenances whatsoever to the said premises hereby granted or any part thereof belonging or in any wise appertaining and the reversion and reversions remainder or remainders rents issues and profits thereof and other all the estate right title interest and trust property claim and diversion whatsoever of them the said Jno Berry and Hannah Berry of in and to the said premises and all deeds licenses and writings touching or in any wise conveying the same To have and to hold the said forty four acres be the same more or less and all and singular other the premises hereby granted and released and every part and parcel thereof with their and every of their appurtenances unto the said Jno Jones and his heirs and assigns forever to the only proper use and behoos of him the said Jno Jones and of his heirs and assigns forever and the said Jno Berry and Hannah Berry for them their heirs executors and administrators doth covenant promise and grant to and with the said Jno Jones and his heirs and assigns by these presents that the said Jno Berry and Hannah Berry now at the time of sealing and delivering of these presents are seized of a good sure perfect and indefeasible estate of inheritance in fee simple of and in the premises here granted and released and __ they hath good power and lawful and absolute authority to grant and convey the same to the said Jno Jones in manner and form aforesaid and that the premises are and are forever hereafter shall remain and be free and clear of and from all former and other gifts grants bargains sales dowers receipt and title of dower judgements and execution titles troubles charges and incumbrances whatsoever made done committed or suffered by the said John Berry and Hannah Berry or any other person or persons whatsoever the quitrents here after to grow due and payable to our soverign lord the king his heirs and successors for and in respect of the said premises on by excepted and foreprized (?) and lastly that the said John Berry and Hannah Berry and their heirs and all and singular the premises hereby granted & released with their appurtenances unto the said Jno Jones & his heirs and assigns against them the said John Berry and Hannah Berry and their heirs and all and every other person or persons whatsoever shall and will warrant and forever defend by these presents In witness whereof the said Jno Berry and Hannah Berry hath hereunto set their hands and seals the day and year first above written John Berry Hannah Berry Sealed and delivered in the presence of John Jones, Thos Harrison, James Berry At a court held for Botetourt County by the 8th day of September 1772 These indentures of lease and release were proved by the oaths of John Jones Thos Harrison & Jas Berry and ordered into record Teste David May, 89144=Fayette County Kentucky Records, Record Book A, p.1 Mathew Patton and James Crocket v. Richardson Allen and Pamelia Allen, his wife, now of Scott County, Kentucky. Suit filed March 3, 1802 in the late district court. Petition recites \"That on October 19, 1782 William McCracken since deceased, executed bond for conveyance of 300 acres in Clark County next to Samuel Henderson to John Berry. That on September 2, 1795, James Berry and William Berry, the legal representatives of said John Berry, assigned said bond to complainants; that a patent for land described has been issued and was granted to said McCracken himself. That McCracken having departed this life left Pamelia (called Milly McCracken), his heir at law, who has since intermarried with a certain Richardson Allen. Orators have made choice of that part of land which they desire under bond but defendants have refused to convey.\" Surveyor of Clark County directed by Court to survey land chosen by complaintants. Bond filed as exhibit recites: \"I, William McCracken of County of Lincoln, State of Virginia, am bound unto John Berry, this 19th day of October 1782; conditioned, I have sold to said Berry 300 acres of land on Stoner Fork of Licking, said land obtained by virtue of settlement and preemption. said Berry to have choice of my spring on the whole tract if he attend to surveying of same.\" (signed) William McCracken. Witnessed by Cyrus McCracken and Senaca McCracken. \"We do assign unto Mathew Patton and James Crockett all right of within bond ...\" (Signed, James Berry, William Berry). Witnessed by John MaGill, attorney in fact for James Berry and William Berry; also Jean MaGill and Robert Crockett. Notice of land selected: \"We have made a choice of a spring in the bounds of your lands agreeable to the bond given, and agree to take the land adjoining Samuel Henderson's old line ... to include the spring.\" Copy delivered to Milly Allen, wife of Richardson Allen at his house in Scott County, April 16, 1802. Decree issued according to agreement., 122633=     Hugh Campbell Berry, a son of Hugh Berry, John and Jane’s oldest son and therefore a grandson of John Berry and Jane Campbell, wrote a brief family history in 1875, which is extremely critical in understanding the orphan issue. The section of his family history narrative covering his paternal grandparents is reproduced below, and in this passage he notes that his grandfather was an orphan. He also noted that his grandfather, was an only child. This secondary source material clearly identifies which John Berry was the orphan. It also shows that Hugh Campbell Berry was unaware of the existence of his grandfather’s two older brothers, William and James. Definitive primary source data for these two brothers (William and James) is limited to the early 1750 Augusta County court records covering the orphans of James Berry, so it is quite likely that they either passed away when quite young, remained in Augusta County or left the area and never returned. The absence of Augusta County primary source records that can be definitively attributed to them, other than the orphan records, seems to support the interpretation that they passed away when they were young. In any case, their existence was clearly not known by their brother’s grandson by the late 1800s. In addition, William Berry, the father of the other John Berry, is clearly documented in Augusta County records until his death sometime between 1791 and 1893, so, obviously, there was no orphan issue in that lineage. It should also be noted that this John Berry had a number of well documented brothers and sisters, several of whom, remained in the Augusta County area at least until the mid 1790s, so it seems extremely unlikely that there would be any family history of that John Berry having been only child. All of the available evidence, particularly the family history presented by Hugh Campbell Berry, quite strongly points to the conclusion that the John Berry who married Jane Campbell was the Berry orphan documented in the Augusta County records.29,100  , 203934=Land Office Treasury Warrant # 9893 £1600 for 600 acres on Chaplains Fork in Lincoln County Entered 1500 acres for Wm Waddy : 14 Dec 1781 Surveyed 600 acres for John Berry: 27 Dec 1782 Granted: 02 Dec 1785, 156067=     Upon gaining political top cover, Dunmore immediately headed west, and by early September was at Fort Pitt in the final phases of a treaty with the Delaware and Six Iroquois Nations, which not only protected his flank during his attack on the Shawnee, but was also intended to lay the groundwork for ensuring Virginia’s claim on the West Augusta area. Both the treaty of Stanwix, and the Dunmore accord, with the implicit agreement of the Native American parties involved, specifically omitted the Shawnee and their allies, who actually occupied and therefore technically owned the areas under contention. The Iroquois essentially sacrificed their Shawnee brethren in a series of ultimately unsuccessful strategic moves that were intended to deflect the inevitable European expansion away from their homeland, while the British successfully used the strategy of “divide and conquer” to isolate the Shawnee. When Dunmore went after the Shawnee, it was with the full knowledge that they had been hung out to dry and no opposition would be expected from the Iroquois Nation. As soon as the treaty was signed he hurriedly marched his army south and west along the Ohio to meet up with Col. Lewis. The latter had been concentrating his militia, including most of the Fincastle militia units, at Camp Union, located near the present site of Lewisburg, West Virginia, and, by mid September, was proceeding to the designated meeting point at the confluence of the Kanawha and Ohio Rivers. On 6 September the first group composed of about 600 men and led by Col. Lewis’ younger brother left Camp Union, followed a week later by Col. Lewis with the remaining 500 men. Col. Christian with an additional force of 200 men from Fincastle County were slated to arrive at Camp Union on the 26th of September and join Lewis’ forces at the mouth of the Kanawha. (Figure 83)885,895,896,897     , 220176=1400, 129854=     There are four Fincastle County John Berry data entries from between 1772 and 1774 and one Washington County court record from the fall of 1777 that contain none of the overt clues that would define which John Berry was responsible for the records: a Fincastle County petition requesting the services of a Presbyterian minister, a Fincastle County road order, a Fincastle County land record, a Fincastle County militia listing, a Washington County court record. Each will be examined and the logic for the assignment to a specific John Berry outlined., 75110=Uncle John Berry was born 1787 in Lincoln County, Kan. Died Aug. 28th 1871, in Monroe County, Iowa, 236976=     In the early winter of 1786 at Stanford in Lincoln County, a daughter, Jennie, was born to John and Hannah Berry. Just over a year later John Berry served his last stint on a Lincoln County jury, and in the early winter a 1788 their last child, John P. Berry, was born in Lincoln County. In the summer of 1789 John Berry wrote his will. Since he was only about 50 years old at t he time, it is likely that he was quite ill and clearly understood that his time was nearly at an end. In the summer of 1790 his will was presented in court so he must have passed away sometime between 10 August 1789 when his will was written, and 20 July 1790, when it was presented in court. Further confirming the fact that this is the John Berry who served in the Lincoln County juries, after his death, there are no John Berrys in the Lincoln court records, except for those entries related to his estate., 71878=Virginia Tax Payers 1782 - 1787 and Early Kentucky Householders 1787-1811 Lincoln County, Virginia (later Kentucky) Tax List John Berry, 8990=Augusta County, Virginia Will Book 4, page 404 IN THE NAME OF GOD AMEN I John Berry of the County of Augusta and Colloney of Virginia being weakly of body but of perfect mind and Memory thanks be given to Almighty God there fore Considering the Mortallity of my body Knowing that it is appointed for all men once to die I do Make & Ordain this my last will and Testament that is to say Principally first of all I recommend and Commite my soul into the hands of Almighty God who gave it and my body to the Earth decently buried at the discretion of my Executor doubting nothing but I shall receive the same again by the Mighty Power of God at the General resurection and as Touching what estate it hath Pleased God to bless me with in this life I give devise & dispose of the same in the following Manner and form Impremis it is my Will and I do order that all my lawful debts and funeral charges be fully Paid and Satisfyed Item- unto Mary my Daughter one Pounds five shillings Curant money of Virginia I likewise give and bequeath unto John Neisbit six shillings and six Pence Curent Money of Virginia Item - I give and bequeath unto John Berry sun of James Berry deced. six Pounds Current Money of Virginia I give and bequeath unto John Berry sun of William Berry ten pounds Current Money of Virginia Item- I give & bequeath unto John Berry Sun of Francis Berry ten pounds Current Money of Virginia Item- I give & Bequeath unto Fra Berry Wheel right five pounds Current Money of Virginia Item- I give and Bequeath unto Mary Berry daughter of William Berry Fowar (4) Pounds Current money of Virginia Item I give and Bequeath to her Sister Elizabeth Berry Six pounds Current money of Virginia Item- I give and bequeath unto Elizabeth Berry Daughter of Charles Berry five pounds Current money of Virginia Item- I give & bequeath unto my Daughter Rebecca Berry twenty pounds Curent money of Virginia I likewise Constitute and appoint my trusty friends Alexander Walker Wheel wright & William Edmoston sole Executors of this my last will & Testament and do hereby disanul & revock all other Wills or Testament by me made declaring & Publishing this my last Will and Testament In witness whereof I have here unto set my hand & seal this tenth day of October in the year one thousand seven hundred and Seventy Published & Pronounced in the presence of us: John Berry John Walker John Walker, Junior James Walker Francis Berry, 47505=Annals of South West Virginia 1769-1800 At a court continued and held for Fincastle County Ordered that Jos. Black Andrew Colvill Saml. Ewen, Wm. Blackburn, George Blackburn, Saml. Briggs, David Gatwood . Jn. Berry, Christopher Aklin, Jn. Kerick, Jn. Vance and Benj. Logan do clear the nearest and Best way from Saml. Briggs on the Eighteen Mile Creek to James Bryant's on the Eleven Mile Creek., 69026=17 Feb. 1785847, 83856=Lincoln County, Kentucky Marriage Bonds These are to License and permit you to Join together in the Holy State of matrimony Jonathan Moore and Sarah Berry according to the rites and Ceremonies of your Church and for so doing this shall be your Sufficient Warrant given under my hand this 27th day of Jany 1794. To any Minister of the gospel legally authorized to Solemenize the rites of marriage Hugh Logan This is to certify that I am willing to a Contract of Matrimony between Jonathan Moore & my Daughter Sarah. Given under my hand this 27th Day of January 1794. Hannah Berry Test Samuel Moore, Wm. Berry, 26086=Botetourt County, Virginia Deed Book 1, page 496 LDS Microfilm # 30702, Botetourt County Virginia Deed Book 1, volumes 1 and 2, 1770 - 1780 This indenture made the third day of September in the year of our lord one thousand seven hundred and seventy two between John Berry and Hannah Berry his wife of the County of Botetourt of the one part and John Jones Senior of the same county of the other part Witnesseth that the said John Berry and Hannah Berry for and in consideration of the sum of five shillings current money of Virginia to them in hand paid by the said John Jones Senior on or before the sealing and delivery of these presents the receipt whereof is hereby acknowledged Hath granted bargained and sold and by these presents doth grant bargain sell unto the said Jno Jones one certain tract or parcel of land containing forty four acres lying and being on the south side of James River in the County of Botetourt being part of two tracts belonging to Jno Berry and is bounded as followeth viz Beginning at a red oak and ash on the river corner to Skidmore’s land and thence in a line of the same south thirty degrees east one hundred and thirty six poles to two black oaks west twenty two poles to two black oaks south five degrees east thirty poles to three hiccory saplins corner to George Wilson’s land and in a line of the same south seventy four degrees east one hundred poles to a black oak pine North fifty five degrees east two poles to a white oak and black oak and north seventy five degrees west ninety eight poles to a hiccory North five degrees west thirty poles to a black oak (?) and lynn North seventy nine degrees East twenty poles to a black oak & north thirty two degrees East one hundred and twenty poles to a white oak and ash on the river below the head of a spring and thence up the river one hundred and twenty five poles to the beginning And all houses buildings orchards ways waters watercourses profits commodities hereditaments and appurtenances whatsoever to the said premises hereby granted or any part thereof belonging or in any wise appertaining and the reversion and reversions remainder or remainders rents issues and profits thereof To have and to hold the said forty four acres be the same more or less and all and singular other the premises hereby granted with the appurtenances unto the said Jno Jones and his heirs executors administrators and assigns from the day before the date hereof and during the full term and time of one whole year from thence and conveying fully to be complete and ended(?) yielding and paying therefore the rent of one peppercorn on Lady Day next if the same shall be lawfully demanded so the intent and purpose that by virtue of these presents and of the statute for transferring leases into possession the said Jno Jones may be in actual possession of the premises and be enabled to except and take a grant and release of the reversion and inheritance thereof to him and his heirs In witness whereof the said John Berry and Hannah Berry hath hereunto set their hands and seals the day and year first above written John Berry Hannah Berry Sealed and delivered in the presence of John Jones Thos Harrison James Berry, 6880=8 Nov. 176621, 59910=The Kentucky Genealogist, Vol. 13, No. 4, October – Dec. 1971 At a court held for Lincoln County, Kentucky Sarah Crutchfield, Abraham ?, John Philips, John Drake, Sen., Benjamin Drake, Jun., Benjamin Drake, Younger, John Drake, Jun., John Hamilton, Agnes Mather, John Rutherford, William Smith, William Glover, John Eastes, George Flin (?), John McClure, Joseph Hogan, John Berry, John Carey, Isaac Certain, John Certain, Richard Glover and John McAnnelly proved to the Court that they were not able to procure lands at the State price, whereupon it is ordered that the Surveyor of this County lay off for each of them respectively any quantity of land not exceeding four hundred acres., 5141=~1742, 204440=     John Berry, son of Richard Berry, began his Lincoln County land acquisition in 1782 when he purchased part of a 1500 acre tract located along Chaplin’s Fork in Lincoln County from William Waddy (Table XXXVII), who had paid for the land warrant in late 1781. John Berry also filed an entry for 400 acres of land from the same Treasury Warrant in February 1783 then submitted an amendment for the rest of the acreage from Waddy’s original treasury warrant in 1784. About a year later, John Berry’s 600 acre tract was surveyed and three years later the paperwork granting him title to that 600 acre parcel of land was finally completed. All of this data, as well as his father’s land record, seems to confirm the presence of John Berry in Jefferson County, Kentucky, possibly as early as late 1779, and in Lincoln County in 1782. When Mercer County was created from part of Lincoln County in 1785, his newly acquired land fell into the territory of the new county, so he only lived in Lincoln County for three years – from 1782 through 1785. Consequently, the only Lincoln County records that could be confused with John and Hannah Berry would be those that were recorded between 1782, when the Chaplin Creek John Berry first purchased land in Lincoln County, and 1785, when Mercer County was carved out of Lincoln County. A third John Berry can be identified from the Lincoln County militia records, but, as will be demonstrated, he also lived in the portion of Lincoln County that was carved out to form Mercer County, so any Lincoln County records after 1785 would not be attributable to him either.36,968,1035,1036  , 23794=Botetourt County, Virginia Tithables, 1770 – 1782, 1783 – 1789, Reel 149, The Library of Virginia, Land Tax Records, 1782-1900 A List of Tithables in Capt. Bledsoe & Capt. Loony’s Company William Keneday (1) , Augustus Webb (1), James Dolchester and son James (2), James Fulkerson and slave (2), Andw Colwell (1), John Cusik (1), George Blackburn (1), Wm Blackburn (1), John Vanc (1), John Rowark (1), James Young (1), William Young (1), William Davison and slave (2), Joseph Vance (1), Sam Vanc (1), Joseph Black (1), David Getgood (1), Jacob Young (1), Daniel Young (1), Henry Stamply and son George, Samuel Briggs (1), Ben Loggan & slave (2), John Huseton (1), Robert Deniston (1), John Long (1), Alexander Breckenridge (1), Lantz Armstrong (1), Josiah Gamble (1), John Brady (1), Robert Craig (1), John Sharp (1), Thomas Sharp (1), John Sharp Junr (1), Henry Grahm (1), Thomas Brooks (1), Catleton Brooks (1), John Hunt (4), John Segrant (1), William Parker (1), Daniel Flanery (1), Anthony Walker (1), Stephen Jordon (1), Roger Top (1), Alxd Laughlen (1), Christopher Guice (1), Michael Guice (1), Robert Trimble (1), James Piper (1), Thos. McCullock (1), James Harre (1), Halbert McCluer (1), William Davis (1), Michael Fain (1), David Loony & servants William Prince & John Bingle (3), Anthony Bledsoe & slave (2), Thomas Ramsey and sons William and Josiah (3), William Williams & son John (2), Richard Moor (1), Edward Morgan (1), Thomas Berry (1), James Gilmor (1), John Paterson (1), Andrew Martin (1), George Martin (1), William McGahy (1), John Berry (1), John Lowry (1), John Blanten (1), Thomas Baily (1), King Hoskins (1), Josiah Hoskins (1), John Berry (1), James Phillips (1), Isaac Riddle (1), Mic. Catron (1), Lorance Catron (1), Isaac Seb (1), Vincent Hobbs (1), 230648=22 June 1781, 64934=4 Sept. 17831010, 12067=Botetourt County, Virginia Tithables 1770 – 1782, 1783 – 1789 Benjamin Estill’s List From the south side of Buffaloe Creek to James River from mountain to mountain John Pearle (1) 70 acres, Edward Green (1), Patrick Gobin (1), James Cartmill (1) 200 acres, Thomas Pearle (1), James Pearle (1), John McCoy, Joseph Dinis (1), Stephen Redman (1), Wm. Neail (1), Wm. Maxwell (1), Jos. Maxwell (1), Jno. Cmpbell (1), Samuel Walker (2), Saml. Walker Jur. (1), Robt. Shanon (1), David Scott (1), Robt. Moffet (1) 170 acres, James Bartain (1), John Bartain (1), Samuel McNabb (1), Saml. Fargeson (1), John Lucas (1), James McCown (1), Geo. Taylor (2) 225 acres, John Skelton (1), Edly Paul (2) 398 acres, John Berry (1) 100 acres, John White (1) 180 acres, Edward McGinis (1), John Carnihan (1), Edward Murphey (1), Hugh Barclay (2) 625 acres, John Gillmore (2) 220 acres, Wm. Mickelheney (1) 214 acres, John Maxwell (2) 200 acres, Samuel Miller (1), John Walker (2) 359 acres, Richard Matthews (2) 400 acres, John Scott (1), Wm Logain (1) 300 acres, Wm Greenlee (1), Henery Bowin (2) 320 acres, James Mickelheney (1), John Starling (1), Thomas Maxwell (1), Joseph Scott (2), Geo Salley (2) 200 acres, John Greenlee (3) 1907 acres, John Hall (1) 130 acres, Stephen Arnold (4), Christian Tally (1), James Arnold (1), Wm Skillern (2), John Logain (3) 200 acres, Thos. Logain (1) 200 acres, Geo. Francisco (20 385 acres, John Murrey (3), John Cowardeen (2), Henry Kartmill (2), James Green (1), Edward Golehow (1), David Smith (2), Joseph Butler (1), John Jones (1), John Berry (1), James Berry (1), Peeter Dimon (1), William May (1), Hugh Logain (2) 125 acres, Thos. Stevenson (1) 118 acres, Andw Boyd (7), Geo. Skillern (9) 1137 acres, William Cross (1), Reachal Bowin (1), Widow Bowin 2), William Bowin (1), Robt. Bowin (1), Arther Bowin (1), Charles Bowin (1), Malcom Allen 2), James Allen (1), Wm Mathews (1) 2999 acres, James Simpson (3) 243 acres, John Poage (2), John Poage Jr (1), James McClure (1), Daniel McDonald (1), William Chapman (1), John Sollers (1), Patrick Brown (2), Jacob Cooper (1), Christian Rhods (1), Geo Campbell (1), Jacob Cleek (1), Mathias Cleek (1), Geo Dougherty (1) 85 acres, Wm Dougherty (1), Jos. Dougherty (1) 200 acres, John Hickman (1), Boltis Cleek (1), David Cloyd (1), James Cloyd (3), James Gillmore (5), Christian Vineyard (1) 300 acres, Conrod Wall (1), Joseph Colwell (1), Wm Laird, Edward Tumins (1), James Dilong (1), Rubin Lantern (1), John Wallas (1), Henry Turner (1), John Loyd (1), James Loyd (1), William Billbrew (1), Benjamin Estill (4) 238 acres, Alexr Baggs (1), Wm. Taylor (1), Geo McNight (1), Benjamin Watson (1), James Wilson (1), James Skidmore (1) 88 acres, Robert Whitley (1), Michael Francisco (1), John Watkins V 200 acres, James Moore (2), Geo Commings (1), Henry Eyres (1), Wm Croford (1), 58389=May - June 1781560, 206741=     The 1781 Lincoln County militia records document the existence of two separate individuals named John Berry, and, as just demonstrated, since the Chaplin Creek John Berry was not yet living in Lincoln County, these records define the existence of a third John Berry in the area. Payroll records of the Lincoln County militia record John Berry’s participation in George Rogers Clark’s 1781 campaign to oust the British from their western outpost in Detroit. The 1781 militia data for John Berry consists of two payroll lists for the time period between March and April of 1781 and a third payroll for the May through June time period. In the two March to April lists, one covers John Berry’s service in Captain John Cowan’s company, while the other list is for service for a John Berry in Lt. Benjamin Pettit’s company. Since both payroll records cover the same time period but different militia companies, these records must represent two different individuals by the name of John Berry. This interpretation is supported by the Kentucky land records. John Cowan, the captain of one of the militia companies, obtained a preemption on 1 November 1779 for 1400 acres of land on Harrods Creek where he had planted corn crops in 1774 and 1776. John Cowan was part of the original party of Pennsylvania settlers brought into the area by James Harrod, who established Fort Harrosdburg. These early settlers obtained land in the original town site, as well as additional acreage in the surrounding area. The John Berry that was a member of Captain Cowan’s company, therefore, must have lived somewhere in that vicinity in order to be a member of his militia company. Benjamin Pettit, the other militia leader mentioned in the payroll records, lived just south of Logan’s Fort since, based on his 1775 settlement, he had received a Preemption Treasury Warrant on 20 Oct 1779 for 1400 acres of land on the stream divide between the Hanging Fork of Dicks River and the Green River. The John Berry who served in Lt. Pettit’s company must have lived in this area in order to serve in his militia company. The third Lincoln County payroll list is for Lt. Pettit’s company, so it represents the John Berry living in the vicinity of Logan’s Fort. Since it is known that John and Hannah lived in the Logan’s Fort area, the militia payroll records for the John Berry in Lt. Benjamin Pettit’s company quite clearly represent the John Berry married to Hannah, while the other John Berry lived near Fort Harrodsburg. It should also be noted that Fort Harrodsburg fell under the jurisdiction of Mercer County when that county was formed in 1785, so the same logic applies to eliminating the Harrodsburg John Berry when assigning Lincoln County records after 1785. Since the only record of the Harrodsburg John Berry is derived from his 1781 militia service, there is no information on when he first arrived in Lincoln County. He certainly did not qualify for a Settlement Certificate or Preemption Warrant, so he did not arrive in Kentucky at an early date. Based on a lack of any additional data for the Harrodsburg John Berry and the fact that the John and Hannah Berry can be shown to already be living in the county, the pauper warrant in all probability, cannot be assigned to the Harrodsburg John Berry.560,968,1045  , 99531=     John Berry’s father, William Berry, can be documented as living in the northern end of the Borden Grant as early as 1746, remaining there until his death, which occurred sometime between 1791 and 1793. Quite clearly, then, this farm on Moffet’s Creek is where John Berry and his siblings grew up. (Figures 8, 10 and 11, Table II) John Berry married Hannah ? (unknown last name) at an unknown date, most likely in Augusta County, and their first child, William Berry, was born in the fall of 1765, and although there is no documentation for it, the marriage surely took place in Augusta County, Virginia. Based on John’s presumed birth date in the early 1740s, and the birth of his first child, it seems quite logical to assume that John and Hannah’s marriage took place not terribly long before the birth of that first child, possibly in 1764. Consequently, if he was born in 1740, he would have been 24 years old at the time of his marriage. If he was born in 1742, then he would have been 22 years old at the time.20,555,564,1028, 91436=9 Aug. 1803565, 202790=Land Office Treasury Warrant # 1432 £240 for 600 acres On Beech Fork below the mouth of Pleasant Run in Jefferson County Entered: 20 Oct 1799 Surveyed: 22 March 1784 Granted: 02 Dec 1785, 64501=Abstract to the George Rogers Clark Papers, Microfilm # 10 Appraisement of Lincoln County Militia horses, which were lost at Capt. Estill's defeat on March 23, 1783 Names: John Moore, John Berry, Stephen Hancock, William Millar, Robert Harris, Benjamin Logan, 61760=Preemption warrant # 79 Kentucky County We do hereby certify that Joshua Pennicks is entitled to four hundred acres of land in the district of Kentucky on account of settlement made in the year 1777 & residing in the county ever since lying on the waters of Stoners fork a branch of licking creek on both sides of the said fork joining the lands said to be claimed by Stephen Handcock below and that he said Joshua Pennicks is also entitled to the preemption of one thousand acres of land adjoining the said settlement given under our hands at Boonesborough this 20th day of December 1779 Willm Fleming, Stephen Trigg Edmund Lyne Test John Williams jr clk For value rec’d I assign & warrant the within certificate & lands therein mentioned to William McCracken as witness my hand this 23rd day of Dec 1779 Joshua Pennicks His mark Test Thomas Johnson Isaac McCracken(?) We the public auditors of the commonwealth of Virginia do certify that William McCracken hath delivered to us the Treasurers receipt for eight hundred pounds paid into the treasury of Virginia and that he the said William McCracken his heirs and assigns are entitled to two thousand acres of waiste or unappropriated lands within this commonwealth, pursuant to an act for establishing a Land Office and ascertaining terms and manner of granting waste and unappropriated lands. Given under our hands this sixth day of March 1780 James Cocke Edm Archer, 15962=3 Aug. 1771557,836, 216501=1781 Lincoln County Records – Estate Appraisal, 57216=George Rogers Clark and His Men: Military Records 1778-1784 Capt. John Cowans Militia, Lincoln County, Virginia A Pay Role for Captain John Cowans Company of Militia who were on actual duty from the 22d of Mar. to the 22d of April Inclusive 1781 for the defence of Lincoln County by order of Col. John Bowman (doc. #180) John Berry, 161378=     In mid August of 1774 John Berry’s Fincastle militia unit mustered at Russell’s fort, then marched to the New River valley where they joined up with Col William Christian’s militia units. After their rendezvous with Col. Christian, these citizen soldiers continued on down the New River Valley to its juncture with the Greenbrier River where they headed upstream to Camp Union near present day Lewisburg West Virginia. Here, they spent the rest of August and nearly the first two weeks of September waiting for militia units from the surrounding area to gel into the force known as the southern command. Throughout the trek and the subsequent wait, parties of hunters were sent out to hunt in order to provide the soldiers with food, and others drove the cattle herd. When the troops had reached a sufficient strength level, they were ordered to march across the trackless countryside through the steep mountain gorges of the Kanawha valley with the ultimate purpose of uniting with the northern command and attacking the Shawnee villages in present day central Ohio. That this was a long, tedious slog is shown by the fact that this segment of the trip took 25 days of slow, difficult marching through the rugged mountains. By 9 October the southern command had reached the Ohio River, and were immediately ordered to head north to unite with the northern command. Very early the next morning, while it was still dark, two hunters from Captain Shelby’s Fincastle militia company stumbled upon the main mass of hostile Shawnee and the battle began. From dawn to dusk, John Berry’s life that day must have consisted of intense, desperate and sometimes most likely seemingly hopeless, life or death combat in what has come to be known as the Battle of Point Pleasant. In an effort to flank the Shawnee attackers, Captain Shelby’s company was one of the units instructed to advance up the Kanawha River and occupy some high ground above and behind the enemy position. The maneuver was carried out quite successfully and soon the soldiers were streaming deadly fire into the rear of the Shawnee lines. This turned out to be a pivotal point in the battle, since the Shawnee leader, known as Cornstalk, mistook them for members of the northern command providing reinforcements to the besieged militia. At least two men from John Berry’s unit were wounded during the day long battle. For several days after the battle, as peace negotiations were being carried out in Ohio, the men that remained at the battle site buried the dead, cared for the wounded and built a small fortification. Eventually, the army marched back to Fincastle County and the men returned to their homes. John Berry, like all of the others, soon found himself back “home” in southwestern Virginia by late October or early November 1774. Months later, a commission was formed by the Virginia House of Burgesses to document and certify filings for the payment for militia participants, as well as public service claims by those who had provided support. John Berry filed such a claim, and it appears to have been approved.885,970,971,973, 192209=     During the mid to late 1770s a large number of settlers had been migrating into Kentucky and illegally occupying prime Bluegrass farm country – illegal in the eyes of the Virginia colonial government at least, since Virginia viewed this as their territory and much of the prime land had already been surveyed for Virginia veterans, mostly officers, of the French and Indian War. This quickly generated a great deal of resentment on the part of the settlers, since many of them were squatting on what appeared to be open land. To address the problem of overlapping land claims, preserve the tenuous hold on territory also claimed by the Shawnee and Cherokee, as well as to deal with the flood of settlers streaming into Kentucky and occupying any lands of their choosing, the Virginia General Assembly in Williamsburg, the colonial capital of Virginia, developed a land patenting process that sanctioned land ownership under certain conditions. Settlers living in Kentucky County who could prove that they had made an improvement, such as building a cabin or planting a crop before 1 January 1778, the date that the law was passed, were allowed to purchase 400 acres around their settlement site by means of a Certificate of Settlement with the option of purchasing an adjacent 1000 acres using a Preemption Warrant. The price tag was set at $2.25 per 100 acres for the first 400 acres, adding up to just $9. For the 1000 acre preemption, the price was $2.50 an acre, amounting to an additional $2500 if the full 1000 acres was purchased. The land certainly wasn’t free, but it was quite inexpensive even for those times. Those settlers who arrived in Kentucky County after 1 January 1778 and before May 1779, the date the land law was passed, and who met the same improvement and crop requirements, were allowed to purchase a 400 acre Preemption Warrant for the land on which their improvements had been made. Virginia had fixed the price on land in Kentucky as £40 paper, equal to $40 specie, per hundred acres, so the allowable 400 acre tract would cost a settler £160 or, in Virginia money (specie), $160. A burgeoning problem that quickly became apparent was that many settlers had moved to Kentucky with little or no cash, so, while they qualified for “cheap” land by virtue of their “early” settlement, they couldn’t afford to buy the land on which they had settled. In the interests of encouraging these settlers to remain in Kentucky, while promoting Virginia claims to the land over the natives, the court system developed the pauper warrant. Before issuing such a land warrant, however, the Virginia legislature required that these settlers go to court and prove their poverty status. Successful documentation in this process resulted in the state allowing them to purchase 400 acres with easy payments.858,968,976, 165031=The 1776 Cherokee Uprising & Col. Christian's Punitive Expedition, 148294=    In the spring of 1774 Lord Dunmore, the Royal Governor of Virginia, ordered the construction of a series of forts in the Clinch valley of southwestern Virginia with the work to be completed by the local militia, known informally as the Holston militia. Col. William Preston was the overall militia commandant at the time and Col. William Christian, who served directly beneath him, supervised the construction efforts. Work began on the forts in late June 1774 and seven forts were quickly built. Four were located in the lower Clinch valley under the command of Captain William Russell and three, under Captain Daniel Smith, were built in the upper Clinch valley. In Captain Russell’s operational area, one fort was built at Castlewood, usually called Russell’s Fort, and served as his headquarters. The other forts in his jurisdiction were Moore’s Fort, located about four miles below Russell’s Fort (Castlewood), Blackmore’s Fort, situated 16 miles below Russell’s Fort (Castlewood) and the Glade Hollow Fort built about ten miles upstream from Russell’s Fort.  , 41662=19 June 1773, 74133=27 Dec. 1787 20,556,563,564,852,853, 56755=Hanah Riggs, wife of Scott Riggs, daughter of John and Hannah Berry, was born 28th April 1780, in Lincoln County, Ky, Died June 2nd, 1864, Morgan County, 57911=George Rogers Clark and His Men: Military Records 1778-1784 Lt. Pettots Company Militia, Lincoln County, Virginia A Pay roll of Lieut. Pettots, Company of Militia in Actual Service by orders of Col. John Logan to Guard the Frontiers. 1781 (doc. #168) 23 Mar. – 21 Apr 1781 John Berry, 145961=    The change in the political situation generated a great deal of resentment on the part of the Cherokees and Shawnee. In the early 1770s, resistance to white encroachment primarily came from roving bands of Shawnee warriors from north of the Ohio River, but the Battle of Point Pleasant in the fall of 1774 effectively, albeit temporarily, greatly diminished Shawnee efforts to stem the tide of European migration. The Cherokees were slowly regaining strength through the early to mid 1770s, and became increasingly involved in the efforts to thwart the European advance. It was the American Revolution, however, that provided them with the impetus to execute their goals of territorial reoccupation. Through the early to mid 1770s, relations between the American colonies and Great Britain rapidly deteriorated to the point of open revolution. By the time war finally broke out, the British had instigated a strategy of using British and Loyalist troops to attack the rebels from the sea while simultaneously taking advantage of their already aggrieved Indian allies to pressure the American rebels from the frontier. Consequently, numerous British agents visited the western tribes with arms, supplies and cash, inciting them to take up arms against the English colonists. The Cherokees, being eager to regain their lost territories, readily agreed and became increasingly aggressive. This, of course, greatly alarmed the settlers in the Powell, Holston and Clinch valleys of Botetourt and later Fincastle counties, who responded by organizing into militia units.462,570,865,866, 100981=     Not long after they got married, John and Hannah, along with their young son, William, moved a short distance from his boyhood home to an area just south of the Borden Grant referred to as the “forks of the James”. The “forks of the James” area is old terminology that refers to the area of the Great Virginia Valley just west of the Blue Ridge Mountains where the two forks of the James River merge. During the 1770s the southern tributary was called the James, but the northern tributary was called the North River or the North Fork of the James. Today, however, that northern fork is referred to as the Maury River and the southern “fork” is still considered to be the true James River. (Figures 15, 16 and 123) The first direct documentation for John Berry consists of an Augusta County court record from the fall of 1766 in which he served as a testamentary for a land sale in this area. James McClure, the land buyer, later appeared in the 1771 Botetourt County tithables on the same tax list, so these two men certainly lived in the same general area. Another son, James Berry, was born to John and Hannah sometime between 1767 and 1770. The date of birth of this son is not known with certainty, so only a broad range of time for the birth is available. Since John and Hannah were living in the forks of the James area of Augusta County at the time, that county is clearly the birth place for their son James Berry., 3890=     Over the course of their lives together, John and Hannah had seven children, the last one being born in late 1788, not long before John passed away. He wrote his will in the late summer of 1789, and by the next summer he had passed away at a fairly young age, leaving Hannah with children ranging in age from one to 24. Hannah survived at least another 13 years, since she can be traced through tax records, but her sudden disappearance from the records, combined with the fact that she cannot be found in census records living with any of her children, suggests that she probably passed away not long after the summer of 1803. The places of burial for John and Hannah are not known, but presumed to be at a local cemetery or on their family farm.  , 68442=Lincoln County Virginia/Kentucky Order Book No 2, 1781 - 1784, page 194 John Hall v Arthur Owings, in case. There came a jury composed of James Forbes, Stephen Fisher, John Downey, Charles Reynolds, Samuel Briggs, John Buchanan, Thomas Montgomery, Robert Herrald, George Davidson, Joseph Russell, John Berry and Thomas Pitman, who found for the plaintiff for 4 pounds 10 shillings. Verdict accordingly, plus costs., 37340=5 May 1773844, 231088=     Lincoln County records in 1782 for John Berry consists of a land purchase, which can be definitively assigned to him. In the fall of 1782 John Berry purchased 300 acres of land on the Stoner Fork of the Licking River in Fayette County. He never moved onto the land, and it is not known if that was ever his intention, since he passed away a few years later. Joshua Pennicks had made the requisite improvement in 1777, and was issued the settlement and preemption rights for 1400 acres of land on 20 December 1779. Three days later he sold the tract to William McCracken who, on 6 March 1780, paid £800 for 2000 acres, so there must have been an additional 600 acre purchase by Joshua Pennicks that was subsequently transferred to McCracken. John Berry’s sale price is not known. If the entire 2000 acre parcel of land was valued together as a unit, then 300 acres calculates to a price of £120, assuming no profit was taken by the seller. The only other event of note from that year, at least as far as documentable records are concerned, was the birth of Peggy Berry, John and Hannah’s eighth child, who was born in early December in Lincoln County.36,556,564,851,968  , 36379=1 Apr. 1773, 53578=Lord Dunmore’s Little War of 1774, His Captains and their Men Who Opened up Kentucky & the West to American Settlement, by Warren Skidmore with Donna Kaminsky Fincastle Public Service Claims John Berry By sundry per account, 112086=     The actual tithable list for the 1771 Forks of the James District is not alphabetical, so, at least to some extent, it probably shows individuals as they were encountered by list owner as he, or his agent, rode from farm to farm creating the list of people to be taxed. This clearly indicates that at least some of the people in this listing were probably next door neighbors. John Jones (the step father of the John Berry who married Jane Campbell), the John Berry who married Hannah, as well as a James Berry, are all listed immediately adjacent to each other. The other John Berry lived somewhat farther away from this Berry/Jones group, as evidenced by his nonadjacent occurrence in the list and that he was further identified as owning 100 acres of land. Based on the documented 120 acre Augusta County land acquisition by John and Jane Berry in 1768, the latter John Berry tithable list entry (the entry remote from the others) containing the acreage most likely represents John Berry and Jane (Campbell) Berry. That interpretation is further confirmed by the 1775 sale of that particular parcel of land in which both John and Jane Berry are identified as the sellers. Furthermore, several 1771 land acquisitions and subsequent sales quite clearly show that John and Hannah Berry owned land adjacent to John Jones, clearly identifying this John Berry as the individual in the 1771 tithable list listed adjacent to John Jones. John Berry began the process of purchasing his own land by having 48 acres on the south side of the James River surveyed. He didn’t actually acquire title to the land until August of 1771, which explains why he does not appear as a landowner in the 1771 Botetourt County tithable list. At an unknown date, but probably after the 1771 tithable lists had been taken, he also purchased 75 acres of land adjacent to the 48 acres he had surveyed, so, by the end of 1771 he owned 123 acres of land on the south side of the James River., 87589=Marriage Consent and Bonds, 1781 - 1865 in Lincoln County Kentucky Records, Volume I Bond of Scott Riggs to marry Hannah Berry, with James Berry as surety. Consent by Hannah Berry for her daughter, same date, witnessed by James Berry and Polly Berry}",
    "textBeforeTable": "  Table XXXVIII Settlement & Preemption Certificates      The final bit of 1781 John Berry related Lincoln County source data consists of an estate appraisal record in which John Berry and three other men evaluated the property of a recently deceased neighbor. All three of the other appraisers, Robert Barnett, William Montgomery and Samuel Briggs lived in the Logan’s Fort area (Table XXXVIII) where John and Hannah eventually purchased land. In addition, one of them, Samuel Briggs, had worked on a road crew with John Berry back in Fincastle County in 1773. The Logan’s Fort area was also where several Drake family members, other Lincoln County pauper warrant recipients, lived, so this court record ties in many other John Berry related source documents. In addition, one of John and Hannah’s children, Jennie, was recorded as being born in Stanford in 1786, and the land eventually purchased by John and Hannah Berry was on Hanging Fork in the near vicinity of Logan’s Fort. Quite clearly, the Logan’s Fort John Berry represents John and Hannah Berry. It should also be noted that both the Green River and Dick’s River, where the other estate appraisers (Barnett, Montgomery and Briggs) obtained their land, are located nearby present day Stanford. In fact, all three of these appraisers had been granted preemption certificates on the same day, most likely since they all filed the same day at the same",
    "textAfterTable": "       Virginia and Kentucky land records for William Montgomery are also useful in differentiating the John Berrys. William Montgomery Jr. and Sr., father and son, spent around £2000 between 1776 and 1782 in the process of obtaining title to 4000 acres of land in the area of Lincoln County along the drainage divide between the Green River and Kentucky Rivers just a few miles south of Logan’s Fort at present day Stanford. (Table XXXIX). In fact William Montgomery Sr. built a fortified station, known as Montgomery’s Station, on this land. The headwaters of Carpenter Creek, which drains into the Green River, and Dicks River, which drains into the Kentucky River, are just south of Logan’s Fort. In addition, the drainage divide between Hanging Fork, which also drains into the Kentucky River, and the Green River drainage basin is also in this area. Robert Barnett, one of the 1781 estate appraisers, was an adjacent landowner to William Montgomery Jr. and is noted in land records as living near Petitt’s Station, a fortified site about 2 ½ miles south of Montgomery’s Station. Several other Montgomery family members also obtained land in this area at the same time. William Montgomery Jr. purchased 500 acres of this land along the Green River/Hanging Fork drainage divide in 1781, finally obtaining patent on the lands in mid and late 1782, and it must have been 150 acres",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}