{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very safe and well lit for nights.",
            "none",
            "There is a club or activity for everyone.",
            "If you want a home feeling, this University is perfect for you because it is small and quaint.",
            "There are free services everywhere like the writing center or even zumba.",
            "Midnight movies will be one activity that you will want to do. Also, the summer fine arts series will be entertaining. And you must go to all of the activities that the campus provides, there will be games and amazing prizes.",
            "At first the food will seem delicious but then after a while you will want something else.",
            "Dorm life will be the first step in making new friends so you should embrace the opportunity.",
            "There will be more than enough people who want to help you succeed.",
            "The Western Oregon University web site will be your best friend. See your counselor ever term. View your Degree Evaluation ever term.",
            "Western Oregon is a lovely and small campus. They are innovative with their students and campus. Western Oregon cares about their students."
        ]
    ],
    "pageTitle": "Western Oregon University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Western-Oregon-University/reviews?_escaped_fragment_=/show/19370",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881180531,
    "recordOffset": 881129405,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{114289=WOU is a great school... Small classes.... Professors are always willing to help most anytime you need help. I'm a non-traditional student been out of high school since 1984, they are great at accepting me, helping me and welcoming me to their campus. Education program is one of the best in Oregon. If you love small classes, helpful professors, great people here is the place to be., 116617=There's only one fraternity that began last year (2011-2012 school year) called Kappa Sigma. To be honest, they are nothing like the frats you may have heard of at huge universities like Arizona State University and all those well known party schools. Don't get too excited., 73327=One on one help the ratio is 15:1. The teachers get involve and make sure their students are understanding the lesson. Also they will know if you don't show up to class, so go to class everyday., 148897=I suggest you get you FAFSA in no later then January 14th, and don't stress your test scores that much. If you go to this school, make sure to do the homework on time or you will get behind, much more quickly than in high school., 54926=Homecoming is not as important than the first week of December, 236943=© 2015, Cappex.com, LLC, 97256=There is a public safety building right across the street from Heritage. There are campus security officers going around all the time. There are even pawprints on the ground to follow so you will always be on a lighted path. I have never heard of any issue on campus with safety. I think this is a very safe campus. I have walked across campus at 9:00 at night and never thought twice about it.}",
    "textBeforeTable": "10/25/2010 Reviewer is A current student here. 15 out of 16 people found this review useful. 1 of 55 Melissa from Cornelius, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. Western Oregon University Reviews Western Oregon University › Oregon › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot My goal is to graduate in three years, and the flexible scheduling at Western allows me to follow through with my plans. Login to rate or flag the reviews Sarah from Junction City, OR 06/03/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 9 out of 9 people found this review useful. 3 of 55 Categories Comments Great for these types of students Students who need attention from professors, who like the small town environment, and who are wanting to be involved in the community. Tips for prospective students I don't have any yet. Bang for the buck Being that I will become a nurse, I know that spending money on college is worth it. Will enjoy being here The campus is beautiful and I",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}