{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "70.49",
            "69.43",
            "76.26",
            "79.84"
        ],
        [
            "NSE",
            "70.46",
            "69.34",
            "76.20",
            "79.79"
        ]
    ],
    "pageTitle": "Jayshree Tea and Industries Stock Price, Share Price, Live BSE/NSE, Jayshree Tea and Industries Bids Offers. Buy/Sell Jayshree Tea and Industries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/plantations-tea-coffee/jayshreeteaindustries/JTI?sc_did=JTI",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00295-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 610865059,
    "recordOffset": 610811325,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134647=UnitedBrewerie Jul Fut, 134136=28 July 2015, 135354=JSWSteel Jul Fut, 215368=Astec LifeSciences Recommended on Mar 31st 2015, 216676=Jayshree Tea is in the Plantations - Tea & Coffee sector. The current market capitalisation stands at Rs 216.44 crore. The company management includes B K Birla - Chairman, Jayashree Mohta - Vice Chairperson, D P Maheshwari - Managing Director, Vikash Kandoi - Executive Director, B M Khaitan - Director, G P Goenka - Director, S S Kothari - Director, S K Tapuriah - Director, Subodh Kumar Agrawal - Director, Prashant Jhawar - Additional Director. It is listed on the BSE with a BSE Code of 509715 and the NSE with an NSE Code of JAYSREETEA. Its Registered office is at Industry House, 15th Floor,,10, Camac Street Kolkata,West Bengal - 700017. Their Registrars are Maheshwari Datamatics (P) Ltd.}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}