{
    "relation": [
        [
            "Year",
            "2012",
            "2010",
            "2008",
            "2006",
            "2004",
            "2002",
            "2000",
            "1998",
            "1996",
            "1994",
            "1992",
            "1988",
            "1986"
        ],
        [
            "Person",
            "Natalia Pardo",
            "Michael Turner",
            "Maria Gehrels",
            "Brad Pillans",
            "Alan Palmer",
            "Vicki Smith",
            "Dennis Eden",
            "Shane Cronin",
            "Susan Donoghue",
            "Brent Alloway",
            "Phil Shane",
            "No award made",
            "David Lowe"
        ],
        [
            "From",
            "Massey",
            "Macquarie University",
            "Plymouth University",
            "ANU",
            "Massey",
            "Auckland",
            "Palmerston North",
            "Massey",
            "Massey/HKU",
            "Auckland",
            "Victoria",
            "-",
            "Waikato"
        ],
        [
            "For work on",
            "Reconstructing the largest explosive eruptions of Mt. Ruapehu.",
            "Oxidation states in titanomagnetites to distinguish the different eruption styles of Mt Taranaki.",
            "Cryptotephras in northern New Zealand.",
            "Pleistocene silicic tephras of Wanganui Basin",
            "Onland and offshore tephra studies",
            "Okataina Volcanic Centre",
            "Multi-sourced distal tephras and landscape evolution, eastern North Island",
            "Tephra identification and Ruapehu and Tongariro ring plains",
            "Tephrostratigraphic work on style of prehistoric eruptions, Mt Ruapehu",
            "Tephrostratigraphy and chronology of the Taranaki and Wanganui regions",
            "Plio-Pleistocene tephrostratigraphic correlations in southern North Island",
            "-",
            "Quaternary tephrostratigraphy of the Waikato Basin"
        ]
    ],
    "pageTitle": "Awards",
    "title": "",
    "url": "http://www.gsnz.org.nz/information/awards-i-34.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 490697299,
    "recordOffset": 490660875,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80938=1969, 69681=1994, 83157=1964, 67437=1999, 71017=1991, 180748=2007, 202756=2000, 84516=1961, 50247=The purpose of this award is to fund (fully or in part) New Zealand early career earth science researchers and PhD students to attend and present a talk or poster at their first international conference. The award will fund (or contribute to funding of) registration, travel and accommodation costs. A maximum of $5000 will be awarded in any one year or granted to any one applicant. If the fund is oversubscribed, unless specifically requested, awards to a single applicant will be no less than $1000. The grant will be awarded at the discretion of the GSNZ National Committee. Applications will be accepted for consideration in three rounds each year (February, June and September). Rules and guidelines for the Young Researcher Travel Grant can be accessed here and the application template here., 180132=2009, 110844=2008, 142032=June Cahill, 64692=2005, 51597=To fund educational scholarships for Masters or Honours research in the field of Geosciences. $1000 is awarded per University, with HoD's responsible for nominating suitable student candidates. Rules and guidelines for the S.J. Hastie Scholarships can be accessed here and application template here ., 101451=R. I. Walcott. Geodetic strains and large earthquakes in the Axial Tectonic Belt of North Island, New Zealand. Journal of Geophysical Research 83: 4419-4429, 1978., 63262=2008, 181628=2004, 85869=1958, 199805=2010, 110374=2009, 24412=The Awards Subcommittee of the Geoscience Society chaired by the Vice-President makes a number of annual and other awards. These are usually announced and presented at the Annual Conference in November or December. To see a summary of the awards and to make a nomination see below. Also following are links to the Rules & Bylaws page that describe the Terms and Conditions of each Award., 202466=2001, 200980=2006, 90992=Townend J., M. D. Zoback , Stress, strain, and mountain building in central Japan. J. Geophys. Res., 111, B03411, doi:10.1029/2005JB003759., 73296=1986, 71506=1990, 101053=R. Robinson. Variation of energy release, rate of occurrence and b-value of earthquakes in the main seismic region, New Zealand. Physics of the Earth and Planetary Interiors 18: 209-220, 1979., 78683=1974, 63722=2007, 75985=1980, 74194=1984, 69237=1995, 77327=1977, 81845=1967, 40017=The GSNZ Honorary Member award is presented to an outstanding individual who has contributed significantly to the success of the GSNZ and/or its predecessors and to the advancement of the geosciences in New Zealand. It is not necessarily about recognising a lifetime contribution to geoscientific research, rather it acknowledges outstanding, sustained contributions made to the successful and continued operations of the GSNZ and the wider geoscience community. Only one Honorary Member shall be elected in any one year. This award arose from the amalgamation of the Geological Society of New Zealand and the New Zealand Geophysical Society in 2010. The award was first offered in 2011, and the first recipient of this prestigious GSNZ award was Dr Bruce Thompson. Rules and guidelines for the Honoray Life membership can be accessed here, and the nomination template here., 80485=1970, 184492= S.J. Hastie Scholarships (since 2001) and Student Research Awards (1983-2000), 79106=1973, 193700=Guy Simpson (Otago), Scott Keeling (Massey), Jan Lindsay (Auckland), 181040=2006, 70566=1992, 66074=2002, 200675=2007, 181335=2005, 82710=1965, 64224=2006, 179849=2010, 75540=1981, 86302=1957, 54604=SAGE is conducted by the Los Alamos National Laboratory, a Branch of the Institute of Geophysical and Planetary Physics, University of California. It is sponsored by and draws its faculty from various US universities, research agencies and corporations, and has operated in New Mexico since 1983. SAGE participants are chosen from US and overseas countries. Since 2001, through an arrangement between the US organisers and the New Zealand Geophysical Society, one enrolment at SAGE has been available to one student from New Zealand.  The SAGE Scholarship is awarded to the most suitable New Zealand candidate, with funding for attendance at SAGE provided by sponsorship from a number of institutions, and in some cases the Geoscience Society of New Zealand. Rules and guidelines for the NZ SAGE Award can be accessed here, and the application and nomination template here ., 71949=1989, 67886=1998, 180448=2008, 30908=In July of each year, the Awards Subcommittee calls for nominations for various awards. These should be emailed to the Awards Subcommittee chairperson given on the individual nomination forms. The closing date for nominations is generally mid September. Awards are presented at the GSNZ Annual Conference., 76878=1978, 201878=2003, 65616=2003, 48862=This award was incorporated into the GSNZ with the merger of the Geoscience Society of NZ with the NZ Geochemical and Mineralogical Society in 2012. As part of the merger, funds were contributed by NZGeMS to the GSNZ Awards Trust to form a separate account (the NZGeMS Geochemistry Fund) from which the prize money for the Werner F Giggenbach Prize and other geochemistry prizes could be drawn. Rules and guidelines for the Giggenbach Prize can be accessed here and the application template here. Some information about Werner Giggenbach is included here., 201573=2004, 70117=1993, 57351=The John Beavan Geodetic Fieldwork Fund was established as a memorial to Dr John Beavan (1950-2012) whose career was strongly influenced by his love of both mathematical physics and the outdoors. The purpose of the fund is to support students involved with geodetic research to undertake or participate in associated fieldwork in New Zealand or the southwest Pacific region (including Antarctica). Awards can be made either directly to the student to undertake his or her own fieldwork associated with a research project, or to a more senior researcher, to reimburse the expenses associated with including the student in the fieldwork. The latter is intended to encourage experienced fieldworkers to take along students who might otherwise not get a chance to work with them., 66529=2001, 72873=1987, 111120=The March 2007 Ruapehu Crater Lake breakout lahar, 200102=2009, 75096=1982, 79563=1972, 84964=1960, 73738=1985, 176384=Quaternary paleoceanography, ODP 1119, 47277=This prize is awarded in recognition of a lifetime of service in New Zealand geochemistry, and is awarded no more frequently than once every four years. This award was incorporated into the Geoscience Society of NZ (GSNZ) with the merger with the NZ Geochemical and Mineralogical Society in 2012. The first award, as a combined society, was offered in 2013. As part of the merger, funds were contributed by NZGeMS to the GSNZ Awards Trust to form a separate account (the NZGeMS Geochemistry Fund) from which funding to support the SH Wilson Prize and other geochemistry prizes could be drawn. Rules and guidelines for the S H Wilson Prize can be accessed here and the application template here. Some information about Stuart Wilson is included here., 82268=1966, 212186=2002, 81384=1968, 68340=1997, 84067=1962, 80010=1971, 78219=1975, 83605=1963, 113587=Discovering and understanding submarine volcanoes: the Kermadec Arc sector of the Pacific Ring of Fire, 65148=2004, 52762=This commemorates the micropaleontological and stratigraphic research of Dr N. de B. Hornibrook (1921-1994). The award shall be made to a student enrolled for postgraduate research at a tertiary institution in New Zealand. To be eligible for the award, a student shall demonstrate a high standard of competence and ability to carry out research, with a focus on methods of stratigraphic correlation judged to be relevant to New Zealand and the south-west Pacific. Rules and guidelines for the Hornibrook award can be found here and the nomination template here., 66990=2000, 74652=1983, 68784=1996, 201285=2005, 77767=1976, 202171=2002, 72432=1988, 53877=SAGE, the Summer of Applied Geophysical Experience, is a unique \u0091hands-on' geophysical educational program held yearly over a four-week period in June/July in New Mexico. It aims to enhance the experience and knowledge of students of geophysics in an intense course of geophysical exploration and research that goes beyond classroom-based curricula. Much more than just a summer field camp, SAGE is a complete immersion in geophysics, an educational experience in which students participate in every phase of the field and interpretation programs. Participants collect data with modern equipment; process, model and interpret the data with workstations; and present their results in oral and written forms., 76436=1979, 24875=2015 Applications and Nominations to the Chair of the Awards Subcommittee, Jennifer Eccles (j.eccles_at_auckland.ac.nz) by the 18th of September 2015., 85419=1959}",
    "textBeforeTable": "Awards The Awards Subcommittee of the Geoscience Society chaired by the Vice-President makes a number of annual and other awards. These are usually announced and presented at the Annual Conference in November or December. To see a summary of the awards and to make a nomination see below. Also following are links to the Rules & Bylaws page that describe the Terms and Conditions of each Award. 2015 Applications and Nominations to the Chair of the Awards Subcommittee, Jennifer Eccles (j.eccles_at_auckland.ac.nz) by the 18th of September 2015. Royal Society NZ awards here and Prime Minister's Science Prizes here . Previous winners of these awards can be seen following the award descriptions. General Awards McKay Hammer The New Zealand Geophysics Prize Hochstetter Lecturer Honorary Member Kingma Award Wellman Research Award Harold Wellman Prize Pullar-Vucetich Prize S H Wilson Prize Werner F Giggenbach Prize Alan Mason Historical Studies Fund Young Researcher Travel Grant Awards exclusively for Students",
    "textAfterTable": "2001 Pat Suggate GNS Quaternary stratigraphy & coal rank 2000 Chris Adams GNS Provenance of NZ terranes 1999 Phil Barnes NIWA Southern Hikurangi margin 1998 Lionel Carter NIWA Shelf to deep ocean processes 1997 James Crampton GNS Inoceramid taxonomy 1996 Peter Koons Otago Collision zones and processes 1995 Ian Wright NIWA Offshore TVZ volcanism 1994 Nick Mortimer GNS Otago Schist 1993 Brad Pillans Victoria NZ Quaternary geology 1992 Phil Maxwell Waimate Eocene macropaleontology 1991 Werner Giggenbach; Jack Bradshaw DSIR; Otago Hydrothermal work; Fiordland petrology 1990 Cam Nelson",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}