{
    "relation": [
        [
            "Patent application number",
            "20110043861",
            "20110234732",
            "20110309565",
            "20120300258",
            "20130038905"
        ],
        [
            "Description",
            "GRAYSCALE PRINTING CONTROL METHOD AND DEVICE - A grayscale printing control method, a device thereof and a storage medium are provided. The method comprises: determining the grayscale level of image data of each point in each point line and converting the same into multi-bit binary data; forming a data set using the binary data of the same bit of all the points in a point line, thereby forming multiple data sets; each data set corresponding to a predetermined strobe time, and the print head heater corresponding to each point heating upon receiving predetermined data during the strobe time. The present invention can reduce the number of printing strobes and the times of data transmission while ensuring printing quality, thereby greatly improving printing speed.",
            "DOT-MATRIX PRINTER - A dot-matrix printer comprises a main frame, a first movable frame, and a second movable frame, wherein the main frame supports a printer head; the first movable frame supports a platen and a first paper feeding roller, and is pivotally connected to one end of the main frame via a first pivot shaft to permit itself to be opened or closed relative to the main frame; the second movable frame supports a second paper feeding roller, and is pivotally connected to the other end of the main frame via a second pivot shaft to permit itself to be opened or closed relative to the main frame; and wherein when the first movable frame and the second movable frame are closed relative to the main frame, the printer head is opposite to the platen to form a printing position; and the first paper feeding roller is tangent to the second paper feeding roller. The dot-matrix printer according to the present invention has two movable frames. The first paper feeding roller and the second paper feeding roller are provided in these two movable frames, respectively. The above movable frames can rotate about the main frame to be opened, avoiding the inconvenience of replacing the ink ribbon and cleaning the printer head in the prior art.",
            "SHEET MEDIUM PROCESSING DEVICE - A sheet medium processing device comprises a housing, a feeding mechanism (",
            "PRINTING CONTROL METHOD, PRINTER AND PRINTING SYSTEM - A printing control method, printer and printing system are provided. The printing control method comprises: receiving the ticket data to be printed; printing the ticket data; judging whether the printed ticket data is complete; and performing predetermined process according to the judgment result. The invention can conveniently and accurately judge whether a ticket is completely printed.",
            "SCANNING-PRINTING INTEGRATED MACHINE FOR LOTTER TICKET PRINTING AND CASHING - The invention discloses a scanning-printing integrated machine for lottery ticket printing and cashing, comprising a first passage connected with an external paper inlet, a second passage connected with a paper house, a third passage connected with a paper outlet, and a control device, wherein a paper outlet of the first passage and a paper outlet of the second passage meet together at the third passage, at least one pair of delivery rollers is arranged in the first passage, a first printing mechanism and a paper cutting mechanism are arranged in the second passage, a scanning mechanism and a second printing mechanism for printing mark information on a medium are in sequence arranged in the third passage, wherein the control device judges the validity of the medium according to medium images collected by the scanning mechanism, and controls the printing operation of the second printing mechanism according to the judgment result. The scanning-printing integrated machine of the invention can not only achieve printing and cashing of the lottery tickets, but also detect the integrality of the printed contents."
        ],
        [
            "Published",
            "02-24-2011",
            "09-29-2011",
            "12-22-2011",
            "11-29-2012",
            "02-14-2013"
        ]
    ],
    "pageTitle": "Cong, CN - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cong-cn-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449059367,
    "recordOffset": 449030745,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Qiangzi Cong, Shandong CN 10-31-2013 Print head assembly and printer using the same - A print head assembly and a printer using the same are disclosed. The print head assembly includes: a bracket, a print head and an elastic element. The bracket includes a first bracket body having a cavity and a lid covered on the opening of the cavity. A window is opened on the first bracket body. The print head is accommodated in the cavity of the first bracket body and hinged to the first bracket body via a first rotary shaft. The surface of a heating element of the print head is matched with the window and faces an outside paper pressing roller. The elastic element biases towards the print head so as to make the surface of the heating element of the print head have a tendency to extend outside the window. The print head assembly is capable of being detached as a whole, thus the requirements of performing single-sided printing and duplex printing in the same printer is achieved. 20130286136 05-16-2013 Printer and Control Method Thereof - The disclosure provides a printer and a control method thereof. The control method of the printer comprises: detecting the state of the printer; and when the printer is in error state, saving printing data and error information of the printer. The disclosure is hereby able to provide a basis for judging whether the printing is normal when printing fails due to",
    "textAfterTable": "Patent applications by Qiangzi Cong, Shandong CN Rishan Cong, Shandong CN Patent application number Description Published 20120015439 METHOD FOR THE RECONSTRUCTION OF A TISSUE-ENGINEERED HUMAN CORNEAL ENDOTHELIUM - This invention relates to a method for the reconstruction of a tissue-engineered human corneal endothelium. Human corneal endothelial cells are cultured in vitro to logarithmic growth phase using 20% calf bovine serum-containing DMEM/F12 medium. Trypsin is used to digest epithelial layer of the freeze-dried human amniotic membrane in order to produce denuded human amniotic membrane as scaffold carriers. The scaffold carriers are tiled on the bottom of culture plate wells until they are dried and completely adhered to the bottom of wells. Human corneal endothelial cells at logarithmic growth phase are re-suspended in DMEM/F12 medium containing type-IV collagen and 20% calf bovine serum. Human corneal endothelial cell suspension is subsequently inoculated to amniotic membrane scaffold carriers that are tiled on the bottom of wells in culture plate to launch in vitro culture as well as in vitro reconstruction of tissue-engineered human corneal endothelium. This invention is scientific and rational. The reconstructed tissue-engineered human corneal endothelium can be produced on large scale to satisfy the great demand of tissue-engineered human corneal endothelium in clinical",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}