{
    "relation": [
        [
            "",
            "ODIs",
            "T20Is",
            "First-class",
            "List A",
            "Twenty20"
        ],
        [
            "Mat",
            "3",
            "7",
            "111",
            "181",
            "111"
        ],
        [
            "Inns",
            "3",
            "7",
            "",
            "",
            "106"
        ],
        [
            "Balls",
            "175",
            "156",
            "18305",
            "7745",
            "2195"
        ],
        [
            "Runs",
            "132",
            "168",
            "10604",
            "6286",
            "2570"
        ],
        [
            "Wkts",
            "5",
            "6",
            "309",
            "238",
            "101"
        ],
        [
            "BBI",
            "3/27",
            "2/27",
            "6/30",
            "5/31",
            "5/19"
        ],
        [
            "BBM",
            "3/27",
            "2/27",
            "",
            "5/31",
            "5/19"
        ],
        [
            "Ave",
            "26.40",
            "28.00",
            "34.31",
            "26.41",
            "25.44"
        ],
        [
            "Econ",
            "4.52",
            "6.46",
            "3.47",
            "4.86",
            "7.02"
        ],
        [
            "SR",
            "35.0",
            "26.0",
            "59.2",
            "32.5",
            "21.7"
        ],
        [
            "4w",
            "0",
            "0",
            "",
            "8",
            "0"
        ],
        [
            "5w",
            "0",
            "0",
            "14",
            "2",
            "1"
        ],
        [
            "10",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Neil Carter | South Africa Cricket | Cricket Players and Officials | ESPN Cricinfo",
    "title": "",
    "url": "http://www.espncricinfo.com/county-cricket-2011/content/player/44493.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437061475,
    "recordOffset": 437023289,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87932=4391 runs after 35, and 2354 outside top five (42), 35097=Born January 29, 1975, Cape Town, Cape Province, 65815=Jul 2, 2013, 60071=One of many South Africans who has followed the well-trodden path into county cricket, Neil Carter's story is an encouraging tale of enthusiasm and determination defying logic and pragmatism. Told he was no longer required by Warwickshire in September 2004, six years later he found himself leading the county's attack and forging a reputation as one of the most useful allround cricketers on the circuit., 78980=The Cricket Monthly: The IPL lasts two months, but through the year talent hunters are scouring India (and the internet) for the next big thing. By Niyantha Shekar TCM July issue, 62463=But Carter wasn't ending his playing days entirely. He moved back to South Africa but declared himself available for Scotland, for whom he qualifies through his mother, and was selected in the squad for World Cup qualifiers against Afghanistan in March 2013. ESPNcricinfo staff, 61539=Carter's best season came in 2010 when he picked up 51 first-class wickets at 22.13 - his efforts went a long way to saving Warwickshire from relegation, from which they built a platform to narrowly miss out on the title in 2011 and run away with it in 2012. But Carter played only bit parts in both campaigns as injury began to take it's toll. A pelvic problem ruined his 2011 season and in 2012, Chris Woakes was preferred in the allrounder's slot., 60582=After the initial loss of his contract in 2004, rather underlining the sense that Carter has not always been as appreciated as he might be, Warwickshire released him again at the end of 2007. They reasoned that his best days were behind him and that he would struggle to maintain form and fitness. But he fought his way from the brink of cricketing oblivion to reinvent himself as a skillful bowler and highly-effective batsman and, having passed 100 first-class appearances and approaching 300 wickets, it's not looking like such a bad career move., 83250=4391 runs after 35, and 2354 outside top five, 62032=As a result of his wearing body and playing time becoming more marginalised, Carter decided to retire from county cricket at the end of 2012. He very nearly went out in fairytale fashion in the CB40 final at Lord's. He came into bat for the last ball of the match, needing one to win, but swung and missed as the match was tied and Warwickshire lost to Hampshire having lost more wickets., 67628=May 17, 2013, 87010=Since the beginning of 2012, Ian Bell averages 34.69 when batting in the top six; among regular top-order batsmen, only Shane Watson has a lower average}",
    "textBeforeTable": "Batting and fielding averages }); } } window.setTimeout(fixIframe,1300); if($('.FB_ElementReady iframe').height()>38 || $('.FB_ElementReady iframe').height()==0 || $('.FB_ElementReady iframe').height()== null){ $('.FB_ElementReady iframe').css({'height':'30px','width':'300px'}); function fixIframe(){ fixIframe(); jQuery(document).ready(function($){",
    "textAfterTable": "193 67 18 0 Bowling averages Mat Inns Balls Runs Wkts BBI BBM Ave Econ SR 4w 5w 10 ODIs 3 3 175 132 5 3/27 3/27 26.40 4.52 35.0 0 0 0 T20Is 7 7 156 168 6 2/27 2/27 28.00 6.46 26.0 0 0 0 First-class 111 18305 10604 309 6/30 34.31 3.47 59.2 14 0 List A 181 7745 6286 238 5/31 5/31 26.41 4.86 32.5 8 2 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}