{
    "relation": [
        [
            "Name",
            "Name field",
            "Level field",
            "Alert Groups field"
        ],
        [
            "Description",
            "A user-defined name for this profile. This name can be between 1 and 16 alphanumeric characters. You cannot use spaces or any special characters, and you cannot change this name after the object has been saved.",
            "Cisco UCS faults that are greater than or equal to this level trigger the profile. This can be: critical debug disaster fatal major minor normal notification warning",
            "The group or groups that are alerted based on this Call Home profile. This can be one or more of the following: ciscoTac diagnostic environmental inventory license lifeCycle linecard supervisor syslogPort system test"
        ]
    ],
    "pageTitle": "Configuring Call Home - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/unified_computing/ucs/sw/gui/config/guide/1-4/UCSM_GUI_Configuration_Guide_1_4_chapter48.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366236839,
    "recordOffset": 366202032,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "In the Create Call Home Profile dialog box, complete the following information fields: Step 5   On the icon bar to the right of the table, click +. If the + icon is disabled, click an entry in the table to enable it. Step 4   In the Work pane, click the Profiles tab. Step 3   On the Admin tab, expand All > Communication Management > Call Home. Step 2   In the Navigation pane, click the Admin tab. Step 1   Procedure Creating a Call Home Profile A profile that sends an alert to the CiscoTAC alert group in the XML format. Members of this group receive a By default, you must configure the Cisco TAC-1 profile. However, you can also create additional profiles to send email alerts to one or more specified groups when events occur at the level that you specify.",
    "textAfterTable": "Step 6   In the Email Configuration area, complete the following fields to configure the email alerts: Name Description Format field This can be: xml—A machine readable format that uses Extensible Markup Language (XML) and Adaptive Messaging Language (AML) XML schema definition (XSD). This format enables communication with the Cisco Systems Technical Assistance Center. fullTxt—A fully formatted message with detailed information that is suitable for human reading. shortTxt—A one or two line description of the fault that is suitable for pagers or printed reports. Max Message Size field The maximum message size that is sent to the designated Call Home recipients. The default is 1000000. For full-txt and xml messages, the maximum recommended size is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}