{
    "relation": [
        [
            "EFT Number Position",
            "Position 1",
            "Position 2",
            "Position 3",
            "Positions 4 - 7",
            "Positions 8 - 15"
        ],
        [
            "Name of EFT Number Position",
            "2 - Bank of America",
            "2 - ACH debit",
            "0 through 9 - Combined Payment Indicator",
            "Year/Julian date of settlement YDDD",
            "Confirmation number"
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.12.279 BMF/CAWR/PMF Unpostable Resolution",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-012-279r.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00341-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 524832127,
    "recordOffset": 524745637,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{234822=Late replies on Modernized E-file (MeF) after the return has been canceled - Associating documents to an e-filed return. If document correspondence needs to be associated with an e-filed return, a refile DLN must be created. Attach Form 12773, BMF ADJ54 Adjustment Format, to each e-file/MeF reply and complete with the following information:, 239845=Exhibit 3.10.72-7- Sorting Business returns and Documents (CSPC and OSPC) in IRM 3.10.72, Campus Mail and Work Control, Receiving, Extracting, and Sorting.), 306625=The PDC will not be available with the batch input program for Miscellaneous Transactions (CC FRM77/FRM7A) until the input screen is redesigned. See IRM 2.4.19, Command Codes REQ77, FRM77 and FRM7A, for additional information., 65922=The Remittance Transaction Research (RTR) provides universal access to a consolidated database of remittance data and images generated at ISRP, RS-PCC, and Lockbox Bank processing sites. This system permits data/image storage for up to 7 years. It also provides immediate retrieval for images. Refer to IRM 3.5.10, Remittance Transaction Research (RTR) System., 308120=A frivolous argument is used for the purpose of expressing dissatisfaction with the substance, form, or administration of the tax laws by attempting to illegally avoid or reduce tax liabilities. Recognized frivolous arguments made by businesses include, but are not limited to, the examples in IRM 4.10.12.1.1, Frivolous Arguments., 17210=See IRM 3.12.32, General Unpostables, for the guidelines in monitoring Unpostable receipts and inventories., 239012=The date a document is received in the Campus or an IRS office that can accept tax returns is the date stamped as the IRS Received Date. All mail received from 12:00 a.m. to 11:59 p.m., seven days a week, including Saturdays, Sundays, and legal holidays is date stamped with the actual date received. See IRM 3.10.72. 6, IRS Received Date., 48664=On unposted IMF or BMF tax returns, excess credits claimed (i.e. the amount of reported credits exceeding the tax liability) may be refunded to the taxpayer when a hardship situation exists even when it would otherwise be subject to offset to outstanding IRS debts. These are referred to as Offset Bypass Refunds (OBR). See IRM 3.12.279.14.1, Cases Requiring Special Handling, for more information on how to address these situations. Additional guidance may be found in IRM 21.4.6.5.12.1, Offset Bypass Refund., 57954=Taxpayer Advocate Service Operations Assistance Requests (OARs): The Taxpayer Advocate Service uses the Operations Assistance Request (OAR) process to refer a case to the Operating Division/function when TAS lacks either the statutory or delegated authority to effect the resolution of the taxpayer's problem. The Taxpayer Advocate Service utilizes Form 12412, Operations Assistance Request (OAR), to initiate the OAR process. Taxpayer Advocate Service requests must receive priority attention in accordance with the Service Level Agreement ., 241985=For additional information on how to determine the U. S. Postmark, Private Delivery Service (PDS), or received date refer to IRM 3.10.72, Receiving, Extracting, and Sorting and IRM 3.10.73, Batching and Numbering., 52424=The analysts for IRM 21.4, Refund Inquires, and IRM 3.17.79, Accounting Refund Transactions, are responsible for instructions as to what situations qualify for manual refunds, the programming to allow manual refunds to be processed, the design of the manual refund forms (Form 5792 and Form 3753), the instructions for completing the forms, and the instructions to Accounting for processing the completed forms. They are not responsible for determining when an OBR is appropriate., 8818=(7) IRM 3.12.279.127 (1) clarified instructions for UPC 329 RC 1 Form 1066., 247156=The Service has issued guidance allowing facsimile signatures on the Form 94X Family, Form 1042, Annual Withholding Tax Return for U.S. Source Income of Foreign Persons, Form 8027, Employer's Annual Information Return of Tip Income and Allocated Tips, Form CT-1, Employer's Annual Railroad Retirement Tax Return, or any variant of these forms. Rev. Proc. 2005-39., 255023=Doc Code 24-Used to transfer credits between Master Files when a secondary TC (other than 570) is needed, or when changing the date on a posted transaction. The debit and credit portions post separately. These TCs are compatible: 170, 180, 200, 270, 280, 360, 472, 570, 610, 620, 640, 650, 660, 670, 680, 690, 700, 730, 790, 820, 824, 850, 890 and their respective reversal codes. Do Not Use a Doc 24 for transfers which can be input with Doc 34. Doc Code 24 may be input via IDRS (CC-ADC 24, CC-ADD 24 and CC - DRT 24) or Form 2424, Account Adjustment Voucher via ISRP., 199075=CAF (BMF)-01060, 206129=Before disclosing any tax information, you must be sure you are speaking with the taxpayer or authorized representative. See the Taxpayer Authentication guidelines in IRM 21.1.3.2.3, Required Taxpayer Authentication. Also, before leaving any messages on a taxpayers answering machine, review IRM 11.3.2.6.1, Leaving Information on Answering Machines/Voice Mail. Fax procedures contained in IRM 11.3.1.11, Facsimile Transmission of Tax Information, must be reviewed prior to faxing confidential information to the taxpayer., 37772=IRM 3.5.10, Remittance Transaction Research (RTR) System, 205776=Section 3705(a), IRS Employee Contacts - This subsection contains information on the Restructuring and Reform Act of 1998, Section 3705, and provides identification requirements for all IRS employees working tax related matters., 24061=If a credit transfer is needed, use ADD/ADC24 (Doc Code 24). For Form 1120, U.S. Corporation Income Tax Return, do not input a TC 570 on the credit side of a manual refund., 410076=Flower Living Trust listed on Form 8288, U.S. Withholding Tax Return for Disposition by Foreign Persons of U.S. Real Property Interests, and April Flower listed as the individual on Form 8288-A, Statement of Withholding on Dispositions by Foreign Persons of U.S. Real Property Interests, research IDRS for an established number for the trust. If an EIN is found for the Trust,, 77447=As of January 1, 2008, all credits/payments will be assigned a Trace Identification (ID) Number for tracking purposes. The Custodial Detail Data Base (CDDB) was established with the Electronic Federal Tax Payment System (EFTPS) payments January 1, 2006. Now the CDDB will track all payments that comprise a Deposit Ticket, balancing the transactions against the Deposit Ticket totals, which have been entered in the Interim Revenue Accounting Control System (IRACS) General Ledger. The Trace ID Number will allow all credits/payments to be identified and added to the CDDB., 372884=See IRM 3.10.73.8.2, DLN Assignment for BMF, for Form 706, U.S. Estate Tax Return and Form 709, United States Gift (and Generation - Skipping Transfer) Tax Return, series., 246575=Form 2848, Power of Attorney and Declaration of Representative, 382512=An Electronic Filed Form 1041, U.S. Income Tax Return for Estates and Trusts, with an incorrect Employer Identification Number (EIN) must also address the Name Control when sending the Letter 147C., 398170=301 Resolution RC 1 MFT 17 Form 8288, U.S. Withholding Tax Return for Dispositions by Foreign Persons of U.S. Real Property Interests, was previously processed as a Non-Master File return. Effective January 01, 2006, Form 8288, U.S. Withholding Tax Return for Dispositions by Foreign Persons of U.S. Real Property Interests, was processed to the Business Master File (BMF) under MFT 17. The earliest tax period that can be processed to the BMF is tax period ending December 31, 2005, with a Date of Transfer of December 13, 2005 or later. Form 8288, U.S. Withholding Tax Return for Dispositions by Foreign Persons of U.S. Real Property Interests, is known as an ad hoc return. This means that each return is filed to reflect a particular transaction and not as a general summary of a years income, etc. Because of this there is no filing requirement (on CC INOLE) and is never considered (or coded) as a final return. The Form 8288, U.S. Withholding Tax Return for Dispositions by Foreign Persons of U.S. Real Property Interests, identifying number may need to be established on the BMF and can be any of the following., 377916=If an unpostable Form 1065, U.S. Return of Partnership Income, or Form 1041, U.S. Income Tax Return for Estates and Trusts, indicates a foreign address for the partnership, estate or trust, route the case to OSPC as an International return., 240068=Exhibit 3.10.72-8 -Sorting Non-Master File returns and Documents (CSPC) in IRM 3.10.72, Campus Mail and Work Control, Receiving, Extracting, and Sorting), 53073=IRM 21.4.6, Refund Inquiries - Refund Offset, provides instructions for identifying Offset Bypass Refunds (OBRs). IRM 3.17.79, Accounting Refund Transactions, includes instructions for Accounting to accept these manual refunds for processing, any special instructions for processing and instructions to maintain a log of all OBRs issued., 267000=CC NOREF is used to intercept erroneous refunds. See IRM 2.4.37, Command Code NOREF Overview., 20172=It also provides directions to all individuals who use the GUF to display, research, suspend and close INDIVIDUAL or FILES type unpostable cases. See IRM 3.12.32, General Unpostables, for a description of INDIVIDUAL and FILES unpostable cases., 271611=If you can determine the corrective action (i.e., corrective transaction code, correct date, etc.), correct the item(s) and close with URC 6. Transfer the completed information on the Form 11358, Excess Collections, and forward to Accounting for corrective action to the XSF, DCF or URF. The Form 11358, Excess Collections, must be forwarded on a weekly basis., 241213=US Postal Service envelope postmark date-see the subsection on \"How to Determine Postmark Dates\" in IRM 3.10.72.6, IRS Received Date., 14250=IRM 3.12.32, General Unpostables, provides guidelines for processing credit interest cases., 37977=IRM 4.4.35, Unpostable Resolution, 41932=Section 3705(a) - The IRS Restructuring and Reform Act of 1998, Section 3705, provides identification requirements for all IRS employees working tax-related matters., 14017=IRM 21.4.4, Manual Refunds, and IRM 3.17.79, Accounting Refund Transactions, provide guidelines for the issuance of manual refunds., 27015=IRM 3.17.79, Accounting Refund Transactions,, 322540=EFTPS payments have no paper records. The EFTPS DLN is a unique 15 digit number assigned by the financial agent and is researched via IDRS Command Code EFTPS. See IRM 2.3.70, IDRS Terminal Responses - Command Code EFTPS, for additional information., 246741=Form 2553, Election by a Small Business Corporation, 240757=IRS date stamp-see the subsections on Date Stamping in IRM 3.10.72, Receiving, Extracting, and Sorting, and IRM 3.10.73, Batching and Numbering., 225282=A taxpayer is not considered to have filed a tax return (which begins the period of limitations on assessment) until the taxpayer files a valid tax return. See IRM 25.6.1.6.14, Criteria for Establishing a Statute of Limitations Period, for the criteria to determine whether a return is valid., 70485=RTVUE - access data, transcribed and computer generated, from Form 1040 tax returns and accompanying schedules and forms., 421380=See IRM 3.21.19, Foreign Trust System, 35849=IRM 3.12.32, General Unpostables, provides information on:, 8340=(4) IRM 3.12.279.88 (1) added UPC 313 RC 8 when a TC 971 AC 747 is attempting to post to a Form 1120-F module that does not contain an unreversed TC 971 AC 746 per UWR 108671., 199538=GUF 53–43 - WEEKLY RESOURCE AND INVENTORY REPORT FOR O/F/P is a report that provides volumes used with the correlating OFP codes. Refer to the appropriate section in IRM 3.12.32, General Unpostables., 84681=Enter the appropriate Nullify Area Code and route document and Nullified Distribution List to the function that is responsible for the next action. See IRM 3.12.32, General Unpostables, for further information., 322382=EFTPS processed the first payment in November 1996. EFTPS will retain information on-line for current year plus 4 previous years., 114135=CC-UPRES must meet all the validity checks for input of the URC actions as CC definers and CC definer modifiers. See the general command code information for the CC-UPRES validity criteria in IRM 3.12.32, General Unpostables., 7727=October 16, 2014, 239608=See Exhibit 3.10.72-6 - Sorting Individual returns and Documents (AUSPC, FSPC and KCSPC in IRM 3.10.72, Campus Mail and Work Control, Receiving, Extracting, and Sorting.), 344102=On January 1, 2007, the Ogden Campus began processing BMF International returns., 21239=The CADE Master File, as it existed from 2004 - 2011, will transition from Production at the end of 201152., 184122=Command Code (CC) TRDBV is used to gain read only access to tax return data stored on TRDB. See IRM 2.3.73, Command Codes TRDBV, TRERS, TRPRT, and R8453., 242591=See IRM 3.10.72.6 for additional information on determining the IRS received date., 241639=Private Delivery Services-see the subsection on \"Procedures for Private Delivery Services (PDS)\" in IRM 3.10.72.6., 63625=The Name Search Facility (NSF) supports Command Codes (CCs), NAMES, NAMEE, NAMEI, NAMEB, FINDS, and FINDE, query a national relational database at MCC. Unpostable employees, who know the name and address of a taxpayer and need to locate a taxpayer's account number, or vice-versa, can use these command codes for research purposes. For additional information on these command codes see IRM 2.3.60, Command Codes NAMES, NAMEE, NAMEI, NAMEB, FINDS, and FINDE.}",
    "textBeforeTable": "If an overpayment and/or account is frozen, or if other special conditions are evident, an OBR request may require contact with the affected function. Update IDRS with activity code \"TC840 OBR\" If there is a pending refund (PAN TC 840, TC 846), and the refund cannot be stopped, issue a manual refund for only the offset amount. If the offset (TC 896 or TC 826, etc.) is pending, it must be reversed. The processing of an OBR requires prompt treatment to avoid the occurrence of an offset during Master File processing, depending upon the way in which the return is filed, i.e., paper or electronic. Evidence of the credit condition and documentation must be provided when an OBR manual refund posting voucher is submitted to Accounting Branch. Evidence may be either a copy of the return or an Integrated Data Retrieval System (IDRS) print showing the amount of the overpayment on the account. Overpayments are excess credits claimed on original returns (TC 150) or subsequent adjustments (including TC 290 and TC 300) that have not posted to Master File. Generally for original returns an OBR must be issued before the posting date (23C date) of the original return (TC 150) on which the overpayment was claimed. The Assessment Document Date or the 23C Date is always a Monday Issues and Considerations for",
    "textAfterTable": "Initiators are responsible for monitoring the account and taking all necessary subsequent actions. Evaluation and monitoring are critical to prevent erroneous refunds. Taxpayer Advocate Service Operations Assistance Requests (OARs): The Taxpayer Advocate Service uses the Operations Assistance Request (OAR) process to refer a case to the Operating Division/function when TAS lacks either the statutory or delegated authority to effect the resolution of the taxpayer's problem. The Taxpayer Advocate Service utilizes Form 12412, Operations Assistance Request (OAR), to initiate the OAR process. Taxpayer Advocate Service requests must receive priority attention in accordance with the Service Level Agreement . 3.12.279.15  (01-01-2015) Slipped or Mixed Blocks of Payments Slipped or mixed block conditions originate with the input of payments to the computer system. This can occur through the Integrated Submission and Remittance Processing (ISRP) and Integrated Data Retrieval System (IDRS) in Area Offices. The key elements in identifying a slipped or mixed block condition are relatively easy to recognize and include: The missing payment for one taxpayer is posted to the account of an unrelated taxpayer. There is a payment posted to the complainant's account with the same transaction date and a sequential Document Locator Number (DLN) which is unclaimed and/or excess. Example:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}