{
    "relation": [
        [
            "INFERRED",
            "BLOCK",
            "UNDER ELMES PIT",
            "UNDER ETHEL PIT",
            "TOTAL"
        ],
        [
            "RESOURCE",
            "SQ. FEET",
            "102,270",
            "102,270",
            ""
        ],
        [
            "ESTIMATE",
            "WIDTH FEET",
            "11",
            "11",
            ""
        ],
        [
            "",
            "TONS",
            "90,000",
            "90,000",
            "180,000"
        ],
        [
            "",
            "GRADE OZ/TON",
            "0.05",
            "0.05",
            "0.05"
        ]
    ],
    "pageTitle": "Filed by sedaredgar.com - Silverado Gold Mines Ltd. - Form 10KSB/A",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/731727/000106299309000242/0001062993-09-000242.txt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 702925423,
    "recordOffset": 702770618,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1092326=Certification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, 306087=During 2008, annual assessment work will be completed on the Eagle Creek property to keep the mining claims in good standing. Assessment work will be focused on the northwest part of the claim block, where drilling and trenching has defined an intrusive host rock, thought to be a sill, containing low grade gold, silver and antimony mineralization. If funding permits, the company will design a drilling program to further investigate the gold and by-product mineral distribution of the intrusive. Additional work which includes trenching and drilling will also be completed on the Number One. The Number One Vein was the lode quartz structure which has been mined commercially for antimony., 314630=Effective December 1, 2006, the Company adopted the provisions of SFAS 123(R) (Share-based Compensation) requiring equity awards granted under its stock option plan to be accounted for under the fair value method. Accordingly, share-based compensation is measured at grant date, based on the fair value of the award. Prior to December 1, 2006, the Company accounted for awards granted under its stock option plans utilizing the intrinsic value method prescribed by Accounting Principles Board (APB) Opinion No. 25, \u0093Accounting for Stock Issued to Employees\u0094 (APB 25), and related interpretations, and provided the required pro forma disclosures prescribed by SFAS 123, \u0093Accounting for Stock-Based Compensation\u0094 (SFAS 123), as amended. Under the existing stock option plans, all options vest entirely on the grant date. Therefore, there were no partially vested options outstanding as of the SFAS 123(R) adoption date., 1055366=On January 4, 2006, our Board of Directors adopted the 2006 Stock Option Plan (the \u00932006 Plan\u0094). The 2006 Plan authorizes the issuance of options to purchase our common stock to directors, officers, employees, and eligible consultants. We reserved 37,000,000 shares of our Common Stock for awards to be made under the 2006 Plan. On April 11, 2006, we filed a registration statement on Form S-8 to register all 37,000,000 of such shares. The 2006 Plan is to be administered by a committee of two or more members of the Board of Directors. The 2006 Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 996267=Entered into a lease purchase agreement in December 2007 to purchase mining equipment valued at $555,385. The agreement requires payment upon signature of $55,538 (paid), and 36 equal payments commencing upon delivery. The annual percentage rate implicit in the lease will be the rate prevailing at the time of delivery., 760361=Pursuant to EITF 04-02, \u0093Whether Mineral Rights are Tangible or Intangible Assets and Related Issues\u0094, the Company has modified its accounting policy with respect to mineral claim payments, retroactively effective to June 1, 2004, to capitalize the direct costs to acquire or lease mineral properties and mineral rights as tangible assets. The direct costs include the costs of signature (lease) bonuses, options to purchase or lease properties, and brokers\u0092 and legal fees. If the acquired mineral rights relate to unproven properties, the Company does not amortize the capitalized mineral costs, but evaluates the capitalized mineral costs periodically for impairment. The Company expenses all costs related to the exploration of mineral claims in which it had secured exploration rights prior to establishment of proven and probable reserves., 200398=The Ester Dome property first became known as a result of the discovery of placer gold in the creeks draining Ester Dome in about 1902. By 1909, approximately 1.5 million oz. had been mined from alluvial deposits. Ultimately, approximately 4 million ounces of placer gold have been mined from creeks draining Ester Dome., 1097615=Certification Pursuant to Section 302 of the Sarbanes-Oxley Act of 2002, 1004817=Mr. Anselmo is presently the chairman of our board of directors and is our president, chief executive officer and chief financial officer. Mr. Anselmo is also the chairman of the board of directors and the chief executive officer and chief financial officer of our wholly owned subsidiary, Silverado Green Fuel Inc. Mr. Anselmo has been the chairman of our board of directors and our chief operating officer since 1973. Mr. Anselmo has been our president, chief executive officer and chief financial officer from 1973 to 1994 and from 1997 to present. Mr. Anselmo founded Tri-Con Mining Ltd., a private exploration service company, in 1968, and is currently a shareholder, director, and president of Tri-Con Ltd. He is also the chairman and director of Tri-Con Ltd.\u0092s United States operating subsidiaries, Tri-Con Mining Inc. and Tri-Con Mining Alaska Inc. Mr. Anselmo obtained his bachelor of arts degree from Simon Fraser University in British Columbia, Canada., 962396=This property consists of 24 Federal placer claims and 36 Federal lode claims covering one and one- half square miles and adjoining the Nolan Gold Properties. The Company is obligated to pay a royalty equal to 10% of gross production and is subject to a minimum royalty of $80,000 per year. As at November 30, 2007, royalty payments totaling $360,000 (2006: $380,000) are unpaid, in arrears, and included in mineral claims payable., 208535=The Dobbs property contains the Ethel \u0096 Elmes vein system and structure which had been located in the first work and prospecting that took place on Ester Dome in the early 1900\u0092s. Exploration in the 1980\u0092s by us revealed a mineralized shear zone up to 25\u0092 wide containing high grade quartz veins and veinlets. This was the structure mined in 1987 \u0096 1989 which generated approximately 71,620 tons of gold bearing material. Combined with the previously mined stockpile from the O\u0092Dea vein, (11,000 tons), a total of approximately 82,620 tons were mined and milled during 1988 \u0096 1989 producing 7,362 oz. of gold., 105111=º      Ester \u0096 Silverado is party to an agreement for the conditional purchase of 22 state mining claims from Paul I. Barelka, Donald J. May, and Mark Thoennes; Silverado leases 1 federal lode mining claim and 4 state mining claims from Gilbert Dobbs; and Silverado is party to an agreement for the conditional purchase of 26 state mining claims from Roger C. Burggraf., 1000962=During our most recently completed fiscal year ended November 30, 2007, there were no changes that had a material effect on, or are reasonably likely to affect, our internal control over financial reporting., 1033044=The following table sets forth certain information concerning the Company\u0092s common shares owned beneficially as of February 15, 2008 by: (i) each person (including any \u0093group\u0094) known by the Company to own beneficially more than five percent (5%) of any class of the Company\u0092s voting securities, (ii) each director of the Company, (iii) each executive officer of the Company, and (iv) all directors and executive officers of the Company as a group. As of February 15, 2008 no person is known to us to beneficially own more than 5% of our outstanding common shares. Unless otherwise indicated, the shareholders listed possess sole voting and investment power with respect to the shares listed., 1096650=January 21, 2009, 228206=Silverado has an equal (50%) ownership interest in 77 state mining claims with Kathleen King (\u0093King\u0094). Silverado will acquire a full (100%) ownership interest in such state mining claims upon the payment of an additional $48,000 to King in installments of $5,000 per year. As of August 10, 2007 we had continued to make option payments on the Eagle Creek property, and as a result of this all of our mineral claims and options for this property are in good standing., 310498=Our management is confident that they will be able to raise additional capital during the second, third and fourth quarters of Fiscal 2008 to cover the resulting anticipated shortfall of approximately $3,250,000. However, there is no assurance that we will be able to raise the financing necessary to enable us to implement our business plan., 1077959=Filed as an exhibit to the Company\u0092s Registration Statement on Form 10 filed initially on May 11, 1984, as amended., 109956=Agreement For Conditional Purchase And Sale Of Mining Property (May et. al.) - The Ester Property, 12649=Silverado Gold Mines Ltd. was incorporated under the laws of British Columbia, Canada in June 1963. Silverado operates in the United States through its wholly owned subsidiaries, Silverado Gold Mines Inc., (incorporated May 29, 1981) and Silverado Green Fuel Inc. (incorporated August 14, 2006). We filed a transition application and notice of articles with the British Columbia Registrar of Companies on April 20, 2004 in order to replace our former memorandum adopted under the British Columbia Company Act and to alter our current articles to the extent necessary to ensure compliance with the British Columbia Business Corporations Act (the \u0093BC Business Corporations Act\u0094). The BC Business Corporations Act came into force in British Columbia on March 29, 2004 and replaced the former British Columbia Company Act. The transition notice and notice of articles was filed under the BC Business Corporations Act that requires any British Columbia company incorporated under the former British Columbia Company Act to effect transition under the BC Business Corporations Act by filing with the British Columbia Registrar of Companies a transition application and notice of articles within two years following the coming into force of the BC Business Corporations Act., 1078420=Filed as an exhibit to the Company\u0092s Current Report on Form 8-K filed on September 11, 2002., 832705=In September 2006 the Financial Accounting Standards Board issued Statement of Financial Accounting Standards No. 157 \u0093Fair Value Measurements\u0094 (SFAS 157), which provides expanded guidance for using fair value to measure assets and liabilities. SFAS 157 establishes a hierarchy for data used to value assets and liabilities, and requires additional disclosures about the extent to which a company measures assets and liabilities at fair value, the information used to measure fair value, and the effect of fair value measurements on earnings. Implementation of SFAS 157 is required on December 1, 2007. The Company is evaluating the potential impact of the adoption of SFAS No. 157 on the Company\u0092s consolidated financial statements, 830825=In December 2006, the Financial Accounting Standards Board (FASB) issued Staff Position (FSP) EITF 00-19-2, \u0093Accounting for Registration Payment Arrangements\u0094. This FSP specifies that the contingent obligation to make future payments or otherwise transfer consideration under a registration payment arrangement, whether issued as a separate agreement or included as a provision of a financial instrument or other agreement, should be separately recognized and measured in accordance with FASB Statement No. 5, \u0093Accounting for Contingencies\u0094. The guidance is effective for fiscal years beginning December 15, 2006. The Company is evaluating the potential impact of the adoption of SFAS No. 159 on the Company\u0092s consolidated financial statements., 825970=Effective December 1, 2006, the Company adopted the provisions of SFAS 123(R) (Share-based Compensation) requiring equity awards granted under its stock option plan to be accounted for under the fair value method. Accordingly, share-based compensation is measured at grant date, based on the fair value of the award. Prior to December 1, 2006, the Company accounted for awards granted under its stock option plans utilizing the intrinsic value method prescribed by Accounting Principles Board (APB) Opinion No. 25, \u0093Accounting for Stock Issued to Employees\u0094 (APB 25), and related interpretations, and provided the required pro forma disclosures prescribed by SFAS 123, \u0093Accounting for Stock-Based Compensation\u0094 (SFAS 123), as amended. Under the existing stock option plans, all options vest entirely on the grant date. Therefore, there were no partially vested options outstanding as of the SFAS 123(R) adoption date., 1054332=On March 29, 2006, our Board of Directors adopted the 2006-II Stock Option Plan (the \u00932006-II Plan\u0094). The 2006-II Plan authorizes the issuance of options to purchase our common stock to directors, officers, employees, and eligible consultants. We reserved 28,000,000 shares of our Common Stock for awards to be made under the 2006-II Plan. On March 31, 2006, we filed a registration statement on Form S-8 to register all 28,000,000 of such shares. The 2006-II Plan is to be administered by a committee of one or more members of the Board of Directors, and Mr. Garry L. Anselmo and Mr. James F. Dixon were named members of the committee charged with administering the 2006-II Plan. The 2006-II Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 2237=[X] ANNUAL REPORT UNDER SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 899622=The amounts charged for services by the Tri-Con Group approximate the fair value of these costs had they been performed by arm\u0092s length parties and are included in various captions of the Statements of Operations. At November 30, 2007 the Company owed the Tri-Con Group $1,214,717 (2006: $359,834) for services provided. The amounts are non-interest bearing and due on demand., 73719=The Fortress area is located 2 miles northeast of Nolan camp and north of Smith Creek Dome. This area exposes several outcropping northwest striking quartz veins, some of which contain significant gold mineralization. The Company investigated the Fortress area in late summer 2007 and collected several quartz vein samples and confirmed anomalous gold concentrations in vein samples., 148129=The Nolan Lode claims are comprised of 407 unpatented federal lode claims. A claim staking program added 242 of these claims during 2006, and 95 more during 2007. Ownership of these federal lode claims is in the name of Silverado Gold Mines Inc. This area encompasses approximately 11 square miles., 207046=In June of 1990, ACNC (American Copper and Nickel Company) entered into a joint venture with us on the Grant Mine claims and a larger area of Ester Dome. This included the Dobbs, and St Paul / Barelka properties., 118113=In the event of default, the non-defaulting party must provide written notice to cure to the defaulting party. If the defaulting party fails to cure such default within sixty (60) days after the date of such notice, the non-defaulting party\u0092s remedy is to arbitrate the issue in accordance with the terms of the 1978 Agreement., 201011=Work at the Grant Mine, on the eastern flank of Ester Dome, was initiated in about 1928 with the sinking of shafts to bedrock to attempt to locate buried alluvial gold. This work, while it did not locate alluvial gold, did reveal quartz rubble near bedrock containing free gold. Mr. Grant, the claim owner, sunk two shafts through about 80\u0092 of loess (silt) cover and by 1931 had reportedly mined about 600 tons from the newly discovered Irishman Vein. This work was all completed from the only levels established, the 50, 100 and 150-foot levels. Mr. Roger Burggraf purchased the claims from Grant\u0092s heirs in 1973 and deepened the shaft to the 200-foot level. This work revealed a new vein, the O\u0092Dea vein which has eclipsed the Irishman vein in importance. Burggraf completed limited development on the Irishman vein and the O\u0092Dea vein during the next 5 years, and in 1978 entered into a lease option agreement with Silverado., 932634=In November 2007, the Company reduced the exercise price of 16,513,024 of its common stock purchase warrants from $0.12 to $0.035 per common share, and such warrants are subsequently exercised in December 2007. Subsequent to the fiscal year-end, in December 2007, the Company reduced the exercise price of 990,001 of its common stock purchase warrants from $0.12 to $0.035 per common share and 495,001 of its common share purchase warrants from $0.06 to $0.035 per common share, of which a total of 1,484,563 were subsequently exercised in January 2008, and the remaining 439 warrants expired subsequently., 918260=In January 2007, 21,500,000 stock options were granted to directors as well as to employees of the Tri-Con Group at an exercise price of $0.07 with a six year term expiring January 11, 2013. The prevailing market price of the Company\u0092s shares on the date of grant was $0.067. The Company recognized stock compensation expense of $734,094 based on the Black-Scholes option pricing model., 16575=The Nolan Gold Project consists of two areas of exploration and development. The Nolan Placer Gold project involves exploration and development of gold occurring in placer deposits such as stream channels or ancient remnants of placer gold deposits. The second part of the project is the Nolan Lode Gold Project. The lode gold project consists of exploration work designed to locate bedrock structures or formations of bedrock which host gold and antimony mineralization. The two facets of the Nolan Gold Project, complement each other, as every stone or pebble in a placer deposit is a piece of rock eroded from some near or distant bedrock formation, each gold nugget or grain of gold in a placer deposit was originally part of a bedrock formation or structure with lode gold mineralization. The search for a lode source is unraveling the sequences of events that caused a placer deposit to form. During 2007, we removed scrap materials and sealed the Swede Channel and Mary\u0092s East portals as part of our reclamation obligations with the Bureau of Land Management. During 2008, we will continue to work on our reclamation obligations with the Bureau of Land Management., 754621=Following the conclusion of a review of certain of the Company\u0092s filings by the Securities and Exchange Commission, the Company determined to make the following accounting policies changes, restatements and reclassifications to the consolidated financial statements for the fiscal years 2007 and 2006., 170151=To identify surface or sub-surface placer deposits at our Nolan Gold Project that are prospective for test mining operations. In general, these deposits are located on benches that are ancient river beds and lakeshore deposits located above the present channel of Nolan Creek. These deposits include Mary\u0092s Bench, Jack London Bench, Wooll Bench, Workman\u0092s Bench, Swede Channel, Upper Nolan Creek (deep channel), Lower Nolan Bench and Mary\u0092s East including areas adjoining to the north, east and south. The objectives of our drilling program will include the determination of the nature and extent of areas of known bench deposits that are prospects for test mining operations and the identification of new bench deposits that may be prospects for test mining operations. Mary\u0092s Bench East and areas adjoining north, east and south as well as, the Swede Channel and the areas adjoining to the east and south, in that order, are our exploration priorities as they have showed the most positive results from earlier exploration that we have completed. Wooll Bench and Workman\u0092s Bench have been less extensively explored with only limited drilling. The Lower Nolan Bench has not been drilled. The newly discovered Jack London Bench may also be a priority target during fiscal 2008., 110656=The term of the 1979 Agreement commenced on the date Silverado took possession of the 1979 Claims and will expire upon the earlier of (i) the purchase price therefor being paid in full, or (ii) a default remaining uncured for more than sixty (60) days after the date of the written notice of such default., 1071128=Agreement for Conditional Purchase and Sale of Mining Property between the Company and Paul Barelka, Donald May and Mark Thoennes dated May 12, 1979 \u0096 St. Paul Property (1), 149123=We first began acquiring placer claims on Nolan Creek in 1979. The following table summarizes gold production and gold recoveries by year from the Nolan properties since 1980., 321868=As discussed in note 2, the consolidated balance sheets as of November 30, 2007 and 2006, and the related consolidated statements of operations and other comprehensive loss, stockholders\u0092 equity, and cash flows for the years then ended and for the period since recommencement of the exploration stage on December 1, 2001 to November 30, 2007 have been restated., 161780=We did not carry out any gold recovery operations during 2004 and 2005 as we focused on lode exploration on the property, as opposed to test placer mining activities., 65621=In July 2007, the Company excavated one trench in the old Workman\u0092s Bench pit with a total length of 125 feet. This trench exposed the largest antimony veins discovered in the Nolan Creek area to that date. A total of 15 continuous chip samples were collected from Trench J., 311697=The Securities and Exchange Commission\u0092s Exchange Act Guide 7 \u0093Description of Property by Issuers Engaged or to be Engaged in Significant Mining Operations\u0094 requires that mining companies in the exploration stage should not refer to themselves as development stage companies in their financial statements, even though such companies should comply with Financial Accounting Board Statement No. 7, if applicable. We are an exploration stage company under the SEC\u0092s Guide 7 and accordingly, we have not been referred to as a development stage company in our financial statements. Accumulated results of operations are presented from December 1, 2001, the date we re-entered the exploration stage., 1079328=Filed as an exhibit to the Company\u0092s Current Report on Form 8-K filed on June 13, 2003., 888145=The assets and liabilities under capital leases are recorded at the lower of the present value of the minimum lease payments or the fair value of the asset. The assets are amortized over their estimated productive lives which are estimated to be 10 years. Amortization of assets under capital leases charged to expense in 2007 was $0 (2006: $70,112)., 1104232=January 21, 2009, 112192=In the event of default, the Sellers must provide written notice to cure to Silverado. If Silverado fails to cure such default within sixty (60) days after the date of such notice, the non-defaulting party\u0092s remedy is to arbitrate the issue in accordance with the terms of the 1979 Agreement., 1007724=Dr. Willson was appointed our vice-president, fuel technology, in March 2000, to lead the conversion of the Grant Mill into a commercial level Low-Rank Coal-Water Fuel plant. Dr. Willson received a supervisory chemical engineering rating from the US Civil Service Commission in 1978, a PhD in physical chemistry from the University of Wyoming in 1970 and a bachelor of arts in chemistry and mathematics from the University of Northern Colorado in 1965. He founded Coal-Water Fuel Services in 1994, which provides engineering services to develop clean coal conversion projects to develop low cost and non-hazardous alternatives to oil., 294206=We are continuing our exploration program on the Nolan Gold Project. The objective of this exploration program is to continue with tunneling into the Workman\u0092s Bench mineralized zone to intersect the 80 foot wide zone that contains gold bearing antimony-quartz veins. The company intends to collect a bulk sample from the mineralized zone for metallurgical test work. The underground exposure of the mineralized zone will play an important key role for the company in obtaining a better understanding of the nature of the structurally controlled gold and antimony mineralization in the Solomon Shear Zone. This will significantly support Silverado\u0092s exploration strategy. The underground work will continue until the end of January, 2008., 1057047=The Tri-Con Mining Group are operations, exploration and development contractors, and have been employed by us under contract since 1972 to carry out all of our fieldwork and to provide administrative and management services. Under the current contract dated January 1, 1997, work is charged at cost plus 25% for property acquisition, exploration and development and cost plus 15% for mining operations and reclamation. Cost includes out of pocket or actual cost plus 15% charge for office overhead including stand by and contingencies. Capital purchases are exempt from any support charges. Services of the directors of the Tri-Con Mining Group are charged at a rate of $75 CDN per hour. Services of the directors of the Tri-Con Mining Group who are also our directors, namely Mr. Anselmo, are not charged. In addition, each agreement requires us to pay a base fee of $10,000 CDN (equal to approximately $10,000 US) per month to each of Tri-Con Mining Ltd., Tri-Con Mining Inc. and Tri-Con Mining Alaska Inc. However, the Tri-Con Mining Group has waived payment of the base fee under two of the agreements and is only paid $10,000 CDN (equal to approximately $10,000 US) per month in total., 80779=Silverado conducted volume measurements of samples collected during 2003 and 2004 drilling programs. Results of these measurements showed that a 5 foot sample from the Nolan Deep Channel averaged 14.80 gallons, whereas a 5 foot sample from the Mary\u0092s East Bench deposit averaged 19.20 gallons. The Nolan Deep Channel deposits contain significant amounts of silt, sand, and clay, whereas the left limit bench deposits such as those at Mary\u0092s East are much coarser grained. Determination of volumetric measurements results in a more accurate estimate of gold grade in the placer deposit. Hence, each placer deposit has been volume-characterized by Silverado contractors during exploration., 1031741=With the exception of periodic grants of stock incentive options, we do not compensate our directors for serving in such capacities. Our 2006 Stock Option Plan, our 2006-II Stock Option Plan, our 2007 Stock Option Plan, and our 2007-1 Equity Compensation Plan each permit the grant of incentive stock options to our directors., 64614=Following up on the encouraging results achieved by backhoe trenching, the Company started a first phase drilling program at Pringle Bench at the end of August 2007 using its own diamond core drill rig. Eleven drill holes were drilled on Pringle Bench totaling 2,415 feet. The core drilling program was designed to check for down-dip continuity of the gold bearing antimony-quartz vein systems in the zones identified thus far. The core drilling confirmed the presence of stibnite (antimony) and quartz veins at varying depths., 164198=We have spent approximately $32,700,000 over the last 19 years acquiring, exploring and undertaking test mining activities and test exploration on the Nolan Gold Project. Up to November 30, 2007, we have completed 851 placer drill holes with a cumulative total of 49,370 feet of drilling. About 219 of those drill holes were completed along the frozen gold bearing deep channel of the Nolan Creek known as the Nolan Deep Channel. We have also completed 28 lode exploration drill holes with a cumulative total of 6,870 feet of drilling., 232392=We pay an annual federal claim maintenance fee to the Bureau of Land Management of $125 for each federal mineral claim that is owned by us or held under a purchase or lease agreement. We paid aggregate annual federal claim maintenance fees of $39,500 during fiscal 2005, $71,375 during fiscal 2006, and $83,750 during 2007. The annual increases are due to the continued acquisition of placer and lode claims that solidify and protect our land holdings in the Koyukuk Mining District. We anticipate an amount similar to that paid for 2007 will be due in fiscal 2008., 997698=As required by Rule 13a-15 under the Securities Exchange Act of 1934 (the \u0093Exchange Act\u0094), we carried out an evaluation of the effectiveness of the design and operation of our disclosure controls and procedures and our internal control over financial reporting as of November 30, 2007, being the date of our most recently completed fiscal year end. This evaluation was carried out under the supervision and with the participation of our Chief Executive Officer and Chief Financial Officer, Garry L. Anselmo. Based upon that evaluation, our Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures and our internal control over financial reporting are effective to ensure, among other things, that the information required to be disclosed by us in the reports that we file or submit under the Exchange Act is accumulated, recorded, processed, communicated, and reported within the time periods specified by the rules and forms of the Securities and Exchange Commission., 27718=The 2007 lode exploration program consisted of extensive ground geochemical soil surveys and ground geophysical very low frequency electromagnetic (\u0093VLF-EM\u0094) surveys, extensive backhoe trenching and a first phase diamond core drilling program to follow up on the significant results achieved by backhoe trenching., 101356=On December 18, 2006, Silverado Green Fuel Inc. announced the signing of a Memorandum of Understanding (\u0093MOU\u0094) between Choctaw County, the Choctaw County Economic Development District, the Mississippi Development Authority (\u0093MDA\u0094) and Silverado Green Fuel Inc. The MOU is an agreement to build the country\u0092s first Low-Rank Coal-Water fuel commercial demonstration plant at the Red Hills Ecoplex just outside of Ackerman, MS. It is anticipated that the $26 million Silverado Green Fuel Demonstration Project will be located on a 14-acre site, and is being designed to utilize the state's vast supply of low-rank coal reserves by converting them into green fuel, a new form of coal-based, environmentally friendly, low-cost, alternative fuel., 986714=Investing and financing activities that do not have a direct impact on current cash flows are excluded from the cash flow statements. The following transactions were excluded from the statements of cash flows: During the year ended November 30, 2007 the Company:, 966958=The Company entered into a seven year office lease agreement expiring in July 2014 for its Vancouver office when obliged to vacate its previous lease location at the expiry of the lease. The Company\u0092s future minimum lease payments under this lease are as follows:, 307318=On December 18, 2006, Silverado Green Fuel Inc. announced the signing of a Memorandum of Understanding (\u0093MOU\u0094) between Choctaw County, the Choctaw County Economic Development District, the Mississippi Development Authority (\u0093MDA\u0094) and Silverado Green Fuel Inc. The MOU is an agreement to build the country\u0092s first Low-Rank Coal-Water fuel commercial demonstration plant at the Red Hills Ecoplex just outside of Ackerman, MS. The anticipated $26 million Silverado Green Fuel Demonstration Project will be located on a 14-acre site, and is being designed to utilize the state's vast supply of low-rank coal reserves by converting them into green fuel, a new form of coal-based, environmentally friendly, low-cost, alternative fuel., 1080437=Filed as an exhibit to the Company\u0092s Registration Statement on Form S-8 filed on February 20, 2007., 1070772=Agreement for Conditional Purchase and Sale of Mining Property between the Company and Roger C. Burggraf dated October 6, 1978 \u0096 Grant Mine Property (1), 1105169=In connection with Amendment No. 1 to the Annual Report of Silverado Gold Mines, Ltd. (the \"Company\") on Form 10-KSB for the fiscal year ended November 30, 2007, as filed with the Securities and Exchange Commission on the date hereof (the \"Report\"), I, Garry L. Anselmo, Principal Financial Officer of the Company, certify to the best of my knowledge, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, that:, 835135=Gold Inventory consists of the following at November 30, 2007 and 2006:, 229208=During the early 1980s, geochemical surveys located anomalous gold and antimony targets. Drilling conducted on the property during 1991 and 1992 resulted in the outlining definition of gold mineralization hosted in intrusive rocks. Further in-fill drilling is necessary to determine continuity of the gold bearing sequence, and to ascertain grades of gold within the deposit. We will consider doing additional work on the gold-antimony bearing veins upon which the property was founded., 995816=Issued 8,055,000 shares at $0.0342 totaling $275,136 in December 2007 pursuant to the exercise in November 2007 of common stock purchase warrants., 992406=Issued 1,484,563 shares at $0.035 totaling $51,960 in January 2008 pursuant to the exercise of common stock purchase warrants., 113327=The Dobbs Lease had an initial term of ten (10) years, with automatic renewals for additional five (5) year terms to take effect beginning on November 6, 1999 and every fifth year thereafter if, at the commencement of each renewal period, the Dobbs Lease remains in good standing and Silverado pays US $10,000 to Dobbs., 883681=On March 1, 2001, the Company completed negotiations to restructure its $1,860,000 convertible debentures. The replacement debentures aggregated $2,384,892 and consisted of the original $1,860,000 principal amount plus all accrued interest to March 1, 2001. The debentures bear interest of 8.0% per annum. Interest is due and payable on a quarterly basis on February 28, May 31, August 31 and November 30. If the Company fails to make any payment of principal or interest, the Company must issue shares equivalent in value to the unpaid amounts of 20% below the average market price., 240544=Exploration Law of 1872. See below for definitions of \u0093Lode\u0094 and \u0093Placer\u0094., 321417=In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of Silverado Gold Mines Ltd. and Subsidiaries (An Exploration Stage Company) as of November 30, 2007 and 2006, and the results of its operations and its cash flows for the years then ended in conformity with accounting principles generally accepted in the United States of America., 1056445=We have had related party transactions with Tri-Con Mining Ltd., Tri-Con Mining Inc., and Tri-Con Mining Alaska Inc. (collectively, the \u0093Tri-Con Mining Group\u0094). Each of Tri-Con Mining Ltd., Tri-Con Mining Inc. and Tri-Con Mining Alaska Inc. are owned and controlled by Mr. Garry Anselmo, our chief executive officer, chief financial officer and, the chairman of our board of directors. We are party to three separate contracts dated January 1, 1997 with the Tri-Con Mining Group, one with each of Tri-Con Mining Ltd., Tri-Con Mining Inc. and Tri-Con Mining Alaska Inc., 93299=The properties comprising our Eagle Creek property are discussed in detail under the heading Description of Properties in this annual report. During 2007, annual assessment work was completed on the property, and rental payments were made to keep the mining claims in good standing., 1007073=Dr. Eden was appointed our vice-president exploration, Silverado Gold Mines Inc., in July 2006. Dr. Eden holds a Master\u0092s Degree in Economic Geology from the Technical University of Clausthal. He focused his thesis on the \u0093Geology and Gold Mineralization of the Nolan Area in the Brooks Range, Alaska\u0094. Dr. Eden also holds a doctorate in Exploration Geology with an emphasis on GIS applications in mineral exploration from the University of Technology Aachen. He has received two internationally recognized research awards for his academic achievements., 91164=The placer claims comprising our Hammond property are discussed in detail under the heading Description of Properties in this annual report. During 2007, rental payments were made to keep the mining claims in good standing., 209354=The Grant Mine operations, including camp, buildings, machine shops and related equipment, were constructed in the late 1980s. Our mill and equipment are in operating condition but are not currently operating. The mill has remained inactive since February 1989. The plant and equipment cost us $2,076,780. This amount has been written down to $nil on our audited financial statements. Power to the Grant Mine operations is provided by diesel powered generators located on site. Commercial power transmission lines cross through the property, and could provide power to the facilities for any future operations. Auxiliary power to the Grant Mine operations will be provided by diesel powered generators located on site. During fiscal 2007, our work on the property was limited to assessment work. We plan to maintain claim rental payments for the current fiscal year and to continue with assessment work., 164767=We also have a gold recovery facility located at the Nolan Gold Project that is used to recover gold from gravel that we extract during test mining activities as part of our exploration of the Nolan Gold Project. This gold recovery facility was modernized in 2006. Our gold recovery facility incorporates nugget traps, hydraulic riffles, classification and gravity concentration processes in order to remove gold present in gravel material. The gold recovery facility has a processing rate of 75 cubic yards of gravel material per hour. The gold facility can only be operated in the late spring to early fall months when free-flowing water is available to operate the plant., 310873=Planned operations as described above could be curtailed if funding were not available. In addition, as of the date of this filing gold is trading above the spot price used to value the Company's inventory at November 30, 2007. Furthermore, historically, the Company has sold its gold inventory at a premium to the spot price. These benefits, although presently determinable, would serve to further reduce the anticipated shortfall., 887789=During the year ended November 30, 2004, the Company entered into an agreement to combine the two lease agreements. The new agreement required payment upon signing of $50,000 (paid), monthly payments of $25,000 until July 2007 for the balance of principal plus interest at a rate of 7.5% per annum., 992837=Issued 2,300,000 shares at an average of $0.068 totaling $156,000 pursuant to consulting agreements in January 2008., 813609=Effective December 1, 2002, the Company adopted SFAS No. 143, \u0093Accounting for Asset Retirement Obligations\u0094, which addresses financial accounting and reporting for obligations associated with the retirement of tangible long-lived assets and the associated retirement costs. The standard applies to legal obligations associated with the retirement of long-lived assets that result from the acquisition, construction, development and normal use of the asset., 990177=Issued 59,198,460 units at an average price of $0.0336 for the aggregate purchase price of $1,991,546 in February 2008. Each unit consists of one share of restricted common stock and one half-warrant, with a full warrant (consisting of two half-warrants) being exercisable for a period of one year for the purchase of one share of restricted common stock at a per share exercise price of $0.07., 843275=During the year ended November 30, 2007, the Company sold 1,573 troy ounces of gold (2006: 204 troy ounces) at an average price of $743.49 (2006: $428.22) per troy ounce for proceeds of $1,169,509 (2006: $87,357), which was recorded as other income earned during the exploration stage., 192406=In 1993 we acquired the group of placer gold mining claims overlying the Slisco Bench, and located along the right limit of the Hammond River. The Hammond River drainage has been the subject of intense exploration since the early 1900s. Poor exposures, difficult terrain, and deep overburden confronted the first explorers and early miners in the Hammond River region. Those miners who worked with persistence succeeded for the most part in developing small-scale projects constrained in scope by the inadequacies of their mechanical equipment, and the lack of technical knowledge and financial support. Nevertheless, because of the work done by these early explorers, the Hammond River has produced approximately eighty thousand ounces of placer gold, including the second largest gold nugget ever discovered in Alaska \u0096 a nugget weighing more than 135 ounces., 1079543=Filed as an exhibit to the Company\u0092s Registration Statement on Form SB-2 filed on May 19, 2004., 26122=The Company intends to carry out more placer drilling on Jack London Bench and other benches along the left limit of Nolan Creek in 2008. The drilling will be performed by a drill contractor. All of the targets are well above the elevation of Nolan Creek., 902088=A summary of the change in stock options for the years ended November 30, 2007 and 2006 is presented below:, 915188=As of November 30, 2007 the following stock options were outstanding:, 1052511=On August 31, 2007, our Board of Directors adopted the 2007-1 Equity Compensation Plan (the \u0093Incentive Stock Option Plan\u0094). The Incentive Stock Option Plan was established to encourage certain of our officers, employees, directors and consultants to acquire and hold stock in the Company as an added incentive to remain with the Company and to increase their efforts in promoting the interests of the Company, as well as to attract and retain capable individuals. A maximum of twenty-five million (25,000,000) shares of our common stock can be issued under the Incentive Stock Option Plan. The aggregate fair market value of the our common shares issued to an employee in exchange for stock options under the Incentive Stock Option Plan cannot exceed $100,000 during any calendar year. The Incentive Stock Option Plan may be terminated at the discretion of the Board of Directors of the Company., 1031403=Mr. Dixon was granted 2,000,000 options on January 11, 2007. The options have an exercise price of $0.07, vested immediately, and expire on January 11, 2013. The value of the option award was computed in accordance with the provisions of FAS 123R., 921962=In 2006 the Company granted 49,400,000 stock options to directors of the Company and 7,100,000 stock options to certain employees of the Tri-Con Group. The Company did not record a compensation expense on the granting of stock options to employees and directors, but provided disclosure of the pro forma loss per share information had the Company elected to follow the fair value method. Using the Black-Scholes option pricing model the pro forma information was as follows:, 207903=The St. Paul / Barelka claims have undergone a significant amount of exploration since the early 1980s when they were first acquired by us. The early work was in the form of electromagnetic surveys, geochemical soil sampling, trenching and diamond and percussion drilling. Most recently, in 1991-1992, ACNC completed 9 diamond drill holes and 3 rotary reverse circulation holes. Subsequent work in 1996-1997 amounted to significant trenching and 91 drill holes focusing on the St Paul structure which had been partially defined by our previous work., 73031=At the end of November 2007, the Company started to drive a tunnel into the Workman\u0092s Bench mineralized zone to intersect the 80 feet wide zone that contains the gold bearing antimony-quartz veins. The Company intends to collect a bulk sample from the mineralized zone for metallurgical test work. The underground exposure of the mineralized zone will play an important key role for the Company in obtaining a better understanding of the nature of the structurally controlled gold and antimony mineralization in the Solomon Shear Zone. This will significantly support Silverado\u0092s exploration strategy., 307032=Completing the 2008 work plan will be contingent on available funding. Even if funding becomes available, there is no assurance that a commercial gold-silver-antimony deposit will, 30500=The following table presents significant 2007 trench assay results for Pringle Bench:, 148524=Placer mining on Nolan Creek and its tributaries was first recorded at about the turn of the last century. During the ensuing years and up to 1942, recoveries of approximately 120,000 oz. of placer gold were reported. This gold is well known for its coarse size and high fineness. The early miners mined Nolan Creek and its left limit tributaries, particularly Fay, Archibald and Smith creeks by surface methods on the upper areas and by underground methods in the lower reaches of the creeks when overburden became too deep. Shafts are found throughout these areas., 971975=The Company entered into a five year office lease agreement expiring in February 2012 for its Fairbanks, Alaska office at an annual lease cost of $18,000 subject to a 4% increase per annum The Company\u0092s future minimum lease payments under this lease are as follows:, 935992=In January 2007, 21,500,000 stock options were granted to directors and certain employees of the Tri- Con Group., 289528=On August 31, 2007, our Board of Directors adopted the 2007-1 Equity Compensation Plan (the \"Incentive Stock Option Plan\"). The Incentive Stock Option Plan was established to encourage certain of our officers, employees, directors and consultants to acquire and hold stock in the Company as an added incentive to remain with the Company and to increase their efforts in promoting the interests of the Company, as well as to attract and retain capable individuals. A maximum of twenty-five million (25,000,000) shares of our common stock can be issued under the Incentive Stock Option Plan. The aggregate fair market value of the our common shares issued to an employee in exchange for stock options under the Incentive Stock Option Plan cannot exceed $100,000 during any calendar year. The Incentive Stock Option Plan may be terminated at the discretion of the Board of Directors of the Company., 114240=Furthermore, Silverado must (i) perform annual assessment work beginning with the assessment year ending September 1, 1985; (ii) expend at least $1,500 per year on the Dobbs Claims until the $1,500,000 threshold is met (with such expenditures to be credited toward meeting such threshold); (iii) refrain from permitting any liens or levies to be placed against the Dobbs Claims, and timely pay any taxes imposed on the Dobbs Claims; (iv) indemnify Dobbs from any claims arising from Silverado\u0092s operations and conditions on the Dobbs Claims arising after the date of possession; and (v) obtain and maintain adequate insurance., 7948=The information in this Amendment No. 1 to the Annual Report on Form 10-KSB contains forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements involve risks and uncertainties, including statements regarding our capital needs, business plans and expectations. Such forward-looking statements involve risks and uncertainties regarding the market price of gold, availability of funds, government regulations, common share prices, operating costs, capital costs, outcomes of test mining activities and other factors. Forward-looking statements are made, without limitation, in relation to operating plans, property exploration activities, including test mining activities, availability of funds, environmental reclamation, operating costs and permit acquisition. Any statements contained herein that are not statements of historical facts may be deemed to be forward-looking statements. In some cases, you can identify forward-looking statements by terminology such as \u0093may,\u0094 \u0093will,\u0094 \u0093should,\u0094 \u0093expect,\u0094 \u0093plan\u0094, \u0093intend,\u0094 \u0093anticipate,\u0094 \u0093believe,\u0094 \u0093estimate,\u0094 \u0093predict,\u0094 \u0093potential,\u0094 or \u0093continue,\u0094 and the negative of such terms or other comparable terminology. Actual events or results may differ materially. In evaluating these statements, you should consider various factors, including the risks outlined below, and, from time to time, in other reports we file with the SEC. These factors may cause our actual results to differ materially from any forward-looking statement. We disclaim any obligation to publicly update these statements, or disclose any difference between its actual results and those reflected in these statements. The information constitutes forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Given these uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements., 292632=On January 4, 2006, our Board of Directors adopted the 2006 Stock Option Plan (the \"2006 Plan\"). The 2006 Plan authorizes the issuance of options to purchase our common stock to directors, officers, employees, and eligible consultants. We reserved 37,000,000 shares of our Common Stock for awards to be made under the 2006 Plan. On April 11, 2006, we filed a registration statement on Form S-8 to register all 37,000,000 of such shares. The 2006 Plan is to be administered by a committee of two or more members of the Board of Directors. The 2006 Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 1071816=Change of Control Agreement between the Company and Garry L. Anselmo dated May, 1995(6), 1078869=Filed as an exhibit to the Company\u0092s Annual Report on Form 10-K for the year ended November 30, 1996., 2687=Commission File Number 000-12132, 1010245=Ms. Irma Mungal was appointed our Vice-President Administration of Silverado Gold Mines Ltd. in November of 2007. Ms. Mungal holds degrees in Human Resource Management and Business Administration with majors in Management. She has also engaged in studies in Labor Relations, and is a registered School Teacher in the Caribbean. Ms. Mungal has also been licensed with the Manitoba Securities Commission, and the British Columbia Securities Commission. As a representative of a leading financial institution Ms. Mungal was responsible for operations risk management across western Canada. She also served various roles including as an investment adviser and retirement planner., 89043=2.1 Ester Dome Property 2007 Work, 199718=The total area of all claims equals approximately 2.5 square miles and all claims are valid until September 1, 2008. There has been no legal survey on the claims., 142920=Our head office is located at Suite 1820, 1111 West Georgia Street, Vancouver, British Columbia, Canada V6E 4M3. These premises are comprised of approximately 4,752 square feet and are leased for a term expiring in July 2014., 886649=On October 11, 2002, the Company entered into a lease purchase agreement whereby the Company would purchase mining equipment valued at a total of $1,496,150. The agreement required payment upon signing of $550,000 (paid), $100,000 (paid) on or before December 1, 2004 and 24 equal payments thereafter for the balance of the purchase price plus interest at a rate of 12% per annum., 290466=On January 11, 2007, our Board of Directors adopted the 2007 Stock Option Plan (the \"2007 Plan\"). The 2007 Plan authorizes the issuance of options to purchase our common stock to directors, officers, employees, and eligible consultants. We reserved 25,000,000 shares of our Common Stock for awards to be made under the 2007 Plan. On February 20, 2007, we filed a registration statement on Form S-8 to register all 25,000,000 of such shares. The 2007 Plan is to be administered by a committee of two or more members of the Board of Directors. The 2007 Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 889353=The Tri-Con Group are operations, exploration and development contractors and have been employed by the Company under contract since 1972 to carry out all the Company\u0092s fieldwork and to provide field administrative and management services. Under the current contract dated January, 1997, work is charged at cost plus 25% for exploration and cost plus 15% for development and mining. Cost includes out-of- pocket or actual cost plus 15% charge for office overhead including stand-by and contingencies. There is no mark-up on capital purchases. The Tri-Con Group does not charge the Company for the services of its directors who are also directors of the Company. For the year ended November 30, 2007, the Tri-Con Group\u0092s services focused mainly on corporate planning, mining, engineering and preparation for year round production on the Company\u0092s Nolan property; mining administration services at both the field and corporate offices, and administration services connected with the Low-Rank Coal-Water fuel project., 1036964=Under Rule 13d-3, a beneficial owner of a security includes any person who, directly or indirectly, through any contract, arrangement, understanding, relationship, or otherwise has or shares: (i) voting power, which includes the power to vote, or to direct the voting of shares; and (ii) investment power, which includes the power to dispose or direct the disposition of shares. Certain shares may be deemed to be beneficially owned by more than one person (if, for example, persons share the power to vote or the power to dispose of the shares). In addition, shares are deemed to be beneficially owned by a person if the person has the right to acquire the shares (for example, upon exercise of an option) within 60 days of the date as of which the information is provided. In computing the percentage ownership of any person, the amount of shares outstanding is deemed to include the amount of shares beneficially owned by such person (and only such person) by reason of these acquisition rights. As a result, the percentage of outstanding shares of any person as shown in this table does not necessarily reflect the person\u0092s actual ownership or voting power with respect to the number of shares of common stock actually outstanding on February 15, 2007. As of February 15, 2007, there were 904,231,969 common shares of the Company issued and outstanding., 166741=During the winter of 2005, Silverado began an underground exploration and development on the Swede Channel. Continuing into 2006, Silverado installed about 900 feet of exploration drifts by underground tunneling methods into the Swede Channel. Prior bulk sampling had shown the channel to contain gold in the basal gravels, so the project was designed to obtain a large bulk sample from the tunnel being advanced into the channel. The 2005-2006 winter stockpile contained 8,896 LCY of gravel material, and was processed between June 28 and July 20 of 2006, yielding 939.07 troy ounces of gold nuggets and dust. The Swede portal was reopened in early November of 2006, and gravel extraction on the remaining sections of the Swede Channel continued until its completion by the middle of January 2007. A total of 8,963 LCY of gravel material was stockpiled from the remaining Swede Channel., 757139=Retroactively effective from the period since recommencement of exploration stage from December 1, 2001, the Company has modified the accounting policy in the gold inventory to measure the gold inventories at the lower of cost or market. The Company is still in the exploration stage. By definition, the Company\u0092s direct and absorbed costs would exceed the market value of any gold recovery. Therefore, the Company has retroactively set up inventory groups from December 1, 2001, valued each group at the spot price as of the date of the addition to the gold inventory, and record the costs of gold inventory sold on a first-in first-out basis. Gold sale proceeds and cost of gold sold are now recorded as other income earned during the exploration stage., 1058272=We are in arrears in the amount of $1,214,717 to the Tri-Con Group as of November 30, 2007 in connection with exploration activities on the Nolan Gold Project during fiscal 2007. At November 30, 2006, we were in arrears $359,834 to the Tri-Con Mining Group for exploration, development and administration services. For the years 2005, 2006 and 2007 the Tri-Con Mining Group\u0092s services focused mainly on test mining activities on the Nolan property, the low-rank coal-water fuel program as well as corporate planning, exploration, engineering, and, and administration services at both our field and corporate offices., 172988=We have been working on interpreting the geology of the Nolan area since 1979, when we first acquired the project. Our latest and most extensive exploration program began in early 2007 and was directed at improving our placer deposit definition and discovering potential lode sources of the placer gold. Our exploration geologists and mining engineers have worked to move this objective forward. Our exploration efforts have included the analysis of geophysical data, geochemical sampling results, company records and analysis provided by government mineral investigation efforts and publications as well as the trenching and exploration drilling of target areas., 229836=We did not complete any exploration activity on the Eagle Creek property during 2007 other than assessment work and maintenance, however, an exploration work plan that includes trenching and drilling was developed and successfully permitted through the APMA process during 2007. However, extensive exploration drilling has shown gold mineralization throughout the property. Exploration of the Eagle Creek property is currently in the preliminary stages., 94478=Completing the 2008 work plan will be contingent on available funding. Even if funding becomes available, there is no assurance that a commercial gold-silver-antimony deposit will be defined. A commercially viable economic mineral deposit has not been defined on the property, and there is no assurance that a commercially viable economic mineral deposit exists on the property., 260747=No matters were submitted to a vote of our security holders, through the solicitation of proxies or otherwise, during our fourth quarter ended November 30, 2007., 116008=The term of the 1978 Agreement commenced on the date Silverado took possession of the 1978 Claims and will continue until the earlier of (i) the purchase price therefor being paid in full, (ii) a default by Silverado remaining uncured for more than sixty (60) days after the date of the written notice of such default, or (iii) Silverado providing sixty (60) days notice of termination to Burggraf., 25725=RC drilling is the principal exploration method used by Silverado in the identification of placer gold deposits. All placer drilling in 2007 was performed by a contractor using 6 inch diameter drill rods. Placer drill samples were collected in 5 foot intervals (industry standard)., 991309=Issued 500,000 shares at an average of $0.06 totaling $30,000 pursuant to consulting agreements in February 2008., 1005870=Mr. Dixon has been one of our directors since May 6, 1988. Mr. Dixon is presently a lawyer and a partner in the law firm of Shandro Dixon Edgson, Barristers and Solicitors, of Vancouver, British Columbia. Mr. Dixon has been engaged in the practice of law since 1973. Mr. Dixon holds a bachelor of commerce degree and a bachelor of law degree., 84220=ALS Chemex of Vancouver, Canada, an ISO 9001:2000 accredited laboratory, has analyzed most of the Silverado sample stream from lode-style deposits. More recently, Alaska Assay Laboratories LLC of Fairbanks, Alaska, an ANS/ISO/IEC Standard 17035:2005 accredited laboratory, has been used by Silverado for analytical work. Both laboratories produce a coarse split from which a finely ground material to 150 mesh is analyzed. The pulverized material and the coarse reject are stored by the laboratories for possible re-analysis., 177872=We will continue our 2008 exploration program with the objective of identifying mineralization of commercial significance along this zone., 1079987=Filed as an exhibit to the Company\u0092s Registration Statement on Form S-8 filed on April 11, 2006., 933299=Subsequent to fiscal year-end, in December 2007, the Company reduced the exercise price of 4,166,667 of its common share purchase warrants from $0.10 to $0.035 per common share, and such warrants were subsequently exercised in February 2008., 809680=The Securities and Exchange Commission\u0092s Exchange Act Guide 7, \u0093Description of Property by Issuers Engaged or to be Engaged in Significant Mining Operations\u0094 requires that mining companies in the exploration stage should not refer to themselves as development stage companies in the financial statements, even though such companies should comply with Financial Accounting Standard Board Statement No. 7, if applicable. Accordingly, the Company has not been referred to as being a development stage company. Accumulated results of operations are presented from December 1, 2001, the date the Company re-entered the exploration stage., 1103098=In connection with Amendment No. 1 to the Annual Report of Silverado Gold Mines, Ltd. (the \"Company\") on Form 10-KSB for the fiscal year ended November 30, 2007, as filed with the Securities and Exchange Commission on the date hereof (the \"Report\"), I, Garry L. Anselmo, Principal Financial Officer of the Company, certify to the best of my knowledge, pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002, that:, 1053440=On January 11, 2007, our Board of Directors adopted the 2007 Stock Option Plan (the \u00932007 Plan\u0094). The 2007 Plan authorizes the issuance of options to purchase our common stock to directors, officers, employees, and eligible consultants. We reserved 25,000,000 shares of our Common Stock for awards to be made under the 2007 Plan. On February 20, 2007, we filed a registration statement on Form S-8 to register all 25,000,000 of such shares. The 2007 Plan is to be administered by a committee of two or more members of the Board of Directors. The 2007 Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 1006308=Mr. McCulloch has been one of our directors since December 14, 1998. Mr. McCulloch is also a director of our subsidiary, Silverado Green Fuel Inc. Mr. McCulloch retired as district manager from Canada Safeway in January, 1991., 829456=In February 2007, the FASB issued SFAS No. 159, \u0093Establishing the Fair Value Option for Financial Assets and Liabilities (\u0093SFAS No. 159\u0094). SFAS No. 159 was to permit all entities to choose to elect, at specified election dates, to measure eligible financial instruments at fair value. An entity shall report unrealized gains and losses on items for which the fair value option has been elected in earnings at each subsequent reporting date, and recognize upfront costs and fees related to those items in earnings as incurred and not deferred. SFAS No. 159 applies to fiscal years beginning after November 15, 2007, with early adoption permitted for an equity that has also elected to apply the provisions of SFAS No. 157, \u0093Fair Value Measurements\u0094. An entity is prohibited from retrospectively applying SFAS No. 159, unless it chooses early adoption. SFAS No. 159 also applies to eligible items existing at November 15, 2007 (or early adoption date). The Company is evaluating the potential impact of the adoption of SFAS No. 159 on the Company\u0092s consolidated financial statements, 75557=1.3.2 Nolan Lode Gold Exploration 2008 Work Plan, 294978=Reclamation work will be in progress throughout the summer and into fall. Our objective will be to reclaim 10 acres of disturbed surface area, while limiting 2008 surface disturbance to 5 acres or less. We work closely with the government agencies responsible for managing the lands that we work, and pride ourselves in being responsive and responsible stewards of the land., 203980=The total tonnage processed through the Grant mill up to 1989 amounts to 111,852 tons with a total of 11,215 oz. of gold produced for an average calculated recovered grade of 0.10 oz/ton. Gold recoveries from the Grant Mine are summarized as follows:, 833496=In July 2006, the Financial Accounting Standards Board issued FASB Interpretation No. 48 \u0093Accounting for Uncertainty in Income Taxes--an Interpretation of FASB Statement 109\u0094 (FIN 48), which clarifies the accounting for uncertainty in tax positions taken or expected to be taken in a tax return, including issues relating to financial statement recognition and measurement. FIN 48 provides that the tax effects from an uncertain tax position can be recognized in the financial statements only if the position is \u0093more-likely-than-not\u0094 of being sustained if the position were to be challenged by a taxing authority. The assessment of the tax position is based solely on the technical merits of the position, without regard to the likelihood that the tax position may be challenged. If an uncertain tax position meets the \u0093more-likely-than-not\u0094 threshold, the largest amount of tax benefit that is greater than 50 percent likely of being recognized upon ultimate settlement with the taxing authority, is recorded. The provisions of FIN 48 are effective for fiscal years beginning after December 15, 2006, with the cumulative effect of the change in accounting principle recorded as an adjustment to opening retained earnings., 304209=During 2008, we plan to complete the closure of the Grant Mill Tailings Pond. This pond is filled to capacity, and will be capped and decommissioned after a final approval of the tailings pond closure plan is received from State of Alaska regulatory agencies. A meaningful exploration program may be completed during the summer months to explore for and identify small high-grade gold anomalies as well as larger low-grade gold anomalies., 1018930=Mr. Anselmo was granted 15,000,000 options on January 4, 2006. The options have an exercise price of $0.05, vested immediately, and expire on January 4, 2013. The value of the option award was computed in accordance with the provisions of FAS 123R., 26039=1.2.2 Nolan Placer Gold Exploration 2008 Work Plan, 165475=On May 17, 2007, Silverado entered into a 10-year \"shared well agreement\" with Sukakpak, Inc., an Alaskan corporation, through which Silverado designed, drilled and installed at its expense a high-capacity water well in the nearby rural community of Wiseman, Alaska, to serve both as a source of high-quality drinking water, and a high-volume source of sample processing water. In addition, Silverado upgraded its Nolan Gold Project drinking water storage facility to a series of three fully-enclosed 2,000-gallon plastic storage tanks, and also a modern multi-modular kitchen and dining facility. Silverado also expended approximately $85,400 for the design and installation of a state-of-the-art \"fast activated sludge treatment\" (FAST®) arctic-capable wastewater treatment facility designed by Lifewater Engineering Company of Fairbanks, Alaska that is capable of serving the treatment needs of up to 24 personnel, and that treats the camp's domestic wastewater to such a high quality that it can be discharged directly to the land surface. The design, construction and installation of the wastewater facility was undertaken under the approval of the Alaska Department of Environmental Conservation (ADEC)., 2477=[ ] TRANSITION REPORT UNDER SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 116440=Title to the 1978 Claims will vest in Silverado upon its payment in full of the purchase price of $2,000,000. The purchase price is payable at 15% of net profits (as such term is defined in the 1978 Agreement) per year, calculated on a quarterly basis, and payable within sixty (60) days of the end of each calendar quarter. The 1978 Agreement also called for Silverado to issue an aggregate of 100,000 shares of its common stock to Burggraf over the course of four (4) years from the date thereof. Once Silverado pays the purchase price in full to Burggraf, it will be obligated to make royalty payments equal to 3% of net profits derived from its operations on the 1978 Claims until production is terminated. Furthermore, if any agreement is reached with a third party concerning properties owned by such third party within two miles of any portion of the 1978 Claims, Burggraf will be entitled to royalty payments equal to 2% of net profits derived from Silverado\u0092s operations on the 1978 Claims Silverado is also obligated to (i) perform annual assessment work beginning with the assessment year ending September 1, 1979; (ii) expend up to $15,000 per year on the 1978 Claims until the $2,000,000 purchase price is paid (with such expenditures to be credited toward Silverado\u0092s payment of the purchase price); (iii) refrain from permitting any liens or levies to be placed against the 1978 Claims, and timely pay any taxes imposed thereon; (iv) indemnify Burggraf from any claims arising from Silverado\u0092s operations and conditions on the 1978 Claims arising after the date of possession; and (v) obtain and maintain adequate insurance., 993258=Issued 8,458,023 units at $0.035 per unit totaling $296,031 in December 2007 pursuant to the exercise of common stock purchase warrants., 99452=We entered the fuel sector in 2000 by forming a new Fuel Technology division which operates out of Fairbanks, Alaska. This division of the business is operated by our wholly owned subsidiary, Silverado Green Fuel Inc., under the supervision of Dr. Warrack Willson, Vice-President of Fuel Technology. The fuel product is called low-rank coal-water fuel (LRCWF or Green Fuel), which is a low-cost, non-toxic, non-hazardous alternative to oil fuels used in commercial boilers for the production of electricity and industrial heat. As a liquid fuel Green Fuel enjoys all the benefits of liquid handling and storage, Green Fuel allows coal to be used sight unseen and is made from coal, America\u0092s most abundant fossil energy resource. This fuel is produced by the fine grinding of low-rank coal, and subsequent hydrothermal treatment of the finely ground coal particles. Hydrothermal treatment (HT) is an advanced technology, featuring moderate temperature/pressure, non-evaporative treatment or hot water drying, which irreversibly removes most of the inherent moisture from low-rank coal and allows the formulation of commercially viable LRCWFs. HT is similar in many respects to pressure cooking, and the product retains all of the desirable combustion characteristics of low-rank coal. When Green Fuel is injected into a boiler, the particles ignite and burn rapidly, which leads to little or no boiler de-rating when substituted for oil. We believe that demand for the Green Fuel and its production and utilization technology exists because of the high cost of oil and the desire for economical alternatives to oil that are environmentally friendly., 19815=1.1.1 Swede Channel and Mary\u0092s East 2007 Work, 91100=3.1 Hammond Property 2007 Work, 7367=Silverado Gold Mines Ltd. is filing this Amendment No. 1 to its Annual Report on Form 10-KSB, filed with the Securities and Exchange Commission (\u0093SEC\u0094) on February 28, 2008, in order to restate the financial statements for the corresponding period and to address the comments of the SEC following the conclusion of its review of certain of the Company\u0092s filings., 759765=Since December 1, 2001, recommencement of exploration stage, the Company had expensed all costs related to the acquisition, maintenance and exploration of mineral claims in which it had secured exploration rights prior to establishment of proven and probable reserves., 94953=Projected Annual Budget for Fiscal Year 2008, 167661=In early January 2007, crews installed a portal into Mary\u0092s East, and began an underground drift into the Mary\u0092s East deposit. The Mary\u0092s East Placer Deposit was discovered by drilling in 2004. Subsequent infill drilling during 2006 showed a bedrock shelf perched about 40 feet higher in elevation than the Mary\u0092s Bench deposit, which hosted gold bearing gravel layers at the bedrock contact. The Mary\u0092s East project was completed at the end of March 2007 and 9,357 LCY of gravel material was stockpiled from this project., 989781=Subsequent to November 30, 2007, the Company:, 126010=We had working capital of $1,759,774 as of November 30, 2007. We did not report revenues in our last three fiscal years ended November 30, 2007, 2006 or 2005. Our plan of operations calls for expenditures of a minimum of $6,550,000 to be incurred by us over the next twelve months in order to continue our mining exploration activities at the Nolan Gold, Ester Dome, Eagle Creek and Hammond Projects. While we will apply proceeds from gold sales generated from our test mining activities to cover our exploration expenditures, we anticipate that proceeds from gold sales over the next twelve months may not exceed our projected expenditures during this period with the result that we will require substantial financing in order for us to pursue our plan of operations. If we do not achieve the necessary financing, then we will not be able to proceed with our planned exploration activities, including our planned test mining activities, and our financial condition, business prospects and results of operations will be materially adversely affected., 89713=During 2008, we plan to continue work toward completion of the closure of the Grant Mill Tailings Pond. This pond, which is filled to capacity with tailings, will be capped and decommissioned after a final approval of the tailings pond closure plan is received from the Alaska Department of Environmental Conservation (\u0093ADEC\u0094). We also plan to continue reclamation work on our Ester Dome holdings during 2008., 1030925=Mr. McCulloch was granted 2,000,000 options on January 11, 2007. The options have an exercise price of $0.07, vested immediately, and expire on January 11, 2013. The value of the option award was computed in accordance with the provisions of FAS 123R., 200751=Shortly after the discovery of placer gold, lode claims were staked on quartz veins discovered on Ester Dome. By 1912, four stamp mills were operating in the area., 86264=Core recovery is checked in every box coming off the drill rig. During 2008, Silverado's geological contractors have reported that core recovery is averaging 95% since the exploration drilling switched to NQ core. Silverado contractors have competently prepared samples analysis and dispatch to external laboratories., 21199=The Swede channel and Mary\u0092s East portals were both sealed after completion of the underground bulk sampling projects. Both sites were reclaimed in summer 2007 as required by the Bureau of Land Management., 163450=The 2006-2007 winter stockpile contained 18,320 LCY (Swede Channel and Mary\u0092s East combined) of gravel material, and was processed from June through July of 2007 at the existing sluice plant location, yielding 2,811.74 troy ounces of gold nugget gold and over 207 pounds of concentrate that contained gold particles smaller than ¼ inch in size. The fine concentrate yielded 915.06 try ounces of gold (30% gold), which when combined with 2811.74 troy ounces of nugget gold recovered in 2007 totals 3726.80 troy ounces. Also, the fine concentrates yielded 65.10 troy ounces of silver or 2.15% silver., 1018375=Mr. Anselmo was granted 10,000,000 options on January 11, 2007. The options have an exercise price of $0.07, vested immediately, and expire on January 11, 2013. The value of the option award was computed in accordance with the provisions of FAS 123R., 20270=In early January 2007, crews installed a portal into Mary\u0092s East, and began an underground drift into the Mary\u0092s East deposit. The Mary\u0092s East project was completed at the end of March 2007 and 9,357 LCY of gravel material was stockpiled from this project., 1008461=Daniel L. Basketfield, P.E., appointed in March of 2007 as Silverado Gold Mines Inc. and Green Fuel Inc. Vice President, Environmental Engineering, brings the Company public, private, and industry expertise gained through more than 19 years of experience as a practicing professional engineer. A licensed civil engineer in the states of Washington, Alaska and Hawaii, and licensed agricultural engineer in the State of Oregon. Mr. Basketfield was educated as an Agricultural Engineer (B.S., M.S) at Oregon State University, and engaged in additional study at the University of Alaska Fairbanks. Across his career he has served in various positions that include Senior Water Resources Engineer and Acting Water Resources Business Area Manager for Seattle Public Utilities, co-founder of a private engineering firm specializing in Interior Alaska water and wastewater systems, Senior Environmental Engineer for Tri-con Mining Alaska Inc., Environmental Engineer and Interior District Contaminated Sites Coordinator for the Alaska Department of Environmental Conservation, and Tribal Agricultural Engineer for the Confederated Salish and Kootenai Tribes of Northwest Montana. Mr. Basketfield has also had the opportunity to engage in work with NOAA\u0092s Climate Change Science Program as an advisor and contributing author on decision support systems, and has independently co-authored several papers on topics that include the non-linear analysis of hydrologic and climatic data., 316319=Our audited financial statements for the year ended November 30, 2007, as set forth below, are included with this Annual Report on Form 10-KSB/A. Our audited financial statements are prepared on the basis of accounting principles generally accepted in the United States and are expressed in U.S. dollars., 304681=Completing the 2008 exploration work plan will be contingent on available funding., 887336=On February 14, 2003, the Company entered into a three-year lease agreement whereby the company would purchase mining equipment valued at a total of $250,170. The agreement required payment upon signing of $105,000 (paid), $25,000 on or before December 4, 2004 and 24 equal payments for the balance of the purchase price plus interest at a rate of 12% per annum., 6388=The aggregate market value of the voting and non-voting common equity held by non-affiliates computed by reference to the price at which the common equity was sold, or the average bid and asked price of such common equity, as of a specified date within the past 60 days: $58,663,794 as of February 21, 2008., 312518=Pursuant to EITF 04-02, \u0093Whether Mineral Rights are Tangible or Intangible Assets and Related Issues\u0094, the Company has modified its accounting policy with respect to mineral claim payments, retroactively effective to June 1, 2004, to capitalize the direct costs to acquire or lease mineral properties and mineral rights as tangible assets. The direct costs include the costs of signature (lease) bonuses, options to purchase or lease properties, and brokers\u0092 and legal fees. If the acquired mineral rights relate to unproven properties, the Company does not amortize the capitalized mineral costs, but evaluates the capitalized mineral costs periodically for impairment. The Company expenses all costs related to the exploration of mineral claims in which it had secured exploration rights prior to establishment of proven and probable reserves., 991727=Issued 44,000,000 units at $0.0312 for the aggregate purchase price of $1,375,000 in January 2008. Each unit consists of one share of restricted common stock and one half-warrant, with a full warrant (consisting of two half- warrants) being exercisable for a period of one year for the purchase of one share of restricted common stock at a per share exercise price of $0.07., 203494=During the period 1987 \u0096 1989, we decided to open pit mine the Ethel - Elmes structures, located a short distance from the mill facility on the Dobbs claims adjacent to the Grant Mine. This mining operation generated approximately 71,620 tons of gold bearing material. Combined with the previously mined stockpile from the O\u0092Dea vein, (11,000 tons), and material from another source (Silver Dollar), the total tonnage processed amounted to 111,852 tons., 102781=During late May of 2007, Silverado environmental staff met in a \u0093pre-permitting\u0094 meeting with representatives of the Mississippi Department of Environmental Quality (\u0093MDEQ\u0094). At that meeting all the various sections of MDEQ that would be involved in the permitting of the Green Fuel industrial process were present, representatives of these sections were assigned to our project, and the lead MDEQ regulator that will serve as our point-of-contact was designated., 942920=At November 30, 2007, the Company had losses carried forward totaling $28,807,000 available to reduce future years\u0092 income for U.S. income tax purposes which expire in various years to 2027. In addition, we had losses carried forward in Canada totaling CDN$20,490,000 which expire in various years to 2027., 1066660=We granted options to purchase an aggregate of 2,700,000 common shares to the following individuals on January 11, 2007 as follows. All options are fully vested and are exercisable at a price of $0.07 per share for a six year term from the date of grant:, 194840=In 2006, Silverado commenced drilling along the Slisco deep channel which completed additional 39 drill holes with a total footage of 4,782 feet. This exploration work was done to define the length of the Slisco deep channel. Phase one and Phase two drilling, sampling, and sample analysis of a total of 103 drill holes, has served to delineate the Slisco deep channel for a total length of 1800 lineal feet. Surface topography indicates that the channel could cover a length of up to 4,500 feet., 75638=During 2008, lode exploration work will consist ground geochemical soil sampling, VLF-EM ground geophysical surveying, trenching and drilling in the five mile long gold and antimony mineralization containing Solomon Shear Zone and the gold mineralization containing Fortress area., 277673=As at February 21, 2008 we had 926,270,430 common shares issued and outstanding that were held by approximately 4,000 registered holders., 1071468=Lease of Mining Claims with Option to Purchase between the Company and Alaska Mining Company, Inc. dated February 3, 1995 \u0096 Hammond Property (4), 72427=A first phase exploration drilling program on Workman\u0092s Bench using the Company\u0092s own diamond core drill rig started at the end of August 2007 and ended on October 23, 2007 due to weather conditions. Seven drill holes were drilled totaling 2,140 feet. This drilling program was designed to check for down-dip continuity of the gold bearing antimony-quartz veins previously discovered. Visual observation of the drill core had identified the presence of many antimony-quartz and quartz veins. The majority of these veins were found to be contained in an 80 foot wide zone., 89642=2.2 Ester Dome Property 2008 Work Plan, 1080665=Filed as an exhibit to the Company\u0092s Registration Statement on Form S-8 filed on September 7, 2007. * Filed herewith., 961561=During the year ended November 30, 2003, the Company staked 36 unpatented Federal lode claims., 103278=As we await full funding of the project, preliminary work on aspects of the various permits involved will continue during fiscal 2008. The development of an Environmental Management System (\u0093EMS\u0094) that was initiated in 2007 upon the signing of the MOU will also continue during fiscal 2008. Silverado has also agreed to fund a study by the University of Alaska Fairbanks of the chemical and physical characteristics of Mississippi lignite coal, and it is anticipated that that study will commence during fiscal 2008., 988400=During the year ended November 30, 2006 the Company:, 210515=(b) May (St. Paul) / Barelka:, 874636=Reconciliation of asset retirement obligation for the year ended November 30, 2007:, 919808=The exercise price of all options issued under our 2007 Stock Option Plan was $0.07 per share. The expected term was calculated using the simplified approach as outlined in SAB 107., 308081=During late May of 2007 Silverado environmental staff met in a \u0093pre-permitting\u0094 meeting with representatives of the Mississippi Department of Environmental Quality (\u0093MDEQ\u0094). At that meeting all the various sections of MDEQ that would be involved in the permitting of the Green Fuel industrial process were present, representatives of these sections were assigned to our project, and the lead MDEQ regulator that will serve as our point-of-contact was designated., 25480=The 2007 placer drilling program discovered an entirely new zone of placer gold which has been named Jack London Bench. Jack London Bench is located 200 feet north-east of and 50 feet above the Mary\u0092s East Bench., 935236=In 2007 the Company established an Equity Compensation Plan (\u0093the Plan\u0094) to encourage certain directors, officers, employees, employees of affiliated companies and consultants to acquire and hold stock in the Company as an added incentive to remain with the Company, and to enable the Company to attract and retain capable individuals. The number of shares issued under the Plan may not exceed 25,000,000 in aggregate. Options granted under the Plan may include non-qualified stock options as well as incentive stock options intended to qualify under Section 422 of the Internal Revenue Code. Each stock option plan agreement specifies when all or any installment of the option becomes exercisable., 1078202=Filed as an exhibit to the Company\u0092s Quarterly Report on Form 10-Q filed on July 15, 1997., 94890=2008 Exploration Budget, 115393=Silverado is party to an Agreement For Conditional Purchase And Sale Of Mining Property (the \u00931978 Agreement\u0094), dated October 6, 1978, with Roger C. Burggraf (\u0093Burggraf\u0094) pursuant to which Silverado agreed to conditionally purchase six unpatented lode mining claims located in Fairbanks, Alaska (the \u00931978 Claims\u0094), including all other subsequently located or acquired claims and interests in mining property within two miles of any portion of the 1978 Claims, from Burggraf. The 1978 Claims are identified as: Irishman No.1, Roosevelt, Banjo, O\u0092Dea, White Rock Lode, and D. and Z., 65393=As of November 30, 2007, assay results from the Pringle Bench drilling program were still pending. 1.3.1.3 Workman\u0092s Bench Workman\u0092s Bench is located near the confluence of Smith and Nolan Creek., 89110=The properties comprising our Ester Dome gold project are discussed in detail under the heading Description of Properties in this annual report. In recent years, all exploration trenches were backfilled, stabilized, and seeded to resist surface erosion. Annual assessment work for 2008 was completed and all claim rental payments were made to maintain the property in good standing. Fairbanks North Star Borough 2007 taxes were paid on the mill facility and mine facilities in the sum of $8,535.42., 106533=Pursuant to that certain Lease Of Mining Claims With Option To Purchase, effective December 14, 1994, as amended on July 5, 1996 and on August 21, 1996 (the \u0093Lease\u0094), Silverado leased certain unpatented placer mining claims and lode mining claims recorded in Fairbanks, Alaska (collectively, \u0093Claims\u0094), and obtained an option to purchase such Claims, from Alaska Mining Company, Inc. (\u0093ALMINCO\u0094)., 98449=Completion of all of the projects described in the 2008 work plan may be contingent on additional funding. There is no assurance that additional funding, if required, will be obtained. Even if the additional funding is obtained, there is no assurance that a commercial ore deposit will be developed. Revenues from any anticipated gold sales may be insufficient to cover the costs of the gold recovery., 91945=The higher placer gold values in both pay layers are located within the left limit of the Slisco Channel. In addition to the encouraging drill results to date, the potential of extending the channel to the southeast plus the possibility of discovering gold bearing tributary channels, make this a prospect for additional discoveries. During the summer of 2008, a series of drill holes will be completed to explore for the extension of the Slisco Channel to the south. Presently, it has been traced for 1,800 feet. The drill program will also seek to define any gold bearing tributaries to the Slisco Channel., 65929=The following table presents significant 2007 trench assay results for Workman\u0092s Bench:, 310031=At November 30, 2007, we had working capital of $1,759,774. During the first quarter of 2008 we raised $3,860,388 in additional share capital. Our plan of mining operations in Alaska anticipates that we will expend $6,550,000 during fiscal year 2008. In addition, we expect to spend $321,500 on research and development for the Green Fuel project and approximately $2,000,000 on administrative costs in the Company\u0092s Vancouver office., 202763=When Aurex became involved in the joint venture, a decision was made to construct a 230 ton per day gravity / cyanide mill to treat the expanded resource that had been outlined on the O\u0092Dea structure above the 200\u0092 level. This mill and related support facilities were constructed by Tri-con Mining Inc. for Silverado using a design provided by Melis Consulting Engineers Ltd. The completed mill was commissioned in October 1985 and was shut down in January 1986. During the short mill run, the plant operated above design capacity. Lower feed grades than had been forecast plus other underground problems caused Aurex to elect to withdraw from the project and a premature shutdown of the facility., 29257=In June, July, and August, the Company undertook backhoe trenching on Pringle Bench and Workman\u0092s Bench. This program was followed up by a first phase diamond core drilling program., 1072611=Operating Agreement between the Company and Tri-Con Mining Ltd. Dated January 1, 1997 (5), 26410=The Company also intends to carry out placer drilling in the Workman\u0092s Bench area, located near the confluence of Smith and Nolan Creek. Workman\u0092s Bench was mined on a small scale during 1999-2000., 91421=3.2 Hammond Property 2008 Work Plan, 122828=Research and development activities were primarily attributable to the pursuit of the development of our Green Fuel business. During 2004 and 2005, the majority of the research and development costs attributable to the low-rank coal-water fuel technology related to further technical work on the fuel creation temperature and the preparation of a United States grant application., 993699=Issued 13,000,000 units at $0.03 per unit for the aggregate purchase price of $390,000 in December, 756377=Since December 1, 2001, recommencement of exploration stage, the Company had valued its gold inventory using the spot gold price at the end of the reporting period and directly applied the gold extraction and the revaluation difference to exploration costs. In addition, proceeds from sales of gold extracted during exploration and test mining had been recorded as a reduction of exploration costs during the exploration stage period., 965553=The Company has entered into consulting agreements with two individuals for various corporate planning and business development services to the Company. Under the terms of the agreements, the Company will issue 10,600,000 shares in aggregate over the length of the contracts which range in length from six months to two years, concluding in January 2008., 1006623=Mr. Mackay has served as our corporate secretary since June 1998. Mr. Mackay is a lawyer who practiced as a sole practitioner from March 1993 to June 1998 prior to joining Silverado. Prior to 1993, Mr. Mackay was a lawyer and partner in the law firm Davis and Company, Barristers and Solicitors, of Vancouver, British Columbia where he practiced for 35 years., 928672=Warrants outstanding as at November 30, 2007 are exercisable into one common share for each warrant held and are summarized as follows:, 228992=Earliest work on the property started approximately in 1913, with the original owner exploring for antimony. A number of companies have explored the property from 1964 to the present., 933598=In fiscal year 2006 and 2007, the Company completed private placements resulting in the issuance of units consisting of one share of Company restricted common stock and one half-warrant (with each whole warrant exercisable for one share of Company restricted common stock). The warrants referenced above were issued during such private placements. There was no value assigned to these warrants when they were granted. The exercise price reduction incentivized the holders to exercise the warrants, which assisted the Company in meeting its working capital requirements. The Company received less proceeds from these exercised warrants due to the price reductions, but the Company believed these warrants would have been left to expire had the Company not effected the exercise price reductions., 1011571=Our directors are elected to hold office until the next annual meeting of our shareholders and until their respective successors have been elected and qualified. Our executive officers are appointed by our board of directors to hold office until their successors are appointed. The last annual meeting of our shareholders was held on May 17, 2004., 291367=On March 29, 2006, our Board of Directors adopted the 2006-II Stock Option Plan (the \"2006-II Plan\"). The 2006-II Plan authorizes the issuance of options to purchase our common stock to directors, officers, employees, and eligible consultants. We reserved 28,000,000 shares of our Common Stock for awards to be made under the 2006-II Plan. On March 31, 2006, we filed a registration statement on Form S-8 to register all 28,000,000 of such shares. The 2006-II Plan is to be administered by a committee of one or more members of the Board of Directors, and Mr. Garry L. Anselmo and Mr. James F. Dixon were named members of the committee charged with administering the 2006-II Plan. The 2006-II Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 21580=During March and April 2007, placer gold exploration focused on drilling along the left limit of Nolan Creek to explore both north and south of the Mary\u0092s East and Swede Channel deposits. Further placer drilling was carried out within the area between the Mary\u0092s East/Swede Channel Deposits and the Topnotch Prospect. A total of 130 drill holes were completed during that drilling program with a total drill footage of 6,005 feet. Out of the 130 drill holes, 54 show the presence of gold. 3 drill holes showed sample intervals with gold values above the cut-off grade of 0.04 troy ounces per bank cubic yard (toz/BYCD) determined for underground bulk sampling (see table below)., 873204=The Company adopted SFAS No. 143 on December 1, 2002. Upon adoption the Company increased its reclamation liability by $270,000, increased the carrying value of assets by $116,774 and recorded a cumulative effect adjustment of $153,226., 201971=Over the subsequent 8 years up to 1986, we completed an extensive surface exploration and underground development program as well as test milling the underground development muck from work on the O\u0092Dea structure, in a small (approximately 50 tons per day) gravity mill, during 1980 \u0096 1982. In 1984, we entered into a joint venture agreement with Aurex Inc., a subsidiary of Marubeni America Corporation to further explore and develop the Grant Mine plus a larger area of interest around the mine. Aurex withdrew from the joint venture at the end of 1985 and the mill was shut down in Jan. 1986. A total of approximately 22,000 tons of gold bearing rock were mined from the O\u0092Dea structure during the period 1980 to January 1986, yielding 4,090 ounces of gold., 110094=Silverado is party to an Agreement For Conditional Purchase And Sale Of Mining Property (the \u00931979 Agreement\u0094), dated May 12, 1979, with Donald J. May, Paul I. Barelka, and Mark Thoennes (collectively, the \u0093Sellers\u0094) pursuant to which Silverado agreed to conditionally purchase certain unpatented lode mining claims located in Fairbanks, Alaska (the \u00931979 Claims\u0094), including all other then-owned and after-acquired mining claims or interests in mining claims within one mile of any portion of the 1979 Claims, from the Sellers., 191639=As of November 30, 2007, we were in arrears of required mineral property claims and option payments of $360,000 and therefore our rights to the property were adversely affected. We are currently re-negotiating the terms and conditions of the Alminco agreement with Alminco. Alminco has confirmed that our mineral claims and options are in good standing on the understanding we will use our best efforts to pay the minimum royalty payments, including the payments that are in arrears for the past four years, when business conditions permit, however there is no assurance that we will be able to successfully renegotiate the terms and conditions of the Alminco agreement., 1079766=Filed as an exhibit to the Company\u0092s Quarterly Report on Form 10-QSB filed on July 15, 2004., 29698=In 2007, the Company followed up on the significant results achieved on Pringle Bench in 2006 and excavated six additional trenches, totaling 1296 feet, to further investigate the gold bearing antimony-quartz veins previously identified in 2006. A total of 153 combined continuous chip and select chip rock samples were collected. Continuous chip samples were collected over a defined length along the trench walls and, therefore, are representative for a specific trench interval. Continuous chip samples do contain sample material of mineralized veins if those occur within the sample interval. Select samples were collected from individual quartz and stibnite-quartz veins exposed in the trenches and, therefore, their assays represent the individual veins sampled., 319394=We have audited the accompanying consolidated balance sheets of Silverado Gold Mines Ltd. and Subsidiaries (An Exploration Stage Company) as of November 30, 2007 and 2006, and the related consolidated statements of operations and other comprehensive loss, stockholders\u0092 equity, and cash flows for the years then ended. These consolidated financial statements are the responsibility of the company\u0092s management. Our responsibility is to express an opinion on these financial statements based on our audits. Our opinion on the consolidated statements of operations and other comprehensive loss, stockholders\u0092 equity, and cash flows for the period since recommencement of the exploration stage, December 1, 2001 to November 30, 2007 insofar as it relates to amounts for the prior periods through November 30, 2004 is based on the reports of other auditors., 2352=For the fiscal year ended: November 30, 2007, 1079098=Filed as an exhibit to the Company\u0092s Annual Report on Form 10-KSB for the year ended November 30, 2002, 990876=Issued 4,166,667 shares at $0.035 totaling $145,833 in February 2008 pursuant to the exercise of common stock purchase warrants., 98956=We commenced development of a low-rank coal-water fuel business in 2000. Our determination to enter into this business was based on a decision to broaden our business beyond mineral exploration and production. This aspect of our business is still in the start-up phase of operations and no revenues have been achieved to date. We do not anticipate that revenues from this technology will be achieved until commercialization of the technology has been established., 93615=4.1 Eagle Creek Property 2008 Work Plan, 304853=The encouraging drill results to date, the potential of extending the Slisco Channel to the southeast plus the possibility of discovering gold bearing tributary channels, make this a prospect for additional discoveries. During the summer of 2008, a series of drill holes may be completed to explore for the extension of the Slisco Channel to the south. Presently, it has been traced for 1,800 feet. The drill program will also seek to define any gold bearing tributaries to the Slisco Channel., 111613=Under the 1979 Agreement, Silverado also covenanted to: (i) perform annual assessment work beginning with the assessment year ending September 1, 1980; (ii) refrain from permitting any liens or levies to be placed against the 1979 Claims, and timely pay any taxes imposed on the 1979 Claims, each until such time title is conveyed to Silverado; (iii) indemnify the Sellers from any claims arising from Silverado\u0092s operations and conditions on the 1979 Claims arising after the date of possession; and (iv) obtain and maintain adequate insurance., 995226=2007. Each such unit consists of one share of restricted common stock and one half-warrant, with a full warrant (consisting of two half-warrants) being exercisable for a period of one year for the purchase of one share of restricted common stock at a per share exercise price of $0.07., 1102904=CERTIFICATION PURSUANT TO 18 U.S.C. SECTION 1350, AS ADOPTED PURSUANT TO SECTION 906 OF THE SARBANES-OXLEY ACT OF 2002, 888553=The last payments to the above capital lease of $31,013 will be made in fiscal 2008, 1080212=Filed as an exhibit to the Company\u0092s Registration Statement on Form S-8 filed on March 31, 2006., 313473=Effective December 1, 2002, we adopted SFAS 143, Accounting for Asset Retirement Obligations, which addresses financial accounting and reporting for obligations associated with the retirement of tangible long-lived assets and the associated retirement costs. The standard applies to legal obligations associated with the retirement of long-lived assets that result from the acquisition, construction, development and normal use of the asset., 873711=Asset retirement obligations relate to the closure and reclamation of the Grant Mine Tailing Pond, and to the reclamation work associated with the Nolan Gold Project consisting of dismantling and removal of site structures and equipment, and reshaping and revegetating the disturbed areas. The Grant Mine assets were written off as impaired effective December 1, 2001 and an amount of $47,378 was also charged to operations in the year ended November 30, 2003 for the increase in the asset retirement obligations related to those Grant Mine assets. The Company has no assets legally restricted for purposes of settling asset retirement obligations., 6726=The number of shares outstanding of each of the issuer\u0092s classes of common equity, as of the latest practicable date: 926,270,430 common shares, no par value, outstanding as of February 21, 2008., 232990=Annual Alaska state claim rentals are due for each state mining claim that is owned or held by us under a purchase or lease agreement. An annual fee of $130 per claim is payable by us to the Alaska Department of Revenue for each claim. We paid aggregate Alaska state claim rental fees of $15,945 during fiscal 2004, 2005 and fiscal 2006 and $16,770 in fiscal 2007. We anticipate that a similar amount will be paid in fiscal 2008., 28121=In May, June, and July, the Company undertook an extensive geochemical soil sampling campaign on the lower Smith Creek Dome hillside between Archibald Creek and Smith Creek (the \u0093Hillside\u0094), and south of Smith Creek in the lower western part of Midnight Dome. A total of 695 soil samples were collected during the campaign on a 196.85 x 98.43 foot grid. Assay results of the soil sampling campaign show a distinct arsenic and antimony anomalous trend on the eastern part of the Solomon Shear trend. Arsenic anomalies are strong indicators for the presence of gold., 1078640=Filed as an exhibit to the Company\u0092s Annual Report on Form 10-K for the year ended November 30, 1995., 1072071=Change of Control Agreement between the Company and James Dixon dated May, 1995 (6), 27024=During 2007, exploration for a lode gold and antimony deposit on the Company\u0092s Nolan property focused on the Nolan Creek area within the Solomon Shear Zone and the Fortress area. The Solomon Shear Zone is a five mile long gold and antimony bearing shear zone, which is a possible source of placer gold in the Nolan valley drainages, and bench deposits such as Swede Channel, Mary\u0092s East Bench, Mary\u0092s Bench, Eureka Bench, and Workman\u0092s Bench., 93687=During 2008, annual assessment work will be completed on the property to keep the mining claims in good standing. Assessment work will be focused on the northwest part of the claim block, where drilling and trenching has defined an intrusive host rock, thought to be a sill, containing low grade gold, silver and antimony mineralization. If funding permits, the company will design a trenching and drilling program to further investigate the gold and byproduct mineral distribution of the intrusive. Additional work which includes trenching and drilling will also be completed on the Number One Vein. The Number One Vein was the lode quartz gold structure which has been mined commercially for antimony. The drilling will be performed by a drill contractor., 161979=During the winter of 2005, Silverado began an underground exploration and development program on the Swede Channel. Continuing into 2006, Silverado installed about 900 feet of exploration drifts by underground tunneling methods into the Swede Channel. Prior bulk sampling had shown the channel to contain gold in the basal gravels, so the project was designed to obtain a large bulk sample from the tunnel being advanced into the channel. The 2005-2006 winter stockpile contained 8,896 LCY of gravel material, and was processed between June 28th through July 20th of 2006, yielding 939.07 troy ounces of gold nuggets and dust. The Swede portal was re-opened in early November of 2006, and gravel extraction on the remaining sections of the Swede Channel continued until its completion by the middle of January 2007. A total of 8,963 LCY of gravel material was stockpiled from the remaining Swede Channel., 322262=/s/ Berkovits & Company, LLP Fort Lauderdale, Florida February 21, 2008, except for Note 2 which is as of January 20, 2009, 91489=RC placer drilling in 1995 and 2006 identified a channel containing placer gold that extends for a length of over 1,800 feet. The channel, named the Slisco Channel, remains open to the southeast and there is evidence of one or more tributary channels that remain to be explored in the near future. Within the Slisco Channel, the placer gold occurs on bedrock and on a second horizon about 20 feet above the bedrock channel., 112608=Silverado and Gilbert Dobbs (\u0093Dobbs\u0094) entered into an Exploration And Mining Lease (\u0093Dobbs Lease\u0094), dated November 6, 1984, as amended on August 4, 1996, pursuant to which Silverado leased from Dobbs three federal lode mining claims in Fairbanks, Alaska known as the Moose Claim (BLM F061722), the Rosie Claim (BLM F061724), and the Brandy Claim (BLM F061725) (collectively, the \u0093Dobbs Claims\u0094), and all exploration, mining, and water rights associated therewith., 996892=Sold 465.89 troy ounces of gold for proceeds of $372,593 in December 2007., 924918=The following assumptions were used in the Black-Scholes model to calculate the 2006 charge:, 193301=The Bench was first staked by Martin Slisco, and prospected by hand methods since the 1930\u0092s, but no commercial production was recorded. During the late 1970s, placer gold, including some nuggets characteristic of the Koyukuk Mining District were recovered by open cut prospecting and bulk sampling from a prospect pit at the northern end of the bench. The prospect pit was open to bedrock and with a nominal 20 feet of overburden exposed, indications were favourable for defining a large open pit mine-able placer gold deposit. The surface topography indicates the bench could extend up to 4,500 feet southerly from the prospect pit. Beyond that distance the bench is intersected by the present Hammond River Channel where past and ongoing erosion has removed all surface expression of the bench. Below that intersection, the bench has been eroded and during 1995, Silverado completed a Phase I drill program, completing 64 drill holes to the south of the prospect pit. Analysis of the data from the Phase I program determined that the Slisco Bench surface topography conceals an ancient gold bearing channel. Depths of drilling to bedrock were much deeper than anticipated. Several hundred feet south of the prospect pit bedrock depths are about 60 feet below surface, increasing to more than 230 feet in depth at a distance of 1,200 feet south of the prospect pit. The gravel layer at bedrock was found to contain encouraging and sometimes, significant placer gold content at channel bottom intercepts., 758608=Proceeds on gold recoveries from test mining were recorded as a reduction of exploration costs during the period the Company is in the exploration stage. This accounting policy has been changed and now proceeds on gold recoveries from test mining are recorded as other income earned during the exploration stage, retroactively effective from the period since recommencement of exploration stage from December 1, 2001., 20560=The 2006-2007 winter stockpile contained 18,320 LCY (Swede Channel and Mary\u0092s East combined) of gravel material, and was processed from June through July of 2007 at the existing sluice plant location, yielding 2,811.74 troy ounces of gold nugget gold and over 207 pounds of concentrate that contained gold particles smaller than ¼ inch in size. The fine concentrate yielded 915.06 troy ounces of gold (30% gold), which when combined with 2811.74 troy ounces of nugget gold recovered in 2007 totals 3726.80 troy ounces. Also, the fine concentrates yielded 65.10 troy ounces of silver or 2.15% silver., 19893=During the winter of 2006, Silverado re-opened the Swede portal and continued with its underground exploration and development program on the remaining sections of the Swede Channel until its completion by the middle of January 2007. A total of 8,963 loose cubic yards (\u0093LCY\u0094) of gravel material was stockpiled from the remaining Swede Channel., 901024=On January 11, 2007, the Company\u0092s Board of Directors adopted the 2007 Stock Option Plan (the \u00932007 Plan\u0094). The 2007 Plan authorizes the issuance of options to purchase the Company\u0092s common stock to directors, officers, employees, and eligible consultants. The Company reserved 25,000,000 shares of its common stock for awards to be made under the 2007 Plan. The 2007 Plan is to be administered by a committee of two or more members of the Board of Directors. The 2007 Plan allows for the issuance of incentive stock options (which can only be granted to employees) and non-qualified stock options. The committee shall determine the type of option granted, the exercise price, the option term (which may be no more than ten years), and terms and conditions of exercisability., 110995=Title to the 1979 Claims will vest in Silverado upon its payment in full of the purchase price of $2,000,000. The purchase price is payable at 15% of net profits (as such term is defined in the 1979 Agreement) per year, adjusted for inflation, calculated on a quarterly basis, and payable within sixty (60) days of the end of each calendar quarter. Upon full payoff of the purchase price, the Sellers will be entitled to a royalty payment in the form of a carried interest of 3% of net profits from Silverado\u0092s operations until production on the 1979 Claims is permanently terminated., 936757=Tax effects of temporary differences that give rise to deferred tax assets at November 30, 2007 and 2006 are as follows:, 214833=Readers are advised that the information which the Company used to calculate the estimated operating costs for its Ester Dome property is derived from actual operating expenses of the Company for mining and milling in underground and open pit operations at the Grant Mine on Ester Dome in Alaska during the late 1990s. The Company expects to receive during early to mid-2009 an updated version of a December 9, 2004 independent technical report prepared by Mr. Thomas K. Bundtzen of Pacific Rim Geological Consulting, Inc., which will allow the Company to calculate more current estimated operating costs for Ester Dome. Following the Company\u0092s receipt of such updated technical report, the Company will update the information set forth immediately above in its subsequent filings.}",
    "lastModified": "Fri, 23 Jan 2009 11:01:49 GMT",
    "textBeforeTable": "We first began acquiring placer claims on Nolan Creek in 1979. The following table summarizes gold production and gold recoveries by year from the Nolan properties since 1980. Placer mining on Nolan Creek and its tributaries was first recorded at about the turn of the last century. During the ensuing years and up to 1942, recoveries of approximately 120,000 oz. of placer gold were reported. This gold is well known for its coarse size and high fineness. The early miners mined Nolan Creek and its left limit tributaries, particularly Fay, Archibald and Smith creeks by surface methods on the upper areas and by underground methods in the lower reaches of the creeks when overburden became too deep. Shafts are found throughout these areas. 3. History of Operations The Nolan Lode claims are comprised of 407 unpatented federal lode claims. A claim staking program added 242 of these claims during 2006, and 95 more during 2007. Ownership of these federal lode claims is in the name of Silverado Gold Mines Inc. This area encompasses approximately 11 square miles. (b) Nolan Lode 18 Of these claims, the Thomson\u0092s Pup claims consist of 6 unpatented federal placer claims registered in the name of Silverado Green Fuel. Our ownership in these claims is subject to a royalty of 3% of net profits on 80% of production payable to Frank Figlinski and Lyle R.",
    "textAfterTable": "1994 Production Surface Operations Eureka Bench Open Cut 29,300 5,733 0.196 1995 Production Surface Operations Phase 3 Open Cut 22,285 2,394 0.107 1995 Production Underground Operations 3B1 Underground 12,991 1,006 0.077 19 YEAR STATUS OF OPERATIONS NATURE OF OPERATIONS LOCATION BCY MINED Tr.Oz. GOLD RECOVERED",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}