{
    "relation": [
        [
            "Report Parameter",
            "Resource Name",
            "First Name",
            "Last Name",
            "User ID"
        ],
        [
            "Description",
            "Name of the resource",
            "First name of the user",
            "Last name of the user",
            "ID of the user"
        ]
    ],
    "pageTitle": "Using Reporting Features",
    "title": "",
    "url": "http://docs.oracle.com/cd/E27559_01/admin.1112/e27149/workingrep.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 83813927,
    "recordOffset": 83791023,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Mon, 15 Jun 2015 16:41:16 GMT",
    "textBeforeTable": "The following table lists the report input parameters used to specify a criterion for subsetting data: Input Parameters It provides administrators or auditors the ability to view a current snapshot of all the policies defined in Oracle Identity Manager system, along with key information about each policy, and the number of instances in which each policy has been activated. 18.5.1.1 Access Policy Details Access Policy List by Role Access Policy Details Oracle Identity Manager BI Publisher Reports provides the following access policy reports for Oracle Identity Manager: 18.5.1 Access Policy Reports Best Practices for Running Oracle Identity Manager Reports User Reports Resource and Entitlement Reports Password Reports Role and Organization Reports Attestation, Request, and Approval Reports Access Policy Reports Oracle Identity Manager Reports are classified into the following categories based on their functional areas: Oracle Identity Manager Reports are now classified based on the functional areas. For instance, Access Policy Reports, Attestation, Request and Approval Reports, Password Policy Reports, and so on. It is no longer named Operational and Historical. If you want to run the reports for different date range, then please change the date type input parameters with your date ranges.",
    "textAfterTable": "Description Description of the policy Approval Required Approval required for the policy Creation Date Date when the policy is created Retrofit Access Policy Retrofit of the access policy Created By Name of the person who created the policy Priority Priority of the policy Columns The following table lists the columns of the report: Report Column Description Resource Name Name of the resource 18.5.1.2 Access Policy List by Role It lists all policies defined in Oracle Identity Manager system by role. This report can be used for operational and compliance purposes. Input Parameters The following table lists the report input parameters used to specify a criterion for subsetting data:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}