{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is smoke free, so don't worry about killing your lungs unless you are a smoker suffering from nicotine withdrawals (sorry smokers!). There is security on staff and nearby emergency phones in parking lot hanging near selected poles.",
            "I cannot give you any thought to this one at this time.",
            "There's quite a handful to go around. I am a member of the Veteran's club but am currently not active due to military duties and maintaining focus on school.",
            "If you're into pre-med, liberal arts studies, theatrics, or anything abstract and creative, this is very much the school for you before transitioning into a major university, especially if you're on a tight budget.",
            "I can't say I have yet to find anything unusual about the campus as of yet. The one thing I can say is that we have quite a large eclectic group of students and in a very good way. :)",
            "It's very affordable. Though yet again, I definitely recommend pushing the scholarships, Pell Grants, or anything the school offers minus student loans if at all possible. You will thank yourself in the long run.",
            "Rose State is best known for its liberal arts and theatrics programs, so needless to say there's always events going on within these majoring fields from theater to music and creative writing and so much more. They have even established a center for children and adults to spend time honing in on their artistic side too!",
            "I don't eat at the cafeteria and recently things have changed since I last ate there. The food is decent for dorm life but I can't say anything more than that. All I can advise is that people go and try for themselves.",
            "I cannot speak on behalf of the dorm life as I currently live off campus.",
            "Depending on your major, certain classes can be more challenging than others. Maybe not at all. I'm a pre-physical therapy and liberal arts - art option majors. I love to take on a challenge while pursuing an abstract approach to my primary major.",
            "Stay away from student loans as much as possible. There are plenty of options out there for you to take on. I'm a big advocate for scholarships and Pell Grants. The school also has a student workstudy program for anyone interested in working to pay off any loans or school fees. Do not be afraid to approach people for help. Rose State is student friendly and staff members are more than willing to help you out.",
            "Rose State College is what I call student-friendly. Instructors are willing to take the time to assist students in need without fear of reprisal. The school is conveniently located nearby and is a clean smoke free campus."
        ]
    ],
    "pageTitle": "Rose State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rose-State-College/reviews?_escaped_fragment_=/show/9502",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902807887,
    "recordOffset": 902775117,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113218=There is no housing currently provided through Rose State College; however, they are working on adding some housing by 2015., 121757=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "02/22/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 29 Mathew from Mcloud, OK Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "There are many organizations you can be a part of, and they also offer a wonderful wellness center. Food and Dining They are remodeling the cafe to include a coffee shop. They already had wonderful burgers and not it's about to get better! Dorm Life N/A There are very affordable apartments near by Academic Rigor Classes are very personal, your teacher will always know you by name! Tips for prospective students Books are much cheaper at the book store around the corner. In three sentences Rose State is an awesome college for first time students or for the working adult. Most of their classed are offered on the web. They have friendly staff and very helpful advisors. Login to rate or flag the reviews Melissa from Moore, OK 03/11/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 29",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}