{
    "relation": [
        [
            "Exhibits:",
            "3.1",
            "3.2",
            "3.3",
            "10.1",
            "10.2",
            "10.3",
            "10.4",
            "31.1",
            "31.2",
            "32.1",
            "101.INS**",
            "101.SCH**",
            "101.CAL**",
            "101.DEF**",
            "101.LAB**",
            "101.PRE**"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Amended and Restated Certificate of Incorporation (incorporated by reference to Exhibit 3.1 to the Registrant\u0092s Current Report on Form 8-K, filed January 25, 2010).",
            "Third Amended and Restated By-Laws of the Registrant, dated July 28, 2010 (incorporated by reference to Exhibit 3.2 to the Registrant\u0092s Quarterly Report on Form 10-Q, filed July 29, 2010).",
            "First Amendment to Third Amended and Restated By-Laws of the Registrant, dated as of October 4, 2010 (incorporated by reference to Exhibit 3.2 to the Registrant\u0092s Current Report on Form 8-K, filed October 8, 2010).",
            "2012 Short Term Incentive Plan (incorporated by reference to the Registrant\u0092s Current Report on Form 8-K, filed February 22, 2012).*",
            "Executive Retiree Life Insurance Plan (incorporated by reference to Exhibit 10.1 of the Registrant\u0092s Current Report on Form 8-K, filed on April 15, 2012).*",
            "Summary of Compensatory Arrangements of Directors (filed herewith).*",
            "Form of Employee Award Agreement pursuant to the SuperMedia Inc. 2012 Cash Long-Term Incentive Plan (filed herewith).*",
            "Certification of Peter J. McDonald filed pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).",
            "Certification of Samuel D. Jones filed pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith).",
            "Certification of Peter J. McDonald and Samuel D. Jones filed pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (filed herewith).",
            "XBRL Instance Document",
            "XBRL Taxonomy Extension Schema Document",
            "XBRL Taxonomy Calculation Linkbase Document",
            "XBRL Taxonomy Extension Definition Linkbase Document",
            "XBRL Taxonomy Label Linkbase Document",
            "XBRL Taxonomy Presentation Linkbase Document"
        ]
    ],
    "pageTitle": "SUPERMEDIA INC. - FORM 10-Q - May 9, 2012",
    "title": "",
    "url": "http://www.getfilings.com/sec-filings/120509/SUPERMEDIA-INC_10-Q/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 460886043,
    "recordOffset": 460825426,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{620289=Our primary source of funds continues to be cash generated from operations. In the three months ended March 31, 2012, net cash provided by operating activities was $105 million, compared to net cash used in operating activities of $6 million in the three months ended March 31, 2011.  In the three months ended March 31, 2011, we made tax payments of $75 million (including a federal income tax payment of $72 million related to our 2010 income tax obligations), while income tax payments of less than $1 million were made in the three months ended March 31, 2012. The remaining increase in cash from operating activities was due to reduced expenditures, lower interest payments due to our lower debt obligations, and lower severance payments, partially offset by lower cash collections associated with lower revenues., 546160=Three Months Ended March 31, 2012 Compared to Three Months Ended March 31, 2011, 452907=During the three months ended March 31, 2012 and 2011, the Company recorded severance expense of $2 million and $7 million, respectively. For the same periods, the Company paid severance benefits of $2 million and $4 million, respectively., 624643=We believe the net cash provided by our operating activities and existing cash and cash equivalents will provide sufficient resources to meet our working capital requirements, estimated principal and interest debt service requirements and other cash needs for the remainder of 2012., 663776=Maximum Number of Shares That May Yet Be Purchased Under the Plans or Programs, 268529=During the three months ended March 31, 2012, the Company recorded a non-taxable gain of $28 million related to the early extinguishment of a portion of our senior secured term loans at below par.  For additional information related to the Company\u0092s debt obligations, see Note 5., 700614=Pursuant to the requirements of the Securities Exchange Act of 1934, the Registrant has duly caused this report to be signed on its behalf by the undersigned thereunto duly authorized., 629052=There were no material changes to our critical accounting policies and estimates since December 31, 2011. For additional information on critical accounting policies, see \u0093Item 7. Management\u0092s Discussion and Analysis of Financial Condition and Results of Operations\u0094 in Part II of our Annual Report on Form 10-K for the year ended December 31, 2011., 396959=Amortization expense for intangible assets was $34 million and $37 million for the three months ended March 31, 2012 and 2011, respectively.  These amounts include amortization expense related to capitalized internal-use software of $6 million and $9 million for the three months ended March 31, 2012 and 2011, respectively., 353184=The following table sets forth the carrying amount and fair value of the Company\u0092s total debt obligations at March 31, 2012 and December 31, 2011:, 489455=The 2009 Plan provides for grants of stock options. These awards are classified as equity awards based on the criteria established by the applicable accounting rules for stock-based compensation., 461778=Outstanding restricted stock at January 1, 2012, 341349=The following table sets forth certain financial information related to cash payments made by the Company during the three months ended March 31, 2012 and 2011:, 417956=On November 8, 2011, the Company entered into the Second Amendment to the Loan Agreement. The terms of the Second Amendment allow the Company, effective upon the execution of the amendment and until January 1, 2014, to repurchase and retire debt below par, subject to certain requirements., 603578=The following table sets forth a summary of the Company\u0092s cash flows for the three months ended March 31, 2012 and 2011:, 458851=A portion of the cost related to these awards has been included in the Company\u0092s compensation expense for the three months ended March 31, 2012 and March 31, 2011, respectively., 251617=Certain employees and certain non-management directors have been granted restricted stock awards, which entitles those participants to receive non-forfeitable dividends during the vesting period on a basis equivalent to the dividends paid to holders of the Company\u0092s common stock. As such, these unvested restricted stock awards meet the definition of a participating security. Participating securities are defined as unvested share-based payment awards that contain non-forfeitable rights to dividends or dividend equivalents (whether paid or unpaid) and are included in the computation of earnings per share pursuant to the two-class method. At March 31, 2012 and 2011, respectively, there were 372,388 and 386,703 such participating securities outstanding. Under the two-class method, all earnings, whether distributed or undistributed, are allocated to each class of common stock and participating securities based on their respective rights to receive dividends., 489989=During 2010 and 2011, certain employees were granted stock option awards that vest over three years in equal installments of one-third on the first, second, and third anniversaries of the grant date and have a ten year term from the date of grant., 522274=On April 20, 2009, a lawsuit was filed in the district court of Tarrant County, Texas, against certain of the Company\u0092s officers and directors (but not against the Company or its subsidiaries) on behalf of Jack B. Corwin as Trustee of The Jack B. Corwin Revocable Trust, and Charitable Remainder Stewardship Company of Nevada, and as Trustee of the Jack B. Corwin 2006 Charitable Remainder Unitrust (the \u0093Corwin\u0094 case).  The Corwin case generally alleges that at various times in 2008 and 2009, the named Company officers and directors made false and misleading representations, or failed to state material facts, which made their statements misleading regarding the Company\u0092s financial performance and condition.  The suit brings fraud and negligent misrepresentation claims and alleges violations of the Texas Securities Act and Section 27 of the Texas Business Commerce Code.  The plaintiffs seek unspecified compensatory damages, exemplary damages, and reimbursement for litigation expenses.  On June 3, 2009, the plaintiffs filed an amended complaint with the same allegations adding two additional Company directors as party defendants.  On June 10, 2010, the court in the Buettgen case granted the Company\u0092s motion staying discovery in the Corwin case pursuant to the provisions of the Private Securities Litigation Reform Act.  After the adverse decision in the Buettgen case, the parties agreed to a scheduling order consistent with the prior Buettgen stay order.  The Company plans to honor its indemnification obligations and vigorously defend the lawsuit on the defendants\u0092 behalf., 702829=May 9, 2012, 55284=Some statements included in this report constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995 and the federal securities laws. Statements that include the words \u0093may,\u0094 \u0093will,\u0094 \u0093could,\u0094 \u0093should,\u0094 \u0093would,\u0094 \u0093believe,\u0094 \u0093anticipate,\u0094 \u0093forecast,\u0094 \u0093estimate,\u0094 \u0093expect,\u0094 \u0093preliminary,\u0094 \u0093intend,\u0094 \u0093plan,\u0094 \u0093project,\u0094 \u0093outlook\u0094 and similar statements of a future or forward-looking nature identify forward-looking statements. You should not place undue reliance on these statements.  These forward-looking statements include statements that reflect the current views of our senior management with respect to our financial performance and future events with respect to our business and industry in general.  Forward-looking statements address matters that involve risks and uncertainties. Accordingly, there are or will be important factors that could cause our actual results to differ materially from those indicated in these statements. We believe that these factors include, but are not limited to, the risks related to the following:, 542073=We have been experiencing reduced advertising sales and revenue over the past several years driven by reduced advertiser renewals, reflecting continued competition from other advertising media (including the Internet, cable television, newspaper and radio) and a weak economy. For the three months ended March 31, 2012, net advertising sales declined 17.4% compared to the same period in 2011. For the three months ended March 31, 2011, net advertising sales declined 17.3% compared to the same period in 2010. If the factors driving these declines continue, then we will continue to experience declining advertising sales and revenues., 514625=Income taxes for the three months ended March 31, 2012 and 2011 have been included in the accompanying consolidated financial statements on the basis of an estimated annual effective tax rate. In determining the estimated annual effective tax rate, the Company included interest expense and the tax effect of other one-time discrete items. The Company anticipates the effective tax rate, including interest expense and other one-time discrete items, to approximate 29% for 2012 which includes an estimated rate reduction for non-taxable cancellation of indebtedness income (\u0093CODI\u0094) related to the Company\u0092s below par debt repurchases. Generally, the discharge of a debt obligation for an amount less than its adjusted issue price creates CODI, which must be included in the Company\u0092s taxable income; however, provisions of the Internal Revenue Code will allow the Company to permanently exclude this CODI from taxation.  Without this non-taxable CODI, our anticipated effective tax rate would approximate 37% for 2012. Our estimated effective tax rate for 2012 may be subject to changes in future periods. The full year effective tax rate for 2011 was (8.7%) primarily due to the impact of the large non-deductible component of a goodwill impairment charge.  The full year effective tax rate for 2011 was also impacted by the non-taxable CODI generated by a below par debt repurchase in 2011., 646068=pension plans and the Company employee benefits committee (the \u0093EBC\u0094) and pension plans.  All three named plaintiffs are receiving the single life monthly annuity pension benefits. All complain that Verizon transferred them against their will from the Verizon pension plans to the Company pension plans at or near the Company\u0092s spin-off from Verizon.  The complaint alleges that both the Verizon and Company defendants failed to provide requested plan documents, which would entitle the plaintiffs to statutory penalties under the Employee Retirement Income Securities Act (\u0093ERISA\u0094); that both the Verizon and Company defendants breached their fiduciary duty for refusal to disclose pension plan information; and other class action counts aimed solely at the Verizon defendants. The plaintiffs seek class action status, statutory penalties, damages and a reversal of the employee transfers.  The Company defendants filed their motion to dismiss the entire complaint on March 10, 2010.  On October 18, 2010, the Court ruled on the pending motion dismissing all the claims against the Company pension plans and all of the claims against the Company\u0092s EBC relating to the production of documents and statutory penalties for failure to produce same.  The only claims remaining against the Company are procedural ERISA claims against the Company\u0092s EBC.  On November 1, 2010, the Company\u0092s EBC filed its answer to the complaint.  On November 4, 2010, the Company\u0092s EBC filed a motion to dismiss one of the two remaining procedural ERISA claims against the EBC.  Pursuant to an agreed order, the plaintiffs have obtained class certification against the Verizon defendants and discovery has commenced. After obtaining permission from the Court, the Plaintiffs filed another amendment to the complaint, alleging a new count against the Company\u0092s EBC.  The Company\u0092s EBC filed another motion to dismiss the amended complaint and have filed a summary judgment motion before the deadline set by the scheduling order.  On March 26, 2012, the Court denied the Company\u0092s EBC\u0092s motion to dismiss. The parties\u0092 summary judgments remain pending. The Company plans to honor its indemnification obligations and defend the lawsuit on the defendants\u0092 behalf., 402521=At December 31, 2011, 451495=The Company sponsors a defined contribution savings plan to provide opportunities for eligible employees to save for retirement on a tax-deferred basis and non-tax-deferred basis. Substantially all of the Company\u0092s employees are eligible to participate in the plan.  Under the plan, a certain percentage of eligible employee contributions are matched with Company cash allocated to the participants\u0092 current investment elections. The Company recognizes savings plan expenses based on its matching obligation attributable to participating employees.  The Company recorded total savings plan expenses of $1 million and $4 million for the three months ended March 31, 2012 and 2011, respectively., 351803=The Company\u0092s financial assets or liabilities required to be measured at fair value on a recurring basis include cash and cash equivalents held in money market funds.  The Company\u0092s money market funds of $67 million and $66 million as of March 31, 2012 and December 31, 2011, respectively, have been recorded at fair value using Level 2 inputs.  The Company had $6 million held in certificates of deposit (\u0093CD\u0092s\u0094) at March 31, 2012 and December 31, 2011, that serve as collateral against letters of credit held with our insurance carriers.  These CD\u0092s are classified as prepaid expenses and other on the consolidated balance sheets and are valued using Level 2 inputs. The fair value of the Company\u0092s money market funds and CD\u0092s classified as Level 2 are determined based on observable market data.  The fair values of trade receivables and accounts payable approximate their carrying amounts due to their short-term nature. The fair values of debt instruments are determined using Level 2 inputs based on the observable market data of a private exchange., 660353=The following table provides information about shares repurchased from employees during the three months ended March 31, 2012 as payment of withholding taxes in connection with the vesting of restricted stock awarded to employees pursuant to the 2009 Long-Term Incentive Plan:, 415143=On December 31, 2009, the Company emerged from bankruptcy and entered into a loan agreement with certain financial institutions and with JPMorgan Chase Bank, N.A., as administrative agent and collateral agent. On December 13, 2010 and November 8, 2011, the loan agreement was amended (the \u0093Loan Agreement\u0094). Under the Loan Agreement, the senior secured term loans bear interest at an annual rate equal to, at the Company\u0092s option, either (i) the Alternate Base Rate (\u0093ABR\u0094) plus an Applicable Margin, or (ii) adjusted London Inter-Bank Offered Rate (\u0093LIBOR\u0094) plus an Applicable Margin. The Applicable Margin is 7.0% for loans with interest rates determined by reference to ABR and 8.0% for loans with interest rates determined by reference to adjusted LIBOR.  The senior secured term loans have a floor interest rate of 4.0% in the case of ABR and 3.0% in the case of LIBOR.  As long as interest rates remain at or below 4.0% for ABR and 3.0% for LIBOR, which is currently the case, our effective interest rate will be 11.0%., 314205=Accumulated other comprehensive (loss) \u0096 December 31, 2011, 243952=The Company prepares its financial statements in accordance with accounting principles generally accepted in the United States (\u0093U.S. GAAP\u0094).  Pursuant to the rules and regulations of the United States Securities and Exchange Commission (the \u0093SEC\u0094), the accompanying unaudited consolidated financial statements contain all adjustments, consisting of normal recurring items and accruals, necessary to fairly present the financial position, results of operations and cash flows of SuperMedia Inc. and its subsidiaries.  These unaudited interim financial statements do not contain all information and footnote disclosures normally included in financial statements prepared in accordance with U.S. GAAP and, as such, should be read in conjunction with the Company\u0092s Annual Report on Form 10-K for the year ended December 31, 2011.  The results of operations for the three months ended March 31, 2012 are not necessarily indicative of results of operations for the 2012 fiscal year., 19225=Indicate by check mark whether the Registrant has filed all documents and reports required to be filed by Sections 12, 13 or 15(d) of the Securities Exchange Act of 1934 subsequent to the distribution of securities under a plan confirmed by the court. x Yes o No, 7090=Commission File Number: 1-32939, 632253=Our exposures to market risk have not changed materially since December 31, 2011. For quantitative and qualitative disclosures about our market risk, see \u0093Item 7A. Quantitative and Qualitative Disclosures about Market Risks\u0094 in Part II of our Annual Report on Form 10-K for the year ended December 31, 2011., 323124=The following table sets forth additional information on the Company\u0092s accounts payable and accrued liabilities at March 31, 2012 and December 31, 2011:, 246240=In May 2011, the Financial Accounting Standards Board (\u0093FASB\u0094) issued Accounting Standards Update 2011-04 (\u0093ASU 2011-04\u0094), \u0093Amendments to Achieve Common Fair Value Measurement and Disclosure Requirements in U.S. GAAP and IFRSs,\u0094 which amends Accounting Standards Codification 820, \u0093Fair Value Measurement.\u0094 The amended guidance changes the wording used to describe many requirements in U.S. GAAP for measuring fair value and for disclosing information about fair value measurements. Additionally, the amendments clarify the FASB\u0092s intent about the application of existing fair value measurement requirements. The guidance provided in ASU 2011-04 is effective for interim and annual periods beginning after December 15, 2011 and is applied prospectively. The Company has adopted the provisions of ASU 2011-04 as required., 722351=**                                  These exhibits are furnished herewith.  In accordance with Rule 406T of Regulation S-T, these exhibits are not deemed to be filed or part of a registration statement or prospectus for purposes of Section 11 or 12 of the Securities Act of 1933, as amended, are not deemed to be filed for purposes of Section 18 of the Securities Act of 1934 as amended and otherwise are not subject to liability under these sections., 397584=Amortization expense is estimated to be $130 million in 2012, $106 million in 2013, and $101 million in 2014 for the intangible assets as of March 31, 2012., 5166=For the quarterly period ended March 31, 2012, 457989=During 2010, 2011 and 2012, certain non-management directors were granted restricted stock awards that vest one year after the grant date.  All unvested shares of restricted stock will immediately terminate if a non-management director ceases to be a member of the board of directors of the Company on or before the vesting date.  If a change in control occurs on or before the vesting date, all unvested shares of restricted stock will immediately vest.  Grant award recipients would receive all regular cash dividends if the Company were to declare dividends., 419259=The Company has a mandatory debt principal payment due after each fiscal quarter prior to the December 31, 2015 maturity date on the outstanding senior secured term loans in an aggregate amount equal to 67.5% of the amount of any increase in the Company\u0092s Available Cash, as defined in the Loan Agreement.  The Company has the right to make early payments at par on the senior secured term loans in whole or in part, from time to time, without premium or penalty, subject to requirements as to size and manner of payments.  Additionally, the Company can make below par voluntary repurchases of the senior secured term loans, subject to the terms and conditions of the Second Amendment to the Loan Agreement., 242759=We primarily operate as the official publisher in the markets in which Verizon Communications Inc. (\u0093Verizon\u0094) is the incumbent local exchange carrier and in certain markets owned by FairPoint Communications, Inc. (\u0093FairPoint\u0094) and Frontier Communications Corporation (\u0093Frontier\u0094).  We use their brands on our print directories in these and other specified markets. We have a number of agreements with them that govern our publishing relationships, including publishing agreements, branding agreements, and non-competition agreements, each of which has a term expiring in 2036., 599513=Interest expense, net of interest income, of $46 million in the three months ended March 31, 2012 decreased $11 million, or 19.3%, compared to $57 million in the three months ended March 31, 2011 due to lower outstanding debt obligations., 530539=On November 15, 2010, a group of publishers including the Company led by the Local Search Association (formerly the Yellow Pages Association), (the \u0093Publishers\u0094), filed a lawsuit in the U.S. District Court for the Western District of Washington challenging Ordinance 123427 enacted by the City of Seattle requiring the Publishers of yellow pages directories distributed in the City of Seattle to obtain a license from the City, and pay a tax to distribute the directory publications and permitting all the potential recipients of the yellow pages to opt out of receiving the directory using a common City-sanctioned opt out registry, (the \u0093Ordinance\u0094).   The suit challenged the Ordinance as a content-based restriction on speech, violating the first amendment of the U.S. Constitution, and violating the commerce clause of the U.S. Constitution.  On February 10, 2011, the Publishers filed a motion for preliminary injunction seeking to stop the operation of the Ordinance before the first publication of the Dex Seattle directory.  After no order was forthcoming from the Court, the Publishers filed a motion for temporary restraining order with the court seeking to immediately enjoin the operation of the Ordinance.  On May 8, 2011, the court denied both motions.  On May 13, 2011, the Publishers filed a motion with the United States Court of Appeals for the 9th Circuit seeking to enjoin the Ordinance pending the appeal and to expedite an appeal.  On May 24, 2011, the Court of Appeals denied the Publishers\u0092 motion for an injunction, but granted the Motion for an expedited appeal.  After briefing was complete, an oral argument was made in front of a 9th Circuit appellate panel.  Meanwhile, on September 16, 2011, the district court granted the City\u0092s summary judgment motion and denied the Publishers\u0092 summary judgment motion ruling that the Ordinance did not violate the First Amendment. This final order gave the Publishers the opportunity to file a full consolidated appeal to the 9th Circuit, which has been fully briefed and argued.  We await the order of the court., 479052=Outstanding RSUs at January 1, 2012, 597533=Depreciation and Amortization. Depreciation and amortization expense of $40 million in the three months ended March 31, 2012 decreased $4 million, or 9.1%, compared to $44 million in the three months ended March 31, 2011.  This decrease was primarily due to lower amortization expense associated with capitalized internal use software., 687301=2012 Short Term Incentive Plan (incorporated by reference to the Registrant\u0092s Current Report on Form 8-K, filed February 22, 2012).*, 19996=As of May 4, 2012, there were 15,455,994 shares of the Registrant\u0092s common stock outstanding., 66623=The foregoing factors should not be construed as exhaustive and should be read together with the other cautionary statements included in this and other reports we file with the Securities and Exchange Commission (the \u0093SEC\u0094), including the information in \u0093Item 1A. Risk Factors\u0094 in Part I of our Annual Report on Form 10-K for the year ended December 31, 2011. If one or more events related to these or other risks or uncertainties materialize, or if our underlying assumptions prove to be incorrect, actual results may differ materially from what we anticipate. All forward-looking statements included in this report are expressly qualified in their entirety by these cautionary statements.  The forward-looking statements speak only as of the date made and, other than as required by law, we undertake no obligation to publicly update or revise any forward-looking statements, whether as a result of new information, future events or otherwise., 601458=Provision for income taxes of $26 million in the three months ended March 31, 2012 increased $10 million, compared to $16 million in the three months ended March 31, 2011, primarily due to the impact of the items listed above. Our effective tax rates for the three months ended March 31, 2012 and 2011 were 29.5% and 34.8%, respectively. The results for the three months ended March 31, 2012 and 2011, include the effects of one-time discrete items.  We anticipate our effective tax rate, including interest expense and other one-time discrete items, to approximate 29% for 2012 which includes an estimated rate reduction for non-taxable cancellation of indebtedness income (\u0093CODI\u0094) related to the Company\u0092s below par debt repurchases. Generally, the discharge of a debt obligation for an amount less than its adjusted issue price creates CODI, which must be included in the Company\u0092s taxable income; however, provisions of the Internal Revenue Code will allow the Company to permanently exclude this CODI from taxation.  Without this non-taxable CODI, our anticipated effective tax rate would approximate 37% for 2012. Our estimated effective tax rate for 2012 may be subject to changes in future periods. The full year effective tax rate for 2011 was (8.7%), primarily due to the impact of the large non-deductible component of a goodwill impairment charge.  The full year effective tax rate for 2011 was also impacted by the non-taxable CODI generated by a below par debt repurchase in 2011., 600382=The Company recorded a non-taxable gain of $28 million related to the early extinguishment of a portion of our senior secured term loans in the three months ended March 31, 2012.  The Company utilized $31 million in cash to prepay $60 million of the senior secured term loans at a rate of 52% of par.  This transaction resulted in the Company recording a non-taxable gain of $28 million ($29 million gain offset by $1 million in administrative fees)., 623564=During the three months ended March 31, 2012, the Company made cash debt payments of $35 million, which reduced the Company\u0092s debt obligations by $64 million.  On March 2, 2012, the Company utilized $31 million in cash to prepay $60 million of the senior secured term loans at a rate of 52% of par.  This transaction resulted in the Company recording a $28 million non-taxable gain ($29 million gain offset by $1 million in administrative fees), which was recorded as early extinguishment of debt on the Company\u0092s 2012 consolidated statement of comprehensive income. For the three months ended March 31, 2012, the Company also made additional debt principal payments, at par, of $4 million.  The Company may make additional below par debt repurchases during 2012., 73662=2011, 453897=The 2009 Long-Term Incentive Plan (the \u00932009 Plan\u0094) provides for several forms of incentive awards to be granted to designated eligible employees, non-management directors, consultants and independent contractors providing services to the Company. The maximum number of shares of SuperMedia common stock authorized for, 639831=On April 30, 2009, May 21, 2009, and June 5, 2009, three separate putative class action securities lawsuits were filed in the U.S. District Court for the Northern District of Texas, Dallas Division, against certain of the Company\u0092s current and former officers (but not against the Company or its subsidiaries). The suits were filed by Jan Buettgen, John Heffner, and Alan Goldberg as three separate named plaintiffs on behalf of purchasers of the Company\u0092s common stock between August 10, 2007 and March 31, 2009, inclusive. On May 22, 2009, a putative class action securities lawsuit was filed in the U.S. District Court for the Eastern District of Arkansas against two of the Company\u0092s current officers (but not against the Company or its subsidiaries).  The suit was filed by Wade L. Jones on behalf of purchasers of the Company\u0092s bonds between March 27, 2008 and March 30, 2009, inclusive.  On August 18, 2009, the Wade Jones case from Arkansas federal district court was transferred to be consolidated with the cases filed in Texas.  The complaints are virtually identical and generally allege that the defendants violated federal securities laws by issuing false and misleading statements regarding the Company\u0092s financial performance and condition.  Specifically, the complaints allege violations by the defendants of Section 10(b) of the Exchange Act, Rule 10b-5 under the Exchange Act and Section 20 of the Exchange Act.  The plaintiffs are seeking unspecified compensatory damages and reimbursement for litigation expenses.  Since the filing of the complaints, all four cases have been consolidated into one court in the Northern District of Texas and a lead plaintiff and lead plaintiffs\u0092 attorney have been selected (the \u0093Buettgen\u0094 case).  On April 12, 2010, the Company filed a motion to dismiss the entire Buettgen complaint.  On August 11, 2010, in a one line order without an opinion, the Court denied the Company\u0092s motion to dismiss.  On May 19, 2011, the Court granted the plaintiffs\u0092 motion certifying a class.  Subsequently, the Fifth Circuit Court of Appeals denied the Company\u0092s petition for an interlocutory appeal of the class certification order.   Discovery has commenced.  The Company plans to honor its indemnification obligations and vigorously defend the lawsuit on the defendants\u0092 behalf., 487212=Outstanding RSUs at March 31, 2012, 270053=The following table sets forth the components of the Company\u0092s comprehensive income adjustments for pension and post-employment benefits for the three months ended March 31, 2012 and 2011:, 449906=The Company recorded a charge of $4 million in the three months ended March 31, 2012 associated with a nonqualified pension benefit for certain employees.  This charge is not included in the net periodic cost table above, as it represents a prior period adjustment., 4730=QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 533389=On April 26, 2011, the Company received a letter from the Philadelphia Equal Employment Opportunity Commission (\u0093EEOC\u0094) on behalf of a former employee indicating that the EEOC was conducting an investigation for a possible nationwide class claim.  The former employee was terminated after failing to memorize a sales pitch.  The EEOC alleges that the Company may have systematically discriminated against older employees and employees with disabilities by requiring them to memorize a sales pitch.  The Company is cooperating with the agency and has provided the agency with responsive documents requested in the EEOC\u0092s original request., 249402=In September 2011, the FASB issued Accounting Standards Update 2011-08 (\u0093ASU 2011-08\u0094), \u0093Testing Goodwill for Impairment,\u0094 which amends Accounting Standards Codification 350, \u0093Intangibles \u0097 Goodwill and Other\u0094 (\u0093ASC 350\u0094).  The amended guidance permits an entity to first assess qualitative factors to determine whether it is more likely than not that the fair value of a reporting unit is less than its carrying amount as a basis for determining whether it is necessary to perform the two-step goodwill impairment test described in ASC 350. The guidance provided in ASU 2011-08 is effective for interim and annual periods beginning after December 15, 2011. The Company has adopted the provisions of ASU 2011-08 as required., 498090=Outstanding stock option awards at January 1, 2012, 633971=Under the supervision and with the participation of our management, including our chief executive officer and chief financial officer, we have evaluated the effectiveness of our disclosure controls and procedures (as defined in Rules 13a-15(e) and 15d-15(e) promulgated under the Securities Exchange Act of 1934, as amended) as of the end of the period covered by this report. Based on that evaluation, our chief executive officer and chief financial officer concluded that our disclosure controls and procedures were effective as of the end of the period covered by this report to provide reasonable assurance that information we are required to disclose in reports that are filed or submitted under the Exchange Act is recorded, processed, summarized and reported within the time periods specified in the rules and forms specified by the Securities and Exchange Commission. We note that the design of any system of controls is based in part upon certain assumptions about the likelihood of future events, and there can be no assurance that any design will succeed in achieving the stated goals under all potential future conditions., 528699=to recover alleged losses to the various savings plans that were allegedly caused by the breach of fiduciary duties in violation of ERISA by the defendants in administrating the plans from November 17, 2006 to March 31, 2009.  The complaint alleges that: (i) the defendants wrongfully allowed all the plans to invest in Idearc common stock, (ii) the defendants made material misrepresentations regarding the Company\u0092s financial performance and condition, (iii) the defendants had divided loyalties, (iv) the defendants mismanaged the plan assets, and (v) certain defendants breached their duty to monitor and inform the EBC of required disclosures.  The plaintiffs are seeking unspecified compensatory damages and reimbursement for litigation expenses.  At this time, a class has not been certified.  The plaintiffs have filed a consolidated complaint.  The Company filed a motion to dismiss the entire complaint on June 22, 2010.  On March 16, 2011, the Court granted the Company defendants\u0092 motion to dismiss the entire complaint; however, the plaintiffs have repleaded their complaint.  The Company defendants have filed another motion to dismiss the new complaint. On March 15, 2012, the court granted the Company defendants\u0092 second motion dismissing the case with prejudice.  The plaintiffs have filed a notice of their intent to appeal the dismissal.  The Company plans to honor its indemnification obligations and vigorously defend the lawsuit on the defendants\u0092 behalf., 420267=During the three months ended March 31, 2012, the Company made cash debt payments of $35 million, which reduced the Company\u0092s debt obligations by $64 million.  On March 2, 2012, the Company utilized $31 million in cash to prepay $60 million of the senior secured term loans at a rate of 52% of par.  This transaction resulted in the Company recording a $28 million non-taxable gain ($29 million gain offset by $1 million in administrative fees), which was recorded as early extinguishment of debt on the Company\u0092s 2012 consolidated statement of comprehensive income. For the three months ended March 31, 2012, the Company also made additional debt principal payments, at par, of $4 million., 456851=During 2010 and 2012, certain employees were granted restricted stock awards that vest over three years in equal installments on the first, second, and third anniversaries of the grant date.  All unvested shares of restricted stock will immediately terminate upon the employee\u0092s termination of employment with the Company for any reason on or before the third anniversary date of the award, except that the Compensation Committee of the Board of Directors, at its sole option and election, may permit the unvested shares not to terminate if the employee is terminated without cause.  If a change in control occurs on or before the third anniversary of the grant date, all unvested shares of restricted stock will immediately vest.  Grant award recipients would receive all regular cash dividends if the Company were to declare dividends., 513041=The compensation expense recognized for the three months ended March 31, 2012 and 2011, related to stock-based compensation was $1 million in each period.  These costs were recorded as part of general and administrative expenses on the consolidated statements of comprehensive income., 354435=At March 31, 2012, 534332=On July 1, 2011, several former employees filed a Fair Labor Standards Act (\u0093FLSA\u0094) collective action against the Company, all its subsidiaries, the current chief executive officer and the former chief executive officer in the US District Court, Northern District of Texas, Dallas Division.  The complaint alleges that the Company improperly calculated the rate of pay when it paid overtime to its hourly sales employees.  On July 29, 2011, the Company filed a motion to dismiss the complaint.  In response, the plaintiffs amended their complaint to allege that the individual defendants had \u0093off-the-clock\u0094 claims for unpaid overtime.  Subsequently, the Company amended its motion to dismiss in light of the new allegations.  On October 25, 2011, the Plaintiffs filed a motion to conditionally certify a collective action and to issue notice.  On March 29, 2012, the Court denied the Company\u0092s motion to dismiss and granted the plaintiffs\u0092 motion to conditionally certify the class.  The Company has filed a motion seeking permission to file an interlocutory appeal of the order., 450467=The Company recorded a pension settlement loss of $2 million for the three months ended March 31, 2011 related to employees that received lump-sum distributions. These charges were recorded in accordance with applicable accounting guidance for settlements associated with defined benefit pension plans, which requires that settlement gains and losses be recorded once prescribed payment thresholds have been reached., 177558=Common stock ($.01 par value; 60 million shares authorized, 15,662,203 and 15,468,740 shares issued and outstanding in 2012 and 2011, respectively), 247385=In June 2011, the FASB issued Accounting Standards Update 2011-05 (\u0093ASU 2011-05\u0094), \u0093Presentation of Comprehensive Income,\u0094 which amends Accounting Standards Codification 220, \u0093Comprehensive Income.\u0094 The amended guidance eliminates the option to present components of other comprehensive income as part of the statement of changes in stockholders\u0092 equity and requires that all nonowner changes in stockholders\u0092 equity be presented either in a single continuous statement of comprehensive income or in two separate but consecutive statements. The guidance provided in ASU 2011-05 is effective for interim and annual periods beginning after December 15, 2011 and is applied retrospectively. The Company has adopted the provisions of ASU 2011-05 as required., 365527=The following table sets forth the details of the Company\u0092s intangible assets as of March 31, 2012 and December 31, 2011:, 543005=Advertising sales for the three months ended March 31, 2011 include negative adjustments of $9 million related to the financial distress and operational wind down of a single certified marketing representative in our third-party national sales channel.  Excluding this impact, advertising sales for the three months ended March 31, 2012 would have reflected a decline of 19.3%, compared to a decline of 15.4% for the three months ended March 31, 2011.  As of June 2011, these accounts have been transitioned to other certified marketing representative firms., 424351=The following table sets forth the benefit costs (income) related to the Company\u0092s pension and post-employment health care and life insurance plans for the three months ended March 31, 2012 and 2011:, 698122=**                                                                  These exhibits are furnished herewith.  In accordance with Rule 406T of Regulation S-T, these exhibits are not deemed to be filed or part of a registration statement or prospectus for purposes of Section 11 or 12 of the Securities Act of 1933, as amended, are not deemed to be filed for purposes of Section 18 of the Securities Act of 1934 as amended and otherwise are not subject to liability under these sections., 520131=securities lawsuit was filed in the U.S. District Court for the Eastern District of Arkansas against two of the Company\u0092s current officers (but not against the Company or its subsidiaries).  The suit was filed by Wade L. Jones on behalf of purchasers of the Company\u0092s bonds between March 27, 2008 and March 30, 2009, inclusive.  On August 18, 2009, the Wade Jones case from Arkansas federal district court was transferred to be consolidated with the cases filed in Texas.  The complaints are virtually identical and generally allege that the defendants violated federal securities laws by issuing false and misleading statements regarding the Company\u0092s financial performance and condition.  Specifically, the complaints allege violations by the defendants of Section 10(b) of the Exchange Act, Rule 10b-5 under the Exchange Act and Section 20 of the Exchange Act.  The plaintiffs are seeking unspecified compensatory damages and reimbursement for litigation expenses.  Since the filing of the complaints, all four cases have been consolidated into one court in the Northern District of Texas and a lead plaintiff and lead plaintiffs\u0092 attorney have been selected (the \u0093Buettgen\u0094 case).  On April 12, 2010, the Company filed a motion to dismiss the entire Buettgen complaint.  On August 11, 2010, in a one line order without an opinion, the Court denied the Company\u0092s motion to dismiss.  On May 19, 2011, the Court granted the plaintiffs\u0092 motion certifying a class.  Subsequently, the Fifth Circuit Court of Appeals denied the Company\u0092s petition for an interlocutory appeal of the class certification order.   Discovery has commenced.  The Company plans to honor its indemnification obligations and vigorously defend the lawsuit on the defendants\u0092 behalf., 679534=As previously announced on Form 8-K, filed with the SEC on February 22, 2012, on February 15, 2012, the Compensation Committee (the \u0093Committee\u0094) of the Board of Directors of the Company established the performance objectives and other terms of the Company\u0092s 2012 Cash Long-Term Incentive Plan (the \u00932012 Cash LTI Plan\u0094) pursuant to the Company\u0092s 2009 Long Term Incentive Plan. The 2012 Cash LTI Plan provides for a payment of incentive compensation to each of the Company\u0092s executive officers and to other eligible employees.  Awards made pursuant to the 2012 Cash LTI Plan are evidenced by, and are subject to the terms and provisions of, the 2012 Cash LTI Plan award agreements, a form of which was approved by the Committee on May 4, 2012., 470851=The 2009 Plan provides for grants of restricted stock units (\u0093RSUs\u0094) that can be settled in cash, shares of SuperMedia common stock or a combination thereof. These awards are classified as either liability or equity awards based on the criteria established by the applicable accounting rules for stock-based compensation., 524250=On November 25, 2009, three former Bell retirees brought a putative class action lawsuit in the U.S. District Court for the Northern District of Texas, Dallas Division, against both the Verizon employee benefits committee and pension plans and the Company employee benefits committee (the \u0093EBC\u0094) and pension plans.  All three named plaintiffs are receiving the single life monthly annuity pension benefits. All complain that Verizon transferred them against their will from the Verizon pension plans to the Company pension plans at or near the Company\u0092s spin-off from Verizon.  The complaint alleges that both the Verizon and Company defendants failed to provide requested plan documents, which would entitle the plaintiffs to statutory penalties under the Employee Retirement Income Securities Act (\u0093ERISA\u0094); that both the Verizon and Company defendants breached their fiduciary duty for refusal to disclose pension plan information; and other class action counts aimed solely at the Verizon defendants. The plaintiffs seek class action status, statutory penalties, damages and a reversal of the employee transfers.  The Company defendants filed their motion to dismiss the entire complaint on March 10, 2010.  On October 18, 2010, the Court ruled on the pending motion dismissing all the claims against the Company pension plans and all of the claims against the Company\u0092s EBC relating to the production of documents and statutory penalties for failure to produce same.  The only claims remaining against the Company are procedural ERISA claims against the Company\u0092s EBC.  On November 1, 2010, the Company\u0092s EBC filed its answer to the complaint.  On November 4, 2010, the Company\u0092s EBC filed a motion to dismiss one of the two remaining procedural ERISA claims against the EBC.  Pursuant to an agreed order, the plaintiffs have obtained class certification against the Verizon defendants and discovery has commenced. After obtaining permission from the Court, the Plaintiffs filed another amendment to the complaint, alleging a new count against the Company\u0092s EBC.  The Company\u0092s EBC filed another motion to dismiss the amended complaint and have filed a summary judgment motion before the deadline set by the scheduling order.  On March 26, 2012, the Court denied the Company\u0092s EBC\u0092s motion to dismiss. The parties\u0092 summary judgments remain pending. The Company plans to honor its indemnification obligations and defend the lawsuit on the defendants\u0092 behalf., 455450=issuance under the 2009 Plan is 1,500,000. During 2010, 2011, and 2012, the Company granted equity awards under the 2009 Plan to certain employees and to certain of our non-management directors., 539806=The Company prepares its financial statements in accordance with accounting principles generally accepted in the United States (\u0093U.S. GAAP\u0094).  Pursuant to the rules and regulations of the United States Securities and Exchange Commission (the \u0093SEC\u0094), the accompanying unaudited consolidated financial statements contain all adjustments, consisting of normal recurring items and accruals, necessary to fairly present the financial position, results of operations and cash flows of SuperMedia Inc. and its subsidiaries.  These unaudited interim financial statements do not contain all information and footnote disclosures normally included in financial statements prepared in accordance with U.S. GAAP and, as such, should be read in conjunction with the Company\u0092s Annual Report on Form 10-K for the year ended December 31, 2011.  The results of operations for the three months ended March 31, 2012 are not necessarily indicative of results of operations for the entire 2012 fiscal year., 689763=Form of Employee Award Agreement pursuant to the SuperMedia Inc. 2012 Cash Long-Term Incentive Plan (filed herewith).*, 471463=During 2010, certain non-management directors were granted RSU awards that vest over three years in equal installments of one-third on the first, second, and third anniversaries of the grant date. If a director ceases to be a member of the board of directors of the Company on or before the third anniversary date of the award, the RSUs will vest on a prorated basis by dividing the number of days commencing on the anniversary vesting date or date of award, as applicable, and ending on the date of separation from service by, (i) 1,095 days if the date of separation from service occurs prior to the first anniversary date of the award, (ii) 730 days if the date of separation from service occurs after the first anniversary date of the award but before the second anniversary date of the award, and (iii) 365 days if the date of separation from service occurs after the second anniversary date of the award but before the third anniversary date of the award, and the number of RSUs remaining will immediately terminate. If a change in control occurs on or before the third anniversary date of the award, all unvested shares of restricted stock units will immediately vest.  The restricted stock units settle upon a director\u0092s departure from the board in good standing., 13449=Indicate by check mark whether the Registrant: (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes x No o, 692208=Certification of Peter J. McDonald and Samuel D. Jones filed pursuant to 18 U.S.C. Section 1350, as adopted pursuant to Section 906 of the Sarbanes-Oxley Act of 2002 (filed herewith)., 621418=Cash used in investing activities of $2 million during the three months ended March 31, 2012 decreased $1 million compared to $3 million during the three months ended March 31, 2011, primarily due to reduced capitalized internal use software expenditures., 691395=Certification of Samuel D. Jones filed pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith)., 473040=During 2011, certain employees were granted RSU awards that vest over three years in equal installments of one-third on the first, second, and third anniversaries of the grant date. All unvested RSUs will immediately terminate upon the employee\u0092s termination of employment with the Company for any reason on or before the third, 644564=On November 25, 2009, three former Bell retirees brought a putative class action lawsuit in the U.S. District Court for the Northern District of Texas, Dallas Division, against both the Verizon employee benefits committee and, 658083=There are numerous factors that affect our business and results of operations, many of which are beyond our control.  In addition to other information set forth in this Quarterly Report on Form 10-Q, you should carefully read and consider \u0093Item 1A. Risk Factors\u0094 in Part I, and \u0093Item 7.  Management\u0092s Discussion and Analysis of Financial Condition and Results of Operation\u0094 in Part II of our Annual Report on Form 10-K for the year ended December 31, 2011, which contain a description of significant factors that might cause the actual results of operations in future periods to differ materially from those currently expected or desired. The risks described in our Annual Report on Form 10-K for the year ended December 31, 2011 are not the only risks facing our Company. Additional risks and uncertainties not currently known to us or currently deemed immaterial based on management\u0092s assessment of currently available information, which remains subject to change, also may materially adversely affect our business, financial condition, operating results or cash flow., 546548=The following table sets forth our consolidated operating results for the three months ended March 31, 2012 and 2011:, 518298=On April 30, 2009, May 21, 2009, and June 5, 2009, three separate putative class action securities lawsuits were filed in the U.S. District Court for the Northern District of Texas, Dallas Division, against certain of the Company\u0092s current and former officers (but not against the Company or its subsidiaries). The suits were filed by Jan Buettgen, John Heffner, and Alan Goldberg as three separate named plaintiffs on behalf of purchasers of the Company\u0092s common stock between August 10, 2007 and March 31, 2009, inclusive. On May 22, 2009, a putative class action, 690580=Certification of Peter J. McDonald filed pursuant to Section 302 of the Sarbanes-Oxley Act of 2002 (filed herewith)., 685472=Third Amended and Restated By-Laws of the Registrant, dated July 28, 2010 (incorporated by reference to Exhibit 3.2 to the Registrant\u0092s Quarterly Report on Form 10-Q, filed July 29, 2010)., 456227=The 2009 Plan provides for grants of restricted stock.  These awards are classified as equity awards based on the criteria established by the applicable accounting rules for stock-based compensation. The fair value of the restricted stock awards was determined based on the price of SuperMedia common stock on the date of grant., 594283=Operating expense of $257 million in the three months ended March 31, 2012 decreased $78 million, or 23.3%, compared to $335 million in the three months ended March 31, 2011, for the reasons described below., 648647=On December 10, 2009, a former employee with a history of litigation against the Company filed a putative class action lawsuit in the U.S. District Court for the Northern District of Texas, Dallas Division, against certain of the Company\u0092s current and former officers, directors and members of the Company\u0092s EBC.  The complaint attempts to recover alleged losses to the various savings plans that were allegedly caused by the breach of fiduciary duties in violation of ERISA by the defendants in administrating the plans from November 17, 2006 to March 31, 2009.  The complaint alleges that: (i) the defendants wrongfully allowed all the plans to invest in Idearc common stock, (ii) the defendants made material misrepresentations regarding the Company\u0092s financial performance and condition, (iii) the defendants had divided loyalties, (iv) the defendants mismanaged the plan assets, and (v) certain defendants breached their duty to monitor and inform the EBC of required disclosures.  The plaintiffs are seeking unspecified compensatory damages and reimbursement for litigation expenses.  At this time, a class has not been certified.  The plaintiffs have filed a consolidated complaint.  The Company filed a motion to dismiss the entire complaint on June 22, 2010.  On March 16, 2011, the Court granted the Company defendants\u0092 motion to dismiss the entire complaint; however, the plaintiffs have repleaded their complaint.  The Company defendants have filed another motion to dismiss the new complaint. On March 15, 2012, the court granted the Company defendants\u0092 second motion dismissing the case with prejudice.  The plaintiffs have filed a notice of their intent to appeal the dismissal.  The Company plans to honor its indemnification obligations and vigorously defend the lawsuit on the defendants\u0092 behalf., 650852=On November 15, 2010, a group of publishers including the Company led by the Local Search Association (formerly the Yellow Pages Association), (the \u0093Publishers\u0094), filed a lawsuit in the U.S. District Court for the Western District of Washington challenging Ordinance 123427 enacted by the City of Seattle requiring the Publishers of yellow pages directories distributed in the City of Seattle to obtain a license from the City, and pay a tax to distribute the directory publications and permitting all the potential recipients of the yellow pages to opt out of receiving the directory using a common City-sanctioned opt out registry, (the \u0093Ordinance\u0094).   The suit challenged the Ordinance as a content-based restriction on speech, violating the first amendment of the U.S. Constitution, and violating the commerce clause of the U.S. Constitution.  On February 10, 2011, the Publishers filed a motion for preliminary injunction seeking to stop the operation of the Ordinance before the first publication of the Dex Seattle directory.  After no order was forthcoming from the Court, the Publishers filed a motion for temporary restraining order with the court seeking to immediately enjoin the operation of the Ordinance.  On May 8, 2011, the court denied both motions.  On May 13, 2011, the Publishers filed a motion with the United States Court of Appeals for the 9th Circuit seeking to enjoin the Ordinance pending the appeal and to expedite an appeal.  On May 24, 2011, the Court of Appeals denied the Publishers\u0092 motion for an injunction, but granted the Motion for an expedited appeal.  After briefing was complete, an oral argument was made in front of a 9th Circuit appellate panel.  Meanwhile, on September 16, 2011, the district court granted the City\u0092s summary judgment motion and denied the Publishers\u0092 summary judgment motion ruling that the Ordinance did not violate the First Amendment. This final order gave the, 680587=The 2012 Cash LTI Plan comprises a two-year performance period, with each of fiscal years 2012 and 2013 representing one measurement period. The executive\u0092s incentive opportunity for each of 2012 and 2013 will be equal to 50% of the total target incentive opportunity. If, at the end of each measurement period, the Company\u0092s performance against the specified performance metrics results in an award to any participating executive officer, the payment of such award amount shall be deferred until the first calendar quarter of 2014. Following a change in control of the Company, awards made under this plan would be paid out at the maximum award level six months after the change in control, contingent on the participants\u0092 continued employment with the Company (subject to certain exceptions)., 622920=Net cash used in financing activities of $36 million during the three months ended March 31, 2012 primarily represents the repayment of debt principal. The Company did not generate positive cash flow for the three months ended March 31, 2011, as defined in the Loan Agreement and, therefore, no debt principal payments were made during that period., 681667=The foregoing summary is qualified in its entirety by reference to the text of the form of the 2012 Cash LTI Plan award agreement, a copy of which is included as Exhibit 10.4 to this Quarterly Report on Form 10-Q.  Such exhibit is incorporated herein by reference., 355064=At December 31, 2011, 509031=Outstanding stock option awards at March 31, 2012, 250885=Basic earnings per share are computed by dividing net income available to common stockholders by the number of weighted-average common shares outstanding during the reporting period. Diluted earnings per share are calculated to give effect to all potentially dilutive common shares that were outstanding during the reporting period. The effect of potentially dilutive common shares for the three months ended March 31, 2012 was not material., 527078=On December 10, 2009, a former employee with a history of litigation against the Company filed a putative class action lawsuit in the U.S. District Court for the Northern District of Texas, Dallas Division, against certain of the Company\u0092s current and former officers, directors and members of the Company\u0092s EBC.  The complaint attempts, 596209=General and Administrative. General and administrative expense of $41 million in the three months ended March 31, 2012 decreased $24 million, or 36.9%, compared to $65 million in the three months ended March 31, 2011.  The decrease was primarily due to lower bad debt expense, reduced employee related costs, lower severance costs, lower contract services costs and settlement losses recorded in 2011 associated with our pension plans.  These decreases were partially offset by a charge of $4 million associated with a nonqualified pension benefit for certain employees.  Bad debt expense of $6 million in the three months ended March 31, 2012 decreased by $11 million, or 64.7%, compared to $17 million in the three months ended March 31, 2011.  Bad debt expense as a percent of total operating revenue was 1.7% for the three months ended March 31, 2012, compared to 3.9% for the three months ended March 31, 2011., 401891=At March 31, 2012, 593287=Operating revenue of $363 million in the three months ended March 31, 2012 decreased $75 million, or 17.1%, compared to $438 million in the three months ended March 31, 2011. This decrease was primarily due to reduced advertiser renewals, reflecting continued competition from other advertising media (including the Internet, cable television, newspaper and radio) and a weak economy., 418869=As of March 31, 2012, the Company is in compliance with all of the covenants of its Loan Agreement., 319225=Accumulated other comprehensive (loss) \u0096 March 31, 2012, 595507=Cost of Sales. Cost of sales expense of $86 million in the three months ended March 31, 2012 decreased $24 million, or 21.8%, compared to $110 million in the three months ended March 31, 2011. This decrease was primarily due to lower printing and distribution costs, reduced Internet traffic costs and reduced employee related costs., 513621=As of March 31, 2012, unrecognized compensation expense related to the unvested portion of the Company\u0092s restricted stock and restricted stock unit awards was approximately $5 million and is expected to be recognized over a weighted-average period of approximately 1.4 years., 6077=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 686373=First Amendment to Third Amended and Restated By-Laws of the Registrant, dated as of October 4, 2010 (incorporated by reference to Exhibit 3.2 to the Registrant\u0092s Current Report on Form 8-K, filed October 8, 2010)., 399422=The following table sets forth the Company\u0092s outstanding debt obligations on the consolidated balance sheets at March 31, 2012 and December 31, 2011:, 594786=Selling. Selling expense of $90 million in the three months ended March 31, 2012 decreased $26 million, or 22.4%, compared to $116 million in the three months ended March 31, 2011. This decrease resulted primarily from lower employee related costs, lower sales commissions and reduced advertising costs associated with our national advertising program., 468363=Outstanding restricted stock at March 31, 2012, 417479=On December 13, 2010, the Company entered into the First Amendment to the Loan Agreement. The terms of the First Amendment allowed a one-time repurchase and retirement of debt below par., 72960=2012, 406469=2015, 252875=The following table sets forth the calculation of the Company\u0092s basic and diluted earnings per share for the three months ended March 31, 2012 and 2011:}",
    "textBeforeTable": "  (Mark One)     FORM 10-Q     Washington, DC 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES       Table of Contents a12-7728_1ex10d3.htm EX-10.3 - EX-10.3 - SUPERMEDIA INC. a12-7728_1ex31d1.htm EX-31.1 - EX-31.1 - SUPERMEDIA INC. a12-7728_1ex32d1.htm EX-32.1 - EX-32.1 - SUPERMEDIA INC. a12-7728_1ex10d4.htm EX-10.4 - EX-10.4 - SUPERMEDIA INC. a12-7728_1ex31d2.htm EX-31.2 - EX-31.2 - SUPERMEDIA INC. Financial_Report.xls EXCEL -",
    "textAfterTable": "      Non-accelerated filer o   Smaller reporting company o   Indicate by check mark whether the Registrant is a shell company (as defined in Rule 12b-2 of the Exchange Act). Yes o No x   Indicate by check mark whether the Registrant has filed all documents and reports required to be filed by Sections 12, 13 or 15(d) of the Securities Exchange Act of 1934 subsequent to the distribution of securities under a plan confirmed by the court. x Yes o No",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}