{
    "relation": [
        [
            "Silver Mountain",
            "101 135\"",
            "",
            "103 145\"",
            "97 70\"",
            "92 118\"",
            "128 178\"",
            "132 117\"",
            "118 139\"",
            "97 80\"",
            "136 85\"",
            "101 111\"",
            "90 209\""
        ],
        [
            "",
            "Days open in 2011/2012 Season Maximum snow depth at summit",
            "",
            "Days open in 2010/2011 Season Maximum snow depth at summit",
            "Days Open in 2009/2010 season Maximum snow depth at summit",
            "Days Open in 2008/2009 season Maximum snow depth at summit",
            "Days Open in 2007/2008 season Maximum snow depth at summit",
            "Days Open in 2006/2007 season Maximum snow depth at summit",
            "Days Open in 2005/2006 season Maximum snow depth at summit",
            "Days Open in 2004/2005 season Maximum snow depth at summit",
            "Days Open in 2003/2004 season Maximum snow depth at summit",
            "Days Open in 2002/2003 season Maximum snow depth at summit",
            "Days Open in 2001/2002 season Maximum snow depth at summit"
        ],
        [
            "Lookout Pass",
            "113 176\"",
            "",
            "112 192\"",
            "111 90\"",
            "93 144\"",
            "98 197\"",
            "106 163\"",
            "111 168\"",
            "83 85\"",
            "104 119\"",
            "69 130\"",
            "80 225\""
        ]
    ],
    "pageTitle": "2012/2013 Ski Area Snowfall Log for the Silver Valley in northern Idaho",
    "title": "",
    "url": "http://wallace-id.com/ski_season12.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00162-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 251455119,
    "recordOffset": 251400688,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{81762=Since Martin Luther King, Jr.'s birthday (January 15, 1929) is observed each year on the following Monday, the relative snow levels on this holiday could be called a \"fuzzy\" benchmark. It is clear from the graph and the chart that this winter is very similar to last year and slightly below the 1971-2000 average snow water equivalent. In fact, the snow levels at Silver Mountain are identical to those seen on last year's MLK holiday, while Lookout Pass has a foot and a half more coverage at the Lodge, and almost FOUR FEET more snow on the summit of Runt Mountain. Of course, most of our yearly snow is yet to arrive and remember, last year Silver Mountain ended up with a phenomenal season finale on May 13. The weather guessers say that our current spring weather is about to end with snowfall predicted for tomorrow. We'll see., 123787=Unlike the rest of the country, mellow weather patterns this winter have produced mild temperature fluctuations from day to day. Early morning temperatures were in the 20's about 75% of the time, and only ranged from 32° to 10° at Lookout Pass. However, in contrast with last year, snowfall fluctuation was also moderate with almost all overnight snowfalls under half a foot. By this time last season, Lookout Pass had recorded overnight snowfalls greater than half a foot on ten days. On the basis of summit accumulations, this season lags behind most previous seasons, yet as this commentary shows, the skiing and riding has never been better. Today's graph of the Snow Water Equivalent (SWE) measured at Lookout Pass Ski Area by Idaho's Natural Resources Conservation Service as part of their Idaho Snow Survey Program, shows that while we are below the 1971-2000 SWE average, we are about normal for total precipitation. Currently the Silver Mountain accumulation is most similar to that on Presidents Day 2009... but look what happened ten days later!., 181075=Mid-winter weather in mid-April! Half-inch/hour snowfall, punctuated with sudden sun breaks, made for one of the best powder days of the season. The shot from the lift at 8:59 shows how the day started. Powder day rules meant that Del and Jim started with three runs on the North Side, while I ran immediately into the Rainbow Woods. The furious horizonal snowfall at the top of Rainbow Ridge became pleasant vertical snowfall in the forest. The fresh dry powder on top of the firm, aged and smooth six-foot-plus base created a turn-on-a-dime experience, where speed was not damped by caution. I never felt a crust under my skis, only a consistent distant firmness. When I entered the woods for a third time, I noticed the tracks of a snowboarder and skier traveling together, and knew that the rest of my posse had worn themselves out on Hercules, Red Dog and Marmot, and were now traveling in my neighborhood. We met up for my fifth and their sixth run. Although both Chairs #2 and #3 both serve 1100 vertical feet of terrain, Chair #2 is much slower, and its runs less quick. After cruising through the Cloud Nine trees and over the healed Keystone steeps, we tackled the DEEP snow in the Lucky Friday and Last Chance Glades. To my delight and surprise, I found that I was able to connect fall-line turns through knee-deep untracked powder... twice. After coffee in the Loft, we returned to Chair #3, where previously Del had conquered Hercules with powder face-shots on almost every turn. However, this time, he suffered a thigh cramp that sat him down. For my part, I had to stop on Marmot twice from sheer exhaustion. The skier-chop was not that difficult, there was just a lot of it. Del and Jim called it a day, but I met up with Sandpointers Troy and his wife Becky and made another couple of runs with them, giving me a total of twelve runs for a season finale., 192224=This Snow Water Equivalent Graph was downloaded on April 28, 2013, and shows that in many respects this season is similar to the previous one, in that the total precipitations measured in both years are equal, and just slightly below the the average measured from 1971-2000. Another similarity is the mild season experienced at both resorts during both seasons. Both seasons avoided single digit temperatures during operating hours, in contrast to the eight single digit days recorded in the 2010/2011 season. This season the mild weather effected snow depths at Silver Mountain more than Lookout Pass, which maintained more than 100 inches at the summit from January 9 on. However, the most distinct difference between the last two seasons is the amount of snow that fell during March: more than a Snow Water Equivalent (SWE) foot., 184184=COST ANALYSIS: Assuming equal use of the three chairs to make 397 runs on 44 days, each run dropped me an average of 1017 vertical feet, for a total of 76.4 vertical miles this season! It cost me $306.34 for my season pass and locker (6% Idaho tax included), so it works out to $4.01 per vertical mile. Without the locker, it would have been only $2.20/vertical mile, but having a locker at a ski area is a welcome luxury. So... how much did you have to spend this year to ski a vertical mile?}",
    "textBeforeTable": "  Amazon.com Widgets This Snow Water Equivalent Graph was downloaded on April 28, 2013, and shows that in many respects this season is similar to the previous one, in that the total precipitations measured in both years are equal, and just slightly below the the average measured from 1971-2000. Another similarity is the mild season experienced at both resorts during both seasons. Both seasons avoided single digit temperatures during operating hours, in contrast to the eight single digit days recorded in the 2010/2011 season. This season the mild weather effected snow depths at Silver Mountain more than Lookout Pass, which maintained more than 100 inches at the summit from January 9 on. However, the most distinct difference between the last two seasons is the amount of snow that fell during March: more than a Snow Water Equivalent (SWE) foot.",
    "textAfterTable": "Navigate thru Wallace Idaho Greg's Wallace Idaho HOMEPAGE City/County Contact Information City/County Census Information Center of the Universe Own a mountain overlooking Wallace WEATHER around Wallace RECREATION near Wallace BOOKS about Wallace and region Lodging in Wallace Tourist Attractions in Wallace The Silver Valley Silver Valley PHOTO ALBUM Silver Valley VIDEOS Silver Valley REAL ESTATE Silver Valley Mining Companies Friends of the Coeur d'Alene Trails Trail of the Coeur d'Alenes   Trail of the Coeur d'Alenes Photos The Route of the Hiawatha   Hiawatha Trail MAP Zipline Mountain Tours Snowmobile Adventures Silver Mountain Ski Area Silver Mountain Snow Report Lookout Pass Ski Area Lookout Pass Snow Report 2014/15 Ski Season Snowfall Log    Current Snowfall Forecast   ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}