{
    "relation": [
        [
            "Secondary Classification",
            "Secondary Classification: Post Tax Pension For Existing Classification: Voluntary Deduction Description: Post Tax Pension deductions",
            "Secondary Classification: Pre-Tax Pension For Existing Classification: Pre-Tax Deductions Description: Pre Tax Pension deductions",
            "Secondary Classification: NI’able Free of Tax For Existing Classification: Pre-Tax Deductions Description: NI’able Deductions Free of Tax",
            "Secondary Classification: Free of Tax For Existing Classification: Earnings Description: Earnings Free of Tax",
            "Secondary Classification: Free of NI For Existing Classification: Earnings Description: Earnings Free of NI",
            "Secondary Classification: Free of Tax and NI For Existing Classification: Earnings Description: Earnings Free of Tax and NI",
            "Existing Classification: Direct Payment",
            "Secondary Classification: Taxable Benefit Earnings Subject to NIC For Existing Classification: Earnings Description: Taxable Benefit Earnings Subject to NIC",
            "Secondary Classification: Taxable Benefit Earnings NOT Subject to NIC For Existing Classification: Earnings",
            "Secondary Classification: Taxable Benefit Subject to NIC Information For Existing Classification Information Description: Taxable Benefit Subject to NIC Information Elements",
            "New Secondary Classification: Taxable Benefit NOT Subject to NIC Information For Existing Classification: Information Description: Taxable Benefit NOT Subject to NIC Information Elements"
        ],
        [
            "Balance Required",
            "Classification Balance: Post Tax Pension Contributions Description: Post Tax Pension Contributions Balance Category: RTI Reporting",
            "Classification Balance: Pre-Tax Pension Contributions Description: Pre Tax Pension Contributions Balance Category: RTI Reporting",
            "Classification Balance: NI’able Deductions Free of Tax Description: NI’able deductions Free of Tax",
            "Classification Balance: Earnings Free of Tax Description: Earnings Free of NI",
            "Classification Balance: Earnings Free of NIC Description: Earnings Free of Tax",
            "Classification Balance: Earnings Free of Tax and NI Description: Earnings Free of Tax and NI",
            "Classification Balance: Total Direct Payments Description: Total Direct Payments",
            "Classification Balance: Benefits Taxed Thru Payroll Subject to NIC Earnings Description: Benefits Taxed Through Payroll Subject to NIC as Earnings",
            "Classification Balance: Benefits Taxed Thru Payroll NOT Subject to NIC Earnings Description: Benefits Taxed Through Payroll NOT Subject to NIC as Earnings",
            "Classification Balance: Benefits Taxed Thru Payroll Subject to NIC Information Description: Benefits not earnings Taxed Through Payroll Subject to NIC Information",
            "Classification Balance: Benefits Taxed Thru Payroll NOT Subject to NIC Information Description: Benefits not earnings Taxed Through Payroll NOT Subject to NIC Information"
        ],
        [
            "Description",
            "Predefined secondary classification and balance to add the Pension Contribution element where it is taken as deduction from Net pay. Attach if required",
            "Predefined secondary classification and balance to add the Pension Contribution element where it is ‘Pre-Tax’ deduction. Attach if required",
            "Predefined secondary classification and balance to add the pre-tax deduction elements (if these deductions affect taxable pay). Attach if required",
            "Predefined secondary classification to feed the existing balance to report all pay that is not subject to tax. Attach if required",
            "Predefined secondary classification and balance to report all pay that is not subject to NIC Attach if required.",
            "Predefined secondary classification and balance to report all pay that are not subject to tax nor NIC. Attach if required.",
            "Predefined balance to be fed by existing classification ‘Direct Payments’ to collect all payments classified under the Direct Payments classification. Attach if required",
            "Predefined secondary classification and balance to add the Earnings elements for benefits that are taxed through payroll but not actually paid. Attach if required.",
            "Predefined secondary classification and balance to add the earnings elements for benefits that processed through payroll but not actually paid. Attach if required.",
            "Predefined secondary classification and balance to add the Information elements for benefits that are taxed through payroll but not actually paid and are subject to NI deductions. Attach if required.",
            "Predefined secondary classification and balance to add the Information elements for benefits that are processed through payroll but not actually paid and are not subject to NI deductions. Attach if required."
        ]
    ],
    "pageTitle": "Payroll Statutory Deductions and Reporting",
    "title": "Secondary Classifications and their Balances for RTI",
    "url": "http://docs.oracle.com/cd/E18727_01/doc.121/e13534/T8332T8335.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 68874191,
    "recordOffset": 68805152,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7412=As the year is not perfectly divisible by 7, an extra week is necessary. For non-leap years Week 53 is April 5, and for leap years Week 53 is April 4 -5., 7890=31 May - last date for delivery of employees' P60 forms, 305844=Select RTI – Full Payment Submission Process (FPS) 2013/14 in the name field., 24152=From 6th April 2003 NI rebates do not appear as a separate category on the Tax Payments Listing. This is because rebates are now included as part of a single net contribution value., 273087=To run the EYU 2012/13 process, 186929=As an employer you must submit a declaration and a certificate on the documentation submitted to HMRC each year. The deadline is May 19 following the end of year, with penalties for lateness and for incorrectly completing the return. You submit your return using Electronic Data Interchange Submission., 284303=To run the Create EPS Payment Values 2013/14 process, 310517=Select RTI – Full Payment Submission Process (FPS) 2014/15 in the name field., 267079=Use the RTI GB Update NI Category program to update the national insurance (NI) categories for employees who are under 21 years old (as of 6th April 2015) and for employees over 21 but having new categories. Run this program before running the payroll to ensure that the NI categories are updated as expected., 275576=Use this process for the tax year 2015/16., 273602=Effective Date – Enter the date on which the process is being run (starting from 20th April), so if you are running the process currently, then enter the current date (for example 29 April 2013). For the next EYU being submitted after this, it should be 29th April or any date after 29th April (after the last current date)., 285521=Select RTI – Create EPS Payment Values 2014/15 in the Name field., 320974=Effective Date - Enter the effective date from when to migrate the existing normal hours band. The default is 6-APR-2014., 239379=For most employers, the final Full Payment Submission (FPS) return is made on or before 5th April when you make the final payment of earnings for the tax year., 287412=Select RTI – Create EPS Payment Values Pre 06 April 13 in the Name field., 241056=Any FPS submission which is for a process in the new tax year (the payroll run / balance adjustment process is on or after 6 April), then you must use the new FPS process for 2013/14. You must run the EPS also for the appropriate year that the payments relate to in the same manner as the FPS. You must run the EPS for any EYU submission that would affect the Statutory Payments Recovery and NI Compensation values., 179139=P46(Car) EDI Process V4 - Pre 06-Apr-2012, 274132=Select RTI – Earlier Year Update Process (EYU) 2013/14 in the Name field., 275529=To run the EYU 2015/16 process, 301810=Select RTI – Employer Payment Summary Process Pre 06 April 13 in the Name field., 8169=The tax period to use for calculating PAYE is the period in which the payment date falls. For example, the weekly payment date April 14 is in Week 2, and the monthly payment date April 5 is in Month 12., 300585=Use this process for the tax year 2014/15., 285004=To run the Create EPS Payment Values 2013/14 Multi Threaded process, 170172=Note: If you have employees with more than two cars, the P11D process generates a Warning message in the archive output report. You can then print working sheets for cars and attach them to P11D report. However, the EDI process does not require this manual intervention. This worksheet reports the 8 different fuel types under the fuel types A, D, and E which are applicable after 6th April 2011. Fuel type B,C,G,H, and P are reported as fuel type A. Type L and D is reported as fuel type D. Fuel type E has not changed and is reported as E., 312258=Select RTI – Full Payment Submission Process (FPS) 2015/16 in the name field., 299644=In the Submit Request window, select RTI – Employer Payment Summary Process (EPS) 2015/16 in the Name field., 14119=Select the Not Paid Between Start and 5- Apr check box if an employee will not be paid in the current tax year. The P45PT3 EDI file will contain a record (ATT2 58) to inform HMRC not to expect a P14 (EOY) return for the employee this year., 297948=In the Submit Request window, select RTI – Employer Payment Summary Process (EPS) 2013/14 in the Name field., 314412=Select RTI – Full Payment Submission Output 2013/14 in the name field., 280680=Effective Date – This date determines the tax year for which the EAS data is to be extracted. The effective date must be the date of the RTI migration. For example, if the RTI migration date is agreed with HMRC as February 2013, then this date must be 01-Feb-2013. If the migration date is agreed as the 1st period in the new tax year and this payroll period spans both tax years (a 4 weekly payroll with dates of 30th March to 26th April 2013), then enter the date as 06-April-2013 to filter out any previous year starters and leavers. The EAS process picks up all the employees current at this date. Additionally, as the process uses this date to derive the start of the tax year it picks up the starters and leavers in the relevant tax year. This is a mandatory parameter., 299532=To run the EPS process 2015/16, 19299=Note: At the start of a new tax year there may be a statutory requirement to either uplift or reduce particular suffix codes because of budgetary changes. New codes that are introduced will not validate until you are datetracked to the effective period. For example, you cannot enter a P code prior to 6 April 1999., 273147=Select RTI – Earlier Year Update Process (EYU) 2012/13 in the Name field., 30780=From April 2000 there is a further rebate for standard rate employees who are members of a contracted out occupational pension scheme.. The rebate is a percentage of the earnings between the LEL and the employee's earnings threshold., 310452=Use this process for the tax year 2014/15., 37935=External Reporting Van 2007, 7833=19 May - last date for sending year end returns, 280303=To run the EAS process 2013/14, 8085=5 April - end of tax year, 284372=Use this process for tax year 2013/14., 285459=Use this process for tax year 2014/15., 287176=To run the Create EPS Payment Values Pre 06 April 13 process, 309965=If there is a combination of multiple BACS and other payment methods (2 BACS payments, 1 Cheque and 1 Cash payment) then the HASH is generated using the highest BACS amount and the other amounts are included., 275736=In addition to the parameters of the 2013/14 EYU process, enter the following data:, 267612=Effective Date: Default is set to: 6-APR-2015., 280051=You can submit the Employer Alignment Submission in ‘parts’ from April 2013 if you are operating your PAYE scheme through different vendors, or choose to send in data for alignment in logical ‘chunks’., 274072=To run the EYU 2013/14 process, 300651=In the Submit Request window, select RTI – Employer Payment Summary Process (EPS) 2014/15 in the Name field., 10680=You must ensure that the PAYE reference for a payroll remains the same throughout a tax year to avoid generating incorrect statutory reports. You can change the PAYE reference for a payroll at the start of a new tax year, 6th April. However, if you have already executed one or more payroll runs in a tax year, changing the PAYE reference for the payroll with a retrospective effective date can result in incorrect statutory reports., 272619=Oracle HRMS enables you to make further amendments to the updates relating to the updates relating to the previous tax year after completing and returning the end of year submissions for the current year. This process enables you to submit an earlier year update as HMRC does not accept any further FPS submissions for the previous tax year after 19th April. The process generates the EDI file for submission to HMRC., 29905=There is no UEL for the employer's secondary contributions. In addition, since the tax year 1991/1992 the employer has a liability to pay Class 1A contributions on the taxable benefit of a number of benefits provided to the employee., 7575=Monthly calendars also start from 6 April. Month 1 is from April 6 - May 5, and so on through the year., 282188=To run the EAS process Pre 06 April 13, 35054=Special rules apply to the calculation of NIC for directors. A person is classified as a company director if he or she is appointed under Sections 291-294 of the Companies Act 1985. Directors' earnings are chargeable to Schedule E (PAYE) income tax., 289356=Call the GB_EPS_GET_REC_AND_NIC predefined formula function (FF) from the SMP/SAP/ASPP and OSPP element formula. Pass Amount input value as a parameter. The seeded fast formula passes the Recovery and NIC Compensation computed values to the out parameters specified on the user formulae. Return these values to the appropriate predefined indirect elements for Recovery and NIC Compensation using the Formula Results functionality. For example, you must return the computed SMP Recovery amount to \"SMP Recovery\" element's Pay Value and return the computed SMP NIC Compensation to \"SMP NIC Compensation\" element's Pay Value. These indirect elements in turn feed the seeded balances which are reported after you run the RTI Create EPS Payment Values 2013/14., 310401=To run the FPS process for 2014/15, 8010=19 July - last date for payment of Class 1A NICs on cars and fuel, 322779=Effective Date - Enter the effective date from when to update the SCON numbers. The default is 6-APR-2014., 193128=For information on changes to P45 and PAYE processing, see UK Payroll: Changes to P45 and PAYE Processing (January 2007) Resulting from Patch <<5144323>> white paper available on MetaLink (Note ID 405369.1), 301652=Use the Employer Payment Summary Process Pre 06 April 13 for returns that relate to tax year 2012/13 through the Submit Request window., 7284=The first tax week, known as Week 1, runs from April 6 -12. Week 2 runs from April 13 -19, and so on through the year., 298250=Effective Date – Enter the tax period end date as 05-MM-YYYY for the relevant tax period. For example, if running a July monthly payroll FPS for payments at the end of the month (for example, 28 July), then the tax period is considered as period 05 running from 06-July to 05-Aug, and as such the date you enter is the end of the tax period in question (enter 05-Aug-YYYY). If running a weekly payroll and its dates span the tax period, then the EPS does not cover the values for this payroll as it falls into the next tax period. For example, if a weekly payroll pay date is 07-Aug, then this falls into the next tax period covered by 06-Aug to 05-Sept. and therefore the effective date entered of 05-Aug, in the above case does not include the weekly pay run values., 159630=You can do this at any time during the year, although the need most typically arises in the period between the end of the tax year (5th April) and the 6th July deadline for the submission of P11D reports to HMRC., 42390=Vans 2005, 284433=Select RTI – Create EPS Payment Values 2013/14 in the Name field., 314353=To run the FPS Output 2013/14, 317671=FPS with Starter Details – The process generates a starter record for all employees submitted through the Old Employer PAYE Reference. It sets the starter date to 6 April of the tax year. The process reports the starter declaration details and the YTD values as zero. The generated FPS record is based on the MIG for the relevant tax year. In line with HMRC instructions, the process reports starter declaration details as follows:, 336281=Copyright © 2015, Oracle and/or its affiliates. All rights reserved., 285390=To run the Create EPS Payment Values 2014/15 process, 333234=Effective Date - The date entered here determines the timeframe for which the YTD values are to be reported. For example if 05-April 2013 is supplied, then this process reports all the balances up to that point., 280363=Select RTI – Employer Alignment Submission Process (EAS) 2013/14 in the name field., 7800=6 April - start of year, 312358=In addition to the parameters listed in the 2013/14 FPS process, enter the following data (selected fields described):, 6957=The tax year starts on 6 April one year and ends on 5 April the following year. Each tax year may be referred to as a combination of the two partial calendar years, for example, 05/06. The calendar can be based either on a weekly frequency or on a calendar month frequency., 239280=You can send FPS Final Submission multiple times as required until 19th April, 165898=The application uses rounded figures (without Pence denominations) of the Cost Equivalent, Amount Made Good, and Cash Equivalent values and applies the A – B = C validation guidance from HMRC. For example, the application processes the calculation 1234.56 - 234.78 = 999.78 as 1234.00 - 234.00 = 1000.00., 287253=Use this process only for returns that relate to tax year 2012/13 even if the physical date for the tax year end (05-April) has passed., 282243=Run the Employer Alignment Submission Process Pre 06 April 13 process for tax year 2012/13., 140990=However, from 6th April 2003 the NI Director on Account element is no longer available. You should now enter details for NI Directors on Account in the GB Tax Information window, 310617=Apart from the parameters of the 2013/14 FPS process, enter the following:, 240909=After 19 April 19, use the Earlier Year Update (EYU) message to send amendments to employee values for the previous tax year., 271238=Effective Date – Enter a date from which you want all employees to be picked up. This process sets all employees who are ‘active’ at this date to ‘Pre-RTI’ verified status. This process does not select any employees who have not started but are in the system (future starters) and any employee that was not an active employee at this date (if date entered is before the current system date e.g. date today = 01-Jan-2012 and effective date entered is 30-Nov-2011 then this process excludes the employees started between 01-Dec to 01-Jan-2012)., 239560=You should indicate that this is your ‘final submission for year’ through the FPS. However, if you discover on or before the 19th April, following the end of the tax year, that you need to make any amendments or corrections to the information reported you can submit an additional FPS. You must indicate on your amended FPS that this is your ‘final submission for year’. If you have to make any amendments or corrections on or after 20th April, you need to complete an Earlier Year Update (EYU). This is the procedure for the end of the tax year only. Within the year, you can make corrections to an FPS by sending a corrected FPS., 300538=To run the EPS process 2014/15, 42457=Vans 2007, 285101=Apart from the parameters of the Create EPS Payment Values 2013/14 process, enter the following:, 301597=To run the EPS process pre 06 April 13, 282357=Select RTI – Employer Alignment Submission Process Pre 06 April 13 in the Name field., 306435=First FPS Effective Date – Select the date for which the first FPS is being sent. This is mandatory if the First FPS parameter is Yes. The process uses this to determine the first pre-payment to be listed in the list of values for the Pre-Payment Request ID parameter and filter pre-payments processed prior to migration to RTI. Ensure that this date is the date of RTI migration (same as the date specified on the EAS. For example, if the RTI migration date is agreed with HMRC as February 2013, then this date must be 01-Feb-2013 for both EAS and First FPS. If the migration date is agreed as the 1st period in the new tax year and this payroll period spans both tax years (a 4 weekly payroll with dates of 30th March to 26th April 2013), then submit the EAS and FPS date as 06-April-2013 to filter out any previous year starters and leavers., 241493=Oracle HRMS provides a new version of the EDI message types for RTI for each tax year. For the 2012/13 tax year, the EPS message type is ‘EPS’ and the EYU message type is ‘EYU13’. Regardless of the date of submission, if you want to update figures for the 2012/13 tax year, they you must use ‘EYU13’ and ‘EPS’ as required. For the 2013/14 tax year, there is an ‘EPS14’ and ‘EYU14’. Use these to adjust the 2013/14 tax year values. So, if you discover in May 2014 that you need to adjust figures for 2012/13, then you can still use ‘EYU13’ and ‘EPS’., 305780=To run the FPS process for 2013/14, 317003=FPS with Leaver Details – The process picks up all active employees as on 5th April YYYY, where payroll definition is updated. Ensure that you have set up the employees with HRMC through EAS or FPS. The process does not pick up new hires that are not set up with HRMS. It does not pick up terminated employees where the reporting date to HMRC is set and leaver details if there is an outstanding pre-payment with no FPS run. The process sets the leaver date to 5 April of the relevant tax year. It reports the YTD values for the tax year and sets the PTD values to zero. The generated FPS record is based on the MIG for the relevant tax year., 312109=To run the FPS process for 2015/16, 252902=A for First Job since 6th April, 274227=Apart from the parameters of the 2012/13 EYU process, enter the following:, 275641=Select RTI – Earlier Year Update Process (EYU) 2015/16 in the Name field., 297781=To generate the EPS EDI file for a particular PAYE reference or for all ‘Verified’ EPS records in the business group for tax year 2013/14, 7955=6 July - last date for sending P9Ds and P11Ds, 300781=Apart from the parameters of the 2013/14 EPS process, enter the following:, 176572=You use the P11D EDI process to submit a record based on the P11D archive request id which the P11D Legislative Process generates. Employers must submit P11D details for the preceding tax year to HMRC by 12th July. This should be a single return for the entire tax year., 37887=External Reporting Van 2005, 313990=The FPS creates an output as well as a PDF report which reports all the vital information that is on the FPS. You can run this report separately using the RTI – Full Payment Submission Output 2013/14 concurrent program. This report details all the information that has been output to the EDI file. You can run this report separately for any FPS archive.}",
    "lastModified": "Tue, 23 Jun 2015 15:17:28 GMT",
    "textBeforeTable": "The following table shows the tax deduction elements defined by Oracle Payroll for PAYE administration and supplied as part of startup data. Implementing Startup Data You must ensure that the PAYE reference for a payroll remains the same throughout a tax year to avoid generating incorrect statutory reports. You can change the PAYE reference for a payroll at the start of a new tax year, 6th April. However, if you have already executed one or more payroll runs in a tax year, changing the PAYE reference for the payroll with a retrospective effective date can result in incorrect statutory reports. Note: If you transfer employees between payrolls having the same tax reference number, the balances continue to accumulate as before. If you have payrolls that are reported under different tax reference numbers, you may sometimes have the requirement to transfer employees between these payrolls. If you want to change an assignment's tax district reference number, you must terminate the assignment and start it with the new tax district reference number. In such cases, the tax balance will restart from zero, and you should issue a P45 for the assignment. The system provides balances for Taxable Pay and PAYE, both of which include dimensions that correctly sum up all the necessary run results. The PAYE balance is fed only by the amount of PAYE paid. The run results passed to the Taxable Pay balance, however, are identified by balance feeds",
    "textAfterTable": "Enter the Prev Employers PAYE Ref and Date Left Prev Employer details. Enter the Prev Tax Code and the Prev Tax Basis details. Enter the Last Payment Period Type and Last Payment Period information. Select the Recently Bereaved check box, if applicable. If you want to send this information to HMRC by EDI, check the Send EDI check box. Entering Employee PAYE Details The Statutory Details window lets you enter and view an employee's PAYE and NI information on one screen. You can inspect the check box information displayed at the top of the window to show whether the employee has: NI multiple assignments PAYE aggregated assignments If you want to change the entries in the multiple assignment and aggregated assignment check boxes, make your changes on the Employment tab of the Person window. You cannot change them in the Statutory Details window. Note: You can only make changes if you have not run your payroll in the current tax year. However, you can manually check the Excluded from WNU check box to specify that this employee should not be included in future Works Number Updates. This typically occurs in response to a HMRC notification that they do not need further updates for this employee. Link the PAYE Details element to your payrolls. You can enter defaults at the link level for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}