{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,051 topics 2,122,834 replies",
            "85,543 topics 1,153,422 replies",
            "1,071 topics 11,067 replies",
            "4,218 topics 64,752 replies",
            "5,995 topics 75,801 replies",
            "50,533 topics 466,097 replies",
            "22,767 topics 196,263 replies",
            "4,269 topics 60,404 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 114,992 replies"
        ],
        [
            "Last Post Info",
            "Favorite mission By Claptrap NL 4 minutes ago",
            "What happened to Luis Lopez? By Mr. Fahrenheit A minute ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Most Underrated GTA Ever By Melancholia 3 hours ago",
            "Luigi Goterelli By TheUnholy 17 hours ago",
            "Do You Think Ryder Died Too... By hot-temper27 4 hours ago",
            "Something that has always b... By Midnight Hitman 8 hours ago",
            "Grand Theft Auto III Pre-Re... By inadequate 43 minutes ago",
            "v 11.44, where is the radio? By Cerium 10 hours ago",
            "Grand Theft Auto - Memes By master4scorpion 4 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=223&t=408544&p=1059851550",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00279-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 101951179,
    "recordOffset": 101926913,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{20741=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16343=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 96341=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 47408=Yahoo, Google, oleg_aka_djmeg, Bing, Phil Phuge Risen, Timcatgt5, Corndog93, dice, TarHeelJohn, Mr. Fahrenheit, Rafli, Radius95, robban, Th3MaN1, bryanlee211, Parikshit Singh, Gabriela_L, Miss Malevolent, Spectacus, Tycek, camo_boy67, Nightmare3883, Claptrap NL, __TheGovernor__, _F_, Pegassi Autobot, Katabasis, eddylimm, pjrthefox, SuperGTFan, gts., BassicalyDrunK, universetwisters, zzr, Cutter De Blanc, iLikeDrivinInMyTruck, Destroyeroffaces, Officer620, rapidwiz, lord tammerlain, Fetti Debartolo, Eclectic, BlueSocks, Otter, Anger Personified, psymin, Nick1020, CrysisAverted, Ocelot., asilcenk, Psoloquoise, YukiEiri, BUTTER MAN 13, The Yokel, FunkyFreak, PreciousWall, PhillBellic, X Reaper X, quadro09, Silver le Belge, Dns2K, tkc.snail, Headdogg81, Ezuu, nargris, Fenton, Hyde Original, StoneCold-Y2J, Donikage, Jonnyb41, The Hero, AcidRunner, AtchooMatchew, Vexate, Mantiger308, GTA4LIFE9000, XX7BLAZIN7XX, keep_calm_play_GTA, Stefhatta, TG_Stig, Tchuck, fabio3, This Guy Is Here, Majesticnug420, Baggy Men Leopard Pant, Jason Frost, ShadowTheFaded, thekittyhawk, Google Mobile, Owl Man, master4scorpion, Fonshway, HD Tactics, TJGM, dairyworker, Mr. Jago, RedBull FM, link-thezoraband, CarimboHanky, Shiest Bubble, ermaccer, KornbreadMaf1a, Cracka.Brew, Walter175, MusaKhan9876, TheTruthIsFree, Shabazz916, SeaWallTx, Alan Eastwood, Rewdalf, calambos, Zatoichi-, Paul_silvana10910, BlackZmith10, Gtaman_92, Choco Taco, nkjellman, The Mysterious One, UptownRider, Fattypack, Chaise, Black Terminator, PremanKampung, raymond_calitri, xXOsamaBinLamaXx, RamiV2, Halal Cyborg, Prof_Farnsworth, Carface80, Terroryaki, BoostGod77, timason, GTAGuy1995, arewenotmen, N7Operative84, GTA_The_Series, bulldog385, ambiency, HKM87, CBH, MovingTarget268, Hocko1999_fgc, ExplosiveViper, SM Grunge, ThatCarGuy, theGTAking101, Giantsgiants, gtasadude, hezus123, Ermac64, wstaylor, KoF StyL, Bolatsi, Acekiler, Bongsquirrel, machine4578, CjLosSantos, Superfrogger, Cali Boy Will, AdvancedShoe, ProgramG, HunterGatherer, TobISIS, emelen, Edward Nashton, maxx1013, niirve, Peiva's Laahdin, Sanchez14, Rekia87, MetroBaller, nLytin, Majestic81, Econobrick, Progeekzy, UshaB, audjpy, -RONIN-, Facebook, A8ul99, 12484=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9232=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 18594=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 14129=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 4 minutes ago By Ducard Facade Corporation 613,079 replies 15,168 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Timcatgt5 GTA V Throwback Pack 2,275,908 replies 113,029 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides & Strategies,",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,426 topics 416,479 replies [C#] How do raycasts work? By TheVideoVolcano An hour ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}