{
    "relation": [
        [
            "Date",
            "Jan 22, 1991",
            "Dec 26, 1995",
            "Feb 1, 2000",
            "Jul 9, 2000",
            "Sep 12, 2000"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: MINOLTA CAMERA KABUSHIKI KAISHA, C/O OSAKA KOKUSAI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:MATSUDA, NAOYUKI;YAMAKOSHI, YUKIYOSHI;TOMITA, HIROSHI;AND OTHERS;REEL/FRAME:005579/0101 Effective date: 19901229",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20000707"
        ]
    ],
    "pageTitle": "Patent US5127646 - Image forming apparatus provided with a sheet magazine - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5127646?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468474491,
    "recordOffset": 468444103,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Further, subjects to be fed from the magazine 13 may be copy sheets or sheets coated with resin as well as photosensitive films. For example, although the elastic pad 39a disposed on the magazine frame 39 and the elastic pressing roller 43 bring improvements in unwinding the cover 41 in the above-described embodiment, it is possible to achieve the same effects even if either the pad 39a or the roller 43 is elastic. Also, when the film cover 41 is elastic, it is no need to make the pad 39a and the roller 43 elastic. Although the present invention has been described in connection with the embodiment above, it is to be noted that various changes and modifications are apparent to those who are skilled in the art. Such changes and modifications are to be understood as included within the scope of the present invention defined by the appended claims, unless being separated therefrom. When the sensor 87 is off at step S284, it is judged that there are no films in the magazine 13, and the indication panel of the printer 10 indicates at step S288 that the magazine 13 is emptied of films. Subsequently the arm driving motor 62 is turned on at step S289 to move the sucker holding unit 22 upward, and when the sensor 86 is turned on (\"YES\" at step S290), the motor 62 is turned off at step S291.",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5350165 * Aug 12, 1993 Sep 27, 1994 Laurel Bank Machines Co., Ltd. Sheet feeding apparatus US5473400 * Jan 30, 1995 Dec 5, 1995 Minnesota Mining And Manufacturing Company Resealable film cartridge for a laser imager US5480134 * May 9, 1994 Jan 2, 1996 Minnesota Mining And Manufacturing Company Mechanism for opening and closing a resealable cartridge US5560597 * Nov 23, 1994 Oct 1, 1996 Harris Corporation Imaging unit container including bag clamping member US5660384 * Nov 23, 1994 Aug 26, 1997 Minnesota Mining And Manufacturing Company Imaging unit container having shiftable walls US5806844 * Aug 14, 1996 Sep 15, 1998 Harris Corporation Imaging unit container including",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}