{
    "relation": [
        [
            "Citing Patent",
            "US5748191 *",
            "US5761641 *",
            "US5818423 *",
            "US5857172 *",
            "US5864815 *",
            "US5874939 *",
            "US5999895 *",
            "US6003072 *",
            "US6005549 *",
            "US6142784 *",
            "US6160536 *",
            "US6192343",
            "US6233560",
            "US6353313",
            "US6384591 *",
            "US6445175",
            "US6498847",
            "US6629077",
            "US6654955",
            "US6903723",
            "US6937984",
            "US7005966",
            "US7206747",
            "US7324942",
            "US7551944",
            "US8165886",
            "US8219407",
            "US8275617",
            "US8793137",
            "US8831956",
            "US20040122655 *",
            "US20080015857 *",
            "WO1996004741A1 *"
        ],
        [
            "Filing date",
            "Jul 31, 1995",
            "Jul 31, 1995",
            "Aug 18, 1997",
            "Jul 31, 1995",
            "Jul 31, 1995",
            "Dec 10, 1996",
            "Jul 24, 1995",
            "Jun 30, 1994",
            "Jul 24, 1995",
            "Jun 15, 1998",
            "Mar 27, 1995",
            "Dec 17, 1998",
            "Dec 16, 1998",
            "Mar 11, 1999",
            "Sep 11, 1997",
            "Aug 28, 2001",
            "Feb 9, 2000",
            "Nov 22, 2000",
            "Dec 19, 1996",
            "Jul 24, 1995",
            "Dec 17, 1998",
            "May 18, 2000",
            "Dec 16, 1998",
            "Jan 29, 2002",
            "Dec 3, 2002",
            "Sep 29, 2008",
            "Sep 30, 2008",
            "Dec 17, 1998",
            "Jul 9, 2012",
            "Aug 14, 2012",
            "Mar 17, 2003",
            "Jul 31, 2007",
            "Aug 7, 1995"
        ],
        [
            "Publication date",
            "May 5, 1998",
            "Jun 2, 1998",
            "Oct 6, 1998",
            "Jan 5, 1999",
            "Jan 26, 1999",
            "Feb 23, 1999",
            "Dec 7, 1999",
            "Dec 14, 1999",
            "Dec 21, 1999",
            "Nov 7, 2000",
            "Dec 12, 2000",
            "Feb 20, 2001",
            "May 15, 2001",
            "Mar 5, 2002",
            "May 7, 2002",
            "Sep 3, 2002",
            "Dec 24, 2002",
            "Sep 30, 2003",
            "Nov 25, 2003",
            "Jun 7, 2005",
            "Aug 30, 2005",
            "Feb 28, 2006",
            "Apr 17, 2007",
            "Jan 29, 2008",
            "Jun 23, 2009",
            "Apr 24, 2012",
            "Jul 10, 2012",
            "Sep 25, 2012",
            "Jul 29, 2014",
            "Sep 9, 2014",
            "Jun 24, 2004",
            "Jan 17, 2008",
            "Feb 15, 1996"
        ],
        [
            "Applicant",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Dragon Systems, Inc.",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Motorola, Inc.",
            "Forest; Donald K.",
            "U.S. Philips Corporation",
            "Forest; Donald K.",
            "Knowledge Kids Enterprises, Inc.",
            "Forest; Donald K.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Comsonics, Inc.",
            "Comsonics, Inc.",
            "Comsonics, Inc.",
            "Daniel A. Henderson",
            "Universal Electronics Inc.",
            "International Business Machines Corporation",
            "Donald K. Forest",
            "International Business Machines Corporation",
            "Micron Technology, Inc.",
            "International Business Machines Corporation",
            "Microstrategy, Incorporated",
            "Nuance Communications, Inc.",
            "Great Northern Research LLC",
            "Great Northern Research, LLC",
            "Nuance Communications, Inc.",
            "Great Northern Research LLC",
            "Nuance Communications, Inc.",
            "Fuji Xerox Co., Ltd.",
            "Dictaphone Corporation",
            "Andrew R Mark"
        ],
        [
            "Title",
            "Method and system for creating voice commands using an automatically maintained log interactions performed by a user",
            "Method and system for creating voice commands for inserting previously entered information",
            "Voice controlled cursor movement",
            "Activation control of a speech recognizer through use of a pointing device",
            "Method and system for displaying speech recognition status information in a visual notification area",
            "Keyboard apparatus and method with voice recognition",
            "Sound operated menu method and apparatus",
            "Multi-media data processing device with remote control device that also has voice input means and hand-sized unit for use in such data processing device",
            "User interface method and apparatus",
            "Mathematical learning game and method",
            "Dwell time indication method and apparatus",
            "Speech command input recognition system for interactive computer display with term weighting means used in interpreting potential commands from relevant speech terms",
            "Method and apparatus for presenting proximal feedback in voice command systems",
            "Remote, wireless electrical signal measurement device",
            "Hands-free signal level meter",
            "Remote, wireless electrical signal measurement device",
            "Dialer programming and device with integrated printing process",
            "Universal remote control adapted to receive voice input",
            "Adding speech recognition libraries to an existing program at runtime",
            "Data entry method and apparatus",
            "Speech command input recognition system for interactive computer display with speech controlled display of recognized commands",
            "Remote computer controller and control method",
            "Speech command input recognition system for interactive computer display with means for concurrent and modeless distinguishing between speech commands and speech queries for locating commands",
            "System and method for interactive voice services using markup language with N-best filter element",
            "Speech recognition system for electronic switches in a non-wireline communications network",
            "Speech interface system and method for control and interaction with applications on a computing system",
            "Method for processing the output of a speech recognizer",
            "Speech command input recognition system for interactive computer display with interpretation of ancillary relevant speech query terms into commands",
            "Method for processing the output of a speech recognizer",
            "Speech command input recognition system for interactive computer display with interpretation of ancillary relevant speech query terms into commands",
            "Natural language input apparatus and storage medium which stores natural input program therein",
            "USB Dictation Device",
            "Method and apparatus for securing data communication"
        ]
    ],
    "pageTitle": "Patent US5408582 - Method and apparatus adapted for an audibly-driven, handheld, keyless and ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5408582?dq=7,328,163",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473024251,
    "recordOffset": 472987318,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17881=This application is a continuation of application Ser. No. 07/733,586, filed Jul. 22, 1991, now abandoned, which was a continuation of application Ser. No. 07/559,028, filed Jul. 30, 1990, now abandoned.}",
    "textBeforeTable": "Patent Citations Many modifications and alterations may be made by those having ordinary skill in the art without departing from the spirit and scope of the invention. Therefore, it must be understood that the illustrated embodiment has been set forth only for the purposes of example and clarity, and should not be read as limiting the invention as defined in the following claims. The invention as claimed expressly includes not only the literal elements claimed, but all equivalents thereto which function in any manner to obtain the same result. then these three sentences may be spoken into the circuit in this sub-mode, just as written; the command \"Spell\" and \"End Spell\" used to spell, letter for letter, and space for space each sentence; the \"Same As\" command used to assign the number \"one\" to the first sentence, \"two\" to the second sentence and \"three\" to the third sentence, and, when the user required typing of one of these reasons in the form, she would simply say \"Type\" \"Sentence\" \"Three\" and the proper sentence would be typed on the form. 3. Denied credit because of past bankruptcy. 2. Denied credit because of poor employment history. 1. Denied credit because of poor credit history. Thus, if a government worker had to include as part of her completion of a form, a choice of three short sentences such as: This sub-mode, however, can be used to store free speech. Since the",
    "textAfterTable": "US6629077 Nov 22, 2000 Sep 30, 2003 Universal Electronics Inc. Universal remote control adapted to receive voice input US6654955 Dec 19, 1996 Nov 25, 2003 International Business Machines Corporation Adding speech recognition libraries to an existing program at runtime US6903723 Jul 24, 1995 Jun 7, 2005 Donald K. Forest Data entry method and apparatus US6937984 Dec 17, 1998 Aug 30, 2005 International Business Machines Corporation Speech command input recognition system for interactive computer display with speech controlled display of recognized commands US7005966 May 18, 2000 Feb 28, 2006 Micron Technology, Inc. Remote computer controller and control method US7206747 Dec 16, 1998 Apr 17, 2007 International Business Machines Corporation Speech command input recognition system for interactive computer display with means for concurrent and modeless distinguishing between speech commands and speech queries for locating commands US7324942 Jan 29, 2002 Jan 29, 2008 Microstrategy, Incorporated System and method for interactive voice services using markup language with N-best filter element",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}