{
    "relation": [
        [
            "Date",
            "Feb 4, 2005",
            "Oct 26, 2005",
            "Sep 2, 2008",
            "Dec 28, 2010",
            "Dec 29, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: PROCTOR & GAMBLE CO MPANY THE, OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MCCONNELL, THEODORE VAN FOSSEN;SPRINGER, JASON EDWARD;MCFADDEN, TERRENCE PAUL;REEL/FRAME:016250/0301 Effective date: 20050203",
            "Owner name: PROCTER & GAMBLE COMPANY, THE, OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:MCCONNELL, THEODORE VAN FOSSEN;SPRINGER, JASON EDWARD;MCCFADDEN, TERRENCE PAUL;REEL/FRAME:016943/0330 Effective date: 20050203",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7249708 - Household management systems and methods - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7249708?dq=5,870,513",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482572835,
    "recordOffset": 482532110,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While particular embodiments of the present invention have been illustrated and described, it would be obvious to those skilled in the art that various other changes and modifications can be made without departing from the spirit and scope of the invention. It is therefore intended to cover in the appended claims all such changes and modifications that are within the scope of this invention. It will be apparent that embodiments of the present invention provide numerous technical effects. For example, storing media content locally on the end-user's PC will significantly reduce the demands on the system administrator servers. Likewise, in the embodiments wherein a product catalog data store is stored locally on the end-user's PC, the end-user will not need to access system administrator servers or retailer servers in order to, for example, browse the product catalog data store and select items therefrom for inclusion in a shopping list. Additional technical effects provided by embodiments of the present invention include the ability of manufacturers and/or retailers to more efficiently and effectively evaluate the success of their promotional activities. Embodiments of the present invention also facilitate household compliance with diet and/or nutritional needs, the efficient tracking of pantry inventory, household budgeting and tracking of purchases, and the preparation of a shopping list prior to traveling to a retailer. For the end-user, many of the functionalities of embodiments of the present invention described herein may be",
    "textAfterTable": "US6014634 Aug 4, 1997 Jan 11, 2000 Supermarkets Online, Inc. System and method for providing shopping aids and incentives to customers through a computer network US6032129 Sep 6, 1997 Feb 29, 2000 International Business Machines Corporation Customer centric virtual shopping experience with actors agents and persona US6055573 Jan 7, 1999 Apr 25, 2000 Supermarkets Online, Inc. Communicating with a computer based on an updated purchase behavior classification of a particular consumer US6084528 Dec 20, 1996 Jul 4, 2000 Symbol Technologies, Inc. Intranet scanning terminal system US6185541 May 12, 1999 Feb 6, 2001 Supermarkets Online, Inc. System and method for providing shopping aids and incentives to customers through a computer network US6246997 Mar 26, 1998 Jun 12, 2001 International Business Machines Corp. Electronic commerce site with query interface US6246998 Feb 25, 1999 Jun 12, 2001 Fujitsu Limited System and method for home grocery shopping including item categorization for efficient delivery and pick-up US6249773",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}