{
    "relation": [
        [
            "Date",
            "Oct 1, 1999",
            "Jul 30, 2002",
            "Oct 31, 2003",
            "Jun 13, 2006",
            "Jun 15, 2010",
            "Jul 18, 2014",
            "Jan 29, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Owner name: BANK ONE, NA, AS ADMINISTRATIVE AGENT,ILLINOIS Free format text: SECURITY AGREEMENT;ASSIGNOR:XEROX CORPORATION;REEL/FRAME:013111/0001 Effective date: 20020621",
            "Owner name: JPMORGAN CHASE BANK, AS COLLATERAL AGENT,TEXAS Free format text: SECURITY AGREEMENT;ASSIGNOR:XEROX CORPORATION;REEL/FRAME:015134/0476 Effective date: 20030625",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: XEROX CORPORATION, NEW YORK Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:BANK ONE, NA;REEL/FRAME:034842/0245 Effective date: 20030625 Owner name: XEROX CORPORATION, NEW YORK Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:JPMORGAN CHASE BANK, N.A.;REEL/FRAME:034857/0287 Effective date: 20061204"
        ]
    ],
    "pageTitle": "Patent US6523944 - Ink delivery system for acoustic ink printing applications - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6523944?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988308.23/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485490167,
    "recordOffset": 485464498,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The above description merely provides a disclosure of particular embodiments of the invention and is not intended for the purpose of limiting the same thereto. As such, the invention is not limited to only the above described embodiments. Rather, it is recognized that one skilled in the art could conceive alternative embodiments that fall from the scope of the invention. As color requirements change, the inks can easily be rinsed out and replaced with a new custom set. The product set could be enhanced by options to include more than one multi-color printhead (which allows for more colors than the number of printheads for which space is available in the printer), complete with ink and electronics support, to keep the customer up-and-running with multiple custom configurations. As described above, multiple multi-color printheads could be added to increase output speed. Also, specialized spot color printing would be possible by selecting a specialty ink such as translucent or light scattering material. This could allow a ‘high-fi color’ printing capability without the costs associated with using many single-color printheads. Wider printheads result in faster speed; however, a printhead width could nonetheless be divided into many sections (e.g. 8 sections) and still result in a competitive printing speed, with much higher color resolution as a result of the advantages noted above. As acoustic ink printhead technology grows to produce wider heads, this technique would provide the opportunity to add many-more",
    "textAfterTable": "Ing. S. Olivetti & C., S.p.A. Ink detecting device for a liquid-ink printing element US5341162 * Aug 24, 1992 Aug 23, 1994 Xerox Corporation Liquid deagassing apparatus US5481289 * Sep 30, 1993 Jan 2, 1996 Canon Kabushiki Kaisha Ink supply mechanism, ink jet cartridge provided with such a mechanism, and ink jet recording apparatus provided with such a mechanism US5489925 * May 4, 1993 Feb 6, 1996 Markem Corporation Ink jet printing system US5540569 * Jan 17, 1995 Jul 30, 1996 Micropump, Inc. Multiple-chamber gear pump for ink jet printing US5621444 * Dec 7, 1994 Apr 15, 1997 Hewlett-Packard Company Controlled heating of solid ink in ink-jet printing US5782604 * Dec 5, 1996 Jul 21, 1998 Domino Printing Sciences, Plc Pump US5793395 * Jun 7, 1995 Aug 11, 1998",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}