{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,057 topics 2,122,789 replies",
            "85,542 topics 1,153,413 replies",
            "1,071 topics 11,067 replies",
            "4,218 topics 64,751 replies",
            "5,995 topics 75,801 replies",
            "50,533 topics 466,097 replies",
            "22,767 topics 196,263 replies",
            "4,269 topics 60,402 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 114,981 replies"
        ],
        [
            "Last Post Info",
            "Can I run GTA V on this PC? By SilverRST 3 minutes ago",
            "Is the Lost still alive in LC? By Mr. Fahrenheit 8 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Most Underrated GTA Ever By Sentinel Driver A day ago",
            "Luigi Goterelli By TheUnholy 14 hours ago",
            "Do You Think Ryder Died Too... By hot-temper27 An hour ago",
            "Something that has always b... By Midnight Hitman 4 hours ago",
            "Grand Theft Auto III Pre-Re... By thehambone 2 hours ago",
            "v 11.44, where is the radio? By Cerium 7 hours ago",
            "Hottest female Grand Theft... By PhillBellic 35 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=32&t=459745&p=1060144766",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 101713519,
    "recordOffset": 101687120,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14187=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 47402=quadro09, Kirsty, Fisciletti, Google, Yahoo, The_Big_Show, jp9865, Alexa, wonderboyjohnny, Cico555, monkb4skunk, RemyLacroix, SuperGTAFreak, em1b16a2, Ezekeil2Ofive17, aterikasedi, Bing, 44MA9NUM357, Otter, blusunone, Capshun Is Cool, johnson., HBSanta, Setzaroth, Smesi, NcShane, s2n vaniish, playdafool, Mika_0013, Mike324467, Quejki, xXOsamaBinLamaXx, Rented, BrownBear, Mantiger308, soundism, Cutts750, adirtygriff, JamesRay0757, Fozzie_420, GtaFanatik, Doc34, transambill, ric-013, InfamousSabre, Dillono, kKatie, souldisposal, dehan, -Silence*, chef_archie, LONEW3LF, daliakiller, Anotic, Rexpower_, PhillBellic, Ray, SevDoggX, deadx23, Lubas, Foxtrot64, Vova07, Fleckz, Skeve613, halflegz, Itzreality, dan bull, DragonSpade, Bangha, Indiana24, gunziness, r.lorenzo13, Geefiasco, Chris Partlow, Footballgrl70, dbthesuperstar, Jesse.yancey320, whywontyoulisten, CrysisAverted, Gamerjman19, josehatesyou, Sugar Free Nos, Quebahombre, Modojo, DOK94, lydianduck, TheIllaDopest, Spectacus, OBeef619, Severe, Google Mobile, Majesticnug420, fawk_faber, Rytherik, lebongjames187, machine4578, Cripto136, 313izzle, Garrett2013, Miss Malevolent, darthYENIK, Stig, .JokeR, NotAHipster, Bms842, esato, AtchooMatchew, Gutslab, WoRKHard1985, Fireman, This Guy Is Here, Zorvaine, Elitefailz2, Aquilus, Ethenal, ELZ_MILLION1, BigJoe_1, thedeephouser, BoDuken, Icantthinkofonew, Headdogg81, __TheGovernor__, Chips237, Zuzucious, Ruiᴎ, neon_xeon, McH2Oz2, Corndog93, Tuesdy, Awesome.D, Smale45, Ch0nRuS, Accidentpronegamer, the nameless, Indignation, Laura91, NikoBellicGTAIV, scottmacdougall, RedRyder2142, CyberPrince, NothingSpecial, IAmTheWhiteDeath, Bondergomme, ledzep71, JRC99, Xx 2fab4u xX, YaNnEY_x, FMMZ, highwayking, LibertyViceSantos555, ShadowCola, Choppers, Malikstuntin, SilverRST, DevilfishRAW, pavulabreaker, NYgangster25, nargris, adub, kraftwerkd, Evebringer, CarimboHanky, Synshade, Nem Wan, 018361, Ermacs, KyloW13, WindowsExPee, Pegassi Autobot, Progeekzy, Pyroshox, senator cashed, Seanpony, Red Lynx 23, ibsmokin, Hades_, psymin, Quaid, hornedturtle, direstraits, Pyro_Indigo, Thalyn, IIOctaneII, concolt, Dern Sure, RiseAgainBH, dustin619, Lazio-S, Niobium, MaazS, I Love Anna Kournikova, Mr. Fahrenheit, Bane X01, master4scorpion, ambiency, ZombieKHIL, jdude1969, K-ROSE, GeneralSteve93, MelloHello, MeowMix99914, kzstone, downtheory, thehambone, Geralt of Rivia, Russell_Brand, Opzeker, Eggobites90, incognito32, ballen205, Tony_Florence, iamcornholio, Kakaoen404, SadBoy2015, universetwisters, jerryinohio78, JTrocks9, Max Payne, thebrianmo, Imnotthefiveo, ZiadWaleed, Jason Frost, Citron_XY, Richardbrown30, dewtech_2008, eshenk, Joeywheels, nWo_Y2J_2015, Eram, slayso, DGK Rider, gtuned, eli.g1026, logicspawn, Rainess, Joan Corona, GTA_Matt24, xInfamousRYANx, Fonshway, 16401=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18652=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 12636=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 20799=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 108855=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 9373=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Capshun Is Cool Wrench Life Car Club (Xbox... 613,063 replies 15,167 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Anotic Time to ban the Squeakers 2,275,673 replies 113,023 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,424 topics 416,472 replies GTA SA Cleo 4 issue By TJGM A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}