{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,054 topics 2,122,781 replies",
            "85,542 topics 1,153,407 replies",
            "1,071 topics 11,067 replies",
            "4,218 topics 64,751 replies",
            "5,995 topics 75,801 replies",
            "50,533 topics 466,097 replies",
            "22,767 topics 196,263 replies",
            "4,269 topics 60,402 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 114,978 replies"
        ],
        [
            "Last Post Info",
            "Cool Things You Didn't... By Los Santos citizen 9 minutes ago",
            "Niko's Wife 2015 By Mr. Fahrenheit A minute ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Most Underrated GTA Ever By Sentinel Driver A day ago",
            "Luigi Goterelli By TheUnholy 13 hours ago",
            "Do You Think Ryder Died Too... By hot-temper27 4 minutes ago",
            "Something that has always b... By Midnight Hitman 3 hours ago",
            "Grand Theft Auto III Pre-Re... By thehambone An hour ago",
            "v 11.44, where is the radio? By Cerium 6 hours ago",
            "What if Phil Cassidy met CJ? By hot-temper27 6 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Track&f=226&t=511155",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981460.12/warc/CC-MAIN-20150728002301-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106581611,
    "recordOffset": 106553627,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47704=Bing, smokingndriving, Vega LVI, Mr. Fahrenheit, CaptianBackwoods, McH2Oz2, Google, budcat, GTA@ddict13, Yahoo, JoeFury1997, ap0t, torresno9, iiConTr0v3rSYx, Tony_Florence, Pyroshox, Lubas, Jacob_Rivera_11232, totally_blown, GTA_The_Series, acalmocean, ShadowCola, thedeephouser, Jyx, R4gN0r0K, Zello, Majesticnug420, Avenged Sevenfold, PF Spray, DBrasco, Ray, CrysisAverted, FumCatial, CCPD, nls_whs_2010, psymin, FANTSTIC, Russell_Brand, streetx1xracer, Kirsty, LONEW3LF, Non Fiction, Otter, TarHeelJohn, Cripto136, Jason Frost, Google Mobile, Mike2232, VinnyIrish, Queen Elizabeth II, Danny Young, Imnotthefiveo, Capricornus, penguinhero, Spectacus, Smale45, COYBIG88, SalvatoreCJ1903, Topsy05, monkb4skunk, A Paradox from 94, ForcefulMars459, WoRKHard1985, Vova07, Itzreality, LC-DDM, Sasuke Uzumaki, Frauenarzt, RoloBabs, xInfamousRYANx, customkingpimp, HiTMaN__DeaDBLooD, PhillBellic, Joan Corona, mhe77, Cudwieser, Between3and20chars, blacknambala, VeraVanderpump, gtafan26, Timcatgt5, CjLosSantos, Wolfpac4Life, josephene123, Tabris666, Chang, WWEMichaelB, Neuling2000, LarcenousUrsine, AdvancedShoe, hot-temper27, Failure, -Jacking-, synn8773, Atlantic Tuna, dwestos, fefenc, Sentinel Driver, Semaj 2JZ♢, big MILLS 304WV, Chris Partlow, Corndog93, lol232, A.O.D.88, TristanAnderson, InJ3cT3Dwarrior, Jesse.yancey320, ChrisWolf0, thehambone, Ermacs, Rambo_AFC, Ezuu, Hyde Original, khalilx45, Xx 2fab4u xX, Miss Malevolent, Nugsy, quadro09, deadx23, kj2022, darthYENIK, adub, pggosbee, PreciousWall, sleepinginlife, win25, nicklax31, Mr. Langan, fjj8, Dillono, FedoraTheExplora, Matias_Montanna, jukebox, Synshade, ghilliesuit101, MrDemeulemeester, Rashkovskys Shiv, Qrotchety, Tenpenny2015, REXX93, Sneakerhead., zhb94430, NEGAKOARL, NubcakeVII, Angel Bryan, UptownRider, The_Big_Show, Red Lynx 23, nkjellman, Tchuck, nokuto, Judicious 7, badmoon, xiaoshung, gooby, BlackZmith10, Prodigy_Rocks_, BadKarma1699, universetwisters, andrewleepaul, Los Santos citizen, Joeywheels, Arazern, Ezekeil2Ofive17, javiEmma, Quaid, -RONIN-, Geometry, lilkidd2, Craig Kostelecky, dwkzxx, Modojo, Xorthian, Nicinator16, ZODIAC 4 v2, Crackhead_Ben, billy-pilgrim, Choco Taco, GTA_fear, l FaTaLxBeast l, hotrats773, ChickenAndBeer, ScarySKRILLEX, MRCTM, Ryan_Codebreaker, WestsideResider, CrossPT, HellCattX, Razed-, MarshalMoo, SumSkittles, SPECTER II, WhosYu, JaySeaThree, TwisterVictor1, DevilSonic1, kyennamo, Rooster Mods, timason, Zhaxi, dbthesuperstar, Eram, AudiGuy, Alexa, NotAHipster, theNGclan, Sigurd, soulsie8, CarimboHanky, Thousand Accent, Pyro_Indigo, Bxx88, CaptainDowntown, Fisciletti, rea12345, Mantiger308, fazedevil, CREW_CUTZ, ACA, drzayas, Warliss, Anarckhy, 16467=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 18720=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 12702=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 105987=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14253=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 9510=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 20867=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By R4gN0r0K Facade Corporation 613,050 replies 15,166 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Smale45 Anyone else getting reporte... 2,275,593 replies 113,015 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,424 topics 416,461 replies Mod Archive Custom Screensh... By LC-DDM 2 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}