{
    "relation": [
        [
            "Minutes",
            "100",
            "300",
            "600",
            "900",
            "1200",
            "Unlimited"
        ],
        [
            "Texts",
            "500",
            "Unlimited",
            "Unlimited",
            "Unlimited",
            "Unlimited",
            "Unlimited"
        ],
        [
            "Web & Wi-fi",
            "500MB & Unlimited Wi-Fi",
            "500MB & Unlimited Wi-Fi",
            "500MB & Unlimited Wi-Fi",
            "750MB & Unlimited Wi-Fi",
            "750MB & Unlimited Wi-Fi",
            "1GB & Unlimited Wi-Fi"
        ],
        [
            "Monthly Cost (1-month contract)",
            "£16.50",
            "£21.50",
            "£26.50",
            "£32",
            "£37",
            "£52"
        ],
        [
            "Monthly Cost (12 month contract)",
            "–",
            "–",
            "£21.50",
            "£26.50",
            "£32",
            "£47"
        ]
    ],
    "pageTitle": "O2's \"Simplicity for iPhone\" tariffs now from £15/month; unlimited texts - Ken's Tech Tips",
    "title": "",
    "url": "http://kenstechtips.com/index.php/o2s-simplicity-for-iphone-tariffs-now-from-15month-available-online",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 129100245,
    "recordOffset": 129084646,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7484=I'm a freelance writer specialising in mobile technology. I've been blogging at Ken's Tech Tips since 2005 with the aim of demystifying mobile technology for the rest of us., 22269=February 26th, 2010, 39509=The no-nonsense guide to smartphones & mobile technology in the UK, since 2005.}",
    "TableContextTimeStampAfterTable": "{13458=© 2005-2015 Ken's Tech Tips. All rights reserved. We use cookies to personalise content and ads, to provide social media features and to analyse our traffic. We also share information about your use of the website with social media, advertising and analytics partners. For more information, please see our privacy policy. By continuing to access this website, you consent to the storing, accessing and sharing of this information.}",
    "textBeforeTable": "You can now choose from 5 different “Simplicity for iPhone” tariffs which all including unlimited texts. Each tariff is available on either a 1-month rolling contract or a 12 month contract. There is a £5/month discount for the 12 month contract. What tariffs are available? Simplicity for iPhone is a SIM-only tariff for your iPhone. SIM only tariffs are contracts which only provide you with airtime and do not provide you with a free phone. They offer good savings (about £180/year) to people who already have their own iPhone and have completed the original contract length. It’s also ideal if you’ve purchased a second hand iPhone or had one handed onto you. Yesterday we were the first to bring you news of the updates to O2’s iPhone tariff and the incorporation of “unlimited” texts onto their iPhone tariffs. O2 have today announced a much larger range of “Simplicity for iPhone” tariffs which are all available online. This includes a £15/month tariff which is the cheapest iPhone tariff to date. O2 are offering a range of “Simplicity” tariffs for iPhone users from £15/month with 300 minutes, unlimited texts and internet. photo: Jeff Kubina //--> google_ad_height = 280; google_ad_width = 336; google_ad_slot = \"4841035901\"; /* Blog Top: Square */ google_ad_client =",
    "textAfterTable": "All of the tariffs include visual voicemail. We think that the £15/month iPhone tariff (300 minutes, unlimited texts, unlimited web and wi-fi, visual voicemail) on 12 months is a real highlight – certainly the cheapest iPhone tariff on the market. Which tariff should I choose? photo: Jeff Kubina The right tariff for you would depend on how many minutes you regularly use. Once you’ve used your inclusive airtime, it will cost 20p/minute to make a phone call so costs can quickly add up. Make 400 minutes of phone calls on a 300-minute tariff for example and you would end up paying £40 that month (£20 for the base tariff plus £20 for calls). It is often better to choose a tariff with more minutes than you require than to exceed your airtime allowance regularly. Another important decision is whether to go with the 1 month rolling contract or the 12 month contract. The 12-month contract has a £5/month discount. If you’re looking to upgrade to the iPhone 4 in the next 12 months, you may be better off with the 1-month rolling contract. How much money will I save by switching to “Simplicity for iPhone”? Typically, about £15/month or £180 per year providing you are happy to sign the 12-month contract. For example, you might currently be on the old £35/month iPhone",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}