{
    "relation": [
        [
            "Year",
            "2011",
            "2011",
            "2011",
            "2011",
            "2011",
            "2011",
            "2011",
            "2011",
            "2011"
        ],
        [
            "Journal",
            "Stroke",
            "Neuriobiol Aging",
            "Clin Neurophysiol",
            "Neuroimage",
            "J Neurophys",
            "Neuroscience",
            "J Neur",
            "Exp Transl Stroke Med",
            "Brain Stimulation"
        ],
        [
            "Title",
            "Short-term anomia training and electrical brain stimulation",
            "Non-invasive brain stimulation improves object-location learning in the elderly.",
            "Improving working memory: Exploring the effect of transcranial random noise stimulation and transcranial direct current stimulation on the dorsolateral prefrontal cortex.",
            "Modulating inhibitory control with direct current stimulation of the superior medial frontal cortex.",
            "Probing for hemispheric specialization for motor skill learning: a transcranial direct current stimulation study.",
            "Transcranial direct current stimulation over Broca's region improves phonemic and semantic fluency in healthy individuals.",
            "Short- and long-lasting tinnitus relief induced by transcranial direct current stimulation.",
            "Effect of a tDCS electrode montage on implicit motor sequence learning in healthy subjects.",
            "Improving working memory: the effect of combining cognitive activity and anodal transcranial direct current stimulation to the left dorsolateral prefrontal cortex."
        ],
        [
            "Results",
            "Anodal transcranial direct current stimulation applied over the nonlanguage dominant hemisphere can enhance language training outcome in chronic aphasia.",
            "improved recall 1 week after learning with anodal tDCS",
            "Anodal tDCS increased working memory",
            "anodal tDCS improved efficiency of inhibitory control, useful for ADHD/ADD",
            "Left M1 tDCS induced significantly greater skill learning",
            "These data confirm the efficacy of tDCS in transiently improving language functions by showing that anodal stimulation of Broca's region can enhance verbal fluency.",
            "Has effects, lasting days sometimes, but worsened tinnitus in some",
            "tDCS led to greater consolidation of the learned motor sequence than sham stimulation",
            "tDCS applied during completion of the n-back task was found to result in greater improvement in performance on digit span forward, compared with tDCS applied while at rest and sham tDCS during the n-back task."
        ],
        [
            "Anode",
            "R-TPJ (Right temporal parietal junction)",
            "R-TPJ (Right temporal parietal junction)",
            "DLPFC (Dorsolateral prefrontal cortex)",
            "Pre SMA (prefrontal)",
            "L/R M1",
            "Broca's (assuming left)",
            "Left Temporoparietal (and reverse)",
            "Motor cortex (tested uni and bilateral montage)",
            "L-DLPFC"
        ],
        [
            "Cathode",
            "Unclear",
            "Unclear",
            "Unclear",
            "unclear",
            "http://www.ncbi.nlm.nih.gov/pubmed/21613597",
            "Unclear",
            "Unclear",
            "Contralateral M1 or unclear",
            "Unclear"
        ],
        [
            "Link",
            "http://www.ncbi.nlm.nih.gov/pubmed/21636820",
            "http://www.ncbi.nlm.nih.gov/pubmed/21684040",
            "http://www.ncbi.nlm.nih.gov/pubmed/21665534",
            "http://www.ncbi.nlm.nih.gov/pubmed/21459149",
            "",
            "http://www.ncbi.nlm.nih.gov/pubmed/21477637",
            "http://www.ncbi.nlm.nih.gov/pubmed/21509429",
            "http://www.ncbi.nlm.nih.gov/pubmed/21496317",
            "http://www.ncbi.nlm.nih.gov/pubmed/21511208"
        ]
    ],
    "pageTitle": "TDCS - Noisebridge",
    "title": "",
    "url": "https://noisebridge.net/index.php?title=TDCS&diff=prev&oldid=30995",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884947291,
    "recordOffset": 884937419,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{19404=[http://1.bp.blogspot.com/-4s10WKXnVgE/UAGm7VVAlKI/AAAAAAAAACk/XzSyQq50OsI/s1600/83c8e1d44a4c9874dad699645b3d2eb5.media.800x574.jpg ] [http://www.reddit.com/r/tDCS/comments/qn6s5/diy_tdcs_howto/ ], 6827=Wikipedia, bitches. For the record, the acronyms tDCS and TDCS are both in use in academia, and I think the former is stupid because they're just trying to be cool like iPhones and fMRI. The word transcranial is obviously abbreviated, and when we abbreviate words in an acronym, we capitalize them. So if you move this page to tDCS, I will move it back. --Hurtstotouchfire 01:14, 12 May 2012 (UTC), 14394=TDCS subreddit Note that this source of information is wildly inconsistent. While a few people there are fairly well educated on the subject, a huge amount of outright misinformation lives and breeds there. judas 08:47, 25 October 2012 (UTC), 5024=This is a page skeleton for some new projects we're going to document here! Feel free to fill shit in. --Hurtstotouchfire 21:16, 7 May 2012 (UTC)}",
    "textBeforeTable": "Hurtstotouchfire 01:14, 12 May 2012 (UTC) I have no crapping idea. -- There are quite a few other abstracts from more recent work that aren't included here, including the stuff from the most recent big neuro yearly powwow in DC. (Kelly, do you still have the links to those papers from the military guys at Wright-Patterson?) - JPW The best collection of academic study abstracts is here. (note that we should snatch this and put a copy somewhere, since we have no clue who this dropbox account belongs to or how long access will stay stable. The file has credit within, so I don't think it's evil. I will try to remember to email the creator and make sure he has no issues with same) - JPW [edit] Academic publications Wikipedia, bitches. For the record, the acronyms tDCS and TDCS are both in use in academia, and I think the former is stupid because they're just trying to be cool like iPhones and fMRI. The word transcranial is obviously abbreviated, and when we abbreviate words in an acronym, we capitalize them. So if you move this page to tDCS, I will move it back. --Hurtstotouchfire 01:14, 12 May 2012 (UTC) [edit] Transcranial Direct Current Stimulation",
    "textAfterTable": "[edit] Anecdotes TDCS subreddit Note that this source of information is wildly inconsistent. While a few people there are fairly well educated on the subject, a huge amount of outright misinformation lives and breeds there. judas 08:47, 25 October 2012 (UTC) [edit] Spec The basic circuit for TDCS is ridiculously simple. We are creating a 2ma DC current and running it through 2 inch square or round electrodes that are then connected to the human body. There are various configurations that can be used to place the pads, but the most common is placing the active electrode over the area of the skull corresponding to the brain region to be effected and the other electrode, called the return electrode, is placed on the opposite shoulder. Using the anode, or positive electrode, over the brain will stimulate the target region. The cathode, or negative electrode, will retard the brain region. A standard simulation time in most research is 20 minute sessions. The effect, depending on the type of stimulation and region seems to last up to an hour after the stimulation is removed. Again, depending on the type and location of the stimulation, repeated exposure daily for up to 9 sessions can cause the effects to persist for 30 days or longer in depression studies. The simplest working circuit for this is a pair of 9v batteries in series, an",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}