{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32"
        ],
        [
            "TEAM",
            "NYG",
            "PHI",
            "TEN",
            "ARI",
            "BAL",
            "PIT",
            "CAR",
            "WAS",
            "TB",
            "GB",
            "CHI",
            "MIA",
            "ATL",
            "IND",
            "NO",
            "MIN",
            "TEAM",
            "SD",
            "NYJ",
            "BUF",
            "DEN",
            "JAC",
            "HOU",
            "NE",
            "DAL",
            "CLE",
            "SF",
            "SEA",
            "OAK",
            "DET",
            "CIN",
            "STL",
            "KC"
        ],
        [
            "TOTAL DVOA",
            "42.7%",
            "36.6%",
            "27.0%",
            "21.1%",
            "20.1%",
            "19.8%",
            "15.5%",
            "15.5%",
            "15.4%",
            "15.2%",
            "12.1%",
            "9.4%",
            "8.8%",
            "6.8%",
            "6.0%",
            "2.7%",
            "TOTAL DVOA",
            "1.8%",
            "-1.7%",
            "-3.7%",
            "-7.5%",
            "-8.3%",
            "-9.5%",
            "-9.5%",
            "-10.1%",
            "-12.0%",
            "-15.5%",
            "-18.7%",
            "-32.3%",
            "-34.1%",
            "-36.8%",
            "-38.7%",
            "-43.1%"
        ],
        [
            "LAST WEEK",
            "2",
            "1",
            "3",
            "8",
            "4",
            "7",
            "10",
            "5",
            "6",
            "11",
            "9",
            "12",
            "16",
            "15",
            "14",
            "18",
            "LAST WEEK",
            "17",
            "21",
            "13",
            "22",
            "19",
            "24",
            "23",
            "20",
            "25",
            "26",
            "27",
            "28",
            "30",
            "31",
            "29",
            "32"
        ],
        [
            "WEIGHTED DVOA",
            "42.3%",
            "35.4%",
            "28.0%",
            "21.4%",
            "18.9%",
            "19.1%",
            "15.8%",
            "15.6%",
            "15.8%",
            "15.1%",
            "11.2%",
            "10.6%",
            "7.9%",
            "7.7%",
            "5.6%",
            "3.0%",
            "WEIGHTED DVOA",
            "1.1%",
            "-2.9%",
            "-5.6%",
            "-9.8%",
            "-9.0%",
            "-8.1%",
            "-10.2%",
            "-12.8%",
            "-9.5%",
            "-16.0%",
            "-16.3%",
            "-31.4%",
            "-32.7%",
            "-36.6%",
            "-36.7%",
            "-42.4%"
        ],
        [
            "RANK",
            "1",
            "2",
            "3",
            "4",
            "6",
            "5",
            "8",
            "9",
            "7",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "RANK",
            "17",
            "18",
            "19",
            "23",
            "21",
            "20",
            "24",
            "25",
            "22",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32"
        ],
        [
            "W-L",
            "7-1",
            "5-3",
            "8-0",
            "5-3",
            "5-3",
            "6-2",
            "6-2",
            "6-3",
            "6-3",
            "4-4",
            "5-3",
            "4-4",
            "5-3",
            "4-4",
            "4-4",
            "4-4",
            "W-L",
            "3-5",
            "5-3",
            "5-3",
            "4-4",
            "3-5",
            "3-5",
            "5-3",
            "5-4",
            "3-5",
            "2-6",
            "2-6",
            "2-6",
            "0-8",
            "1-8",
            "2-6",
            "1-7"
        ],
        [
            "OFFENSE DVOA",
            "25.0%",
            "17.6%",
            "6.6%",
            "22.6%",
            "2.7%",
            "-6.8%",
            "9.8%",
            "16.8%",
            "-0.4%",
            "9.5%",
            "4.7%",
            "14.9%",
            "16.4%",
            "13.8%",
            "21.7%",
            "-2.1%",
            "OFFENSE DVOA",
            "18.3%",
            "-1.5%",
            "0.0%",
            "13.5%",
            "6.5%",
            "9.8%",
            "0.7%",
            "4.1%",
            "-5.6%",
            "-17.3%",
            "-7.5%",
            "-23.4%",
            "-10.5%",
            "-19.1%",
            "-15.7%",
            "-14.3%"
        ],
        [
            "OFF. RANK",
            "1",
            "5",
            "14",
            "2",
            "18",
            "25",
            "11",
            "6",
            "21",
            "13",
            "16",
            "8",
            "7",
            "9",
            "3",
            "23",
            "OFF. RANK",
            "4",
            "22",
            "20",
            "10",
            "15",
            "12",
            "19",
            "17",
            "24",
            "30",
            "26",
            "32",
            "27",
            "31",
            "29",
            "28"
        ],
        [
            "DEFENSE DVOA",
            "-15.5%",
            "-16.1%",
            "-21.8%",
            "1.1%",
            "-20.3%",
            "-26.9%",
            "-5.8%",
            "-2.1%",
            "-16.4%",
            "-3.7%",
            "-6.8%",
            "-3.0%",
            "9.3%",
            "5.9%",
            "16.2%",
            "-16.9%",
            "DEFENSE DVOA",
            "18.4%",
            "0.9%",
            "6.1%",
            "20.2%",
            "17.4%",
            "22.9%",
            "15.8%",
            "7.8%",
            "14.1%",
            "1.2%",
            "11.8%",
            "12.8%",
            "26.5%",
            "14.4%",
            "24.3%",
            "22.3%"
        ],
        [
            "DEF. RANK",
            "7",
            "6",
            "2",
            "14",
            "3",
            "1",
            "9",
            "12",
            "5",
            "10",
            "8",
            "11",
            "19",
            "16",
            "25",
            "4",
            "DEF. RANK",
            "27",
            "13",
            "17",
            "28",
            "26",
            "30",
            "24",
            "18",
            "22",
            "15",
            "20",
            "21",
            "32",
            "23",
            "31",
            "29"
        ],
        [
            "S.T. DVOA",
            "2.2%",
            "2.9%",
            "-1.4%",
            "-0.5%",
            "-2.9%",
            "-0.3%",
            "-0.1%",
            "-3.5%",
            "-0.6%",
            "1.9%",
            "0.6%",
            "-8.5%",
            "1.7%",
            "-1.1%",
            "0.5%",
            "-12.1%",
            "S.T. DVOA",
            "1.9%",
            "0.7%",
            "2.3%",
            "-0.9%",
            "2.5%",
            "3.7%",
            "5.6%",
            "-6.4%",
            "7.7%",
            "3.1%",
            "0.6%",
            "3.9%",
            "2.8%",
            "-3.2%",
            "1.3%",
            "-6.5%"
        ],
        [
            "S.T. RANK",
            "10",
            "6",
            "25",
            "21",
            "26",
            "20",
            "19",
            "28",
            "22",
            "11",
            "17",
            "31",
            "13",
            "24",
            "18",
            "32",
            "S.T. RANK",
            "12",
            "15",
            "9",
            "23",
            "8",
            "4",
            "2",
            "29",
            "1",
            "5",
            "16",
            "3",
            "7",
            "27",
            "14",
            "30"
        ]
    ],
    "pageTitle": "FOOTBALL OUTSIDERS: Innovative Statistics, Intelligent Analysis | Week 9 DVOA Ratings",
    "title": "",
    "url": "http://www.footballoutsiders.com/dvoa-ratings/2008/week-9-dvoa-ratings",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 454134323,
    "recordOffset": 454103980,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10242=Official Account: @fboutsiders Scott Kacsmar: @FO_ScottKacsmar Ben Muth: @FO_WordofMuth Aaron Schatz: @FO_ASchatz Vince Verhei: @FO_VVerhei -- plus -- Bill Connelly: @SBN_BillC Cian Fahey: @Cianaf Brian Fremeau: @bcfremeau Tom Gower: @ThomasGower Andrew Healy: @AndHealy Rivers McCown: @RiversMcCown Chad Peltier: @CGPeltier Rob Weintraub: @robwein Sterling Xie: @SterlingXie, 4369=04 Nov 2008, 24020=52 comments, Last at 08 Nov 2008, 2:46pm by tally, 12283=The 2015 KUBIAK fantasy football projection workbook updates all preseason for only $20 -- or get it absolutely free with a $10 first-time deposit at DraftKings.com. Purchase it here!, 1796=On the other hand, Miami's high DVOA isn't quite as high as the sentence \"Miami has the second-best offense in the league\" might make you think. The offensive environment of 2008 has been quite strong -- the overall DVOA of the league, compared to the baseline of the past five years, is a whopping 3.8% -- but there are no teams with historically standout offenses. Right now, the Giants lead the league in offense with 25.0% DVOA. Twenty-one different offenses since 1998 were higher than that after Week 9; the only year without an offense above 25.0% DVOA was 2003. Miami's offensive DVOA since Week 3 -- the highest in the NFL, remember -- is 24.7%., 6430=Which receivers were truly most effective with the ball in their hands last season? We look at the leaders in YAC+ for 2014 and the last nine years.}",
    "TableContextTimeStampAfterTable": "{94696=TEN's ranking matches up well intuitively with what I think of them-very good, but not quite as elite as normally considered, defense, average offense, and below average special teams. They still feel to me like the 3rd best TEN teams of the DVOA era-behind 2000 and 2003. 2003 had that great passing game (wow, that felt weird to type) and could put up points. The playoff loss to NE still hurts, because with a little luck, I see that team as 14-2 and having HFA itself, which I'm convinced would make for a different result. 2000, meanwhile, feels like a better version of the current edition-better defense, better special teams (until Al Del Greco got the yips), and Derrick Mason at WR-KR-PR doing the same thing Chris Johnson is at RB this year. Plus, with McNair at QB, there was this level of confidence that he could make the big play to win the game in the closing seconds. I know I certainly don't have the same level of confidence in Collins right now, and I'm not sure if any other TEN fan does, either. Anyway, 8-0, WOOOO!, 96358=2003 was the \"Ice Bowl\" playoff game, right? Great game. As I recall, it could have gone either way..., 78828=Ford, on the other hand ... the wonder won't be the 0-16 or 1-15 record this team will have, it's that twice in 20 years, the Lions managed to land a solid RB and parlay that into multiple playoff appearances. (Even if 1982 was sketchy at best.), 3548=Nope, the reason the Chargers are 3-5 -- other than bad officiating -- is defense. The San Diego defense was fifth in DVOA last year, and ranks 29th this year. Some of it is the pass rush, with the loss of Shawne Merriman playing an obvious role. The Chargers have gone from 12th in Adjusted Sack Rate to 23rd this year. However, that's not all. Quentin Jammer and Antonio Cromartie aren't playing at the high level of a year ago. In 2007, the Chargers ranked 11th in DVOA against number-one wideouts and first in the NFL against number twos. This year, those ranks are 25th and sixth, respectively., 88874=The offensive environment of 2008 has been quite strong -- the overall DVOA of the league, compared to the baseline of the past five years, is a whopping 3.8% -- but there are no teams with historically standout offenses., 90871=The offensive environment of 2008 has been quite strong -- the overall DVOA of the league, compared to the baseline of the past five years, is a whopping 3.8% -- but there are no teams with historically standout offenses., 89444=In theory, an outstanding passing offense ought to provide opportunities for the running game; this is how New England's strong rushing DVOA in 2007 was explained. In 2008, this isn't happening. Only the Giants and Washington have both rushing and passing DVOA exceeding 10%, and they are two of the run-heaviest offenses in the league. Three others -- the Alex Gibbs triumverate -- boast both passing and rushing DVOA in excess of the 2008 average of 3.8%. All the remaining offenses are lop-sided -- or just plain bad., 48766=Posted by: Aaron Schatz on 04 Nov 2008, 66672=I think I understand why their pass defense DVOA took a hit at the Colts game--their gameplan seemed to be to guard against the deep pass and force Manning to march down the field (which he did), but in the process shorten the game so that a couple of random events one way or the other could decide things (oddly, the Colts seemd to use exactly the same strategy). DVOA hates defenses that give up consistent short gains while guarding against the big play (just like it hates boom-or-bust offenses)., 6265=These are the Football Outsiders team efficiency ratings through nine weeks of 2008, measured by our proprietary Defense-adjusted Value Over Average (DVOA) system that breaks down every single play and compares a team's performance to the league average based on situation in order to determine value over average. (Explained further here.)}",
    "lastModified": "Sun, 02 Aug 2015 14:17:12 GMT",
    "textBeforeTable": "<team> is clearly ranked <too high/too low> because <reason unrelated to DVOA>. <subjective ranking system> is way better than this. <unrelated team-supporting or -denigrating comment, preferably with poor spelling and/or chat-acceptable spelling> To save people some time, please use the following format for all complaints: As always, positive numbers represent more points so DEFENSE is better when it is NEGATIVE.  OFFENSE and DEFENSE DVOA are adjusted to consider all fumbles, kept or lost, as equal value. They also include opponent adjustments, currently at 90 percent strength. SPECIAL TEAMS DVOA is adjusted for type of stadium (warm, cold, dome, Denver) and week of season. WEIGHTED DVOA is adjusted so that earlier games in the season become gradually less important. It better reflects how the team is playing right now. These are the Football Outsiders team efficiency ratings through nine weeks of 2008, measured by our proprietary Defense-adjusted Value Over Average (DVOA) system that breaks down every single play and compares a team's performance to the league average based on situation in order to determine value over average. (Explained further here.) * * * * * All individual stats pages are now updated, as are playoff odds. Team stats will be updated shortly. Meanwhile, Week 10 means it is time for LOSER LEAGUE PART II! Now you can finally have the joy of owning Chaz Schilens and Matt Cassel. Click here for rules and signup. The winner of Part I will be",
    "textAfterTable": "NON-ADJUSTED TOTAL DVOA gives performance without adjustments for schedule strength, fumble recovery luck, and weather/altitude on special teams. ESTIMATED WINS uses a statistic known as \"Forest Index\" that emphasizes consistency as well as DVOA in the most important specific situations: red zone defense, first quarter offense, and performance in the second half when the score is close.  It then projects a number of wins adjusted to a league-average schedule and a league-average rate of recovering fumbles.  Teams that have had their bye week are projected as if they had played one game per week. PAST SCHEDULE lists average DVOA of opponents played this season, ranked from hardest schedule (#1, most positive) to easiest schedule (#32, most negative). It is not adjusted for which games are home or road. FUTURE SCHEDULE lists average DVOA of opponents still left to play this season, ranked from hardest schedule (#1, most positive) to easiest schedule (#32, most negative). It is not adjusted for which games are home or road. VARIANCE measures the statistical variance of the team's weekly DVOA performance.  Teams are ranked from most consistent (#1, lowest variance) to least consistent (#32, highest variance). TEAM TOTAL DVOA W-L NON-ADJ TOT VOA ESTIM. WINS RANK PAST SCHED RANK",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}