{
    "relation": [
        [
            "WOMEN’S RANKING",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "NAME",
            "Rosibel Molina – CUBA",
            "Ashley Futral – USA",
            "Jennifer Balfour – CAN",
            "Junko Kitahama – JPN",
            "Francesca Koe – USA",
            "Erin Magee – USA"
        ],
        [
            "FIM",
            "50",
            "55",
            "42",
            "",
            "32",
            ""
        ],
        [
            "CNF",
            "36",
            "43",
            "22",
            "",
            "",
            ""
        ],
        [
            "CWT",
            "66",
            "52",
            "45",
            "60",
            "12",
            "71"
        ],
        [
            "STA",
            "72.6",
            "54.6",
            "46",
            "60.6",
            "56.4",
            ""
        ],
        [
            "DYN",
            "71",
            "62",
            "30",
            "62.5",
            "",
            ""
        ],
        [
            "DNF",
            "50",
            "44",
            "33",
            "",
            "27",
            ""
        ],
        [
            "TOTAL",
            "345.6",
            "310.6",
            "218",
            "183.1",
            "127.4",
            "71"
        ]
    ],
    "pageTitle": "2010 Cayman Competition- Deja Blue - Performance Freediving International",
    "title": "",
    "url": "http://www.performancefreediving.com/2010-cayman-competition/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 656436859,
    "recordOffset": 656411149,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47316=The women have been putting up some impressive scores too- Rosibel threw down a 5:33 static, which is an easy one for her! Jen reached a new personal best and keeps impressing everyone as she pushes those numbers deeper and deeper. Junko turned a bit early, but after announcing that she’s sending her monkeys back to Japan via Fedex Express, we’re sure she’s going to hit it hard next time! Ashley had a little trouble with a squeeze on her 61m dive, but since she’s already done that depth in the past she’ll rock it on Thursday. Francesca did her first competition dive today and got her first white card in the ocean! I had a good dive today too after flubbing my surface protocol on my 63m dive yesterday- the judges were laughing as I VERY deliberately went through the protocol today., 80435=So we’ve just started training now and many of the competitors have arrived already. Junko Kitahama (Japan) showed up early and opened up the condos for us. Kirk, Mandy and Kaila Krack (the youngest freediver we’ve had yet!) arrived with Ted Harty (USA), myself (Erin Magee-USA) and Hawkeye Parker (USA) on May 28 and couldn’t wait to get out and get out on the scooters! We headed out for a day with Duncan at Stingray Charters and got our diving reflexes kicked in at full force with the DiveXtra Cudas. The reefs here in Cayman are incredible- we hit some great swim-throughs and even though our footage didn’t come out it was a memorable experience., 67445=Ashley: Today was my first attempt at a personal best since training began. I spent last night practicing my equalizations in the pool with Rosibel for today’s performance. Feeling pretty confident after all of the practice I suited up this morning adn entered the water with Ted’s last words to me, “It’s only three more seconds and one more equalization,” in reference to my new depth attempt compared to my old personal best. Warm-ups went well as I decided again to concentrate on FRC’s to get my equalization down. 5-4-3-2-1, peak inhalation, 10 packs and down I go! 1:45 later I surfaced with the tag and a new personal best depth of 58m! See you tomorrow, 61m!, 69660=So I’ve finally got some more photos for you! Kirk was running the camera in the water today and got some great pictures of everyone. Depths went great again today and most people on the boat hit Personal Bests! Garo’s having a bit of ear trouble and will be out of the water tomorrow, but should be back soon to help safety during the competition. Hawkeye’s chest squeeze seems to be all better and he looks like he’ll be going after another Personal Best tomorrow- not too shabby after pulling a clean 7:08 static a couple of days ago! And Rosibel rocked her static the other day too- 5:50! We’re going to have some impressive performances I think during the competition.}",
    "textBeforeTable": "And the Winner is…   2010 Cayman Competition- Deja Blue Home 2010 Cayman Competition- Deja Blue About Us Contact Store Videos Results Competitors Deja Blue April Newsletter Newsletters News and Events PFI Pro’s",
    "textAfterTable": "DYN DNF TOTAL 1 Rosibel Molina – CUBA 50 36 66 72.6 71 50 345.6 2 Ashley Futral – USA 55 43 52 54.6 62 44 310.6 3 Jennifer Balfour – CAN 42 22 45 46 30 33 218 4 Junko Kitahama – JPN     60 60.6 62.5   183.1 5 Francesca Koe – USA 32   12 56.4   27 127.4 6 Erin Magee – USA     71       71 May 14, Competition Results – Final Day Diver # Name Discipline AP RP Points Penalty/Record 1 Erin Magee",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}