{
    "relation": [
        [
            "(all wires ship 5 per box)",
            "HI-TORQUE WHISPER LS",
            "HI-TORQUE WHISPER LS",
            "HI-TORQUE WHISPER MS",
            "HI-TORQUE WHISPER MS",
            "HI-TORQUE WHISPER ES",
            "HI-TORQUE WHISPER ES"
        ],
        [
            "Diameter (in)",
            "0.014\"",
            "0.014\"",
            "0.014\"",
            "0.014\"",
            "0.014\"",
            "0.014\""
        ],
        [
            "Length (cm)",
            "190",
            "300",
            "190",
            "300",
            "190",
            "300"
        ],
        [
            "Tip Shape",
            "Straight",
            "Straight",
            "Straight",
            "Straight",
            "Straight",
            "Straight"
        ],
        [
            "Catalog Number",
            "1005351H",
            "1005353H",
            "1005357H",
            "1005359H",
            "1011834H",
            "1011835H"
        ]
    ],
    "pageTitle": "HI-TORQUE WHISPER Guide Wire",
    "title": "",
    "url": "http://www.abbottvascular.com/us/products/coronary-intervention/hi-torque-whisper.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 274694327,
    "recordOffset": 274680081,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31325=Copyright © 2006-2015 Abbott Laboratories. Abbott Park, Illinois, U.S.A. All drawings are artist's representations only and should not be considered as engineering drawings or photographs. Unless otherwise specified, all product names appearing in this Internet site are trademarks owned by or licensed to Abbott Laboratories, its subsidiaries or affiliates. No use of any Abbott trademark, trade name, or trade dress in this site may be made without the prior written authorization of Abbott Laboratories, except to identify the product or services of the company., 31930=AP2932985-US Rev. F}",
    "lastModified": "Wed, 05 Aug 2015 08:27:56 GMT",
    "textBeforeTable": "Wires for Tortuous Anatomy Features   The HI-TORQUE WHISPER guide wire maneuvers easily, even in complex anatomy, with a soft tip designed to promote safety. The HI-TORQUE WHISPER guide wire combines the great distal access of a polymer-covered wire with an innovative technological feature for control and performance.   Control is Just a Whisper Away Overview     Indications & Important Safety Information ››IFU (Full Version) ›› HI-TORQUE WHISPER Guide Wire Coronary Guide Wires   Humanitarian Use Device Structural Heart Carotid Intervention Vessel Closure Peripheral Intervention Coronary Intervention     TEXT SIZE: A A A Print  ",
    "textAfterTable": "0.014\" 190 Straight 1005357H HI-TORQUE WHISPER MS 0.014\" 300 Straight 1005359H HI-TORQUE WHISPER ES 0.014\" 190 Straight 1011834H HI-TORQUE WHISPER ES 0.014\" 300 Straight 1011835H AP2939940-US Rev. B   Indications and Important Safety Information   HI-TORQUE Guide Wires       INDICATIONS Refer to the device label for any additional product-specific indications that may apply.   CONTRAINDICATIONS HI-TORQUE Guide Wires are not intended for use in the cerebral vasculature.   Refer to the device label for any additional product-specific contraindications that may apply.   WARNINGS This device is designed and intended for ONE-TIME USE ONLY. Do not resterilize and/or reuse. Carefully observe the instructions under \"Do Not\" and \"Do\" below. Failure to do so may result in vessel trauma, guide wire damage, guide wire tip separation, or stent damage. If resistance is observed at any time, determine the cause under fluoroscopy and take remedial action as needed.   Do Not: Push, auger, withdraw or torque a guide wire that meets resistance. Torque a guide wire if",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}