{
    "relation": [
        [
            "Size(cm)",
            "XS",
            "S",
            "M",
            "L",
            "XL",
            "XXL"
        ],
        [
            "Bust",
            "70-75",
            "75-80",
            "80-85",
            "85-90",
            "90-95",
            "95-100"
        ],
        [
            "Waist",
            "55-60",
            "60-65",
            "65-70",
            "70-75",
            "75-80",
            "80-85"
        ],
        [
            "Hem",
            "75-80",
            "80-85",
            "85-90",
            "90-95",
            "95-100",
            "100-105"
        ],
        [
            "Height",
            "145-150",
            "150-1555",
            "155-160",
            "160-165",
            "165-170",
            "170-175"
        ]
    ],
    "pageTitle": "Crazy Cartoon Resident Evil Extinction Alice Girl Warrior Costumes - DinoDirect.com",
    "title": "",
    "url": "http://www.dinodirect.com/costumes-resident-evil-extinction-alice-girl-warrior.html?ddid=3813-1033",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 397639323,
    "recordOffset": 397587969,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7555=150-1555}",
    "TableContextTimeStampAfterTable": "{8738=10-07-2012}",
    "textBeforeTable": "Size in Detail:    This Sailor Costumes have different dimensions, welcome to choose and buy   This is a visual feast, can show different yourself, don't miss it   Resident Evil Costumes is a visual feast and can show different yourself  Resident Evil Extinction Alice Girl Warrior Costumes\" /> Resident Evil Extinction Alice Girl Warrior Costumes\" onerror=\"ImageOnError(this);\" class=\"dd_lazyloads\" src=\"/Templates/Site61/Dino/images/blank.gif\" width=\"464\" height=\"662\" lazy-src=\"http://p.lefux.com/61/20110811/A1963000IO/InsetImage/201108020911028.jpg\" title=\"Crazy Cartoon Details: Material: Uniform Cloth This Beautiful Girl Costumes has different dimensions, welcome to choose and buy This is a visual feast, can show different yourself, don't miss it Resident Evil Costumes is a visual feast and can show different yourself  Resident Evil Costumes are accord with the Japanese anime style This Resident Evil Costumes manufacture fine simple Specifications: More Information",
    "textAfterTable": "NOTE: These dimensions are for reference only. Specific dimension varies from person to person The size detail bases on \"Help/Buying Guide/Conversion Reference\" The clothes in 2 cm error within Package Included: 1 x Underwear 1 x Coat 1 x Coat 1 x Scarf 1 x Gloves 1 x Shorts 1 x Belt 1 x Bag If the order has not been shipped; please contact DinoDirect Live Support for order cancellation.You will get your refund within 24 hours. If the order has already been shipped; you may return the item to us postmarked within 30 calendar days of delivery. Before that, please contact our Live Support to inform that. In that case we will refund you the payment excluding actual shipping fees already incurred. If the item is defective, please contact DinoDirect Live Support and send an email to us at cs-center@dinodirect.com attached an image or video file clearly showing the defect of the product. And we will give",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}