{
    "relation": [
        [
            "No.",
            "1.",
            "2.",
            "3.",
            "",
            "5.",
            "6.",
            "",
            "8.",
            "9.",
            "10."
        ],
        [
            "Big Sky Women's Soccer Standings",
            "Portland State (SAC)",
            "Northern Colorado (@ISU, @WSU)",
            "Idaho State (UNC, UND)",
            "Montana (@SUU, @NAU)",
            "Weber State (UND, UNC)",
            "Northern Arizona (EWU, MONT)",
            "Sacramento State (@PSU)",
            "Eastern Washington (@NAU, @SUU)",
            "Southern Utah (MONT, EWU)",
            "North Dakota (@WSU, @ISU)"
        ],
        [
            "Big Sky Record",
            "5-2-1",
            "4-1-2",
            "4-2-1",
            "4-2-1",
            "4-3",
            "3-2-2",
            "3-2-2",
            "2-3-2",
            "1-5-1",
            "0-7"
        ],
        [
            "Points",
            "16",
            "14",
            "13",
            "13",
            "12",
            "11",
            "11",
            "8",
            "4",
            "0"
        ],
        [
            "Overall Record",
            "7-7-2",
            "6-5-4",
            "9-5-1",
            "8-6-2",
            "6-10",
            "5-7-4",
            "5-7-4",
            "5-7-3",
            "2-9-2",
            "2-11-1"
        ]
    ],
    "pageTitle": "WOMEN'S SOCCER POSTSEASON HOPES ON THE LINE THIS WEEKEND AT PORTLAND STATE - Sacramento State Athletics",
    "title": "",
    "url": "http://www.hornetsports.com/sports/wsoc/2012-13/releases/20130415tn1npw",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062723.96/warc/CC-MAIN-20150728002422-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 496731807,
    "recordOffset": 496715914,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34262=2015 6v6 Tournament Central All Camps and Clinics, 22068=SACRAMENTO, Calif. - With their postseason hopes in the balance, the Sacramento State women's soccer team closes out the regular season this weekend on the road at Portland State and San Jose State. The Hornets (5-7-4, 3-3-2 Big Sky) will close out their Big Sky schedule against the first-place Vikings (7-7-2, 5-2-1) at 1 p.m. on Friday before playing a non-league game to finish off the 2012 regular season against the Spartans (4-10-1, 2-4 WAC) at 1 p.m. on Sunday. TOURNAMENT IMPLICATIONS Sacramento State is currently tied for sixth in the conference standings and only the top four teams advance to the Big Sky Tournament. The Hornets and Vikings each close out their conference schedule on Friday, while Northern Colorado, Idaho State, Montana and Weber State - the four teams ahead of Sacramento State in the standings - all have two league games remaining. All four of those teams have four conference wins and of the group, the Hornets only hold the tiebreaker with Montana after beating the Griz 2-0 on Sept. 30. The Hornets cannot catch Portland State or Northern Colorado in the standings but the final two seeds are within reach. If the Hornets lose at Portland State, they will be elimated from conference tournament contention. If they win, they will need Montana to lose at least once followed by either one or two losses by Idaho State, Weber State and/or Northern Arizona. Sacramento State needs help to get into the tournament, but it all starts with a win at Portland State on Friday afternoon. MULTIMEDIA You can keep tabs on the Hornets' crucial game at Portland State via Live Stats. San Jose State will also offer Live Stats.  SCOUTING THE HORNETS Sacramento State is coming off a crushing two-loss homestand to Weber State and Idaho State. The Hornets were in second place in the Big Sky before the weekend. Overall this season, Victoria Ramirez has a team-high four goals and 11 points while Elece McBride and Alyssa Anderson are tied for second with three goals each. As a team, the Hornets have scored 18 goals on 248 shots while allowing 22 scores on 213 attempts. Goalkeeper  Shelby Tomasello has started each of the Sacramento State's eight conference games and 12 overall, with a 1.15 goals against average with 64 saves and five shutouts.  SCOUTING THE VIKINGS Portland State dropped a 2-1 decision to Idaho State last Friday but rebounded with a 1-0 victory over Weber State on Sunday. The first-place Vikings are led offensively by Daniela Solis and Amanda Howie, who each have a team-best three goals, while Amanda Dutra has a team-high four assists. As a team, Portland State has scored 19 goals on 246 shots while allowing just 14 scores on 166 attempts. Goalkeeper Lainey Hulsizer leads the Big Sky Conference with a 0.87 goals against average and has 60 saves and five shutouts in 15 starts.  SCOUTING THE SPARTANS San Jose State tallied its second Western Athletic Conference win last Sunday, 2-1, at home over Seattle U. Prior to Sunday's win, the Spartans had lost 10 of the previous 11 games. Overall this season SJSU has scored 15 goals on 158 attempts and allowed 31 scores on 196 attempts. Mikaella Melbock has a team-high four goals while Megan Molina and Kelsey Lord are tied for the team lead with four assists. Goalie Zoe Makrigiannis has played the most minutes in net of three keepers, with a 2.33 goals against average and 51 saves in 11 appearances. Emily Pryor has the better numbers, however, with a 1.60 GAA and 25 saves in eight appearances. LAST TIME OUT Sacramento State lost, 3-2, to Portland State and defeated San Jose State, 1-0, last year, with both games at Hornet Field.  ALL-TIME SERIES Sacramento State is 10-5-3 all-time against Portland State but, like they will be on Friday, only 3-3-2 on the road. The Hornets have been great against the Vikings in big games, however, as they are 2-0 versus PSU in the Big Sky Tournament. Sacramento State and San Jose State have played each year since the 1995 season and the Hornets are 9-5-3 all-time against the Spartans, including 4-1-1 in the last six meetings. BIG SKY STANDINGS The top four teams in the Big Sky standings advance to the Big Sky Tournament, which is hosted by the No. 1 seed. Teams earn three points for a win and one point for a draw. Next to the team name in the standings is who they play this weekend., 34722=2007, 2010}",
    "textBeforeTable": "SACRAMENTO, Calif. - With their postseason hopes in the balance, the Sacramento State women's soccer team closes out the regular season this weekend on the road at Portland State and San Jose State. The Hornets (5-7-4, 3-3-2 Big Sky) will close out their Big Sky schedule against the first-place Vikings (7-7-2, 5-2-1) at 1 p.m. on Friday before playing a non-league game to finish off the 2012 regular season against the Spartans (4-10-1, 2-4 WAC) at 1 p.m. on Sunday. TOURNAMENT IMPLICATIONS Sacramento State is currently tied for sixth in the conference standings and only the top four teams advance to the Big Sky Tournament. The Hornets and Vikings each close out their conference schedule on Friday, while Northern Colorado, Idaho State, Montana and Weber State - the four teams ahead of Sacramento State in the standings - all have two league games remaining. All four of those teams have four conference wins and of the group, the Hornets only hold the tiebreaker with Montana after beating the Griz 2-0 on Sept. 30. The Hornets cannot catch Portland State or Northern Colorado in the standings but the final two seeds are within reach. If the Hornets lose at Portland State, they will be elimated from conference tournament contention. If they win, they will need Montana to lose at least once followed by either one or two losses by Idaho State, Weber State and/or Northern Arizona. Sacramento State needs help to get into the tournament, but it all starts with a win at",
    "textAfterTable": "2015 Season Online Media Guide Quick Facts (PDF) Printable Schedule (PDF) Strength and Conditioning Video Quick Links Big Sky Soccer  Recruiting Questionnaire Donate to Soccer Tickets Record Book (PDF) Archives Camps 2015 6v6 Tournament Central All Camps and Clinics Facilities Hornet Soccer Field Directions/Parking Big Sky Champions 2007, 2010 NCAA Appearances 2007,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}