{
    "relation": [
        [
            "Company",
            "driveukeuro",
            "portugalremovals",
            "ukspain",
            "mark_van",
            "uk_port"
        ],
        [
            "Joined",
            "17/06/2015",
            "06/08/2013",
            "02/01/2014",
            "17/12/2012",
            "09/08/2013"
        ],
        [
            "Completed",
            "68",
            "49",
            "9",
            "8",
            "1"
        ],
        [
            "Location",
            "Worcester WR3",
            "Worcester WR3",
            "worcester WR1",
            "Worcester WR1",
            "Worcester WR4"
        ],
        [
            "Verified",
            "Verified",
            "Verified",
            "Verified",
            "Verified",
            "Verified"
        ]
    ],
    "pageTitle": "Worcester Delivery Companies - Cheap Removal, Courier & Haulage Services in Worcester",
    "title": "",
    "url": "http://www.deliveryquotecompare.com/worcester/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 398037339,
    "recordOffset": 398019427,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2128=0808 169 2000}",
    "textBeforeTable": "Registered companies in Worcester providing delivery services £120.00 111 miles Warrington United Kingdom Worcester United Kingdom 1 x Motorcycle: Piaggio MP3 Yourb... £39.00 164 miles Ashby Decoy, Scunthorpe United Kingdom Worcester United Kingdom Storage 4 Triple Stacker £120.00 192 miles Hailsham United Kingdom Worcester United Kingdom Grey cord pillow back corner sett... £59.00 125 miles Hitchin United Kingdom Worcester United Kingdom BEAUTIFUL LEATHER/GOLD INLAID WRI... £243.00 224 miles Worcester United Kingdom Durham United Kingdom 16ft speedboat on trailer £90.00",
    "textAfterTable": "Feedback for Worcester delivery services Rating Description Comments 1 x Motorcycle: Piaggio MP3 Yourban Very helpful, very professional and most importantly knew exactly what he was doing. Dave provided an excellent service and I ended up receiving my bike a few hours after it was collected. Would definitely recommend. ox blood 3 seater sofa Absolutely perfect service. Couldn't have asked for better. Went above and beyond the call of duty. Completely satisfied and would happily use again. Thank you! a large recliner chair nice guy and great contact....thanks Boys Red Racing Car Bed (B) I'm very happy with the delivery/courier service. I thought that the gentleman who helped me get the two beds and carry them to my house was very informative, understanding and kind and has made the whole moving process very smooth and without any stress. Thank you very much :) 1four,cylinder engine. ,2axels , 4 leaf springs. 2. prop shafts. gear box Very pleased with the company, prompt collection and delivery, constant updating and helpful. Would definitely",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}