{
    "relation": [
        [
            "Citing Patent",
            "US5950001 *",
            "US5974428 *",
            "US5991534 *",
            "US6003037 *",
            "US6035303 *",
            "US6253367 *",
            "US6417873",
            "US6421681 *",
            "US6628413 *",
            "US6889373 *",
            "US7120896 *",
            "US7203769 *",
            "US7216300",
            "US7330481",
            "US7478390",
            "US7496917",
            "US7516456",
            "US7523157",
            "US7549145 *",
            "US7653908",
            "US7694306",
            "US7701606",
            "US7748006",
            "US7755785",
            "US7886269 *",
            "US7921151",
            "US7952744",
            "US8046737",
            "US8102556",
            "US8132148 *",
            "US8219981",
            "US8275793",
            "US8418132",
            "US8549521",
            "US8793649",
            "US8799857",
            "US20050002056 *",
            "US20050144587 *",
            "US20100251108 *"
        ],
        [
            "Filing date",
            "Jun 3, 1997",
            "Aug 29, 1997",
            "Jun 3, 1997",
            "Oct 30, 1996",
            "Feb 2, 1998",
            "Nov 18, 1998",
            "Dec 11, 1998",
            "May 25, 1999",
            "May 14, 1997",
            "Sep 6, 2001",
            "Oct 31, 2001",
            "Mar 14, 1997",
            "Aug 22, 2001",
            "Aug 7, 2002",
            "Sep 25, 2003",
            "Sep 25, 2003",
            "Sep 25, 2003",
            "Sep 25, 2003",
            "Sep 25, 2003",
            "Mar 4, 2008",
            "Jun 25, 2008",
            "Jul 25, 2006",
            "Jun 2, 2008",
            "Oct 15, 2003",
            "Feb 23, 2006",
            "Jul 19, 2008",
            "Apr 27, 2010",
            "Feb 23, 2006",
            "May 4, 2011",
            "Feb 23, 2006",
            "Jul 15, 2008",
            "Feb 23, 2006",
            "Feb 23, 2006",
            "Mar 14, 2008",
            "Mar 2, 2012",
            "Feb 23, 2006",
            "Oct 15, 2003",
            "Feb 23, 2005",
            "Jun 7, 2010"
        ],
        [
            "Publication date",
            "Sep 7, 1999",
            "Oct 26, 1999",
            "Nov 23, 1999",
            "Dec 14, 1999",
            "Mar 7, 2000",
            "Jun 26, 2001",
            "Jul 9, 2002",
            "Jul 16, 2002",
            "Sep 30, 2003",
            "May 3, 2005",
            "Oct 10, 2006",
            "Apr 10, 2007",
            "May 8, 2007",
            "Feb 12, 2008",
            "Jan 13, 2009",
            "Feb 24, 2009",
            "Apr 7, 2009",
            "Apr 21, 2009",
            "Jun 16, 2009",
            "Jan 26, 2010",
            "Apr 6, 2010",
            "Apr 20, 2010",
            "Jun 29, 2010",
            "Jul 13, 2010",
            "Feb 8, 2011",
            "Apr 5, 2011",
            "May 31, 2011",
            "Oct 25, 2011",
            "Jan 24, 2012",
            "Mar 6, 2012",
            "Jul 10, 2012",
            "Sep 25, 2012",
            "Apr 9, 2013",
            "Oct 1, 2013",
            "Jul 29, 2014",
            "Aug 5, 2014",
            "Jan 6, 2005",
            "Jun 30, 2005",
            "Sep 30, 2010"
        ],
        [
            "Applicant",
            "Sun Microsystems, Inc.",
            "International Business Machines Corporation",
            "Sun Microsystems, Inc.",
            "Progress Software Corporation",
            "International Business Machines Corporation",
            "Micrografx, Inc.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Ricoh Company, Ltd.",
            "Ns Solutions Corporation",
            "Vitria Technology, Inc.",
            "International Business Machines Corporation",
            "Ncr Corp.",
            "Ciena Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Ricoh Company, Ltd.",
            "International Business Machines Corporation",
            "Ricoh Company, Ltd.",
            "Microsoft Corporation",
            "International Business Machines Corporation",
            "Ricoh Company, Ltd.",
            "Microsoft Corporation",
            "Ricoh Company, Ltd.",
            "Microsoft Corporation",
            "International Business Machines Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "International Business Machines Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Kanghoon Lee",
            "Bryant Jeffrey F.",
            "Imran Chaudhri"
        ],
        [
            "Title",
            "Method and apparatus for customizing a software component",
            "Method and apparatus for class version naming and mapping",
            "Method and apparatus for editing a software component",
            "Smart objects for development of object oriented software",
            "Object management system for digital libraries",
            "Method and system for transforming dynamic content for use on the internet",
            "Systems, methods and computer program products for identifying computer file characteristics that can hinder display via hand-held computing devices",
            "Framework for representation and manipulation of record oriented data",
            "Java printer",
            "Program generating support system, program generating method, storage medium and program",
            "Integrated business process modeling environment and models created thereby",
            "Bootstrapping technique for distributed object client systems",
            "Method and apparatus for an applet to display multiple windows",
            "Highly channelized port polling in a telecommunications switch",
            "Task queue management of virtual devices using a plurality of processors",
            "Virtual devices using a pluarlity of processors",
            "Asymmetric heterogeneous multi-threaded operating system",
            "Managing a plurality of processors as devices",
            "Processor dedicated code handling in a multi-processor environment",
            "Grouping processors and assigning shared memory space to a group in a heterogeneous computer environment",
            "Balancing computational load across a plurality of processors",
            "Java printer with a printer control interface in a form of a web page",
            "Loading software on a plurality of processors",
            "Image forming apparatus",
            "XML application framework",
            "Managing a plurality of processors as devices",
            "Controlling a configuration of an image forming apparatus",
            "XML application framework",
            "Controlling a configuration of an image forming apparatus using a Java application",
            "XML application framework",
            "Processor dedicated code handling in a multi-processor environment",
            "Transaction transforms",
            "Application description language",
            "Virtual devices using a plurality of processors",
            "XML application framework",
            "XML application framework",
            "Java printer",
            "Observation tool for signal processing components",
            "Method and apparatus for determining font attributes"
        ]
    ],
    "pageTitle": "Patent US5790855 - System, method and article of manufacture for type checking appropriateness ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5790855?dq=6650327",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 493019740,
    "recordOffset": 492971859,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98876=As shown in FIG. 13, text field 1202 has been made into the \"CENTIGRADE\" label 1202a above scrollbar 604b through use of the text field editor 1204. Label \"FAHRENHEIT\" 1302 has been generated in the same manner and positioned above scrollbar 1102 (not shown in FIG. 13)., 117017=It is rather important to note that the interconnections described above between objects on the logical view are subject to type and functionality checking in a dynamic manner when they are attempted. Thus, the connection in FIG. 16 that was made between the output port of is splitter 1402 and the input port of calculator 1502a is functionally permissible and was permitted to be made in a manner that was transparent to the user. Conversely, if an attempt had been made to connect the output port of splitter 1402 to the output port of calculator 1502a, that attempt would have been denied as functionally impermissible. In a similar manner, had an attempt been made to the output of calculator 1502a to the input of text label object 1304, that connection would have been denied since the input type (a value or number) was mistyped as an input to text label object 1304 which only accepts input of type char or a string of characters. This functional and type compatibility checking is performed by the VJDesktop code as set forth above., 88989=FIG. 11 illustrates the addition of a second vertical scrollbar that will be set to track the range of the Fahrenheit temperature scale. Note that the vertical scrollbar editor 1104 has been adjusted to set scrollbar 1102 to a maximum value of 212 (boiling point) and a minimum value of 32 (freezing point). Prior to being adjusted, scrollbar 1102 has a current value of 71 with only 10 units of its total range actually visible., 92228=FIG. 12 shows how VJ Tool is utilized to add text to scrollbars 604b and 1102 so that the function they perform or represent can be labeled and thereby identified to any user. First, the simple text field component 506 is invoked by clicking on its icon and dragging it onto the physical view 500. The text field representation 1202 can then be dropped at any desired location and, as desired, sized to match the element it will identify, in this case scrollbar 604b. The text field or label editor 1204 is then used to generate the actual text or scrollbar label., 90202=As shown in the flowchart of FIG. 11A, editor capability is added at block 1120 to each class template for which an editing capability is desired in component objects instantiated therefrom. An editing window, as indicated by block 1122 is defined as a method corresponding to the editor. The properties and their limits are also defined for each component editor as shown by block 1124. An editing window is opened by block 1126 when the component with which it is associated is dragged and dropped or instantiated for use., 113978=FIG. 15 shows the addition of a calculator object 1502. Calculator object 1502 is instantiated from calculator component 572 of the logical view palette when the mouse is clicked over the calculator icon and the resulting image is dragged into the logical view window. When calculator object 1502 is created, evaluator editor 1504 is popped up so that expressions to be evaluated by the calculator can be input thereto. In this particular example, the Fahrenheit to Centigrade conversion expression to be evaluated is entered and the calculator is thereby informed what its computational task will be., 107733=If the bicopy component is new, its two-way ports are initialized or set to zero in bock 1336. Once that has been done, the ports are polled in block 1338 to monitor connection attempts. Decision block 1340 returns control to block 1338 for continued polling if there were no connections made to any of bicopy's component ports. If a proper connection has been made, a connection sufficient to place a value on one of the bicopy component's ports, control is passed to block 1342 where the type and value of the connection is identified., 134568=FIG. 24 illustrates a hierarchical component creation customization in accordance with a preferred embodiment. The button 2400 which was originally in the logical desktop 2420 has been moved into the Container 1 folder 2410. The internal connectors 2430C and 2440C are represented in the Container 1 folder 2410 and refer back to the logical desktop ports 2440L and 2430L of the folder 2450 in the logical desktop 2420. The ports can be used to transfer information into and out of a folder 2410. One of ordinary skill in the art will readily recognize that other components could be added to the Container 1 folder 2410 to create a more complex hierarchical component which could even include nested and recursive hierarchical components., 107057=FIG. 13A illustrates a flowchart of the process by which the bicopy component 1308 shown in FIG. 13 functions. The act of dragging and dropping a new bicopy component onto the logical desktop 402 or of dropping an assembly from folder 542, which assembly contains a bicopy component, onto the logical view desktop 402 actually starts the bicopy component as called for in block 1330. A test is next made to see there is a saved, prior state for bicopy element 1308 that needs to be restored by decision block 1332. If restoration is needed, control is passed to block 1334 which obtains the necessary values and has the ports set accordingly in block 1344., 90746=After the user finishes editing the component's properties and clicks \"OK\", the editing window is closed and the property changes are accepted and displayed immediately in the appropriate view by block 1128. After property editing is completed, the editable components are monitored for a user action (usually a mouse click) which indicates that property re-editing is desired for a specific component, as per block 1130. When that occurs, block 1132 opens the editor widow 1104 again to permit component property changes to be made. Thereafter, control is returned to block 1128 and the user re-editing changes are accepted. Finally, monitoring of the editable components resumes as per block 1130., 130573=A flowchart of the collaboration process is illustrated in FIG. 19. When a new component is created as in block 1902, the user is asked by decision block 1904 if the new component should be collaborative. If not, the user and VJ Tool go off via block 1906 and do something else. If the user responds in the affirmative to the query of block 1904, the component properties are examined to determine if this specific component can be collaborated by decision block 1908. If collaboration isn't possible, control is passed to block 1910 which sends an appropriate message to the user and then waits for the user to make another request., 109116=Decision block 1346, which is advised of the initial connection by block 1342, checks for removal of the input value to bicopy component 1308 and returns control back to block 1344 if it has not been removed or to block 1336 for reinitialization if it has been removed., 122762=As described above, the VJ Tool provides a live development or authoring environment in which socialization among objects or components can occur immediately upon their creation or instantation without any wait to plan or test their integration. For example, as shown in FIG. 16, once the output of bicopy object 1308 was connected to text field representation 1604, the output value of scrollbar 1306 was displayed in the physical view 500. If this result is not what was desired, the user can change the connection or add another component on the fly without having to debug code or review a flowchart. Similarly, when the output of splitter 1404 is connected to the input of calculator 1502b and displayed via text field representation 1606, the user is able to make an immediate determination that the conversion calculations are correct and that the displayed arrangement is satisfactory. In other words, being able to make connections on the fly immediately proved or disproved the results obtained because VJ Tool creates a \"live\" environment wherein applet design creation and trial are integrated so that the result is then played out virtually simultaneously with creation. This is analogous to building a hardware prototype or test board by connecting, disconnecting and moving components around the board while the power is on|, 64350=Further explanation of the Java programming language, its characteristics and advantages is not deemed necessary. Java is now well-known and many articles and texts are available which describe the language in great detail. In addition, compilers and development kits are commercially available from several vendors including SunSoft Inc., Borland International, Inc. and Microsoft Corporation. Accordingly, for reasons of brevity and clarity, additional details of the Java language and the operation of the Run-Time Environment or the JIT compilers will not be discussed further in herein since this information can be readily obtained elsewhere. One appropriate source can be found in Gosling, Joy & Steele, The Java Language Specification (1996), the disclosure of which is hereby incorporated by reference. Another source for Java VM information is Sun Microsystems' Java Virtual Machine Specification, Release 1.0 Beta DRAFT (Aug. 21, 1995), the disclosure of which is also hereby incorporated by reference., 134106=When the folder is instantiated and its edit window 2310 pops up, as described above, the folder name and the number, location and type of ports can be selected or changed. This capability is reflected in block 2374. Finally, as shown by block 2376, the folder component waits on the user to indicate what other components, including other folders, should be placed within it. This procedure is described hereafter in connection with FIG. 24., 135327=FIG. 25 illustrates the completed physical view of a hierarchical component in accordance with a preferred embodiment. The sound button 2500 in the physical view 2520 is now inside the folder 2510 which can be used to simplify complex logic on the logical desktop 2530 and reduce screen clutter. This technique can be utilized to capture debugged components and component assemblies in a single representation of many components. Users can thus create their own components., 119701=Decision block 1626 sends control back to polling if the pending connection has not yet been made. If the connection is completed, control for the ports involved is passed to decision block 1628 which decides if the attempted complete connection between the ports involved is valid. The type of ports involved and their functional affinity for each other will be checked and verified. Connections directly between an input port on one component will not be allowed to an input port on another component nor will a direct connection between an output port on a first container to an output port on a second container. Also forbidden are connections between ports on the same component regardless of their type., 127834=The clients, 1808a, 1808b and 1808c, are typically connected across the Internet 1810 to an HTTP server 1802. The HTTP server 1802 can include many applications and applets and it often does, but for the sake of clarity there are only three applications, 1804a, 1804b and 1804c, and three applets, 1806a, 1806b and 1806c, shown. Application 1804c, designated for purposes of this explanation as the Java Server, is usually a daemon server, has full access to the underlying file system and can be used to communicate with related servers, not necessarily Java servers, on the Internet., 132397=FIG. 21 illustrates a screen with the logical and physical view preparing a hierarchical component in accordance with a preferred embodiment. A button 2120 has been instantiated and customized 2110 on the logical desktop 2114 and its physical representation 2100 is also reflected in the physical desktop 2112., 99186=It should be noted that several of the components described herein, vertical scrollbars 604a and 604b and text field 1202 label editor, are provided with their own editors, vertical scrollbar editor 604 and label editor 1204, which permits the predefined properties of the associated components to be directly and dynamically edited. Such editing takes place without the user having to exit VJ Tool or having to write any code to support the desired editorial changes., 99674=FIG. 13 also illustrates in logical view 402, representations of scrollbars, text and bicopy objects that will be used to functionally link scrollbars 604b and 1102. Objects 1306 and 1312 logically represent scroll bars 604b and 1102 while label objects 1304 and 1310 represent the labels 1202a and 1302 respectively. Bicopy is a backend component that is only found in the logical view palette. A bicopy object, such as 1308 and 1314, as implemented in accordance with a preferred embodiment of the present invention, will place whatever is input on one of its diamond shaped I/O pins 1308a, 1308b, 1308c or 1398d on the other I/O pins., 109405=FIG. 14 shows addition of splitters 1402 and 1404 in the logical view 402. Splitter objects 1402 and 1404 are used to connect I/O pins to components that are functionally involved in a defined relationship appearing in the logical view 402. Splitters are instantiated form the splitter palette component 558 of logical view 402 and are dragged and dropped to a suitable location on the logical view desktop. Splitter objects are formed pursuant to their implementing code (VJSplit) as follows:, 119117=Decision block 1622 is advised by block 1620 whether or not a connection to one of the ports has been initiated. If no attempt to initiate a connection has been made, polling continues. If a connection has been initiated, the type of port involved (input, output or bidirectional) and, if known, the type of variable expected (character, float, long integer, short integer, string, etc.) on that port are stored as per block 1624 with VJDesktop and control waits for completion of a connection for the involved port while polling continues for the remaining ports., 108290=Thus, if a connection has been made from a text field, a character string is placed on one of the bicopy component's ports and captured by the Bicopy component. Similarly, if an integer value, such as 32, isplaced placed on one of the bicopy component's ports, that type and value is also recognized and captured. Once the type and value of an input are known, the remaining ports are set to provide the same type and value as the input by block 1344. Thus, at this point, see FIG. 16, bicopy component 1308 would have its port 1308c set by the output of scrollbar representation 1306 to the current value (position) of the scrollbar. This means that ports 1308a, 1308b and 1308d, which act as output ports, will carry the output value of scrollbar 1306 until the input connection to port 1308c is changed., 129775=However, each time the collaborative arrangement is initialized, nothing is shared between the collaborated components unless the state of the last session was saved and reloaded at initialization into Spreadsheet Server 1802. Since the registration process builds a record in Server 1804c of which portions of which collaborated components are coupled, it is relatively straightforward for the Server to accumulate this information from a changed component, which utilizes a publish message to send it there and then republish or broadcast it to the other collaborated components to effect updating, thereby making it public. Thus, nothing is seen by any of the unchanged collaborated components until the Spreadsheet Server 1802 has relayed the changed information on to them., 118079=The port or netpin type verification works in the following functional manner. When a component or object pin is created by being dropped onto the logical view desktop 402, its presence there and the number and nature of its pins, if any, is logged, stored and tracked by the VJDesktop code. Specifically, the number and types of ports or netpins on the newly instantiated component or object is noted Once a component or object having pins is instantiated, VJDesktop tracks and stores the status of its ports by polling them periodically as depicted by block 1620 in FIG. 16A. The same is true for variables, the information for which is initially stored when a component that can pass, duplicate or manipulate a variable is instantiated., 115952=In this example, interconnections are made by mouse click, drag and drop operations as follows. The output of scrollbars 1306 and 1308 are connected to the bicopy objects 1308 and 1314 respectively. That value is passed from bicopy object 1308 to splitter 1402 and text field representation 1604 and from bicopy object 1314 to splitter 1404 and text field representation 1606. In addition, the output of splitter 1402 is coupled to the input of calculator 1502a while the output of splitter 1404 is coupled to the input of calculator 1502b. Finally, the outputs of calculators 1502a and 1502b are respectively connected to the inputs of splitters 1402 and 1404. Thus, when scrollbar 604b is moved to a new position, the value of that position is transmitted by the scrollbar object 1306 to bicopy object 1308 and from there to text field component representation 1604. This means that the text fields 1602 and 1603 both display the changing values for their associated scrollbars 604b and 1102 when either one of them is moved to a new position., 133050=FIG. 23 illustrates an edit screen for a folder component utilized to prepare a hierarchical component in accordance with a preferred embodiment. A Container 1 folder 2300 is instantiated in the logical desktop 2350 by dropping a folder component 2360 on the desktop. A customize or edit window 2310 pops up when the folder is instantiated. This edit window can be utilized to change the name of the folder and the number, location and type of active ports of the folder component. The Container 1 folder is logically represented by a window 2320 where the logic of the folder (hierarchial component) can be created on the fly by adding or deleting components in the window 2320. The button 2330 is also shown in the physical desktop 2340., 121788=FIG. 17 shows the final result of the coupled scrollbars with correct Fahrenheit and Centigrade temperatures shown in text fields 1602 and 1603, respectively. With both scrollbars at their minimum positions, the Centigrade scrollbar 604b position produces the value 0 in text field 1602. In similar fashion, scrollbar 1102 produces a value of 32 in text field 1603. If scrollbar 604b is pulled down to position 1702 where it has a value of 80, as will then be displayed in text field 1602, then scrollbar 1102, because of what are essentially feedback connections made in FIG. 16, will move to position 1704 which will cause text field 1603 to then display its corresponding value of 176 degrees. Because of the cross coupling described in connection with FIG. 16, moving scrollbar 1102 first to a position of 176 would cause scrollbar 604b to be positioned at the point that represents the value 80, which would be displayed in text field 1602. ##SPC6##, 132163=FIG. 20 illustrates a screen with the logical view in accordance with a preferred embodiment. A sound component 2000 has been instantiated on the logical view by dropping a sound icon onto the logical desktop 2010., 133809=As shown in FIG. 23A, a folder class with options for unidirectional and bidirectional ports and an editor is first created as depicted by block 2370. The user instantiates a folder component by dragging and dropping it onto the logical desktop 2350 as reflected by block 2372., 89774=Thus, when such edit capable components are instantiated in either the logical view 402 or the physical view 500, their built-in customizer or edit widow 1104 is invoked, see FIG. 11, and opens automatically. The editor appears in the view ready for use to change or customize the properties of the component, in this case scrollbar 604b, based on user interaction with the customizer or editing window 1104., 131226=If a new component can be collaborated, it is registered with a Java server as shown in function block 1912. The server, as indicated by block 1914, then builds an instance of the registering component in order to know which components it is responsible for. In addition, pursuant to block 1916, the server builds a record listing those portions, some or all, of the registered components which are linked or collaborated. Once that identity and designated linked portions of the components have been identified and recorded, the server changes the information in the collaborated portions when it receives information from a component as shown in block 1918 and broadcasts the changed information to the other collaborated components via block 1920., 75338=Logical view 402 is provided with palette containers 540 to 572 as follows: 540 is a select cursor button; 542 is a VJ folder or container; 544 is an adder; 546 is a bicopy component. The bicopy component acts as a multiplexor so that whatever is input on one pin of a bicopy element is output on its other pins. 548 is a test for equals; 550 is a constant (e.g. -1 or 3.1457 or \"abc\"); 552 is a random number generator; 554 is a counter; 556 is an URL opener; 558 is a splitter used to connect input/output pins to components that are either input or output elements; 560 is a two-dimensional grapher; 562 is a three-dimensional grapher; 564 is a delta three-dimensional grapher; 566 is an URL text viewer; 570 forwards input from any one of an element's input pins to an outpin pin thereof; 572 is a calculator; and 574 is a sound player. AWT is the Abstract Windowing Toolkit and contains the objects utilized for providing basic windowing functions in accordance with a preferred embodiment., 120430=In addition to checking that interport connections are valid, decision block 1628 also ascertains if the variable to be transmitted across the new connection is valid for both ports. By referring to the stored component and object port information, it can be determined, for example, that the variable at the output of calculator 1502a in FIG. 16 is mistyped as to the variable expected at the input of label 1304, a character or string. As a result, when that otherwise valid output to input connection is attempted, it would be prevented by decision block 1628 because of a variable type mismatch., 114599=FIG. 16 illustrates the interconnections of several objects to achieve the appropriate Centigrade/Fahrenheit relationship between scroll bars 604b and 1102. Building on to the arrangement depicted in FIG. 15, the user would add two simple text field objects 1602 and 1603 in physical view 500 by clicking on the simple text field icon 506 twice and then dragging and dropping each resultant text field object 1602 and 1603 so that each is located below and adjacent to the scrollbar it contains information for., 121049=When the attempted connection is invalid, an error message will be sent to the screen for the user to see and notification is sent to block 1620 to keep on polling for completion of the initiated, but not completed connection. If the attempted connection is valid, it is completed and also reflected on the display and the polling block 1620 is so advised. The stored port information is updated and the system waits for the next attempted connection. If a completed connection is ended, decision block 1634 is so advised by polling block 1620 and the stored type information for that connection is appropriately adjusted to reflect that the ports which were involved in the ended connection are now free for other use., 132727=FIG. 22 illustrates a screen with a connection made for playing a sound in accordance with a preferred embodiment. The button component 2200 is connected 2210 to the sound component 2220 in the logical desktop 2230. The Play Sound Button component 2240 is the physical view in the physical desktop 2250., 115130=When the text field objects are created, logical representations thereof, 1604 and 1606 respectively, are created by VJ Tool in the logical window. The appropriate interconnections between and amongst the several objects in the logical view 402 are then made and the results displayed in the text fields 1602 and 1604 as a direct function of where the scrollbars are actually located. Since scrollbar 604b is at its minimum position, which is zero, text field 1602 accurately displays that result. The display of the position results in a text field without the intervening need to write additional code to transform the scrollbar output, an integer or floating point value to an ASCII string. VJ Tool takes care of that task for the user and permits concentration on the problem being solved. ##SPC5##}",
    "textBeforeTable": "Patent Citations While the invention is described in terms of preferred embodiments in a specific system environment, those skilled in the art will recognize that the invention can be practiced, with modification, in other and different hardware and software environments within the spirit and scope of the appended claims. FIG. 25 illustrates the completed physical view of a hierarchical component in accordance with a preferred embodiment. The sound button 2500 in the physical view 2520 is now inside the folder 2510 which can be used to simplify complex logic on the logical desktop 2530 and reduce screen clutter. This technique can be utilized to capture debugged components and component assemblies in a single representation of many components. Users can thus create their own components. FIG. 24 illustrates a hierarchical component creation customization in accordance with a preferred embodiment. The button 2400 which was originally in the logical desktop 2420 has been moved into the Container 1 folder 2410. The internal connectors 2430C and 2440C are represented in the Container 1 folder 2410 and refer back to the logical desktop ports 2440L and 2430L of the folder 2450 in the logical desktop 2420. The ports can be used to transfer information into and out of a folder 2410. One of ordinary skill in the art will readily recognize that other components could be added to the Container 1 folder 2410 to create a more complex hierarchical component which could",
    "textAfterTable": "US6628413 * May 14, 1997 Sep 30, 2003 Ricoh Company, Ltd. Java printer US6889373 * Sep 6, 2001 May 3, 2005 Ns Solutions Corporation Program generating support system, program generating method, storage medium and program US7120896 * Oct 31, 2001 Oct 10, 2006 Vitria Technology, Inc. Integrated business process modeling environment and models created thereby US7203769 * Mar 14, 1997 Apr 10, 2007 International Business Machines Corporation Bootstrapping technique for distributed object client systems US7216300 Aug 22, 2001 May 8, 2007 Ncr Corp. Method and apparatus for an applet to display multiple windows US7330481 Aug 7, 2002 Feb 12, 2008 Ciena Corporation Highly channelized port polling in a telecommunications switch US7478390 Sep 25, 2003 Jan 13, 2009 International Business Machines Corporation Task queue management of virtual devices using a plurality of processors US7496917 Sep 25, 2003",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}