{
    "relation": [
        [
            "Door No.",
            "1,14",
            "2,13",
            "3-5 10-12",
            "6,9",
            "7-8"
        ],
        [
            "Property Name or Description",
            "House of the Duc d'Aumale",
            "House of Meleager",
            "House of the Centaur",
            "House of the Dioscuri",
            "House of C. N. Gaetroni Eutychi"
        ],
        [
            "Area (Sq.m)",
            "782",
            "1281",
            "1106",
            "1121",
            "430"
        ],
        [
            "No of Rooms",
            "25",
            "24",
            "30+",
            "20+",
            "14"
        ],
        [
            "Description, Decoration and Comments",
            "Hospitium. Irregular plan. No decoration, Plaster remnants. Finds of everyday household items. Rear entrance at No.14. Ruinous state.",
            "Plastered frontage. Irregular plan with peristyle offset to left of atrium. Atrium. Impluvium. Tablinum. Peristyle colonnaded on 4 sides. Oecus with hoecus corinthius. Third and fourth style decoration. Mosaic paving. Rear entrance at No.13.",
            "Plastered frontage. Combination of 2 houses both of standard atrium/garden plan. Duplication of: Atrium. Impluvium. Tablinum. Peristyle. Little surviving decoration. Plaster remnants. Rear entrance at Nos.10,11,12. Small room with external access at No.4.",
            "Plastered frontage. Standard atrium/garden plan. Columned atrium. Impluvium. Tablinum. Peristyle colonnaded on 3 sides with lararium on rear wall. Fourth style decoration. Stairs up. Rear entrance at No.9.",
            "Remnants of plaster on frontage. Fairly standard atrium/garden plan. Little decoration. Rear entrance at No.8. Linked to Nos.6 and 9. Semi-ruinous state."
        ]
    ],
    "pageTitle": "Reg VI, Ins 9 - AD79eruption",
    "title": "",
    "url": "https://sites.google.com/site/ad79eruption/pompeii/regio-vi/reg-vi-ins-9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894504499,
    "recordOffset": 894482206,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Jul 2015 08:17:14 GMT",
    "textBeforeTable": "Full List of Properties .....A. House of Meleager .....B. House of the Dioscuri ...,,Key: Reg VI, Ins 9 is limited to the north by the northern edge of Regio VI. It is bounded to the east by the Vico del Fauno, to the west by the Via di Mercurio and to the south by the Vico di Mercurio. The insula consists of five large domestic properties. The houses include the House of the Duc d'Aumale (a hospitium named in the duke's his honour after a visit in 1843), the House of the Centaur, the House of Meleager and the House of the Dioscuri. The last two are examined here in more detail. Plan of the Insula..",
    "textAfterTable": "Tour of the Insula To examine a featured building in more detail, select it from the above list. Where there is more than one property of interest in the insula, the buildings are arranged in order of reference number, which may not necessarily be the route chosen when actually visiting the site. Home .................... < . Previous Insula ......,,.,,..,........ Regio VI ......,,,.............. Next Insula . > ....................Glossary Subpages (2): House of Meleager House of the Dioscuri       Privacy Policy    Site by Peter and Michael Clements   Copyright:    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}