{
    "relation": [
        [
            "Date",
            "Aug 20, 1992",
            "Aug 20, 1992",
            "Jun 8, 1992",
            "Jun 8, 1992",
            "Feb 10, 1986",
            "Feb 10, 1986",
            "Mar 22, 1982",
            "Mar 22, 1982",
            "Jul 6, 1981",
            "Jul 6, 1981"
        ],
        [
            "Code",
            "AS",
            "AS02",
            "AS02",
            "AS",
            "AS02",
            "AS",
            "AS",
            "AS02",
            "AS",
            "AS02"
        ],
        [
            "Event",
            "Assignment",
            "Assignment of assignor's interest",
            "Assignment of assignor's interest",
            "Assignment",
            "Assignment of assignor's interest",
            "Assignment",
            "Assignment",
            "Assignment of assignor's interest",
            "Assignment",
            "Assignment of assignor's interest"
        ],
        [
            "Description",
            "Owner name: MAMA IRENE S SPECIALTY CANDIES, INC., WISCONSIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:STACY INTERNATIONAL INC.;REEL/FRAME:006223/0363 Effective date: 19920622",
            "Owner name: MAMA IRENE S SPECIALTY CANDIES, INC. A CORP. OF WI Effective date: 19920622 Owner name: STACY INTERNATIONAL INC. A CORP. OF ILLINOIS",
            "Owner name: MAMA IRENE S SPECIALTY CANDIES, INC. A WI CORP. 11 Effective date: 19920529 Owner name: STACEY INTERNATIONAL, INC. A CORP. OF IL",
            "Owner name: MAMA IRENE S SPECIALTY CANDIES, INC. A WI CORP., Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:STACEY INTERNATIONAL, INC. A CORP. OF IL;REEL/FRAME:006146/0733 Effective date: 19920529",
            "Owner name: KEEBLER COMPANY, A CORP. OF DE. Effective date: 19860129 Owner name: STACY INTERNATIONAL, INC., 2767 25TH STREET, BROAD",
            "Owner name: STACY INTERNATIONAL, INC., 2767 25TH STREET, BROAD Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:KEEBLER COMPANY, A CORP. OF DE.;REEL/FRAME:004510/0836 Effective date: 19860129",
            "Owner name: KEEBLER COMPANY, A CORP. OF DE. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:W & M SALES CORPORATION;REEL/FRAME:003954/0918 Effective date: 19820226 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:W & M SALES CORPORATION;REEL/FRAME:003954/0918 Owner name: KEEBLER COMPANY, A CORP. OF DE., DELAWARE",
            "Owner name: KEEBLER COMPANY, A CORP. OF DE. Effective date: 19820226 Owner name: W & M SALES CORPORATION",
            "Owner name: W & M SALES CORPORATION, A CORP.OF ILL. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:OMNIBUS EQUIPMENT;REEL/FRAME:003869/0637 Effective date: 19810418",
            "Owner name: OMNIBUS EQUIPMENT Effective date: 19810418 Owner name: W & M SALES CORPORATION, A CORP.OF ILL."
        ]
    ],
    "pageTitle": "Patent US3930043 - Method for making cotton candy - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3930043?dq=7,446,777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480707799,
    "recordOffset": 480680842,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9882=US. Patent Dec. 30, 1975 Sheet 2 of2 3,930,043, 8640=United States Patent Warning et al. Dec. 30, 1975 METHOD FOR MAKING COTTON CANDY 3,221,675 12/1965 Forkner 426/272 3,279,394 l/l966 Bowe H Inventors z f f 3,436,927 4/1969 Gruber 426/l7 x a armng, r., Schaumburg, both of Ill. S L h Primary Examinereon Bas ore {73] Asstgnee: Tec-Pak Corporatlon, Schiller Park, Assistant Examiner M Steve Alvo Ill. Attorney, Agent, or FirmEdmond T. Patnaude [22 Filed: July 19, I973 [2]] Appl. No.: 380,566 [57 ABSTRACT Spun sugar is collected in rotating collection pans [52] g7 from which it automatically feeds onto a conveyor belt [5|] Int Cl 2 A23? l/00 B29C 23/00 A2'3G 3/00 which carries it through a compacting and sizing unit A230 and then through a cutter and separator to provide [58] Fwd of Search 426/2 214 380 512 spaced apart portions of sugar candy. The strands are 5'7 '660 5 pulled upwardly from the pans onto a conveyor belt mounted at the side of the pans at a linear speed [56] References Cited slightly greater than the tangential speed at the periphf th UNITED STATES PATENTS cry 0 a pm 2,847,3ll 8/l958 Doumak et al. 426/516 X 4 Claims, 5 Drawing Figures 37 39 I7 I I8 46 l L a;, 9796=1\" I5 o a a U.S. Patent Dec. 30, 1975 Sheet 1 of2 3,930,043}",
    "textBeforeTable": "Patent Citations 4. A method according to claim 2 wherein another rotating head and collector pan is provided on the opposite side of said conveyor belt, and, joining said collected strands from said pans to form a bundle on said conveyor belt before they are carried to said compactor. 3. A method according to claim 2 wherein said pan is rotated at about six revolutions per minute. feeding sugar granuals to said head. 2. A method according to claim 1 wherein said step of extruding comprises heating said head to a temperature exceeding the melting point of sugar, and cutting the sized product into sections of predetermined length. carrying the collected strands on said conveyor through a compactor to size the collected strands to a predetermined height and width, and collecting said strands in a rotating pan in the center of which said head is disposed, pulling the collected strands upwardly from said pan onto a conveyor belt mounted at the side of said pan and traveling in a direction tangential to said pan at a linear speed slightly greater than the tangential speed at the periphery of said pan, l. A method of making cotton candy comprising the steps of extruding melted sugar through a plurality of apperturcs in a rotating head to provide continuous strands of sugar, What is claimed is: While",
    "textAfterTable": "Saccharide-based matrix US5407676 * Dec 24, 1992 Apr 18, 1995 Fuisz Technologies Ltd. Hydrophilic form of perfluoro compounds and a method of manufacture US5427804 * Mar 15, 1994 Jun 27, 1995 Fuisz Technologies Ltd. Low-fat edible proteins with maltodextrins and low-saturate oils US5427811 * Feb 4, 1994 Jun 27, 1995 Fuisz Technologies Ltd. Method and apparatus for spinning thermo-flow materials US5429836 * Jul 29, 1993 Jul 4, 1995 Fuisz Technologies Ltd. Saccharide-based matrix US5445769 * Jun 27, 1994 Aug 29, 1995 Fuisz Technologies Ltd. Spinner head for flash flow processing US5456932 * Apr 22, 1994 Oct 10, 1995 Fuisz Technologies Ltd. Method of converting a feedstock to a shearform product and product thereof US5458823 * Oct 28, 1994 Oct 17, 1995 Fuisz Technologies Ltd. Method and apparatus for spinning",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}