{
    "relation": [
        [
            "Date",
            "Feb 24, 1992",
            "Aug 9, 1994",
            "May 29, 1997",
            "Sep 17, 2001",
            "Jul 13, 2005",
            "May 19, 2009",
            "Dec 24, 2012",
            "Jul 17, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: BLACKLIDGE EMULSIONS, INC., MISSISSIPPI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:BLACKLIDGE, RONALD W.;RAYBURN, TIMOTHY D.;REEL/FRAME:006030/0754 Effective date: 19920218",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: REGIONS BANK, GEORGIA Free format text: SECURITY AGREEMENT;ASSIGNOR:BLACKLIDGE EMULSIONS, INC.;REEL/FRAME:022703/0471 Effective date: 20090514",
            "Owner name: BLACKLIDGE EMULSIONS, INC., MISSISSIPPI Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:REGIONS BANK;REEL/FRAME:029524/0524 Effective date: 20121221",
            "Owner name: BEI IP, LLC, MISSISSIPPI Free format text: SECURITY INTEREST;ASSIGNOR:BLACKLIDGE EMULSIONS, INC.;REEL/FRAME:033347/0466 Effective date: 20131202 Owner name: BEI IP, LLC, MISSISSIPPI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:BLACKLIDGE EMULSIONS, INC.;REEL/FRAME:033332/0549 Effective date: 20131202"
        ]
    ],
    "pageTitle": "Patent US5296264 - Method for sealing and priming prepared substrates for roadways - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5296264?dq=4316055",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480029007,
    "recordOffset": 480004934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{44472=The asphalt component of the emulsion preferably includes asphalts of the grades AC-5 to AC-40, and may include asphalt grades in excess of AC-40 or less than AC-5, if those asphalts have an actual or adjusted viscosity suitable for use in the method of the invention. The AC-5 to AC-40 grade asphalts typically have viscosities at 60 degrees centigrade (140 degrees Fahrenheit) from about 400 poise to about 4800 poise, as determined pursuant to AASHTO Procedure 201-90 and 202-90, which correspond to ASTM D2170-81 and ASTM D2171-81, respectively., 37459=When the final emulsion is prepared with the preferred concentrate, the contemplated ratio of concentrate to added water in the final emulsion is from about 1:1 to 1:5. Based on present state regulations, the preferred ratio of concentrate to water is from about 1:3 to 1:5, and depending on soil conditions, the preferred ratio is 1:3. If the first asphalt and oil phase exceed the maximums or fall below the minimum amounts as set forth above, the stability of the concentrate, and of the final diluted emulsion as applied to the base course, may be threatened. The components of the concentrate or the final emulsion may clump and separate during storage, and thus become unusable or require expensive and time consuming remixing., 41401=The specific ratio of first asphalt and oil phase to second water phase chosen for a particular application will depend on factors such as the composition of the base course, the number of planned applications, the desired cure time and state regulations. For example, where the base course is of an open grade and granular composition, the preferred concentrate is mixed at a ratio of about 1:3 to 1:5 of concentrate and water to obtain sufficient penetration of the course by the sealer and primer to more effectively bind the loose upper soil surface of the course together., 41998=When the base course is non-porous, such those made of clay soils, the ratio of concentrate to water is preferably from about 1:1 to 1:3. Such soils are unlikely to permit the penetration of the surface of the course and increasing the amount of water diluent will typically encourage undesirable pooling of the emulsion on the treated surface. In the preferred method of the invention, deep penetration of the base course is avoided to provide a more effective sealer and primer on the exposed surface of the course. Similarly, in applications where quick curing is desirable, dilution ratios of first phase to second phase of about 1:5 are preferred. These greater dilution ratios produce an emulsion that is relatively thin and cures relatively quickly., 32627=The present invention provides a method of sealing and priming a prepared substrate, such as a base or sub-base for a roadway, comprising the application of an amount of an emulsion consisting essentially of a first phase of a combination of resinous petroleum oil and an asphalt, a second phase of water, and suitable emulsifiers and stabilizers, effective to seal and prime the substrate. The first phase comprises from about 0.3% to 21% asphalt and from about 3.3% to about 34% resinous oil based on the total weight of the emulsion. The second phase is of water which provides from about 62.5% to about 91.5% of the total weight of the emulsion. The emulsifiers and stabilizers are from about less than 0.16% to about 2.5% of the total weight of the emulsion. The contemplated ratios of the first asphalt and resinous oil phase to the second water phase in the total emulsion applied to the base course are from about a 1:1.8 to 1:11 ratio in the total emulsion., 38615=From the above, it can be seen that the contemplated weight percentage in each component of the final emulsion, prepared with the preferred concentrate diluted at concentrate to water ratios of about 1:1, about 1:5 and about 1:3, are as follows:}",
    "textBeforeTable": "Patent Citations While the invention has been described by reference to certain specific descriptions and examples which illustrate preferred materials and conditions it is understood that the invention is not limited thereto. Rather, all alternatives, modifications and equivalents within the scope and spirit of the invention so described are considered to be within the scope of the appended claims. Thus, the method of the invention produces a durable and dependable sealer coating and primer for substrates such as roadway base courses that is unexpectedly superior to the prior art sealers. The materials used and the elimination of expensive heating equipment and procedures makes this method cost efficient and practical for use in many applications, including extensive road construction projects. The invention may also be used where similar concerns relating to the sealing of substrates of soils or other such materials are present, or for applications in road building where fluxing of a pavement material to other substrates, such as old pavement surfaces, is required. For example 5, the base course was composed of a close grade limestone soil and the emulsion achieved no observable penetration of the surface of the base course. The sealer and primer was exposed for approximately a week under very light traffic conditions. During the observation period, there were no observable defects or problems with the coating. A control of emulsified asphalt primer (SS-1 Asphalt Emulsion) was also applied to surfaces adjacent the test",
    "textAfterTable": "US4433084 * Sep 28, 1982 Feb 21, 1984 K. E. Mcconnaughay, Inc. High-float, rapid-setting emulsion US4561905 * Jul 20, 1984 Dec 31, 1985 Paul A. Kittle Method for suppressing coal dust US4571116 * Aug 5, 1983 Feb 18, 1986 Owens-Corning Fiberglas Corporation Method for suppressing dust on dirt roads and the like US4878950 * Apr 29, 1988 Nov 7, 1989 Exxon Chemical Patents Inc. Bitumen composition US5089052 * Aug 10, 1989 Feb 18, 1992 Ludwig Allen C Emulsification of rock asphalt * Cited by examiner Non-Patent Citations Reference 1 * Brochure from: Dust Allayers, Inc., 270 Park Avenue East, Mansfield, Ohio 44902. (mo. & yr. unavailable). 2 Chemical Abstract #64742-04-7. 3",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}