{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,096 topics 2,123,698 replies",
            "85,550 topics 1,153,587 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,757 replies",
            "5,996 topics 75,810 replies",
            "50,538 topics 466,152 replies",
            "22,766 topics 196,283 replies",
            "4,270 topics 60,436 replies",
            "1,128 topics 8,214 replies",
            "3,598 topics 115,154 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By Osho 7 minutes ago",
            "GTA IV Theory. [SPOILERS] By Son of Zeus A minute ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Ultimate 100% Save File... By Militia 5 hours ago",
            "Whats your favorite/hated r... By Kristian. An hour ago",
            "New Model Army By mikey_1982 7 minutes ago",
            "Which Vehicle Do You Prefer? By GTAGuy1995 3 hours ago",
            "Grand Theft Auto III Chain... By Kristian. An hour ago",
            "Anybody has a 100 % savegame? By Cerium 20 hours ago",
            "Best GTA Protagonist By VikDarkbomb 2 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=1&t=560084&p=1062620477",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986451.45/warc/CC-MAIN-20150728002306-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106402795,
    "recordOffset": 106377834,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126409=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 20971=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 12582=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9355=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16608=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47771=Google, Bing, VikDarkbomb, TarHeelJohn, Yahoo, Los Santos citizen, jsmooveboy, iNero, Max Payne, GTA4LIFE9000, Kai650, carbon360, MarshallRawR, Epic., Cautious, -Velox, Fakeplastictrees, GTAandStuff, ashank975, jerryinohio78, Miro, PsYcHoZiZm, denis1379, Google Mobile, alex3, Retired Mafia, Lets Go For A Joyride, Ethan_21, Acetaminophen, Rytherik, CBH, Osho, TH3 S3LL0UT, jp9865, Kahkenbols, silenthunterdgm, Im Ricky I Win, SalvatoreCJ1903, W2B, r.lorenzo13, Stoney0503, bixlas13, toxluv, camo_boy67, feckyerlife, vnctmrn, Hit by Lightning, L1TTLE-DAVE, lol232, s2n vaniish, meta187, Ronzilla187, Sentinel Driver, SSJEavan747, Ieech, Daniel MCH, emelen, ChaosIKI, jBhIpS, JoeM, Jlogano22, Raxdiam, Lonely_Screwdriver, DaltonWilliams123, Bluntnation94, BeckermannDewitt, Cico555, paperbagdude, ChOcOsKiZo, Zonnex, Mirage Las Vegas, Bob_Dole, Ak47clower, Valanga, elhazard1790000, kKatie, A Paradox from 94, bluefoxx, Eqaulo, Wheatley, darthYENIK, ~Joseph~, BadKarma1699, TJGM, dice, evinaz, CaptainMental, Gummy , machine4578, epoxi, Zook, Touge Spirit Leader, raburs, fofofofofofofofo, Shadowfennekin, HipsterHillbilly, Malcot, frodzet, SuperGTFan, ashbashbluesfan, WWEMichaelB, FireBallz21, AllNighter1, SeekingAsylum, LeopardGecko, Red Lynx 23, Biker647, Daemian, DusterGoliath, Johnny Playert, sosak47, slendifiedman, knightsgarage, Electrogypsy, terminalnapkin, CreatorCreatureSpore, J-B, Mastah, Cysiek, TG_Stig, RocknRumble, D3ADSH0T, Fleckz, Svip, A-Wax8, whywontyoulisten, SidSid, Jon3s, zeffer604, Junko Enoshima, 11john11, gil62291, Holo fenix, Black_MiD, Bombshock, AdjectivePants, m2roadwarrior, Raz33R, Nipplestroke, MePlayingGTA, TiberiusMcQueen, A_Glorious_Spoon, AnthMUFC-Champs, PretendWereDead, DJS, Atrocityl87, Crubbiestimp42, Imb44tu, Stoneman420, MetroBaller, Valtiel150, MaeSengE, JuanG12, Fox2Quick, Craank_AG, ChickenAndBeer, reform, Itzreality, MotelGuy, Slam_Jones, Bosnian Studios, XBOXmightyproducer1, Dern Sure, Commissioner Monk, Jujutsuka, xTOMMYTROJANx, -RONIN-, XB36Hazard, Fuzzknuckles, Tilley, Artful., Captain Sensib1e, Hello7734, A8ul99, reaper0322, REXX93, lexustt, Remix1994PL, jacka, monkb4skunk, Silent, stonedpimpso, CM-Punk, mikey_1982, MrAbbeel, jdwarfer, incognito32, Djeli, Cuesta, Failure, Flesk99, Nightmare3883, Dirty.Hairy, Drunkmoons, Majestic81, Fievel23, PF Spray, silverharbinger, Ivan1997GTA, thafablifee46, WinkingSkeever6, Choco Taco, Jeansowaty, DentureDynamite, BoeserBengel83, p-s-3x, fizzyfaze, x_FRoe__, Andreaz1, GTA_Matt24, pg1313, ChrissyBoi87, Turbocharger, AaronMcG95, direstraits, southparkmayor, psymin, johnson., SuperHolySheep, The_Riddler, kulomet333, Lc gta, Nutduster, deadx23, Mona Sax, Ac3snip3r12345, CeltHD, gizmo, DaveGrimes96, dan bull, BoDuken, Zondar, WhitTe_MamBa, Braindawg, Real_Badgirl, grunsker, Mockingbae, Arms Dealer, Nicinator16, shmok2, miclin, dairyworker, RobinVerhulstZ, WestsideOutlaw187, LAmike1, Krystofer, Reid505, Semaj 2JZ♢, TovarishTony, ~TKP~, dr0yed, SelwynGoodman, XCalinX, Netman005, Prywatne, Saintdestroyer, hitman774, SuzukiBlaze, xink, Joekill95, JRC99, Honch777, huckmonkey, Jwolf0531, CartmanKusanagi, Heists, Fozzie_420, Baggy Men Leopard Pant, Bitter Destructo, AiKiXeN, RedDagger, WHAT!?, StepNaza, Quejki, RandomCholo, AztecaEh, SeanOfTheDeadUK, Smooth Longsack, Phangled5, Rekia87, CMCSAVAGE, mudajama, TheTechPoTaToCHIP, PursuitForceS, Enzof1993, Misunderstood, CMGreger, Bartleby, fjj8, AtchooMatchew, DavidTheThird, Cracka.Brew, xXTwisted DevilXx, CReaper210, Rusty Balls, statistic, MatthewH, kylepick6, 14300=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18767=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By paperbagdude The Paleto Bay Mayors Offic... 613,507 replies 15,191 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By Captain Sensib1e Is The Savage Worth It? 2,279,154 replies 113,215 topics This is a general discussion forum for Grand Theft Auto Online.",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,442 topics 416,562 replies General Modding Discussion By CRBASF23 20 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles, Textures,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}