{
    "relation": [
        [
            "Citing Patent",
            "US6458112 *",
            "US6491674 *",
            "US6547773 *",
            "US6632208 *",
            "US7063689 *",
            "US7341579 *",
            "US20020068917 *"
        ],
        [
            "Filing date",
            "Dec 5, 1997",
            "Nov 28, 2000",
            "Jun 1, 2001",
            "Jul 21, 1999",
            "Dec 3, 2001",
            "Jul 7, 2005",
            "Dec 3, 2001"
        ],
        [
            "Publication date",
            "Oct 1, 2002",
            "Dec 10, 2002",
            "Apr 15, 2003",
            "Oct 14, 2003",
            "Jun 20, 2006",
            "Mar 11, 2008",
            "Jun 6, 2002"
        ],
        [
            "Applicant",
            "The Procter & Gamble Company",
            "Mcneil-Ppc, Inc.",
            "The Procter & Gamble Company",
            "Uni-Charm Corporation",
            "Kimberly-Clark Worldwide, Inc.",
            "Uni-Charm Corporation",
            "Kimberly-Clark Worldwide, Inc."
        ],
        [
            "Title",
            "Compound sanitary napkin having flaps and zone of extensibility",
            "Sanitary napkin having conformable side flaps",
            "Disposable diaper having integral cuffs and side panels",
            "Sanitary napkin with reinforced wings",
            "Sanitary napkin with garment attachment panels",
            "Sanitary napkin",
            "Sanitary napkin with garment attachment panels"
        ]
    ],
    "pageTitle": "Patent US6328722 - Absorbent article having pleated flaps - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6328722?dq=5,241,671",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00202-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468585331,
    "recordOffset": 468542106,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{83972=The flaps 24 can be associated with the main body portion 22 in a number of different manners. Many of the different ways a component (such as the flaps 24) can be “joined to” or “associated with”, etc. another component which are set forth in the definitions of these terms contained in U.S. Pat. No. 5,007,906 entitled “Decoupled Sanitary Napkin” which issued to Osborn, et al. on Apr. 16, 1991. When the flaps comprise separate elements, they can be Joined to the main body portion 22 by any techniques known to those skilled in the art. Such techniques include, but are not limited to adhesives, heat and/or pressure, ultrasonics, etc., 73501=In one alternative emiodiment of the sanitary napkin 20 (typically in which the topsheet 40 overlays only the main body portion 22 and does not extend out to form the top surface of the flaps), the backsheet 42 may be comprised of two layers. In such a case, the backsheet 42 may comprise a first layer of lofted material disposed on the core-facing side 42 a of the backsheet. The purpose of the first layer is to provide a comfortable, non-irritating surface against the body of the wearer. The lofted layer may be comprised of any suitable material, such as a nonwoven material. Preferably, the lofted layer comprises a hydrophobic nonwoven material. The second layer may be disposed on the garment side 42 b of the backsheet 42, and may comprise a fluid impervious film. A low density polyethylene material about 0.01 to about 0.05 millimeters in thickness, preferably about 0.02 millimeters in thickness, has been found to work well as this second layer. A polyethylene film, such as is sold by the Ethyl Corporation, Visqueen Division, under model XP-39385 has been found particularly well suited for this second layer. The backsheet 42 may also be made of a soft, cloth-like material which is hydrophobic relative to the topsheet 40. A polyester or polyolefinic fiber backsheet 42 has been found to work well. A particularly preferred soft, cloth-like backsheet 42 material is a laminate of a polyester nonwoven material and a film such as described in U.S. Pat. No. 4,476,180 issued to Wnuk on October 9, 1984., 79441=While a preferred sanitary napkin embodiment of the present invention has been described, numerous other sanitary napkin embodiments having flaps are available and are disclosed in the literature. These could be provided with the zones of differential extensibility of the present invention. In particular, sanitary napkins having flaps are disclosed in U.S. patent application Ser. No. 07/707,233 entitled “Sanitary Napkin Having Laterally Extensible Means for Attachment to the Undergarment of the Wearer”, filed May 21, 1991 in the name of Osborn, et al., U.S. Pat. No. 5,009,653 and 4,950,264, both entitled “Thin, Flexible Sanitary Napkin” which issued to Osborn on Apr. 239 1991 and Aug. 21, 1990, respectively, U.S. Pat. No. 4,940,462, entitled “Sanitary Napkin With Expandable Flaps” which Issued to Salerno on Jul. 10, 1990, U.S. Pat. No. 4,917,697 entitled “Sanitary Napkin Having Flaps and Stress Relief Means” which issued to Osborn, III, et al. on Apr. 17, 1990, U.S. Pat. No. 4,911,701, entitled “Sanitary Napkin Having Elastic Shaping Means” which issued to Mavinkurve on Mar. 27, 1990, U.S. Pat. No. 4,900,320, entitled “Sanitary Napkin With Panty Gathering Flaps” which issued to McCoy on Feb. 13, 1990, U.S. Pat. No. 4,687,478, entitled “Shaped Sanitary Napkin With Flaps”, which issued to Van Tilburg on Aug. 18, 1987 U.S. Pat. No. 4,608,047, entitled “Sanitary Napkin Attachment Means”, which issued to Mattingly on Aug. 26, 1986, U.S. Pat. No. 4,589,876, entitled “Sanitary Napkin”, which issued to Van Tilburg on May 20, 1986, U.S. Pat. No. 4,285,343, entitled “Sanitary Napkin”, which issued to McNair on August 25, 1981, U.S. Pat. No. 3,397,697, entitled “Disposable Sanitary Shield For Undergarments”, which issued to Rickard on Aug. 20, 1968, and U.S. Pat. No. 2,787,241, entitled “Sanitary Napkin”, which issued to Clark on Apr. 2, 1957., 72183=A suitable laminate is the superabsorbent laminate WATER-LOCK L-535 available from the Grain Processing Corporation of Muscatine, Iowa (WATER-LOCK registered TN by Grain Processing Corporation). Such superabsorbent laminates are disclosed in U.S. Pat. No. 4,467,012, entitled “Composition For Absorbent Film And Method Of Preparation”, which issued to Pedersen et al. on Aug. 21, 1984, and U.S. Pat. No. 4,260,443, entitled “Laminated Absorbent Process”, which issued to Lindsay et al. on Apr. 7, 1981., 35412=This is a continuation of application Ser. No. 08/708,437, filed on Sep. 5, 1996 (now U.S. Pat. No. 5,704,930); which is a continuation of application Ser. No. 08/253,001, filed on Jun. 2, 1994 (now U.S. Pat. No. 5,620,430); which is a division of application Ser. No. 08/073,256, filed on Jun. 7, 1993 (now U.S. Pat. No. 5,389,094); which was a continuation of application Ser. No. 07/769,891 filed on Oct. 1, 1991, now abandoned., 65444=A particularly preferred topsheet 40 for use in such an embodiment is one which is made in accordance with U.S. Pat. No. 4,463,045 and ring rolled to provide it with a degree of longitudinal extensibility. Suitable processes for ring rolling or “pre-corrugating” are described in U.S. Pat. No. 4,107,364 issued to Sisson on Aug. 15, 1978, U.S. Pat. No. 4,834,741 issued to Sabee on May 30, 1989 and in co-pending, commonly assigned U.S. patent application Ser. No. 07/662,536 entitled “Improved Method And Apparatus For Incrementally Stretching A Zero Strain Stretch Laminate Web To Impart Elasticity Thereto” filed by Gerald M. Weber et al. on Feb. 28, 1991, U.S. patent application Ser. No. 07/662,537 entitled “Improved Method and Apparatus For Incrementally Stretching Zero Strain Stretch Laminate Web In A Non-Uniform Manner To Impart A Varying Degree of Elasticity Thereto” filed by Kenneth B. Buell et al. on Feb. 28, 1991, and U.S. patent application Ser. No. 07/6629543 entitled “Improved Method And Apparatus For Sequentially Stretching Zero Strain Stretch Laminate Web To” Impart Elasticity Thereto Without Rupturing The Webs filed by Gerald M. Weber et al. on Feb. 28, 1991. The fold lines in the corrugations of the topsheet should run in the transverse direction so the topsheet is longitudinally extensible., 37466=Sanitary napkins having flaps of the various types are disclosed in U.S. Pat. No. 4,687,478, entitled “Shaped Sanitary Napkin With Flaps”, which issued to Van Tilburg on Aug. 18, 1987, U.S. Pat. No. 4,608,047, entitled “Sanitary Napkin Attachment Means”, which issued to Mattingly on Aug. 26, 1986 U.S. Pat. No. 4,589,876, entitled “Sanitary Napkin”, which issued to Van Tilburg on May 20, 1986, U.S. Pat. No. 4,285,343, entitled “Sanitary Napkin”, which issued to McNair on Aug. 25, 1981, U.S. Pat. No. 3,397,697, entitled “Disposable Sanitary Shield For Undergarments”, which issued to Rickard on Aug. 20, 1968, and U.S. Pat. No. 2,787,271, entitled “Sanitary Napkins”, which issued to Clark on Apr. 2, 1957., 78511=The fasteners used with the present invention are not limited to adhesive attachment means. Any type of fastener used in the art can be used for such purpose. For example, the sanitary napkin 20 could be secured to the wearer's undergarment by the fastener described in U.S. Pat. No. 4,946,527 entitled “Pressure-Sensitive Adhesive Fastener and Method of Making the Same” issued to Battrell on Aug. 7, 1990. For simplicity, however, the fasteners will be described in terms of adhesive attachment means., 118114=FIG. 8A also shows that the curved juncture 30 only needs to be curved concave inward in the central region 104 of the sanitary napkin. (The same is true for virtually all of the curved Juncture embodiments described herein.) The curved juncture 30 can be in any suitable configuration in the end regions of the sanitary napkin. For Instance, the juncture 30 can be straight, or (as shown in FIG. 8A) curved convex outward in the end regions 100 and 102. (The terms “central region” and “end regions” are defined in U.S. Pat. No. 4,690,680 issued to Higgins on Sep. 1, 1987.), 85358=It is also not necessary that the flaps 24 extend from (or be joined along) the longitudinal edges 22 a of the main body portion 22. The flaps 24 can Joined inward (or “inboard”) from the longitudinal edges 22 a toward the longitudinal centerline such as is shown in U.S. Pat. No. 4,900,320 issued to McCoy on Feb. 13, 1990. The flaps 24 can, thus, each be Joined to the main body portion 22 along the principal longitudinal centerline l, or along the longitudinal edges 22 a of the main body portion 22, or at any place between the principal longitudinal centerline l and the longitudinal edges 22 a of the main body portion 22. The flaps 24 will, of course, generally be on opposite sides of the principal longitudinal centerline l., 63827=Suitable formed films are described in U.S. Pat. No. 3,929,135, entitled “Absorptive Structure Having Tapered Capillaries”, which issued to Thompson on Dec. 30, 1975, U.S. Pat. No. 4,324,426, entitled “Disposable Absorbent Article Having A Stain-Resistant Topsheet”, which issued to Maullane and Smith on Apr. 13, 1982, U.S. Pat. No. 4,342,314, entitled “Resilient Plastic Web Exhibiting Fiber-Like Properties”, which issued to Radel and Thompson on Aug. 3, 1982, and U.S. Pat. No. 4,463,045, entitled “Macroscopically Expanded Three-Dimensional Plastic Web Exhibiting Non-Glossy Visible Surface and Cloth-Like Tactile Impression”, which issued to Ahr, Louis, Mullane, and Ouellette on Jul. 31, 1984. Formed films are preferred for topsheet 40 because they are pervious to liquids and yet non-absorbent. Thus, the surface of the formed file which is in contact with the body remains dry and is more comfortable to the wearer., 81325=Suitable absorbent articles in the form of pantiliners are disclosed in U.S. Pat. No. 4,738,676 entitled “Pantiliner” issued to Osborn on Apr. 19, 1988. Suitable absorbent articles, at least some of which are in the form of adult incontinence products, are described in U.S. patent application Ser. No. 07/637,571 entitled “Absorbent Article Having Rapid Acquiring Wrapped Multiple Layer Absorbent Body” filed by Barry R. Feist, et al. on Jan. 3, 1991., 39833=A number of variations on the types of flaps described above have been presented in an attempt to solve various problems. U.S. Pat. No. 4,900,320 issued to McCoy on Feb. 13, 1990, discloses a sanitary napkin having flaps affixed at points inward from the longitudinal edge of the napkin. U.S. Pat. No. 4,911,701 issued to Mavinkurve on Mar. 27, 1990, discloses a sanitary napkin having elastic means for providing greater convex shape to the body-facing portion of the central absorbent and for enabling adhesive-free placement of the flaps of the napkin. U.S. Pat. No. 4,940,462 issued to Salerno on Jul. 10, 1990, discloses a sanitary napkin with longitudinally expandable flaps. A sanitary napkin having flaps with stress relief means in the form of a notch or a slit is described in U.S. Pat. No. 4,917,697 which issued to Osborn, III, et al. on Apr. 17, 1990. Although this latter sanitary napkin works quite well, the search for sanitary napkins having improved flaps has continued., 66793=Such a topsheet is described In greater detail in the following patent applications which were filed on Jun. 23, 1991: U.S. patent application Ser. No. 07/734,404 entitled “Absorbent Articles, Especially Catamenials, Having Improved Fluid Directionality, Comfort and Fit” filed in the names of Thompson, et al.; U.S. patent application Ser. No. 07/734,392 entitled “Fluid Handling Structure for Use in Absorbent Articles” filed in the names of Thompson, et al.; and, U.S. patent application Ser. No. 07/734,405 entitled “Absorbent Core for Use in Catamenial Products” filed in the names of Buenger, et al. These patent applications may be referred to collectively as the “Capillary Channel Fiber” patent applications.}",
    "textBeforeTable": "Patent Citations While particular embodiments of the present invention have been illustrated and described, it would be obvious to those skilled in the art that various other changes and modifications can be made without departing from the spirit and scope of the invention. Thus, the present invention provides a sanitary napkin having flaps and zones of differential extensibility to provide an improved stress relief means for relieving the stresses that develop in the flaps when the flaps are folded down and under a wearer's undergarment. In still other alternative embodiments, the sanitary napkin could be provided with additional components. For instance, the sanitary napkin could be provided with the wet-laid tissue and/or the liquid permeable wipe acquisition sheet described in greater detail in U.S. Pat. No. 5,009,653 issued to Osborn. In addition, such sanitary napkins could be provided with additional types of stress relief means such as those described in U.S. Pat. No. 4,917,697 at various locations around the periphery of the sanitary napkin. The barrier 98 may be provided on most of the embodiments described herein. (The barrier may also be provided on other sanitary napkin embodiments. For instance, the flaps of the sanitary napkin 20 shown are completely extensible. In addition, the sanitary napkin could even be provided with such a barrier 98 if it did not have flaps 24.) The barrier 98 may be constructed in any suitable manner. FIG. 16 shows one preferred construction",
    "textAfterTable": "US3885568 Jul 12, 1973 May 27, 1975 Charles H Schaar Expandable article US3924626 Dec 8, 1972 Dec 9, 1975 Int Paper Co Rectangular disposable diaper having a contoured absorbent pad US3929134 Aug 29, 1974 Dec 30, 1975 Colgate Palmolive Co Absorbent article and method US3938523 Oct 17, 1974 Feb 17, 1976 Scott Paper Company Prefolded and packaged disposable diaper US3999548 Dec 29, 1975 Dec 28, 1976 Colgate-Palmolive Company Disposable diaper having fluid trap US4094319 Nov 1, 1976 Jun 13, 1978 Joa Curt G Sanitary pad with multiple end folds US4166464 May 13, 1977 Sep 4, 1979 Johnson & Johnson Absorbent dressing US4285343 Oct 16, 1979 Aug 25, 1981 Mcnair Rosetta M Sanitary napkin US4321924 May 12, 1980 Mar 30, 1982 The Procter & Gamble Company Bordered disposable absorbent article US4324246",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}