{
    "relation": [
        [
            "Date",
            "Aug 18, 2006",
            "Jun 4, 2010",
            "Dec 14, 2010",
            "Mar 18, 2013",
            "Dec 17, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: ALCOHOL MONITORING SYSTEMS, INC., COLORADO Free format text: MERGER;ASSIGNOR:ALCOHOL MONITORING SYSTEMS, LLC;REEL/FRAME:018132/0295 Effective date: 20040107",
            "Owner name: ALCOHOL MONITORING SYSTEMS, INC.,COLORADO Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE CORRECT SERIAL NUMBERS 11441686, 11441692, AND 11441694 PREVIOUSLY RECORDED ON REEL 018132 FRAME 0295. ASSIGNOR(S) HEREBY CONFIRMS THE CERTIFICATE OF MERGER;ASSIGNOR:ALCOHOL MONITORING SYSTEMS, LLC;REEL/FRAME:024483/0611 Effective date: 20040107 Owner name: ALCOHOL MONITORING SYSTEMS, INC., COLORADO Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE CORRECT SERIAL NUMBERS 11441686, 11441692, AND 11441694 PREVIOUSLY RECORDED ON REEL 018132 FRAME 0295. ASSIGNOR(S) HEREBY CONFIRMS THE CERTIFICATE OF MERGER;ASSIGNOR:ALCOHOL MONITORING SYSTEMS, LLC;REEL/FRAME:024483/0611 Effective date: 20040107",
            "",
            "Year of fee payment: 4",
            "Owner name: U.S. BANK NATIONAL ASSOCIATION, AS ADMINISTRATIVE Free format text: SECURITY INTEREST;ASSIGNOR:ALCOHOL MONITORING SYSTEMS, INC.;REEL/FRAME:034529/0616 Effective date: 20141216"
        ]
    ],
    "pageTitle": "Patent US20060202837 - Method and apparatus for remote blood alcohol monitoring - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20060202837?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481589579,
    "recordOffset": 481549357,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59442=This application is a divisional application of application Ser. No. 10/441,940, filed on May 19, 2005, titled “Method And Apparatus For Remote Blood Alcohol Monitoring” which is incorporated herein by reference in its entirety, and this application is related to a co-pending patent application Ser. No. 10/441,960, filed on May 19, 2005, by Hawthorne et al. titled “BIO-INFORMATION SENSOR MONITORING SYSTEM AND METHOD” which is owned by the same assignee of this invention.}",
    "textBeforeTable": "Referenced by Having described the present invention, it will be understood by those skilled in the art that many changes in construction and circuitry and widely differing embodiments and applications of the invention will suggest themselves without departing from the scope of the present invention. In order to facilitate manual gripping of Release Tool 70, Elongated Handle 72 is provided with a Rounded Portion 81 along one edge, and Lever Arm 76 is provided with a Rounded Portion 82 along one edge which will move into engagement with an edge of Elongated Handle 72 when Lever Arm 76 is squeezed to force Blade Edge 80 into engagement with the breakaway portion of Battery Clip 62. . Release Tool 70 is made up of an Elongated Handle 72 having a Stationary Arm 74 extending from one end of said arm and at right angles thereto. A tang-engaging Lever Arm 76 is pivotally connected to an intermediate portion of Elongated Handle 72 and has a Blade Member 78 with a Blade Edge 80 at its free end. Lever Arm 76 is pivotally connected to Elongated Handle 72 at a location such that when Stationary Arm 74 bears against Flexible Boot 32, Blade Edge 80 is pivoted into engagement with the molded breakaway portion of Battery Clip 62. Blade Edge 80 is movable to bear against Tangs 68 so as to release them",
    "textAfterTable": "Cooperative Classification Y10S128/92, A61B2560/0406, A61B5/14546, G01N33/4972, A61B5/145, A61B5/0008, A61B5/0022 European Classification A61B5/145, A61B5/145P, G01N33/497A, A61B5/00B Legal Events Date Code Event Description Aug 18, 2006 AS Assignment Owner name: ALCOHOL MONITORING SYSTEMS, INC., COLORADO Free format text: MERGER;ASSIGNOR:ALCOHOL MONITORING SYSTEMS, LLC;REEL/FRAME:018132/0295 Effective date: 20040107 Jun 4, 2010 AS Assignment Owner name: ALCOHOL MONITORING SYSTEMS, INC.,COLORADO Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE CORRECT SERIAL NUMBERS 11441686, 11441692, AND 11441694 PREVIOUSLY RECORDED ON REEL 018132 FRAME 0295. ASSIGNOR(S) HEREBY CONFIRMS THE CERTIFICATE OF MERGER;ASSIGNOR:ALCOHOL MONITORING SYSTEMS, LLC;REEL/FRAME:024483/0611 Effective date: 20040107 Owner name: ALCOHOL MONITORING SYSTEMS, INC., COLORADO Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE CORRECT SERIAL NUMBERS 11441686, 11441692, AND 11441694 PREVIOUSLY RECORDED ON REEL 018132 FRAME 0295. ASSIGNOR(S) HEREBY CONFIRMS THE CERTIFICATE OF",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}