{
    "relation": [
        [
            "Date",
            "Nov 6, 1997",
            "Nov 17, 1997",
            "Mar 29, 2005",
            "Mar 26, 2009",
            "Jun 21, 2013",
            "Nov 13, 2013",
            "Dec 31, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: CABOT CORPORATION, MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:WALLACE, STEPHEN;SMITH, DOUGLAS M.;ACKERMAN, WILLIAM C.;REEL/FRAME:008787/0908;SIGNING DATES FROM 19971001 TO 19971016",
            "Owner name: CHRISCOR PRODUCTION ENHANCEMENT TECHNOLOGIES INC., Free format text: CHANGE OF NAME;ASSIGNOR:CHRISCOR INDUSTRIES (1994) INC.;REEL/FRAME:008798/0469 Effective date: 19971105",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20131113"
        ]
    ],
    "pageTitle": "Patent US6315971 - Process for producing low density gel compositions - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6315971?dq=7,752,326",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 13,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986357.49/warc/CC-MAIN-20150728002306-00191-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477065503,
    "recordOffset": 477028958,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{69510=The processes of the present invention may also be advantageously utilized to produce gel compositions with a wide range of surface areas, e.g. 40-1000 m2/g, with the choice of particular surface area depending on the intended application for the gel composition. In particular, where desired, the process of the present invention may advantageously produce gel compositions having a BET surface areas of greater than or equal to 200 m2/g, preferably greater than or equal to 400 m2/g, more preferably greater than or equal to 500 m2/g. BET surface area may be determined utilizing ASTM test procedure D1993., 27238=a ρliquid/ρsolid ratio at the freezing point of 0.95-1.05, preferably 0.97-1.03; and, 79631=BET surface area of a gel composition may be determined utilizing ASTM test procedure D1993., 28292=A further embodiment of a process of the present invention comprises drying a wet gel composition comprising gel solids and a drying agent to remove the drying agent wherein the drying agent has a ρliquid/ρsolid ratio at the freezing point of 0.95-1.05, preferably 0.97-1.03; and/or a vapor pressure at the freezing/melting point of greater than or equal to 1 Torr, preferably greater than or equal to 10 Torr, more preferably greater than or equal to 25 Torr. In preferred embodiments, the drying agent additionally has one or more of the following properties:, 78371=The dibutyl phthalate adsorption value (DBP) of the carbon blacks utilized in the examples, expressed as milliliters per 100 grams of carbon black (ml/100 g), was determined according to the procedure set forth in ASTM D2414.}",
    "textBeforeTable": "Patent Citations It should be clearly understood that the forms of the present invention herein described are illustrative only and are not intended to limit the scope of the invention. These results are discussed in the description of each example. CB = Carbon Black, 15% by weight Ex. = Example, Comp. Ex. = Comparative Example, NM = not measured *—Water content of 5%, by weight, **—frozen  0.147 NM fluidized bed tert-butanol** 5% SiO2 — 27 0.15 NM fluidized bed tert-butanol 12% SiO2 — 26 0.12 NM fluidized bed tert-butanol 10% SiO2 — 25 0.09 NM fluidized bed tert-butanol",
    "textAfterTable": "Basf Aktiengesellschaft Preparation of aerogels US4775520 Sep 25, 1986 Oct 4, 1988 Merck Patent Gesellschaft Mit Beschrankter Haftung Spherical SiO2 particles US4810415 Sep 10, 1986 Mar 7, 1989 Dresser Industries, Inc. Process for manufacturing ultra pure silica and resulting encapsulated products US4842837 Sep 18, 1987 Jun 27, 1989 Shin-Etsu Chemical Co., Ltd. Process for producing fine spherical silica US4911903 Jul 12, 1988 Mar 27, 1990 Merck Patent Gesellschaft Mit Beschrankter Haftung Spherical SIO2 particles US4983369 Nov 22, 1989 Jan 8, 1991 Allied-Signal Inc. Process for forming highly uniform silica spheres US5017540 Sep 15, 1989 May 21, 1991 Sandoval Junior E Silicon hydride surface intermediates for chemical separations apparatus US5106604 Mar 12, 1991 Apr 21, 1992 Pradyot Agaskar Use of metal salts in the synthesis of oligomeric hydrogensilsesquioxanes via hydrolysis/condensation reactions US5158758 Apr 24, 1989 Oct 27, 1992 International Minerals & Chemical Corp.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}