{
    "relation": [
        [
            "Citing Patent",
            "US6414511 *",
            "US6747456",
            "US6931332 *",
            "US7098665 *",
            "US7212934",
            "US7231283 *",
            "US7495448",
            "US7633297",
            "US8129999 *",
            "US8810200 *",
            "US8933702",
            "US9052366",
            "US20040087055 *",
            "US20040113629 *",
            "US20040212368 *",
            "US20140091762 *",
            "US20150171640 *",
            "CN100405075C",
            "EP1429152A1 *"
        ],
        [
            "Filing date",
            "Feb 7, 2000",
            "Sep 20, 2002",
            "Oct 1, 2003",
            "Nov 10, 2003",
            "Mar 6, 2006",
            "Nov 8, 2002",
            "May 11, 2004",
            "Jun 23, 2005",
            "Feb 22, 2008",
            "Dec 5, 2013",
            "May 12, 2011",
            "Aug 6, 2012",
            "Oct 27, 2003",
            "Jul 25, 2003",
            "May 11, 2004",
            "Dec 5, 2013",
            "Dec 18, 2013",
            "Mar 11, 2005",
            "Sep 20, 2003"
        ],
        [
            "Publication date",
            "Jul 2, 2002",
            "Jun 8, 2004",
            "Aug 16, 2005",
            "Aug 29, 2006",
            "May 1, 2007",
            "Jun 12, 2007",
            "Feb 24, 2009",
            "Dec 15, 2009",
            "Mar 6, 2012",
            "Aug 19, 2014",
            "Jan 13, 2015",
            "Jun 9, 2015",
            "May 6, 2004",
            "Jun 17, 2004",
            "Oct 28, 2004",
            "Apr 3, 2014",
            "Jun 18, 2015",
            "Jul 23, 2008",
            "Jun 16, 2004"
        ],
        [
            "Applicant",
            "Koninklijke Philips Electronics N.V.",
            "Guardian Link Limited",
            "General Electric Company",
            "Vb Autobatterie Gmbh",
            "United States Of America As Represented By The Administrator Of The National Aeronautics And Space Administration",
            "Endress+ Hauser Gmbh+ Co. Kg",
            "Lem Heme Limited",
            "Nec Corporation",
            "Cobasys, Llc",
            "Tatsumi Corporation",
            "Liebert Corporation",
            "Midtronics, Inc.",
            "Nsc-Nanosemiconductor Gmbh",
            "Helmut Laig-Hoerstebrock",
            "Lem Heme Limited",
            "Tatsumi Corporation",
            "Ford Global Technologies, Llc",
            "佛山市顺德区顺达电脑厂有限公司;神达电脑股份有限公司",
            "VB Autobatterie GmbH"
        ],
        [
            "Title",
            "Arrangement for transient-current testing of a digital electronic CMOS circuit",
            "Electro-chemical deterioration test method and apparatus",
            "Method and system for testing battery connectivity",
            "Method for prediction of the internal resistance of an energy storage battery, and a monitoring device for energy storage batteries",
            "String resistance detector",
            "Method for regulating the power supply of a number of multiple field devices",
            "Electro-chemical deterioration test method and apparatus",
            "Apparatus and method for detecting internal impedance of a battery and a degree of battery degradation based on detected internal impedance",
            "Dielectric breakdown detector for HEV battery application",
            "Load system",
            "Battery monitor with correction for internal OHMIC measurements of battery cells in parallel connected battery strings",
            "Battery testers with secondary functionality",
            "Semiconductor device and method of making same",
            "Energy store and method for determining the wear to an electrochemical energy store",
            "Electro-chemical deterioration test method and apparatus",
            "Load system",
            "Battery parameter estimation",
            "Method for preventing detection mechanism misjudgement caused by voltage instant changing of battery",
            "Method for predicting the internal resistance of a battery and a monitoring device for batteries"
        ]
    ],
    "pageTitle": "Patent US6167349 - Battery parameter measurement - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6167349?ie=ISO-8859-1&dq=patent:5881444",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986625.58/warc/CC-MAIN-20150728002306-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476638831,
    "recordOffset": 476615627,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Accordingly, there has been disclosed an improved method and system for evaluating the status of battery jars in a battery backup or standby system. While an exemplary embodiment of the present invention has been disclosed herein, it will be appreciated by those skilled in the art that various modifications and adaptations to the disclosed embodiment may be made and it is intended that this invention be limited only by the scope of the appended claims. The system/load controller includes an internal real time clock and may also be programmed to autonomously take ohmic resistance, charge transfer resistance, and double layer capacitance measurements for each jar at predetermined specific time intervals at predetermined specific times. The acquired data in this case is temporarily stored in the voltage measurement modules as well as the system/load controller for future downloading to the remote personal computer. Thus, typically, in a large battery backup or standby system the remote personal computer 28 initiates the collection of voltage measurement data once a week during an off hour. The system/load controller and interface 24 sends signals over the bus system 26 to cause a string of long and short duration current pulses to be applied to each quarter string and to have the voltage measurement module 20 associated with that quarter string take voltage measurements from each jar within that quarter string. During the data collection from each jar, a stream of both",
    "textAfterTable": "Konya Y T et al--\"A Deterioration Estimating System for 200-AH Sealed Lead-Acid Batteries\" Oct. 30-Nov. 3, 1994 No. Conf. 16, Oct. 30, 1994, pp. 256-262. 5 * Roberge, P.R. and Salvador, J.P. Testing and Evaluation of Tubular Positive Lead Acid Batteries. 1995 Proceedings of the Tenth Annual Battery Conference on Applications and Advances. pp. 147 151. 6 Roberge, P.R. and Salvador, J.P. Testing and Evaluation of Tubular Positive Lead-Acid Batteries. 1995 Proceedings of the Tenth Annual Battery Conference on Applications and Advances. pp. 147-151. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6414511 * Feb 7, 2000 Jul 2, 2002 Koninklijke Philips Electronics N.V. Arrangement for transient-current testing of a digital electronic CMOS circuit US6747456 Sep 20, 2002 Jun 8, 2004 Guardian Link Limited Electro-chemical deterioration test method and apparatus US6931332 * Oct 1, 2003 Aug 16, 2005 General Electric Company Method and",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}