{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,070 topics 2,123,289 replies",
            "85,546 topics 1,153,496 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,755 replies",
            "5,996 topics 75,807 replies",
            "50,536 topics 466,127 replies",
            "22,767 topics 196,277 replies",
            "4,270 topics 60,418 replies",
            "1,128 topics 8,214 replies",
            "3,596 topics 115,097 replies"
        ],
        [
            "Last Post Info",
            "Cool Things You Didn't... By gameinbros A minute ago",
            "What happened to Luis Lopez? By Mr. Fahrenheit 21 minutes ago",
            "The Ultimate 100% Save File... By Militia 10 hours ago",
            "The Most Underrated GTA Ever By DragonpokeZ 8 hours ago",
            "Why LCS is better than V By GTAKid667 7 hours ago",
            "How does your CJ look? By DustyRider A minute ago",
            "Which Vehicle Do You Prefer? By gts. 2 hours ago",
            "Grand Theft Auto III Pre-Re... By gts. 2 hours ago",
            "Anybody has a 100 % savegame? By Cerium 2 hours ago",
            "What if Phil Cassidy met CJ? By Coleman627 A minute ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=222&t=550784&p=1062364233",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 106749275,
    "recordOffset": 106723180,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18635=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 122958=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 16539=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 14281=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 20722=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 47621=Bing, Yahoo, Google, Pletzturra, JimmyFantastic, HorrA1985, Officer Ronson, DrunkKGB, VSVPxSupreme, WestsideOutlaw187, JORD4NOcz, Kirsty, Max Payne, craigdyid, aleex96, monkb4skunk, XenoxX, MC., JackIrish, evGTA, Ermacs, Honch777, Frank-Tenpenny, camo_boy67, Cancerslug, Russell_Brand, GTAandStuff, ChicagoCubs2188, Faultierspy79, MrKush, XIantonioIX, Mona Sax, proportion911, Pavle, Non Fiction, Whitecat0311, VikDarkbomb, SharkySoulja, link-thezoraband, Jvaz615, BadKarma1699, uNi, Corndog93, Trentallica, Huraldo, fullxthrottle94, SSKYZX, Chacer123, Sentinel Driver, Tegan, Shiest Bubble, //XP//, Bluntnation94, Nebenezer, Zello, Facade, Kampioen, aka_senior_84, hoopz71, Foxtrot64, Icantthinkofonew, SanAndreas88, MightyMax, Gallioni Pepperoni, TheFlareEntercounter, levendis, Whitedodge00, Jon3s, CarlitoDorito, EagleStrike, Stidge uk, ChrissyBoi87, Anthonyf123, Officer620, Hjaere, gameinbros, saikolemon, dorcy, shadowkill98, USMCxMyth., Los Santos citizen, GTAGAME ☑, FrikkenZz, Official General, DustyRider, COYBIG88, The_Riddler, Vanzant, Silent, No_Flex_zone, ethandavo, bewareofdoom, santtuu74., Miss Malevolent, Captain Sensib1e, psymin, Soy Bean, Coleman627, Schleemil, Supremeplayer, Choco Taco, Holo fenix, Engman97, kuusko, Shmoopy, Spectacus, Razbos, MotelGuy, nkjellman, Class A, tjmursch, Zondar, longhurstgb, SnowBell, GR Choke, Ezekeil2Ofive17, Zenokin, xTOMMYTROJANx, Randy93, Krozex01, Red Lynx 23, lunchxbles, NYgangster25, Bms842, L00NEY, ZeroSafe5615, Ezza., Määhhh, JAJ, The Hero, Nathaaan8, SkynetOnlineID, wrestlingpro1978, Willplanb_, don_pedro, Cars247, WHAT!?, Midnight Hitman, Claude Liberty, Delta8042, TarHeelJohn, Grimase, TheMcSame, Cyberzone2, ric-013, Mithridates158, scottmacdougall, gtuned, BoomBapPoet, Lewischally, Mcschlotsky, Stoney0503, funmw2, DeltaEliteKing9, Scuba 21, A.O.D.88, Cutter De Blanc, Strepherd, zanesix, Andreas, da_guuch, deadx23, denis213, GTAOnlineAddict123, one5one2, jerryinohio78, doppelblind, oCrapaCreeper, Heists, epoxi, InternalSausage, Drunkmoons, TreFacTor, CML99, jpalp1223, Tilley, Retired Mafia, RussianCommie, Cornphlake718, zakace, Warliss, gil62291, Failure, JaegerPilot1, Dr. Sadler, Mockingbae, Facebook, Cymru1991, Junko Enoshima, xoDesires, Tha Saucier, Ry595, Killerman29, MelloHello, Unseen_Bull, The Squirrel, tweepey, Anarckhy, Edmachine, DOK94, gtafan26, Ayr utd 1910, LeopardGecko, Quebahombre, TrustedInstaller, BlackHeartedGovernor, hot-temper27, MrBossFTW, BlackZmith10, DiscoPanda, Costar, Alec Skorpio, Mantiger308, whiteskin, FedoraTheExplora, slayso, Lord-Zaeon, Nemesis2252, JuanG12, GERM!, Smesi, MetalThrasherXtreme, King Rossey, drew0318, CarnageRacing00, PSgtaplayer1, alishabutera, helresa, Kahkenbols, GTAKid667, Nerfgoth, lolznc, digitalclips, PerfectNigtmare, Bob_Dole, Mr. Langan, veryrarevibes, svanderman, CTBass, JDUJRBOH, LeBron James, Chekoloco, darthYENIK, kaasje, SARDYNA108, Stephan90, sewersss, Zonnex, the consigliere, RideEmOut2, EL_Greco, Progeekzy, icecoldkilla1467, Vermilleon, ap4321, Chang, Eram, MF Modding, MatDen96, WARD ENTERPRISES, Google Mobile, jeremy81385, Cyron43, evinaz, Cico555, AztecaEh, danilo_ol, guard3, NotAHipster, Blankerz, thehambone, Destroyeroffaces, TwoTonTed, Jaxite, Angel Bryan, robi29, alexnicnac, brad476, Daemian, FlacidJack, SuperVeloce, hood gon love, Tony_Florence, jollythecat, lucask28d, Jaanus949, SoggyVictim, GTA@ddict13, GTAV112, s2n vaniish, GreenOnions, Outcast, Shadowfennekin, BisonOlf, NoSignal666, BengeyBoy, yakprince, Therocksterisawesome, blusunone, Slasherr, 12736=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 9479=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Facade Facade Corporation 613,318 replies 15,180 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By ChrissyBoi87 (XBOX 360) Fast & Furio... 2,277,500 replies 113,108 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,435 topics 416,533 replies C# setting the world to beh... By Foxtrot64 A minute ago Mod Showroom Scripts & Plugins, Maps, Total Conversions,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}