{
    "relation": [
        [
            "Year",
            "2006",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "2013",
            "2014",
            "2015",
            "2016"
        ],
        [
            "Dates Held",
            "March 17 to March 19",
            "May 4 to May 6",
            "May 8 to May 11",
            "May 6 to May 9",
            "May 27 to May 30",
            "May 10 to May 13",
            "May 2 to May 5",
            "April 10 to 13",
            "April 2 to 5",
            "April 30 to May 2",
            "TBA"
        ],
        [
            "Location",
            "Lyon, France",
            "Montreal, Canada",
            "Wrocław, Poland",
            "Montreal, Canada",
            "Brussels, Belgium",
            "Montreal, Canada",
            "Vienna, Austria",
            "Madrid, Spain",
            "Leipzig, Germany",
            "Toronto, Canada",
            "London, UK"
        ],
        [
            "External Links",
            "Website",
            "Website and Video Recordings",
            "Website and Video Recordings",
            "Website and Video Recordings",
            "Website and Video Recordings",
            "Website and Video Recordings",
            "Website and Video Recordings",
            "Website and Video Recordings",
            "Website",
            "Website",
            "Website"
        ],
        [
            "Host",
            "École d'Ingénieurs CPE",
            "Polytechnique de Montréal",
            "Wrocław University of Technology",
            "École Polytechnique de Montréal",
            "Pianofabriek, Bruxelles",
            "École Polytechnique de Montréal",
            "Technikum Wien",
            "MediaLab Prado",
            "Leipzig University",
            "University of Toronto",
            "University of Westminster"
        ]
    ],
    "pageTitle": "Libre Graphics Meeting - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "http://en.wikipedia.org/wiki/Libre_Graphics_Meeting",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 82220595,
    "recordOffset": 82205413,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7407=The Libre Graphics Meeting (LGM) is an annual international convention for the discussion of free and open source software used with graphics; The first Libre Graphics Meeting was held in March 2006.[1] Communities from Inkscape, GIMP, Krita, Scribus, sK1, Blender, Open Clip Art Library, Open Font Library, and more come together through the Create Project to assemble this annual conference. It was co-founded by Dave Neary and Dave Odin., 1160=Louis Suárez-Potts, OpenOffice.org's Community Development Manager and Community Lead was sent to the LGM 2007 to find ways that OpenOffice.org might be able to transcend the boundaries of a traditional office suite by collaborating with other open source projects. One of the ways that has been suggested was that open office could suggest another open source application when it could not perform the role a user required. For example when a user needed to edit an image in an office document, OpenOffice.org may suggest GIMP to fill the role required.[7], 4440=Held yearly since 2006 the Libre Graphics Meeting aims to attract developers, artists and professionals[2] who use and improve free and open source software graphics applications. LGM aims to bring these people together in the cause of creating high quality free graphics applications;[3] By collaborating it allows the development of cross-application assets like brushes and enhanced interoperability such as shared file formats.[4]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Specific Libre Graphics Meetings[edit] Louis Suárez-Potts, OpenOffice.org's Community Development Manager and Community Lead was sent to the LGM 2007 to find ways that OpenOffice.org might be able to transcend the boundaries of a traditional office suite by collaborating with other open source projects. One of the ways that has been suggested was that open office could suggest another open source application when it could not perform the role a user required. For example when a user needed to edit an image in an office document, OpenOffice.org may suggest GIMP to fill the role required.[7] As well as cross pollination of ideas the Libre Graphics Meeting allows the discussion of possible future collaboration. Collaboration[edit] [6] Ginger Coons gave a presentation at LGM 2009 discussing what it will take to get free software graphics applications in the doors of professional environments and schools Professional adoption [5] University of Waterloo some original research was done in the field of creating drawing aids for graphics applications. The aim was to allow an artist to draw using templates that would improve the shape or correctness of a brush stroke while maintaining a natural look. This presentation was given by Michael Terry, the lead researcher on the project. At the",
    "textAfterTable": "Main achievements[edit] Addition of color management to GIMP and Inkscape.[citation needed] OpenRaster initiative to develop an exchange file format for raster graphics, supported by Krita, GEGL and MyPaint. Start of the UniConvertor project to provide Corel DRAW and WMF importers for Scribus, Inkscape and any other project willing to use them.[8] KDE SC 4 graphics software using LibRaw instead of DCRaw to process Raw files, which is intended to achieve more consistent demosaicing, faster processing using OpenMP and better metadata extraction.[9] LensFun library to automatically fix various lens distortions.[10][11] Release of Open Clip Art Library 3.0.[12] Release of Open Font Library publicly.[13] Release of DeviantArt Developer API. Public Showing of Milkymist.[14] See also[edit] Free software portal",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}