{
    "relation": [
        [
            "",
            "All Television",
            "Markets 1-25",
            "Markets 26-50",
            "Markets 51-100",
            "Markets 101-150",
            "Markets 151+"
        ],
        [
            "Making Profit",
            "24%",
            "35.9",
            "30",
            "24.6",
            "17.4",
            "15.4"
        ],
        [
            "Breaking Even",
            "12.2%",
            "5.1",
            "8",
            "15.4",
            "11.6",
            "20.5"
        ],
        [
            "Showing a Loss",
            "13%",
            "12.8",
            "6",
            "13.8",
            "21.7",
            "5.1"
        ],
        [
            "Don’t Know",
            "50.8%",
            "46.2",
            "56",
            "46.2",
            "49.3",
            "59"
        ]
    ],
    "pageTitle": "Digital | State of the Media",
    "title": "",
    "url": "http://www.stateofthemedia.org/2007/local-tv-intro/digital/",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 728182415,
    "recordOffset": 728165114,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25918=In September 2006, ABC cut a deal with its affiliates to stream some prime-time shows, including ABC News videos, on local Web sites. The local affiliates will be able to carry clips from ABC’s World News and Good Morning America on their station Web sites, and eventually even add local content. In exchange, the affiliates will promote the ABC streams both on the air and on their respective Web sites., 21332=Stations that have a large Web staff (according to the survey, ABC affiliates had larger Web staffs than other affiliates) tend also to have their news directors in charge of the sites. The percentage of news directors who say they are in charge of content on their Web sites has increased from 15.6% in 2004 to 20.3% in 2005., 33206=KING 5 does not place nearly as much emphasis as some other sites on its own branded material or content control. It fell in the high mid-range of sties studied. There is a place, called “Investigators, designated to its news team’s original reporting” But these reports, primarily local in focus, appear only periodically: on January 30, 2007, the top 10 stories listed on the Investigator page were dated January 23, 2007 back to November 21, 2006. Over all, the primary source of content, for both video and narrative stories, is the Associated Press. KING 5 reporters have bylines for about half of the local news content, with the AP and other contributing sources (such as KGW.com) filling in the rest., 29738=As a part of the report his year, the Project analyzed 38 different news Web sites —everything from online-only sites to blogs to sites rooted in traditional media like newspapers and cable—in September 2006 and in February 2007. That included two from local TV news, KING5.com, in Seattle, and CBS11tv.com, the local CBS affiliate in Dallas-Forth Worth (please see the broader discussion of the Typology breakdown)., 38866=And their efforts seemed well rewarded. According to Internet Broadcasting, which manages many of the broadcast network Web sites, local TV station Web sites drew viewers in record numbers on Election Day, November 7, 2006., 26839=Fox Television also faced similar concerns when it wanted to move into new media; it eventually made an agreement in April 2006 to share earnings with its local affiliates. Their deal allows affiliates to get an (not made public) portion of additional revenues made from reruns on other platforms, for up to a year after they air the program.4, 20130=The Fox Television group rolled out re-designed local Web sites in January 2007. The network undertook a yearlong project to centralize the sites — they have a similar look and centralized technical operations, and all are seen as stand-alone businesses for the group. They offer local information and community forums, in addition to local news.2, 20503=A survey released by Ball State University’s Bob Papper for the RTNDA in May 2006 suggests that a Web-based component is now a norm for local TV stations, though what it consists of may vary greatly from site to site., 25484=Another research group, Borrell Associates Inc., which measures local online advertising, found that local TV broadcasters lead the way when it comes to online ad revenues — the figure is projected to be $7.7 billion in 2007.3, 31854=A major site redesign at the start of 2007 gave even more weight to the user. In October 2006, there was no way for the user to add their own voice—no way to comment or rate a story or even access a “most emailed” list. By February 2007, visitors who become “members” (something they are prompted to do after a few clicks on the site) are encouraged to contribute to the site’s content. One of the headers along the top of the page along with “news,” “weather” and “sports” is a link called “interact,” and invites users to contribute photographs, engage in forums to discuss news, politics, sports and the outdoors, comment on King 5 blog entries, and contribute to the local calendar of events. With no way to directly email station staff, have a live discussion, rate a story, or see a list of the most emailed or linked to repots, there is still some room to grow. Overall, it falls in the mid-low level here for participation. But this is a site that is focusing more than many others on users., 22344=Local Television Web sites 2005, 27821=How about audience? To what degree are they using these sites, and is there an impact on television viewership? One survey suggests that consumers are getting more local news on the Internet, but at least so far, are not using it to replace local TV newscasts. A study released in July 2006, conducted by the market research firm Crawford Johnson & Northcott, found that 75% of Internet users watch a local newscast at least twice a week. More than half said they tried to watch it daily.6, 25332=Source: Bob Papper, “TV Web sites Helping the Bottom Line,” RTNDA Communicator, May 2006 Note: Based on survey responses of news directors, 21831=According to RTNDA the survey, the percentage of news directors who said their local TV Web sites were making a profit rose from 15% in 2004 to 24% in 2005 — and if you look at profits by market size, every single market group went up as well., 27208=CBS has come up with another novel digital arrangement. In October 2006, it hooked up with Yahoo Inc. to make local news content from its 16 stations that run local news available to stream on the Yahoo Web site. While exact financial details were not available, Yahoo is expected to share in the revenue from advertising the video clips.5}",
    "lastModified": "Tue, 18 Jan 2011 21:13:11 GMT",
    "textBeforeTable": "By the Project for Excellence in Journalism When it came to moving online, local TV news has historically looked tardy and vulnerable. But that may be changing. Over the last year initiatives by local TV news stations were less about convergence with newspapers and more about offerings through newer technologies. Local TV content can now be accessed as podcasts, on cell phones, on outdoor screens and streamed over the Internet. One of the biggest growth areas has been in local stations’ Web sites. All the Big Four networks have worked on their local station sites, and the results have been encouraging. The CBS Television group, for example, has overhauled its local Web sites over the past year, increasing the amount of available video streams fourfold. That has resulted in a huge increase in online ad revenues.1 The Fox Television group rolled out re-designed local Web sites in January 2007. The network undertook a yearlong project to centralize the sites — they have a similar look and centralized technical operations, and all are seen as stand-alone businesses for the group. They offer local information and community forums, in addition to local news.2 A survey released by Ball State University’s Bob Papper for the RTNDA in May 2006 suggests that a Web-based component is now a norm for local TV stations, though what it consists of may vary greatly from site to site. According to the survey almost all news directors say their local TV stations now have Web sites, and 98%",
    "textAfterTable": "Source: Bob Papper, “TV Web sites Helping the Bottom Line,” RTNDA Communicator, May 2006 Note: Based on survey responses of news directors Another research group, Borrell Associates Inc., which measures local online advertising, found that local TV broadcasters lead the way when it comes to online ad revenues — the figure is projected to be $7.7 billion in 2007.3 But as broadcast television groups expand their digital properties, the question of revenue sharing and the relationship with their local affiliates is something to consider. In September 2006, ABC cut a deal with its affiliates to stream some prime-time shows, including ABC News videos, on local Web sites. The local affiliates will be able to carry clips from ABC’s World News and Good Morning America on their station Web sites, and eventually even add local content. In exchange, the affiliates will promote the ABC streams both on the air and on their respective Web sites. That was a compromise reached by the two sides in response to an earlier decision by ABC to stream its content free on its Web site the day after its initial broadcast. Affiliate stations weren’t happy – if viewers could watch ABC programming without having to tune into their local stations, they worried about the impact the move would have on their revenues. They argued that since they help publicize the programming, they should get some share of the revenue that it generates on other platforms. Fox Television also faced similar concerns when it",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}