{
    "relation": [
        [
            "Qual rel CHL",
            "At 90%",
            "At 75%",
            "At 60%",
            "At 50%",
            "At 40%",
            "At 30%"
        ],
        [
            "PPG",
            "1.63",
            "1.63",
            "1.63",
            "1.63",
            "1.63",
            "1.63"
        ],
        [
            "% of CHL",
            "0.9",
            "0.75",
            "0.6",
            "0.5",
            "0.4",
            "0.3"
        ],
        [
            "translation factor",
            "0.27",
            "0.225",
            "0.18",
            "0.15",
            "0.12",
            "0.09"
        ],
        [
            "NHLE",
            "36",
            "30",
            "24",
            "20",
            "16",
            "12"
        ]
    ],
    "pageTitle": "Putting Mark Jankowski's Performance In Context | FlamesNation",
    "title": "",
    "url": "http://flamesnation.ca/2012/6/25/putting-mark-jankowskis-performance-in-context/score/page/2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00315-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 89281719,
    "recordOffset": 89263360,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2714=Kent Wilson June 25 2012 12:19PM}",
    "TableContextTimeStampAfterTable": "{47915=even if Jankowski is a bust, he will be far from the only one in the 1st round. honestly, people make it sound like the Flames are the only team that picks 1st round busts. Even 2003, characterized as the best draft ever, featured a few outright busts in the 1st round, and several other players who kind of Chuck Kobasewed their way through the league (or had one good season, then disappeared)., 48326=in 2007, there were several downright embarassing picks, none of which were done by the Flames. The Kings took Thomas Hickey 4th--and he has yet to play an NHL game. The Bruins took Zach Hamil 8th. the Pens took Angelo Esposito 20th, and that was considered a surprising slide at the time. The Ducks made perhaps the worst draft selection of all time in taking Logan MacMillan 19th overall., 64219=Copyright © The Nation Network 2012 | Glyphicons Free licensed under CC BY 3.0 | Advertise with us!}",
    "textBeforeTable": "]]> .tableizer-table th {background-color: #8C1010; color: #FFF; font-weight: bold;} table.tableizer-table {border: 1px solid #CCC; font-family: Arial, Helvetica, sans-serif; font-size: 12px;} .tableizer-table td {padding: 4px; margin: 3px; border: 1px solid #ccc;} <p> <style type=\"text/css\"> <p></p> <p>We know the translation factor for the CHL (0.30), so I used a range of estimated ratios to determine the Canadian prep school quality. Here are the results:&nbsp;</p> <p></p> <p>I decided to use this Prep school-to-CHL comparison to estimate Jankowski's NHL equivalency, which as discussed frequently before is a method developed by&nbsp;Gabriel Desjardins for translating offense in various leagues to the NHL which allows us to compare numbers from across disparate divisions such as the CHL, NCAA and SEL. Essentially, we multiply a players point-per-game pace (PPG) by an established translation factor and then use that to calculate the estimated output over an 82-game NHL schedule.&nbsp;</p> <p></p> <h2>Estimating NHL Equivalence</h2> <p></p> <p>Jankowski's 93-points in 53-games for Stanstead college sounds impressive (1.61 point-per-game) but the Canadian HS prep league is obscure and the competition is minimal as compared to, say, major junior hockey or NCAA. In the Hockey&nbsp;New draft preview they ranked Jankowski 37th overall. One scout interviewed for the piece said &quot;Could (Jankowski have played in major junior this year?&nbsp;Sure he could have...Would he been a star? Probably not.&quot;</p> <p></p> <p>Quantitatively, because the better known feeder leagues like the OHL, the NCAA and pro leagues across the pond routinely send players to the NHL, it's easier to see to what degree",
    "textAfterTable": "  As you can see, the news gets bad pretty quickly. Things are encouraging if Jankowski's HS league is about at least 60-75% as good as the CHL (which is a long shot). Anything below 50% and he falls to the high-to-mid teens. For context, Sven Baertschi's NHLE in his draft season was about 32. This is a rather clumsy, shotgun method of doing things I admit. Luckily Gabe Desjardins has looked at how highschoolers in Minnesota translate their offense to college and by, extension, to the NHL. Initially, I looked mostly at leagues that sent players directly to the NHL, the idea being that we wanted to be able to make single year projections of minor-league and junior players. However, because it is derived from the performance of a large number of players, a League Equivalency is also a measure of League Difficulty. We can compare two leagues to one another either by looking at how players fare when they jump from one league to another, or how players from two different leagues fare in a third. More importantly, we can extrapolate to an NHL Equivalency, even for a league that doesn't send anyone to the NHL. ... Overall, Minnesota hockey translates to the NCAA (NHLE = 0.41) at approximately 0.18, giving an NHLE of 0.073. The translation to the USHL is 0.195; its translation to the NCAA is 0.65; the overall NHLE is 0.052. Via",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}