{
    "relation": [
        [
            "Day",
            "Friday",
            "Thursday",
            "Saturday",
            "Sunday",
            "Tuesday",
            "Thursday"
        ],
        [
            "Date",
            "04/09/2015",
            "01/10/2015",
            "31/10/2015",
            "15/11/2015",
            "01/12/2015",
            "18/02/2016"
        ],
        [
            "Start time",
            "19:00*",
            "19:00*",
            "19:00*",
            "19:00*",
            "19:00*",
            "19:30*"
        ],
        [
            "Type of Event",
            "Gig",
            "Gig",
            "Gig",
            "Gig",
            "Gig",
            "Gig"
        ],
        [
            "Title",
            "Mark Lanegan Band",
            "Sleaford Mods",
            "The Staves",
            "Slaves",
            "The Story So Far",
            "Fun Lovin' Criminals"
        ]
    ],
    "pageTitle": "Noise Disruption",
    "title": "",
    "url": "http://www.cardiff.ac.uk/gradc/socialevents/solusgigs.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366014030,
    "recordOffset": 366005828,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 10 Jun 2015 11:30:38 GMT",
    "textBeforeTable": "*For gigs please note that loud noise is likely to occur earlier between 3pm to 6pm due to sound-checking. In order to give students studying in the Graduate Centre as much notice as possible of these potential disruptions, we have compiled the following list of known upcoming events taking place in Y Plas only (other events may take place in the Great Hall or CF10 but these are unlikely to affect activities in the Graduate Centre). Please note that this may not be a complete list of Y Plas events as some events may be scheduled at short notice. Normal clubnights during term time are on either a Wednesday or Saturday evening. For an up to date list of the unions planned clubnights: http://www.cardiffstudents.com/whatson/bars-club/  Due to the Graduate Centre being located above the Students' Union Y Plas nightclub / music venue, from time to time the centre is subject to noise disruption caused by loud events, i.e. club night and gigs, taking place in Y Plas. Noise Disruption   Skip to content Skip to navigation menu",
    "textAfterTable": "  The Graduate Centre About the Centre Opening Hours Location and Access Facilities and Services Events Coach Trips Highlights New Postgraduates Useful links   EXPLORE CARDIFF UNIVERSITY HOME ABOUT EDUCATION RESEARCH NEWS EVENTS A-Z Back to top © Cardiff University Accessibility Feedback Cookies Privacy Policy Terms of Use A-Z",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}