{
    "relation": [
        [
            "Language",
            "English",
            "Basque",
            "Bulgarian",
            "Belarusian",
            "Catalan",
            "Chinese",
            "Czech",
            "Danish",
            "Dutch",
            "Esperanto",
            "Estonian",
            "Faroese",
            "Finnish",
            "French",
            "German",
            "Greek",
            "Hebrew",
            "Hungarian",
            "Icelandic",
            "Italian",
            "Latin",
            "Lithuanian",
            "Norwegian",
            "Polish",
            "Portuguese (Brazilian)",
            "Romanian",
            "Russian",
            "Serbian",
            "Slovak",
            "Slovenian",
            "Spanish",
            "Swedish",
            "Turkish",
            "Indonesia",
            "Ukranian"
        ],
        [
            "Real Name",
            "TOM MARVOLO RIDDLE",
            "TOM NARIVOLOZ RIDDLE",
            "ТОМ МЕРСВОЛУКО РИДДЪЛ (TOM MERSVOLUKO RIDDŬL)",
            "ТОМ ВАЛЬДОР РЭДЛ (ТОМ VAL'DOR REDL)",
            "TOD MORVOSC RODLEL",
            "Simple:汤姆·马沃罗·里德尔; traditional: 湯姆·馬德鲁·瑞鬥",
            "TOM ROJVOL RADDLE",
            "ROMEO G DETLEV JR",
            "MARTEN ASMODOM VILIJN",
            "TOM VLADES MISTERO",
            "TOM MARVOLON RIDDLE",
            "TOM EVILDO REGER",
            "TOM LOMEN VALEDRO",
            "TOM ELVIS JEDUSOR",
            "TOM VORLOST RIDDLE",
            "ΑΝΤΟΝ ΜΟΡΒΟΛ ΧΕΡΤ (ÁNTO̱N MÓRVOL CHÉRT)",
            "טום ואנדרולו רידל (TOM VANDROLO RIDDLE)",
            "TOM ROWLE DENEM",
            "TREVOR DELGOME",
            "TOM ORVOLOSON RIDDLE",
            "TOM MUSVOX RUDDLE",
            "TOMAS MALVORAS RIDLIS",
            "TOM DREDOLO VENSTER",
            "TOM MARVOLO RIDDLE",
            "TOM SERVOLO RIDDLE",
            "TOMAS DORLENT CRUPLUD",
            "ТОМ НАРВОЛО РЕДДЛ (TOM NARVOLO REDDL)",
            "TOM MERVOLODOMOS RIDL",
            "TOM MARVOLOSO RIDDLE",
            "MARK NEELSTIN",
            "TOM SORVOLO RYDDLE",
            "TOM GUS MERVOLO DOLDER",
            "TOM MARVOLDO RIDDLE",
            "TOM MARVOLO RIDDLE",
            "ТОМ ЯРВОЛОД РЕДЛ (TOM YARVOLOD REDL)"
        ],
        [
            "Anagram",
            "I AM LORD VOLDEMORT",
            "LORD VOLDEMORT NAIZ",
            "ТУК СЪМ И ЛОРД ВОЛДЕМОР (TUK SŬM I LORD VOLDEMOR)",
            "ЛОРД ВАЛЬДЭМОРТ (LORD VAL'DEMORT)",
            "SÓC LORD VOLDEMORT",
            "佛地魔",
            "JÁ LORD VOLDEMORT",
            "JEG ER VOLDEMORT",
            "MIJN NAAM IS VOLDEMORT",
            "MI ESTAS VOLDEMORT",
            "MINA, LORD VOLDEMORT",
            "ER ERI VOLDEMORT",
            "MA OLEN VOLDEMORT",
            "JE SUIS VOLDEMORT",
            "IST LORD VOLDEMORT",
            "ΑΡΧΩΝ ΒΟΛΝΤΕΜΟΡΤ (ÁRCHO̱N VÓLNTEMORT)",
            "אני לורד וולדמורט (ANI LORD VOLDEMORT)",
            "NEVEM VOLDEMORT",
            "EG ER VOLDEMORT",
            "SON IO LORD VOLDEMORT",
            "SUM DUX VOLDEMORT",
            "AŠ ESU LORDAS VOLDEMORTAS",
            "VOLDEMORT DEN STORE",
            "JESTEM LORD VOLDEMORT",
            "EIS LORD VOLDEMORT",
            "EU SUNT LORDUL CAP-DE-MORT",
            "ЛОРД ВОЛАН-ДЕ-МОРТ (LORD VOLAN-DE-MORT)",
            "TO SMO MI LORD VOLDEMOR",
            "A SOM I LORD VOLDEMORT",
            "MRLAKENSTEIN",
            "SOY LORD VOLDEMORT",
            "EGO SUM LORD VOLDEMORT",
            "ADIM LORD VOLDEMORT",
            "AKULAH LORD VOLDEMORT",
            "Я ЛОРД ВОЛДЕМОРТ (YA LORD VOLDEMORT)"
        ],
        [
            "Translation",
            "",
            "I am Lord Voldemort",
            "And here I am also Lord Voldemort",
            "Lord Voldemort",
            "I am Lord Voldemort",
            "我就是伏地魔 (translate from English)",
            "I, Lord Voldemort",
            "I am Voldemort",
            "My name is Voldemort",
            "I am Voldemort",
            "I, Lord Voldemort",
            "I am Voldemort",
            "I am Voldemort",
            "I am Voldemort",
            "[He] is Lord Voldemort",
            "Lord Voldemort",
            "I am Lord Voldemort",
            "My name is Voldemort",
            "I am Voldemort",
            "I am Lord Voldemort",
            "I am the leader Voldemort",
            "I am Lord Voldemort",
            "Voldemort the Great",
            "I am Lord Voldemort",
            "Behold Lord Voldemort",
            "I am Lord Cap-de-Mort",
            "Lord Volan-de-Mort",
            "Here we are, Lord Voldemort",
            "And I am also Lord Voldemort",
            "",
            "I am Lord Voldemort",
            "I am Lord Voldemort",
            "My name (is) Lord Voldemort",
            "I am Lord Voldemort",
            "I (am) Lord Voldemort"
        ],
        [
            "Notes",
            "",
            "",
            "",
            "",
            "",
            "The Chinese word \"魔\" means demon in English.",
            "",
            "The G. is short for Gåde, i.e. \"Riddle\".",
            "\"Vilijn\" (Voldemort's last name) and the Dutch word \"vilein\" are equally pronounced, while the word \"Vilein\" means \"evil\" or \"mean\". It resembles the English word \"villain\".",
            "\"Mistero\" translates as \"mystery\". (This name is non-canonical, since the books have not been translated to Esperanto.)",
            "",
            "",
            "\"Ma\" is an archaic form of \"Minä,\" which means \"I\" or \"me\". Also, \"Valedro\" begins with \"vale\" which equals to \"lie\" or \"riddle\".",
            "\"Voldemort\" actually translates to \"Flight of Death\"; \"Jedusor\" is pronounced the same way as \"Jeu du sort\" (lit. stroke of fate).",
            "",
            "\"NT\" in Greek is equivalent to \"D\"",
            "",
            "The W is split to form two Vs in order to make the anagram work.",
            "",
            "Inscribed in a slightly archaic style, with the emphasis on I.",
            "",
            "",
            "",
            "Polish book used original anagram.",
            "",
            "Death's head",
            "",
            "",
            "",
            "In this case, the name has been changed to look like Frankenstein, and Mrlak would be an allusion to death.",
            "",
            "In Latin \"ego sum\" = \"I am\"; \"Dolder\" is drawn from a somewhat archaic name for \"someone hidden\".",
            "",
            "",
            "The -volod part of the name may be connected to the name \"Volodimir\", where \"volod\" equates to \"ruler\"."
        ]
    ],
    "pageTitle": "Tom Riddle - Harry Potter Wiki",
    "title": "",
    "url": "http://harrypotter.wikia.com/wiki/Voldemor?interlang=all",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 116545147,
    "recordOffset": 116411466,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{263240=After the coup at the Ministry in 1997, the Taboo curse was placed on the name \"Voldemort\"; speaking the name would summon Death Eaters, Ministry officials, or Snatchers via Apparition. This was used to find those who opposed Voldemort's rule, as only they would dare speak the name. This was how Harry, Ron and Hermione were found at Tottenham Court Road and before being brought to Malfoy Manor. Also, Kingsley Shacklebolt barely escaped Death Eaters when he spoke it.[16] The taboo also caused the trio to be captured temporarily and brought to Malfoy Manor., 211631=Gradually taking more and more power, eliminating rivals and those who stood up to him, and transforming his appearance and his social image into a serpentine persona that inspired a level of fear so profound that wizards avoided mentioning his name even after they thought him dead, Voldemort reached the peak of his powers in 1980., 323430=In 1998, Pettigrew was killed by the silver hand Voldemort had given him when he hesitated during an attempt to strangle Harry Potter, a fate likely similar to whatever punishment Pettigrew would've received from Voldemort himself for this., 16386=Voldemort was ripped from his body in 1981, and though unable to die, was not able to regain a permanent and physical body until 1995, thus spending the intervening 14 years 'a shell', 'less than the meanest ghost', but alive. He was finally killed by his own backfiring curse, after the Order of the Phoenix, led by Albus Dumbledore and then Harry Potter after his death, succeeded in destroying all of his Horcruxes. , 41032=A 16-year-old Riddle during the 1943 opening of the Chamber of Secrets threatening Hagrid, 48012=Using his middle name, Marvolo, which was taken from his maternal grandfather, Riddle discovered his mother's heritage and the Gaunts' bloodline connection with Salazar Slytherin. In the summer of 1943, Tom went to Little Hangleton to learn about his mother's family. While there, he met his uncle Morfin Gaunt, who thought that this stranger looked \"mighty like that Muggle,\" Merope's husband, Tom Riddle Sr. Morfin told Tom the story of his Muggle father, which infuriated Tom to the point of seeking revenge. Tom went to the Riddle House and murdered his father, grandfather, and grandmother with the Killing Curse., 113626=Voldemort was still very weak and about to give up all hope when, in 1994, his servant Peter Pettigrew, a.k.a. Wormtail, who had faked his own death years earlier and hid from authorities in his Animagus form of a rat, had returned to his master. Together, they built a rudimentary body that Voldemort used for travel and performing magic. While in this form, Voldemort was forced to drink a potion made from unicorn blood and venom from Nagini the snake to sustain him. Knowing that Dumbledore was sure to have seen the Philosopher's Stone destroyed, Voldemort knew he would not be able to use the Elixir of Life to create a new body for himself so he would settle on regaining his old body and strength.[22] To achieve this goal, Voldemort would require the use of an old piece of Dark Magic and that required him to return to England to obtain one of the three main necessary ingredients, bone of the father, flesh of the servant, and blood of the enemy., 358104=Rubeus Hagrid and Tom Riddle were both students at Hogwarts School of Witchcraft and Wizardry in the 1940s, with Hagrid being three years his junior. In 1943, Riddle opened the Chamber of Secrets, unleashing a Basilisk on the school's Muggle-born students. Most of the students who were attacked ended up petrified, but when the Basilisk finally succeeded in killing one of them, Hogwarts became in danger of closing—a consequence Riddle hadn't foreseen, which would mean him having to return indefinitely to Wool's Orphanage. Upon realising the school might not have to close if the perpetrator were caught, Riddle stopped attacking students with the Basilisk, closed the Chamber of Secrets, and framed Hagrid, who was known for his love of dangerous creatures and at the time was raising Aragog, a young Acromantula, for the crime. Hagrid managed to protect Aragog and even threw Riddle to the ground when he tried to curse him, making Hagrid the only person to challenge Riddle while he was a student. Despite this, Hagrid was expelled from Hogwarts, and the school was allowed to remain open. Believing in Hagrid's innocence, however, Professor Albus Dumbledore convinced Headmaster Armando Dippet to allow Hagrid to stay on at Hogwarts as Gamekeeper. Tom Riddle never felt remorse for framing Hagrid and ruining his life. As Riddle went on to become Voldemort, Hagrid joined the Order of the Phoenix and fought against Lord Voldemort and his Death Eaters in the First Wizarding War. In 1981, Hagrid was devastated when Voldemort murdered his friends James and Lily Potter, but shared in the relief of the rest of the Wizarding world when Voldemort lost his powers and disappeared after failing to kill young Harry Potter. Although many believed that Voldemort was dead, Hagrid, agreeing with Dumbledore, believed that he would one day return to power. Along with the vast majority of the Wizarding community, Hagrid refused to say Voldemort's name, generally referring to him as \"You-know-who\" although he once reluctantly said Voldemort's name when explaining his background to Harry. Since Voldemort had a certain respect for Hogwart's professors, it is not known if that included Hagrid, who taught Care of Magical Creatures. This is unlikely considering Hagrid's half-giant status., 282543=Following his failure to kill either Dumbledore or Harry at the ministry, Voldemort assigned Draco Malfoy to carry out Dumbledore's assassination. Dumbledore became aware of this plot, and addressed it by arranging his own death with Severus Snape. At the time of his death in 1997, Albus Dumbledore had fully equipped Harry Potter with the physical, mental and emotional tools he needed to defeat Voldemort once and for all in 1998. Later on, during his search for the Elder Wand, Voldemort broke into Dumbledore's tomb., 86076=There were, at the time, two babies to whom the prophecy could refer — Harry Potter, the half-blood son of James and Lily Potter; and Neville Longbottom, the pure-blood son of Alice and Frank Longbottom. Both families had sought to thwart Voldemort three times, and both families were members of the Order of the Phoenix. Both children in question were born at the end of the seventh month, July. Voldemort chose to target Harry instead of Neville; Dumbledore suspected this was because Harry shared a similar family heritage with Voldemort, both of them being half-bloods.[18], 169700=Voldemort then called a one-hour armistice, requesting Harry Potter in exchange for peace and no further deaths. Unbeknownst to Voldemort, Harry carried within him the seventh Horcrux, the scar on his forehead, which was formed when Voldemort failed to kill him in 1981. When Harry met Voldemort in the Forbidden Forest, Voldemort used the Killing Curse on him almost immediately, but only destroyed the Horcrux, rendering his scar \"normal.\" What was not revealed to Voldemort was that when he used Harry's blood three years prior to gain himself a new body, the blood passed Harry's mother's protection to Voldemort and anchored Harry to the living world through Voldemort. Harry was merely knocked to the ground and feigned death. Voldemort, as a result of destroying his soul shard in Harry, was also knocked out.[16], 105579=Voldemort returned to the Albanian forest, weaker than ever. He had to wait yet again for someone to help him. Sometime before 1992, Lucius Malfoy came into possession of Tom Riddle's Diary. This was the same diary created as a Horcrux by Tom Marvolo Riddle as a boy in the 1940s. Malfoy planted the diary on eleven-year-old Ginny Weasley, who brought it to Hogwarts. She began writing in it, and found that a sixteen-year-old Tom Riddle was answering. She found comfort in the diary, not knowing she was being manipulated. The diary slowly drained the life and energy from Ginny, transferring it to itself. Under the diary's control, Ginny re-opened the Chamber of Secrets and released the basilisk, which petrified several students. While possessed, she also killed Hagrid's roosters and wrote threatening messages on the school corridors in rooster blood. Ginny became upset and confused, knowing that the diary was doing something to her, and tried to flush it down the toilet in Moaning Myrtle's bathroom. Harry Potter and Ron Weasley accidentally stumbled upon it, and Harry began communicating with the diary.[14], 321935=In 1993, Sirius Black escaped from Azkaban, where he had been detained after Pettigrew framed him for his own crimes, and Black followed Pettigrew to Hogwarts. By chance, after Harry Potter convinced Black not to murder Pettigrew on the spot, he managed to transform back into a rat, and escaped. With nowhere else to go, Pettigrew fled to Albania to seek protection from Black in the service of Lord Voldemort. Pettigrew proved his usefulness by sending Voldemort Bertha Jorkins, who told them where to find Bartemius Crouch Jr. Pettigrew later played a key role in Voldemort's rebirth by sacrificing his hand to the potion that allowed Voldemort to acquire a new body. Despite all this, Voldemort still reviled Pettigrew for his obvious cowardice and past loyalty issues, and spoke in utter contempt for his servant., 376715=Shortly after Voldemort lost his powers in 1981, the Longbottom family suffered at the hands of Bellatrix Lestrange, her husband Rodolphus, her brother-in-law Rabastan, and Barty Crouch Jr., who tortured Alice and Frank Longbottom, new parents to Neville Longbottom, to the point of insanity. They became permanent residents of St Mungo's Hospital for Magical Maladies and Injuries, and Neville was left to be raised by his grandmother, Augusta Longbottom. During the Battle of Hogwarts in 1998, Neville openly defied Voldemort and was tortured. However, he survived, and destroyed Voldemort’s last remaining Horcrux when he beheaded Nagini using the Sword of Gryffindor., 267871=Tom Riddle grew up in a Muggle orphanage, not knowing any members of his family. His mother, Merope Gaunt, died shortly after giving birth, apparently never attempting to save herself through magical means. Riddle’s father showed complete indifference towards his son, as he left his wife while she was pregnant and never attempted to track down the whereabouts of their child. The two met face-to-face in 1943, when Riddle killed his father and paternal grandparents. Riddle was disgusted by his Muggle relatives, and took on the alias \"Lord Voldemort\" partly out of a desire to be rid of his “filthy Muggle father’s name”., 361883=In 1995, after his resurrection, Voldemort dispatched his Death Eaters to convince the giants to join their side, while Dumbledore had sent Hagrid and Olympe Maxime to do the same. While Hagrid and Maxime were on good terms with the Gurg, Karkus, the Death Eaters supported the giant Golgomath in an uprising that resulted in Golgomath beheading Karkus and taking over the giant colony. The giants then attacked Hagrid and Maxime, who were forced to retreat., 347524=In 1996, Slughorn left retirement and returned to Hogwarts to replace Severus Snape as Potions master. Albus Dumbledore gave Harry Potter the task being \"collected\" by Slughorn and retrieving the original version of the memory. Harry managed to get the memory from Slughorn in 1997, with the help of Felix Felicis, copious amounts of mead, and Slughorn's fondness for Harry's mother, who had been another of Slughorn's favourites. The memory confirmed suspicions Dumbledore had about the steps Voldemort had taken to become immortal, which proved to be of vital importance in Voldemort's ultimate defeat., 365669=On Voldemort's orders, Quirrell returned to London in 1991 and broke into Vault 713 at Gringotts Wizarding Bank to procure the Philosopher's Stone, only to find that it had been emptied earlier that day and the Stone transferred to Hogwarts School of Witchcraft and Wizardry by Rubeus Hagrid., 20002=Tom Marvolo Riddle was born on 31 December, New Year's Eve, 1926 at Wool's Orphanage in London. His pure-blood mother, Merope Gaunt, a direct descendant of Salazar Slytherin, died shortly after his birth. Soon before her death, she named the child after his father, Tom Riddle Sr., and Marvolo Gaunt, her father. Tom Riddle Sr. was a wealthy Muggle living in the village of Little Hangleton who was tricked into a relationship with Merope through probable use of a Love Potion[12] After some time, it is speculated by Dumbledore that Merope discontinued her use of love potions on Tom, in the hopes that he had really fallen in love with her, or would at least stay for their child's sake. To Merope's great sorrow, he abandoned her and their unborn child.[13], 485673=Pius Thicknesse (de jure) 1997-1998, 33528=Tom was educated at Hogwarts School of Witchcraft and Wizardry from 1938 to 1945, and was Sorted into Slytherin House, a nod to his ancestor Salazar Slytherin himself. During summer breaks, he was forced to return to the Muggle orphanage, which he despised and dreaded more than any other place on earth., 301707=Although Bellatrix was married to one of Voldemort's other Death Eaters, Rodolphus Lestrange, the union seemed to be nothing more than a business-like partnership. It was Voldemort to whom she spoke in a romantic manner. She was outraged by anyone showing him the slightest disrespect. When Harry Potter called him by his name in 1996, she became enraged, feeling that he was unworthy of speaking the name., 274016=In 1994, Peter Pettigrew milked the venom from Nagini's fangs, which he used in a potion that allowed Voldemort to regain a basic physical form. That same year, Voldemort made Nagini a Horcrux with the murder of Bertha Jorkins. Though he had often sent Nagini on personal missions, Voldemort kept her close to him after he discovered Harry was attempting to track down and destroy his Horcruxes. Nagini was beheaded by Neville Longbottom during the Battle of Hogwarts, and Voldemort felt rage and perhaps even grief at the loss of his snake. As Nagini was the last remaining Horcrux, her death allowed for Voldemort's ultimate defeat., 375514=James and Lily Potter were members of the Order who became prime targets for Voldemort during the First Wizarding War, after Voldemort heard of a prophecy foretelling of a child destined to destroy him. This fit the description of their young son, Harry. On 31 October, 1981, Voldemort found the Potters after the Fidelius Charm they had cast was broken by Peter Pettigrew. Voldemort killed James first and ordered Lily to stand aside, so he could kill Harry. When Lily refused to stand aside, Voldemort killed her as well, making her murder a sacrifice that caused the Killing Curse Voldemort aimed at Harry to backfire; Voldemort lost his body and fled to Albania., 72041=In 1970, Voldemort started the First Wizarding War by taking advantage of the wizarding world's greatest weakness: the beings and creatures that they had outcast. The Dark Lord recruited the giants, who had long ago been driven by wizards into the mountains, and werewolves, who were persecuted by most witches and wizards. Many feared the goblins would also join him, as they were restricted from wand use, but it never happened. In fact, Voldemort would murder a family of goblins near Nottingham at some point during the War, for an unknown reason (possibly no reason at all.), 142023=In 1996, Draco Malfoy was inducted as a Death Eater, as Voldemort required a spy within Hogwarts. He ordered Draco to kill Albus Dumbledore, for he wished to punish Lucius Malfoy for his failings by giving his son a task he could not do. If Draco failed, he would meet terrible consequences. However, Draco was able to sneak a group of Death Eaters into Hogwarts through a pair of Vanishing Cabinets that connected Borgin and Burkes with the Room of Requirement. The Battle of the Astronomy Tower ensued.[13], 14857=His accomplishments included the opening of Salazar Slytherin's Chamber of Secrets and the use of its monster to attack Muggle-born students; several months' service as a purchasing agent for the Dark artefacts shop Borgin and Burkes; and the attainment of immortality between the years of 1942 and 1998, a process begun upon the creation of his first Horcrux at the age of 16. Abandoning his 'Muggle' name, he became the self-proclaimed Lord Voldemort, commanded a veritable army of wizards and Dark creatures, committed numerous murders personally and through his followers, on one occasion nearly succeeded and on a later occasion did succeed in taking over the Ministry of Magic by installing a puppet Minister. Splitting his soul into a total of eight pieces, Lord Voldemort created seven Horcruxes, one unintentionally and without his knowledge. , 362582=In 1998, Hagrid fought in the Battle of Hogwarts and was captured by the Death Eaters. After Harry sacrificed himself to be killed, Voldemort ordered a grieving Hagrid to carry his friend’s “dead” body in his arms, where it would be clearly visible to Harry's supporters. When Harry finally defeated the Dark Lord, Hagrid was amongst the first few who were able to congratulate him on his triumph., 369460=Tom Riddle grew up at the Muggle orphanage where his mother brought him shortly before her death in 1926., 378349=Alastor \"Mad-Eye\" Moody was a highly skilled Auror and active member of the Order who fought against Voldemort during the First Wizarding War. After Voldemort’s first downfall in 1981, Moody was responsible for rounding up a number of Death Eaters, such as Igor Karkaroff, and killing several others, like Evan Rosier. In 1994, Voldemort ordered Barty Crouch Jr to kidnap Moody and imprison him in his own trunk. For the next nine months, Crouch used Moody's hair to brew the Polyjuice Potion that would allow him to take Moody's place as temporary professor of Defence Against the Dark Arts at Hogwarts School of Witchcraft and Wizardry. In 1995, Crouch used his position at Hogwarts to make sure Harry Potter was transported to the Little Hangleton graveyard, where Peter Pettigrew used Harry's blood in a potion that allowed Voldemort to be restored to his body. When Voldemort failed to kill Harry in the graveyard and Harry returned to Hogwarts, Barty Crouch Jr. attempted to murder him personally. Dumbledore, Minerva McGonagall, and Severus Snape rescued Harry, after which Crouch was exposed, and Moody was freed. After Dumbledore’s death in 1997, Moody took charge of the Order of the Phoenix, until he was murdered by Voldemort during the Battle of the Seven Potters., 281346=In 1996, Dumbledore and Voldemort met face to face in the Ministry of Magic during the Battle of the Department of Mysteries, where Dumbledore addressed Voldemort as “Tom” and said it was foolish of him to come to the Ministry. Voldemort initiated a duel with Dumbledore, during which he tried to murder both Dumbledore and Harry, but was unsuccessful; Dumbledore's power equalled, his own, and Harry was able to exorcise the Dark Lord from his body and mind by focusing on his intense feelings of grief over Sirius' death. Cornelius Fudge arrived at the Ministry in time to see Voldemort escape with Bellatrix Lestrange, and was finally forced to acknowledge the truth of Voldemort's return., 380959=Nearly all of the Weasley family was active within the Order of the Phoenix. They fought against Voldemort during both the First and Second Wizarding wars. They lost family members such as Fabian and Gideon Prewett, who were brothers of Molly Weasley, and Fred Weasley, who was killed in the Battle of Hogwarts. Voldemort had previously tried to manipulate Ginny Weasley in 1992, in an attempt to return to physical form, through one of his Horcruxes. Voldemort was furious when Molly defeated Bellatrix, and would have killed her, had Harry not intervened. Most of the Weasley family watched the final duel between Voldemort and Harry, and were witnesses to Voldemort’s death., 41197=The basilisk injured many at Hogwarts in 1943. The last victim was a student named Myrtle Warren, who was killed in the girls' bathroom when she saw the basilisk's yellow eyes. Hogwarts was to be closed, but Tom did not want to return to the orphanage. During that year, he even made a special request that Headmaster Dippet ould allow him to stay at school over the summer break. To keep the school from shutting down, he framed fellow student Rubeus Hagrid and his pet Acromantula, Aragog. Tom convinced then-Headmaster Armando Dippet that Aragog was the monster that had terrorised the school. Hagrid was expelled, although he stayed as gamekeeper, and Tom received an engraved trophy for Special Services to the School.[14], 96101=In 1991, Voldemort formed a plan to regain his physical body. Hogwarts Professor Quirinus Quirrell had made a voyage to Albania, where his foolish and gullible mind was vulnerable to Voldemort. He latched onto Quirrell's body and came back to Hogwarts with him. Voldemort ordered Quirrell to drink the blood of unicorns in the Forbidden Forest so he could gain strength from the unicorn's healing abilities., 339253=Other individuals who showed disloyalty were Igor Karkaroff who betrayed many of his former comrades to the Ministry in return for his freedom from Azkaban, and went on to become Headmaster of Durmstrang Institute. Though he was still a pure-blood supremacist and did not accept Muggle-borns into his school, Karkaroff fled following Voldemort's return and was consequently killed by Death Eaters in 1996. Peter Pettigrew joined Voldemort out of cowardice, did not attempt to search for him following his first downfall, hid from his fellow Death Eaters in the form of the Weasley family pet rat Scabbers and only rejoined him when he was flushed out by Sirius Black who he framed for his own crimes. Walden Macnair claimed to have been under the Imperius Curse to avoid Azkaban and did not attempt to find Voldemort after his first downfall. Yaxley managed to avoid Azkaban and did not attempt to find Voldemort after his downfall, believing him finished., 224734=He also seemed to have admired bravery and skill, even when displayed by some of his enemies. After his return in 1995, he remarked to Harry that Harry's father had died \"straight-backed and proud\". Previously, at the end of Harry's first year at Hogwarts, he had referred to the Potters as \"brave\" and said that James Potter I \"put up a courageous fight\". During the Battle of Hogwarts, he appreciated Neville Longbottom's \"spirit and bravery\" and wanted him to become a Death Eater. Neville refused., 1470=31 December, 1926 Wool's Orphanage, London, England[1], 2012=2 May, 1998 (aged 71) Great Hall, Hogwarts Castle, Scotland, 299692=Bellatrix Lestrange was among Voldemort’s most loyal and trusted Death Eaters. She was entrusted with one of his Horcruxes, though kept unaware of what it really was. It was stored in her Gringotts vault. She was fanatically loyal to her master. After his first defeat in 1981, she did not join many of her fellow Death Eaters in denying their association with him. Instead, she proudly declared that she remained his most loyal servant and that he would surely return. She considered Azkaban a place where she could wait for him, rather than a prison., 306826=Barty Crouch Jr. helped Voldemort regain a physical body by capturing and imprisoning Alastor Moody, a retired Auror, who was about to accept Dumbledore's offer to teach Defence Against the Dark Arts at Hogwarts. Disguised as Moody, Barty Crouch entered Harry's name into the Goblet of Fire and helped ensure that he would win the Triwizard Tournament. By turning the Triwizard Cup into a Portkey, Crouch made sure Harry was transported to the Little Hangleton graveyard, where Peter Pettigrew used Harry's blood to concoct a potion that would allow Voldemort to be reborn. After Voldemort failed to kill Harry in the graveyard, Harry returned to Hogwarts, where Barty Crouch attempted to kill him personally, no longer pretending to be Alastor Moody. Harry was saved by Albus Dumbledore, Severus Snape and Minerva McGonagall, and Barty Crouch was given the Dementor's Kiss., 132240=In 1995, Dumbledore reconvened the Order of the Phoenix once more, using Sirius Black's family home at 12 Grimmauld Place as headquarters. Harry Potter, Hermione Granger, and Ron Weasley set up a similar organisation at Hogwarts called Dumbledore's Army, which was originally created to thwart the Ministry's meddling at the school under Dolores Umbridge.[18], 144867=Voldemort then took over Malfoy Manor as his headquarters. During the summer of 1997, he captured the Hogwarts Professor of Muggle Studies, Charity Burbage, and killed her during a meeting at Malfoy Manor with his Death Eaters before feeding her to Nagini. He also imprisoned and interrogated the kidnapped wandmaker, Garrick Ollivander, about why his wand could not duel against Harry Potter's wand. Ollivander revealed that their wands shared the same core, and would not work properly against each other. This came as a great relief to Voldemort, who worried that Harry had escaped from him in the graveyard by superior skill. Ollivander told Voldemort that he merely needed another's wand, and so he took Lucius Malfoy's.[16], 13638=Tom Marvolo Riddle (31 December, 1926[10] – 2 May, 1998), later known as Lord Voldemort, was a half-blood wizard and considered by many to be the most powerful Dark Wizard of all time. The son of wealthy Muggle Tom Riddle Senior and witch Merope Gaunt, he was orphaned and raised in a Muggle orphanage, which remained his permanent residence through his 1938-1945 attendance at Hogwarts School of Witchcraft and Wizardry. He was a member of Slytherin house. }",
    "lastModified": "Sat, 25 Jul 2015 04:35:50 GMT",
    "textBeforeTable": "Translations of the name Curiously, Riddle began studying at Hogwarts in 1938, one year before World War II struck, and graduated in 1945, the year the war ended and the same year Dumbledore gained mastery of the Elder Wand after defeating Grindelwald. Voldemort's birth year, 1926, is a year of the Tiger on the Chinese Zodiac sign. He does indeed possess qualities that are often associated with those born under this sign: independence, ambition, a tendency to be over-confident at times, and the ability to charm and seduce others. Voldemort is similar to James Bond villian Dr. No, as well as his backstory. He is a member of international conspiracy SPECTRE, who seeks world domination through shadowy means. Dr. No had been born in China to a Chinese mother and a German father. Like Merope Gaunt, Dr. No's mother died at a very young age. His father refused to care for him when it was revealed he had a wife and kids back in Germany, and the boy was left to fend for himself. In a blood purity comparison, a younger Dr. No fell in with the Tongs, a noted Chinese gang who is mistrusting of anyone not full-blooded Chinese. After embezzling large amounts of money from the Tongs, Dr. No changed his appearance and name (although to save himself from another near-death experience when the Tongs barely failed at murdering him by a brutal beating), to include making himself bald,",
    "textAfterTable": "Appearances The Harry Potter Wiki has 498 images related to Tom Riddle. Harry Potter and the Philosopher's Stone (First appearance) Harry Potter and the Philosopher's Stone (film) Harry Potter and the Philosopher's Stone (video game) Harry Potter and the Chamber of Secrets (First identified as Tom Riddle) (Appears as a memory) Harry Potter and the Chamber of Secrets (film) Harry Potter and the Chamber of Secrets (video game) Harry Potter and the Prisoner of Azkaban (Mentioned only)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}