{
    "relation": [
        [
            "Rk",
            "1.",
            "2.",
            "3.",
            "4.",
            "5."
        ],
        [
            "Year",
            "2007",
            "2013",
            "2006",
            "2009",
            "2010"
        ],
        [
            "Dates",
            "34",
            "31",
            "39",
            "36",
            "35"
        ],
        [
            "Attendance",
            "163,537",
            "147,296",
            "184,946",
            "170,156",
            "164,285"
        ],
        [
            "Avg",
            "4,810",
            "4,751",
            "4,742",
            "4,727",
            "4,694"
        ]
    ],
    "pageTitle": "Doug Kingsmore Stadium Pictorial - Clemson Tigers Official Athletics Site",
    "title": "",
    "url": "http://www.clemsontigers.com/ViewArticle.dbml?CONTENT_ID=724747&DB_OEM_ID=28500&ATCLID=205504989",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373655363,
    "recordOffset": 373634096,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8464=Martin echoed those sentiments 12 years later after his top-ranked Seminoles salvaged the series with their only win in the series in the finale at Doug Kingsmore Stadium in 2012., 7920=“If you had told me in 1992 that we were going to go to a place where we’d be 2-13 over the next eight years, I would have gone to the administration and suggested we join another conference,” Martin told the Tallahassee Democrat. “Clemson is a very tough place to play...the toughest place to play of any place I’ve ever competed in all my years of college baseball. The good news is it’s 727 days before we have to go back to Clemson.”, 12871=Doug Kingsmore Stadium has over 4,500 permanent seats, but is capable of holding 6,272 fans thanks to a hill area down the left-field line that is popular with the Clemson student-body. The stadium attendance record was set on March 7, 2004 when 6,480 fans saw No. 5 South Carolina defeat the Tigers 8-7 in 10 innings., 14391=Former Clemson baseball star and Board of Trustees Emeritus Doug Kingsmore gave the athletic department a $1 million gift towards renovation of Clemson’s baseball stadium, formerly known as Tiger Field. During the 2002 and 2003 offseasons, Doug Kingsmore Stadium underwent radical renovations, as over $5 million was spent. Since then, many other renovations have been performed to keep Doug Kingsmore Stadium among the best in the country., 11520=Before the 2013 season, chairback seats were added in the main grandstand, replacing the bleacher seats. The videoboard was upgraded as well. After the 2013 season, the playing surfaced was re-leveled and an upgraded drainage system was installed. Home plate was also moved out 10 feet, creating more space behind home plate and shorter distances to the outfield fence., 14907=Kingsmore played for the Tigers for three seasons (1952-54). An All-ACC and All-District III outfielder in 1954, he became the first Tiger in history to hit 10 home runs in a season. He did that in 1954 while playing just 24 games. He led the ACC in home runs and runs (25) that year, and he led the Tigers in batting average (.371), slugging percentage (.742) and RBIs (27)., 5962=Doug Kingsmore Stadium, the home of Tiger baseball since 1970, has seen many changes and improvements over the years, but it has not lost its aesthetic beauty and unique feel on the west side of the Clemson University campus., 8965=Doug Kingsmore Stadium has seen steady improvement since its first season in 1970 and is now one of the top facilities in the country. Evidence of its high rating among facilities across the nation has been demonstrated in recent years, when Doug Kingsmore Stadium was named as a site for a regional and/or a super regional in 1994, 1995, 1996, 1998, 2000, 2001, 2002, 2005, 2006, 2009, 2010 and 2011., 6245=Clemson was No. 9 in the country in average attendance (4,379) in 2014. It marked the Tigers’ 21st straight top-20 finish and 13th season in a row in the top 10 in the nation. Thanks in large part to that fan support, CollegeBaseballDaily.com rated Doug Kingsmore Stadium as the No. 7 stadium in the nation in 2013., 7276=Nine times during the 1994 season, an opposing top-20 team tasted defeat at Doug Kingsmore Stadium, and four times a team ranked in the top three lost to the Tigers. Seven wins against top-20 teams, including three victories over a top-10 Florida State squad, were recorded at home in the 1996 season., 7635=In 2000, the Tigers had an 8-3 record against top-25 foes at Doug Kingsmore Stadium. After Clemson won three games against No. 2 Florida State, Head Coach Mike Martin opined on how tough it is to play at Doug Kingsmore Stadium., 9424=The renovations began during the summer of 2002, which has kept Clemson’s ballpark among the country’s best. The stadium has a brick façade that surrounds every entrance. A green roof that covers much more of the stands and a press box that is twice as large adds to the comfort of fans attending the game and the media covering it. The press box, which is accessible by elevator, includes four large booths for broadcasting and a separate media center that accommodates 18 writers., 11191=Prior to the 2010 season, the Thomas F. Chapman Grandstands were constructed behind the left-field fence, adding 1,000 seats. Chapman, who was a two-time All-ACC pitcher at Clemson (1963-65), gave $2 million to the University, $1 million of which went to the grandstands., 16012=Atlanta resident Thomas F. Chapman, retired chairman and CEO of Equifax, Inc., gave Clemson University $2 million to form a leadership program in the College of Business & Behavioral Science and to expand and enhance Doug Kingsmore Stadium. One-million dollars of the gift supports the Thomas F. Chapman Leadership Scholars Program and $1 million was used to build the Thomas F. Chapman Grandstands, adding 1,000 seats to Clemson’s baseball stadium. As a student-athlete, Chapman received an IPTAY scholarship that funded his Clemson education.  “I believe in paying back what is given to you,” he said.  “My athletic scholarship provided me an outstanding college experience and a future career in professional baseball upon graduation, as well as a quality education.” Chapman graduated from Clemson with an economics degree in 1965.  While at Clemson, he was a two-time All-ACC pitcher, including a first-team selection in 1965 when he led the ACC in strikeouts (100).  In his three years in a Tiger uniform, he had a 12-7 record and 3.12 ERA. Upon graduation, he became the first Tiger to be selected in the Major League draft when he was taken by the Philadelphia Phillies in 1965.  He played professional baseball until April of 1968, when he was called to active military service., 15351=Kingsmore played three years of professional baseball in the Baltimore Oriole organization before beginning a successful business career. He served three terms on the Clemson University Board of Trustees and became Trustee Emeritus when his elected term expired in 2002., 11947=In 2015, the stadium continued with upgrades, including a new three-story building behind the first-base dugout. It will house a state-of-the-art clubhouse, coaches offices and a player lounge among other amentities. Premium seating was also added behind home plate., 10795=Prior to the 2005 season, PawVision, the videoboard that was used in the football stadium, was moved to Doug Kingsmore Stadium. Prior to the 2008 season, new lights were installed, then a practice facility with field turf was built behind the batting cages in 2009. Additional chairback seats were also added behind the right-field fence.}",
    "textBeforeTable": "Single-Season Attendance Bests Atlanta resident Thomas F. Chapman, retired chairman and CEO of Equifax, Inc., gave Clemson University $2 million to form a leadership program in the College of Business & Behavioral Science and to expand and enhance Doug Kingsmore Stadium. One-million dollars of the gift supports the Thomas F. Chapman Leadership Scholars Program and $1 million was used to build the Thomas F. Chapman Grandstands, adding 1,000 seats to Clemson’s baseball stadium. As a student-athlete, Chapman received an IPTAY scholarship that funded his Clemson education.  “I believe in paying back what is given to you,” he said.  “My athletic scholarship provided me an outstanding college experience and a future career in professional baseball upon graduation, as well as a quality education.” Chapman graduated from Clemson with an economics degree in 1965.  While at Clemson, he was a two-time All-ACC pitcher, including a first-team selection in 1965 when he led the ACC in strikeouts (100).  In his three years in a Tiger uniform, he had a 12-7 record and 3.12 ERA. Upon graduation, he became the first Tiger to be selected in the Major League draft when he was taken by the Philadelphia Phillies in 1965.  He played professional baseball until April of 1968, when he was called to active military service.",
    "textAfterTable": "More from Clemson Baseball Baseball Guide No. 2 in Nation Schmidt, White To Return Monte Lee Baseball Camp Lee Finalizes Staff Four Named Academic All-ACC advertisement",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}