{
    "relation": [
        [
            "Line",
            "Line A",
            "Line B",
            "Line C",
            "Line D",
            "Line E"
        ],
        [
            "Termini (North / East – South / West)",
            "Binnenhof – Schiedam Centrum",
            "Nesselande – Schiedam Centrum",
            "De Terp – De Akkers",
            "Rotterdam Centraal – De Akkers",
            "Den Haag Centraal – Slinge"
        ],
        [
            "Stations",
            "20",
            "23",
            "26",
            "17",
            "23"
        ],
        [
            "Length (km)",
            "17.2",
            "20.1",
            "30",
            "21",
            "27"
        ],
        [
            "Comments",
            "To be extended to Vlaardingen West.",
            "To be extended to Hoek van Holland Beach.",
            "",
            "",
            "Part of RandstadRail."
        ]
    ],
    "pageTitle": "Rotterdam Metro - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Rotterdam_Metro",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 54,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00035-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861379215,
    "recordOffset": 861353556,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{156079=In the northeast of Rotterdam, Lines A and B branch to Binnenhof (Line A) and to Nesselande (Line B). The latter has been extended since September 2005; before that date, this line terminated at De Tochten., 160799=When the Hofplein Line was converted from a railway line to a rapid transit line in 2006, the old Hofplein station was temporarily kept as the line's southern terminus. On 17 August 2010 however a new tunnel opened, which connected the metro station at Rotterdam Centraal via a new tunnel and new Blijdorp station with the existing tracks near Melanchthonweg station., 157698=At Capelsebrug, line C branches off the main East-West section to De Terp in Capelle aan den IJssel. Until November 2002, the Calandlijn (now lines A, B and C) terminated in the west of Rotterdam, at Marconiplein. On 4 November 2002 an extension through the city of Schiedam towards Spijkenisse was opened. The extension included four new stations in Schiedam (including Schiedam Centrum railway station) and one in Pernis. Line C joins Line D at the new Tussenwater station in Hoogvliet. Line A and B trains still terminate at Schiedam Centrum, while Line C trains continue and, like those on the Line D, terminate at De Akkers station in Spijkenisse., 160205=Line D intersects with Lines A-B-C at Beurs station, the only underground interchange between metrolines in the Netherlands. Before the connection with Line E at Rotterdam Centraal was realized in December 2011, some Line D trains terminated at Slinge during rush hours., 169069=The new series 5500 trains, made between 2007 and 2009, were built for the new RandstadRail line E. The 5601-5642 trains were built to replace older Düwag stock (series 5200)., 147605=In 1982 a second line was opened, the so-called Oost – Westlijn (East – West line), running between Capelsebrug and Coolhaven stations. In the late 1990s, the lines were named after two historic Rotterdam citizens, the Erasmus Line (North – South) after Desiderius Erasmus and the Caland Line (East – West) after Pieter Caland. As of December 2009, these names were dropped again in favour of a combination of letters and colours, to emphasize and clarify the difference between the separate branches, especially of the former East – West line., 146471=The Rotterdam Metro (Dutch: Rotterdamse metro) is a rapid transit system operated in Rotterdam and surrounding municipalities by RET. The first line, called Noord – Zuidlijn (North – South line) opened in 1968 and ran from Centraal Station to Zuidplein, crossing the river Nieuwe Maas in a tunnel. It was the first metro system to open in the Netherlands. At the time it was also one of the shortest metro lines in the world with a length of only 5.9 km (3.7 mi)., 161617=For the next year, work was in progress to connect Line D to Line E at Rotterdam Centraal station. Since the completion of this project in December 2011, all trains coming from The Hague terminate at Slinge (these are line E trains), while line D continues in service between De Akkers and Rotterdam Centraal., 169599=From 2017, the metro network will be extended westward to Hoek van Holland, as RET will take over the rail line from NS. The new line will connect to the existing network at Schiedam Centrum. The project will include the construction of a new station at Maassluis.}",
    "lastModified": "Wed, 22 Jul 2015 15:08:19 GMT",
    "textBeforeTable": "Map of Rotterdam Metro List of Rotterdam metro stations See also: Lines[edit] 8 External links 7 Further reading 6 References 5 See also 4 Traction power 3 Future extensions 2 Rolling stock 1.4 Line E 1.3 Line D 1.2 Line C 1.1 Lines A and B 1 Lines Contents In 1982 a second line was opened, the so-called Oost – Westlijn (East – West line), running between Capelsebrug and Coolhaven stations. In the late 1990s, the lines were named after two historic Rotterdam citizens, the Erasmus Line (North – South) after Desiderius Erasmus and the Caland Line (East – West) after Pieter Caland. As of",
    "textAfterTable": "Lines A and B[edit] Rotterdam Metro sign at Delfshaven. In the northeast of Rotterdam, Lines A and B branch to Binnenhof (Line A) and to Nesselande (Line B). The latter has been extended since September 2005; before that date, this line terminated at De Tochten. North of Capelsebrug station, with the exception of the De Tochten-Nesselande section, Lines A and B have some level crossings (with priority), and could therefore be called light rail instead of metro. These sections also have overhead wires, while most of the system has a third rail (the other exception is Line E (RandstadRail) to The Hague). However, the term 'light rail' is not used in Rotterdam; most people just call these branches 'metro'. Line C[edit] At Capelsebrug, line C branches off the main East-West section to De Terp in Capelle aan den IJssel. Until November 2002, the Calandlijn (now lines A, B",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}