{
    "relation": [
        [
            "#",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8"
        ],
        [
            "Title",
            "The Exxilons",
            "The Darkness of Glass",
            "Requiem for the Rocket Men (Part 1)",
            "Death Match (Part 2)",
            "Suburban Hell",
            "The Cloisters of Terror",
            "The Fate of Krelos (Part 1)",
            "Return to Telos (Part 2)"
        ],
        [
            "Author",
            "Nicholas Briggs",
            "Justin Richards",
            "John Dorney",
            "Matt Fitton",
            "Alan Barnes",
            "Jonathan Morris",
            "Nicholas Briggs",
            "Nicholas Briggs"
        ],
        [
            "Featuring",
            "Leela, K-9",
            "Leela, K-9",
            "Leela, K-9, The Master",
            "Leela, K-9, The Master",
            "Leela, K-9",
            "Leela, K-9",
            "Leela, K-9, The Cybermen, Jamie McCrimmon",
            "Leela, K-9, The Cybermen, Jamie McCrimmon"
        ],
        [
            "Released",
            "January 2015",
            "February 2015",
            "March 2015",
            "April 2015",
            "May 2015",
            "June 2015",
            "July 2015",
            "August 2015"
        ]
    ],
    "pageTitle": "List of Doctor Who audio plays by Big Finish - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "http://en.wikipedia.org/wiki/List_of_Doctor_Who_audio_plays_by_Big_Finish",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 81137843,
    "recordOffset": 81059567,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2898=In May/June 2011, BBC Radio 4 Extra broadcast the Fifth Doctor stories Cobwebs, The Whispering Forest, and Cradle of the Snake. In May/June 2012, these were followed by the Seventh Doctor stories A Thousand Tiny Wings, Survival of the Fittest, Klein's Story and The Architects of History., 11489=The companion Adric has appeared; initially the role was not played by the original actor (Matthew Waterhouse) but recast and played by Andrew Sachs as an older version of the character. Waterhouse returned to the role of Adric in July 2014 in two new dramas,[6] Psychodrome by Jonathan Morris and Iterations of I by John Dorney., 17232=So far, productions have featured the Fifth (Peter Davison), Sixth (Colin Baker), Seventh (Sylvester McCoy) and Eighth Doctor (Paul McGann). Tom Baker began appearing as the Fourth Doctor in monthly releases that started in January 2012.[3] Big Finish has not licensed the rights from the BBC to produce audio dramas featuring the Doctors from the Ninth Doctor onwards., 1847=In 1999 Big Finish started producing monthly audio plays featuring the Fifth, Sixth, and Seventh Doctors, and since have released approximately thirteen of these per year, one every month, apart from September when two are released. From 2001 to 2007 the monthly audio series also featured the Eighth Doctor with his companion Charley Pollard (and, for a time, C'rizz), but these were phased out and ended due to the simultaneously-running New Eighth Doctor Adventures which ran from 2006 to 2011 and featured companion Lucie Miller. From 2008 to late 2011, only one Eighth Doctor story was produced for the monthly range: The Company of Friends (featuring companions from other media to the audio plays, and the historical figure Mary Shelley). The Eighth Doctor returned to the monthly range in new adventures with Mary Shelley in October 2011.[7] As of April 2014[update], the monthly audio series again features the Fifth, Sixth and Seventh Doctors, in the pattern of three audio plays, each featuring the same Doctor and companion, being released consecutively (and one special per year). In other words, four three-release \"seasons\" and one other special audio are released every year., 13065=Several actors who played companions of previous Doctors have appeared in other roles, including William Russell, Maureen O'Brien, Jean Marsh, Anneke Wills, Deborah Watling, Wendy Padbury, Caroline John, Katy Manning, Daphne Ashbrook and Elisabeth Sladen. Sladen also reprised Sarah Jane Smith in a spin-off series simply entitled Sarah Jane Smith. Sladen never appeared as Sarah alongside any incarnation of the Doctor for Big Finish; a series with Tom Baker was planned, but was never recorded due to Sladen's untimely death in April 2011., 5124=In 2005, six of these audio plays featuring Paul McGann as the Eighth Doctor were broadcast on the digital radio station BBC 7: Storm Warning, Sword of Orion, The Stones of Venice, Invaders from Mars, Shada (originally created for webcast on the BBC's online service), and The Chimes of Midnight. These plays were rebroadcast on BBC7 beginning in July 2006. The Chimes of Midnight was repeated again as part of \"The New Eighth Doctor Adventures\" Series 1 & 2 in 2009., 3768=On January 2007, a new series of Eighth Doctor audio adventures was broadcast on BBC7. These starred McGann alongside Sheridan Smith as the aforementioned new companion Lucie Miller. There were eight 50-minute episodes in total; the first and last stories were two parters, and the rest were single episodes. These adventures have since been released on CD. In 2008, BBC7 broadcast the second series of The New Eighth Doctor Adventures (which Big Finish had already released on CD) bar the final two-part story. All fourteen episodes were then repeated in 2009, and the final two-part story later that year. Big Finish has gone on to produce two further series of these Adventures, and four selected stories from the third series were aired in 2010, with BBC Radio 4 Extra (as Radio 7 became) skipping ahead to the fourth series in early 2013.}",
    "TableContextTimeStampAfterTable": "{149000=A fifth series of adventures will be released from January 2016, this time featuring Lalla Ward as the second incarnation of Romana and John Leeson as K9.[22], 428091=A spin-off series of audio dramas based on Torchwood, itself a 2006 television spin-off series of Doctor Who starring Captain Jack Harkness, a former companion to the Doctor. It features John Barrowman returning to his role as Captain Jack, and his team known as Torchwood. This is the second Big Finish spin-off series to utilise new series characters, following UNIT: Extinction. Big Finish announced this series in 2015.[45], 151520=A sixth series of adventures will be released from January 2017, also featuring Lalla Ward as the second incarnation of Romana and John Leeson as K9., 419100=This series has been announced for a September 2016 release, written by Simon Guerrier.[42], 306397=On 31 December 2009, Big Finish lost their license to produce or sell the short story anthologies, Short Trips. On 10 February 2010 Big Finish announced that the range would be relaunched as double CD audiobooks featuring eight new short stories each. The stories will be read by popular Doctor Who actors. Also on this day Big Finish asked for short story submissions, from anyone who hadn't written for them before, for possible inclusion on the CDs. Soon after the closing date it was announced that they had received 500 entries and that Colin Baker would be among the actors reading the stories, as well as writing the 6th Doctor story for Volume 1., 254047=It was confirmed that The Early Adventures would be commissioned for another 2 series for 2017 & 2018 .[29], 353532=Big Finish have announced there will be a ninth and a tenth series of Jago & Litefoot, to be released in 2015.[39], 419639=Vienna Salvatori (played by Chase Masterson) was introduced in the monthly range's story The Shadow Heart. In February 2013 The Memory Box was released featuring Vienna, and it was followed by a box set of adventures titled Series One., 351410=Big Finish have announced there will be a ninth and a tenth series of Jago & Litefoot, to be released in 2015.[39], 426829=A second series will be released January 2016.[44], 395771=In February 2015, Big Finish announced the UNIT: Extinction four-story box set. Featuring Kate Stewart and Osgood from New Series Doctor Who, this is the first time Big Finish has used elements from the New Series. Three more box sets were also announced to be released at six month intervals.[40], 245499=In February 2013, Big Finish announced that following the conclusions of the Lost Stories and the Companion Chronicles, they would be launching \"The Early Adventures\", a series of brand new stories starring the 1st and 2nd Doctors. The four-part plays will star surviving lead actors from the original series, and will follow a similar structure to the Companion Chronicles, mixing dialogue and narration., 181363=Following on directly from the Eighth Doctor Adventures, Dark Eyes consists of 4 box sets, each made up of 4 hour-long episodes, The first being released in November 2012 and the last in March 2015.[23], 191693=Following on directly from Dark Eyes, Doom Coalition consists of 4 box sets, each made up of 4 hour-long episodes, The first being released in October 2015. The remaining three volumes will follow across 2016 and into 2017.[24], 159898=In 2006 Big Finish began releasing audio plays featuring the Eighth Doctor. These stories are set after his travels with Charley Pollard and C'rizz (in the monthly audio series), which were subsequently ended. This stand-alone range ended in March 2011, and the Eighth Doctor appeared again in the monthly series in late 2011. The Eighth Doctor Adventures storyline continues in boxsets, beginning with Dark Eyes in November 2012., 145352=A fourth series of adventures featuring Leela will be released from January 2015, this time also starring John Leeson as K9.[22], 193801=The Companion Chronicles is an ongoing series of stories detailing adventures (usually) featuring the Doctor, as told by various former companions of his, with only one further voice actor taking part in the narration. They began in 2007 as a mini-series of four stories about adventures of the first four Doctors (none of whom appear in regular Big Finish audio plays, as William Hartnell, Patrick Troughton and Jon Pertwee died before they began and Tom Baker had declined to participate at that time), but their popularity ensured that they returned for a second mini-series, and then in July 2008 they began being released monthly throughout the year. Whilst a new story in this range was released every month of the year, the range was still sorted into 'seasons'. e.g. release 3.2 is the second story of the third season. The monthly series of Companion Chronicles ended in June 2014 but the range will continue with the June 2015 release of the four-disc First Doctor Boxset.[25]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "In 1999 Big Finish started producing monthly audio plays featuring the Fifth, Sixth, and Seventh Doctors, and since have released approximately thirteen of these per year, one every month, apart from September when two are released. From 2001 to 2007 the monthly audio series also featured the Eighth Doctor with his companion Charley Pollard (and, for a time, C'rizz), but these were phased out and ended due to the simultaneously-running New Eighth Doctor Adventures which ran from 2006 to 2011 and featured companion Lucie Miller. From 2008 to late 2011, only one Eighth Doctor story was produced for the monthly range: The Company of Friends (featuring companions from other media to the audio plays, and the historical figure Mary Shelley). The Eighth Doctor returned to the monthly range in new adventures with Mary Shelley in October 2011.[7] As of April 2014[update], the monthly audio series again features the Fifth, Sixth and Seventh Doctors, in the pattern of three audio plays, each featuring the same Doctor and companion, being released consecutively (and one special per year). In other words, four three-release \"seasons\" and one other special audio are released every year. Monthly releases[edit] Doctor Who[edit] In May/June 2011, BBC Radio 4 Extra broadcast the",
    "textAfterTable": "7 7S Genocide Machine !The Genocide Machine Dalek Empire, Part 1 Tucker, MikeMike Tucker 7th Ace, Daleks April 2000 8 6QA Red Dawn Richards, JustinJustin Richards 5th Peri, Ice Warriors May 2000 9 7CB Spectre of Lanyon Moor !The Spectre of Lanyon Moor Pegg, NicholasNicholas Pegg 6th Evelyn, Brigadier June 2000 10 6CB Winter for the Adept Cartmel, AndrewAndrew Cartmel 5th Nyssa July 2000 11 7CC Apocalypse Element !The Apocalypse Element Dalek Empire, Part 2 Cole, StephenStephen Cole 6th Evelyn, Romana II, Daleks August 2000 12 7FA Firs of Vulcan !The Fires of Vulcan Lyons, SteveSteve Lyons 7th Mel September 2000 13 SS1 Shadow of the Scourge !The Shadow of the Scourge Cornell, PaulPaul Cornell 7th Ace, Benny November 2000 14 SS2 Holy",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}