{
    "relation": [
        [
            "",
            "(Intercept)",
            "Distance to health facility",
            "Distance to health facility^2",
            "Distance to Road",
            "Distance to Road^2"
        ],
        [
            "Estimate",
            "-0.8944109",
            "-0.0806837",
            "0.0023833",
            "-7.7975250",
            "24.6081933"
        ],
        [
            "Std. Error",
            "0.0708122",
            "0.0116815",
            "0.0003205",
            "2.0432720",
            "9.8147377"
        ],
        [
            "z value",
            "-12.631",
            "-6.907",
            "7.437",
            "-3.816",
            "2.507"
        ],
        [
            "Pr(>|z|)",
            "< 2e-16 ***",
            "4.95e-12 ***",
            "1.03e-13 ***",
            "0.000136 ***",
            "0.012167 *"
        ]
    ],
    "pageTitle": "Afghanistan War: Civilian Death and Health Services | Freewheel Burning",
    "title": "",
    "url": "http://peterslarson.com/2010/12/23/afghanistan-war-civilian-death-and-health-services/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 193174291,
    "recordOffset": 193148029,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{18635=O’DONNELL, Owen. Access to health care in developing countries: breaking down demand side barriers. Cad. Saúde Pública [online]. 2007, vol.23, n.12 [cited 2010-11-23], pp. 2820-2834 . Available from: . ISSN 0102-311X. doi: 10.1590/S0102-311X2007001200003., 30156=In 2002, post invasion, the Afghan Ministry of Public Health along with the World Health Organization, UNICEF and United Nations Population Fund established a framework of basic services, which included essential mother-child health care, basic vaccinations, control of TB and malaria, nutrition and basic mental health services. Tuberculosis and malaria (largely vivax) run rampant throughout Afghanistan. Through the proactive efforts of Rural Expansion of Afghanistan’s Community Based Health Care, health care access in Afghanistan has gone from 40 to 77 percent in the past 8 years, but that still leaves more than 7 million people without any access to even the most basic of care. To put it in perspective, this would be equivalent to the entire population of Michigan having no access to any type of health care at all., 18350=Zwarenstein, M., D. Krige, and B. Wolff. 1991. The use of a geographical information system for hospital catchment area research in Natal/KwaZulu. South African Medical Journal 80: 497-500.}",
    "textBeforeTable": "Although completely reprehensible, conflict events do occur at health facilities, particularly those which are located in urban areas. The recent “Afghan War Diary”, unfortunately, confirms that they not only have occurred, but are fairly commonplace. For the purpose of this analysis, I considered any event within 100 meters of a health facility to be at the facility itself. Summing over all the events within the 100m buffer, I discovered that none to as many as 25 events occur at facilities, specifically at the Hilmand District Hospital.As many as 31 people have died in attacks on health facilities, and as many as 13 have been wounded in events on or directly proximal to a hospital or clinic. It is well worth noting, that the largest numbers of attacks on health facilities occurs not within crowded Kabul, but rather in the rural northern areas. Conflict Events at Health Facilities Geographic Access to Health Services Hospital access, in addition to overburdend by the sheer numbers of the surrounding population are mostly inaccessible to the Afghan population, as the figure on the left confirms. Accounting for elevation, slope and the rudimentary road system, the brunt of Afghanistan has no access to health services. Most areas of Afghanistan are located more than 300 or more kilometers from the nearest hospital.in developing country contexts, 5 km or more is considered to be a market of lack of access to health services. As in all",
    "textAfterTable": "Distance to Road -7.7975250 2.0432720 -3.816 0.000136 *** Distance to Road^2 24.6081933 9.8147377 2.507 0.012167 * — Signif. codes: 0 ‘***’ 0.001 ‘**’ 0.01 ‘*’ 0.05 ‘.’ 0.1 ‘ ’ 1 AIC: 14192 Conclusions The Afghani health system, already strained to the gills with immense public health challenges, suffers under the brunt of a lack of public funds in a non-existent economy, warfare, a dearth of trained physicians and the massive populations which they must serve. That conflict events which result in civilian casualties occur in the proximity to health facilities is unforgiveable and all parties in this senseless conflict would do well to respect the safety of the Afghani civilian population. While the outlook under the present government is miles above that which existed (or didn’t) under the Taliban, there is still much to do. References O’DONNELL, Owen. Access to health care in developing countries: breaking down demand side barriers. Cad. Saúde Pública [online]. 2007, vol.23, n.12 [cited 2010-11-23], pp. 2820-2834 . Available from: . ISSN 0102-311X. doi: 10.1590/S0102-311X2007001200003. Zwarenstein, M., D. Krige, and B. Wolff. 1991. The use of a geographical information system for hospital catchment area research in Natal/KwaZulu. South African Medical Journal 80: 497-500. 42.270871 -83.726329",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}