{
    "relation": [
        [
            "NO.",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "10."
        ],
        [
            "DESCRIPTION",
            "Use of hand tools",
            "Manual Handling",
            "Use of disc cutter and abrasive wheels",
            "Use of portable electrical equipment",
            "Slips, trips and falls",
            "Painting",
            "Use of pneumatic tools",
            "Surfacing and concrete works",
            "Use of ladders",
            "Site vehicles/Mobile Plant"
        ],
        [
            "L",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2",
            "2"
        ],
        [
            "S",
            "2",
            "2",
            "3",
            "3",
            "2",
            "2",
            "2",
            "2",
            "3",
            "3"
        ],
        [
            "Q",
            "4",
            "4",
            "6",
            "6",
            "4",
            "4",
            "4",
            "4",
            "6",
            "6"
        ]
    ],
    "pageTitle": "Health and Safety in Playground Equipment",
    "title": "",
    "url": "http://www.schoolplaygrounddesigners.co.uk/Risk-Assessment.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 706730223,
    "recordOffset": 706713829,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39743=Copyright 2008 - 2014 Belsize Landscapes Ltd T/A SchoolPlaygroundDesigners.co.uk Site Map, 16034=Mr Robert Sergent-Fairley is responsible for all safety aspects on site – Mobile number 0788 218 1026}",
    "lastModified": "Sun, 21 Jun 2015 15:38:14 GMT",
    "textBeforeTable": "The Identifiable Operational Risks are: (L=Likelihood, S=Severity, Q=Quantum) Installation of New Playground PROJECT Primary Schools SITE   DATE   REF Risk Assessment & Method Statement For all site activities by Company Personnel and directly employed Labour acting on behalf of Belsize Playground Designs Ltd. Safe Working Practices for Site Work METHOD STATEMENT – Pages 1 – 5 RISK ASSESSMENTS – Pages 6 – 16 INSTALLATION METHOD STATEMENT AND RISK ASSESSMENTS                   Video Prices 'How To' Guide Risk Assessment Equal Opportunities Policy Health & Safety Policy Belsize Landscapes Awards Client Quotes About London Nursery Playground Southwark Council Park Oxford Mosaic Playground Early Learning Centre Thornton Heath Croydon Mosaic Playground London Brixton London Playground Birmingham Playground Clapham North London Swindon School Playground Covered Walkways Tower Hamlets Nursery Shepherds Bush Playground Cricklewood Brent Bethnal Green Early Years Seven Kings Free School Grazebrook School Hackney Stepney East London Walthamstow Primary School Nottingham Primary School Bethnal Green Junior",
    "textAfterTable": "Control Measures Taken To Reduce Risk: NO. GENERIC RISK ASSESSMENT SHEET (or specific assessment) RESIDUAL RISK 1. No.037 4 2. No.054 4 3. No.004 6 4. No.023 6 5. No.024 4 6. No.018 4 7. No.009 4 8. No.082 4 9. No.027 6 10 No.071 4 Page 4 Belsize Playground Designers Ltd: Method Statement Installation of school playground. Brief description of work to be carried out. Erection of Play and Activity Platforms; the laying of Artificial Lawn in areas; the division of the existing large Playground into smaller Play and Learning Zones. Operations will include: Construction of Activity Platforms with Tree House. Construction of Free Standing Open Sided Octagonal Pavilions. Construction of Free Standing Playhouses. Construction of Sand Pits and Soil Pits. Construction of Timber Decking areas. Construction of Trellis surrounds. Construction of raised timber planters. Construction of Pergolas and Low Bench Seats. Construction of Water",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}