{
    "relation": [
        [
            "SECURITY",
            "Goldman Sachs Commercial Paper",
            "Canadian Imp. Bank CD",
            "Barclays Bank CD",
            "Bears Stearns Co., Inc., \\Commercial Paper",
            "Citigroup Funding, Inc., Commercial Paper",
            "Barclays Bank CD",
            "Wells Fargo Bank CD",
            "UBS Americas, Inc., Commercial Paper",
            "Toronto Dominion Bank CD",
            "Societe Generale North American Commercial Paper",
            "Dexia Delaware LLC, Commercial Paper",
            "DEPFA Bank CD"
        ],
        [
            "PURCHASE PRICE",
            "03/14/06",
            "03/15/06",
            "03/20/06",
            "03/24/06",
            "03/27/06",
            "03/28/06",
            "03/28/06",
            "03/28/06",
            "03/28/06",
            "04/03/06",
            "04/07/06",
            "04/13/06"
        ],
        [
            "MATURITY DATE",
            "03/27/06",
            "04/06/06",
            "04/20/06",
            "04/24/06",
            "04/26/06",
            "05/02/06",
            "05/05/06",
            "04/28/06",
            "04/13/06",
            "05/03/06",
            "05/08/06",
            "05/15/06"
        ],
        [
            "ORIGINAL COST",
            "3,376,467.61",
            "7,649,637.83",
            "4,860,000",
            "7,862,775.24",
            "3,381,561.46",
            "7,000,000",
            "8,000,000",
            "6,473,385.21",
            "3,500,000",
            "5,603,753.86",
            "7,505,175.66",
            "3,500,000"
        ],
        [
            "PERCENT YIELD",
            "4.53",
            "4.65",
            "4.70",
            "4.74",
            "4.75",
            "4.77",
            "4.77",
            "4.755",
            "4.79",
            "4.80",
            "4.75",
            "4.84"
        ]
    ],
    "pageTitle": " ",
    "title": "",
    "url": "http://goldengate.org/board/2006/Min-Sum/fa060428min.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 112128335,
    "recordOffset": 112109891,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12079=April 28, 2006 (For Board: May 12, 2006), 31984=The report also stated that Contract No. 2006-BT-5-RTCC was advertised on January 24, 2006.  Based on the estimated annual usage of each participating agency, bidders were asked to provide firm, fixed pricing for the two-year term of the contact, as well as for two additional one-year option periods.  Contract No. 2006-BT-5-RTCC was split into four bid categories of specific types of janitorial supplies, including the following: 1) Category A, Paper Products and Liners; 2) Category B, Soaps and Cleaners; 3) Category C, Miscellaneous Janitorial Supplies; and 4) Category D, Towels.  The report noted that AC Transit was the only RTCC member participating in Category D of this contract.  On March 28, 2006, nine bids were received and publicly opened.  Clean Source, Inc., of San Jose, CA, submitted the lowest bid for Category A and for Category B.  Crest-Talmadge Sales, Inc., of Burlingame, CA, submitted the lowest bid for Category C., 41664=In a memorandum to Committee, Auditor-Controller Joseph Wire and General Manager Celia Kupersmith provided a financial statement entitled, Statement of Revenues and Expenses for Nine Months Ending March 2006. A copy of the report is available in the Office of the District Secretary and on the District’s web site., 39620=In a memorandum to Committee, Auditor-Controller Joseph Wire and General Manager Celia Kupersmith provided a schedule comparing categories of Bridge traffic for nine months ending March 31, 2006.  A copy of the report is available in the Office of the District Secretary and on the District’s web site., 24799=Accept the Investment Report for March 2006 prepared by Public Financial Management., 40018=At the meeting, Joseph Wire highlighted the statistics for southbound Golden Gate Bridge crossings by automobiles with cash and by automobiles using FasTrak™, as shown on page one of the report.  He pointed out that in the month of March 2006, 44.04% of southbound Bridge crossings used cash, while 52.23% used FasTrak™, representing the highest-to-date increase in the use of FasTrak™.  He stated that these statistics are noteworthy, since it shows that the market share of FasTrak™ users on the Bridge is growing significantly., 12429=A meeting of the Finance-Auditing Committee/Committee of the Whole was held in the Board Room, Administration Building, Toll Plaza, San Francisco, California, on Friday, April 28, 2006, at 9:45 a.m., Chair Stroeh presiding., 33344=Staff recommends award of Contract No. 2006-BT-5-RTCC to Clean Source, Inc. and Crest-Talmadge Sales, Inc., for the categories noted above, for a two-year term, effective May 8, 2006 through May 7, 2008, with a two one-year options to extend, exercisable by the General Manager or designee.  A copy of the report is available in the Office of the District Secretary and on the District’s web site., 42783=In a memorandum to Committee, Auditor-Controller Joseph Wire and General Manager Celia Kupersmith provided a financial statement entitled, Statement of Capital Programs and Expenditures for Nine Months Ending March 31, 2006. A copy of the report is available in the Office of the District Secretary and on the District’s web site., 31053=In a memorandum to Committee, Deputy General Manager/Bus Division Susan Chiaroni, Auditor-Controller Joseph Wire and General Manager Celia Kupersmith provided a report regarding staff’s recommendation for award of Contract No. 2006-BT-5-RTCC, Janitorial Supplies.  The report stated that in an effort to collectively obtain the best pricing, the District, as well as the members of the Regional Transit Coordinating Council of the San Francisco Bay Area (RTCC), actively participates in the joint procurement of various products commonly used by the RTCC member agencies.  The District is the lead agency for Contract No. 2006-BT-5-RTCC, Janitorial Supplies, and the other RTCC members participating in this contract are AC Transit, Central Contra Costa Transit Authority, Eastern Contra Costa Transit Authority, San Joaquin Transit and Vallejo Transit.}",
    "textBeforeTable": "      Ratify investments made by the Auditor-Controller during the period March 14, 2006, through April 17, 2006, as follows: b.         Ratify commitments and/or expenditures for the period February 1, 2006, through February 28, 2006, totaling $88,763.14; a.         The Finance-Auditing Committee recommends that the Board of Directors authorize the following actions by the Auditor-Controller:         RECOMMENDATION         Directors EDDIE/COCHRAN to forward the following recommendation to the Board of Directors for its consideration: Staff recommended and the Committee concurred by motion made and seconded by In a memorandum to Committee, Auditor-Controller Joseph Wire and General Manager Celia Kupersmith outlined commitments, disbursements and investments made on behalf of the District.  A copy of the staff report is available in the Office of the District Secretary and on the District’s web site. Nancy Jones, Public Financial Management, was not present at the meeting to provide a verbal report on the status of the District’s investment portfolio.  Ms. Jones’ written report was included in the Committee packet.         Ratify Actions by the Auditor-Controller",
    "textAfterTable": "        c. Authorize the Auditor-Controller to re-invest, within the established policy of the Board, investments maturing between April 18, 2006, and May 15, 2006, as well as the investment of all other funds not required to cover expenditures that may become available.         d. Accept the Investment Report for March 2006 prepared by Public Financial Management. Action by the Board - Resolution CONSENT CALENDAR         AYES (12):  Directors Cochran, Eddie, Kerns, Martini, McGoldrick, Newhouse Segal, Reilly, Sandoval and Stroeh; Second Vice President Boro; First Vice President Moylan; President Middlebrook NOES (0):   None       2. Authorize Filing an Application with the Metropolitan Transportation Commission for FY 06/07 Transportation Development Act and State Transit Assistance Funds to Support Bus, Ferry and Paratransit Services         In a memorandum to Committee, Auditor-Controller Joseph Wire and General Manager Celia Kupersmith reported on the availability of Transportation Development Act (TDA) statewide sales tax revenues and State Transit Assistance Act (STA) gasoline and diesel fuel sales tax revenues.  The report stated",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}