{
    "relation": [
        [
            "Date",
            "Feb 2, 2006",
            "May 19, 2009",
            "Aug 13, 2012",
            "Dec 30, 2012",
            "Feb 19, 2013"
        ],
        [
            "Code",
            "AS",
            "CC",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: INTUIT INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HART, MATT E.;REEL/FRAME:017545/0023 Effective date: 20060201",
            "",
            "",
            "",
            "Effective date: 20121230"
        ]
    ],
    "pageTitle": "Patent US20070176780 - RFID whiteboard - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20070176780?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985647.51/warc/CC-MAIN-20150728002305-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 488223324,
    "recordOffset": 488205020,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6159=The display board 101 can be any type of display board such as a whiteboard, a corkboard (such as those used for cubicle construction), a poster board, a foam board, a flexible mat, a blackboard, or a bulletin board, and be constructed of any type of board materials, including but not limited to cardboard, wood, cork, paper, cloth, slate, plastics, metals, or any material, or combination of materials, through which an RFID signal may be detected. In the example illustrated in FIGS. 1A and 1B, the display board 101 is a bulletin board. In FIG. 1A, the days of the month of January have been laid out on the calendar bulletin board. In other embodiments, the display board can be used, for example, for assigning tasks to workers or for other scheduling purposes. The boards of the present invention can be mounted in any orientation. For example, the board may lie flat on a horizontal surface, may be displayed at an angle to a horizontal surface, for example on an inclined plane, or may be mounted on a vertical surface.}",
    "TableContextTimeStampAfterTable": "{32562=Each object 110A-C has an RFID tag 112 affixed to it that uniquely identifies the object 110A-C to which it is attached. In one embodiment, the radio frequency identification tags are passive, whereas in other embodiments, the RFID tags are active. In one embodiment, the RFID tags 112 are embedded in self-adhesive stickers that are attached to the objects 110A-C. In another embodiment, the RFID tags 112 are embedded in the three-dimensional objects 110A-C themselves. The association between the object 110A-C and the RFID tag 112 can be pre-established in a computer program that links each specific RFID tag 112 to information about the object 110A-C to which it is attached. In one embodiment, this association between an object 110A-C and its RFID tag 112 can be changed in the computer program so that the RFID tag 112 can be linked to different information about the object 110A-C or can be reused for a different object 110A-C., 38289=After the scheduling calendar layout is completed, the user can post appointments by posting objects 110C onto scheduled dates. For example, a company may use the present invention for scheduling service appointments for customers. Each service request is printed on a separate object 110C with a unique RFID tag 112. In one implementation, a software application running on computing device 130 associates the tagged object 110C with the work to be performed, the location of the job, the customer name, and any other pertinent information. A user can post these objects 110C to the display board 101 on the desired dates. In some embodiments, only one object should be placed in each cell. In another embodiment, any number of objects can be placed in each position on the display board. As an example, two objects 110C have been placed on the 9 of January.}",
    "textBeforeTable": "Referenced by Finally, it should be noted that the language used in the specification has been principally selected for readability and instructional purposes, and may not have been selected to delineate or circumscribe the inventive subject matter. Accordingly, the disclosure of the present invention is intended to be illustrative, but not limiting, of the scope of the invention, which is set forth in the following claims. The present invention is well suited to a wide variety of computer network systems over numerous topologies. Within this field, the configuration and management of large networks comprise storage devices and computers that are communicatively coupled to dissimilar computers and storage devices over a network. The algorithms and operations presented herein are not inherently related to any particular computer or other apparatus. Various general-purpose systems may also be used with programs in accordance with the teachings herein, or it may prove convenient to construct more specialized apparatus to perform the required method steps. The required structure for a variety of these systems will be apparent to those of skill in the, along with equivalent variations. In addition, the present invention is not described with reference to any particular programming language. It is appreciated that a variety of programming languages may be used to implement the teachings of the present invention as described herein, and any references to specific languages are provided",
    "textAfterTable": "3M Innovative Properties Company Systems and methods for note recognition * Cited by examiner Classifications U.S. Classification 340/572.1, 235/375 International Classification G06F17/00, G08B13/14 Cooperative Classification G06Q10/10, G06F3/01, G06Q10/06 European Classification G06Q10/10, G06Q10/06, G06F3/01 Legal Events Date Code Event Description Feb 2, 2006 AS Assignment Owner name: INTUIT INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:HART, MATT E.;REEL/FRAME:017545/0023 Effective date: 20060201 May 19, 2009 CC Certificate of correction Aug 13, 2012 REMI Maintenance fee reminder mailed Dec 30, 2012 LAPS Lapse for failure to pay maintenance fees",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}