{
    "relation": [
        [
            "Cited Patent",
            "US4190316 *",
            "US4406514 *",
            "US4432604 *",
            "US4449784 *",
            "US4465333 *",
            "US4549783 *",
            "US4591231 *",
            "US4595839 *",
            "US4678264 *",
            "US4721358 *",
            "US4762388 *"
        ],
        [
            "Filing date",
            "Feb 2, 1978",
            "Mar 26, 1980",
            "Apr 28, 1982",
            "Jun 22, 1981",
            "Jan 15, 1982",
            "Apr 6, 1983",
            "May 28, 1985",
            "May 15, 1985",
            "Oct 4, 1985",
            "Nov 14, 1985",
            "Mar 15, 1985"
        ],
        [
            "Publication date",
            "Feb 26, 1980",
            "Sep 27, 1983",
            "Feb 21, 1984",
            "May 22, 1984",
            "Aug 14, 1984",
            "Oct 29, 1985",
            "May 27, 1986",
            "Jun 17, 1986",
            "Jul 7, 1987",
            "Jan 26, 1988",
            "Aug 9, 1988"
        ],
        [
            "Applicant",
            "The Deutsch Company",
            "Harris Corporation",
            "Bell Telephone Laboratories, Incorporated",
            "Trw Inc.",
            "Grumman Aerospace Corporation",
            "Tektronix, Inc.",
            "International Standard Electric Corporation",
            "Tetra-Tech, Inc.",
            "Amp Incorporated",
            "U.S. Philips Corporation",
            "E. I. Du Pont De Nemours And Company"
        ],
        [
            "Title",
            "Lens connector for optical fibers",
            "Single fiber connector for pluggable card or module optical interconnections",
            "Self-adjusting fiberoptic connector assembly",
            "Hybrid optical/electrical connector",
            "Electro-optical plug-in interconnection",
            "Connector for optically connecting an electrically-energizable light source to an optical fiber",
            "Variable optical attenuator",
            "Bidirectional optical electronic converting connector with integral preamplification",
            "Electrical and fiber optic connector assembly",
            "Optical and electrical connector device",
            "Optical connector receptacle and plug"
        ]
    ],
    "pageTitle": "Patent US4840451 - Shielded fiber optic connector assembly - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4840451?dq=5787449",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479049691,
    "recordOffset": 479018887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58571=More particularly, each light interface aperture 44 having a diameter, d, is effectively modified by the tubular projections 52 having a slightly larger internal diameter, g, and a length, l, into a tunnel-like geometry. In accordance with the invention the length l is designed to be at least three times as long as the diameter, d, is wide and preferably is at least about 3 times internal diameter, g, as well. It is believed that EMI emissions generated by a CPU within a broad range of frequencies on the rear side of rear wall 42 are substantially prevented from escaping into the socket 38 through apertures 44 by virtue of the aperture geometry which is provided with a 3:1 aspect ratio. In this manner, a broad range of EMI emission frequencies from the CPU, possibly providing detectable intelligence signals, can be substantially reduced or eliminated. The exact level of shielding which is achieved will depend upon the frequency or more accurately the wavelengths or range of EMI wavelengths desired to be blocked, and the aperture diameter, which in turn may be limited by the OED lens geometries which are commercially available., 60419=The switch aperture 140 in rear wall 42 is likewise provided with a geometry including a 3:1 aspect ratio. More particularly, with the switch shielding plate 132 installed, the switch enclosure 126 is completely surrounded by metal shielding, except at the opening provided at open end 128. The switch aperture diameter, e, is selected and is thereafter positioned in the rear wall spaced at distance from open end 128 so as to provide a length, f, between open end 128 and switch aperture 140, so that length, f, is at least about 3 times the width of switch aperture diameter, e. Furthermore, the aspect ratio of the switch aperture 140 provided by the shielded switch enclosure 126 is further characterized by at least one 90 degree bend. For EMI emissions to escape through the switch aperture 140, they must travel into open end 128, travel parallel to switch arm 176 and then make a right angle bend to exit through aperture 140., 58031=In the preferred embodiment shown herein, connector assembly 10 has been designed to provide maximum EMI emission shielding effectiveness by providing an electrically conductive metallic receptacle housing 36 which may be grounded through the panel to which it is mounted or otherwise. Every opening provided in the rear wall 42 of the plug receiving socket 38 is provided with an aperture geometry including an aperture length to aperture diameter ratio, sometimes referred to as an aspect ratio, of at least about 3:1., 27586=Different known fiber optic connectors are used for interconnecting fiber optic cables and for interconnecting OEDs to fiber optic cables. Examples of fiber optic connectors are disclosed in U.S. Pat. Nos. 4,167,303 issued Sept. 11, 1979 to Bowen et al., 4,534,616 issued Aug. 13, 1985 to Bowen et al., and 4,547,039 issued Oct. 15, 1985 to Caron et al. and Japan Patent 58-58510 published Apr. 7, 1983. Disadvantages of the known fiber optic connectors are their complexity and the resulting difficult and painstaking assembly required.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described with reference to a preferred embodiment, modifications or changes may be made therein by those skilled in this art without departing from the scope and spirit of the invention, as defined by the appended claims. In summary, the present invention provides a new and improved fiber optic connector assembly which aligns the ends of optical fibers in abutting coaxial relationship with the lenses of OEDs associated with another circuit member to provide for accurate high speed optical data transmission therebetween. In the preferred embodiment, a shielded optical fiber connector arrangement with an integral switch feature is provided characterized by reduced or eliminated EMI emission for connecting a CPU to peripheral equipment, by providing an optical fiber cable link instead of an electrical cable link and by providing the new and improved receptacle connector 12 to prevent escape of EMI from a CPU to the environment. Shielding of the receptacle connector 12 is further enhanced due to the fact that in use both the interface apertures 44, as well as the switch aperture 140, are obstructed. On the one hand, OEDs 46 and their associated internal leads 192 at least partially obstruct apertures 44 from the rear or CPU side of rear wall 42. On the other hand, switch aperture 140 is obstructed in use by switch arm 176 which is biased against rear wall 42, or by switch boss",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4964690 * Jun 9, 1989 Oct 23, 1990 Erni Elektroapparate Gmbh Pin-and-socket connector for light wave conductors US5002357 * Nov 9, 1989 Mar 26, 1991 Square D Company Optical fiber coupler US5091991 * Feb 25, 1991 Feb 25, 1992 Amp Incorporated Optical fiber connector with alignment feature US5101463 * May 3, 1991 Mar 31, 1992 Minnesota Mining And Manufacturing Company Push-pull optical fiber connector US5109453 * Mar 11, 1991 Apr 28, 1992 Amp Incorporated Optical fiber connector with latching beam mechanism US5140663 * Jun 24, 1991 Aug 18, 1992 Amp Incorporated Latching beam mechanism having plug stops for optical connector US5155784",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}