{
    "relation": [
        [
            "Citing Patent",
            "US5466884 *",
            "US5744743 *",
            "US5747714 *",
            "US8165309 *",
            "US8530736 *",
            "US8729376 *",
            "US8754316 *",
            "US20040258250 *",
            "US20120137857 *",
            "US20120240750 *",
            "US20120247306 *"
        ],
        [
            "Filing date",
            "May 10, 1994",
            "Mar 19, 1996",
            "Nov 16, 1995",
            "Jun 21, 2004",
            "Dec 2, 2011",
            "Mar 23, 2012",
            "Mar 28, 2012",
            "Jun 21, 2004",
            "Dec 2, 2011",
            "",
            ""
        ],
        [
            "Publication date",
            "Nov 14, 1995",
            "Apr 28, 1998",
            "May 5, 1998",
            "Apr 24, 2012",
            "Sep 10, 2013",
            "May 20, 2014",
            "Jun 17, 2014",
            "Dec 23, 2004",
            "Jun 7, 2012",
            "Sep 27, 2012",
            "Oct 4, 2012"
        ],
        [
            "Applicant",
            "The Board Of Trustees Of The Leland Stanford Junior University",
            "Generalmusic S.P.A.",
            "James N. Kniest",
            "Softube Ab",
            "Yamaha Corporation",
            "Yamaha Corporation",
            "Yamaha Corporation",
            "Fredrik Gustafsson",
            "Yamaha Corporation",
            "Yamaha Corporation",
            "Yamaha Corporation"
        ],
        [
            "Title",
            "Music synthesizer system and method for simulating response of resonant digital waveguide struck by felt covered hammer",
            "Pedal resonance effect simulation device for digital pianos",
            "Digital tone synthesis modeling for complex instruments",
            "System and method for simulation of non-linear audio equipment",
            "Musical tone signal synthesis method, program and musical tone signal synthesis apparatus",
            "Musical sound synthesizing apparatus",
            "Musical sound signal generation apparatus",
            "System and method for simulation of non-linear audio equipment",
            "Musical tone signal synthesis method, program and musical tone signal synthesis apparatus",
            "Musical sound synthesizing apparatus",
            "Musical sound signal generation apparatus"
        ]
    ],
    "pageTitle": "Patent US5304734 - Musical synthesizing apparatus for providing simulation of controlled damping - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5304734?ie=ISO-8859-1&dq=7,346,539",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 465053307,
    "recordOffset": 465024646,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The preferred embodiments are described supposing the case in which the present invention is applied to the synthesis of musical tones generated by a percussive string instrument. However, the application of the present invention is not restricted to this case. The present invention is applicable to the synthesis of musical tones which are generated by other acoustic instruments, for example, plucked string instruments and the like. Further more, the mute performance performed on wind instruments, and harmonic performance performed on guitars and the like can be simulated by the present invention. In addition, the present invention can be implemented not only in digital circuits but also analog circuits, and software processing operated by DSP (Digital Signal Processor). In the above-described preferred embodiments, the value of the damping control signal Fd corresponding to the pressure applied to the string by the damper is fixed. However, the value of the damping control signal Fd must not be a constant value. For example, the damping control signal Fd can be controlled in response to the pressure by which keys are released. In this case, the release operation in an acoustic piano is actually simulated. In an actual acoustic piano, the characteristics of the individual hammer and damper are different, key by key. For this reason, in the above-described preferred embodiments, it is more effective for realistic performance, to control the multiplication coefficients of the multipliers provided in the excitation",
    "textAfterTable": "US5241127 * Dec 20, 1990 Aug 31, 1993 Yamaha Corporation Musical tone synthesizing apparatus EP0248527A2 * Apr 29, 1987 Dec 9, 1987 The Board Of Trustees Of The Leland Stanford Junior University Digital reverberation system * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US5466884 * May 10, 1994 Nov 14, 1995 The Board Of Trustees Of The Leland Stanford Junior University Music synthesizer system and method for simulating response of resonant digital waveguide struck by felt covered hammer US5744743 * Mar 19, 1996 Apr 28, 1998 Generalmusic S.P.A. Pedal resonance effect simulation device for digital pianos US5747714 * Nov 16, 1995 May 5, 1998 James N. Kniest Digital tone synthesis modeling for complex instruments US8165309 * Jun 21, 2004",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}