{
    "relation": [
        [
            "Citing Patent",
            "US8270303",
            "US8391825 *",
            "US8417776 *",
            "US8452153",
            "US20050008261 *",
            "US20070019068 *",
            "US20120076297 *",
            "US20120311678 *"
        ],
        [
            "Filing date",
            "Dec 21, 2007",
            "Jul 21, 2006",
            "Aug 25, 2008",
            "Jul 11, 2003",
            "Jul 11, 2003",
            "Jul 21, 2006",
            "Sep 24, 2010",
            "Dec 10, 2010"
        ],
        [
            "Publication date",
            "Sep 18, 2012",
            "Mar 5, 2013",
            "Apr 9, 2013",
            "May 28, 2013",
            "Jan 13, 2005",
            "Jan 25, 2007",
            "Mar 29, 2012",
            "Dec 6, 2012"
        ],
        [
            "Applicant",
            "Hand Held Products, Inc.",
            "Kangaroo Media, Inc.",
            "Vere Software, Inc.",
            "Ricoh Company, Ltd.",
            "Ricoh Company, Ltd., A Japanese Corporation",
            "Marc Arseneau",
            "Hand Held Products, Inc.",
            "Nec Corporation"
        ],
        [
            "Title",
            "Using metadata tags in video recordings produced by portable encoded information reading terminals",
            "System and methods for enhancing the experience of spectators attending a live sporting event, with user authentication capability",
            "Online evidence collection",
            "Associating pre-generated barcodes with temporal events",
            "Associating pre-generated barcodes with temporal events",
            "System and Methods for Enhancing the Experience of Spectators Attending a Live Sporting Event, with User Authentication Capability",
            "Terminal for use in associating an annotation with an image",
            "Content delivery system, content delivery method, application server system, user equipment, and recording medium"
        ]
    ],
    "pageTitle": "Patent US7685428 - Transmission of event markers to data stream recorder - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7685428?dq=7051018",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463954923,
    "recordOffset": 463919013,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Multi-user timestamping can be summarized by identifying those portions of the timestamped information stream that are associated with a user. Then, for that user, the portions of the timestamped information stream can be represented by an image or the like and grouped according to event marker. This can be repeated for each user. It can be appreciated that this multi-user configuration is applicable whether the timestamp information is stored separately from the information stream, or incorporated into the information stream. Since the annotations are incorporated into the information stream, “clock drift” between the observer's clock and the data source clock can be avoided. There is no need to ensure synchronous time bases, since the annotations are incorporated into the information stream at the time of receipt of the timestamp. Indeed, the distinction between transmitter time value and data stream time value allows a user to mark a video stream much later than the time it was originally received. For example, a reviewer could mark events in a video years after the original recording date. The date and time is captured directly in the annotations, allowing a later analysis to determine exactly when annotations were added to the stream. This aspect of the invention facilitates “notarization” of a real-time data source. The combination of encryption and un-guessable event markers (which can be facilitated by the use of two-dimensional barcodes to hold sufficiently large amounts",
    "textAfterTable": "US6424385 Sep 8, 1995 Jul 23, 2002 Sony Corporation Still image system US6745234 * Aug 19, 1999 Jun 1, 2004 Digital:Convergence Corporation Method and apparatus for accessing a remote location by scanning an optical code US6883162 * Jun 6, 2001 Apr 19, 2005 Sun Microsystems, Inc. Annotations for transaction tracing US6898709 * Oct 28, 1999 May 24, 2005 Time Certain Llc Personal computer system and methods for proving dates in digital data files US6950623 * Sep 18, 2001 Sep 27, 2005 Loudeye Corporation Methods and systems for dynamically serving in-stream advertisements US6954859 * Oct 8, 1999 Oct 11, 2005 Axcess, Inc. Networked digital security system and methods US7034679 * Dec 31, 2001 Apr 25, 2006 Ncr Corporation System and method for enhancing security at a self-checkout station US7089420",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}