{
    "relation": [
        [
            "Citing Patent",
            "US7610809",
            "US7736931",
            "US8079262",
            "US8122767",
            "US8171793",
            "US8176782",
            "US8544326 *",
            "US20110138913 *",
            "US20140208849 *",
            "EP2053412A2 *",
            "EP2175285A1 *"
        ],
        [
            "Filing date",
            "Jan 18, 2007",
            "Jul 20, 2009",
            "Oct 26, 2007",
            "Oct 8, 2008",
            "Jul 31, 2008",
            "Apr 25, 2007",
            "May 20, 2010",
            "",
            "Jan 28, 2013",
            "Oct 21, 2008",
            "Oct 1, 2009"
        ],
        [
            "Publication date",
            "Nov 3, 2009",
            "Jun 15, 2010",
            "Dec 20, 2011",
            "Feb 28, 2012",
            "May 8, 2012",
            "May 15, 2012",
            "Oct 1, 2013",
            "Jun 16, 2011",
            "Jul 31, 2014",
            "Apr 29, 2009",
            "Apr 14, 2010"
        ],
        [
            "Applicant",
            "Freescale Semiconductor, Inc.",
            "Rosemount Aerospace Inc.",
            "Rosemount Aerospace Inc.",
            "Honeywell International Inc.",
            "Honeywell International Inc.",
            "Panasonic Electric Works Co., Ltd.",
            "Electronics And Telecommunications Research Institute",
            "Electronics And Telecommunications Research Institute",
            "Analog Devices, Inc.",
            "Rosemount Aerospace Inc.",
            "Honeywell International"
        ],
        [
            "Title",
            "Differential capacitive sensor and method of making same",
            "Wafer process flow for a high performance MEMS accelerometer",
            "Pendulous accelerometer with balanced gas damping",
            "D'arsonval movement mems accelerometer",
            "Systems and methods for detecting out-of-plane linear acceleration with a closed loop linear drive accelerometer",
            "Capacitive sensor",
            "Vertical accelerometer",
            "Vertical accelerometer",
            "Teeter Totter Accelerometer with Unbalanced Mass",
            "Pendulous accelerometer with balanced gas damping",
            "D'arsonval movement mems accelerometer"
        ]
    ],
    "pageTitle": "Patent US20050268719 - Dynamically balanced capacitive pick-off accelerometer - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050268719?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468770779,
    "recordOffset": 468747015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36911=In the most general form, MEMS consist of mechanical microstructures, microsensors, microactuators and electronics integrated in the same environment, i.e., on a silicon chip. MEMS is an enabling technology in the field of solid-state transducers, i.e., sensors and actuators. The MEMS microfabrication technology enables fabrication of large arrays of devices, which individually perform simple tasks but in combination can accomplish complicated functions. Current applications include accelerometers, pressure, chemical and flow sensors, micro-optics, optical scanners, and fluid pumps. For example, one micromachining technique involves masking a body of silicon in a desired pattern, and then deep etching the silicon to remove unmasked portions thereof. The resulting three-dimensional silicon structure functions as a miniature mechanical force sensing device, such as an accelerometer that includes a proof mass suspended by a flexure. Existing techniques for manufacturing these miniature devices are described in U.S. Pat. Nos. 5,006,487, “METHOD OF MAKING AN ELECTROSTATIC SILICON ACCELEROMETER”; and 4,945,765 “SILICON MICROMACHINED ACCELEROMETER”; and co-pending U.S. patent application Ser. No. 10/368,160, “MEMS ENHANCED CAPACITIVE PICK-OFF AND ELECTROSTATIC REBALANCE ELECTRODE PLACEMENT” filed in the names of Aiwu Yue and Ronald B. Leonardson on Feb. 18, 2003, the complete disclosures of all of which are incorporated herein by reference.}",
    "textBeforeTable": "Referenced by While the preferred embodiment of the invention has been illustrated and described, it will be appreciated that various changes can be made therein without departing from the spirit and scope of the invention. According to one embodiment of the present invention, the dynamic centerline Cd of the S-bend flexure 304 is optionally determined as a function of the intended operational g-range of the device. Accordingly, the dynamic centerline Cd of the effective bending portion B of the flexure 304 is determined as a function of a deflection of the flexure 304 toward or away from the planar reference surface 310 to a degree consistent with a selected load or operational g-force applied to the movable acceleration sensing element 302. Optionally, the selected load or operational g-force used for determining the S-bend deflection of the flexure 304 is less than the maximum operating g-force of the device 300. The one or more metal electrode layers 104, 105 are positioned as a function of the dynamic centerline Cd of the effective bending portion B of the flexure 304 as determined when the flexure is deflected by S-bending toward or away from the planar reference surface 310. The dynamic centerline Cd of the effective bending portion B of the flexure 304 is shifted relative to the geometric centerline Cg of the relaxed and undeflected flexure. , each",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 73/514.32, 73/514.36 International Classification G01P15/08, G01P15/125, G01P15/00 Cooperative Classification H01G5/18, H01G5/40, G01P15/125, G01P15/0802 European Classification G01P15/08A, G01P15/125 Legal Events Date Code Event Description Jun 7, 2004 AS Assignment Owner name: HONEYWELL INTERNATIONAL INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MALAMETZ, DAVID L.;REEL/FRAME:015449/0485 Effective date: 20040526 May 21, 2010 FPAY Fee payment Year of fee payment: 4 May 28, 2014 FPAY Fee payment Year of fee payment: 8",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}