{
    "relation": [
        [
            "Date",
            "Jun 8, 1993",
            "Sep 15, 1993",
            "Aug 11, 1998",
            "Aug 30, 1998",
            "Nov 10, 1998"
        ],
        [
            "Code",
            "AS",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: TACHI-S CO., LTD., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KAWASAKI, KIYOSHI;REEL/FRAME:006576/0158 Effective date: 19930321",
            "Owner name: TACHI-S CO, LTD., JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KAWASAKI, KIYOSHI;REEL/FRAME:006709/0374 Effective date: 19930706",
            "",
            "",
            "Effective date: 19980830"
        ]
    ],
    "pageTitle": "Patent US5341755 - Automated multiple-needle sewing machine - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5341755?dq=4182933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986615.83/warc/CC-MAIN-20150728002306-00036-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473032899,
    "recordOffset": 473008172,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While having described the present invention as above, it should be understood that the invention is not limited to the illustrated embodiments but any other modifications, replacements and additions may be applied structurally thereto without departing from the scope and spirit of the appended claims. Accordingly, it is appreciated that in accordance with the present invention, a plurality of cover materials can be fed one after another and subject to sewing by the multiple-needle sewing device in an automated way, without causing any crease and slackened areas on the cover materials. This does not require any labor and undesired works on the part of an operator to mount each cover material on the sewing machine. In practical operation, reference being made to FIGS. 11 to 13, a plurality of cover materials (like C1, C2 and C3) are placed and transferred, one after another in a mutually connected manner, via the plural yarns (82, 83 . . . ) being continued from the sewing mechanism (B), along the longitudinal direction of the table (2). With regard to the first cover material (C1), at first, it is mounted and secured on the guide plate (1) at the mounting mechanism (A), then upon the cylinder (14) being operated, its rod (14a) is extended in the rearward direction of the table (2), transferring the cover material (C1) to the sewing mechanism (B), at which time, the sewing mechanism (B) starts",
    "textAfterTable": "US5915317 * Dec 22, 1997 Jun 29, 1999 Thrash; Patrick J. Automated gantry-type stitching system US5931107 * Dec 22, 1997 Aug 3, 1999 Mcdonnell Douglas Corporation Advanced stitching head for making stitches in a textile article having variable thickness US5953231 * Dec 22, 1997 Sep 14, 1999 Mcdonnell Douglas Corporation Automated quality control for stitching of textile articles US6000352 * Oct 15, 1997 Dec 14, 1999 Porter Sewing Machines, Inc. Method and apparatus for sewing fabric panels US6128545 * Dec 22, 1997 Oct 3, 2000 Mcdonnell Douglas Corporation Automated apparatus and method of generating native code for a stitching machine US6198983 Dec 22, 1997 Mar 6, 2001 Mcdonnell Douglas Corporation Table-driven software architecture for a stitching system US6834603 Aug 15, 2002 Dec 28, 2004 Atlanta Attachment Company Attachment gusset with ruffled corners and system for automated manufacture of same",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}