{
    "relation": [
        [
            "Date",
            "Jul 8, 1985",
            "Jun 13, 1989",
            "Oct 28, 1991",
            "Apr 16, 1996",
            "Sep 8, 1996",
            "Nov 19, 1996"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: TRIMEDYNE, INC., 1815 EAST CARNEGIE AVENUE, SANTA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:HUSSEIN, HANY M. G.;REEL/FRAME:004428/0715 Effective date: 19850624",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 19960911"
        ]
    ],
    "pageTitle": "Patent US4768858 - Hollow fiberoptic - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4768858?dq=7,013,345/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985647.51/warc/CC-MAIN-20150728002305-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471439555,
    "recordOffset": 471415327,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26530=Various constructions have been proposed for endoscopes. For example, endoscopes have been developed where the viewing bundle is centrally disposed with the illuminating bundle consisting of a multiplicity of optical fibers surrounding the central viewing bundle so that the viewing bundle and the illuminating bundle are in co-axial alignment. (See \"Fiberoptics\", Fiberoptics OISD Encyclo- pedia 1979 at page E-97 through E-99.) At the recent OFS proceedings in Presentation No. THASS2 entitled \"Self-Imaging By Ring Core Fibers\", page 123, OFS Thursday, Feb. 18 1985, Niemeier, Ulrich and Poole presented a multi-mode optical wave guide which incorporated a single mode ring core fiber.}",
    "textBeforeTable": "Patent Citations Although the present single fiber light guide with a center region for receiving viewing bundles, transport channels, or other suitable devices therethrough has been disclosed with reference to the particular embodiments of the present invention, various modifications are possible without departing from the spirit and scope of the invention. It is therefore the object of the following claims to encompass all such modifications and variations that fall within the true spirit and scope of the invention. Referring to FIG. 3, another embodiment of the single fiber light guide 72 having a ring-shaped cross-section is illustrated having a fiber 76, outer cladding 84 and inner cladding 86. In this embodiment, the hollow fiberoptic 72 acts as a sheath with a coherent fiber viewing bundle 88 disposed in the center of the cylindrical light guide fiber 76 in a manner so that the fiber 76 is an integral part of the viewing bundle 88. Such a structure is made possible by filling the preform of the hollow fiberoptic with multiple solid fiberoptics arranged in a coherent manner to form the viewing bundle 88. The resulting assembly is then drawn through an oven so as to meld the viewing bundle and the surrounding single fiber light guide cylinder 76 together to form a structure which contains a plastic coherent bundle surrounded by a plastic fiberoptic sheath. It is noted that in order for such a structure to be made,",
    "textAfterTable": "Non-Patent Citations Reference 1 * Fiberoptics OISD Encyclopedia 1979, pp. E 97 through E 99. 2 Fiberoptics OISD Encyclopedia 1979, pp. E-97 through E-99. 3 Presentation No. THAA2, \"Self-Imaging by Ring Core Fibers\", p. 123, Thomas Niemeier, R. Ulrich, S. B. Poole. 4 * Presentation No. THAA2, Self Imaging by Ring Core Fibers , p. 123, Thomas Niemeier, R. Ulrich, S. B. Poole. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4921326 * Mar 23, 1989 May 1, 1990 Victor F. Wild Fiber optic probe US5155788 * Aug 29, 1990 Oct 13, 1992 American Telephone & Telegraph Company Optical fiber disposed in and decoupled from a reinforcing member US5169395 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}