{
    "relation": [
        [
            "Outcome",
            "Preeclampsia",
            "Gestational diabetes",
            "Abruption of placenta",
            "Haemorrhage around delivery",
            "Induction of delivery",
            "Preterm birth < 32 weeks",
            "Preterm birth < 37 weeks",
            "Low birth weight < 2500 g",
            "Small for gestational age",
            "Large for gestational age",
            "Neonatal diagnosis",
            "Respiratory diagnosis",
            "Hypoglycaemia",
            "Jaundice",
            "CNS diagnoses",
            "Low 5 min Apgar score"
        ],
        [
            "With sedatives or hypnotics",
            "283",
            "91",
            "32",
            "456",
            "1,087",
            "60",
            "389",
            "261",
            "187",
            "199",
            "894",
            "395",
            "194",
            "262",
            "96",
            "257"
        ],
        [
            "In Population",
            "25,688",
            "7,118",
            "2,379",
            "46,981",
            "81,793",
            "4,881",
            "31,394",
            "20,712",
            "16,440",
            "19,745",
            "67,057",
            "27,708",
            "14,455",
            "26,928",
            "6,940",
            "13,211"
        ],
        [
            "OR",
            "1.26",
            "1.23",
            "1.33",
            "1.13",
            "1.59",
            "1.24",
            "1.36",
            "1.31",
            "1.18",
            "1.12",
            "1.53",
            "1.60",
            "1.38",
            "1.02",
            "1.58",
            "2.18"
        ],
        [
            "95% CI",
            "1.11–1.42",
            "0.99–1.52",
            "0.93–1.89",
            "1.03–1.25",
            "1.48–1.70",
            "0.96–1.61",
            "1.22–1.51",
            "1.15–1.49",
            "1.02–1.37",
            "0.97–1.30",
            "1.42–1.64",
            "1.44–1.78",
            "1.19–1.60",
            "0.90–1.10",
            "1.28–1.93",
            "1.93–2.48"
        ]
    ],
    "pageTitle": "1. Introduction",
    "title": "",
    "url": "http://www.mdpi.com/1424-8247/6/10/1221/xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 569295215,
    "recordOffset": 569202475,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12657=When the strong teratogenic effect of thalidomide was observed in 1961 [1,2] the interest was directed towards the possibility that other drugs could also harm the human embryo and a special interest was shown drugs which like thalidomide affected the central nervous system (CNS). One reason was that as these drugs could pass the blood-brain barrier they would be apt to pass the placental barrier and reach the embryo. Examples of early studies are the McBride study on imipramine and limb defects [3] and the Safra and Oakley study [4] on an association between the use of diazepam and cleft lip/palate. During the following decades the research methodology developed and large studies were made which did not rely on retrospective information on drug use. Much interest has been paid to anticonvulsants which were identified quite early as definite human teratogens [5] and more recently to antidepressant drugs, notably selective serotonin reuptake inhibitors (SSRI).}",
    "TableContextTimeStampAfterTable": "{450034=We identified women who had reported the use of antidepressants in early pregnancy according to the Medical Birth Register for the years 1995–2006. We identified children who were likely to have ADHD from the Prescribed Drug Register during the years 2005–2008, using prescriptions for methylphenidate or atomoxetine as definitions – drugs which are relatively selective for the treatment of ADHD.}",
    "lastModified": "Thu, 14 May 2015 06:16:14 GMT",
    "textBeforeTable": "Overview of groups of CNS active drugs used in early pregnancy. Number of exposed infants. Table 1 pharmaceuticals-06-01221-t001_Table 1 gives an overview of the number of infants exposed in early pregnancy to drugs in each category. Three groups contain less than 1,000 individuals: drugs for Parkinsonism, psychostimulants, and “other CNS active drugs”. Table 1 2.2. General Information on Use of CNS-Active Drugs in Early Pregnancy During these years, 1,552,382 women gave birth—42,881 of them reported the use of at least one of the above-mentioned CNS active drugs in early pregnancy. Among all 1,575,847 infants born, 70,339 had any type of congenital malformation; 49,499 of them were classified as “relatively severe”, 16,145 had any cardiovascular defect, 11,157 of them had a ventricular septum defect (VSD) or an atrial septum defect (ASD), and 4,552 had hypospadias. The odds ratio (OR) with its 95% confidence interval (95% CI) for a specific malformation after maternal use of a specific drug (group) was estimated with Mantel-Haenszel methodology and the approximate confidence interval with Miettinen’s technique. When the expected number of exposed outcome was less than 10, a relative risk (RR) was calculated instead as the observed over expected number with 95% CI from exact Poisson distributions. In both situations, adjustment was made for year of birth, maternal age (5-year class), parity (1–4+), smoking in early pregnancy (unknown, none, <10 cigarettes/day, ≥10 cigarettes per day), and BMI (unknown, <18.5, 18.5–24.9, 25–29, 9. 30–34.9,",
    "textAfterTable": "1 19,255 687,283 1.00 Reference 2 13,245 562,633 0.78 0.76–0.80 3 6,711 210,094 0.95 0.92–0.98 ≥4 3,696 92,332 0.98 0.94–1.03 Smoking Unknown 782 95,377 - - None 33,748 1,316,102 1.00 Reference <10 cigs/day 5,211 100,330 2.30 2.17–2.30 ≥10 cigs/day 3,166 40,533 3.50 3.37–3.63 BMI Unknown 3,651 192,912 – - <18.5 980",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}