{
    "relation": [
        [
            "Part #",
            "K8AB-TH11S AC100-240",
            "K8AKAS124VACDC",
            "K8AKTH11S24VACDC",
            "2903526",
            "2903527"
        ],
        [
            "Distributor",
            "Newark / element14",
            "Allied Electronics, Inc.",
            "Allied Electronics, Inc.",
            "Digi-Key",
            "Digi-Key"
        ],
        [
            "Manufacturer",
            "OMRON INDUSTRIAL AUTOMATION",
            "OMRON INDUSTRIAL AUTOMATION",
            "OMRON INDUSTRIAL AUTOMATION",
            "Phoenix Contact",
            "Phoenix Contact"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Industrial Controls, Meters",
            "Industrial Controls, Meters"
        ],
        [
            "Description",
            "OMRON INDUSTRIAL AUTOMATION - K8AB-TH11S AC100-240 - TEMPERATURE MONITORING RELAY",
            "Relay; ultra slim 22.5 mm Single Phase CRelay; urrent Monitoring Relay",
            "Relay; slim 22.5 mm Temperature Monitoring Relay",
            "MONITORING RELAY 3PH PUSH IN TER",
            "MONITORING RELAY 3PH SCREW TERM"
        ]
    ],
    "pageTitle": "Industrial Relay Monitoring | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/industrial_relay_monitoring",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474170715,
    "recordOffset": 474140489,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{59132=Description: solution. FieldLogger features high performance along with high connectivity and easy of configuration and operation. FieldLogger’s local inputs include 8 software configurable analog inputs for thermocouples, Pt100, Pt1000, voltage and current signals. Two relay outputs and 8 digital ports, 132802=Description: The EL731 AC/DC Sensitive Earth-Leakage Relay is a revolutionary new product that finally solves common ground-fault problems associated with variable frequency drives and is equally applicable to AC, DC and mixed AC/DC systems. It detects a wide range of earth-leakage currents and can reliably, 50014=Description: IEC 60255-26:2008 is applicable to measuring relays and protection equipment for power system protection, including the control, monitoring and process interface equipment used with those systems; it specifies the essential requirements for electromagnetic compatibility for measuring relays, 93113=Description: Operates on DC ungrounded systems ranging from industrial 24- Vdc control circuits to 1000-Vdc solar and transportation systems. It provides sensitive ground-fault protection without the problems associated with nuisance tripping. Ground-fault current is sensed using an SE-GRM Series, 35214=Description: Modbus® RTU output configuration as well as a Low Power option that draws as little as 32 mA of power. The Millennium SC1100 Series is a field-proven line of industrial gas detectors specifically engineered to provide fast, accurate and continuous monitoring of flammable gases in extreme environments.}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Electronic monitoring relays Electronic monitoring relays can generally be found in industrial wastewater plants and other settings that need a warning about outofbounds voltages or electrical currents. can generally be found in industrial wastewater plants and other settings that need a warning about outofbounds voltages Compact monitoring relays with innovative connection technology downtime can be very costly, and the steady increase in sales of monitoring relays demonstrates that industrial engineers are taking proactive. steps to prevent such outages. Monitoring relays not only monitor network and system parameters, they also enable efficient planning and implementation More Information Top Indicates content that may require registration and/or purchase. industrial relay datasheets datasheets and application notes, data sheet, circuit, pdf, cross reference, pinout, datasheet | Datasheets.org.uk Monitor Relays Crouzet’s Industrial monitoring relays are preset able liquid level .. 12V",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}