{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "None",
            "Forensic club, yoga, Black student union, dance club",
            "Creative and students that think outside the box",
            "Point park is located in the heart of downtown Pittsburgh where there are a lot of theaters and other great places",
            "There's plenty of fun activities provided by the student body every week",
            "Make friends in your classes it will make the school year a lot easier and a enjoyable experience",
            "I love point park university, the campus is great. The professor are very helpful and determined to see their students do well. I would recommend for anyone enrolling in school to apply."
        ]
    ],
    "pageTitle": "Point Park University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Point-Park-University/reviews?_escaped_fragment_=/show/96999",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906860155,
    "recordOffset": 906811952,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{195927=© 2015, Cappex.com, LLC, 49898=The cafeteria is sponsored by Aramark sooooooo. . . .yeah. The cafe serves made to order food until 11:30 which is one of my favorite things about this school ; ) I get meals late at night all the time. I}",
    "textBeforeTable": "08/12/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 44 Joseph from Cochranton, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students This school is 2nd only to Juliard for dance, musical theatre and acting majors. It is a top notch university and has seen many students go onto big-time careers at different places of employment within their respective field. The school is also great for students wishing to major in cinema, digital media and the like. And it is almost a necessity that you like the city scene, as you are smack dab in the hustle and bustle of downtown Pittsburgh. Tips for prospective students Get accustomed to using elevators, as this is an urban campus which means the buildings are tall and skinny with many floors. Sometimes it takes 10 minutes to get to the first floor from my room on the 16th due to the high traffic and various stops it has to make along the way. Also, familiarize yourself with the general area around the school so that when you have free time you are able to do what and go where you want. Bang for the buck As far as value for your dollar, there are a ton of things that it buys you. Shuttles to Oakland where the Pittsburgh Playhouse is located, a site where any Point Park student can see shows for free.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}