{
    "relation": [
        [
            "Year",
            "1929",
            "1929",
            "1925",
            "1924",
            "1924"
        ],
        [
            "Rank",
            "12",
            "15",
            "16",
            "18",
            "22"
        ],
        [
            "Title",
            "“Star Dust”",
            "“Honeysuckle Rose”",
            "“Sweet Georgia Brown”",
            "“The Man I Love”",
            "“Oh, Lady Be Good!”"
        ]
    ],
    "pageTitle": "Jazz History: The Standards (1920s)",
    "title": "",
    "url": "http://jazzstandards.com/history/history-2.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 125480878,
    "recordOffset": 125472676,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{167=Introduction  Early Period  1920s  1930s  1940s  1950s  1960s  1970s-2000}",
    "TableContextTimeStampAfterTable": "{33627=The Lost Chords: 1915-1945 Pee Wee Russell, Red Norvo CD, 35734=RCA Victor 80th Anniversary, Vol. 1 (1917-1929) RCA Victor 80th Anniversary CD, 10922=Beginning in 1922, Gennett Records, an indie company located in Richmond, Indiana, began recording jazz groups performing in Chicago. The first group they recorded was the New Orleans Rhythm Kings, followed in 1923 by King Oliver’s Creole Jazz Band with young lion Louis Armstrong on second cornet. That same year Gennett waxed a series of solo piano recordings by Jelly Roll Morton. The following year they recorded The Wolverines, a northern group which had been influenced by both the New Orleans Rhythm Kings and King Oliver’s Jazz Band and featured the up-and-coming cornetist Bix Beiderbecke. Another indie company in Chicago, Paramount Records, was competing with Gennett and Okeh for jazz talent. (King Oliver’s band recorded for all three companies during 1923.), 26928=Classic Jazz: The Musicians and Recordings That Shaped Jazz, 1895-1933 Scott Yanow Paperback: 350 pages Backbeat Books, 18209=Of these twelve, only two “(Who” and “Sonny Boy”) are from Broadway shows. The underlined tunes are in the 1000 jazz standards list. Two of the tunes use the word “blues” as part of the title but aren’t really twelve-bar blues., 39995=At the Jazz Band Ball - Early Hot Jazz, Song and Dance (1993) At the Jazz Band Ball brings together some of the greatest hot music, song, and dance captured at the height of the jazz age and in the early days of sound film (1925-1933). Included are Duke Ellington\u0092s Cotton Club Orchestra, a youthful Louis Armstrong, Bo Jangles\u0094 Robinson, Bessie Smith\u0092s only screen performance, a rare clip of the Boswell Sisters, the Dorsey Brothers Band, Charlie Wellman, Tessie Maize, Ben Bernie\u0092s Orchestra, Paul Whiteman, and the only appearance of jazz legend Bix Beiderbecke in a sound film as Bix stands up and plays through an ensemble brass passage. DVD, 11863=By mid-decade jazz musicians, whose skills were honed playing the free wheeling, collectively improvised jazz of the late ‘teens and early ‘20s, were more often in reading bands performing popular tunes of the day and taking the occasional “hot” solo. Although commonly referred to as the “Jazz Age,” in retrospect the era would be more reasonably named the “Dance Age,” as America went crazy for dances like the Charleston and the Black Bottom, and the music they danced to was played by seven- to twelve-piece dance orchestras. In New York, a popular dance orchestra led by pianist Fletcher Henderson had been playing a more ragtime-influenced style of jazz until trumpeter Louis Armstrong joined up in 1925, causing a profound change in the group’s sound. Another New Orleans native, Sidney Bechet, master of the soprano saxophone, caused a similar change in the orchestra of Duke Ellington and subsequently influenced many of the decade’s saxophonists., 46201=Copyright 2005-2012 - JazzStandards.com - All Rights Reserved      Permission & contact information}",
    "lastModified": "Thu, 30 Aug 2012 00:33:14 GMT",
    "textBeforeTable": "Jazz Standards from the 1920s Generally, music written by Broadway composers, such as George Gershwin, Jerome Kern, Vincent Youmans and Cole Porter, wouldn’t begin to find its way into the jazz repertoire until the 1930s, as musicians became more attuned to sophisticated melodies and harmonies. “If I Could Be With You” “‘Deed I Do” “Sugar” “Sweet Lorraine” “I’ve Found a New Baby” “Avalon” “Bye Bye Blackbird” “Dinah” “Sweet Georgia Brown” Of these twelve, only two “(Who” and “Sonny Boy”) are from Broadway shows. The underlined tunes are in the 1000 jazz standards list. Two of the tunes use the word “blues” as part of the title but aren’t really twelve-bar blues. Based on recordings, jazz musicians in the 1920s were able to perform some original material (and compositions targeted for jazz musicians), but recording company executives wanted popular songs, too. Some of these tunes became enduring jazz standards, such as: “It Ain’t Gonna Rain No More” “Dreamy Melody” “My",
    "textAfterTable": "Click here to see the full list for this period Related Reading and Viewing Classic Jazz: The Musicians and Recordings That Shaped Jazz, 1895-1933 Scott Yanow Paperback: 350 pages Backbeat Books Jazz on the River William Howland Kenney Hardcover: 248 pages University Of Chicago Press",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}