{
    "relation": [
        [
            "WCF — Chapter XXIII: Of the Civil Magistrate",
            "1. God, the Supreme Lord and King of all the world, hath ordained civil magistrates to be under him over the people, for his own glory and the public good; and to this end, hath armed them with the power of the sword, for the defense and encouragement of them that are good, and for the punishment of evil-doers.",
            "2. It is lawful for Christians to accept and execute the office of a magistrate when called thereunto; in the managing whereof, as they ought especially to maintain piety, justice, and peace, according to the wholesome laws of each commonwealth, so, for that end, they may lawfully, now under the New Testament, wage war upon just and necessary occasions.",
            "3. The civil magistrate may not assume to himself the administration of the Word and sacraments, or the power of the keys of the kingdom of heaven: yet he hath authority, and it is his duty, to take order, that unity and peace be preserved in the Church, that the truth of God be kept pure and entire; that all blasphemies and heresies be suppressed; all corruptions and abuses in worship and discipline prevented or reformed; and all the ordinances of God duly settled, administered, and observed. For the better effecting whereof, he hath power to call synods, to be present at them, and to provide that whatsoever is transacted in them be according to the mind of God.",
            "4. It is the duty of the people to pray for magistrates, to honour their persons, to pay them tribute and other dues, to obey their lawful commands, and to be subject to their authority, for conscience' sake. Infidelity, or difference in religion, doth not make void the magistrate's just and legal authority, nor free the people from their obedience to him: from which ecclesiastical persons are not exempted; much less hath the Pope any power or jurisdiction over them in their dominions, or over any of their people; and least of all to deprive them of their dominions or lives, if he shall judge them to be heretics, or upon any other pretense whatsoever."
        ],
        [
            "LBCF — Chapter XXIV: Of the Civil Magistrate",
            "1. God, the supreme Lord and King of all the world, hath ordained civil magistrates to be under him, over the people, for his own glory and the public good; and to this end hath armed them with the power of the sword, for defence and encouragement of them that do good, and for the punishment of evil doers.",
            "2. It is lawful for Christians to accept and execute the office of a magistrate when called thereunto; in the management whereof, as they ought especially to maintain justice and peace, according to the wholesome laws of each kingdom and commonwealth, so for that end they may lawfully now, under the New Testament wage war upon just and necessary occasions.",
            "",
            "3. Civil magistrates being set up by God for the ends aforesaid; subjection, in all lawful things commanded by them, ought to be yielded by us in the Lord, not only for wrath, but for conscience' sake; and we ought to make supplications and prayers for kings and all that are in authority, that under them we may live a quiet and peaceable life, in all godliness and honesty."
        ]
    ],
    "pageTitle": "Tabular Comparison of 1646 WCF and 1689 LBCF",
    "title": "",
    "url": "http://www.proginosko.com/docs/wcf_lbcf.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 660267427,
    "recordOffset": 660218115,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{186295=Copyright © James N. Anderson 2003}",
    "lastModified": "Wed, 10 Aug 2011 13:13:24 GMT",
    "textBeforeTable": "Jump to chapter: I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII, XIII, XIV, XV, XVI, XVII, XVIII, XIX, XX, XXI, XXII, XXIII, XXIV, XXV, XXVI, XXVII, XXVIII, XXIX, XXX, XXXI, XXXII Jump to chapter: I, II, III, IV, V, VI, VII, VIII, IX, X, XI, XII, XIII, XIV, XV, XVI, XVII, XVIII, XIX, XX, XXI, XXII, XXIII, XXIV, XXV, XXVI, XXVII, XXVIII, XXIX, XXX, XXXI, XXXII, XXXIII The 1689 London Baptist Confession of Faith [alternative source] The 1646 Westminster Confession of Faith [alternative source] Note: The line between 'major' and 'minor' differences is a fine one and in some cases I've had to make a somewhat subjective judgement about the significance of certain points of divergence. If you",
    "textAfterTable": "5. We may be moved and induced by the testimony of the Church to an high and reverent esteem of the holy Scripture; and the heavenliness of the matter, the efficacy of the doctrine, the majesty of the style, the consent of all the parts, the scope of the whole (which is to give all glory to God), the full discovery it makes of the only way of man's salvation, the many other incomparable excellencies, and the entire perfection thereof, are arguments whereby it doth abundantly evidence itself to be the Word of God; yet, notwithstanding, our full persuasion and assurance of the infallible truth and divine authority thereof, is from the inward work of the Holy Spirit, bearing witness by and with the Word in our hearts. 5. We may be moved and induced by the testimony of the church of God to an high and reverent esteem of the Holy Scriptures; and the heavenliness of the matter, the efficacy of the doctrine, and the majesty of the style, the consent of all the parts, the scope of the whole (which is to give all glory to God), the full discovery it makes of the only way of man's salvation, and many other incomparable excellencies, and entire perfections thereof, are arguments whereby it doth abundantly evidence itself to be the Word of God; yet notwithstanding, our full persuasion and assurance of the infallible truth, and divine authority thereof, is from the inward",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}