{
    "relation": [
        [
            "",
            "Product Line",
            "Boston Whaler",
            "Hatteras Yachts",
            "Boston Whaler",
            "Meridian Yachts",
            "Grady White",
            "Boston Whaler",
            "Boston Whaler",
            "Meridian Yachts",
            "Azimut",
            "Atlantis",
            "Cabo",
            "Cabo",
            "Azimut",
            "Meridian Yachts",
            "Meridian Yachts",
            "Boston Whaler",
            "Harris FloteBote",
            "Nautique by Correct Craft",
            "Meridian Yachts",
            "Harris FloteBote",
            "Azimut",
            "Boston Whaler",
            "Harris FloteBote",
            "Scout",
            "Sailfish",
            "Scarab Jet Boats",
            "Atlantis",
            "Ocean Alexander Yachts",
            "Scout",
            "Aquila"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Fiscal Year",
            "1998",
            "1999",
            "2000",
            "2002",
            "2002",
            "2004",
            "2005",
            "2005",
            "2006",
            "2006",
            "2006",
            "2007",
            "2008",
            "2008",
            "2009",
            "2009",
            "2010",
            "2010",
            "2010",
            "2011",
            "2012",
            "2012",
            "2012",
            "2012",
            "2013",
            "2013",
            "2013",
            "2014",
            "2014",
            "2014"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "Geographic Regions",
            "West Central Florida, Stuart, Florida, Dallas, Texas",
            "Florida",
            "North Palm Beach, Florida",
            "Florida, Georgia, North and South Carolina, New Jersey, Ohio, Minnesota, Texas, and Delaware",
            "Houston, Texas",
            "North and South Carolina",
            "Houston",
            "Chattanooga, Tennessee",
            "Northeast United States from Maryland to Maine",
            "Northeast United States from Maryland to Maine",
            "West coast of Florida",
            "East coast of Florida",
            "Florida",
            "Arizona and Colorado",
            "Maryland and Delaware",
            "Southwest Florida",
            "Arizona, Missouri, Minnesota, New Jersey, and Tennessee",
            "West Central Florida, Georgia, Minnesota, Missouri, and Tennessee",
            "California",
            "West Central Florida",
            "United States other than where previously held",
            "Pompano, Florida",
            "Alabama, North and Southwest Florida, Wrightsville, North Carolina, and Texas",
            "Southeast Florida, Maryland, and New Jersey",
            "Connecticut, Brevard and Jacksonville, Florida, the Florida panhandle, West Central Florida, New Jersey, New York, North Carolina, Ohio, Rhode Island, and Texas",
            "All geographic regions in which we operate",
            "Florida",
            "Eastern United States",
            "Texas, New York",
            "Worldwide, excluding China"
        ]
    ],
    "pageTitle": "Form 10-K",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1057060/000119312514440112/d776959d10k.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00134-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 690848427,
    "recordOffset": 690717612,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{981146=Balance as of September 30, 2014, 553340=Selling, General, and Administrative Expenses. Selling, general, and administrative expenses increased $13.9 million, or 10.5%, to $146.4 for the fiscal year ended September 30, 2014 from $132.5 million for the fiscal year ended September 30, 2013. The fiscal year ended September 30, 2013 and 2014 included a recovery recognized of approximately $11.7 million and $555,000, net of taxes and other expenses, from the Deepwater Horizon Settlement Program for damages suffered as a result of the Deepwater Horizon Oil Spill. The fiscal year ended September 30, 2014 include a gain of approximately $1.0 million, net of store closing costs, for the sale of our Walker, Minnesota retail location. Excluding these items and making both years comparable, selling, general, and administrative expenses increased $3.8 million, or 2.6%, to $148.0 million and as a percentage of revenue decreased to 23.7% for the fiscal year ended September 30, 2014 from 24.7% for the fiscal year ended September 30, 2013. The overall increase in selling, general, and administrative expenses was primarily attributable to increased commissions resulting from increased boat sales., 983774=Exercisable as of September 30, 2014, 785549=BALANCE, September 30, 2013, 525510=consideration to which the entity expects to be entitled in exchange for those goods or services. The guidance also specifies the accounting for some costs to obtain or fulfill a contract with a customer, as well as enhanced disclosure requirements. ASU 2014-9 is effective for annual reporting periods beginning after December 15, 2016, including interim reporting periods within that reporting period. Early adoption is not permitted. We currently do not believe the adoption of this standard will have a material impact on our consolidated financial statements, 695381=We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), MarineMax Inc. internal control over financial reporting as of September 30, 2014, based on criteria established in Internal Control \u0096 Integrated Framework (1992) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated December 11, 2014, expressed an unqualified opinion on the effectiveness of the Company\u0092s internal control over financial reporting., 437133=July 1, 2014 to July 31, 2014, 911204=The availability and costs of borrowed funds can adversely affect our ability to obtain adequate boat inventory and the holding costs of that inventory as well as the ability and willingness of our customers to finance boat purchases. As of September 30, 2014, we had no long-term debt. However, we rely on our Amended Credit Facility to purchase our inventory of boats. The aging of our inventory limits our borrowing capacity as defined curtailments reduce the allowable advance rate as our inventory ages. Our access to funds under our Amended Credit Facility also depends upon the ability of our lenders to meet their funding commitments, particularly if they experience shortages of capital or experience excessive volumes of borrowing requests from others during a short period of time. Unfavorable economic conditions, weak consumer spending, turmoil in the credit markets, and lender difficulties, among other potential reasons, could interfere with our ability to utilize our Amended Credit Facility to fund our operations. Any inability to utilize our Amended Credit Facility could require us to seek other sources of funding to repay amounts outstanding under the credit agreements or replace or supplement our credit agreements, which may not be possible at all or under commercially reasonable terms., 679366=Pursuant to the requirements of the Securities Exchange Act of 1934, this report has been signed below by the following persons on behalf of the registrant and in the capacities and on the dates indicated., 963259=We are subject to tax by both federal and state taxing authorities. Until the respective statutes of limitations expire, we are subject to income tax audits in the jurisdictions in which we operate. We are no longer subject to U.S. federal tax examinations for fiscal years prior to 2011, and we are not subject to audits prior to the 2010 fiscal year for the majority of the state jurisdictions., 417591=We are party to various legal actions arising in the ordinary course of business. While it is not feasible to determine the actual outcome of these actions as of September 30, 2014, we do not believe that these matters will have a material adverse effect on our consolidated financial condition, results of operations, or cash flows., 244882=The availability and costs of borrowed funds can adversely affect our ability to obtain and maintain adequate boat inventory and the holding costs of that inventory as well as the ability and willingness of our customers to finance boat purchases. As of September 30, 2014, we had no long-term debt. We rely on our credit facility to purchase and maintain our inventory of boats. Our ability to borrow under our credit facility depends on our ability to continue to satisfy our covenants and other obligations under our credit facility. The aging of our inventory limits our borrowing capacity as defined provisions in our credit facility reduce the allowable advance rate as our inventory ages. Our access to funds under our credit facility also depends upon the ability of our lenders, to meet their funding commitments, particularly if they experience shortages of capital or experience excessive volumes of borrowing requests from others during a short period of time. Depressed economic conditions, weak consumer spending, turmoil in the credit markets, and lender difficulties, among other potential reasons, could interfere with our ability to maintain compliance with our debt covenants and to utilize our credit facility to fund our operations. Accordingly, it may be necessary for us to close additional stores, further reduce our expense structure, or modify the covenants with our lenders. Any inability to utilize our credit facility or the acceleration of amounts owed, resulting from a covenant violation, insufficient collateral, or lender difficulties, could require us to seek other sources of funding to repay amounts outstanding under our credit facility or replace or supplement our credit facility, which may not be possible at all or under commercially reasonable terms., 602620=We have audited MarineMax, Inc.\u0092s internal control over financial reporting as of September 30, 2014, based on criteria established in Internal Control \u0096 Integrated Framework (1992) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). MarineMax, Inc.\u0092s management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting, included in the accompanying management\u0092s report on internal control over financial reporting. Our responsibility is to express an opinion on the Company\u0092s internal control over financial reporting based on our audit., 8159=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.    Yes  x    No  ¨, 905130=During February 2006, we became party to a joint venture with Brunswick that acquired certain real estate and assets of Great American Marina for an aggregate purchase price of approximately $11.0 million, of which we contributed approximately $4.0 million and Brunswick contributed approximately $7.0 million. The terms of the agreement specify that we operate and maintain the service business and that Brunswick operate and maintain the marina business. Simultaneously with the closing, the acquired entity became Gulfport Marina, LLC (\u0093Gulfport\u0094). We account for our investment in Gulfport in accordance with FASB Accounting Standards Codification 323, \u0093Investment \u0096 Equity Method and Joint Venture\u0094. Accordingly, we adjust the carrying amount of our investment in Gulfport to recognize our share of earnings or losses, based on the service business we operate. The carrying amount of our investment is included in other long-term assets on the consolidated balance sheets, and our share of the earnings or losses based on the service business that we operate are included in selling, general and administrative expenses on the consolidated statements of operations., 71530=Apart from acquisitions, we have opened 31 new retail locations in existing territories, excluding those opened on a temporary basis for a specific purpose. We also monitor the performance of our retail locations and close retail locations that do not meet our expectations. Based on these factors and the recent depressed economic conditions, we have closed 59 retail locations since March 1998, excluding those opened on a temporary basis for a specific purpose, including 26 in fiscal 2009 and a total of 9 during the last three fiscal years., 698693=In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the consolidated results of operations and cash flows of MarineMax, Inc. and subsidiaries for the year ended September 30, 2012, in conformity with U.S. generally accepted accounting principles., 579181=2017, 552600=Gross Profit. Gross profit increased $11.0 million, or 7.3%, to $161.8 million for the fiscal year ended September 30, 2014 from $150.9 million for the fiscal year ended September 30, 2013. Gross profit as a percentage of revenue increased to 25.9% for the fiscal year ended September 30, 2014 from 25.8% for the fiscal year ended September 30, 2013. The increase in gross profit was primarily attributable to the increase in comparable-store sales and incrementally increased margins on new and used boat sales due to improving industry inventory and industry-wide conditions., 580286=2018, 1022057=During fiscal 2012, 2013, and 2014, we incurred costs associated with store closings and lease terminations of approximately $350,000, $162,000, and $217,000, respectively. These costs primarily related to the future minimum operating lease payments of the closed locations. The store closings were a key component in our effort to better match our fixed costs with the decline in retail business caused by the soft economic conditions. The store closing costs have been included in selling, general, and administrative expenses in the consolidated statements of operations during fiscal 2012, 2013, and 2014., 559886=Interest Expense. Interest expense decreased $229,000, or 5.2%, to $4.2 million for the fiscal year ended September 30, 2013 from $4.4 million for the fiscal year ended September 30, 2012. Interest expense as a percentage of revenue decreased to 0.7% for the fiscal year ended September 30, 2013 from 0.9% for the fiscal year ended September 30, 2012. The decrease was primarily a result of lower interest rates under our credit facility., 68847=April 2014, 578088=2016, 551644=Fiscal Year Ended September 30, 2014 Compared with Fiscal Year Ended September 30, 2013, 569539=inventory levels and proceeds from the issuance of common stock from our stock based compensation plans. For the fiscal year ended September 30, 2013, cash provided by financing activities was primarily attributable to net short-term borrowings as a result of increased inventory levels and proceeds from the issuance of common stock from our stock based compensation plans. For the fiscal year ended September 30, 2012, cash provided by financing activities was primarily attributable to net short-term borrowings associated with capital expenditures and proceeds from the issuance of common stock from our stock based compensation plans., 315146=Various federal, state, and local regulatory agencies, including the Occupational Safety and Health Administration, or OSHA, the United States Environmental Protection Agency, or EPA, and similar federal and local agencies, have jurisdiction over the operation of our dealerships, repair facilities, and other operations, with respect to matters such as consumer protection, workers\u0092 safety, and laws regarding protection of the environment, including air, water, and soil. The EPA promulgated emissions regulations for outboard marine engines that impose stricter emissions standards for two-cycle, gasoline outboard marine engines. The majority of the outboard marine engines we sell are manufactured by Mercury Marine. Mercury Marine\u0092s product line of low-emission engines, including the OptiMax, Verado, and other four-stroke outboards, have achieved the EPA\u0092s mandated 2006 emission levels. Any increased costs of producing engines resulting from EPA standards, which could be passed on to us, or the inability of our manufacturers to comply with EPA requirements, could have a material adverse effect on our business., 560482=Income Tax Benefit. We had an income tax benefit of $894,000 for the fiscal year ended September 30, 2013 compared with an income tax benefit of $176,000 for the fiscal year ended September 30, 2012. Our effective income tax rate was low for both the fiscal year ended September 30, 2013 and 2012. In fiscal 2013, the tax benefit was primarily attributable to a favorable tax settlement with a state in which we operate. In fiscal 2012, we generated a loss for tax purposes and we could not record the benefit for the net operating loss carryforward due to the required valuation allowance. For fiscal 2013 and 2012, the income tax expense ordinarily associated with our pre-tax income was offset by a net operating loss carryforward, which had a full valuation allowance., 556008=primarily attributable to a favorable tax settlement with a state in which we operate. In fiscal 2014, the income tax expense is primarily related to Federal alternative minimum tax and state tax expenses. In fiscal 2014 and 2013, the income tax expenses, excluding the favorable tax settlement in 2013, resulted in a low tax rate due to the utilization of the net operating loss carryforwards for tax purposes which had a full valuation allowance. We will continue to evaluate the need for a valuation allowance. If the full valuation allowance is reversed we will start recording a tax provision., 844571=We are the largest recreational boat retailer in the United States. We engage primarily in the retail sale, brokerage, and service of new and used boats, motors, trailers, marine parts and accessories and offer slip and storage accommodations in certain locations. In addition, we arrange related boat financing, insurance, and extended service contracts. We recently implemented programs to increase sales of boats, boating parts, and accessories, as well as the offer of finance and insurance, or F&I, products at various offsite locations; and the charter of power and sailing yachts in the British Virgin Islands. None of these recently implemented programs have had a material effect on our consolidated financial statements. As of September 30, 2014, we operated through 54 retail locations in 17 states, consisting of Alabama, Arizona, California, Connecticut, Florida, Georgia, Maryland, Minnesota, Missouri, New Jersey, New York, North Carolina, Ohio, Oklahoma, Rhode Island, Tennessee, and Texas. Our MarineMax Vacations operations maintain a facility in Tortola, British Virgin Islands., 607331=December 11, 2014, 677701=Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized., 970133=The following table summarizes option activity from September 30, 2013 through September 30, 2014:, 4899=(727) 531-1700, 438324=August 1, 2014 to August 31, 2014, 1015266=We lease certain land, buildings, machinery, equipment, and vehicles related to our dealerships under non-cancelable third-party operating leases. Certain of our leases include options for renewal periods and provisions for escalation. Rental expenses, including month-to-month rentals, were approximately $5.1 million, $5.4 million, and $5.8 million for the fiscal years ended September 30, 2012, 2013, and 2014, respectively., 606034=In our opinion, MarineMax, Inc. maintained, in all material respects, effective internal control over financial reporting as of September 30, 2014, based on criteria established in Internal Control \u0096 Integrated Framework (1992) issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO)., 567286=For the fiscal years ended September 30, 2014, 2013, and 2012, cash used in investing activities was approximately $12.8 million, $12.6 million, and $7.6 million, respectively. For the fiscal year ended September 30, 2014, cash used in investing activities was primarily used to improve existing retail facilities and purchase a note receivable in conjunction with the planned acquisition of a retail facility, partially offset by proceeds received from the sale of our Walker, Minnesota retail facility and insurance proceeds received as a result of Hurricane Sandy. For the fiscal year ended September 30, 2013, cash used in investing activities was primarily used to purchase inventory associated with a business acquisition and to purchase property and equipment associated with improving existing retail facilities and making capital improvements as a result of Hurricane Sandy and partially offset by insurance proceeds received as a result of Hurricane Sandy. For the fiscal year ended September 30, 2012, cash used in investing activities was primarily used to purchase property and equipment associated with improving existing retail facilities as well as inventory purchases associated with a business acquisition., 986691=As of September 30, 2013 and 2014, there were approximately $980,000 and $2.2 million, respectively, of unrecognized compensation costs related to non-vested options that are expected to be recognized over a weighted average period of 2.0 years. The total fair value of options vested during the fiscal years ended September 30, 2012, 2013, and 2014 was approximately $3.1 million, $2.5 million, and $1.9 million, respectively., 4466=2600 McCormick Drive, 1000574=As of September 30, 2014, we had issued 647,115 shares of common stock under our Stock Purchase Plan., 904666=Depreciation and amortization expense on property and equipment totaled approximately $6.4 million, $6.8 million, and $7.3 million for the fiscal years ended September 30, 2012, 2013, and 2014, respectively., 964271=In November 2005, our Board of Directors approved a share repurchase plan allowing our company to repurchase up to 1,000,000 shares of our common stock. Under the plan, we may buy back common stock from time to time in the open market or in privately negotiated blocks, dependent upon various factors, including price and availability of the shares, and general market conditions. Through September 30, 2014, we had purchased an aggregate of 790,900 shares of common stock under the plan for an aggregate purchase price of approximately $15.8 million., 219487=The EPA has various air emissions regulations for outboard marine engines that impose more strict emissions standards for two-cycle, gasoline outboard marine engines. The majority of the outboard marine engines we sell are manufactured by Mercury Marine. Mercury Marine\u0092s product line of low-emission engines, including the OptiMax, Verado, and other four-stroke outboards, have achieved the EPA\u0092s mandated 2006 emission levels. Any increased costs of producing engines resulting from EPA standards, or the inability of our manufacturers to comply with EPA requirements, could have a material adverse effect on our business., 430080=2014, 119008=We offer recreational boats in most market segments, but have a particular focus on premium quality pleasure boats and yachts as reflected by our fiscal 2014 average new boat sales price of approximately $167,000, an increase of approximately 13% from approximately $148,000 in fiscal 2013, compared with an estimated industry average selling price for calendar 2013 of approximately $41,000 based on industry data published by the National Marine Manufacturers Association. Given our locations in some of the more affluent, offshore boating areas in the United States and emphasis on high levels of customer service, we sell a relatively higher percentage of large recreational boats, such as mega-yachts, yachts, and sport cruisers. We believe that the product lines we offer are among the highest quality within their respective market segments, with well-established trade-name recognition and reputations for quality, performance, and styling., 568666=For the fiscal years ended September 30, 2014, 2013 and 2012, cash provided by financing activities was approximately $6.1 million, $4.9 million, and $3.2 million, respectively. For the fiscal year ended September 30, 2014, cash provided by financing activities was primarily attributable to net short-term borrowings as a result of increased, 694886=In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of MarineMax, Inc. and subsidiaries as of September 30, 2013 and 2014, and the results of their operations and their cash flows for each of the years then ended, in conformity with U.S. generally accepted accounting principles., 558469=Selling, General, and Administrative Expenses. Selling, general, and administrative expenses increased $4.6 million, or 3.6%, to $132.5 for the fiscal year ended September 30, 2013 from $127.9 million for the fiscal year ended September 30, 2012. The fiscal year ended September 30, 2013 included a recovery recognized of approximately $11.7 million, net of taxes and other expenses, from the Deepwater Horizon Settlement Program for damages suffered as a result of the Deepwater Horizon Oil Spill. Excluding this item and making both years comparable, selling, general, and administrative expenses increased $16.4 million, or 12.7%, to $144.3 million and as a percentage of revenue increased to 24.7% for the fiscal year ended September 30, 2013 from 24.4% for the fiscal year ended September 30, 2012. The overall increase in selling, general, and administrative expenses was primarily attributable to increased commissions resulting from increased boat sales and restructured commission plans; increased insurance costs related to property, casualty, liability and healthcare; increased payroll associated with improved performance and modest personnel growth; and increased promotional spending in an effort to counteract the inclement weather conditions., 521345=Pursuant to ASC 740, we must consider all positive and negative evidence regarding the realization of deferred tax assets. ASC 740 provides for four possible sources of taxable income to realize deferred tax assets: 1) taxable income in prior carryback years, 2) reversals of existing deferred tax liabilities, 3) tax planning strategies and 4) projected future taxable income. As of September 30, 2014, we have no available taxable income in prior carryback years, reversals of existing deferred tax liabilities or prudent and feasible tax planning strategies. Therefore, the recoverability of our deferred tax assets is dependent upon generating future taxable income. Although as of September 30, 2014, we were no longer in a three year cumulative loss position for financial reporting purposes in our significant jurisdictions, we believe there is sufficient negative evidence concerning our projected future taxable income and, therefore, the realization of our deferred tax assets. Our future taxable income is inherently difficult to project and subject to uncertainty due to many factors including the impact of general economic conditions and the cyclical nature of our operations which historically has resulted in losses in the first half of our fiscal year. Additionally, historically it has been difficult to project our industry\u0092s trends and therefore our results. Based on our analysis of the available evidence we determined that our deferred tax assets needed a full valuation allowance as of September 30, 2013 and September 30, 2014. We will continue to evaluate the need for a valuation allowance., 236713=Paulee C. Day has served as Vice President of our company since February 2009 and as General Counsel and Assistant Secretary since January 2003. Ms. Day, an active member of the Florida Bar, was employed by Maxxim Medical from May 1999 to November 2002, serving as Vice President, General Counsel, and Secretary. Prior to that time, Ms. Day was Corporate Attorney at Eckerd Corporation from June 1997 through May 1999 and a corporate attorney at the law firm Trenam, Kemker, Scharf, Barkin, Frye, O\u0092Neill and Mullis, P.A. from January 1995 through June 1997., 1007581=As of September 30, 2014, we had approximately $1,000 of total unrecognized compensation cost related to non-vested restricted stock awards. We expect to recognize that cost over a weighted-average period of 0.1 years., 881519=In May 2014, the FASB issued Accounting Standards Update No. 2014-09, \u0093Revenue from Contracts with Customers (Topic 606)\u0094 (ASU 2014-9), a converged standard on revenue recognition. The new pronouncement requires revenue recognition to depict the transfer of promised goods or services to customers in an amount that reflects the consideration to which the entity expects to be entitled in exchange for those goods or services. The guidance also specifies the accounting for some costs to obtain or fulfill a contract with a customer, as well as enhanced disclosure requirements. ASU 2014-9 is effective for annual reporting periods beginning after December 15, 2016, including interim reporting periods within that reporting period. Early adoption is not permitted. We currently do not believe the adoption of this standard will have a material impact on our consolidated financial statements., 172856=We transfer individual boats among our retail locations to fill customer orders that otherwise might take substantially longer to fill from the manufacturer. This reduces delays in delivery, helps us maximize inventory turnover, and assists in minimizing potential overstock or out-of-stock situations. We actively monitor our inventory levels to maintain levels appropriate to meet current anticipated market demands. We are not bound by contractual agreements governing the amount of inventory that we must purchase in any year from any manufacturer, but the failure to purchase at agreed upon levels may result in the loss of certain manufacturer incentives or dealership rights. We participate in numerous end-of-summer manufacturer boat shows, which manufacturers sponsor to sell off their remaining inventory at reduced costs before the introduction of new model year products, typically beginning in September., 423825=2012, 233594=William H. McGill Jr. has served as the Chief Executive Officer of MarineMax since January 23, 1998 and as the Chairman of the Board and as a director of our company since March 6, 1998. Mr. McGill served as the President of our company from January 23, 1988 until September 8, 2000 and re-assumed the position on July 1, 2002. Mr. McGill was the principal owner and president of Gulfwind USA, Inc., one of our operating subsidiaries, from 1973 until its merger with us., 333120=As of September 30, 2014, there were 24,211,907 shares of our common stock outstanding. Substantially all of these shares are freely tradable without restriction or further registration under the securities laws, unless held by an \u0093affiliate\u0094 of our company, as that term is defined in Rule 144 under the securities laws. Shares held by affiliates of our company, which generally include our directors, officers, and certain principal stockholders, are subject to the resale limitations of Rule 144 described below. Outstanding shares of common stock issued in connection with the acquisition of any acquired dealers are available for resale beginning six months after the respective dates of the acquisitions, subject to compliance with the provisions of Rule 144 under the securities laws., 504400=Lower consumer spending resulting from a downturn in the housing market and other economic factors adversely affected our business in fiscal 2007, and continued weakness in consumer spending and depressed economic conditions had a substantial negative effect on our business in each subsequent fiscal year. These conditions have caused us to substantially reduce our acquisition program, delay new store openings, reduce our inventory purchases, engage in inventory reduction efforts, close a number of our retail locations, reduce our headcount, and amend and replace our credit facility. Acquisitions and new store openings remain important strategies to our company, and we plan to accelerate our growth through these strategies when more normal economic conditions return. However, we cannot predict the length or severity of these unfavorable economic or financial conditions or the extent to which they will continue to adversely affect our operating results nor can we predict the effectiveness of the measures we have taken to address this environment or whether additional measures will be necessary., 1016220=Future minimum lease payments under non-cancelable operating leases as of September 30, 2014, were as follows:, 214150=As of September 30, 2014, we had 1,228 employees, 1,128 of whom were in store-level operations and 100 of whom were in corporate administration and management. We are not a party to any collective bargaining agreements. We consider our relations with our employees to be excellent., 30151=The statements contained in this report on Form 10-K that are not purely historical are forward-looking statements within the meaning of applicable securities laws. Forward-looking statements include statements regarding our \u0093expectations,\u0094 \u0093anticipations,\u0094 \u0093intentions,\u0094 \u0093beliefs,\u0094 or \u0093strategies\u0094 regarding the future. Forward-looking statements also include statements regarding revenue, margins, expenses, and earnings for fiscal 2015 and thereafter; our belief that our practices enhance our ability to attract more customers, foster an overall enjoyable boating experience, and offer boat manufacturers stable and professional retail distribution and a broad geographic presence; our assessment of our competitive advantages, including our no hassle sales approach, prime retail locations, premium product offerings, extensive facilities, strong management and team members, and emphasis on customer service and satisfaction before and after a boat sale; our belief that our core values of customer service and satisfaction and our strategies will enable us to achieve success and long-term growth when economic conditions improve; and our belief that our retailing strategies are aligned with the desires of consumers. All forward-looking statements included in this report are based on information available to us as of the filing date of this report, and we assume no obligation to update any such forward-looking statements. Our actual results could differ materially from the forward-looking statements. Among the factors that could cause actual results to differ materially are the factors discussed under Item 1A, \u0093Risk Factors.\u0094, 720578=Common stock, $.001 par value; 40,000,000 shares authorized, 24,336,495 and 25,002,807 shares issued and 23,545,595 and 24,211,907 shares outstanding as of September 30, 2013 and 2014, respectively, 986201=The weighted-average grant date fair value of options granted during the fiscal years ended September 30, 2012, 2013, and 2014 was $4.30, $4.49, and $6.23, respectively. The total intrinsic value of options exercised during the fiscal years ended September 30, 2012, 2013, and 2014 was approximately $1.4 million, $3.3 million, and $4.5 million, respectively., 238939=General economic conditions and consumer spending patterns can negatively impact our operating results. Unfavorable local, regional, national, or global economic developments or uncertainties regarding future economic prospects could reduce consumer spending in the markets we serve and adversely affect our business. Economic conditions in areas in which we operate dealerships, particularly Florida in which we generated approximately 49%, 51%, and 52% of our revenue during fiscal 2012, 2013, and 2014, respectively, can have a major impact on our operations. Local influences, such as corporate downsizing, military base closings, and inclement weather such as Hurricane Sandy, environmental conditions, and specific events, such as the BP oil spill in the Gulf of Mexico, also could adversely affect, and in certain instances have adversely affected, our operations in certain markets., 140371=We sell used versions of the new makes and models we offer and, to a lesser extent, used boats of other makes and models generally taken as trade-ins. During fiscal 2014, used boat sales accounted for 16.8% or $104.9 million of our revenue, and 69.7% of the used boats we sold were Brunswick models., 291122=We and the Sea Ray Division of Brunswick have an agreement extending through August 31, 2017, with automatic annual one-year extensions at each twelve month anniversary of the agreement, provided that our dealer agreements with the Sea Ray Division of Brunswick are still then in effect. The agreement provides a process for the acquisition of additional Sea Ray boat dealers that desire to be acquired by us. Under the agreement, acquisitions of Sea Ray dealers will be mutually agreed upon by us and Sea Ray with reasonable efforts to be made to include a balance of Sea Ray dealers that have been successful and those that have not been. The agreement provides that Sea Ray will not unreasonably withhold its consent to any proposed acquisition of a Sea Ray dealer by us, subject to the conditions set forth in the agreement. Among other things, the agreement requires us to provide Sea Ray with a business plan for each proposed acquisition, including historical financial and five-year projected financial information regarding the acquisition, 433175=On December 1, 2014, the closing sale price of our common stock was $18.60 per share. On December 1, 2014, there were approximately 100 record holders and approximately 4,700 beneficial owners of our common stock., 679233=Date: December 11, 2014, 93861=Our website is located at www.MarineMax.com. Through our website, we make available free of charge our annual report on Form 10-K, our quarterly reports on Form 10-Q, our current reports on Form 8-K, our proxy statements, and any amendments to those reports filed or furnished pursuant to Section 13(a) or 15(d) of the Securities Exchange Act of 1934. These reports are available as soon as reasonably practicable after we electronically file those reports with the Securities and Exchange Commission (the \u0093SEC\u0094). We also post on our website the charters of our Audit, Compensation, and Nominating/Corporate Governance Committees; our Corporate Governance Guidelines, Code of Business Conduct and Ethics, and Code of Ethics for the CEO and Senior Financial Officers, and any amendments or waivers thereto; and any other corporate governance materials contemplated by the SEC or the regulations of the New York Stock Exchange, or NYSE. These documents are also available in print to any stockholder requesting a copy from our corporate secretary at our principal executive offices. Because our common stock is listed on the NYSE, our Chief Executive Officer is, 626138=The information required by this Item is incorporated herein by reference to the definitive Proxy Statement (particularly under the caption \u0093Executive Compensation\u0094) to be filed pursuant to Regulation 14A of the Exchange Act for our 2015 Annual Meeting of Stockholders., 865645=We also recognize commissions earned on extended warranty service contracts sold on behalf of third-party insurance companies at the later of customer acceptance of the service contract terms as evidenced by contract execution or recognition of the related boat sale. We are charged back for a portion of these commissions should the customer terminate or default on the service contract prior to its scheduled maturity. We determine the chargeback allowance, which was not material to the consolidated financial statements taken as a whole as of September 30, 2014, based upon our experience with terminations or defaults on the service contracts., 599588=Exhibits 31.1 and 31.2 are the Certifications of the Chief Executive Officer and Chief Financial Officer, respectively. The Certifications are required in accordance with Section 302 of the Sarbanes-Oxley Act of 2002 (the \u0093Section 302 Certifications\u0094). This Item of this report, which you are currently reading is the information concerning the Evaluation referred to in the Section 302 Certifications and this information should be read in conjunction with the Section 302 Certifications for a more complete understanding of the topics presented., 235544=William Brett McGill has served as Vice President of West Operations of our company since May 2012 and was appointed as an executive officer by our Board of Directors in November 2012. Mr. McGill served as one of our Regional Presidents from March 2006 to May 2012, as Vice President of Information Technology, Service and Parts of our company from October 2004 to March 2006, and as Director of Information Services from March 1998. Mr. McGill began his professional career with a software development firm, Integrated Dealer Systems, prior to joining our company in 1996. William Brett McGill is the son of William H. McGill, Jr., 845802=We are the nation\u0092s largest retailer of Sea Ray, Boston Whaler, and Meridian recreational boats and yachts, all of which are manufactured by Brunswick Corporation (\u0093Brunswick\u0094). Sales of new Brunswick boats accounted for approximately 40% of our revenue in fiscal 2014. Sales of new Sea Ray and Boston Whaler boats, both divisions of Brunswick, accounted for approximately 26% and 10%, respectively, of our revenue in fiscal 2014. Brunswick is the world\u0092s largest manufacturer of marine products and marine engines. We believe we represented approximately 43% of Brunswick\u0092s Sea Ray boat sales, during our fiscal 2014., 95542=required to make an annual certification to the NYSE stating that he is not aware of any violation by us of the corporate governance listing standards of the NYSE. Our Chief Executive Officer made his annual certification to that effect to the NYSE on March 25, 2014., 1023672=Employees are eligible to participate in our 401(k) Profit Sharing Plan (the \u0093Plan\u0094) following their 90-day introductory period starting either April 1 or October 1, provided that they are 21 years of age. Under the Plan, we match 25% of participants\u0092 contributions, up to a maximum of 5% of each participant\u0092s compensation. We contributed, under the Plan, or pursuant to previous similar plans, approximately $298,000, $440,000, and $463,000 for the fiscal years ended September 30, 2012, 2013, and 2014, respectively., 92912=We maintain our executive offices at 2600 McCormick Drive, Suite 200, Clearwater, Florida 33759, and our telephone number is (727) 531-1700. We were incorporated in the state of Delaware in January 1998. Unless the context otherwise requires, all references to \u0093MarineMax\u0094 mean MarineMax, Inc. prior to its acquisition of five previously independent recreational boat dealers in March 1998 (including their related real estate companies) and all references to the \u0093Company,\u0094 \u0093our company,\u0094 \u0093we,\u0094 \u0093us,\u0094 and \u0093our\u0094 mean, as a combined company, MarineMax, Inc. and the 24 recreational boat dealers, two boat brokerage operations, and two full-service yacht repair operations acquired to date (the \u0093acquired dealers,\u0094 and together with the brokerage and repair operations, \u0093operating subsidiaries,\u0094 or the \u0093acquired companies\u0094)., 240940=Lower consumer spending resulting from a downturn in the housing market and other economic factors adversely affected our business in fiscal 2007, and continued weakness in consumer spending and depressed economic conditions had a substantial negative effect on our business in each subsequent fiscal year. Our revenue decreased from $1.2 billion in fiscal 2007, to $885.4 million in fiscal 2008, to $588.6 million in fiscal 2009, to $450.3 million in fiscal 2010, and increased to $480.9 million in fiscal 2011, to $524.5 million in fiscal 2012, to $584.5 million in fiscal 2013, and to $624.7 million in fiscal 2014. Our earnings decreased from a net income of $20.1 million in fiscal 2007 to a net loss of $134.3 million in fiscal 2008 (including a $122.1 million goodwill impairment charge), a net loss of $76.8 million in fiscal 2009, net income of $2.5 million in fiscal 2010 (including a $19.2 million tax refund), a net loss of $11.5 million in fiscal 2011, a net income of $1.1 million in fiscal 2012, a net income of $15.0 million in fiscal 2013 (including a $11.7 million recovery from the Deepwater Horizon Settlement Program), and a net income of $11.3 million in fiscal 2014 (including a $555,000 recovery from the Deepwater Horizon Settlement Program). These substantially deteriorating economic and financial conditions had a greater impact on many other participants in the boating industry, with certain manufacturers and dealers ceasing business operations or filing for bankruptcy. While the reduction in boating industry participants might have a long-term positive impact on our company\u0092s competitive position, on a market by market basis, we are facing and expect to continue to face short-term competitive pressure resulting from decreased selling prices as a result of forced sales due to a competitor failing in the market place., 1003049=The following table summarizes restricted stock award activity from September 30, 2013 through September 30, 2014:, 111330=Opening New Facilities. We intend to continue to establish additional retail facilities in our existing and new markets when markets conditions improve. We believe that the demographics of our existing geographic territories support the opening of additional facilities, and we have opened 31 new retail facilities, excluding those opened on a temporary basis for a specific purpose, since our formation in January 1998. We also plan to reach new customers through various innovative retail formats developed by us, such as mall stores and floating retail facilities. We continually monitor the performance of our retail locations and close retail locations that do not meet our expectations or that were opened for a specific purpose that is no longer relevant. Based on these factors since March 1998, we have closed 59 retail locations, excluding those opened on a temporary basis for a specific purpose, including 26 in fiscal 2009., 564966=These cash needs have historically been financed with cash generated from operations and borrowings under our credit facility. Our ability to utilize our credit facility to fund operations depends upon the collateral levels and compliance with the covenants of the credit facility. Turmoil in the credit markets and weakness in the retail markets may interfere with our ability to remain in compliance with the covenants of the credit facility and therefore our ability to utilize the credit facility to fund operations. As of September 30, 2014, we were in compliance with all covenants under our credit facility. We currently depend upon dividends and other payments from our dealerships and our credit facility to fund our current operations and meet our cash needs. As 100% owner of each of our dealerships, we determine the amounts of such distributions, and currently, no agreements exist that restrict this flow of funds from our dealerships., 993425=During February 2012, our stockholders approved a proposal to amend our 2008 Employee Stock Purchase Plan (\u0093Stock Purchase Plan\u0094) to increase the number of shares available under that plan by 500,000 shares. The Stock Purchase Plan as amended provides for up to 1,000,000 shares of common stock to be available for purchase by our regular employees who have completed at least one year of continuous service. In addition, there were 52,837 shares of common stock available under our 1998 Employee Stock Purchase Plan, which have been made available for issuance under our Stock Purchase Plan. The Stock Purchase Plan provides for implementation of up to 10 annual offerings beginning on the first day of October starting in 2008, with each offering terminating on September 30 of the following year. Each annual offering may be divided into two six-month offerings. For each offering, the purchase price per share will be the lower of (i) 85% of the closing price of the common stock on the first day of the offering or (ii) 85% of the closing price of the common stock on the last day of the offering. The purchase price is paid through periodic payroll deductions not to exceed 10% of the participant\u0092s earnings during each offering period. However, no participant may purchase more than $25,000 worth of common stock annually., 444895=The following line graph compares cumulative total stockholder returns for the five years ended September 30, 2014 for (i) our common stock, (ii) the Russell 2000 Index, and (iii) the Nasdaq Retail Trade Index. The graph assumes an investment of $100 on September 30, 2009. The calculations of cumulative stockholder return on the Russell 2000 Index and the Nasdaq Retail Trade Index include reinvestment of dividends. The calculation of cumulative stockholder return on our common stock does not include reinvestment of dividends because we did not pay any dividends during the measurement period. The historical performance shown is not necessarily indicative of future performance., 439542=September 1, 2014 to September 30, 2014, 1021444=In fiscal 2013 and 2014 we recognized a recovery of approximately $11.7 million and $555,000, net of taxes and other expenses, respectively, from the Deepwater Horizon Settlement Program for damages suffered as a result of the Deepwater Horizon Oil Spill. The recovery was recorded as a reduction in selling, general, and administrative expenses on our consolidated statements of operations. While additional claims are outstanding, we cannot be certain of the amount of any further recovery., 234227=Michael H. McLamb has served as Executive Vice President of our company since October 2002, as Chief Financial Officer since January 23, 1998, as Secretary since April 5, 1998, and as a director since November 1, 2003. Mr. McLamb served as Vice President and Treasurer of our company from January 23, 1998 until October 22, 2002. Mr. McLamb, a certified public accountant, was employed by Arthur Andersen LLP from December 1987 to December 1997, serving most recently as a senior manager., 309850=The availability of financing for our boat purchasers and the level of participation and other fees we receive in connection with such financing depend on the particular agreement between us and the lender and the current rate environment. Lenders may impose terms in their boat financing arrangements with us that may be unfavorable to us or our customers, resulting in reduced demand for our customer financing programs and lower participation and other fees. Laws or regulations may be enacted nationally or locally which could result in fees from lenders being eliminated or reduced, materially impacting our operating results. Customer financing became more difficult to secure during fiscal 2008, which continued in each subsequent fiscal year through fiscal 2011., 1006393=Non-vested balance as of September 30, 2014, 154048=Through employees or subcontractors that are licensed boat or yacht brokers where applicable, we offer boat or yacht brokerage sales at most of our retail locations. For a commission, we offer for sale brokered boats or yachts, listing them on various internet sites, advising our other retail locations of their availability through our integrated computer system, and posting them on our web site, www.MarineMax.com. Often sales are co-brokered, with the commission split between the buying and selling brokers. We believe that our access to potential used boat customers and methods of listing and advertising customers\u0092 brokered boats or yachts is more extensive than is typical among brokers. In addition to generating revenue from brokerage commissions, our brokerage sales also enable us to offer a broad array of used boats or yachts without increasing related inventory costs. During fiscal 2014, brokerage sales commissions accounted for 2.5% or $15.4 million of our revenue., 957105=The reconciliation of the total amount recorded for unrecognized tax benefits at the beginning and end of the fiscal years ended September 30, 2013 and 2014 is as follows:, 847130=We have multi-year dealer agreements with Brunswick covering Sea Ray products that appoints us as the exclusive dealer of Sea Ray boats in our geographic markets. We are the exclusive dealer for Boston Whaler through multi-year dealer agreements for many of our geographic markets. In addition, we are the exclusive dealer for Azimut Yachts for the entire United States through a multi-year dealer agreement. Sales of new Azimut boats accounted for approximately 14% of our revenue in fiscal 2014. We believe non-Brunswick brands offer a migration for our existing customer base or fill a void in our product offerings, and accordingly, do not compete with the business generated from our other prominent brands., 2124=For the fiscal year ended September 30, 2014, 912643=Similarly, decreases in the availability of credit and increases in the cost of credit adversely affect the ability of our customers to purchase boats from us and thereby adversely affect our ability to sell our products and impact the profitability of our finance and insurance activities. Tight credit conditions during fiscal 2009, 2010, and 2011 adversely affected the ability of customers to finance boat purchases, which had a negative effect on our operating results., 854716=Inventory costs consist of the amount paid to acquire inventory, net of vendor consideration and purchase discounts, the cost of equipment added, reconditioning costs, and transportation costs relating to acquiring inventory for sale. We state new and used boat, motor, and trailer inventories at the lower of cost, determined on a specific-identification basis, or market. We state parts and accessories at the lower of cost, determined on an average cost basis, or market. We utilize our historical experience, the aging of the inventories, and our consideration of current market trends as the basis for determining a lower of cost or market valuation allowance. As of September 30, 2013 and 2014, our lower of cost or market valuation allowance for new and used boat, motor, and trailer inventories was $1.8 million and $2.2 million, respectively. If events occur and market conditions change, causing the fair value to fall below carrying value, the lower of cost or market valuation allowance could increase., 513097=Inventory costs consist of the amount paid to acquire inventory, net of vendor consideration and purchase discounts, the cost of equipment added, reconditioning costs, and transportation costs relating to acquiring inventory for sale. We state new and used boat, motor, and trailer inventories at the lower of cost, determined on a specific-identification basis, or market. We state parts and accessories at the lower of cost, determined on an average cost basis, or market. We utilize our historical experience, the aging of the inventories, and our consideration of current market trends as the basis for determining a lower of cost or market valuation allowance. Our lower of cost or market valuation allowance contains uncertainties because the calculation requires management to make assumptions and to apply judgment regarding the amount at which the inventory will ultimately be sold which considers forecasted market trends, model changes, and new product introductions. We do not believe there is a reasonable likelihood that there will be a change in the future estimates or assumptions we use to calculate our lower of cost or market valuation allowance which would result in a material effect on our operating results. As of September 30, 2013 and September 30, 2014, our lower of cost or market valuation allowance for new and used boat, motor, and trailer inventories was $1.8 million and $2.2 million, respectively. If events occur and market conditions change, causing the fair value to fall below carrying value, the lower of cost or market valuation allowance could increase., 446987=The performance graph above shall not be deemed \u0093filed\u0094 for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or Exchange Act, or otherwise subject to the liability of that section. The performance graph above will not be deemed incorporated by reference into any filing of our company under the Exchange Act or the Securities Act of 1933, as amended., 445896=Among MarineMax, Inc., the Russell 2000 Index, and the NASDAQ Retail Trade Index, 566041=For the fiscal years ended September 30, 2014, 2013, and 2012, cash provided by operating activities approximated $10.8 million, $7.8 million, and $8.7 million, respectively. For the fiscal year ended September 30, 2014, cash provided by operating activities was primarily related to net income and a decrease in accounts receivable partially offset by an increase in inventory driven by the expansion of current and new brands and decreases in accrued expenses. For the fiscal year ended September 30, 2013, cash provided by operating activities was primarily related to net income partially offset by an increase in inventory driven by the timing of orders and increased trade-ins on new boat sales and decreases in accrued expenses and long-term liabilities. For the fiscal year ended September 30, 2012, cash provided by operating activities was primarily related to a decrease of inventory driven by inventory order reductions and partially offset by an increase in accounts receivable as a result of our strong September close and a decrease in accrued expenses and long-term liabilities., 426941=2013, 608862=The compensation of Mr. Moore will be consistent with that provided to all non-employee directors, as described in our most recent proxy statement filed with the Securities and Exchange Commission on January 10, 2014., 849047=General economic conditions and consumer spending patterns can negatively impact our operating results. Unfavorable local, regional, national, or global economic developments or uncertainties regarding future economic prospects could reduce consumer spending in the markets we serve and adversely affect our business. Economic conditions in areas in which we operate dealerships, particularly Florida in which we generated approximately 49%, 51%, and 52% of our revenue during fiscal 2012, 2013, and 2014, respectively, can have a major impact on our operations. Local influences, such as corporate downsizing, military base closings, inclement weather such as Hurricane Sandy, environmental conditions, and specific events, such as the BP oil spill in the Gulf of Mexico, also could adversely affect, and in certain instances have adversely affected, our operations in certain markets., 906983=In August 2014, we entered into an amendment to our Inventory Financing Agreement (the \u0093Amended Credit Facility\u0094), originally entered into in June 2010, as subsequently amended, with GE Commercial Distribution Finance Corporation. The August 2014 amendment extended the maturity date of the Credit Facility to August 2017, subject to additional extension for two one-year periods, with lender approval. The August 2014 amendment, among other things, modified the amount of borrowing availability and maturity date of the Credit Facility. The Amended Credit Facility provides a floor plan financing commitment of up to $235.0 million, an increase from the previous limit of $205.0 million, subject to borrowing base availability resulting from the amount and aging of our inventory., 906435=During September 2014, we acquired a note receivable for approximately $6.0 million to facilitate the acquisition of certain real estate assets. The carrying amount of the note receivable is included in other long-term assets on the consolidated balance sheet as of September 30, 2014., 556927=Revenue. Revenue increased $60.0 million, or 11.5%, to $584.5 million for the fiscal year ended September 30, 2013 from $524.5 million for the fiscal year ended September 30, 2012. Of this increase, $57.7 million was attributable to an 11% increase in comparable-store sales. The increase in our comparable-store sales was due to incremental increases in new boat sales, partly attributable to new brands we have expanded with, and incremental increases in used boat sales, brokerage sales, F&I products, service, parts and accessories. Improving industry conditions resulting from improved economic conditions contributed to our comparable-store sales growth., 555255=Income Taxes. We had income tax expense of $91,000 for the fiscal year ended September 30, 2014 compared with an income tax benefit of $894,000 for the fiscal year ended September 30, 2013. In fiscal 2013, the tax benefit was, 799368=BALANCE, September 30, 2014, 557728=Gross Profit. Gross profit increased $17.6 million, or 13.2%, to $150.9 million for the fiscal year ended September 30, 2013 from $133.3 million for the fiscal year ended September 30, 2012. Gross profit as a percentage of revenue increased to 25.8% for the fiscal year ended September 30, 2013 from 25.4% for the fiscal year ended September 30, 2012. The increase in gross profit was primarily attributable to the increase in comparable-store sales and incrementally increased margins on new and used boat sales due to improving industry inventory and industry-wide conditions., 182794=We and the Sea Ray Division of Brunswick and Boston Whaler, Inc. are parties to Sales and Service Agreements relating to Sea Ray and Boston Whaler products respectively, effective September 1, 2014 and extending through August 31, 2017 with automatic annual one-year extensions at each twelve-month anniversary of the agreement, provided that we are not in breach of a material term of the agreement, following written notice and expiration of applicable cure periods without cure (certain termination provisions are summarized below)., 1004549=Non-vested balance as of September 30, 2013, 609731=On December 5, 2014, we and Boston Whaler, Inc. have entered into three-year Sales and Service Agreements relating to Boston Whaler products effective September 1, 2014 and extending through August 31, 2017 with automatic annual one-year extensions at each twelve-month anniversary of the agreement, provided that we are not in breach of a material term of the agreement, following written notice and expiration of applicable cure periods without cure (certain termination provisions are summarized below)., 606486=We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the consolidated balance sheets of MarineMax, Inc. and subsidiaries as of September 30, 2013 and 2014, and the related consolidated statements of operations, stockholders\u0092 equity, and cash flows for each of the years then ended, and our report dated December 11, 2014 expressed an unqualified opinion on those consolidated financial statements., 627123=The information required by this Item is incorporated herein by reference to the definitive Proxy Statement (particularly under the caption \u0093Security Ownership of Principal Stockholders, Directors, and Officers\u0094) to be filed pursuant to Regulation 14A of the Exchange Act for our 2015 Annual Meeting of Stockholders., 302999=During the three-year period ended September 30, 2014, the average revenue for the quarterly periods ended December 31, March 31, June 30, and September 30 represented approximately 18%, 25%, 31%, and 26%, respectively, of our average annual revenue. With the exception of Florida, we generally realize significantly lower sales and higher levels of inventories and related short-term borrowings in the quarterly periods ending December 31 and March 31. The onset of the public boat and recreation shows in January stimulates boat sales and allows us to reduce our inventory levels and related short-term borrowings throughout the remainder of the fiscal year. Our business could become substantially more seasonal if we acquire dealers that operate in colder regions of the United States., 37634=The U.S. recreational boating industry generated approximately $36.7 billion in retail sales in calendar 2013, which is down from the peak of $39.5 billion in calendar 2006. The retail sales include sales of new and used boats; marine products, such as engines, trailers, equipment, and accessories; and related expenditures, such as fuel, insurance, docking, storage, and repairs. Retail sales of new and used boats, engines, trailers, and accessories accounted for approximately $26.9 billion of these sales in 2013 based on industry data from the National Marine Manufacturers, 238608=General economic conditions and consumer spending patterns can negatively impact our operating results, and the severe recession that began in late 2007 has adversely affected the boating industry and our company., 722926=Treasury stock, at cost, 790,900 shares held as of September 30, 2013 and 2014, 861060=FASB Accounting Standards Codification 360-10-40, \u0093Property, Plant, and Equipment - Impairment or Disposal of Long-Lived Assets\u0094 (\u0093ASC 360-10-40\u0094), requires that long-lived assets, such as property and equipment and purchased intangibles subject to amortization, be reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of the asset is measured by comparison of its carrying amount to undiscounted future net cash flows the asset is expected to generate. If such assets are considered to be impaired, the impairment to be recognized is measured as the amount by which the carrying amount of the asset exceeds its fair market value. Estimates of expected future cash flows represent our best estimate based on currently available information and reasonable and supportable assumptions. Any impairment recognized in accordance with ASC 360-10-40 is permanent and may not be restored. Based upon our most recent analysis, we believe no impairment of long-lived assets existed as of September 30, 2014., 33889=We are the nation\u0092s largest retailer of Sea Ray, Boston Whaler, and Meridian recreational boats and yachts, all of which are manufactured by Brunswick Corporation (\u0093Brunswick\u0094). Sales of new Brunswick boats accounted for approximately 40% of our revenue in fiscal 2014. Sales of new Sea Ray and Boston Whaler boats, both divisions of Brunswick, accounted for approximately 26% and 10%, respectively, of our revenue in fiscal 2014. Brunswick is the world\u0092s largest manufacturer of marine products and marine engines. We believe our sales represented approximately 8% of all Brunswick marine sales, including approximately 43% of its Sea Ray boat sales, during our fiscal 2014. We have agreements with Brunswick covering Sea Ray products and Boston Whaler products and are the exclusive dealer of Sea Ray and Boston Whaler boats in almost all of our geographic markets. We also are the exclusive dealer for Meridian Yachts in most of our geographic markets. We also are the exclusive dealer for Italy-based Azimut-Benetti Group, or Azimut, for Azimut mega-yachts, yachts, and other recreational boats for the United States. Sales of new Azimut boats accounted for approximately 14% of our revenue in fiscal 2014. Additionally, we are the exclusive dealer for certain other premium brands that serve certain industry segments in our markets as shown by the table on page four., 953919=Pursuant to ASC 740, we must consider all positive and negative evidence regarding the realization of deferred tax assets. ASC 740 provides for four possible sources of taxable income to realize deferred tax assets: 1) taxable income in prior carryback years, 2) reversals of existing deferred tax liabilities, 3) tax planning strategies and 4) projected future taxable income. As of September 30, 2014, we have no available taxable income in prior carryback years, reversals of existing deferred tax liabilities or prudent and feasible tax planning strategies. Therefore, the recoverability of our deferred tax assets is dependent upon generating future taxable income. Although as of September 30, 2014, we were no longer in a three year cumulative loss position for financial reporting purposes in our significant jurisdictions, we believe there is sufficient negative evidence concerning our projected future taxable income and, therefore, the realization of our deferred tax assets. Our future taxable income is inherently difficult to project and subject to uncertainty due to many factors including the impact of general economic conditions and the cyclical nature of our operations which historically has resulted in losses in the first half of our fiscal year. Additionally, historically it has been difficult to project our industry\u0092s trends and therefore our results. Based on our analysis of the available evidence we determined that our deferred tax assets needed a full valuation allowance as of September 30, 2013 and September 30, 2014. The total valuation allowance as of September 30, 2013 and 2014 was $42.3 million and $37.5 million, respectively. We will continue to evaluate the need for a full valuation allowance. If the full valuation allowance is reversed we will start recording a tax provision., 771701=BALANCE, September 30, 2012, 117866=We primarily sell recreational boats, including pleasure boats and fishing boats. A number of the products we offer are manufactured by Brunswick, the leading worldwide manufacturer of recreational boats, including Sea Ray pleasure boats, Boston Whaler fishing boats, and Meridian Yachts. In fiscal 2014, we derived approximately 40% of our revenue from the sale of new boats manufactured by Brunswick. Sales of new Sea Ray and Boston Whaler boats, both divisions of Brunswick, accounted for approximately 26% and 10%, respectively, of our revenue in fiscal 2014. We believe that we represented approximately 8% of all of Brunswick\u0092s marine product sales during that period. Certain of our dealerships also sell luxury yachts, fishing boats, and pontoon boats provided by other manufacturers, including Italy-based Azimut. In fiscal 2014, we derived approximately 14% of our revenue from the sale of new boats manufactured by Azimut. During fiscal 2014, new boat sales accounted for 65.2% or $407.3 million of our revenue., 247536=Similarly, decreases in the availability of credit and increases in the cost of credit adversely affect the ability of our customers to purchase boats from us and thereby adversely affect our ability to sell our products and impacts the profitability of our finance and insurance activities. Tight credit conditions during each fiscal year beginning with fiscal 2008 and continuing through fiscal 2011 adversely affected the ability of customers to finance boat purchases, which had a negative effect on our operating results., 267814=Changes in federal and state tax laws, such as an imposition of luxury taxes on new boat purchases, increases in prevailing tax rates, and removal of certain interest deductions, also influence consumers\u0092 decisions to purchase products we offer and could have a negative effect on our sales. For example, during 1991 and 1992, the federal government imposed a luxury tax on new recreational boats with sales prices in excess of $100,000, which coincided with a sharp decline in boating industry sales from a high of more than $17.9 billion in 1988 to a low of $10.3 billion in 1992. Any increase in tax rates, including those on capital gains and dividends, particularly those on high-income taxpayers, could adversely affect our boat sales., 967686=Incentive Compensation Plan (\u00932007 Plan\u0094). Our 2011 Plan provides for the grant of stock options, stock appreciation rights, restricted stock, stock units, bonus stock, dividend equivalents, other stock related awards, and performance awards (collectively \u0093awards\u0094), that may be settled in cash, stock, or other property. Our 2011 Plan is designed to attract, motivate, retain, and reward our executives, employees, officers, directors, and independent contractors by providing such persons with annual and long-term performance incentives to expend their maximum efforts in the creation of stockholder value. Subsequent to the February 2013 amendment described above, the total number of shares of our common stock that may be subject to awards under the 2011 Plan is equal to 2,000,000 shares, plus (i) any shares available for issuance and not subject to an award under the 2007 Plan, which was 200,456 shares at the time of approval of the 2011 Plan; (ii) the number of shares with respect to which awards granted under the 2011 Plan and the 2007 Plan terminate without the issuance of the shares or where the shares are forfeited or repurchased; (iii) with respect to awards granted under the 2011 Plan and the 2007 Plan, the number of shares that are not issued as a result of the award being settled for cash or otherwise not issued in connection with the exercise or payment of the award; and (iv) the number of shares that are surrendered or withheld in payment of the exercise price of any award or any tax withholding requirements in connection with any award granted under the 2011 Plan or the 2007 Plan. The 2011 Plan terminates in January 2021, and awards may be granted at any time during the life of the 2011 Plan. The date on which awards vest are determined by the Board of Directors or the Plan Administrator. The Board of Directors has appointed the Compensation Committee as the Plan Administrator. The exercise prices of options are determined by the Board of Directors or the Plan Administrator and are at least equal to the fair market value of shares of common stock on the date of grant. The term of options under the 2011 Plan may not exceed ten years. The options granted have varying vesting periods. To date, we have not settled or been under any obligation to settle any awards in cash., 699400=December 7, 2012, 561546=Our business, as well as the entire recreational boating industry, is highly seasonal, with seasonality varying in different geographic markets. With the exception of Florida, we generally realize significantly lower sales and higher levels of inventories, and related short-term borrowings, in the quarterly periods ending December 31 and March 31. The onset of the public boat and recreation shows in January stimulates boat sales and typically allows us to reduce our inventory levels and related short-term borrowings throughout the remainder of the fiscal year. Our business could become substantially more seasonal if we acquire dealers that operate in colder regions of the United States or close retail locations in warm climates., 864067=We recognize revenue from boat, motor, and trailer sales, and parts and service operations at the time the boat, motor, trailer, or part is delivered to or accepted by the customer or the service is completed. We recognize deferred revenue from service operations and slip and storage services on a straight-line basis over the term of the contract or when service is completed. We recognize commissions earned from a brokerage sale at the time the related brokerage transaction closes. We recognize commissions earned by us for placing notes with financial institutions in connection with customer boat financing when we recognize the related boat sales. We recognize marketing fees earned on credit life, accident, disability, gap, and hull insurance products sold by third-party insurance companies at the later of customer acceptance of the insurance product as evidenced by contract execution or when the related boat sale is recognized. Pursuant to negotiated agreements with financial and insurance institutions, we are charged back for a portion of these fees should the customer terminate or default on the related finance or insurance contract before it is outstanding for a stipulated minimum period of time. We base the chargeback allowance, which was not material to the consolidated financial statements taken as a whole as of September 30, 2014, on our experience with repayments or defaults on the related finance or insurance contracts., 234878=Charles A. Cashman has served as Vice President of East Operations of our company since May 2012 and was appointed as an executive officer by our Board of Directors in November 2012. Mr. Cashman served as Regional President of East Florida from October 2008 to May 2012, and as District Manager of the East Coast of Florida from March 2007 to October 2008. Mr. Cashman served several other positions of increasing responsibility, including Sales Consultant, Sales Manager, and General Manager, since joining our company in 1992., 280958=Since March 1, 1998, we have acquired 24 recreational boat dealers, two boat brokerage operations, and two full-service yacht repair facilities. Each acquired dealer operated independently prior to its acquisition by us. Our success depends, in part, on our ability to continue to make successful acquisitions and to integrate the operations of acquired dealers, including centralizing certain functions to achieve cost savings and pursuing programs and processes that promote cooperation and the sharing of opportunities and resources among our dealerships. We may not be able to oversee the combined entity efficiently or to implement effectively our growth and operating strategies. To the extent that we successfully pursue our acquisition strategy, our resulting growth will place significant additional demands on our management and infrastructure. Our failure to pursue successfully our acquisition strategies or operate effectively the combined entity could have a material adverse effect on our rate of growth and operating performance., 334037=Through September 30, 2014, we have issued options to purchase approximately 5,090,292 shares of common stock and 558,999 restricted stock awards under our incentive stock plans, and we issued 647,115 shares of common stock under our employee stock purchase plan. We have filed a registration statement under the securities laws to register the common stock to be issued under these plans. As a result, shares issued under these plans will be freely tradable without restriction unless acquired by affiliates of our company, who will be subject to the volume and other limitations of Rule 144., 556711=Fiscal Year Ended September 30, 2013 Compared with Fiscal Year Ended September 30, 2012, 500261=We are the largest recreational boat retailer in the United States with fiscal 2014 revenue in excess of $620 million. Through our current 54 retail locations in 17 states, we sell new and used recreational boats and related marine products, including engines, trailers, parts, and accessories. We also arrange related boat financing, insurance, and extended service contracts; provide boat repair and maintenance services; offer yacht and boat brokerage sales; and, where available, offer slip and storage accommodations. We recently implemented programs to increase sales of boats, boating parts, and accessories, as well as the offer of finance and insurance, or F&I, products at various offsite locations; and the charter of power and sailing yachts in the British Virgin Islands. None of these recently implemented programs have had a material effect on our consolidated financial statements., 96769=We are the nation\u0092s largest retailer of Sea Ray, Boston Whaler, and Meridian recreational boats and yachts, all of which are manufactured by Brunswick Corporation, or Brunswick. Sales of new Brunswick boats accounted for approximately 40% of our revenue in fiscal 2014. Sales of new Sea Ray and Boston Whaler boats, both divisions of Brunswick, accounted for approximately 26% and 10%, respectively, of our revenue in fiscal 2014. Brunswick is the world\u0092s largest manufacturer of marine products and marine engines. We believe our sales represented approximately 8% of all Brunswick marine sales, including approximately 43% of its Sea Ray boat sales, during our fiscal 2014. We have agreements with Brunswick covering Sea Ray products and Boston Whaler products and are the exclusive dealer of Sea Ray and Boston Whaler boats in almost all of our geographic markets. We also are the exclusive dealer for Meridian Yachts in most of our geographic markets. We also are the exclusive dealer for Italy-based Azimut-Benetti Group, or Azimut, for Azimut mega-yachts, yachts, and other recreational boats for the United States. Sales of new Azimut boats accounted for approximately 14% of our revenue in fiscal 2014. Additionally, we are the exclusive dealer for certain other premium brands that serve specific industry segments in our markets as shown by the table on page four., 572778=As of September 30, 2013 and 2014, our indebtedness associated with financing our inventory and working capital needs totaled approximately $122.5 million and $124.4 million, respectively. As of September 30, 2013 and 2014, the interest rate on the outstanding short-term borrowings was approximately 3.7% and 3.6%. As of September 30, 2014, our additional available borrowings under our Amended Credit Facility were approximately $38.2 million based upon the outstanding borrowing base availability. The aging of our inventory limits our borrowing capacity as defined curtailments reduce the allowable advance rate as our inventory ages., 590820=As of September 30, 2014, all of our short-term debt bore interest at a variable rate, tied to LIBOR as a reference rate. Changes in the underlying LIBOR interest rate on our short-term debt could affect our earnings. For example, a hypothetical 100 basis point increase in the interest rate on our short-term debt would result in an increase of approximately $1.2 million in annual pre-tax interest expense. This estimated increase is based upon the outstanding balance of our short-term debt as of September 30, 2014 and assumes no mitigating changes by us to reduce the outstanding balances and no additional interest assistance that could be received from vendors due to the interest rate increase., 628134=The information required by this Item is incorporated herein by reference to the definitive Proxy Statement (particularly under the caption \u0093Certain Relationships and Related Transactions\u0094) to be filed pursuant to Regulation 14A of the Exchange Act for our 2015 Annual Meeting of Stockholders., 196975=We are parties to Dealership Agreements with Azimut Benetti S.P.a. for the retail sale, display, and servicing of designated Azimut products and parts sold by Azimut. The Dealership Agreements extend through September 1, 2015, subject to additional one year periods added each year provided that we are able to agree in good faith on acceptable retail sales goals. The dealership agreements grant us the exclusive right to sell the Azimut products and parts in designated geographical areas. Among other things, each dealership agreement requires the applicable dealer to:, 597043=During the quarter ended September 30, 2014, there were no changes in our internal controls over financial reporting that materially affected, or were reasonably likely to materially affect, our internal control over financial reporting., 12820=The aggregate market value of common stock held by non-affiliates of the registrant (22,598,548 shares) based on the closing price of the registrant\u0092s common stock as reported on the New York Stock Exchange on March 31, 2014, which was the last business day of the registrant\u0092s most recently completed second fiscal quarter, was $343,271,944. For purposes of this computation, all officers and directors of the registrant are deemed to be affiliates. Such determination should not be deemed to be an admission that such officers and directors are, in fact, affiliates of the registrant., 434297=The following table presents information with respect to our repurchases of our common stock during the three months ended September 30, 2014., 551860=Revenue. Revenue increased $40.2 million, or 6.9%, to $624.7 million for the fiscal year ended September 30, 2014 from $584.5 million for the fiscal year ended September 30, 2013. Of this increase, $37.7 million was attributable to a 6% increase in comparable-store sales. The increase in our comparable-store sales was due to incremental increases in new boat sales and incremental increases in brokerage sales, parts and accessories, storage services, and charter rentals. Improving industry conditions resulting from improved economic conditions contributed to our comparable-store sales growth., 172082=Manufacturers generally establish prices on an annual basis, but may change prices at their sole discretion. Manufacturers typically discount the cost of inventory and offer inventory financing assistance during the manufacturers\u0092 slow seasons, generally October through March. To obtain lower cost of inventory, we strive to capitalize on these manufacturer incentives to take product delivery during the manufacturers\u0092 slow seasons. This permits us to gain pricing advantages and better product availability during the selling season. Arrangements with certain other manufacturers may restrict our right to offer some product lines in certain markets., 601461=Our internal control over financial reporting as of September 30, 2014 has been audited by KPMG LLP, an independent registered public accounting firm, as stated in their report which appears herein., 1014470=During the fiscal years ended September 30, 2012, 2013, and 2014 there were 1,546,207, 1,728,042, and 1,144,600 weighted average shares of options outstanding, respectively, that were not included in the computation of diluted income per share because the options\u0092 exercise prices were greater than the average market price of our common stock, and therefore, their effect would be anti-dilutive., 955892=Under ASC 740, the impact of uncertain tax positions taken or expected to be taken on an income tax return must be recognized in the financial statements at the largest amount that is more likely than not to be sustained upon audit by the relevant taxing authority. An uncertain income tax position will not be recognized in the financial statements unless it is more likely than not of being sustained. As of September 30, 2013 and 2014, we had approximately $224,000 and $234,000, respectively, of gross unrecognized tax benefits, of which approximately $154,000 and $154,000, respectively, if recognized, would impact the effective tax rate before considering a change in valuation allowance., 629087=The information required by this Item is incorporated herein by reference to the definitive Proxy Statement (particularly under the caption \u0093Ratification of Appointment of Independent Auditor\u0094) to be filled pursuant to Regulation 14A of the Exchange Act for our 2015 Annual Meeting of Stockholders., 570293=In August 2014, we entered into an amendment to our Inventory Financing Agreement (the \u0093Amended Credit Facility\u0094), originally entered into in June 2010, as subsequently amended, with GE Commercial Distribution Finance Corporation. The August 2014 amendment extended the maturity date of the Credit Facility to August 2017, subject to additional extension for two one-year periods, with lender approval. The August 2014 amendment, among other things, modified the amount of borrowing availability and maturity date of the Credit Facility. The Amended Credit Facility provides a floor plan financing commitment of up to $235.0 million, an increase from the previous limit of $205.0 million, subject to borrowing base availability resulting from the amount and aging of our inventory., 859755=We account for goodwill in accordance with FASB Accounting Standards Codification 350, \u0093Intangibles - Goodwill and Other\u0094 (\u0093ASC 350\u0094), which provides that the excess of cost over net assets of businesses acquired is recorded as goodwill. The acquisitions of Bassett Marine, LLC and Parker Boat Company resulted in goodwill of $802,000. In accordance with ASC 350, we review goodwill for impairment at least annually and whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Our annual impairment test is performed during the fourth fiscal quarter. If the carrying amount of goodwill exceeds its fair value we would recognize an impairment loss in accordance with ASC 350. As of September 30, 2014, and based upon our most recent analysis, we determined through our qualitative assessment that it is not \u0093more likely than not\u0094 that the fair values of our reporting units are less than their carrying values. As a result, we were not required to perform the two-step goodwill impairment test., 432567=Fourth quarter (through December 1, 2014), 13945=Portions of the registrant\u0092s definitive proxy statement for the 2015 Annual Meeting of Stockholders are incorporated by reference into Part III of this report., 175311=We are party to an Inventory Financing Agreement (the \u0093Amended Credit Facility\u0094) with GE Commercial Distribution Finance Corporation. The Amended Credit Facility provides a floor plan financing commitment of up to $235.0 million. The Amended Credit Facility matures in August 2017 and is subject to extension for two one-year periods, with lender approval., 501287=MarineMax was incorporated in January 1998. We commenced operations with the acquisition of five independent recreational boat dealers on March 1, 1998. Since the initial acquisitions in March 1998, we have acquired 24 recreational boat dealers, two boat brokerage operations, and two full-service yacht repair facilities. As a part of our acquisition strategy, we frequently engage in discussions with various recreational boat dealers regarding their potential acquisition by us. Potential acquisition discussions frequently take place over a long period of time and involve difficult business integration and other issues, including, in some cases, management succession and related matters. As a result of these and other factors, a number of potential acquisitions that from time to time appear likely to occur do not result in binding legal agreements and are not consummated. We completed a relatively small acquisition in each of the fiscal years ended September 30, 2012, 2013, and 2014., 156040=We recently launched a yacht charter business in which we offer customers the opportunity to charter power and sailing yachts in exotic destinations, starting with our initial location in the British Virgin Islands. In this business, we sell specifically designed yachts to third parties for inclusion in our yacht charter fleet; enter into yacht management agreements under which yacht owners enable us to put their yachts in our yacht charter program for a period of four to five years for a fixed monthly fee payable by us; provide our services in storing, insuring, and maintaining their yachts; and charter these yachts to vacation customers at agreed fees payable to us. The yacht owners will be able to utilize the yachts for personal use for a designated number of weeks during the term of the management agreement and take possession of their yachts following the expiration of the yacht management agreements. During fiscal 2014, the income from rentals of chartering power and sailing yachts accounted for 0.6% or $3.6 million of our revenue., 15013=Fiscal Year Ended September 30, 2014, 446815=Copyright© 2014 Russell Investment Group. All rights reserved., 256230=In March 2006, we became the exclusive dealer for Azimut-Benetti Group\u0092s Azimut product line for the Northeast United States. Our geographic territory was expanded to include Florida in September 2008 and to the entire country in July 2012. The Azimut dealer agreement provides a geographic territory to promote the product line and to network with the appropriate clientele through various independent locations designated for Azimut retail sales. Our dealer agreement is multi-year term but requires us to be in compliance with its terms and conditions., 35383=We commenced operations as a result of the March 1, 1998 acquisition of five previously independent recreational boat dealers. Since that time, we have acquired 24 additional previously independent recreational boat dealers, two boat brokerage operations, and two full-service yacht repair operations. We attempt to capitalize on the experience and success of the acquired companies in order to establish a high national standard of customer service and responsiveness in the highly fragmented retail boating industry. As a result of our emphasis on premium brand boats, our average selling price for a new boat in fiscal 2014 was approximately $167,000, an increase of approximately 13% from approximately $148,000 in fiscal 2013, compared with the industry average selling price for calendar 2013 of approximately $41,000 based on industry data published by the National Marine Manufacturers Association. Our stores, which operated at least 12 months, averaged approximately $12.7 million in annual sales in fiscal 2014. We consider a store to be one or more retail locations that are adjacent or operate as one entity. Our same-store sales increased 11% in fiscal 2012, increased 11% in fiscal 2013, and increased 6% in fiscal 2014., 909462=As of September 30, 2013 and 2014, our indebtedness associated with financing our inventory and working capital needs totaled approximately $122.5 million and $124.4 million, respectively. As of September 30, 2013 and 2014, the interest rate on the outstanding short-term borrowings was approximately 3.7% and 3.6%. As of September 30, 2014, our additional available borrowings under our Amended Credit Facility were approximately $38.2 million based upon the outstanding borrowing base availability., 237408=Anthony E. Cassella, Jr. has served as Vice President of Accounting and Shared Services since February 2011, and was appointed as Chief Accounting Officer on October 9, 2014. Mr. Cassella served as Director of Shared Services from October 2007 until February 2011 and Regional Controller from March 1999 until October 2007. Mr. Cassella was the Controller of Merit Marine which the Company acquired in March 1999. Mr. Cassella, a certified public accountant, worked in public accounting from June 1991 to February 1998, serving most recently as manager., 624233=The information required by this Item relating to our directors and corporate governance is incorporated herein by reference to the definitive Proxy Statement (particularly under the caption \u0093Corporate Governance\u0094) to be filed pursuant to Regulation 14A of the Exchange Act for our 2015 Annual Meeting of Stockholders. The information required by this Item relating to our executive officers is included in \u0093Business \u0097 Executive Officers.\u0094, 608519=On December 9, 2014, the Company\u0092s Board of Directors appointed Clint Moore to the Board of Directors. In addition, the Board of Directors appointed Mr. Moore to the Audit Committee and the Compensation Committee., 972717=Balance as of September 30, 2013, 169953=We purchase new boats and other marine-related products from Brunswick, which is the world\u0092s largest manufacturer of marine products, including Sea Ray, Boston Whaler, Harris FloteBote, and Meridian. We also purchase new boats and other marine related products from other manufacturers, including Azimut, Cabo, Hatteras, Grady White, Scout, Sailfish, Malibu, and Nautique by Correct Craft. In fiscal 2014, sales of new Brunswick and Azimut boats accounted for approximately 40% and 14% of our revenue, respectively. Sales of new Sea Ray and Boston Whaler boats, both divisions of Brunswick, accounted for approximately 26% and 10%, respectively, of our revenue in fiscal 2014. No purchases of new boats and other marine related products from any other manufacturer accounted for more than 10% of our revenue in fiscal 2014. We believe our Sea Ray boat purchases represented approximately 43% of Sea Ray\u0092s new boat sales, and approximately 8% of all Brunswick marine product sales during fiscal 2014., 962827=Consistent with our prior practices, we recognize interest and penalties related to uncertain tax positions as a component of income tax expense. As of September 30, 2013 and 2014, interest and penalties represented approximately $100,000 and $110,000, respectively, of the gross unrecognized tax benefits., 966861=During February 2013, our stockholders approved a proposal to amend the 2011 Stock-Based Compensation Plan (\u00932011 Plan\u0094) to increase the 1,200,456 share threshold by 1,000,000 shares to 2,200,456 shares. During January 2011, our stockholders approved a proposal to authorize our 2011 Plan, which replaced our 2007, 166457=We also participate in boat shows and in-the-water sales events at area boating locations, typically held in January and February and toward the end of the boating season, in each of our markets and in certain locations in close proximity to our markets. These shows and events are normally held at convention centers or marinas, with area dealers renting space. Boat shows and other offsite promotions are an important venue for generating sales orders. The boat shows also generate a significant amount of interest in our products resulting in boat sales after the show., 719681=Preferred stock, $.001 par value, 1,000,000 shares authorized, none issued or outstanding as of September 30, 2013 and 2014, 153159=During fiscal 2014, fee income generated from F&I products accounted for 2.6% or $16.1 million of our revenue. We believe that our customers\u0092 ability to obtain competitive financing quickly and easily at our dealerships complements our ability to sell new and used boats. We also believe our ability to provide customer-tailored financing on a \u0093same-day\u0094 basis gives us an advantage over many of our competitors, particularly smaller competitors that lack the resources to arrange boat financing at their dealerships or that do not generate sufficient volume to attract the diversity of financing sources that are available to us., 966121=Cash received from option exercises under all share-based compensation arrangements for the fiscal years ended September 30, 2012, 2013, and 2014 was approximately $1.5 million, $3.3 million, and $4.2 million, respectively. There were no tax benefits realized for tax deductions from option exercises for the fiscal years ended September 30, 2012, 2013, and 2014. We currently expect to satisfy share-based awards with registered shares available to be issued., 554659=Interest Expense. Interest expense decreased $194,000, or 4.6%, to $4.0 million for the fiscal year ended September 30, 2014 from $4.2 million for the fiscal year ended September 30, 2013. Interest expense as a percentage of revenue decreased to 0.6% for the fiscal year ended September 30, 2014 from 0.7% for the fiscal year ended September 30, 2013. The decrease was primarily a result of lower interest rates under our credit facility., 145035=The sale of marine engines, related marine equipment, and boating parts and accessories, which are all tangible products, accounted for 5.1% or $32.3 million of our fiscal 2014 revenue., 418049=On January 26, 2012, certain former shareholders of Surfside - 3 Marina, Inc., a company we acquired in March 2006, filed a lawsuit in the United States District Court for the Eastern District of New York, naming the Company and certain of our directors and officers as defendants. The lawsuit alleged, in twelve counts, a failure to timely lift stock transfer restrictions on stock acquired by the plaintiffs in the acquisition, which allegedly delayed the plaintiffs from selling the shares while the defendants sold shares in the marketplace. The lawsuit claimed damages in excess of $7 million. On December 3, 2012, the District Court issued an order dismissing all of our directors and officers from the action and dismissing eleven of the twelve counts, leaving only the breach of contract claim against the Company to proceed and allowing the plaintiff to replead their alleged common law fraud claim within 30 days. On January 3, 2013, the plaintiffs filed a Second Amended Complaint, re-alleging their breach of contract claim, as well as three fraud claims against the Company and certain directors and officers. The Second Amended Complaint alleges damages in excess of $10 million. On March 7, 2013, the District Court issued an order dismissing the three fraud claims against the Company and our directors and officers. On March 21, 2013, we filed an Answer to the Second Amended Complaint, denying any liability to the plaintiffs. On July 15, 2013, we filed a Motion for Summary Judgment dismissing the plaintiffs\u0092 remaining breach of contract claim against the Company. On August 22, 2013, the District Court granted our Motion for Summary Judgment and entered judgment for the Company. On September 20, 2013, the plaintiffs filed their Notice of Appeal. On August 28, 2014, the United States Court of Appeals for the Second Circuit issued a summary order affirming the district court judgment and issued its mandate on September 18, 2014. Accordingly, because the plaintiffs have failed to file a timely petition for certiorari to the United States Supreme Court, this case is now definitively resolved., 877470=We expense advertising and promotional costs as incurred and include them in selling, general, and administrative expenses in the accompanying consolidated statements of operations. Pursuant to ASC 605-50, we net amounts received by us under our co-op assistance programs from our manufacturers against the related advertising expenses. Total advertising and promotional expenses approximated $9.5 million, $9.8 million, and $9.5 million, net of related co-op assistance of approximately $390,000, $419,000, and $473,000, for the fiscal years ended September 30, 2012, 2013, and 2014, respectively., 516640=FASB Accounting Standards Codification 360-10-40, \u0093Property, Plant, and Equipment - Impairment or Disposal of Long-Lived Assets\u0094 (\u0093ASC 360-10-40\u0094), requires that long-lived assets, such as property and equipment and purchased intangibles subject to amortization, be reviewed for impairment whenever events or changes in circumstances indicate that the carrying amount of an asset may not be recoverable. Recoverability of the asset is measured by comparison of its carrying amount to undiscounted future net cash flows the asset is expected to generate. If such assets are considered to be impaired, the impairment to be recognized is measured as the amount by which the carrying amount of the asset exceeds its fair market value. Estimates of expected future cash flows represent our best estimate based on currently available information and reasonable and supportable assumptions. Our impairment loss calculations contain uncertainties because they require us to make assumptions and to apply judgment in order to estimate expected future cash flows. Any impairment recognized in accordance with ASC 360-10-40 is permanent and may not be restored. Based upon our most recent analysis, we believe no impairment of long-lived assets existed as of September 30, 2014. We do not believe there is a reasonable likelihood that there will be a change in the future estimates or assumptions used to test for recoverability which would result in a material effect on our operating results., 1000941=We have granted non-vested (restricted) stock awards (\u0093restricted stock\u0094) and restricted stock units (\u0093RSUs\u0094) to certain key employees pursuant to the 2011 Plan and the 2007 Plan. The restricted stock awards have varying vesting periods, but generally become fully vested at either the end of year four or the end of year five, depending on the specific award. Certain restricted stock awards granted in fiscal 2008 required certain levels of performance by us by September 2011 before they were earned: these metrics were not met, and the awards were forfeited. Certain RSUs granted in fiscal 2010, 2011, and 2012 require a minimum level of performance of our stock price compared with an index over designated time periods from the grant date before they are earned, or the awards will be forfeited. The stock underlying the RSUs will be delivered upon vesting. The performance metrics for the RSUs granted in fiscal 2010 were not met by the September 2012 measurement date, and the awards were forfeited. The performance metrics for the RSUs granted in fiscal 2011 and 2012 were met by the September 2013 and 2014 measurement dates, and the awards were earned., 250176=Approximately 40% of our revenue in fiscal 2014 resulted from sales of new boats manufactured by Brunswick, including approximately 26% from Brunswick\u0092s Sea Ray division, 10% from Brunswick\u0092s Boston Whaler division, and approximately 4% from Brunswick\u0092s other divisions. Additionally, approximately 14% of our revenue in fiscal 2014 resulted from sales of new boats manufactured by Azimut-Benetti Group. The remainder of our fiscal 2014 revenue from new boat sales resulted from sales of products from a limited number of other manufacturers, none of which accounted for more than 10% of our revenue., 510129=Certain finance and extended warranty commissions and marketing fees on insurance products may be charged back if a customer terminates or defaults on the underlying contract within a specified period of time. Based upon our experience of terminations and defaults, we maintain a chargeback allowance that was not material to our financial statements taken as a whole as of September 30, 2014. Should results differ materially from our historical experiences, we would need to modify our estimate of future chargebacks, which could have a material adverse effect on our operating margins. We do not believe there is a reasonable likelihood that there will be a change in the future estimates or assumptions we use to calculate our estimate of future chargebacks which would result in a material effect on our operating results., 176515=The Amended Credit Facility has certain financial covenants. The covenants include provisions that our leverage ratio not exceed 2.75 to 1.0 and that our current ratio must be greater than 1.2 to 1.0. As of September 30, 2014, we were in compliance with all the covenants under the Amended Credit Facility., 622661=The description of the Sales and Service Agreement with Boston Whaler is qualified in its entirety by reference to the complete terms and conditions of the agreements, which will be filed as an exhibit to the Company\u0092s Quarterly Report on Form 10-Q for the fiscal quarter ending December 31, 2014., 600451=Management is responsible for establishing and maintaining adequate internal control over financial reporting, as such term is defined in Rule 13a-15(f) of the Securities Exchange Act of 1934. Under the supervision and with the participation of our management, including our principal executive officer and principal financial officer, we conducted an evaluation of the effectiveness of the Company\u0092s internal control over financial reporting as of September 30, 2014 as required by the Securities Exchange Act of 1934 Rule 13a-15(c). In making this assessment, we used the criteria set forth by the Committee of Sponsoring Organizations of the Treadway Commission (\u0093COSO\u0094) in Internal Control \u0097 Integrated Framework (1992). Based on its evaluation, our management concluded that its internal control over financial reporting was effective as of September 30, 2014., 883765=The allowance for uncollectible receivables, which was not material to the consolidated financial statements as of September 30, 2013 or 2014, was based on our consideration of customer payment practices, past transaction history with customers, and economic conditions. When an account becomes uncollectable, we expense it as a bad debt and we credit payments subsequently received to the bad debt expense account. We review the allowance for uncollectible receivables when an event or other change in circumstances results in a change in the estimate of the ultimate collectability of a specific account., 47054=MarineMax was founded in January 1998. MarineMax itself, however, conducted no operations until the acquisition of five independent recreational boat dealers on March 1, 1998, and we completed our initial public offering in June 1998. Since the initial acquisitions in March 1998, we have acquired 24 additional recreational boat dealers, two boat brokerage operations, and two full-service yacht repair operations. Acquired dealers operate under the MarineMax name., 693519=We have audited the accompanying consolidated balance sheets of MarineMax, Inc. and subsidiaries as of September 30, 2013 and 2014, and the related consolidated statements of operations, stockholders\u0092 equity, and cash flows for each of the years then ended. These consolidated financial statements are the responsibility of the Company\u0092s management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits., 216007=Our business, as well as the entire recreational boating industry, is highly seasonal, with seasonality varying in different geographic markets. Over the three-year period ended September 30, 2014, the average revenue for the quarters ended December 31, March 31, June 30, and September 30 represented approximately 18%, 25%, 31%, and 26%, respectively, of our average annual revenues. With the exception of Florida, we generally realize significantly lower sales and higher levels of inventories and related short-term borrowings, in the quarterly periods ending December 31 and March 31. The onset of the public boat and recreation shows in January generally stimulates boat sales and typically allows us to reduce our inventory levels and related short-term borrowings throughout the remainder of the fiscal year., 180340=We and the Sea Ray Division of Brunswick are parties to an agreement that provides a process for the acquisition of additional Sea Ray boat dealers that we elect to acquire. The agreement extends through August 31, 2017, with automatic annual one-year extensions at each twelve month anniversary of the agreement, provided that our dealer agreements with the Sea Ray Division of Brunswick are still then in effect. Under the agreement, acquisitions of Sea Ray dealers will be mutually agreed upon by us and Sea Ray with reasonable efforts to be made to include a balance of Sea Ray dealers that have been successful and those that have not been. The agreement provides that Sea Ray will not unreasonably withhold its consent to any proposed acquisition of a Sea Ray dealer by us, subject to the conditions set forth in the agreement. Among other things, the agreement provides for us to provide Sea Ray with a business plan for each proposed acquisition, including historical financial and five-year projected financial information regarding the acquisition candidate; marketing and advertising plans; service capabilities and managerial and staff personnel; information regarding the ability of the candidate to achieve performance standards within designated periods; and information regarding the success of our previous acquisitions of Sea Ray dealers. The agreement also contemplates Sea Ray reaching a good faith determination whether the acquisition would be in its best interest based on our dedication and focus of resources on the Sea Ray brand and Sea Ray\u0092s consideration of any adverse effects that the approval would have on the resulting territory configuration of adjacent or other dealers and the absence of any violation of applicable laws or rights granted by Sea Ray to others., 758106=BALANCE, September 30, 2011, 90406=Our growth was interrupted during the fiscal year ended September 30, 2007, primarily as a result of factors related to the deteriorating housing market and general economic conditions. The substantially deteriorating economic and financial conditions, reduced consumer confidence and spending, increased fuel prices, reduction of credit availability, financial market declines, and asset value deterioration all contributed to substantially lower financial performance in the fiscal years ended September 30, 2008 and 2009, including significant net losses, followed by pre-tax losses in the fiscal years ended September 30, 2010 and 2011. We returned to profitability in fiscal 2012., 99517=The total U.S. recreational boating industry generated approximately $36.7 billion in retail sales in calendar 2013, which is down from the peak of $39.5 billion in calendar 2006. The retail sales include retail sales of new and used recreational boats; marine products, such as engines, trailers, parts, and accessories; and related boating expenditures, such as fuel, insurance, docking, storage, and repairs. Retail sales of new and used boats, engines, trailers, and accessories accounted for approximately $26.9 billion of such sales in 2013. Annual retail recreational boating sales were $17.9 billion in 1988, but declined to a low of $10.3 billion in 1992 based on industry data published by the National Marine Manufacturers Association. We believe this decline was attributable to several factors, including a recession, the Gulf War, and the imposition throughout 1991 and 1992 of a luxury tax on boats sold at prices in excess of $100,000. The luxury tax was repealed in 1993, and retail boating sales increased each year thereafter except for 1998, 2003, and 2007 through 2010., 246801=Our Amended Credit Facility with GE Commercial Distribution Finance Corporation provides a floor plan financing commitment of up to $235.0 million. The collateral for our Amended Credit Facility is all of our personal property with certain limited exceptions. None of our real estate has been pledged as collateral for the Amended Credit Facility. As of September 30, 2014, we were in compliance with all of the covenants under the Amended Credit Facility and our additional available borrowings under our credit facility was approximately $38.2 million based upon the outstanding borrowing base availability., 581409=2019, 524662=In May 2014, the FASB issued Accounting Standards Update No. 2014-09, \u0093Revenue from Contracts with Customers (Topic 606)\u0094 (ASU 2014-9), a converged standard on revenue recognition. The new pronouncement requires revenue recognition to depict the transfer of promised goods or services to customers in an amount that reflects the, 697432=We have audited the accompanying consolidated statements of operations, stockholders\u0092 equity and cash flows of MarineMax, Inc. and subsidiaries for the year ended September 30, 2012. These financial statements are the responsibility of the Company\u0092s management. Our responsibility is to express an opinion on these financial statements based on our audits., 514947=We account for goodwill in accordance with FASB Accounting Standards Codification 350, \u0093Intangibles - Goodwill and Other\u0094 (\u0093ASC 350\u0094), which provides that the excess of cost over net assets of businesses acquired is recorded as goodwill. The acquisitions of Bassett Marine, LLC and Parker Boat Company resulted in goodwill of $802,000. In accordance with ASC 350, we review goodwill for impairment at least annually and whenever events or changes in circumstances indicate that the carrying value may not be recoverable. Our annual impairment test is performed during the fourth fiscal quarter. If the carrying amount of goodwill exceeds its fair value we would recognize an impairment loss in accordance with ASC 350. As of September 30, 2014, and based upon our most recent analysis, we determined through our qualitative assessment that it is not \u0093more likely than not\u0094 that the fair values of our reporting units are less than their carrying values. As a result, we were not required to perform the two-step goodwill impairment test. The qualitative assessment requires us to make judgments and assumptions regarding macroeconomic and industry conditions, our financial performance, and other factors. We do not believe there is a reasonable likelihood that there will be a change in the judgments and assumptions used in our qualitative assessment which would result in a material effect on our operating results., 148747=Maintenance, repair, and storage services accounted for 7.2% or $45 million of our revenue during fiscal 2014 of which, 4.8% or $29.8 million related to repair services, 1.0% or $6.5 million related to parts and accessories for repairs, and 1.4% or $8.7 million related to income from storage service rentals. This includes warranty and non-warranty services., 89781=During the nine-year period from the commencement of our operations through our fiscal year ended September 30, 2007, our revenue increased from $291.0 million to more than $1.2 billion. Our revenue and net income increased in seven of those nine years over the prior year revenue and net income. This period was marked by an increase in retail locations from 41 on September 30, 1998 to 88 on September 30, 2007, resulting from acquisitions and opening new stores in existing territories., 178115=As of September 30, 2014, we owed $124.4 million under the Amended Credit Facility. Outstanding short-term borrowings accrued interest at a rate of 3.6% as of September 30, 2014, and the Amended Credit Facility provided us with an additional net borrowing availability of approximately $38.2 million, based upon the outstanding borrowing base availability. We have no indebtedness associated with our real estate holdings., 13532=As of December 1, 2014, there were outstanding 25,067,231 shares of the registrant\u0092s common stock, par value $.001 per share., 577026=2015}",
    "lastModified": "Thu, 11 Dec 2014 21:09:47 GMT",
    "textBeforeTable": "  Indicate by check mark whether the registrant is a large accelerated filer, an accelerated filer, a non-accelerated filer, or a smaller reporting company. See the definitions of \u0093large accelerated filer,\u0094 \u0093accelerated filer\u0094 and \u0093smaller reporting company\u0094 in Rule 12b-2 of the Exchange Act. (Check one): Indicate by check mark if disclosure of delinquent filers pursuant to Item 405 of Regulation S-K (§ 229.450 of this chapter) is not contained herein, and will not be contained, to the best of registrant\u0092s knowledge, in definitive proxy or information statements incorporated by reference in Part III of this Form 10-K or any amendment to this Form 10-K.  ¨ Indicate by check mark whether the registrant has submitted electronically and posted on its corporate Website, if any, every Interactive Data File required to be submitted and posted pursuant to Rule 405 of Regulation S-T (§ 232.405 of this chapter) during the preceding 12 months (or for such shorter period that the registrant was required to submit and post such files).    Yes  x    No  ¨ Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject",
    "textAfterTable": "58    Item 11   Executive Compensation      58    Item 12   Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters      58    Item 13   Certain Relationships and Related Transactions, and Director Independence      58    Item 14   Principal Accountant Fees and Services      58    PART IV   Item 15   Exhibits, Financial Statement Schedules      58    Statement Regarding Forward-Looking Information The statements contained in this report on Form 10-K that are not purely historical are forward-looking statements within the meaning of applicable securities laws.",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}