{
    "relation": [
        [
            "First Name",
            "James",
            "James",
            "William J.",
            "Mary"
        ],
        [
            "Last Name",
            "Telegan",
            "Toner?",
            "Turner",
            "Twomey"
        ],
        [
            "Soundex",
            "T425",
            "T560",
            "T656",
            "T500"
        ],
        [
            "Date of Death",
            "11/30/1888",
            "1/22/1889",
            "11/24/1889",
            "2/26/1889"
        ],
        [
            "Last Residence",
            "9 Linnet St.",
            "141 Ocean Ave",
            "68 RR Ave",
            "352 Ave D."
        ],
        [
            "S.I.",
            "",
            "",
            "",
            ""
        ],
        [
            "Bayonne",
            "y",
            "y",
            "y",
            "y"
        ],
        [
            "Father/From",
            "Richard W.",
            "Bernard/Ire",
            "Robert/England",
            "Charles"
        ],
        [
            "Mother/From",
            "Mary",
            "Mary/Ireland",
            "Bridget/Ire",
            ""
        ],
        [
            "Cemetery",
            "St. Mary's S.I.",
            "HCCC",
            "HCCC",
            "HCCC"
        ],
        [
            "Notes",
            "Aged 2y,6d both parents born St. John's Nova Scotia",
            "Aged 23y,10m, 9 y in NJ, 9 years in US, born Ireland",
            "Aged 24y, born England, 11 years in US",
            "Aged 4y,3m"
        ]
    ],
    "pageTitle": "Dempsey Funeral Home Burials - 1886 - 1889 - Staten Island, Richmond County, NY - Genealogical Resources",
    "title": "",
    "url": "http://www.rootsweb.ancestry.com/~nyrichmo/cemeteries/Dempsey18861889.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 689495219,
    "recordOffset": 689473346,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5529=FACSI has donated the entire Dempsey collection to the Staten Island Museum. Contact Cara Dellatte, archivist, 718-727-1135 or CDellatte at statenislandmuseum dot org for additional research.}",
    "textBeforeTable": "Dempsey main page FACSI has donated the entire Dempsey collection to the Staten Island Museum. Contact Cara Dellatte, archivist, 718-727-1135 or CDellatte at statenislandmuseum dot org for additional research. Lynn Rogers has typed the data and made it available free for all. Please see the FACSI website at FACSI for more information about this worthwhile organization. Many thanks to Lynn for her generosity! Dempsey The Friends of Abandoned Cemeteries has a collection of original Dempsey & Son's Funeral home books and records. Dempsey operated as an undertaker having businesses on Staten Island, NY and Bayonne, NJ for about 100 years. At one time, Dempsey served as the Coroner for S.I. and Bayonne. Dempsey & Son's mostly buried Irish/Catholics but not exclusively. As these books are transcribed FACSI will make them available for genealogy research. Please note that some of the entries are faded and hard to read and were transcribed to the best of our ability. Also note that Dempsey was in business and these records are a recording of his transactions and in a small number of entries the dates may be of the date of burial and not the date of death. Staten Island, Richmond County, NY Genealogy Resources",
    "textAfterTable": "Beginning 1930s 1937 - 1948 New 13 Mar 1938 - 1948 Friends of Abandoned Cemeteries Inc. Friends of Abandoned Cemeteries Inc. S. I. 158 Myrtle Avenue Staten Island, NY 10310 917-545-3309 SICemetery@aol.com Our FACSI page FACSI website FACSI facebook page Pearse O'Callaghan, Founder (1921-1995) A B C D E F G H I J K L M N O P Q R S T U V W X Y Z Dempsey Funeral Home Books 1886 - 1889 This book was transcribed by Lynn Rogers. Thank you, Lynn! A First Name Last Name Soundex Date of Death Last Residence S.I. Bayonne Father/From Mother/From Cemetery Notes Michael J. Ahern A650 10/21/1889 85 W 21st St.   y Michael Sarah Ann HCCC Aged 3y,1m Julia Ayore A600 9/4/1889 Ave D.   y Thomas Julia HCCC Aged 3m,14d, born MA, Bridget Ayres A620 06/17/2889 Hobart Ave   y John   HCCC Aged 5d B First Name Last Name Soundex Date of Death Last Residence S.I. Bayonne",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}