{
    "relation": [
        [
            "First Name",
            "Chris",
            "Cris",
            "Marisela"
        ],
        [
            "Last Name",
            "Alsup",
            "Turner",
            "Salayandia"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=62EB5A8A-0E6D-4290-BF6E-17BA66FCB443&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00321-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222717722,
    "recordOffset": 222709520,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16276=H.R. 523 - Protect Medical Innovation Act of 2013 (all provisions); tax policy generally including deferral of foreign-earned income, repatriation, and corporate tax rates (no specific legislation)., 23040=Issues generally relating to online piracy, unfair competition and misappropriation of IT (no specific legislation); Issues generally relating to the use of the International Trade Commission in patent infringement disputes (no specific legislation); Litigation by patent-assertion entities before federal courts and the US International Trade Commission. H.R. 845 - Saving High Tech Innovators from Egregious Legal Disputes (SHIELD Act) - issues relating to litigation by patent-assertion entities in Federal Court. S. 1013 - Patent Abuse Reduction Act of 2013 - Entire bill. H.R. 2639 - Patent Abuse Reduction Act of 2013 - Entire bill. H.R. 2024 - End Anonymous Patents Act - Entire bill. S. 866 - Patent Quality Improvement Act of 2013 - Entire bill. H.R. 2766 - Stopping Offensive Use of Patents (STOP) Act - Entire bill. President Obama's executive directive (June 4, 2013) on patent-assertion entities, including actions to be taken at the U.S. Patent and Trademark Office and the Federal Trade Commission. H.R. 3099 - The Innovation Act of 2013 - Entire bill. S. 1612 - Patent Litigation Intregrity Act of 2013 - Entire bill. S. 1720 - Patent Transparency and Improvement Act of 2013 - Entire bill., 39635=Issues generally relating to consumer data privacy (no specific legislation introduced or pending). S. 607 - Electronic Communications Privacy Amendments Act of 2013 - issues related to ECPA reform., 48621=Issues related to the Bipartisan Budget Act of 2013 (H.J. Res) and GY2014 Federal Government Funding. H.R. 3547 - FY2014 Omnibus Legislation - Language related to the procurement of foreign IT products and service. S. 1329 - FY14 Commerce, Science, Justice Appropriations bill - Language related to the procurement of foreign IT products and service., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 60571=Issues generally relating to small and medium-sized businesses, including government regulations, taxation, cloud computing, veteran-owned businesses, security and access to credit (no specific legislation introduced). H.R. 3559 - Entrepreneur in Residence Act of 2013 - Entire bill., 55724=Issues generally relating to H1B visas, visas for employees of small business start-up companies, and visas for foreign higher education students (no specific legislation introduced or pending). S. 169 - Immigration Innovation Act of 2013 - entire bill. S. 744 - Border Security, Economic Opportunity and Immigration Modernization Act of 2013 - entire bill. H.R.2131 - SKILLS Visa Act - Entire Bill, 66816=H.R. 354 - Responsible Helium Administration & Stewardship Act of 2013 - entire bill., 44272=Issues generally relating to cybersecurity workforce development, supply chain security and cybersecurity procurement (no specific legislation introduced or pending); White House executive order on Cybersecutity - entire issue; CONTINUED H.R. 624 - Cyber Intelligence Sharing and Protection Act; H.R. 756 - Cybersecurity Enhancement Act of 2013; H.R. 1468 - SECURE IT; S. 21 - Cybersecurity and American Cyber Competitiveness Act of 2013 (all provisions). H.R. 3696 - National Cybersecurity and Critical Infrastructure Act of 2013 - Entire bill.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  Cris Turner  2024083355  Cris_Turner@Dell.com 5. Senate ID#  11958-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}