{
    "relation": [
        [
            "Darious Cummings",
            "Leon Orr",
            "Jay-nard Bostwick",
            "Caleb Brantley",
            "Antonio Riles"
        ],
        [
            "B+",
            "INC",
            "C",
            "D+",
            "C-"
        ],
        [
            "When he was able to practice, Cummings looked great, including one day where he was a disruptive force on seemingly every play. But a family matter kept Cummings out of a large number of practices.",
            "He was never able to practice this spring while recovering from a fractured wrist. How he performs during fall camp will go a long ways to clear up the position.",
            "His strength is undeniable but Bostwick was never consistent enough with his technique or assignments to impress at defensive tackle. He needs to benefit from extensive off-season work on his fundamentals.",
            "The positive is he's incredibly talented with a high ceiling. The negative was almost everything else during spring. He was a constant target of Brad Lawing and for good reason. Brantley showed signs of the \"uncoachable\" player who first arrived at UF.",
            "He is being graded with the defensive tackles, rather than offensive guards, but the grade is for both positions. He had more success and playing time at the latter, but that was also because of some injuries."
        ]
    ],
    "pageTitle": "InsidetheGators.com - Spring Recap: The Defensive Line",
    "title": "",
    "url": "https://florida.rivals.com/content.asp?CID=1633221",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877041077,
    "recordOffset": 877024683,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1928=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 InsidetheGators.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{36171=April 19, 2014}",
    "textBeforeTable": "DEFENSIVE END Antonio Riles spent the end of camp at offensive guard. Walk-ons played the majority of the second half of the spring game. Whether it is shaping up what's currently here or taking a gamble with freshmen, Florida has to figure something out depth-wise at defensive tackle. Caleb Brantley struggled to give consistent effort and was injured in the spring game. Jay-nard Bostwick came the closest but that was largely due to past progress that made him stand out as a freshman. DISAPPOINTING: This was a huge spring for Florida's redshirt freshman defensive tackles. At least one of them needed to step up and show he was ready to be counted upon on fall Saturdays. Bryan Cox Jr. proved to be a player the Gators can trust at defensive end. Cox saw a small role in 2013 but received almost all of the first-team snaps at end throughout spring because of Bullard playing inside. He fared well, maybe not as good overall as the initial hype, but proved to be a Bullard-like player who can run with a steady motor and make plays. Then again, Cox had a solid spring in 2013 as well but was not quite able to translate it to the field consistently. This year will need to be different. THE SURPRISE: Vernon",
    "textAfterTable": "Dante Fowler Jr. A+ Florida's best offensive tackles had difficulty slowing Fowler most of the spring and both had a strong 15 practices. He'll gave tackles trouble all fall as well. Alex McCalister B- Currently, he falls into the category used to wonder aloud if spring success will translate into anything in the fall. McCalister is ready, per the coaches, but only September will show how much he will actually be used. Jordan Sherit C+ After being extremely limited during his freshman year because of a lingering injury, it was a positive for Sherit to get substantial work at Buck and outside linebacker. But playing through a hyper extended elbow didn't help his cause. DEFENSIVE TACKLE/NOSE GUARD Darious Cummings B+ When he was able to practice, Cummings looked great, including one day where he was a disruptive force on seemingly every play. But a family matter kept Cummings out of a large number of practices. Leon Orr INC He was never able to practice this",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}