{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have our own police department. (they become annoying when it comes to parking tickets)",
            "Our greek life is relaxed, there are no greek houses.",
            "Many of the men on campus have trucks that have big mud tires on lifts. There is a great TV room in the campus center.",
            "Use your graduation profile on SIS to make sure that you are taking classes relevant to graduation.",
            "Campus life is pretty quiet but we do have many clubs and some on campus activities.",
            "The food varies between the eatery's. I would say compared to other campus food the food here taste pretty well.",
            "I did not live on campus however I have plenty of friends who do. The dorms are beautiful only down fall is they shut down during breaks forcing you to go home even if finances don't allow you to.",
            "Some classes can be tough just stay strong.",
            "Keep focused! Know the point system if applying for health science program.",
            "The staff is very helpful and friendly. Beautiful campus with a mix of small city and rural life. Great place to call home!"
        ]
    ],
    "pageTitle": "Pennsylvania College of Technology (Penn College) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pennsylvania-College-of-Technology/reviews?_escaped_fragment_=/show/73970",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892620751,
    "recordOffset": 892579803,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25885=Anyone who has likes a hands one style of learning, or wants to work with the most updated technology in the industry. Penn College is a special mission affiliate of Penn State, like Hersey's Medical School. Penn College is a Penn State Technology School but is a different entity from Penn State. The college keeps everything in their labs updated constantly, and even updates the buildings and lab areas constantly. The masonry lab is a brand new facility on the north side of the campus and the welding lab was just renovated in August 2010., 14612=Bang for the buck I really see paying 22000 dollars a year kinda obsure when some of the classes aren't counted towards your major., 184126=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/14/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 45 Kyle from Sunbury, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Pennsylvania College of Technology Reviews Pennsylvania College of Technology › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "I AM DEFINITELY LEARNING MORE THAN I COULD HAVE IMAGINED. THE WELDING CLASSES AND WELDING THEORY ALONG WITH THE CNC PROGRAMMING AND ROBOTICS REALLY HELP ME TO SEE WHAT KIND OF FUTURE I MAY CONSIDER. Login to rate or flag the reviews Amber from Philadelphia, PA 09/11/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 45 Categories Comments Tips for prospective students be ready to learn cause everything it mostly hands on Bang for the buck it worth it Am enjoying being here I really like the people here and its a club in walking distance from campus Am learning a lot Never go a day without homework in one of classes Login to rate or flag the reviews",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}