{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Mercer is really expensive, and it can be frustrating when there are financial aid mix ups. But over all, it's totally worth it.",
            "I absolutely love Mercer's campus. It's large enough that you don't feel trapped, but it's small enough that everything is in close proximity to where ever you are standing on campus. The campus life is pretty great. We have things like Bearstock, where they bring headlining bands to play for the day. The people are great. It's a good environment.",
            "Since Mercer is a relatively small school, you will have a lot of one on one opportunities with Professors. Because of this, Professors tend to be more involved in their students lives. Constant interaction with my professors makes me want to make them proud. Ultimately, they push me to learn the most I can and to take advantage of the resources that Mercer offers."
        ]
    ],
    "pageTitle": "Mercer University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mercer-University/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898256087,
    "recordOffset": 898174861,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17796=Since arriving at Mercer in 2008, I've broke a world record, made fantastic friends, made personal relationships with my professors, watched the Bears play in the Atlantic Sun Conference Championship, traveled to Mercer's original campus, heard Jimmy Carter speak, been present for the press release informing Mercerians that we will be receiving a new football team, witnessed the impact College Hill Corridor has had upon our loving community and been able to Be the Bear. And that's just to name a few of my Mercer memories :), 410638=© 2015, Cappex.com, LLC, 323930=The Mercer Cafe' is amazing! Not only is the food absolutely delicious, but it is also healthy! During my stay at Mercer, I've gotten to know many of the staff members in the cafeteria. Oh, and guess what? It's buffet style! So, if you find something that you really like, you can eat as much of it as you'd like. Also, in the University Center there is a Chick-Fil-A, a Subway, and Burger Studio just in case you ever need to catch a meal after 8:30 p.m., 403489=I will be attending Mercer in the fall of 2015. The campus and student body size is perfect for me and anyone else looking for a small size university. Their merit base scholarships are very competitive compared to the other universities I applied to., 114862=I am definitely enjoying my time here. Not too much to do around town, but things are starting to pick up. We're getting our football team back in the Fall of 2013 (I'll be gone by then), but its exciting for prospective students. The people are amazing here, almost like a small family., 250956=There's Pilgrimage to Penfield in the fall, the Christmas Tree Lighting in December, Founder's Fay in the spring, along with BearStock(Mercer's rendition of Woodstock.) The Jesse Mercer statue in the center of campus is something that we hold dear, and when you get to sign your name at the top of the Administration Building, you can see all of the campus and even past Macon. Mercer has a very strong history that is celebrated throughout the year.}",
    "textBeforeTable": "01/03/2010 Reviewer is A current student here. 26 out of 26 people found this review useful. 1 person found this inaccurate. 1 of 99 Michael from Chatsworth, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Mercer University Reviews Mercer University › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "I absolutely love being at Mercer. It's a very welcoming environment, and it doesn't take long to become part of the family that is the Mercer community. There are many clubs, fraternities, sororities, and other groups that help making the Mercer experience one of the best there is. Am learning a lot Mercer excels in education because it demands it from it students, while offering much help to reach the high expectations Mercer has set for them. There plenty of tutors and professors available regularly, as well as many computer labs and the extraordinary Tarver Library. Of course Mercer is no place to be fooling around at; if you decide to attend Mercer then you better be prepared to work hard. Login to rate or flag the reviews Richard from LaGrange, GA 07/29/2009 Reviewer is A current student here. 18 out of 24 people found this review useful. 1 person found this inaccurate. 2 of 99 Categories Comments Great for these types of students If you are",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}