{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Hang out with friends and enjoy the area.",
            "Vending machines and a small cafe.",
            "There are no dorms",
            "With both challenging and easy courses it depends",
            "Check out the campus and see how you like it and if you can see yourself going there.",
            "A nice school with a very nice campus that has many things to offer. Great professors and staff are there to help you whenever you need help. Located in a nice area this college is optimal for all students."
        ]
    ],
    "pageTitle": "St Petersburg College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/St-Petersburg-College/reviews?_escaped_fragment_=/show/85728",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888124547,
    "recordOffset": 888009173,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{638199=It is about 2600 per 5 class semester with books included. This seems to be a steal compared to other schools., 286044=At the low rate they have, this is the best choice! Five classes (a full time load) is less than $2000. Most of the professors are hard but they are more than fair. One of them once told me It's best to fail in here than out there., 698509=© 2015, Cappex.com, LLC, 364302=I'm an online student, and I feel like I don't always get the help and info I need when calling the school or emailing. I cannot go into the campus because I am in North Carolina. It took 3 weeks for them to get my book order correct, and because of that I had to start my math class a week late. I have been in school for about 6 months now, and have recently been told I will not be able to start the program I am interested in until august 2013 ANOTHER YEAR FROM NOW!!! That is really discouraging and upsetting.}",
    "textBeforeTable": "01/23/2010 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 173 Tyler from Clearwater, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students St Petersburg College is great for all students. They have wonderful advisors if you are new and need help with things such as financial aid and scheduling classes. They are also great for the seasoned college student who would rather take charge of their own academics. They also offer a huge variety of online courses for the working student. Tips for prospective students St Petersburg College is a great school. Most students only come for their A.A. degrees and go somewhere else for a Bachelors, however I highly recommend their 4 year programs. They have a variety of majors to choose from and their faculty is exceptional. Bang for the buck Because it's not a university St Petersburg College is much more affordable and accessible (they have 9 different campuses) for students who don't have the financial backing to attend a brand name school. While SPC is not a university it is an accredited 4 year state college with wonderful programs in over 18 areas of study. Am enjoying being here After attending a big university for 2 semesters, I found myself back at St Petersburg College. The small classes and great professors are why",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}