{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Moderately Cold",
            "Pleasant",
            "Moderately Hot",
            "Very Hot",
            "Very Hot",
            "Rainy",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Pleasant",
            "Pleasant",
            "Moderately Cold"
        ],
        [
            "Details",
            "Puri experiences mild cold climate in January and the period is very favorable for tourist visits. The days are pleasant but little chilly in the evenings. Light woolens will be helpful. The month is ideal for sightseeing and taking up various activities in and around the city. Makar Mela is held in this month.",
            "The climate continues to be favorable for tourism with plenty of blue skies and a few white passing clouds. A good time for visiting and sighting attractions of the place. The natural vista of the place is also worth enjoying.",
            "It is beautiful as natural vibrancy is at its maximum. This is also end of the official tourist season. The temperature starts to rise, but is still within the comfortable range. Days can get warm but nights are comfortable. A good time for sightseeing and enjoying adventure sports.",
            "The place experiences the actual summer season with very hot climate. In fact, days are unbearably hot. Evenings get a bit cooler but are still a little too hot for comfort. Not the most ideal time for outdoor activities. Sun protection is a must if you are travelling in hot days.",
            "May is not the best month for travelling to Puri as this is the hottest month of the year and the heat is unbearable. The sky is devoid of clouds and the sun shines strongly, making the winds very warm. Travelling during hot summer days will require loose cotton wears, sun protective stuffs and water bottles. Jhamu Yatra Kakatapur festival is celebrated in May.",
            "The temperature starts to fall owing to the onset of monsoon but the proximity to the sea makes it humid. The month receives decent amount of rain, causing a comfortable decrease in the temperatures. Good time for sightseeing and temple visits, but activities revolving around the sea should be avoided. This is also the month when the famous Rath Yatra is held.",
            "The rainy season well and truly arrives. This is the second wettest month of the year and rainfall accompanied by thunderstorms may continue for long hours. A good time for temple visits as the rains bring down the temperature to cooler levels. Besides, it is also the time for witnessing Puri Jagannath Car festival.",
            "This is the wettest month of the year, with rainfall occurring almost all through the day. There will be very little blue sky and this is also one of the coolest months of the year. It is a good time for pilgrimage visits. However, humidity can be a cause of inconvenience for a few travelers. The festival of Julana Purnima is celebrated in August.",
            "The climate during this month will be very beautiful with warm days and cool nights. There are often several days without rainfall and the sky will remain blue in the breaks. Temperatures are comfortable as a cooling breeze flows through the region. Sighting attractions, pilgrimage visits and outdoor activities can be enjoyed.",
            "One of the coolest months in the year and is best for tourism. The natural beauty is at its peak and tourists can enjoy various adventurous activities, temple visits and local sightseeing. Clear skies and plenty of sunshine dominate the month.",
            "With cool days and cozy nights, this is the best time to visit Puri. Weather is very pleasant and is suitable for all kinds of tourist activities. Enjoyable time for exploring different sights of the place. Temperatures start to dip from the end of this month and winter begins to set in.",
            "This is one of the best months for holidaying in Puri as the region is very beautiful with lot of greenery. The climate is cool during morning but can get chilly during the night, especially at the end of this month. Light woolens should be carried in case it gets cold."
        ]
    ],
    "pageTitle": "PURI Weather, Temperature, Best Season, Puri Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Puri-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 607078899,
    "recordOffset": 607044384,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Puri Weather Home  ›  Destinations  ›  Orissa  ›  Puri  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Oct - Mar Summer 19 to 45Â°C, Winter 3 to 32Â°C Best Season / Best time to visit Puri Puri has a hot summer and a bit cool winters. The best time to visit the place is from June to March. Winters (December to February) has the cool range of temperature between 10Â°C and 18Â°C. This period is well suited for sightseeing and carrying out all types of tourist activities. Summers (March to May) have the mercury levels between 19Â°C and 45Â°C. March is comfortably hot and some tourist activities can be carried out, while April and May are extremely hot which is not ideal for outdoor activities. Monsoons (June to September) have a medium to heavy rainfalls. The climate is still comfortable for pilgrimage visits. October to November months has pleasant weather making it ideal for sightseeing and other tourist activities. During festival season in June-July, the place receives thousands of devotees and visitors. Summer months, especially April and May are very hot and most people donâ\u0080\u0099t prefer visiting during these periods. Rains donâ\u0080\u0099t cause much hindrance to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}