{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "TD"
        ],
        [
            "regulations.gov",
            "2015-08856",
            "1545-BM07",
            "9674"
        ]
    ],
    "pageTitle": "26 CFR 1.151-2 - Additional exemptions for dependents. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/1.151-2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 925967051,
    "recordOffset": 925933190,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1019=Title 26 published on 2015-04-01.}",
    "TableContextTimeStampAfterTable": "{90570=§ 1503 - Computation and payment of tax, 96969=103 Stat. 2413, 90078=§ 1471 - Withholdable payments to foreign financial institutions, 97317=114 Stat. 2763, 90322=§ 1473 - Definitions, 87153=§ 1092 - Straddles, 30350=This document contains corrections to final regulations (TD 9708) that were published in the Federal Register on December 31, 2014 (79 FR 78954). The final regulations provide guidance regarding the requirements for charitable hospital organizations added by the Patient Protection and Affordable Care Act of 2010., 90204=§ 1472 - Withholdable payments to other foreign entities, 89211=§ 1377 - Definitions and special rule, 55111=This document contains a correction to final and temporary regulations (TD 9674) that were published in the Federal Register on Wednesday, July 2, 2014 (79 FR 37630). The final and temporary regulations provide guidance to eligible organizations seeking recognition of tax-exempt status under section 501(c)(3) of the Internal Revenue Code., 59587=This document contains corrections to final and temporary regulations (TD 9713) that were published in the Federal Register on March 13, 2015 (80 FR 13233). The final regulations are relating to information reporting by brokers for bond premium and acquisition premium., 88832=§ 1301 - Averaging of farm income, 89932=§ 1445 - Withholding of tax on dispositions of United States real property interests, 86666=§ 1017 - Discharge of indebtedness, 161581=In the Rules and Regulations section of this issue of the Federal Register, the IRS is issuing final and temporary regulations that amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. The regulations provide an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of these proposed regulations. This document withdraws the notice of proposed rulemaking (REG-107548-11; RIN 1545-BK10) published in the Federal Register on May 11, 2012 (77 FR 27669)., 88070=§ 1291 - Interest on tax deferral, 89829=§ 1443 - Foreign tax-exempt organizations, 89019=§ 1368 - Distributions, 99443=Title 26 published on 2015-04-01, 88748=§ 1298 - Special rules, 87364=§ 1221 - Capital asset defined, 87233=§ 1202 - Partial exclusion for gain from certain small business stock, 112162=This document cancels a public hearing on proposed regulations that provide the method to be used to adjust the applicable Federal rates (AFRs) under section 1288 of the Internal Revenue Code (adjusted AFRs) for tax-exempt obligations and the method to be used to determine the long-term tax-exempt and the adjusted Federal long-term rate under section 382., 89718=§ 1441 - Withholding of tax on nonresident aliens, 90488=§ 1502 - Regulations, 25179=This document contains final and temporary regulations amending the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. This document also contains temporary regulations regarding an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of the proposed regulations set forth in the notice of proposed rulemaking (REG-102656-15) on this subject in the Proposed Rules section in this issue of the Federal Register ., 89310=§ 1378 - Taxable year of S corporation, 38815=This document contains corrections to final regulations (TD 9717) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18096). The final regulations are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 46793=This document contains corrections to final regulations (TD 9715) that were published in the Federal Register on April 1, 2015 (80 FR 17314). The final regulations are regarding the agent for an affiliated group of corporations that files a consolidated return (consolidated group)., 87456=§ 1244 - Losses on small business stock, 88643=§ 1297 - Passive foreign investment company, 88165=§ 1293 - Current taxation of income from qualified electing funds, 88927=§ 1361 - S corporation defined, 87705=§ 1254 - Gain from disposition of interest in oil, gas, geothermal, or other mineral properties, 86863=§ 1059 - Corporate shareholder’s basis in stock reduced by nontaxed portion of extraordinary dividends, 218084=This document contains corrections to a notice of proposed rulemaking by cross-reference to temporary regulations (REG-143040-14) that was published in the Federal Register on Friday, March 13, 2015 (80 FR 13292). The IRS is issuing temporary regulations relating to information reporting by brokers for transactions involving debt instruments and options., 97857=94 Stat. 1208, 88292=§ 1294 - Election to extend time for payment of tax on undistributed earnings, 16219=This document contains final regulations under section 382 of the Internal Revenue Code (Code) that modify the effective date provision of recently published regulations. These regulations affect corporations whose stock is or was acquired by the Department of the Treasury (Treasury) pursuant to certain programs under the Emergency Economic Stabilization Act of 2008 (EESA)., 3067=This document contains corrections to final regulations (TD 9719) that were published in the Federal Register on May 8, 2015 (80 FR 26437). The final regulations amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts., 96793=103 Stat. 2373, 195661=This document contains corrections to notice of proposed rulemaking by cross-reference to temporary and notice of public hearing (REG-133489-13) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18171). The notice of proposed rulemaking by cross-reference to temporary and notice of public hearing are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 87557=§ 1248 - Gain from certain sales or exchanges of stock in certain foreign corporations, 90671=§ 1504 - Definitions, 88431=§ 1295 - Qualified electing fund, 151784=This document contains proposed regulations that provide guidance regarding the application of the modified carryover basis rules of section 1022 of the Internal Revenue Code (Code). Specifically, the proposed regulations will modify provisions of the Treasury Regulations involving basis rules by including a reference to section 1022 where appropriate. The regulations will affect property transferred from certain decedents who died in 2010. The regulations reflect changes to the law made by the Economic Growth and Tax Relief Reconciliation Act of 2001 and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010., 87968=§ 1286 - Tax treatment of stripped bonds, 89103=§ 1374 - Tax imposed on certain built-in gains, 90404=§ 1474 - Special rules, 98028=94 Stat. 1308, 89636=§ 1402 - Definitions, 86762=§ 1032 - Exchange of stock for property, 103702=This document contains corrections to a notice of proposed rulemaking (REG-132634-14) that was published in the Federal Register on Wednesday, May 6, 2015 (80 FR 25970). The proposed rules provide guidance on qualifying income from exploration, development, mining or production, processing, refining, transportation, and marketing of minerals or natural resources., 88525=§ 1296 - Election of mark to market for marketable stock, 96406=§ 1001 note - Congressional findings and declaration of policy, 12112=This document contains amendments to temporary regulations relating to information reporting by brokers for transfers of debt instruments. The amendments change the applicability date of the temporary regulations for reporting certain information on a transfer statement from June 30, 2015, to January 1, 2016. The amendments to the temporary regulations will provide guidance to brokers and their customers., 90753=§ 1561 - Limitations on certain multiple tax benefits in the case of certain controlled corporations, 99157=Reorganization ... 1978 Plan No. 4, 87862=§ 1275 - Other definitions and special rules, 87027=§ 1060 - Special allocation rules for certain asset acquisitions}",
    "lastModified": "Fri, 19 Jun 2015 03:49:55 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 34051 - Notional Principal Contracts; Swaps With Nonperiodic Payments; Correction 2015-06-15; vol. 80 # 114 - Monday, June 15, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on 2015-04-01. [T.D. 7114, 36 FR 9019, May 18, 1971] The only exemption allowed for a dependent of the taxpayer is that provided bysection 151(e). The exemptions provided by section 151(c) (old-age exemptions) and section 151(d) (exemptions for the blind) are allowed only for the taxpayer or his spouse. For example, where a taxpayer provides the entire support for his father who meets all the requirements of a dependent, he is entitled to only one exemption for his father (section 151(e)), even though his father is over the age of 65. (b)",
    "textAfterTable": "DEPARTMENT OF THE TREASURY, Internal Revenue Service Correcting amendment. This correction is effective on June 15, 2015 and applicable May 8, 2015. 26 CFR Part 1 Summary This document contains corrections to final regulations (TD 9719) that were published in the Federal Register on May 8, 2015 (80 FR 26437). The final regulations amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. 2015-06-12; vol. 80 # 113 - Friday, June 12, 2015 80 FR 33402 - Partnership Transactions Involving Equity Interests of a Partner GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-14405 RIN 1545-BM35 TD 9722 DEPARTMENT OF THE TREASURY,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}