{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Join clubs you might like.",
            "Always be in contact with your professors.",
            "Laredo Community College is very helpful. This is a good college to attend especially when you are barely starting off with your basics. This college made it easier for me to achieve an outstanding GPA thanks to their outstanding instructors."
        ]
    ],
    "pageTitle": "Laredo Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Laredo-Community-College/reviews?_escaped_fragment_=/show/72283",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917878963,
    "recordOffset": 917836473,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{191120=© 2015, Cappex.com, LLC, 63068=Unfortunately, this past semester, Spring 2012, the dorms were demolished to build new buildings so there are no dorms anymore.}",
    "textBeforeTable": "06/02/2011 Reviewer is A past student here. 2 out of 2 people found this review useful. 1 of 50 Alexandra from Laredo, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Many people believe that community colleges are a joke, but they really are not. Laredo Community College (LCC) taught me not only academically, but socially as well. I learned to build on different social, self, and academic skills that made me a better student and over all person. I was taught to work with different people and the responsibility of juggling a full class schedule of about 15 to 16 hours a semester on top of extra-curricular activities. I was honored to be selected as a student of the LC.C. Honors Program where I learned the values of teamwork, hard work, and studying. I will admit that some of the professors treat their classroom and students as if still at the high school level, but there are a handful of the strict, but knowledgeable professors that teach in what can be known as a four year university level class. LCC taught me well how to be a better student. I feel prepared to enter and succeed at a four year university level after all I've learned. Login to rate or flag the reviews Osvaldo from Laredo, TX 08/08/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 50",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}