{
    "relation": [
        [
            "Date",
            "18 Oct 2006",
            "8 Nov 2010",
            "1 Jul 2013",
            "6 Nov 2014"
        ],
        [
            "Code",
            "FPAY",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: CANTOR FITZGERALD, L.P., NEW YORK Effective date: 19990616 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CANTOR FITZGERALD SECURITIES;REEL/FRAME:030720/0794 Owner name: CFPH, LLC, NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:CANTOR FITZGERALD SECURITIES;REEL/FRAME:030720/0794 Effective date: 19990616 Effective date: 19970527 Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:FRASER, STUART A.;LUTNICK, HOWARD;PAUL, BIJOY;REEL/FRAME:030720/0632 Owner name: CANTOR FITZGERALD SECURITIES, NEW YORK",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6560580 - Automated auction protocol processor - Google Patents",
    "title": "",
    "url": "http://www.google.ca/patents/US6560580",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481758695,
    "recordOffset": 481716887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{155588=The Workdown State allows new Aggressors to complete the remaining un-hit bids on the passive side with logic conforming to the flowchart of FIG. 10. In this process, the Trading command, CMD(I), is entered at block 1210. At Test 1220, the system confirms that the trade is for less than the total passive side, TOTL. If not, logic branches to block 1280 and is directed to the Workup State., 45735=Open outcry auction techniques, modified over time, have also found successful application in many trading activities, including the buying and selling of farm produce and livestock, commodities contracts, futures contracts on a variety of items and—particularly germane to the preferred embodiment of the present invention—fixed income securities. These trading activities focus on the buying and selling of essentially fungible items, that is, items that are without meaningful differentiation from like items on the market. For example, a bushel of wheat for February delivery is considered for sale and delivery at a price independent of its source. Similarly, a 30-year U.S. Treasury bond paying a coupon rate of 8 percent and having a July 1996 issue date is indistinguishable from other 30-year treasuries having the same properties. Accordingly, the price buyers are willing to pay and sellers are willing to accept defines the market price of all 30-year treasury bonds of that same vintage, allowing a source transparent application of open outcry auction trading., 137709=The Second Look State is governed by logic depicted in FIG. 9. In this arrangement, the trading command is entered-time stamped at block 1020. The extant passive maker entries are also entered, block 1030 and Test 1040 determines if. the Passive Side entries, PASS(ID) are “aged”, i.e., not just recently entered. If yes, logic branches to Test 1090, to determine if PASS(ID) is the last entry, PASS-END. If not, the next one is incremented with logic returning to the sequence start., 138248=A negative response to Test 1040 shifts logic to block 1050 wherein the new entry is parsed; the Aggressor is then given the opportunity to take the new size within the trade at Test 1060. If accepted, logic branches to Block 1080 and to the Workup State. If negative, logic is shifted to the Workdown State, Block 1070., 42719=This is a division of application Ser. No. 08/766,733, filed Dec. 13, 1996, now U.S. Pat. No. 5,905,974., 156027=A positive response to Test 1220 passes logic to block 1230 wherein the system opens trading to new Aggressors, to complete the pending passive side volume. However, no new passive side entries are permitted, block 1240, for the trade duration. Test 1250 confirms the last trade via timer Test 1260; if either results in a “Yes”, Workdown is terminated and the process returns to the Bid/Offer State.}",
    "textBeforeTable": "Patent Citations Although the invention has been described in detail for the purpose of illustration, it is to be understood that such detail is solely for that purpose and that variations can be made therein by those skilled in the art without departing from the spirit and scope of the invention:except as it may be limited by the claims. During the Workup State, a trader can use the DONE function to remove him/herself from being a participant from the active side or the passive side, or both sides simultaneously, regardless of the size traded or solicited. Thus, the DONE function logically removes the trader from the trade. The UNDO function can also roll back the trade provided that the first active trader has executed this function with a predefined time period following the trade. If the UNDO function is not invoked during this predefined time period, or the trader is not the first active trader, then the trader is entered in the queue to buy or sell on the contra side immediately Preferably, the trader is placed at the top of the list so that the UNDO function can be effectively invoked immediately, provided there is a contra trader. Most preferably, the rights of the first active and passive traders will be maintained to assure fairness. During the Workdown State, CANCEL functions to remove any remaining passive maker's markets. DONE performs the same function as the CANCEL function",
    "textAfterTable": "18 Dec 1992 7 Sep 1993 Automated Market Systems, L.P. Keypad for computer system US5297031 6 Mar 1990 22 Mar 1994 Chicago Board Of Trade Method and apparatus for order management by market brokers US5297032 1 Feb 1991 22 Mar 1994 Merrill Lynch, Pierce, Fenner & Smith Incorporated Securities trading workstation US5305200 2 Nov 1990 19 Apr 1994 Foreign Exchange Transaction Services, Inc. Financial exchange system having automated recovery/rollback of unacknowledged orders US5375055 3 Feb 1992 20 Dec 1994 Foreign Exchange Transaction Services, Inc. Credit management for electronic brokerage system US5717989 13 Oct 1994 10 Feb 1998 Full Service Trade System Ltd. Full service trade system US5915209 3 Oct 1997 22 Jun 1999 Lawrence; David Bond trading system US6014627 18 Jun 1996 11 Jan 2000 Ebs Dealing Resources, Inc. Credit management for electronic brokerage system US6134535 3 Mar 1995 17 Oct 2000",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}