{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Iphone 3 4 4s Ipod Flat Color USB Charger Cable 1M 2M 3M Aussie Seller | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/iPhone-3-4-4S-iPod-Flat-color-Usb-Charger-Cable-1m-2m-3m-AUSSIE-SELLER-/161184992794?pt=AU_MobilePhoneAccessories&var=&hash=item25875fce1a",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00257-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410207079,
    "recordOffset": 410160876,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at We will not refund or exchange if you change your mind, but we will refund to you if products faulty (According to Australian Consumer Protection law). Refound: 1）If the item that you have purchased from our shop is faulty, you may post the item back within 14 days of the order date for a full refund of the purchase price, minus the shipping & handling fees. Any \"Free postage\" item returned will have the outbound freight charge deducted from the total return. 2) For any Refund, the product must be in its original condition, if it comes with package, must return it with package. Exchange 1) Buyer must contact us within 14 days of receiving the items if there is any quality problem, or you want to exchange it. 2) For any Exchange, Buyer is responsible for the shipment charges back and forth! 3) For any Exchange, the product must be in",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}