{
    "relation": [
        [
            "Mouse Events",
            "click",
            "dblclick",
            "mouseenter",
            "mouseleave"
        ],
        [
            "Keyboard Events",
            "keypress",
            "keydown",
            "keyup",
            ""
        ],
        [
            "Form Events",
            "submit",
            "change",
            "focus",
            "blur"
        ],
        [
            "Document/Window Events",
            "load",
            "resize",
            "scroll",
            "unload"
        ]
    ],
    "pageTitle": "Infragistics Community",
    "title": "",
    "url": "http://antiprohibitionist4.rssing.com/chan-3528907/all_p19.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 9268847,
    "recordOffset": 9165337,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{18250=Today, March 23, 2013 Microsoft with the support of Infragistics Inc organized the second in Bulgaria Hackathon for Windows 8 and Windows Phone 8. The event is held at the office of Infragistics Bulgaria. This hackathon confirms the very good partnership between Microsoft and Infragistics., 10936=We had an awesome time at the C# corner MVP Summit 2013, Noida. Every year C# corner MVPs, authors and the experts in this forum meet up and share their knowledge with others. We are glad that we are part of this event this year by being the platinum sponsors. And I had a fantastic time doing the demos for Jason’s session on HTML5 & jQuery. Jason explained about HTML5 – new HTML elements, CSS3 and JavaScript API followed by some amazing features of jQuery library, jQuery widgets, data access & styling. He also demoed the HTML5 video player which seamlessly plays in the browser without having to worry about the plugins., 17228=The event continues with the development of applications for Windows Store and Windows Phone that will be completed after the Hackathon and assessed in May 2013}",
    "TableContextTimeStampAfterTable": "{195198=When we are mobile, it is often the case that we work with only a subset of the SharePoint lists that are available to us.  Two methods may be employed to hide unused Lists and Subsites.  The first method requires administrative privileges and is described in the following article: http://www.infragistics.com/community/blogs/anand_raja/archive/2012/04/03/how-to-disable-the-viewing-of-specific-lists-in-shareplus.aspx . , 140788=Whether you build your iOS apps in Objective C with Xcode or AppCode, or using C# with Xamarin.iOS (aka MonoTouch), NucliOS has the native iOS controls every Apple developer needs. Coming this April in just a few short weeks, NucliOS 13.1 will bring you more controls, more features, more productivity., 43184=I know I covered a lot in this post, but believe it or not, I couldn’t even come close to covering everything feature we have.  You can expect to find these control publically available to you in mid April.  Probably around April 15th-ish.  If you can’t wait to get your hands on the NetAdvantage for Windows UI XAML or HTML controls outlined here, drop me an email me at blagunas@infragistics.com, tell me what control and/or feature you really want to work with now and I might give you early access.  If you ask nicely., 124972=Our WPF XamRibbon control received a highly request feature in 13.1 that the Silverlight brother has had for a while now. The XamRibbon now ships with the ever popular Microsoft Office Application Menu 2010, aka “Backstage”. If you have ever used any Microsoft Office product, then you already know what the backstage menu is. If not, let me explain it to you. The xamRibbon contains buttons, menu items, and other tools that allow you to perform actions on a view. While the backstage menu lets you have menu items and tools to do something to a view. The backstage can be used to display controls, and invoke actions on a view like save and print. The backstage can also provide a list of recent documents, access to application options, and actions to exit an application., 128217=One of the coolest features of our xamGantt control is the ability to load a Microsoft Project XML file directly into the xamGantt control. Now this feature becomes even more powerful with the added ability to save the xamGantt project data (i.e. the calendars, resources and tasks) to an xml file that follows the MS Project 2010 xml file format. This does not assume round tripping a Microsoft Project XML file. For example; if you used the LoadFromProjectXml method to load a Microsoft Project XML file into the xamGantt, made changes to the project, and then saved the project data using the new SaveAsProjectXml method, the original file would be overwritten and some information could potentially be lost/changed based on the things we support (e.g. we don't support task types, per task/resource calendars, wbs outline codes, empty rows, timephase data, etc.). If you are creating your data and saving your data from within the xamGantt control exclusively, then you have no worries about potentially losing data during the translation process., 294129=It’s March, which means another SXSW! This being my first SXSW I really did not know what to expect and I felt that being a rookie gave me some solid unbiased opinions about this world famous conference. The Good, 189812=Take our controls for a spin on your iPhone or iPad and try the NUCLiOS Samples Browser by downloading it from the Apple App Store here. This free browser app currently showcases our grid and charts initially released in October 2012. We’ll be publishing an updated version at release time in mid-April so you can play with all the new controls and features., 147237=NucliOS provides the core controls developers need to build high performance, highly interactive iPad & iPhone applications with stunning visuals. The initial NucliOS 2012 release included the two most requested types of controls regardless of developer platform:, 231152=I spent the last week of my Brent Goes South for the Winter Tour traveling around the state of Florida.  Armed with nothing but my laptop bag and a black 2013 Camaro it was my mission to spread the word of Windows 8 design to the user groups of three Florida areas: Tampa, Naples, and Miami.  Since I gave the same talk at each of these user groups I figured one post would suffice for wrapping up the tour., 144368=For over two decades, enterprise developers have turned to Infragistics controls for help in building the best in state of the art user interfaces for the Windows platforms and the Web. For the first time in its history, Infragistics introduced in 2012 a suite of native iOS controls named NucliOS, continuing our tradition of excellence and bringing over 20 years of UI controls design experience to Apple iOS developers., 295323=To scale model of the James Webb Space Telescope that is planned to launch in 2017.  , 234944=Picture this: a guy on a Mac presenting in a place called Planet Linux Caffe talking about Windows 8 design.  Bizarre right?  Well, that was exactly what went down for dotNet Miami’s March meeting.  Richie Rump runs a great group down in Miami and we had a lot of fun with this presentation.  I like the feel of having a user group meeting in a coffee shop.  I think more coffee shops should have setups for this kind of thing.  What was great about this particular venue is it was the perfect spot for a photo op for Brian Lagunas’ user group photo competition.  Armed with upside-down Linux magazines, this group tried to look excited (with mixed results)., 241985=The team mentor: Mihail Trifonov, 244888=The Imagine Cup 2013 Worldwide Finals will be held in St. Petersburg, Russia 8-11 July 2013., 80334=So hopefully you see the same awesomeness as I do in this release. I can’t wait for you to start using it and most of all giving us feedback. We are about 3 weeks away from the official marketing release of April 16th. If you can’t wait to get your hands on the controls, you can shoot me an email at jasonb@infragistics.comand let me what control and/or feature you really want to work with now and we’ll get you early access to the bits., 236565=Spending almost a week and a half away from the northeast in March by escaping to Florida is something I’d recommend to anyone.  But, while you’re there you should definitely check out the developer communities you will find there.  No matter where you are in the state there are developers just like you that would be dying to discuss the latest trends and tech over a beer or coffee. , 240975=Their mentor is Mihail Trifonov who also works for Infragistics, 141812=I get to see this shift in technical interest first hand at conferences. Last Fall I started doing a new conference talk titled “iOS Development Survival Guide for the .NET Guy (or Gal)” at HDC in Omaha. The talk was an immediate hit. .NET developers are hungry for iOS knowledge. It got scheduled again for Prairie DevCon in Regina, VSLive in Orlando, Dallas Day of .NET, and I’m doing it again this week at VSLive in Vegas, and in May at Prairie DevCon in Winnipeg and VSLive in Chicago. You can even catch the webinar version I recently recorded here., 7472=Your wait is over!  NetAdvantage for Windows UI is HERE!  Since the announcement of Windows 8 at the Microsoft //BUILD/ event in Anaheim, CA back in 2011, Infragistics has been watching the market trends, listening to customers, and working closely with Microsoft to create the best Windows 8 control toolset available.  No matter what your UI preference, we have leveraged our existing codebase to create a familiar and unified development experience for both XAML and HTML., 240183=Yesterday - 26 March 2013 was held the final of Bulgarian Microsoft Imagine Cup 2013., 290540=The app is available for download on the Windows Phone App store http://www.windowsphone.com/en-au/store/app/image-of-the-day/84848ebd-6ce3-4617-b89f-83ec4f093a54 There are more details about the winning app by Lars’ employer http://blog.kiandra.com.au/2013/03/image-of-the-day-wins-appfest/, 188097=So when can you get this awesome release? Soon! NucliOS 13.1 is scheduled to be release in mind-April in just a few weeks. If you can’t wait to get your hands on our new iOS controls detailed above, drop me an email me at activenick@infragistics.com, tell me what control and/or feature you really want to work with now and I just may give you early access., 84842=It was barely more than a year ago that I joined Infragistics as Senior Product Manager, and here I am, already writing about a third exciting release since I started working here. Signed, sealed & delivered. Well, almost delivered. The release is done and our official launch is in mid-April. I’m here today to tell you more about all the XAML goodness in this release. Our Engineering, Quality Engineering and product Guidance teams have been hard at work for the past 6 months, and this release doesn’t disappoint., 145512=The initial release of NucliOS was just a first step for Infragistics in a long journey within the Apple world. Infragistics is committed to the iOS platform, and Apple developers can expect new features and controls from us in 2013 and beyond. As iPhones and iPads keep evolving, users expect richer experiences. The iTunes App Store has more than 750,000 apps and the competition is fierce. Developers need to push the envelope. NucliOS helps developers create more advanced applications in less time, increasing their productivity and lowering their costs and time to market.}",
    "textBeforeTable": "Most modern web sites demand some form of user interaction.  When a user interacts with elements on the site, events are fired that can be handled using jQuery code.  Here are some common DOM events that can be handled: Event Handling See the following for more details: DOM traversal and DOM manipulation $('#placeholder').html('New value!') To replace the HTML code for this placeholder element, use the .html() function: $('#placeholder') jQuery makes it really easy to find elements within the Document Object Model (DOM) of your webpage.  Using CSS3-compatible selectors and some convenient functions on the jQuery object, it is possible to find and manipulate objects with ease.  For instance, to find the paragraph on the page with id ‘placeholder’ you would use the following jQuery code: HTML Document Traversal and Manipulation jQuery is small.  For all that it accomplishes, it is really small. It’s only 32kB when minified and gzipped.  This means it’s a really quick download on machines the first time it is encountered.  When using a CDN, your site’s users may not even need to download that small file! Lightweight That’s the “straight from the horse’s mouth” definition of what the project is and aims to accomplish.  There are several components",
    "textAfterTable": "Almost all of these events have corresponding jQuery functions that are available on any jQuery object.  For instance, to perform some action when our #placeholder element is clicked, you would use the following jQuery code: $('#placeholder').click(function() { // put code to perform on click here... }); See the following for more details: Events Animation jQuery makes animating elements on your website easy.  There are many built-in effects that handle common animations like show(), hide(), fadeIn(), fadeOut(), etc.  To hide our #placeholder element we could use the following code: $('#placeholder').hide() If we wanted to control the speed with which the element hides we can pass in a string-valued argument of either ‘slow’, ‘medium’, or ‘fast’ like this: $('#placeholder').hide('slow') If you want precise control over how long the effect takes to complete, you can pass in a duration in milliseconds like this: $('#placeholder').hide(1000) To run some code after an animation completes you can pass in a callback like this: $('#placeholder').fadeIn(500, function () { // callback code goes here... }); See the following for more details: Effects Cross-browser Support One of the major goals of jQuery is to allow developers to not have to worry about the differences between the various web browsers.  It seems like every browser has their own unique way of dealing with the DOM whether it’s events, animations, or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}