{
    "relation": [
        [
            "Product Description:",
            "VEGASSI CONSENSUS 1 Day Membership(All Sports)",
            "VEGASSI CONSENSUS 7 Day Membership(All Sports)",
            "VEGASSI CONSENSUS 30 Day Membership(All Sports)",
            "VEGASSI CONSENSUS 90 Day Membership(All Sports)",
            "VEGASSI CONSENSUS Thru 2016 COLLEGE FOOTBALL PLAYOFF Membership(All Sports)",
            "VEGASSI CONSENSUS Thru 2016 SUPER BOWL on Feb 7, 2016 Membership(All Sports)",
            "VEGASSI CONSENSUS 365 Day Membership(All Sports)"
        ],
        [
            "Price",
            "$49.95",
            "$124.95",
            "$299.95",
            "$599.95",
            "$899.95",
            "$999.95",
            "$1499.95"
        ],
        [
            "Paypal",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Credit Card",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "College Football Picks, NFL Picks, Football Picks, Free Football Picks",
    "title": "",
    "url": "http://vegassi.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 253759027,
    "recordOffset": 253733313,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Select a product and click on a payment button to order. Your transaction will be securely processed by one of our state-of-the-art payment processors, Paypal or Authorize.net. After successful payment, you will instantly receive your own username and password to securely access your picks. SIGN UP INSTRUCTIONS: NATION'S #1 CONSENSUS REPORT, SYNDICATE PLAYS AND USA'S Top 10 HANDICAPPERS PROVIDING WINNERS DAILY! UPDATE FOR THURSDAY, JULY 30, 2015: MLB BASEBALL HIGH ROLLER PLAYS - GUARANTEED WINNERS - The VegasSI.com CONSENSUS REPORT is ranked #1 in the nation and we have the nation's top NFL FOOTBALL, COLLEGE FOOTBALL, MLB BASEBALL, COLLEGE BASKETBALL, and NBA BASKETBALL PICKS from USA's Top 10 Handicappers 365 Days a YEAR! If you haven't heard, 20* picks on the Full Consensus Report have WON 73.6% over the last 5 years and are in the midst of another DOMINATING start this year! Our 20* CONSENSUS PLAY and 20* HIGH ROLLERS CLUB(only available on the Full Consensus Report) are RED HOT and will WIN BIG again today so don't miss daily 20* NFL Picks, College Football Predictions, NBA Picks, College Basketball Picks, MLB Baseball Picks, and True WISEGUY Moves from USA's Top 10 Handicappers this year by bookmarking our site now. We have a SENSATIONAL Full Consensus Report on tap daily throughout the year that is loaded with the day's top NFL,",
    "textAfterTable": "VegasSI Consensus Profile: View  Today's Plays: View WE ACCEPT: Mastercard/Visa/Discover/Amex/EuroCard/Bravo/Novus/PayPal Need Assistance? If you have any questions or need any type of assistance, please feel free to email us at service@vegassi.com or call our offices toll-free 1-877-876-8769 to speak with one of our customer service representatives. VEGASSI.COM'S EXCLUSIVE \"HIGH ROLLERS CLUB\" PLAYS! THE BEST \"HIGH ROLLER\" PLAYS FROM OUR TOP INSIDER SOURCES(SHARPS, ODDSMAKERS, SYNDICATES, NATIONWIDE INSIDERS) IN LAS VEGAS! THURSDAY, JULY 30, 2015: HUGE MLB BASEBALL 20* \"HIGH ROLLER INSIDER LOCK, SHARP AND SYNDICATE PLAYS\" ON TODAY'S VEGAS HIGH ROLLERS CLUB SYNDICATE ACTION!! Our exclusive VEGASSI.COM HIGH ROLLERS CLUB is ready to CRUSH Bookies COAST to COAST with WINNERS on today's betting action!! The HIGH ROLLERS CLUB has WON 83% of it's 20* picks combined the last 5 years and will crush vegas sportsbooks hard again today with their 20* MLB BASEBALL HIGH ROLLERS CLUB GUARANTEED WINNERS on \"LATE BREAKING INFORMATION, VEGAS SHARP AND SYNDICATE PLAYS\" on today's games plus the 10* Total WINNERS if you are looking to PARLAY!! Today's 20* GUARANTEED WINNERS are backed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}