{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft"
        ],
        [
            "Preferred/Accepted",
            "PayPal preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "POULTON-LE-FYLDE = c.1910 Street scene, Shops, Children, etc. MINT, UNUSED | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/POULTON-LE-FYLDE-c-1910-Street-scene-Shops-Children-etc-MINT-UNUSED-/231099081465?pt=UK_Collectables_Postcards_MJ&hash=item35ce9422f9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00010-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 427312763,
    "recordOffset": 427257551,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details receiving cleared payment - opens in a new window or tab. Will usually dispatch within 3 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 3 days after receiving cleared payment - opens in a new window or tab. Tue. 11 Aug. and Tue. 18 Aug. Estimated between Royal Mail International Tracked United States",
    "textAfterTable": "Seller's payment instructions All Invoices MUST be settled WITHIN 7 DAYS (1 WEEK) unless previously agreed BEFORE bidding between the Seller and the Buyer. Failure to pay wiyhin this time scale will result in a NON-PAYING BIDDER WARNING being issued by eBay and you will be BLOCKED from any further participation in our auctions. We offer a fully COMBINED SHIPPING service which is clearly detailed on our eBay \"ME\" Page. PLEASE NOTE: We will now only accept PAYPAL payments due to NON-PAYERS by other means. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}