{
    "relation": [
        [
            "",
            "Australian Taxation Office",
            "Related expense ($m)",
            "Department of the Treasury"
        ],
        [
            "2007‑08",
            "*",
            "",
            "*"
        ],
        [
            "2008‑09",
            "*",
            "",
            "*"
        ],
        [
            "2009‑10",
            "*",
            "",
            "*"
        ],
        [
            "2010‑11",
            "*",
            "",
            "*"
        ],
        [
            "2011‑12",
            "*",
            "",
            "*"
        ]
    ],
    "pageTitle": "Budget Measures 2008-09 - Budget Paper No. 2 - Part 1: Revenue Measures - Treasury",
    "title": "Revenue ($m)",
    "url": "http://www.budget.gov.au/2008-09/content/bp2/html/revenue-07.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 347590839,
    "recordOffset": 347567918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12071=The Government will deliver in full the tax cuts it announced during the 2007 election campaign. These tax cuts included deferring the previously budgeted reductions in the top marginal tax rate for taxpayers on incomes of more than $180,000 per annum until beyond 2010‑11. The savings of $5.3 billion over the forward estimates period will be diverted to the Government's other spending priorities including the Education Tax Refund, reducing elective surgery waiting lists and to the budget surplus., 26147=The Government will provide relief from capital gains tax (CGT) to policy holders of health insurers who receive shares when their insurer demutualises, with effect from 1 July 2007. This measure has an ongoing gain to revenue for which a provision of $4.0 million has already been included in the forward estimates., 58227=The existing FBT exemption allows employees with a meal card arrangement to purchase meals out of their pre‑tax income. The change will ensure equity with other employees who have to purchase meals out of their after‑tax income. Existing balances on meal cards as at 7.30 pm (AEST) on 13 May 2008 will remain eligible for the FBT exemption, provided they are used by 31 March 2009. Any supplementation of existing balances after 7.30 pm (AEST) on 13 May 2008 will be subject to FBT., 95657=The Government will provide a tax exemption for rent assistance paid to Austudy recipients, with effect from 1 July 2007. This measure has no revenue impact., 46516=The Government will introduce an income test for the entrepreneurs' tax offset (ETO), with effect from 1 July 2008. The measure reduces the existing concession and tax expenditure through better targeting. This measure has an ongoing gain to revenue which is estimated to be $90.0 million over the forward estimates period., 73675=The Government signed a tax treaty to update taxation arrangements with Japan on 31 January 2008. The convention will enter into force 30 days after both countries advise that they have completed their domestic requirements. This has an ongoing cost to revenue which is estimated to be $345.0 million over the forward estimates period., 105597=The Government will introduce an income threshold of $150,000 for the claimant to determine eligibility for the Dependent Spouse, Housekeeper, Child Housekeeper, Invalid Relative and Parent/Parent‑in‑law tax offsets, with effect from 1 July 2008. This measure has an ongoing gain to revenue which is estimated to be $125.0 million over the forward estimates period., 55601=Employees who have already entered into salary sacrifice agreements with their employer will be able to utilise existing arrangements until 31 March 2009 (that is, the end of the current FBT year). This will provide time for employers and employees to renegotiate salary packages to avoid incurring a FBT liability., 106078=From 1 July 2009, the Government will align the definition of income for these offsets with that applying to family assistance payments. In addition, the income threshold of $150,000 will be indexed from 1 July 2009., 115226=Provision for the cost of allowing access to tax free lump sums for persons with a terminal medical condition is already included in the forward estimates on the basis of the original commencement date of 12 September 2007., 4781=The Government will change the definition of family in the family trust election rules to limit lineal descendants to children or grandchildren of the test individual or of the test individual's spouse. This will have effect from 1 July 2008., 101268=The thresholds, above which MLS is payable if a taxpayer does not have adequate private health insurance, have not been changed since the MLS was introduced on 1 July 1997. This measure will refocus the MLS on those with higher incomes., 20297=The Government will remove the tax deductibility of contributions and gifts made by individuals and businesses to political parties, members and candidates, with effect from 1 July 2008. This measure has an ongoing gain to revenue which is estimated to be $31.4 million over the forward estimates period., 118349=The Government will provide an income tax exemption for the Carer Adjustment Payment (CAP), with effect from 1 July 2007. The CAP provides financial assistance to families who have a child, aged up to six years, who has suffered a catastrophic event at some point after 1 January 2007. This measure has no revenue impact., 107816=The Government has approved 17 funds for prescription as prescribed private funds (PPFs). This has an ongoing estimated cost to revenue of $36.8 million over the forward estimates period. Five PPFs were approved prior to the 2007 Pre‑Election Economic and Fiscal Outlook, for which a provision of $3.4 million has already been included in the forward estimates., 120020=The Government will extend the debt/equity transitional arrangements to 1 July 2008 to ensure that the income tax law preceding the debt/equity tax rules continues to apply to Upper Tier 2 instruments. This measure has an ongoing unquantifiable revenue impact., 40387=The Government will increase the period over which capital expenditure on in‑house computer software is depreciated from 2.5 years to 4 years. This will apply to expenditure incurred on or after 7.30 pm (AEST) on 13 May 2008. The measure reduces a tax concession and tax expenditure. This measure has an ongoing gain to revenue which is estimated to be $1.3 billion over the forward estimates period., 115462=Further information can be found in the press release of 13 February 2008 issued by the Minister for Superannuation and Corporate Law., 37250=Under the new arrangements, condensate production from petroleum fields located in the North West Shelf project area and onshore Australia will be subject to the same excise rates as those applicable to petroleum fields discovered after 18 September 1975. For example, the maximum rate of excise applicable to production from a field in excess of 800 megalitres (around 5 million barrels) per annum will be 30 per cent of the value of production., 88222=The Government will expand the definitions of income used to determine eligibility for particular government support programs to include net financial investment losses, and net rental property losses where appropriate, with effect from 1 July 2009. This measure has an ongoing gain to revenue which is estimated to be $38.0 million over the forward estimates period. The measure is also expected to increase Government expenditure by $10.8 million over this period., 57588=The Government will tighten the fringe benefits tax (FBT) exemption that applies to the private use of business property on an employer's premises by excluding meals under a salary sacrifice arrangement, with effect from 7.30 pm (AEST) on 13 May 2008. The measure reduces the FBT concession and tax expenditure associated with property provided on the employer's business premises. This measure will have an ongoing gain to revenue which is estimated to be $730.0 million over the forward estimates period. This measure is also expected to increase GST payments to the States by $120.0 million over this period., 76129=Further information can be found in the press release of 1 April 2008 issued by the Assistant Treasurer and Minister for Competition Policy and Consumer Affairs., 16044=From 1 July 2008 the 30 per cent threshold will increase from $30,001 to $34,001, the 40 per cent threshold will increase from $75,001 to $80,001 and the 45 per cent threshold will increase from $150,001 to $180,001. In addition, from 1 July 2009 the 30 per cent threshold will increase to $35,001 and the 40 per cent marginal tax rate will be reduced to 38 per cent. From 1 July 2010, the 30 per cent threshold will increase to $37,001 and the 38 per cent marginal tax rate will be reduced to 37 per cent., 62492=The Government will amend the measure, previously announced in the 2007‑08 Budget, that ensures certain telecommunications services would remain GST free, with effect from 1 July 2000, to apply only to mobile telephone global roaming services. This measure has no revenue impact as it is consistent with existing practice., 53266=The Government will also deny employees depreciation deductions for FBT exempt items (that is, items purchased primarily for work purposes) purchased from 7.30 pm (AEST) on 13 May 2008. For items purchased before that time, employees will be denied depreciation deductions for the 2008‑09 and later income years. This measure will ensure that employees are no longer able to gain a double benefit by obtaining an FBT exempt item (such as a laptop computer) from their pre‑tax income, and then claim a deduction for depreciation., 36782=The Government will remove the current exemption of condensate from crude oil excise, with effect from midnight (AEST) on 13 May 2008. This measure has an ongoing gain to revenue, which is estimated to be $2.5 billion from Budget night and over the forward estimates period. This measure is also estimated to increase net Government expenditure by $69.6 million over the same period. The measure abolishes a tax concession and a tax expenditure., 82005=The Government will expand the definition of income that is used to determine eligibility for government support programs, to include certain 'salary sacrificed' contributions to superannuation, with effect from 1 July 2009. This measure has an ongoing gain to revenue which is estimated to be $47.0 million over the forward estimates period. The measure is also expected to decrease Government expenditure by $430.2 million over this period., 98133=The Government will also increase the Medicare levy threshold for pensioners below Age Pension age to $22,922, with effect from 1 July 2007. This increase will ensure that pensioners below Age Pension age do not pay the Medicare levy when they do not have an income tax liability., 114907=The Government will back‑date the commencement of the previously announced measure to make superannuation lump sum benefits tax free for people with a terminal medical condition to 1 July 2007. Back‑dating this measure has an estimated cost to revenue of $5.0 million in 2007‑08., 95828=Rent assistance has been payable to Austudy recipients from 1 January 2008. This measure will ensure that Austudy recipients will not be required to pay tax on rent assistance amounts. Providing an income tax exemption for rent assistance paid to Austudy recipients is consistent with the tax treatment of rent assistance paid to Youth Allowance, Newstart Allowance and ABSTUDY recipients., 62844=The measure will ensure that Australia's GST treatment of these global roaming supplies remains consistent with Australia's obligations under the International Telecommunications Regulations (the Melbourne Agreement). Consistent with these obligations, supplies of mobile global roaming services provided to visitors to Australia remain not subject to GST, with effect from 1 July 2000., 49629=The Government has increased the excise and excise‑equivalent customs duty on 'other excisable beverages not exceeding 10 per cent alcohol by volume' to the same rate as for full strength spirits, on and from 27 April 2008. This measure has an ongoing gain to revenue which is estimated to be $3.1 billion from 27 April 2008 and over the forward estimates period. This will help fund increased investment in preventative health. The measure is expected to increase GST payments to the States by $281.5 million over this period., 52212=The Government will tighten the current fringe benefit tax (FBT) exemption for certain work‑related items (including laptop computers, personal digital assistants and tools of trade) by ensuring the exemption only applies where these items are used primarily for work purposes. The FBT exemption will generally be limited to one item of each type per employee per year. The measure will apply to items purchased after 7.30 pm (AEST) on 13 May 2008. The measure reduces the FBT concession and tax expenditure for work‑related items. This measure will have an ongoing gain to revenue which is estimated to be $650.0 million over the forward estimates period. This measure is also expected to increase GST payments to the States by $120.0 million over this period., 71799=The Government will amend the law to ensure that the GST refund provisions apply even if the transaction for which the tax was paid is found not to be a supply. This will have effect from 1 July 2008. The Government will also restore the intended four year time limit on refunds and liabilities for indirect taxes, with effect from 1 July 2008. This measure has an ongoing unquantifiable revenue impact., 54936=The Government will amend the fringe benefits tax (FBT) law to ensure that the full value of a benefit that has been provided to both an employee and an associate in relation to a jointly held asset will be subject to FBT. This tax integrity measure will have effect for new arrangements from 7.30 pm (AEST) on 13 May 2008. This measure will have an ongoing gain to revenue which is estimated to be $49.0 million over the forward estimates period., 44648=The Government will remove double taxation that arises in relation to certain employee share schemes (ESS) that use employee share trusts. The changes will apply in relation to capital gains tax (CGT) events occurring from 7.30 pm (AEST) on 13 May 2008. This measure has no estimated revenue impact., 69863=The Government will increase the luxury car tax rate from 25 per cent to 33 per cent, with effect from 1 July 2008. There will be no change to the luxury car tax threshold (currently $57,123) from which the luxury car tax applies. This measure has an ongoing gain to revenue which is estimated to be $555 million over the forward estimates period., 32461=The Government will adjust the benchmark interest rate that applies to capital protected borrowing arrangements to increase the capital component of the overall expense, for arrangements entered into from 7.30 pm (AEST) on 13 May 2008. The measure abolishes a tax concession and a tax expenditure. This measure has an ongoing gain to revenue estimated to be $70.0 million over the forward estimates period., 42433=The Government will improve the integrity of employee share schemes to ensure that income from these schemes is correctly reported by taxpayers. The measure will take effect with respect to shares and rights acquired from 1 July 2008. This measure has an ongoing gain to revenue estimated to be $77.0 million over the forward estimates period., 91477=The Government will expand the definitions of income used to determine eligibility for certain tax offsets to include reportable fringe benefits, with effect from 1 July 2009. This measure has an ongoing gain to revenue which is estimated to be $18.5 million over the forward estimates period., 74283=Further information can be found in the press release of 1 February 2008 issued by the Assistant Treasurer and Minister for Competition Policy and Consumer Affairs., 16619=From 1 July 2008, the low income tax offset will increase from $750 to $1,200. From 1 July 2009 it will increase further to $1,350 and from 1 July 2010 to $1,500. The offset will continue to be withdrawn once income exceeds $30,000. Those eligible for the full low income tax offset will have an effective tax free threshold of $14,000 in 2008‑09, $15,000 in 2009‑10 and $16,000 in 2010‑11. New withholding schedules will be created so that low and average income earners will receive half of the benefits of the low income tax offset through their regular pay, rather than all of the offset as a lump sum when their income tax returns are assessed., 121574=The amendments will also address further interactions with other parts of the tax law, remove an elective start date of 1 July 2008 and deal with various technical issues., 121296=The Government will amend and reintroduce the Taxation of Financial Arrangements Stages 3 and 4 measures, with effect from 1 July 2009. The measures lapsed when Parliament was prorogued in October 2007. The amendments have an ongoing unquantifiable revenue impact., 116971=The payment of temporary residents' superannuation to the Australian Government was announced in the Mid‑Year Economic and Fiscal Outlook 2007‑08 with a start date of 1 July 2008. The deferral will allow consultation on administrative and legislative design features of this policy., 109471=The Government will legislate guidelines to improve the integrity of prescribed private funds (PPFs), with effect from 1 July 2009. This integrity measure has no impact on revenue as the measure will initially have greatest impact on new PPFs which are not currently included in the forward estimates until prescription (see, for instance, the measure Philanthropy — additional prescribed private funds). The estimated potential savings are expected to be $20 million in 2010‑11 and $40 million in 2011‑12., 102860=The Government will provide an income tax exemption of up to $1,000 to apprentices who receive early completion bonuses in skill shortage occupations from the Queensland Government. The measure will have effect from 1 July 2008. This measure has an ongoing cost to revenue for which a provision of $3.8 million has already been included in the forward estimates., 75486=The Government signed a protocol to revise the tax treaty with the Republic of South Africa on 31 March 2008. The convention will enter into force 30 days after both countries advise that they have completed their domestic requirements. This has a negligible ongoing revenue impact., 30454=The Government will modify the scrip for scrip capital gains tax roll‑over provisions to ensure that, for corporate restructures, the acquiring entity's cost base of shares in the target entity reflects the tax costs of the target entity's net assets, with effect from 7.30 pm (AEST) on 13 May 2008. This cost base will also be used in determining the value of the target entity's assets in consolidation if the target entity subsequently joins the acquiring entity's consolidated group. This measure has an ongoing unquantifiable revenue impact., 27279=Further information can be found in the press release of 26 February 2008 issued by the Assistant Treasurer and Minister for Competition Policy and Consumer Affairs., 94156=The Government has deferred until 1 July 2009 the measure to align the pay as you go (PAYG) instalments and GST payment and reporting requirements for taxpayers who are voluntarily registered for GST. This measure has a gain to revenue which is estimated to be $20.0 million over the forward estimates period., 111960=Prior to the 2007 Pre‑Election Economic and Fiscal Outlook (PEFO), qualifying gifts of $2 or more to the following organisations were made tax deductible. Approving these organisations reduces revenue by $3.3 million over the forward estimates period, a provision for which was included at PEFO., 100602=The Government will increase the Medicare levy surcharge (MLS) thresholds for singles from $50,000 to $100,000 and for those who are members of a family from $100,000 to $150,000, with effect from 1 July 2008. This measure has an ongoing cost to revenue which is estimated to be $660.0 million over the forward estimates period. In addition, there will be a reduction in Government expenditure on the private health insurance rebate of $959.7 million over this period., 17345=The amount of income a senior Australian eligible for the senior Australians tax offset can earn before they incur an income tax liability will increase to $28,867 for singles and $24,680 for each member of a couple from 1 July 2008. These income levels will increase to $29,867 for singles and $25,680 for each member of a couple from 1 July 2009 and to $30,685 for singles and $26,680 for each member of a couple from 1 July 2010. The relevant Medicare levy low‑income threshold will be increased to ensure that senior Australians do not pay the Medicare levy until they begin to pay income tax., 97500=The Government will increase the Medicare levy low‑income thresholds to $17,309 for individuals and $29,207 for individuals who are in families, with effect from 1 July 2007. This measure has an ongoing cost to revenue which is estimated to be $170.0 million over the forward estimates period.}",
    "lastModified": "Fri, 12 Jun 2009 07:19:49 GMT",
    "textBeforeTable": "Family trusts — savings measure Election Commitments Treasury Part 1: Revenue Measures > Treasury Budget Paper No. 2 > Home > Past Budgets Ministerial Statements Portfolio Supplementary Additional Estimates Statements Portfolio Additional Estimates Statements Portfolio Supplementary Estimates Statements Portfolio Budget Statements Final Budget Outcome Updated Economic and Fiscal Outlook Mid-Year Economic and Fiscal Outlook Appropriation Bills Budget Paper No.4 Budget Paper No.3 Budget Paper No.2 Budget Paper No.1 Budget Overview Budget at a Glance Budget Speech Help Budget FAQ Purchase Home",
    "textAfterTable": "2007‑08 2008‑09 2009‑10 2010‑11 2011‑12 Australian Taxation Office - 105.0 295.0 785.0 795.0 Related expense ($m) Australian Taxation Office - 39.0 63.6 76.7 77.6 The Government will provide additional funding of $256.9 million over four years from 2008‑09 to the Australian Taxation Office (ATO) to allow it to enhance compliance activities, particularly for large businesses and high wealth individuals. This additional investment in ATO activities is expected to increase revenue by $1,980 million over four years. The increased resources will help ensure greater equity and confidence in the taxation system and provide for increased and better targeted enforcement activity. This measure delivers on the Government's election commitment. International tax — a final withholding tax on certain distributions of Australian managed investment trusts to foreign residents Revenue ($m) 2007‑08 2008‑09 2009‑10 2010‑11 2011‑12 Australian Taxation Office - -60.0 -125.0 -210.0 -235.0 The Government will replace the existing 30 per cent non‑final withholding",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}