{
    "relation": [
        [
            "Feature key",
            "Describes a short (usually not more than 20 amino acids) conserved sequence motif of biological significance.More...Motifi",
            "Describes a short (usually not more than 20 amino acids) conserved sequence motif of biological significance.More...Motifi",
            "Describes a short (usually not more than 20 amino acids) conserved sequence motif of biological significance.More...Motifi"
        ],
        [
            "Position(s)",
            "240 – 244",
            "297 – 305",
            "340 – 349"
        ],
        [
            "Length",
            "5",
            "9",
            "10"
        ],
        [
            "Description",
            "WSXWS motif",
            "Box 1 motif",
            "UbE motif"
        ],
        [
            "Graphical view",
            "",
            "",
            ""
        ],
        [
            "Feature identifier",
            "",
            "",
            ""
        ],
        [
            "Actions",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "GHR - Growth hormone receptor precursor - Homo sapiens (Human)",
    "title": "",
    "url": "http://www.uniprot.org/uniprot/P10912",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 804452687,
    "recordOffset": 804383121,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 22 Jul 2015 00:00:00 GMT",
    "textBeforeTable": "Motif Required for ADAM17-mediated proteolysisBy similarity 3 260 – 262 <p>Describes a region of interest that cannot be described in other subsections.</p><p><a href='../manual/region' target='_top'>More...</a></p>Regioni Actions Feature identifier Graphical view Description Length Position(s) Feature key Region Add BLAST PROSITE-ProRule:PRU00316 <p>Manual validated information which has been generated by the UniProtKB automatic annotation system.</p> <p><a href=\"/manual/evidences#ECO:0000255\">More…</a></p> Manual assertion according to rulesi Fibronectin type-IIIPROSITE-ProRule annotation 104 151 – 254 <p>Describes the position and type of a domain, which is defined as a specific combination of secondary structures organized into a characteristic three-dimensional structure or fold.</p><p><a href='../manual/domain' target='_top'>More...</a></p>Domaini Actions Feature identifier Graphical view Description Length Position(s) Feature key",
    "textAfterTable": "<p>Provides general information on the biological role of a domain. The term ‘domain’ is intended here in its wide acceptation, it may be a structural domain, a transmembrane region or a functional domain. Several domains are described in this subsection.</p><p><a href='../manual/domain_cc' target='_top'>More...</a></p>Domaini The WSXWS motif appears to be necessary for proper protein folding and thereby efficient intracellular transport and cell-surface receptor binding. The box 1 motif is required for JAK interaction and/or activation. The extracellular domain is the ligand-binding domain representing the growth hormone-binding protein (GHBP). The ubiquitination-dependent endocytosis motif (UbE) is required for recruitment of the ubiquitin conjugation system on to the receptor and for its internalization. <p>Provides information about the sequence similarity with other proteins.</p><p><a href='../manual/sequence_similarities' target='_top'>More...</a></p>Sequence similaritiesi Belongs to the type I cytokine receptor family. Type 1 subfamily. Curated Contains 1 fibronectin type-III domain. PROSITE-ProRule annotation <p>Manual validated information which has been generated by the UniProtKB automatic annotation system.</p> <p><a href=\"/manual/evidences#ECO:0000255\">More…</a></p> Manual assertion according to rulesi PROSITE-ProRule:PRU00316 <p>UniProtKB Keywords constitute a <a target=\"_top\" href=\"/keywords\">controlled vocabulary</a> with a hierarchical structure. Keywords summarise",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}