{
    "relation": [
        [
            "Published Date",
            "Jun 28, 2013",
            "Apr 25, 2013",
            "Sep 17, 2012",
            "Feb 1, 2012"
        ],
        [
            "Version",
            "6 (current)",
            "5",
            "4",
            "2"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - NAPROXEN - naproxen tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=2e84d479-5536-471f-93ef-34c353aff071",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 58611891,
    "recordOffset": 58572320,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{25678=250 mg: white to off-white, round shaped tablet with “138” debossed on one side and scored on the other side. Packaged in light-resistant bottles of  100 & 500 100's (bottle): NDC 52605-138-01, 2741=NDC-52605-139-01 , 26769=Because the sodium salt of naproxen is more rapidly absorbed, naproxen sodium is recommended for the management of acute painful conditions when prompt onset of pain relief is desired. Naproxen may also be used. The recommended starting dose of naproxen is 500 mg, followed by 500 mg every 12 hours or 250 mg every 6 to 8 hours as required. The initial total daily dose should not exceed 1250 mg of naproxen. Thereafter, the total daily dose should not exceed 1000 mg of naproxen., 25135=100's (bottle) : NDC 52605-139-01, 766=NDC-52605-140-10 , 27846=In patients who tolerate lower doses well, the dose may be increased to naproxen 1500 mg/day for limited periods of up to 6 months when a higher level of anti-inflammatory/analgesic activity is required. When treating such patients with naproxen 1500 mg/day, the physician should observe sufficient increased clinical benefits to offset the potential increased risk. The morning and evening doses do not have to be equal in size and administration of the drug more frequently than twice daily does not generally make a difference in response (see CLINICAL PHARMACOLOGY)., 19652=In 51Cr blood loss and gastroscopy studies with normal volunteers, daily administration of 1000 mg of naproxen has been demonstrated to cause statistically significantly less gastric bleeding and erosion than 3250 mg of aspirin., 3477=NDC-52605-139-05, 5369=Edgewood, NY 11717, USA, 25030=500 mg: white to off-white, capsule-shaped tablets with “140” debossed on one side and scored on the other side. Packaged in light-resistant bottles of  100, 500 & 1000, 25082=500's (bottle): NDC 52605-139-05, 24240=Edgewood, NY 11717, USA, 11687=Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088., 25424=500's (bottle): NDC 52605-138-05, 1937=NDC-52605-140-05, 526=1000 Tablets, 78034=Naproxen has a volume of distribution of 0.16 L/kg. At therapeutic levels naproxen is greater than 99% albumin-bound. At doses of naproxen greater than 500 mg/day there is less than proportional increase in plasma levels due to an increase in clearance caused by saturation of plasma protein binding at higher doses (average trough Css 36.5, 49.2 and 56.4 mg/L with 500, 1000 and 1500 mg daily doses of naproxen, respectively). The naproxen anion has been found in the milk of lactating women at a concentration equivalent to approximately 1% of maximum naproxen concentration in plasma (see PRECAUTIONS: Nursing Mothers)., 24805=100's (bottle): NDC 52605-140-01, 32549=Significant naproxen overdosage may be characterized by lethargy, dizziness, drowsiness, epigastric pain, abdominal discomfort, heartburn, indigestion, nausea, transient alterations in liver function, hypoprothrombinemia, renal dysfunction, metabolicacidosis, apnea, disorientation or vomiting. Gastrointestinal bleeding can occur. Hypertension, acute renal failure, respiratorydepression, and coma may occur, but are rare. Anaphylactoid reactions have been reported with therapeutic ingestion of NSAIDs, and may occur following an overdose. Because naproxen sodium may be rapidly absorbed, high and early blood levels should be anticipated. A few patients have experienced convulsions, but it is not clear whether or not these were drug-related. It is not known what dose of the drug would be life threatening. The oral LD50 of the drug is 543 mg/kg in rats, 1234 mg/kg in mice, 4110 mg/kg in hamsters, and greater than 1000 mg/kg in dogs., 22554=In a clinical trial comparing standard formulations of naproxen 375 mg bid (750 mg a day) vs 750 mg bid (1500 mg/day), 9 patients in the 750 mg group terminated prematurely because of adverse events. Nineteen patients in the 1500 mg group terminated prematurely because of adverse events. Most of these adverse events were gastrointestinal events., 4795=NDC-52605-138-05, 1385=NDC-52605-140-01 , 5987=These are not all the side effects with NSAID medicines. Talk to your healthcare provider or pharmacist for more information about NSAID medicines. Call your doctor for medical advice about side effects. You may report side effects to PolyGen Pharmaceuticals LLC at 1-888-291-7337 and/ or to FDA at 1-800-FDA-1088, 24701=1000's (bottle):NDC 52605-140-10, 39326=A clinical study found gastrointestinal reactions to be more frequent and more severe in rheumatoid arthritis patients taking daily doses of 1500 mg naproxen compared to those taking 750 mg naproxen (see CLINICAL PHARMACOLOGY)., 4244=NDC-52605-138-01 , 24753=500's (bottle): NDC 52605-140-05}",
    "textBeforeTable": "Number of versions: 4 NAPROXEN - naproxen tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(52605-138, 52605-139, 52605-140) 925822975 Marksans Pharma Limited Business Operations ID/FEI Address Name Establishment Labeler - Polygen Pharmaceuticals LLC (962415720) 02/01/2012 ANDA091416 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category",
    "textAfterTable": "RxNorm NAPROXEN - naproxen tablet RxCUI RxNorm NAME RxTTY 1 198012 naproxen 375 MG Oral Tablet PSN 2 198012 Naproxen 375 MG Oral Tablet SCD 3 198013 naproxen 250 MG Oral Tablet PSN 4 198013 Naproxen 250 MG Oral Tablet SCD 5 198014 naproxen 500 MG Oral Tablet PSN 6 198014 Naproxen 500 MG Oral Tablet SCD Get Label RSS Feed for this Drug NAPROXEN - naproxen tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=2e84d479-5536-471f-93ef-34c353aff071 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}