{
    "relation": [
        [
            "Date",
            "October 12*",
            "October 19*",
            "October 28*",
            "November 2",
            "November 18",
            "November 19",
            "November 28*"
        ],
        [
            "Opponent",
            "Doane",
            "at Parsons",
            "Iowa State",
            "at Kansas",
            "at Missouri",
            "vs. Nebraska",
            "at Penn (IA)"
        ],
        [
            "Site",
            "Iowa Field • Iowa City, IA",
            "Fairfield, IA",
            "Iowa Field • Iowa City, IA",
            "McCook Field • Lawrence, KS",
            "Rollins Field • Columbia, MO",
            "Omaha, NE",
            "Oskaloosa, IA"
        ],
        [
            "Result",
            "L 0-10",
            "W 28-0",
            "L 0-24",
            "L 0-52",
            "L 0-34",
            "L 0-6",
            "W 14-12"
        ]
    ],
    "pageTitle": "Iowa Hawkeyes football, 1889–97 - American Football Database",
    "title": "",
    "url": "http://americanfootballdatabase.wikia.com/wiki/Iowa_Hawkeyes_football,_1889%E2%80%9397",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 7275119,
    "recordOffset": 7243049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1954=The following year, Iowa hired Alfred E. Bull of Penn as the next coach of the Hawkeyes.[8] Under the leadership of one of the greatest centers to date,[8] the Hawkeyes finished with a 7-1-1 record and won the conference championship in the Western Interstate University Football Association.[8][10] Controversy, however, sparked in Iowa's game against the Missouri Tigers. Missouri alumni demanded that the Hawkeyes play the game without Frank Holbrook, Iowa's star black athlete. Iowa refused, and won the game 12–0, amid a hostile crowd in Columbia, Missouri.[10] Holbrook was one of the two players to score a touchdown during the game. Following Bull's tenure, Iowa hired Otto Wagonhurst, the last Hawkeye coach until John G. Griffith in 1909 to lead the team for only one season.[9], 6270=The State University of Iowa began playing American football as a club sport in 1872,[1] but it was not until 1889 that Iowa challenged Grinnell College, then-known as Iowa College, to a game of football.[2] On November 16, 1889; the two teams met in Grinnell to play the first game of intercollegiate football west of the Mississippi River.[3] Iowa lost, 24–0, and a rematch between the two teams in Iowa City was canceled due to poor weather.[4], 3351=In the following years, Iowa began hiring head coaches to assemble and prepare the team before the season, the first being E. A. Dalton of Princeton University, who was hired for ten days before the 1892 season.[6] Following a two-week tenure by Ben Donnelly in 1893, Iowa hired Roger Sherman, who became the first coach to lead the Hawkeyes for the entire season in 1894.[7] In 1895, however, Iowa decided to forgo hiring a head coach, and limped to a 2-5 record under the volunteer efforts of Bill Larrabee.[8] For the last time in school history, the Hawkeyes had gone without a head coach.[9]}",
    "TableContextTimeStampAfterTable": "{15439=The 1891 football season was one that ended in controversy. Following victories over Cornell and Nebraska, and losses to Minnesota and Iowa College, the Hawkeyes were 2-2 heading into their final game against Kansas in Kansas City, Missouri.[12] Following an argument where Kansas argued that Iowa had not put the ball into play fairly, the Jayhawks left the field claiming a 14–12 victory. However, the game was not called until after the next play, when Iowa scored an uncontested touchdown.[13] Today, Iowa lists the game as an 18–14 Hawkeye victory.[12], 86338=The 1897 Iowa Hawkeyes football team was coached by Otto Wagonhurst, the last coach in Iowa Hawkeyes football history to coach for only one season. The next year, Iowa would hire Alden Knipe as the team's head coach. However, Iowa's success in the WIUFA did not last long, as the Hawkeyes once again became an independent school from 1898 to 1899., 39042=The 1893 Iowa Hawkeyes football team featured a new head coach in Ben Donnelly. Like Dalton, Donnelly was only hired before the season to prepare and assemble the team. Donnelly was disliked compared to his predecessor but it did not stop Iowa from getting their first victory in the WIUFA with a win over Missouri., 2566=On September 26, 1889, Martin Sampson, who would later score the first touchdown in school history,[4] led a meeting regarding the organization of an S.U.I. football team. It was this suggestion that earned Sampson the title of coach and captain of the team.[2] In the following days, Iowa sent out a challenge to any team in the state of Iowa for a game of football. The one team to accept Iowa's challenge: Iowa College.[2] The Hawkeyes were no strangers to the Pioneers, as the two schools had met on the baseball diamond in the 20 years before.[2] The game date was set for November 16, and the preparations for the game began.[2], 74338=The 1896 Iowa Hawkeyes football team was the first Hawkeye football team to win a conference championship. The Hawkeyes went undefeated against the likes of Kansas, Missouri and Nebraska and had only one loss to Chicago. In fact, the team allowed only 12 points the entire season., 50167=The 1894 Iowa Hawkeyes football team was the first Hawkeye team to play against in-state rival Iowa State. The Hawkeyes would also play future Big Ten rivals Chicago and Wisconsin for the first time. The team's coach was Roger Sherman., 9192=Following Iowa's inaugural season in 1889, two games were scheduled for the Hawkeyes to play in 1890.[4] On October 18, the Hawkeyes played Iowa College in Iowa City, only to lose to the Pioneers for the second time in two games.[4] It was this loss that triggered a dispute amongst people within the University. In an attempt to prove that the best football talent was not on the team, the S.U.I. Medics challenged the varsity squad to a game. Confident, the varsity squad accepted, and lost, 22–10.[4] But the loss did not keep Iowa from challenging Iowa Wesleyan, who accepted, under the terms that the game be played in Mount Pleasant, Iowa.[4], 62442=The 1895 Iowa Hawkeyes football team was the last Hawkeye football team to go without a head coach when the university decided to forgo hiring a professional football coach.[14] The plan backfired, and although the team posted victories over Parsons College and Penn College, they failed to score in each of their five losses. The next year, Iowa would hire Alfred E. Bull as the team's next coach., 27057=The 1892 season was one of many firsts for the Hawkeyes. After going three years without a conference, Iowa joined the Western Interstate University Football Association, along with Nebraska, Missouri, and Kansas.[13] But in another first, E. A. Dalton, formerly of Princeton, was hired as Iowa's head coach. Although he was only hired for 10 days prior to the season, he is recognized as Iowa's first head coach.[6], 16785=Earlier in the year, two firsts were established in Hawkeye football history. On November 2, the Hawkeyes played rival Minnesota for the first of many times in school history. Later, on November 26, the Hawkeyes played their first game outside the state of Iowa in a win against Nebraska. The game was played in Omaha, Nebraska.[13]}",
    "lastModified": "Sun, 02 Nov 2014 20:16:56 GMT",
    "textBeforeTable": "Schedule Edit Preparations were difficult at Iowa, as proper management and leadership was obviously lacking at team practices.[3] That was hardly the case with practices at Iowa College. With the help of Frank Everest and Lou Van Giesen, two men with playing experience back east, the Pioneers were able to field a competitive team.[3] Iowa was outmatched, and lost the game, 24–0.[4] Although a rematch was scheduled to be played on Thanksgiving, it was canceled due to inclement weather.[4] With that, Iowa College had won the first championship west of the Mississippi River.[4] On September 26, 1889, Martin Sampson, who would later score the first touchdown in school history,[4] led a meeting regarding the organization of an S.U.I. football team. It was this suggestion that earned Sampson the title of coach and captain of the team.[2] In the following days, Iowa sent out a challenge to any team in the state of Iowa for a game of football. The one team to accept Iowa's challenge: Iowa College.[2] The Hawkeyes were no strangers to the Pioneers, as the two schools had met on the baseball diamond in the 20 years before.[2] The game date was set for November 16, and the preparations for the game began.",
    "textAfterTable": "Seasons « 1889 1891 » Following Iowa's inaugural season in 1889, two games were scheduled for the Hawkeyes to play in 1890.[4] On October 18, the Hawkeyes played Iowa College in Iowa City, only to lose to the Pioneers for the second time in two games.[4] It was this loss that triggered a dispute amongst people within the University. In an attempt to prove that the best football talent was not on the team, the S.U.I. Medics challenged the varsity squad to a game. Confident, the varsity squad accepted, and lost, 22–10.[4] But the loss did not keep Iowa from challenging Iowa Wesleyan, who accepted, under the terms that the game be played in Mount Pleasant, Iowa.[4] Fifteen hundred fans, including John Marshall Harlan and Robert Todd Lincoln, were in attendance for the Thanksgiving Day game.[4] Using rules that made touchdowns worth four points, the Hawkeyes easily won the game in a rout, 91–0.[4]",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}