{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2006-01-01T00:00:00",
            "2013-01-01T00:00:00",
            "2013-04-25T00:00:00"
        ],
        [
            "Description",
            "Final post-processing of LiDAR data involves several steps. The airborne GPS data was post-processed using Waypoint's GravNAVTM software (version 7.5). A fixed-bias carrier phase solution was computed in both the forward and reverse chronological directions. The data was processed for both base stations and combined. In the event that the solution worsened as a result of the combination of both solutions the best of both solutions was used to yield more accurate data. The GPS trajectory was combined with the raw IMU data and post-processed using Applanix Inc.'s POSPROC (version 4.3) Kalman Filtering software. This results in a two-fold improvement in the attitude accuracies over the real-time INS data. The best estimated trajectory (BET) and refined attitude data are then reintroduced into the LEICA ALS post processor or REALM Survey Suite OPTECH to compute the laser point-positions. The trajectory is then combined with the attitude data and laser range measurements to produce the 3-dimensional coordinates of the mass points. All return values are produced within ALS Post Processing software or REALM Survey Suite OPTECH software. The multi-return information minus the last return provides a useful depiction of the \"canopy\" within the project area. The last return is further processed to obtain the \"Bare Earth Dataset\" as a deliverable. All LiDAR data is processed using the binary LAS format 1.0 file format. LiDAR filtering was accomplished using TerraSolid, TerraScan LiDAR processing and modeling software. The filtering process reclassifies all the data into classes within the LAS formatted file based scheme set using the LAS format 1.0 specifications or by the client. Once the data is classified, the entire data set is reviewed and manually edited for anomalies that are outside the required guidelines of the product specification or contract guidelines, whichever apply. The coordinate and datum transformations were then applied to the data set to reflect the required deliverable projection, coordinate and datum systems as provided in the contract. The final data is in State Plane Washington North Coordinate System with the horizontal and vertical units being in feet.",
            "The NOAA Coastal Services Center (CSC) received topographic file in ASCII .XYZ format. The files contained lidar elevation measurements. The data were received in Washington State Plane North Zone 4601, NAD83 coordinates and were vertically referenced to NAVD88 using the Geoid99 model. The vertical units of the data were feet. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The ASCII .XYZ files were converted to LAS version 1.1 using Global Mapper. 2. All points in Class 0 (Never Classified) were changed to Class 2 (Ground). This includes water points. 3. The topographic las files were converted from orthometric (NAVD88) heights to ellipsoidal heights using Geoid99. 4. The topographic las files were converted from a Projected Coordinate System (WA SP North) to a Geographic Coordinate system (GCS). 5. The topographic las files' vertical units were converted from feet to meters. 6. The topographic las files' horizontal units were converted from feet to decimal degrees. 7. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2006_northpugetsound_m1451.xml&view=ISO19115Components-HTMLTable",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 624047061,
    "recordOffset": 624038859,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2006_northpugetsound_m1451Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2006 U.S. Geological Survey (USGS) Bare Earth Topographic LiDAR: North Puget Sound, Washington 2013-01-01 1 None 1 North American Datum 1983 2007-01-19 1 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NOAA CSC (originator) DOC/NOAA/NOS/OCM > Office for Coastal Management, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce coastal.info@noaa.gov originator http://coast.noaa.gov 1 NOAA CSC (publisher)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}