{
    "relation": [
        [
            "Log name",
            "dataldr.log",
            "invproc.log",
            "sinvproc.log"
        ],
        [
            "Description",
            "Records information about the processing of Management Information Format (MIF) files and hardware inventory in the Configuration Manager database.",
            "Records the forwarding of MIF files from a secondary site to its parent site.",
            "Records information about the processing of software inventory data to the site database."
        ],
        [
            "Computer with log file",
            "Site server",
            "Secondary site server",
            "Site server"
        ]
    ],
    "pageTitle": "Technical Reference for Log Files in Configuration Manager",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/c6675aac-4bb8-4b4b-9075-06b4ecec2a18",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00206-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878907523,
    "recordOffset": 878878927,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8860=To view the logs, you can use the Configuration Manager log viewer tool, CMTrace, which is located in the \\SMSSETUP\\TOOLS folder of the System Center 2012 Configuration Manager source media. The CMTrace tool is also added to all boot images that are added to the Software Library., 48287=The top-level site in the System Center 2012 Configuration Manager hierarchy, and each child primary site, 3919=Applies To: System Center 2012 Configuration Manager, System Center 2012 Configuration Manager SP1, System Center 2012 Configuration Manager SP2, System Center 2012 R2 Configuration Manager, System Center 2012 R2 Configuration Manager SP1, 30096=For System Center 2012 Configuration Manager SP1 and later:, 9442=The Configuration Manager 2007 log viewer tool, Trace32, is now replaced with CMTrace., 103260=For System Center 2012 R2 Configuration Manager and later:, 3878=Updated: May 14, 2015, 4217=In System Center 2012 Configuration Manager, client and site server components record process information in individual log files. By default, client and server component logging is enabled in Configuration Manager. You can use the information in these log files to help you troubleshoot issues that might occur in your Configuration Manager hierarchy.}",
    "textBeforeTable": "The following table lists the log files found on the Configuration Manager client. Client Operations The following sections list the log files related to client operations, and client installation. Configuration Manager Client Logs By default, Configuration Manager log files are stored in a variety of locations that depend on the process that creates the log file, and on the configuration of your site systems. Because the location of the log on a given computer can vary, use search to locate the relevant log files on your Configuration Manager computers to help you troubleshoot a specific scenario. Locating Configuration Manager Logs Click OK to save the configuration. In the Configuration Manager Component Logging dialog box, complete the available configuration options for your selection. On the Component menu, click Logging. In the right pane, select one or more components. Expand the site and navigate to Components or Servers, depending on where the components that you want to manage are located. If you do not see the site that you want to manage, click Site, click Connect, and then enter the name",
    "textAfterTable": "CcmExec.log Records activities of the client and the SMS Agent Host service. This log file also includes information about enabling and disabling wake-up proxy. CcmMessaging.log Records activities related to communications between the client and management points. CCMNotificationAgent.log Records activities related to client notification operations. Ccmperf.log Records activities related to the maintenance and capture of data related to client performance counters. CcmRestart.log Records client service restart activity. CCMSDKProvider.log Records activities for the client SDK interfaces. CertificateMaintenance.log Maintains certificates for Active Directory Domain Services and management points. CIDownloader.log Records details about configuration item definition downloads. CITaskMgr.log Records tasks that are initiated for each application and deployment type, such as content download or install or uninstall actions. ClientAuth.log Records the signing and authentication activity for the client. ClientIDManagerStartup.log Creates and maintains the client GUID and identifies tasks performed during client registration and assignment. ClientLocation.log Records tasks that are related to client site assignment. CMHttpsReadiness.log Records the results of running the Configuration Manager HTTPS Readiness Assessment Tool. This tool checks whether computers have a PKI client authentication certificate that can be used for Configuration Manager. CmRcService.log Records information for the remote control service. ContentTransferManager.log Schedules the Background Intelligent Transfer Service (BITS) or the Server Message Block (SMB) to download or to access packages. DataTransferService.log Records all BITS communication for policy or package access.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}