{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is a great security here on campus. Placed throughout the campus are emergency phone booths, at which you can simply press the button for a security escort home if you are uncomfortable with walking home alone.",
            "All in all, UND is an open campus that has a close community feel. It is only a little over $14,000 per year which has a lot of perks to other schools.",
            "There are plenty of activities to be apart of at UND. There are religious groups such as KiAlpha and Cru, and there are specific programs made by each RA for the wing about once every two weeks. Along with that, the Wellness Center has lots of different activities every day including cycling and Zumba.",
            "The food and dining is amazing here at UND! It does get tiring after a while because of the routine entrees served every week, but it is always available to students.",
            "Dorm life is nice because you don't have to worry about monthly bills for the necessities and you don't have to set aside money specifically for groceries. However, the drama of high school is carried into college and the added stresses of finding your niche is a bit hard to deal with at times.",
            "The academic rigor is gruesome when it comes to the amount of homework given compared to high school. As long as you pay attention and ask questions if you need help, the actual level of difficulty will depend on your ability to do as the teacher wants.",
            "Be sure to find the advisor that best fits your personality and needs. Also, learn the course expectations for each professor early on so you can do your best in their class.",
            "The University of North Dakota is a great college that offers many different options for students' interests. It allows students to open their horizons and experience different programs. It's system is easy to navigate and the advisors are always available to students' needs."
        ]
    ],
    "pageTitle": "University of North Dakota (UND) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Dakota/reviews?_escaped_fragment_=/show/30874",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905175375,
    "recordOffset": 905108956,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{218939=Great program to persue a masters degree in Physicians Assistant. Great, informative helpful staff. Look forward to attending on campus orientation session in May 2013., 50586=there are many american indians in north dakota, when i arrived in august, they had an indian dance/festival that was interesting. they love hockey here! the team name is sioux indians and they are deciding whether to change it or not, no decision yet!, 145611=The food and dining is great especially at the Squires Dining Center, which was newly built in 2005. They have a selection area for pizzas, sandwiches, a salad bar, a grill, pasta, omelets, cereal bar, a homemade food area, and a desert bar. The two other dining centers are also good but smaller. We also have an eating are in our Memorial Union, which includes a pizza place, a sandwich place, a coffee place, and a C store for snacks. There are definitely options whether you are in a hurry or have time., 314092=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/25/2010 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 72 Allison from Fridley, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. University of North Dakota Reviews University of North Dakota › North Dakota › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students Every student! Tips for prospective students Make sure you practice good study habits in high school because you really need them in college. If you study I recommend going to the library or to a coffee shop and don't bring your computer because you will just get distracted by facebook. Bang for the buck Compared to other schools I looked at the University of North Dakota was way cheaper. You get unlimited meals (if you live in the dorms) and you get in to sports games for free (except for mens hockey, but it only costs $7!) Am enjoying being here They people here are really friendly and provide a welcoming environment. Hockey is also a big thing up here and I love it! Am learning a lot Right now I am taking general classes, some are the same that I took in high school like psych, chemistry, and precalculus but the teachers cover the material in much greater detail. Login to rate or flag the reviews Kat",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}