{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "96,521",
            "25,250",
            "15,294",
            "5,731",
            "624",
            "121",
            "131,633"
        ],
        [
            "Congregations",
            "258",
            "59",
            "6",
            "26",
            "4",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Battlefield, Missouri (MO) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Battlefield-Missouri.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369544611,
    "recordOffset": 369415234,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{129185=Battlefield: Winter 2009, 7000=According to our research of Missouri and other state lists there were 3 registered sex offenders living in Battlefield, Missouri as of July 30, 2015. The ratio of number of residents in Battlefield to the number of sex offenders is 1,912 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 25756=Incorporated in 1971}",
    "TableContextTimeStampAfterTable": "{37214=2000 Presidential Elections Results, 24451=Air Quality Index (AQI) level in 2012 was 103. This is worse than average., 12899=On 5/4/2003, a category F3 (max. wind speeds 158-206 mph) tornado 0.7 miles away from the city center killed 7 people and injured 48 people and caused $48 million in damages., 46594=7.29% of this county's 2011 resident taxpayers lived in other counties in 2010 ($31,333 average adjusted gross income), 27983=Particulate Matter (PM10) [µg/m3] level in 2012 was 17.3. This is about average. Closest monitor was 6.3 miles away from the city center., 34068=School Enrollment by Level of School (%) in 2013, 26554=Sulfur Dioxide (SO2) [ppb] level in 2010 was 1.84. This is about average. Closest monitor was 4.1 miles away from the city center., 25099=Carbon Monoxide (CO) [ppm] level in 2010 was 0.246. This is better than average. Closest monitor was 7.2 miles away from the city center., 56302=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 38356=Graphs represent county-level data. Detailed 2008 Election Results, 114129=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 37786=2008 Presidential Elections Results, 36928=1996 Presidential Elections Results, 33670=Educational Attainment (%) in 2013, 12577=On 11/29/1991, a category F4 (max. wind speeds 207-260 mph) tornado 4.0 miles away from the Battlefield city center killed 2 people and injured 64 people and caused between $5,000,000 and $50,000,000 in damages., 38072=2012 Presidential Elections Results, 27279=Ozone [ppb] level in 2012 was 42.1. This is worse than average. Closest monitor was 5.8 miles away from the city center., 37500=2004 Presidential Elections Results, 28732=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 10.4. This is about average. Closest monitor was 7.2 miles away from the city center., 112794=Total of 5 patent applications in 2008-2015., 48805=7.21% of this county's 2010 resident taxpayers moved to other counties in 2011 ($33,215 average adjusted gross income), 25822=Nitrogen Dioxide (NO2) [ppb] level in 2010 was 7.97. This is worse than average. Closest monitor was 7.2 miles away from the city center.}",
    "textBeforeTable": "Religion statistics for Battlefield city (based on Greene County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (2%) Bottled, tank, or LP gas (3%) Electricity (15%) Utility gas (80%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 35 Greene County: 1.33 / 10,000 pop. Missouri: 1.88 / 10,000 pop. Number of supercenters and club stores: 6 This county: 0.23 / 10,000 pop. State: 0.18 / 10,000 pop. Number of convenience stores (no gas): 4 Greene County: 0.15 / 10,000 pop. Missouri: 0.60 / 10,000 pop. Number of convenience stores (with gas): 95 Greene County: 3.60 / 10,000 pop. State: 4.34 / 10,000 pop. Number of full-service restaurants: 214 Here: 8.11 / 10,000 pop. State: 7.37 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}