{
    "relation": [
        [
            "Date",
            "Dec 29, 2000",
            "Dec 11, 2008",
            "Oct 2, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6912294 - Multi-stage watermarking process and system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6912294?dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486482303,
    "recordOffset": 486434227,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6353=The highest level grouping in the Watermark Specification Language (WSL) is template specification 22 (FIG. 3) which as been described previously above and may have the following grammar with the grammar elements:}",
    "TableContextTimeStampAfterTable": "{150443=As indicated by the subscript “opt”, the grammar element template-id is an optional identification tag which can be used to identify the particular template. In this regard, the template-id may identify a digital certificate signed by a trusted registration authority that assigns a unique identification number to the template. It also may include information for locally detecting any changes or tampering with the template. In addition, the template-id may also include address information for locating a reference copy of the template., 151889=The template specification 22 may also include an optional grammar element for comments. Comments in WSL may be intended for documentation purposes and may be used by people creating and updating template specifications. Comments are not interpreted for meaning by watermarking systems but their provision and use is important in the WSL. More specifically, since WSL statements can be compiled into objects and subsequently printed out again to make new source statements, it is important that comments be preserved throughout the edit-compile-reprint cycle for specifying rights. In the WSL herein described, the comments have fixed and specific locations in the syntax (“structured comments”) corresponding to structured locations for object storage to thereby ensure that the comments be stored in the compiled watermark objects. In this regard, there is preferably only one comment in a template specification at each level., 151015=The template specification 22 may also include optional grammar elements for a name and a description of the template. The format and scope of the information in the name and the description are not specified so that different parties can put various types of information here, depending on the application., 146173=In the examples below, the preferred order for key-word phrases is the order shown in the grammar. In many cases, this order is thought to be clearest in meaning. However, except as noted in the text, compilers and interpreters of the language preferably accept the phrases in other orders as well. Programs that generate statements in the language are expected to print out phrases in the preferred order., 77624=In accordance with one embodiment of the present invention, the template specification generated may include a merge map associated with the watermark specification which describes where the watermark is to be merged into the target document. A plurality of merge maps may be associated with the watermark specification. The template specification generated may include a merge technology specification which describes a specific merging technology to be used in the step of merging the watermark into the target document. The template specification generated may also include merge target specification which describes at least one of the target document and a characteristic of the target document into which the watermark is merged. In addition, the template specification generated may be described using a watermark specification language having grammar elements that: identifies version of the watermark specification language, provides a list of a plurality of watermark specifications to be used, and provides a mapped list of how a plurality of watermarks associated with the plurality of watermarks is to be merged with the target document. In this regard, the watermark specification language may optionally have grammar elements that at least one of: identifies the template specification, identifies a name of the template specification, provides a description of the template specification, identifies owner authorized to change the template specification, and provides comments regarding the template specification., 137073=Initially, it is noted that terms of the WSL in italics are expanded into other terms in the actual WSL specification, the specification referring to the watermark specification 12 and/or the template specification 22 in the present embodiment. Italicized terms that are to be expanded into other terms in the actual WSL statements are referred to as non-terminals, and terms that appear in actual WSL statements are referred to as terminals. The right arrow “→” indicates a grammar expansion rule. Thus, as an example, the rule:, 141341=In the embodiment below, the white space in the language such as spaces and tabs, is used merely to separate the grammar of the language and has no other meaning except inside quoted strings. The case of terms such as capitalization is also not meaningful. Thus, a “Template:” keyword can be written as “Template:” or “template:” or even “tEmPlaTe:”. However, capitalizing the first letter is preferred for readability. Preferably, programs that print specifications out from objects utilize the preferential capitalization., 75850=The watermark specification created may include content information which describes content to be in the watermark and the watermark may have a plurality of content information associated therewith. The content of each of the content information may be application specific and specify at least one of static information and dynamic information. The watermark specification created may also include mark technology specification which describes a specific watermarking technology to be used in the step of generating the watermark. The mark technology specification may include parameters needed by the specific watermarking technology during the step of generating the watermark. The watermark specification created may also include a target object specification which describes at least one of a target object and a characteristic of the target object into which the watermark is generated, the target object specification specifying at least one of a shape, color, font and resolution of an image. The target object specification may include a pointer pointing to a content information which describes the content to be inserted in the watermark. In this regard, the watermark specification created may described using a watermark specification language that has grammar elements that: identifies the watermark specification, identifies a specific watermarking technology to be used, and identifies a target object in which the watermark is generated. Optionally, the watermark specification language may have grammar elements that at least one of: identifies version of the watermark specification language, identifies a name of the watermark specification, and specifies technology of content information of the watermark specification., 151362=The template specification 22 may further include an optional grammar element for owner specification, which may indicate who is authorized to change any part of the template-specification, including adding or deleting watermarks and its associated parameters. The owner specification may also indicate what digital license is required to make the changes. If no owner specification is specified, then anyone (or no one) would be able to make changes to the watermarks in a digital work., 173242=The watermark specification 12 also includes a grammar element wm-spec-id which is an identification tag used to identify the watermark specification 12. This is preferably provided since each watermark map-spec appearing in the template specification 22 refers to a watermark specification 12 using the wm-spec-id., 185011=Lastly, referring again to the map-spec previously noted relative to the template specification 22 discussed above, the map-spec defines how the watermark is to be merged into the document and may have the grammar with the grammar elements:, 135005=As previously noted, the present invention provides a multi-stage watermarking process 2 and a system such as a computer based system for executing such a process. In this regard, one embodiment of a watermark specification language (hereinafter “WSL” or “language”) that may be used for defining the watermark specification 12 and template specification 22 discussed above is proposed herein below in detail. This embodiment of the watermark specification language is modeled from the Digital Property Rights Language (DPRL) developed by Mark Stefik et al. as fully described in detail in U.S. Pat. No. 5,629,980, and No. 5,715,403 which are incorporated herein by reference, as well as application Ser. No. 08/948,893 which was previously incorporated herein by reference. As such, the language grammar and grammar rules given below relative to the watermark specification language generally correspond to DPRL but the keywords and the syntax of the WSL differ from DPRL. It should also be noted that DPRL itself includes information which may be a component of the watermark specification. In particular, DPRL specifies the requirement for watermark from the rights perspective. For example, the publishers can specify what information is to be in the watermark. The WSL in accordance with the present invention also allows specification of how the watermark should be put into the document. In this sense, WSL enhances DPRL and may be used in conjunction with DPRL to define the watermark specification 12, or be used by itself. This is attained since the WSL also allows defining of the template specification 22 in accordance with the present invention as described previously. Of course, other languages may be utilized in practicing the present invention and the details set forth hereinbelow should be understood as merely showing one example. For example, the present invention may be practiced by utilizing a watermark specification language in the XML format or other derivations thereof., 172480=The WSL-Version includes a grammar element which is a machine-readable identifier version-id that identifies the version of the watermark specification language used. The identification of the version of the WSL used facilitates backwards compatibility to works in which the watermark specification were written in an older version of the language. The provision of the version-id is optional for the watermark specification 12 if the watermark specification 12 is actually a part of the template specification 22, and if the version of the language happens to be the same. Each watermark specification 12 may have an optional grammar element for a name:, 177568=The grammar element application-id is an optional identification tag in the watermark to help identify the particular application associated with the content so as to aid in associating the application with the content when the watermark is recovered., 141898=Some of the design goals for the grammar include:, 150063=The WSL-Version includes a grammar element which is a machine-readable identifier version-id that identifies the version of the watermark specification language used. The identification of the version of the WSL used facilitates backwards compatibility to works in which the template specification were written in an older version of the language.}",
    "textBeforeTable": "Patent Citations While various embodiments in accordance with the present invention have been shown and described, it is understood that the invention is not limited thereto. The present invention may be changed, modified and further applied by those skilled in the art. Therefore, this invention is not limited to the detail shown and described previously, but also includes all such changes and modifications which are encompassed by the claims. It should also be noted that whereas the multi-stage watermarking process in accordance with the present invention is described as having multiple stages, it should be appreciated that these stages need not be embodied in separate software or hardware but may be provided in a single software or hardware. Moreover, it should also be apparent that the various stages of the present embodiment as discussed above can be subdivided into small stages and other stages may be added as well. In this regard, if the present invention is implemented in software, the various steps can be merely separate portions of the same software code, different files, interspersed lines of code, etc. Moreover, the present invention can be implemented over any type of communications network, such as the Internet, a local area network (LAN), a wide area network (WAN), direct computer connections, or the like using any type of communications hardware and protocol. Communication can be accomplished over electric cable, fiber optic cable, or any other cable,",
    "textAfterTable": "Centralized verification system US4159468 Nov 17, 1977 Jun 26, 1979 Burroughs Corporation Communications line authentication device US4220991 Sep 21, 1978 Sep 2, 1980 Tokyo Electric Co., Ltd. Electronic cash register with removable memory packs for cashier identification US4278837 Jun 4, 1979 Jul 14, 1981 Best Robert M Crypto microprocessor for executing enciphered programs US4323921 Jan 23, 1980 Apr 6, 1982 Etablissement Public De Diffusion Dit \"Telediffusion De France\" System for transmitting information provided with means for controlling access to the information transmitted US4442486 Nov 25, 1981 Apr 10, 1984 U.S. Philips Corporation Protected programmable apparatus US4529870 Jun 25, 1982 Jul 16, 1985 David Chaum Cryptographic identification, financial transaction, and credential device US4558176 Sep 20, 1982 Dec 10, 1985 Arnold Mark G Computer systems to inhibit unauthorized copying, unauthorized usage, and automated cracking of protected software US4593376 Apr 21, 1983 Jun 3, 1986 Volk Larry N",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}