{
    "relation": [
        [
            "",
            "Upfront costs",
            "Broadband",
            "Line rental",
            "Total",
            "Average per month"
        ],
        [
            "Year 1",
            "£0.00",
            "£108.00",
            "£162.00",
            "£270.00",
            "£22.50"
        ],
        [
            "Year 2",
            "£0.00",
            "£216.00",
            "£162.00",
            "£378.00",
            "£31.50"
        ],
        [
            "Year 3",
            "£0.00",
            "£216.00",
            "£162.00",
            "£378.00",
            "£31.50"
        ]
    ],
    "pageTitle": "Compare Cheap Broadband Deals - MoneySuperMarket",
    "title": "",
    "url": "http://www.moneysupermarket.com/broadband/",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 587798127,
    "recordOffset": 587767029,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{177253=Moneysupermarket.com Limited is an appointed representative of Moneysupermarket.com Financial Group Limited, which is authorised and regulated by the Financial Conduct Authority (FCA FRN 303190). Moneysupermarket.com Financial Group Limited, registered in England No. 3157344. Registered Office: Moneysupermarket House, St. David's Park, Ewloe, CH5 3UZ. Telephone 01244 665700, 19121=Both BT and Sky have the rights to show live Premier League matches until 2017. Sky has the bulk of the matches with 168 games and BT have the remaining 48 matches. Click to read more}",
    "textBeforeTable": "Cost summary Over the 18 month contract period, including line rental and set up costs: £17.08 Average monthly cost £307.35 Total 18 month contracted cost You can save an extra £20.04 by paying for 12 months line rental in advance. Line rental would effectively cost £15.03 per month. UK landline (weekend): 11.5p per min UK landline (evening): 11.5p per min UK landline (peak): 11.5p per min Call charges (UK landlines) Total: £21.70 Plus line rental: £16.70 Monthly: £5 Costs after your contract ends Out of contract costs Total: £16.70 Plus line rental: £16.70 Monthly: Free Monthly costs Delivery cost: £6.75 Connection cost: Free Equipment cost: Free Upfront costs 18 months contract Unlimited usage Up to 17 Mbps ADSL Broadband Free privacy features: Withold Number, Caller Display, Call Barring, Anonymous Caller Reject and Voicemail. No other calls included, pay for what you use and nothing more. Add an optional All-in SIM with unlimited calls, texts and mobile data for just £12 a month. Free calls between TalkTalk customers Why this could be the right package for you",
    "textAfterTable": "Package costs Monthly £5.00 Setup £6.75 Offer  £100 Love2Shop voucher available to new customers who order online, switch from BT, Sky or Plus.net and keep their existing landline number. Unlimited broadband free for 18m, then £5 a month. 1st year cost £-23.25 Monthly line rental £16.70 1st year inc. line rental £177.15 Contract length 18 months You can choose to pay 12 months line rental in advance for £180.36, equivalent to a monthly price of £15.03. £100 Love2Shop voucher available to new customers who order online, switch from BT, Sky or Plus.net and keep their existing landline number. Unlimited broadband free for 18m, then £5 a month. Offer ends 13th Aug. Go to site MoneySuperMarket exclusive If you don't want to pay a monthly subscription for Sky Sports you can buy one-off passes with Now TV for a set fee. To buy a Now TV box click here Both BT and Sky",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}