{
    "relation": [
        [
            "Article type",
            "func schema only",
            "indexed view schema only",
            "proc schema only",
            "table",
            "view schema only"
        ],
        [
            "Schema option values",
            "0x01 and 0x2000",
            "0x01, 0x040, 0x0100, 0x2000, 0x40000, 0x1000000, and 0x200000",
            "0x01 and 0x2000",
            "All options.",
            "0x01, 0x040, 0x0100, 0x2000, 0x40000, 0x1000000, and 0x200000"
        ]
    ],
    "pageTitle": "sp_addmergearticle (Transact-SQL)",
    "title": "",
    "url": "https://msdn.microsoft.com/en-us/library/ms174329(v=sql.120).aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 871243375,
    "recordOffset": 871219145,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{36373=0x1000, 41501=Converts date and time data types (date, time, datetimeoffset, and datetime2) introduced in SQL Server 2008 to data types that are supported on earlier versions of SQL Server., 43069=Converts common language runtime (CLR) user-defined types (UDTs) to varbinary(max) so that columns of type UDT can be replicated to Subscribers that are running SQL Server 2005., 44461=Converts the geography and geometry data types to varbinary(max) so that columns of these types can be replicated to Subscribers that are running SQL Server 2005., 40108=Converts large object data types (nvarchar(max), varchar(max), and varbinary(max)) introduced in SQL Server 2005 to data types that are supported on SQL Server 2000., 36547=0x2000, 89907=0x01 and 0x2000, 43432=Converts the hierarchyid data type to varbinary(max) so that columns of type hierarchyid can be replicated to Subscribers that are running SQL Server 2005. For more information about how to use hierarchyid columns in replicated tables, see hierarchyid (Transact-SQL)., 90111=0x01, 0x040, 0x0100, 0x2000, 0x40000, 0x1000000, and 0x200000, 40932=Use this option to replicate the FILESTREAM attribute if it is specified on varbinary(max) columns. Do not specify this option if you are replicating tables to SQL Server 2005 Subscribers. Replicating tables that have FILESTREAM columns to SQL Server 2000 Subscribers is not supported, regardless of how this schema option is set. See related option 0x800000000., 37141=This option is not valid for Publishers running SQL Server 2005 or later versions.}",
    "textBeforeTable": "Is the type of article. type is sysname, with a default of table, and can be one of the following values. [ @type= ] 'type' Is the database object to be published. source_object is sysname, with no default. For more information about the types of objects that can be published using merge replication, see Publish Data and Database Objects. [ @source_object= ] 'source_object' Is the name of the article. The name must be unique within the publication. article is sysname, with no default. article must be on the local computer running Microsoft SQL Server, and must conform to the rules for identifiers. [ @article= ] 'article' Is the name of the publication that contains the article. publication is sysname, with no default. [ @publication= ] 'publication' Arguments [ , [ @stream_blob_columns = ] 'stream_blob_columns' ] [ , [ @compensate_for_errors = ] 'compensate_for_errors' ] [ , [ @delete_tracking = ] delete_tracking ] [ , [ @identityrangemanagementoption = ] 'identityrangemanagementoption' ] [ , [ @subscriber_upload_options = ] subscriber_upload_options ] [ , [ @processing_order = ] processing_order ] [ , [ @partition_options = ] partition_options ] [ , [ @logical_record_level_conflict_resolution =",
    "textAfterTable": "view schema only View with schema only. [ @description= ] 'description' Is a description of the article. description is nvarchar(255), with a default of NULL. [ @column_tracking= ] 'column_tracking' Is the setting for column-level tracking. column_tracking is nvarchar(10), with a default of FALSE. trueturns on column tracking. false turns off column tracking and leaves conflict detection at the row level. If the table is already published in other merge publications, you must use the same column tracking value used by existing articles based on this table. This parameter is specific to table articles only. Note If row tracking is used for conflict detection (the default), the base table can include a maximum of 1,024 columns, but columns must be filtered from the article so that a maximum of 246 columns is published. If column tracking is used, the base table can include a maximum of 246 columns. [ @status= ] 'status' Is the status of the article. status is nvarchar(10), with a default of unsynced. If active, the initial processing script to publish the table is run. If unsynced, the initial processing script to publish the table is run",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}