{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is little to no crime on campus as well as there are strategically placed telephones to allow for help in case of an emergency. Plenty of police on the streets where the people accumulate on weekends, and security cameras are at the entrance of almost every building.",
            "Voed most interactive greek community in 2010, and 2011 this is due to the large number of participants as well as the many opportunities for paired events with the option to lead if you have the talents to do so.",
            "If you have a hobby, well... theres a club for that! With so many choices it makes it too easy to meet people who enjoy doing the same things as you. Also club fest is hosted in the fall and spring giving students a chance to meet members on the board for these clubs to find out more before actually joining.",
            "Iowa State would be great for you if you love to meet people quickly and have a sense of home feeling even when your at school. It is difficult coursework but I am sure if you are outgoing and determined not only will you find friends to help you through but if the faculty sees you are giving it everything you have then they as well will likely come to your aid.",
            "The campanile is the center piece of the school which is a clock tower that stands 72 feet tall on central campus and can be seen from anywhere. Also, there is V.E.I.S.H.E.A which is the largest student run celebration which is hosted in April every year including: music, parades, entertainment, student faculty tournaments and much more!",
            "Despite the fact I pay out of state tuition its engineering degree is a tough one to match. With amazing facilities and faculty you will end up paying more to live there than to go there!",
            "The city itself play host to lots of great music venues, as well as a conveniently located downtown for movies and food. The bar scene is where many of the student congregate on weekends which allows for any option of crazy or relaxed with almost a dozen different styles of bars on the same street.",
            "Dining centers at Iowa state accommodate and food preference and and amount of people. It is one of the best times of the day, every day when everyone meets at the dining centers to enjoy each others company and wide variety of food. In the centers they have every imaginable food that is rotated so you get many meals from many ethnicities.",
            "Splendid food, Superb location, Well involved. these are three phrases that are essential to becoming integrated into a foreign society where you are expected to function and eventually flourish.",
            "Challenges you to complete many daily assignments, including attendance of class for best grades. Lots of lab and group work in engineering study that is weighted upon you participation within the groups which is then accounted for in accordance with you lab teams assignment scores.",
            "come prepared to learn but be challenged to manage time in comparison to high school. keep your eyes open and nose to the grindstone and you will make it through!",
            "A family community with the size of a city, with opportunity to make oneself into a successful human being. Helping and understand, yet challenging curriculum to expand ones thinking inside and out of the box. Beautiful to the eye and the heart."
        ]
    ],
    "pageTitle": "Iowa State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Iowa-State-University/reviews?_escaped_fragment_=/show/104975",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889891379,
    "recordOffset": 889697435,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{385777=iowa state university is the perfect fit for anyone who wants to be successful in the future with their intended career. i believe that iowa state will help me prepare and get ready for life after college. i am excited to start my adventure at iowa state university in the fall of 2012., 534446=The campanile is the center piece of the school which is a clock tower that stands 72 feet tall on central campus and can be seen from anywhere. Also, there is V.E.I.S.H.E.A which is the largest student run celebration which is hosted in April every year including: music, parades, entertainment, student faculty tournaments and much more!, 261008=veishea, a week long celebration of the founding of iowa state university. starts in mid april. each day there are different events planned, and on saturday there is a parade, concerts, local food and much more. it is basically a mini state fair. campaniling, where you and your partner kiss under the campanile (big clock tower on campus) when the clock hits midnight., 845921=From dorms in Richardson court to the out of campus Maricopa being constructed for the fall of 2013 due to the high rates of returning students and incoming freshmans., 753386=If you are looking for a great college ministry check out The Salt Company. Over 1000 students and a great place to meet great friends and people who truly care. Plus its a campus organization too!, 150980=Dorms are pretty typical. Iowa State is a large campus with lots of housing,they are building a new dorm that should be done by 2017. You can go for traditional housing or suite style, lots of variety but apply early!:), 192522=I'm am loving the campus! I'm starting as a Freshman this August 2011. Though I haven't started, students there for summer classes were helpful and informative, as were the professors at orientation. I can't Wait to attend!, 881032=By the fall of 2014, Iowa State University will officially have the biggest Greek system in the United States. I live in a fraternity, and it is by far, the best decision I have made in my life., 938492=1. National Balloon Festival Indianola, IA summer 2. Des Moines Renaissance Faire 3. Amana Colonies October Fest fall, 270115=the campus is very safe! not only is there a cyclone taxi that runs until 6:00 in the morning and goes all through greek areas. also there are blue towers located strategically throughout campus with a button on them that immediately calls the isu police and/or ames police. i have never felt unsafe at isu as well., 151913=Make sure you apply early! The application opens up in July,make sure you accept your offer of admission and correctly put in data directly from transcript. Also housing fills up quick if you want to live in a specific dorm submit your housing contract ASAP. Like most likely if you submit before January you should be able to live in the place you want., 426988=Apply early for dorms, some were just built in 2004 and are AWESOME!, 147529=I'm not interested in joining greek life this year, maybe next. But I know for girls in June you will get an invitation to attend formal recruitment the week before school starts and you move in early! Great school for greek life if you want in. There's a group for everyone!:), 532851=Voed most interactive greek community in 2010, and 2011 this is due to the large number of participants as well as the many opportunities for paired events with the option to lead if you have the talents to do so.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 27 out of 28 people found this review useful. 1 of 266 Jennifer from Shoreview, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. Iowa State University Reviews Iowa State University › Iowa › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot You learn a lot in college, but at Iowa State you can learn anything you could imagine. The professors are true experts in their fields, and do an excellent job teaching. The living experience at ISU leads to a lot of great insights too, especially if you're living in Friley or Helser Halls. Login to rate or flag the reviews Meghan from Walnut, IL 06/09/2009 Reviewer is A current student here. 14 out of 17 people found this review useful. 3 of 266 Categories Comments Great for these types of students Determined, competetive, artsy, engineers, ag students, students who want the real college experience, dance minors Tips for prospective students If you are planning on becoming a design major, BE PREPARED for the difficulty and time-consuming curriculum. I have taken art classes since grade school and I still struggled through many projects. However, you will learn SO much and feel like you accomplished a lot. It is a very competetive",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}