{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Police officers everywhere!!!!!!!! Their friendly though. :)",
            "Great :) the parties are fun.",
            "I wish I could do them all!",
            "Friendly. On-top-of -things. Good at writing essays. Humble enough to go to tutoring, and teachers office hours to ask for help.",
            "There's a funky statue in front of the library that students place sacrifices (fruit or veggies) on to help them ace their exams. You cant walk on the official SU plaque- the seal- in front of the church. Or else you're doomed for failure.",
            "It's super expensive tuition. But they give fairly significant scholarships",
            "Hang out with people. The most fun people you will ever meet go to SU. There's almost always an on-campus event taking place.",
            "The cafeteria staff is social and friendly. The food is great! But like anywhere, it gets kind of monotonous to be eating something prepared in the same place, by the same people every day.",
            "I live in Brown Cody. Co-Ed. Definitely go for Co-Ed. life. You wont regret it.",
            "Lots and lots of HW assignments...",
            "Don't procrastinate. The homework load is pretty crazy. Don't just stick to a select few friends. Make it your goal to try to get to know everyone on campus.",
            "This college is unbelievable. Everyone trusts one another and people are so friendly. It's a genuine oasis in a sometimes chaotic world, and I feel so blessed to be going here."
        ]
    ],
    "pageTitle": "Southwestern University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southwestern-University/reviews?_escaped_fragment_=/show/1939",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901773443,
    "recordOffset": 901729290,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72214=Lots of well-established groups on campus. Also very easy to start your own up. Most students get involved in several. In 2013, Southwestern will also be reviving its football team ('Undefeated Since 1950'), which should be an exciting opportunity for anyone interested in becoming involved with the team or booster club, etc., 17264=Southwestern is great for students who want a personalize education which includes one-on-one time with professors, meetings and study sessions with students and academic advisors, and chances for discussion in the classroom. With less than 1400 students and the average class size of 12, those chances are abundant. The sincere care and concern that abides on this campus is incomparable!, 174267=© 2015, Cappex.com, LLC, 86176=There are NCAA and intramural sports for students to participate in. NCAA will have a football team and a women's lacrosse team added in 2013. As for clubs, there is something for every student, ranging from academic to personal interests, including the option of starting new clubs.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 14 out of 15 people found this review useful. 1 of 32 Cheyney from San Antonio, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Login to rate or flag the reviews Brittany 12/23/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 32 Categories Comments Great for these types of students Well-rounded, ambitious students. Any student wiling to work. Any student who doesn't know exactly what their major is just yet, but wants to feel around and figure out what is best for them. Tips for prospective students Try to earn as many outside scholarships as possible. Always be friendly to the staff, and try to get to know them as well. They can help when problems come up. Listen to the tour of the library at the beginning of the year; that place is priceless during midterms and finals. Bang for the buck It can be very expensive, but their scholarship program is very helpful. AP classes and class rank play into curriculum for scholarship money, as well as financial need and any additional scholarships such as music or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}