{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2012-01-01T00:00:00",
            "2013-05-01T00:00:00",
            "2013-06-28T00:00:00"
        ],
        [
            "Description",
            "Control Process: Photo Science, Inc. established control points on Tutuila that were used to calibrate the LiDAR to known ground locations to be used in the post processing of the LiDAR data. The points were located on relatively flat terrain on surfaces that generally consisted of grass, gravel, pavement or bare earth and were in well-defined discrete locations. See The Post Flight Aerial Acquisition and Calibration Report for additional collection parameters and methodologies: ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/as/PhotoScience-AmSam_PostFlightAcquisitionReport_FINAL.pdf Raw Flight Line Process: Applanix software was used in the post processing of the airborne GPS and inertial data that is critical to the positioning and orientation of the sensor during all flights. POSPac MMS provides the smoothed best estimate of trajectory (SBET) that is necessary for Optech's post processor to develop the point cloud from the LiDAR missions. The point cloud is the mathematical three dimensional collection of all returns from all laser pulses as determined from the aerial mission. At this point this data is ready for analysis, classification, and filtering to generate a bare earth surface model in which the above ground features are removed from the data set. The point cloud was manipulated within the Optech software; GeoCue, TerraScan, and TerraModeler software was used for the automated data classification, manual cleanup, and bare earth generation from this data. Project specific macros were used to classify the ground and to remove the side overlap between parallel flight lines. All data were manually reviewed and any remaining artifacts removed using functionality provided by TerraScan and TerraModeler. Classified LAS Process: All ground (ASPRS Class 2) LiDAR data inside of the Lake Pond and Double Line Drain hydro flattening breaklines were then classified to water (ASPRS Class 9) using TerraScan macro functionality. A buffer of 1 meter was also used around each hydro flattened feature to classify these ground (ASPRS Class 2) points to ignored ground (ASPRS Class 10). All Lake Pond Island and Double Line Drain Island features were checked to ensure that the ground (ASPRS Class 2) were reclassified to the correct classification after the automated classification was completed. A description of each deliverable class can be found below: Class 1 - Unclassified points; includes non-ground points such as buildings and vegetation. Class 2 - Ground points Class 7 - Noise points; includes all high and low noise points that do not represent legitimate features. Class 9 - Water points Class 10 - Ignored Ground points; includes all ground points that fall within a 1 meter buffer around any hydro breakline feature. Classifying these points aids in the hydro flattened DEM creation. Class 17 - Overlap Unclassified points; Overlap points that represent non-ground features. Class 18 - Overlap Ground points; Overlap points that represent the ground surface. These points were classified based on their x,y and z proximity to the Class 2 ground points. No manual cleanup was performed on these points. All overlap data was processed through automated functionality provided by TerraScan to classify the overlapping flight line data to class. Data was then run through additional macros to ensure deliverable classification levels matching the ASPRS LAS Version 1.2 Classification structure. GeoCue functionality was then used to ensure correct LAS Versioning. In-house software was used as a final QA/QC check to provide LAS Analysis of the delivered tiles. QA/QC checks were performed on a per tile level to verify final classification metrics and full LAS header information.",
            "The NOAA Coastal Services Center (CSC) received the files in las format. The files contained LiDAR elevation and intensity measurements. The data were delivered in UTM Zone 2 projection, NAD83 datum, meters. Data available are classified as follows: Unclassified (1), Ground (2), Low Point (Noise) 7, Water (9), Removed Ground (breakline edge) (10), and Overlap (12). CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The data were converted from UTM Zone 2, NAD83 coordinates to geographic coordinates. 2. The Tutuila (and Aunu'u), Ofu, Olosega, and Tau data were converted from NAVD88 (orthometric) heights to GRS80 (ellipsoid) heights using Geoid09. 3. The Rose Atoll data were converted from MLW to ellipsoid (using MLW correction value of 22.8 m) 4. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2012_AmSamoa_lidar_m2490.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 634231303,
    "recordOffset": 634214909,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2012_AmSamoa_lidar_m2490Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2012 NOAA American Samoa Lidar: Islands of Tutuila, Aunu'u, Ofu, Olosega, Ta'u and Rose Atoll 2013-06-01 1 None 1 North American Datum 1983 2007-01-19 1 Post-Flight Acquisition Report 1 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Citation URL ftp://ftp.csc.noaa.gov/pub/crs/beachmap/qa_docs/as/PhotoScience-AmSam_PostFlightAcquisitionReport_FINAL.pdf 1 NOAA CSC",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}