{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "Rs. 75.00"
        ],
        [
            "To",
            "India",
            "India"
        ],
        [
            "Service",
            "Local Courier - Delivery within seller's city",
            "National Courier - Delivery outside seller's city"
        ]
    ],
    "pageTitle": "New Page 3",
    "title": "",
    "url": "http://www.ebay.in/itm/Mobile-Bluetooth-Camera-Selfie-Remote-Control-IOS-iPhone-iPad-All-Android-Phone-/310920266202?pt=LH_DefaultDomain_203&hash=item48644ac1da",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430618603,
    "recordOffset": 430579503,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 5 or 9 numbers for the ZIP Code. Please enter a valid ZIP Code. Pincode: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- India Change country: Item location: Shipping cost cannot be calculated. Please enter a valid ZIP Code. Contact the seller- opens in a new window or tab and request a shipping method to your location. India, but the seller has not specified Shipping to: India Mumbai, India",
    "textAfterTable": "*Sellers are not responsible for service transit time. Transit times are provided by the carrier, excluding weekends and holidays, and may vary with package origin and destination, particularly during peak periods. Domestic handling time Will usually ship within same business day if paid before 14:00 IST (excludes weekends and holidays). Expected ship time may vary and is based on seller's order cut-off time. Return policy Return policy details Replacement and refund for this product is covered through eBay Guarantee Payment details Payment method Buyer protection on eBay Credit / Debit card and online bank transfer:",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}