{
    "relation": [
        [
            "Category",
            "Israel",
            "Jewish",
            "Hebrew",
            "Holocaust"
        ],
        [
            "Total Sites Tested",
            "332",
            "108",
            "61",
            "36"
        ],
        [
            "Block Rate - All Sites",
            "2%",
            "0%",
            "3%",
            "11%"
        ],
        [
            "Block Rate - Sites Not Categorized by SmartFilter",
            "1%",
            "0%",
            "3%",
            "3%"
        ]
    ],
    "pageTitle": "Internet Filtering in Saudi Arabia in 2004 | OpenNet Initiative",
    "title": "",
    "url": "https://opennet.net/studies/saudi",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00184-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881121903,
    "recordOffset": 881072037,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{165945=6 Arab Media, Saudi Internet Rules (Aug. 1, 2003), at http://www.al-bab.com/media/docs/saudi.htm (reproducing the Council of Ministers Resolution of Feb. 12, 2001)., 187610=75 We note, however, that many other countries do not block the sites on the MEMRI list. ONI attempted to access these sites through servers in Canada, France, Germany, Israel, Japan, and the United States on November 16, 2004. In each case, we were able to access all of the MEMRI sites. Thus, we conclude that none of these countries filtered the MEMRI sites during this testing., 15541=Of course, Saudi citizens might feel uncomfortable asking ISU to stop filtering a site. Users must include an e-mail address to submit such a request, which might dissuade Saudis from requesting that certain sites, especially political ones, be unblocked. In addition, several of ISU's studies indicate that the block and unblock request statistics may not accurately reflect public opinion. A 1999 ISU study found that 45% of users perceived the level of site blocking as \"too much,\" although 14% sought more stringent restrictions and 41% found the filtering level acceptable: 21, 30128=Figure 4 contains the results of the 2004 \"index list\" test, including the number of sites in each category and the percentage blocked for that category. In the index list, categories were defined by the ONI researchers, not by the dmoz classification system., 7285=In contrast, the low blocking rate of sites on gay and lesbian issues, women's rights, politics, extremist groups, most religions, alcohol, and Israel suggests that the Saudi filtering regime does not target this content. Indeed, we observed a slight decrease in blocking of human rights sites from 2002 to 2004. Saudi Arabia seems to filter these topics only when particular sites are brought to the government's attention rather than by taking active steps to find this material and to block access to it., 17748=This report seeks to build upon the 2002 report Documentation of Internet Filtering in Saudi Arabia24 by documenting the types of Web sites unavailable to Saudi citizens, the extent of filtering within certain categories, and the changes in filtering observed over a two-year period. By assessing potential technical and philosophical reasons for filtering particular sites and categories, we hope to gain a preliminary understanding of what content the Saudi government considers to \"violate the tenants [sic] of the Islamic religion or societal norms,\"25 and we seek to explore the apparently unintended consequences of large-scale Web filtering., 84667=The Saudi government actively seeks to block drug-related sites, especially those promoting illegal drug use. In 2004, 86% of the drug sites we tested were blocked. As with pornography, the Saudi ISU staff manually added a number of these sites (25 URLs, representing 17% of locally-blocked pages) to the black list before SmartFilter detected them. Saudi Arabia distinguishes between pro-drug and drug abuse sites fairly well, blocking only 5% of substance abuse sites we tested. We conclude that ISU aggressively seeks to block drug pages, making it difficult to access pro-drug use sites in Saudi Arabia., 20199=In our 2004 testing, we captured new data from the block pages returned by the Saudi filtering system that allowed us to determine whether a Web site was blocked due to its classification by the SmartFilter software or due to independent action by ISU staff, who manually add certain sites to the country's black list. The block pages included an HTML tag, \"ISUTag,\" that either had the value \"sf\" (meaning a block due to a SmartFilter category filtered by the ISU) or \"local\" (meaning a block due to ISU adding the site to the black list manually). We analyzed the relationship between the ISUTag value and the SmartFilter categorization for tested sites. Of the blocked sites where the ISUTag value was \"local,\" only 7% were classified by SmartFilter in categories the Saudis choose to block. However, 60% of sites with an ISUTag value of \"sf\" fell in these categories. While our analysis does not unequivocally demonstrate that all \"sf\" blocks result from SmartFilter categorization, it strongly establishes that \"local\" blocks do not result from the SmartFilter software, but instead derive from independent ISU action., 189137=80 We collected data on the sites' popularity from Alexa in September 2004. See http://www.alexa.com/data/details/main?url=http://www.victoriassecret.com/ and http://www.alexa.com/data/details/main?url=www.bodylingerie.com., 25867=Fourth, we base SmartFilter categorizations on tests run using the SmartFilterWhere tool37 in early July 2004 and repeated in late August 2004. The SmartFilterWhere tool lets users check SmartFilter's current categorization of a URL in three versions (version 4, version 3.x Standard, and version 3.x Premium) of the software. The tool does not allow checking a URL's past categorization; thus, it can be difficult to determine whether a URL's classification has changed over time. SmartFilter categories change frequently; of the roughly 26,000 URLs we checked on both dates, 10% changed between dates through having at least one category added to or removed from the URL. Secure Computing, SmartFilter's developer, claims to update its list daily.38 SmartFilter uses a \"control list\" that includes URLs and categories for as many sites as Secure Computing can analyze. SmartFilter customers create their black lists by choosing which categories, and sites, to block. SmartFilter makes updates to the control list available to customers. Since the ISU loads updates to the control list onto the Saudi servers regularly, we cannot determine how closely the SmartFilterWhere list and categorizations match those used by the Saudi filtering system. However, we assume that SmartFilter locates and corrects erroneously categorized pages as part of updating the control list;39 this causes miscategorized Web pages to be underrepresented since our testing detects only categorization errors that have yet to be corrected., 34953=The ISU filters nearly all well-known gambling sites. In the 2004 index list test, we found 25 of 27 (93%) such sites blocked. Earlier tests, and the 2004 wide list test, did not include gambling sites., 175147=32 One can download data from Open Directory Project's database at http://rdf.dmoz.org/. At last count, the dmoz database includes over 4 million sites in more than 590,000 categories. We downloaded the cited data cited at the beginning of August 2004., 81322=Our research indicates the Saudi government is extremely dedicated to filtering pornographic Web pages - in fact, the ISU is often faster to block porn than the SmartFilter software updates are. This commitment strengthened over the years of our testing; block rates for pornographic sites increased from 86% of URLs tested in 2002 to 98% in 2004. The intensity of the Saudi effort reveals itself in the speed at which ISU identifies and blocks new pornographic content. Frequently, the ISU outpaces SmartFilter's developer, Secure Computing, in identifying these sites, even though Secure Computing is a large public company whose success depends on keeping its black lists current. By contrast, the ISU had only 44 employees as of 2001 to manage all Internet connectivity within Saudi Arabia as well as the filtering system.66, 186641=70 Muhammad Al-Saed, Arab News Reports Saudi Government to Block 200,000 New Internet Sites, Jedda Arab News, Apr. 29, 2001., 83284=Saudi Arabia devotes significant effort to this task and does it quite well. The majority of this type of site we tested had been re-registered between November 2003 and February 2004; all were accessible in either 2002 or 2003, but blocked in July 2004. These sites' previous content included information from record labels, local churches, a \"guide to Jewish people worldwide,\" ethnic newspapers, and the Portugese consulate in Toronto.69 This diverse content was replaced by pornography within 7 months of the domain names' re-registration; this rapid change indicates that pornographic content distributors pursue attractive, expiring domains with dedication and alacrity. Saudi Arabia's efforts to block these sites are consistent with an April 2001 report indicating ISU was \"looking for a mechanism to get immediate information on all sites as soon as they open to screen them for immoral content.\"70 ISU's mechanism may not be immediate, but it is remarkably fast at detecting and filtering new pornographic content. Overall, Saudi Arabia successfully blocks most pornographic Web content, and its rapid detection of new porn demonstrates the Kingdom's commitment to filtering this material., 67447=The commercial software categories that Saudi Arabia chooses to block (macro-level blocking and overblocking) indicate content topics that the country generally finds objectionable, while blocking by specific ISU-added URL (micro-level blocking) demonstrates specific concern about a given site or page. Our 2004 testing obtained data from the block pages generated by the Saudi filtering system that indicates whether a site was blocked due to its SmartFilter categorization or due to specific targeting by Saudi officials.49, 12769=Saudi Arabia targets specific categories of content for blocking. Pursuant to the 2001 Council of Ministers decree, the ISU prohibits \"pornographic web pages... [and] pages related to drugs, bombs, alcohol, gambling, and pages insulting to the Islamic religion or the Saudi laws and regulations.\"12 The ISU identifies pornography as the \"most noteworthy\" topic, claiming that 95% of all blocked pages fall within this category.13 Under the heading \"Usefulness of Filtering,\" the ISU justifies its blocking efforts by citing the Qur'an14 and invoking an American law review article correlating restrictions on pornography with reduced rates of murder and rape.15 However, the justifications do not extend to non-pornographic content; the ISU simply states that \"non-pornographic sites are only blocked based upon direct requests from the security bodies within the government.\"16, 185112=66 Abdullah Ahmed Al-Rasheed, The Internet in Saudi Arabia (Management View) (Apr. 30, 2001), at http://www.isu.net.sa/library/CETEM2001-AlRasheed.pdf., 68016=To explore macro and micro-level blocking, we evaluated 2004 testing data, since this is the only year for which we were able to obtain the necessary block page data and for which we have contemporaneous SmartFilter category data.50, 117984=Saudi Arabia blocks content related to Israel only sporadically. We found three pages on the Israeli Defense Forces site (www.idf.il) blocked in 2002 and 2003, but the block had been lifted in 2004. The Kingdom blocks a significant minority of Holocaust sites, but this occurs primarily due to SmartFilter errors. The majority of blocked Holocaust-related content resulted from SmartFilter categorizing it as ?violence,? or even \"pornography.\"82 ISU blocked only one site locally: a travel site with information on the Anne Frank House. However, www.annefrank.com is accessible. The low blocking rates and lack of local blocking demonstrated that while Saudi Arabia may occasionally block content related to the Holocaust, the Kingdom makes no serious attempt at filtering sites on the state of Israel., 180099=45 Saudi Arabia is primarily a Sunni country. See Library of Congress, Saudi Arabia - A Country Study, at http://lcweb2.loc.gov/frd/cs/satoc.html (last visited Sept. 9, 2004). The United States Department of State notes that the Saudi \"Government enforces a strictly conservative version of Sunni Islam.\" U.S. Department of State, International Religious Freedom Report 2004: Saudi Arabia (Sept. 15, 2004), at http://www.state.gov/g/drl/rls/irf/2004/35507.htm., 64657=Our data indicates that the Saudis originally attempted very broad blocking of several, but not all, free hosting domains. Saudi Arabia removed broad blocking for some sites in 2003 or 2004, shifting to filtering these domains on a page-by-page basis (an approach the ISU has used consistently for Geocities). This method comports with the ISU's stated policy of blocking \"only the absolute minimum possible number of web pages possible to fulfill its duties.\"47 Thus, while Saudi Arabia filters many free Web hosting sites, the granularity of its blocking has become more precise and targeted with time., 177685=40 This finding accords with the 2002 ONI testing results. See Zittrain & Edelman, Documentation of Internet Filtering in Saudi Arabia (noting that \"Pages were blocked from Yahoo categories that suggest the display of images of people wearing less clothes than is typical in Saudi Arabia,\" including \"28 pages... from Yahoo's Swimming & Diving category\")., 82229=In 2004, 18 of 148 pages (12%) blocked locally by the ISU contained pornographic content. Of these pages, only 2 had been categorized by SmartFilter as pornography by August 2004. Reviewing these pages demonstrates the extraordinary difficulty facing any government or organization that wants to block pornography completely. Previous research67 demonstrates that pornographic Web sites monitor domain name registries for expiring registrations; they purchase these domains once they expire and place pornographic content on their pages. Unlike the situation the prior research, where the co-opted domain redirected users to another pornographic site (which might already be included on a black list), the pages we investigated displayed the pornographic content at the new domain name - the owners had copied the material to the new domain.68 Thus, blocking all Internet pornography requires constant surveillance of expiring and expired domains., 181024=49 Our 2004 testing retrieved information from the block page indicating whether the HTML tag \"ISUTag\" in the page had the value \"sf\" (meaning a block due to a SmartFilter category filtered by the ISU) or \"local\" (meaning a block due to ISU adding the site to the black list manually)., 177222=39 See Seth Finkelstein, SmartFilter stupidity - Christian sites as SEX, at http://sethf.com/anticensorware/smartfilter/damage3.php (last visited Sept. 9, 2004). Finkelstein provides examples of 6 Christian sites categorized as \"sex\" by SmartFilter on July 17, 2002, and notes that all 6 were corrected in September 2002., 174261=29 In 2002, we tested sites between 1 and 10 times; 84% of blocked URLs were tested either 5 or 6 times. In 2003, we tested each URL using 11 different proxies. In 2004, we tested each URL using between 8 and 14 proxies., 172958=28 We successfully accessed the majority of the pages (93% in 2003 and 91% in 2004) from our control location (the server returned the HTTP response code 200). In some cases, the response from the control and Saudi locations differed. For example, if we requested a file that no longer existed on a blocked site, the control location received an HTTP error code such as \"404 - file not found\". Since the Saudi filters block requests on their black list without attempting to access the prohibited page, the Saudi proxy server would in this case return a block page rather than an error. For example, if Saudi Arabia blocked any page in the domain \"http://cyber.law.harvard.edu,\" a request for a Web page in this domain that did not exist, such as http://cyber.law.harvard.edu/NONEXISTENTPAGE, would return an HTTP 404 error code from the control location, but a block page from the Saudi proxy server. Thus, counting this type of response as a block is not accurate, since Saudi Arabia blocks the domain regardless of how many Web pages are contained within in, and counting a non-existent page would overstate the true extent of filtering., 21948=In addition to the wide list, we tested several smaller, more targeted lists. In 2002, we tested an additional 795 pornographic sites. In 2004, we tested an \"index list\" designed to provide an overview of a country's filtering efforts; it included 740 sites divided into 30 categories. These categories were developed by the ONI researchers rather than using the Open Directory Project (known as \"dmoz\") classification system. (Dmoz constructed a massive taxonomy of Internet content and utilizes volunteer editors to maintain lists of the most useful and content-rich sites within each category.32) We also tested 21 Islamist sites compiled by the Middle East Media Research Institute (MEMRI) in 2004 to examine whether Saudi Arabia tries to block certain extremist groups. 31, 183958=58 On Sept. 10, 2004, Google stated on its home page, http://www.google.com, that the engine searched 4,285,199,774 Web pages., 174512=30 These results include sites blocked in more then 50%, but less than 90%, of our tests. Sites that were occasionally blocked and occasionally accessible formed 7% of our results in 2002, 5% in 2003, and 10% in 2004., 99314=Saudi Arabia blocks locally most sites in two free hosting domains, virgin.net and erols.com. (See Figure 16.) However, it does not block extensively many other free Web sites such as Geocities. Saudi Arabia's blocking in this area shifts drastically over time - in 2002, the ISU blocked 92% of mindspring.com sites and 90% of compuserve.com sites, but in 2004, none of the pages in these domains were filtered. Some sites we found blocked locally did not meet known ISU blocking criteria -- for example, one site was entitled \"Jefferson Airplane Loves You,\" and another allowed users to search popular quotes. Some domains, such as members.aol.com and geocities.com, are blocked only on a page-by-page basis. This arbitrary approach may indicate the ISU blocks currently popular free Web hosts - or hosts to which forbidden content has migrated - but normally permits access to most pages on these sites. We believe further research is needed to explain this filtering pattern for free Web hosting domains., 5546=We selected roughly 60,000 Web addresses in 2002, 2003, and 2004 to discover what content Saudi Arabia blocks and attempted to access those Web addresses as if using the Internet within Saudi Arabia. In 2004, we also tested two different lists of Web pages: one list broadly covers sensitive material, and one list focuses on an index of prominent sites in important categories such as politics, religion, and human rights. Our tests in 2004 also recorded whether a site is apparently blocked because of its presence on SmartFilter's list or because the ISU itself added the page to the block list., 16713=Moreover, 16% of respondents in a 2002 study mentioned government filtering as a common problem they encountered while using the Internet.22 Saudi citizens also express dissatisfaction with filtering through their spending patterns. Demand for blocked content has created a new market; a Jedda Arab News report describes individuals \"within every computer center in Riyadh\" willing to provide access to blocked sites at rates of 100 to 250 Saudi Riyals per site ($26 - $67 US).23 To complain about overblocking or to pay a computer expert to circumvent filtering, though, a Saudi user must know about desirable content that is blocked - they must have some intuition about the site that they cannot access., 170051=18 Mirza Al-Khuwailadi, Saudi Internet Official Notes 500 Requests Made Daily to Block Sites, Jedda Arab News, Mar. 30, 2001., 166741=8 KACST describes itself as \"an independent scientific organization of the Saudi Arabian Government, established in 1977.\" King Abdulaziz City for Science & Technology, About KACST, at http://www.kacst.edu.sa/en/about.asp. The ISU believes \"Filtering is too complex to be left for ISPs.\" Internet Services Unit, Internet Future (Oct. 18, 2000), at http://www.isu.net.sa/library/internet_future.PDF., 165286=2 Seymour E. Goodman et al., The Global Diffusion of the Internet Project: An Initial Inductive Study 210-11 (Mar. 1998), The Mosaic Group, at http://mosaic.unomaha.edu/GDI1998/7HSAUDI.PDF., 40459=The 2002 ONI testing also found some blocking of women's sites, including two categorized as women's health, one classified as female sexuality, and one categorized as related to women as a cultural group.43 Of the four sites blocked in 2002, three (women.eb.com, ivillage.com, and skirtmag.com) were not blocked in our testing. The fourth, teenwire.com, remains blocked, probably because it is categorized by SmartFilter as \"mature\" and containing \"sexual materials.\", 85384=Saudi Arabia heavily blocks gambling sites and relies on SmartFilter to do so. We tested a short list of gambling sites in 2004 and found 93% of these pages blocked, all by SmartFilter. We did not find local blocking of gambling sites, indicating satisfaction with SmartFilter's success rate or a slightly lower degree of concern with gambling than with drugs or pornography., 14653=How effective such user suggestions are is unknown independently, though Saudi officials have offered statistics on such requests to block and unblock Web sites to argue that filtering enjoys broad support. Earlier this year, the ISU's director reported the unit receives 200 requests each day to block currently accessible sites, but only a \"trickle\" of requests to restore access to blocked sites.17 In 2001, a Saudi official reported 500 block requests and 100 unblock requests daily,18 with 30% of the block requests and 3% of the unblock requests resulting in the addition or removal of a site from the list.19 The ISU director presented this ratio of block to unblock requests as demonstrating \"wide public support\" for filtering.20, 37060=The ISU does not filter sites related to alcohol. In the 2004 index list test, we found only 1 of 21 (5%) alcohol sites blocked. The wide list testing, and earlier tests, did not include alcohol-related sites., 165687=5 The Mosaic Group, Up-date: The Internet in the Kingdom of Saudi Arabia 1 (Feb. 1999) at http://mosaic.unomaha.edu/SaudiArabia_1999.pdf., 85910=Saudi Arabia protects its Internet filtering by blocking access to tools that provide users with prohibited content. Filtering regimes must disable access to circumvention methods, such as alternative Web proxy servers, to succeed. The ISU understands this potential weakness, as internal presentations from 2001 demonstrate: \"Once KACST knows the address of [public] proxies they get added to the black list.\"71 We found 21 blocked anonymizer and encryptions sites; all were added to the black list locally by the ISU.72 Saudi Arabia clearly understands the risk circumvention tools pose to filtering and acts to prevent it., 17568=This section describes the goals for our 2004 study of Saudi Arabia's Internet filtering and how we conducted our research., 169757=17 Robin Miller, Meet Saudi Arabia's most famous computer expert, Newsforge, Jan. 14, 2004, at http://internet.newsforge.com/article.pl?sid=04/01/12/2147220., 170582=21 Internet Services Unit, The Old User Survey results, at http://www.isu.net.sa/surveys-&-statistics/user-survey.htm (last visited Sept. 7, 2004) (reporting an on-line survey of 260 users from July through September 1999)., 8984=Saudi Arabia only permitted its citizens public access to the Internet once the state felt confident it could control the content users could access. Strong Internet filtering was a prerequisite for Internet deployment in the Kingdom. Saudi Arabia established an Internet link for government use in 1994, but delayed wider availability for the next three years while the government debated the benefits, drawbacks, and logistical requirements of public access2. Although worried about the \"availability of pornographic material... [and] anti-government propaganda\" and \"the potential for proselytization of Saudi Muslims by foreign religions via the Web,\"3 the Saudi government ultimately decided to allow public access, provided the country could create a state-wide firewall to \"reduce the potential for [citizens] to access inappropriate information.\"4 Public access finally debuted in 1999 -- over three years later than in most Persian Gulf states.5 Saudi Arabia's Council of Ministers issued a decree in 2001 regulating Internet use that prohibits users from accessing or publishing certain forbidden content.6 As of the end of 2003, 1.6 million Saudis were counted as Internet users, out of a population of over 21 million.7, 169276=15 Id. The cited article is apparently Cass Sunstein, Pornography & the First Amendment, 1986 Duke L. J. 589 (1986)., 25344=Third, the dmoz categories contain inherent limits. We downloaded category data from dmoz in August 2004, so certain pages' content may have changed sufficiently since then to affect their categorization. Dmoz listings contained only 39% of pages we tested, creating a lower block percentage for dmoz-listed sites than for sites overall. This low inclusion rate likely reflects lesser dmoz interest in classifying certain areas of interest to Saudi Arabia, such as pornography. 36, 171315=23 Jameel Al-Balawi, Hackers in Riyadh Reportedly Offer Access to Government Blocked Sites, E-Mail, Jedda Arab News, Nov. 3, 2001. While the article does not indicate how these individuals access filtered material, they likely employ open proxy servers. An open proxy server is \"a server outside the kingdom [of Saudi Arabia] that users in the kingdom can use to reach blocked sites.\" Al-Zoman, The Internet in Saudi Arabia (Technical View) 26.The use of open proxies is no surprise to the ISU, whose director \"knows that anyone with much knowledge of the Internet and computers can blow right by the Saudi content filters\" and who \"sees the filtering as a way to protect children and other innocents from Internet evils, and not much more than that.\" Miller, Meet Saudi Arabia's most famous computer expert., 19621=In December 2003 and July 2004, we tested pages from the wide list using a similar methodology, but without explicit ISU permission.27 We considered a page \"blocked\" in Saudi Arabia when the majority of our attempts to reach it returned a block page. (See Appendix 1 for an example of a block page.) We did not consider a page blocked if we received a non-block page response from the Saudi server, but that response differed from the one we received at our control location in Toronto, Canada.28, 170215=19 Abdulaziz Hamad Al-Zoman, The Internet in Saudi Arabia (Technical View) (Apr. 30, 2001), at http://www.isu.net.sa/library/CETEM2001-Zoman.pdf., 185392=67 Ben Edelman, Domains Reregistered for Distribution of Unrelated Content: A Case Study of \"Tina's Free Live Webcam\" (Feb. 18, 2003), at http://cyber.law.harvard.edu/people/edelman/renewals/., 18534=The OpenNet Initiative (ONI) has conducted three rounds of testing of Saudi Arabia's Internet filtering system.26 The first testing occurred in May 2002 with the permission and cooperation of ISU staff. We created a list of over 60,000 URLs (Uniform Resource Locators, such as cyber.law.harvard.edu) by targeting the most popular results from queries to the Google and Yahoo! search engines for sensitive content, including such topics as the Israel/Palestine conflict, human rights abuses within Saudi Arabia, the 1991 Iraq war, drugs, terrorism, Judaism, and higher education. (We refer to this list as the \"wide list.\") We attempted to access Web pages on the wide list from proxy servers located within Saudi Arabia and from a control location in Cambridge, Massachusetts, in the United States. Since all such requests from within the Kingdom pass through a central array of servers, our proxy server requests were subject to the government's filtering, allowing us to determine which pages were accessible and which were blocked., 183161=56 See, e.g., Seth Finkelstein, SmartFilter - I've Got A Little List (Dec. 7, 2000), at http://www.sethf.com/anticensorware/smartfilter/gotalist.php; Ben Edelman, Sites Blocked by Internet Filtering Programs (Feb. 12, 2003), at http://cyber.law.harvard.edu/people/edelman/mul-v-us/., 104534=We conclude Saudi Arabia does not block this SmartFilter category. While the Kingdom may want to avoid blocking sites on vegetarianism and nudists, we believe instead that the ISU does not seek to filter all of these sites. Our analysis is supported by a Reporters Without Borders report describing how the ISU granted their request to unblock two gay sites, which stated \"The head of the ISU... replied on 29 March : 'After receiving your letter, a re-examination of these sites was carried out. As no pornographic content was found, the blocking was lifted.'\"79 Saudi Arabia's above-average rate of blocking gay, lesbian, and bisexual sites may indicate some interest in filtering such content, or at least less vigilance in correcting overblocking in this area., 174761=31 Marie-Helene Boccara, Islamist Websites and Their Hosts Part I: Islamist Terror Organizations, Middle East Media Research Institute, at http://www.memri.org/bin/articles.cgi?Page=archives&Area=sr&ID=SR3104 (July 16, 2004)., 50956=Figure 1546, 166226=7 Reporters Without Borders, The Internet Under Surveillance 99 (2003), at http://www.rsf.fr/IMG/pdf/doc-2236.pdf. The ISU states that at the end of 2003, the country had 1,462,000 Internet subscribers. Internet Services Unit, Frequently Asked Questions, at http://www.isu.net.sa/faqs/faqs.htm (last visited Sept. 7, 2004).}",
    "lastModified": "Mon, 03 Aug 2015 10:35:30 GMT",
    "textBeforeTable": "Saudi Arabia blocks some Web sites of organizations that oppose the country's government. The ISU selects these sites to block locally since there is no applicable SmartFilter category. Blocked sites include: c. Political Opposition Figure 20 Blocked Blocked Blocked http://www.naqshbandi.org (3 pages tested) Blocked Blocked Blocked http://www.al-shia.com Blocked n/a Blocked http://www.shialink.org Blocked Blocked Blocked http://www.muhammadanism.org 2004 2003 2002 Site Site Status Saudi Arabia locally blocks some Web sites related to non-Sunni sects of Islam such as Salafism, Shia, and Sufism. We found several sites blocked locally in this category, including several Shia sites: b. Non-Sunni Islam Saudi Arabia frequently blocks Bahai sites, and at a far greater rate than other religious sites, but its filtering concentrates only on two domains, indicating the ISU does not focus on this area. 12% of the 50 Bahai sites we tested were filtered. These sites were blocked during each year of our tests. There is no evidence SmartFilter erroneously classified these sites, eliminating overblocking as an explanation. However, all blocks are on the domains bahai.org and bahai.com and pages hosted on them, while other Bahai domains remain unblocked. For example, the sites bahai-library.org, www.bahai-faith.org, and www.bahaiworldnews.org are not blocked. We believe the ISU blocks",
    "textAfterTable": "Category Total Sites Tested Block Rate - All Sites Block Rate - Sites Not Categorized by SmartFilter76 Top/Issues/../Terrorism 24 8% 0% MEMRI list of Islamist Web sites77 21 29% 24% Figure 22 e. Free Web Hosting Saudi Arabia blocks locally most sites in two free hosting domains, virgin.net and erols.com. (See Figure 16.) However, it does not block extensively many other free Web sites such as Geocities. Saudi Arabia's blocking in this area shifts drastically over time - in 2002, the ISU blocked 92% of mindspring.com sites and 90% of compuserve.com sites, but in 2004, none of the pages in these domains were filtered. Some sites we found blocked locally did not meet known ISU blocking criteria -- for example, one site was entitled \"Jefferson Airplane Loves You,\" and another allowed users to search popular quotes. Some domains, such as members.aol.com and geocities.com, are blocked only on a page-by-page basis. This arbitrary approach may indicate the ISU blocks currently popular free Web hosts - or hosts to which forbidden content has migrated - but normally permits access to most pages on these sites. We believe further research is needed to explain this filtering pattern for free Web hosting domains. f. Other Sexual Content Saudi Arabia widely blocks sites containing sexual, but not pornographic, content. However, the Kingdom does not seek to block sex education",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}