{
    "relation": [
        [
            "Release",
            "15.0(1)M",
            "12.2 (33)SXI"
        ],
        [
            "Modification",
            "This command was introduced in a release earlier than Cisco IOS Release 15.0(1)M.",
            "This command was integrated into a release earlier than Cisco IOS Release 12.2(33)SXI."
        ]
    ],
    "pageTitle": "Cisco IOS Configuration Fundamentals Command Reference - show protocols through showmon [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/fundamentals/command/cf_command_ref/show_protocols_through_showmon.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 370293359,
    "recordOffset": 370201773,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1898=This command was introduced on the Cisco ASR 1000 Series Routers and the following enhancements were introduced:, 1665=This command was introduced in diagnostic mode. The command can be entered in both privileged EXEC and diagnostic mode on the Cisco ASR 1000 Series Routers., 25681=The following sample output from the show reload command shows that a reload is schedule for 12:00 a.m. (midnight) on Saturday, April 20:, 1043=The command was modified on Cisco 1800 series routers. The output of the command was modified to let you know that the upgradable ROMMON version is not visible due to the license activity and reload is required.}",
    "TableContextTimeStampAfterTable": "{458533=In most cases, the show version provisioned and show version committed output will display the same information, since the provisioned and committed packages sets include the same packages. The provisioned package set may differ from the committed package set in cases where a software install operation was performed with the auto-rollback command option, and the software commit command has not yet been entered. This is the case in the sample output below, where the packages from the 03.09.19.EMP were installed with the auto-rollback command option, but the 'software commit' command has not yet been entered., 396502=Entering show versionwithout any of the options on the Cisco ASR 1000 Series Router will generate output similar to show version on other Cisco routers., 328246=This command was integrated into Cisco IOS XE Release 2.1 on the Cisco ASR 1000 Series Aggregation Services Router., 385834=This command was introduced on the Cisco ASR 1000 Series Routers, and the following enhancements were introduced:, 383475=12.3BC, 419526=The 2500, 2600, 3600, and 7200 series routers require a minimum amount of I/O memory to support certain interface processors., 3835=In the following example, the ROMMON image in RP 0 of a Cisco ASR 1006 router is verified using the show rom-monitor command:, 420648=Configuration register is 0x2142 (will be 0x2102 at next reload), 412011=System returned to ROM by reload at 20:56:53 UTC Tue Nov 4 2003, 418289=The amount of “shared memory” used for packet buffering. In the shared memory scheme (Cisco 2500, 2600, 3600, and 7200 Series), a percentage of DRAM is used for packet buffering by the router's network interfaces., 378707=Specifies the software of the RP in a specific RP slot of a Cisco ASR 1000 Series Router. Options include:, 421695=The factory-default setting for the configuration register is 0x2102. This value indicates that the router will attempt to load a Cisco IOS software image from Flash memory and load the startup configuration file., 381516=User EXEC (>) Privileged EXEC (#) Diagnostic (diag)--Cisco ASR 1000 Series Routers only, 383580=This command was integrated into Cisco IOS Release 12.3BC., 437554=In the following example, the command is entered on a Cisco ASR 1000 Series Router in diagnostic mode. Note that the output shows what every file that can be found in the consolidated package is or is not currently running (provisioning file, RP Access, RP Base, RP Control, RP IOS, ESP Base, SIP Base, SIP SPA)., 419661=The 1600, 2500, 2600, 3600, and 7200 series routers use a fraction of DRAM as Packet memory, so you need to add both numbers to find out the real amount of DRAM. In the example to the left for the Cisco 3660, the router has 57,344 kilobytes (KB) of free DRAM and 8,192 KB dedicated to Packet memory. Adding the two numbers together gives you 57,344K + 8,192K = 65,536K, or 64 megabytes (MB) of DRAM., 396832=In order to understand the show versionoutput on Cisco ASR 1000 Series Routers, it is important to understand that the individual sub-packages run the processes on the router. Among other things, the output of this command provides information on where various individual sub-packages are stored on the router, and which processes these individual sub-packages are and are not currently running., 396431=Cisco ASR 1000 Series Routers, 244=On Cisco 1800 series routers, the show rom-monitor command does not show the version of the upgradable ROMMON. To view the version of the upgradable ROMMON, you may need to reload the router while using the upgradable ROMMON image. If you are using the read-only ROMMON, then the upgradable ROMMON disappears. You need to run the upgrade rom-monitor file command for the upgradable ROMMON. Otherwise, the upgrade rom-monitor preference upgrade command is rejected with the message “No Upgrade ROMMON present, cannot select it.” During ROMMON bootup, if you are running upgradable ROMMON, then the ROMMON first displays the read-only ROMMON message, “Running new upgrade for first time.” This message is followed by the upgradable ROMMON message., 162823=This command was introduced for the Cisco 1941, 2900, and 3900 routers., 414940=unexpected value--May indicate a bus error, such as for an attempt to access a nonexistent address (for example, “System restarted by bus error at PC 0xC4CA, address 0x210C0C0”).}",
    "textBeforeTable": "Syntax Description interface-number ] [ interface-name protocols show To display the configured protocols, use the show protocols command in user EXEC or privileged EXEC mode. show protocols show protocols through showmon show protocols through showmon show protocols through showmon showmon show whoami show wiretap show warm-reboot show version show usbtoken show usb tree show usb port show usb driver show usb device show usb controllers show template show tech-support show system jumbomtu show sup-bootflash show subsys show startup-config show stacks show software installer rollback-timer show software package show software authenticity running show software authenticity keys show software",
    "textAfterTable": "Container --Container interface CTunnel --CTunnel interface Dialer --Dialer interface Ethernet --Institute of Electriacl Electronics Engineers (IEEE) 802.3 FastEthernet --FastEthernet IEEE 802.3 EsconPhy --ESCON interface fcpa --Fiber Channel Filter --Filter interface multiservice --Multiservice interface Pos-channel --POS Channel interfaces SBC --Session Border Controller SYSCLOCK --Telecom-Bus Clock Controller Tunnel --Tunnel interface Vif --PGM Multicast Host interface Virtual-Access --Virtual access interface Virtual-PPP --Virtual PPP",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}