{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-24891",
            "0651-AC98",
            "PTO-P-2014-0045"
        ]
    ],
    "pageTitle": "37 CFR Part 1 - RULES OF PRACTICE IN PATENT CASES | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/37/part-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916086383,
    "recordOffset": 916066765,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1047=Title 37 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{31879=The United States Patent and Trademark (Office) is revising the rules of practice to change the phrase Express Mail or EXPRESS MAIL® to Priority Mail Express® due to the United States Postal Service (USPS) renaming Express Mail® to Priority Mail Express® on July 28, 2013, and to make other changes to conform the nomenclature used in the rules of practice to the current nomenclature used by the USPS., 26186=The Leahy-Smith America Invents Act includes provisions for prioritized examination of patent applications (also referred to as “Track I”), which have been implemented by the United States Patent and Trademark Office (Office) in previous rulemakings. The Office published an interim rule on March 5, 2014 (prioritized examination interim rule), to simplify the Track I prioritized examination practice to reduce the number of requests for prioritized examination that must be dismissed. In order to enable rapid processing and examination of those applications, the previous rulemakings provided that a request for Track I prioritized examination requires, upon filing of the application, an inventor's oath or declaration and all required fees, and that the application contain no more than four independent claims, thirty total claims, and no multiple dependent claims. If a request for Track I prioritized examination failed to meet these requirements on filing, then the request was dismissed. After operating under the previous rulemakings for some time, the Office determined that the time period for meeting the identified requirements could be expanded and still enable the Office to timely examine the patent application. Hence, on March 5, 2014, the Office published the prioritized examination interim rule to expand the time period for meeting the identified requirements. The Office received no comments from the public in response. This final rule adopts as final the amendments to the rules of practice originally set forth in the prioritized examination interim rule., 20582=The Leahy-Smith America Invents Act (AIA) revised and streamlined the requirements for the inventor's oath or declaration. In implementing the AIA inventor's oath or declaration provisions, the United States Patent and Trademark Office (Office) provided that an applicant may postpone the filing of the inventor's oath or declaration until allowance if the applicant provides an application data sheet indicating the name, residence, and mailing address of each inventor. The rules pertaining to continued prosecution applications (which are applicable only to design applications) require that the prior nonprovisional application of a continued prosecution application be complete, which requires that the prior nonprovisional application contain the inventor's oath or declaration. The Office published an interim rule on March 5, 2014, to revise the rules pertaining to continued prosecution applications to permit the filing of a continued prosecution application even if the prior nonprovisional application does not contain the inventor's oath or declaration so long as the continued prosecution application is filed on or after September 16, 2012, and the prior nonprovisional application contains an application data sheet indicating the name, residence, and mailing address of each inventor (continued prosecution application interim rule). The Office received no comments from the public in response to the continued prosecution application interim rule published on March 5, 2014. This final rule adopts as final the amendments to the rules of practice originally set forth in the continued prosecution application interim rule., 34211=Title 37 published on 2014-07-01, 15442=The United States Patent and Trademark Office (USPTO or Office) has prepared interim guidance (2014 Interim Guidance on Patent Subject Matter Eligibility, called “Interim Eligibility Guidance”) for use by USPTO personnel in determining subject matter eligibility under 35 U.S.C. 101 in view of recent decisions by the U.S. Supreme Court (Supreme Court). This Interim Eligibility Guidance supplements the June 25, 2014, Preliminary Examination Instructions in view of the Supreme Court decision in Alice Corp. (June 2014 Preliminary Instructions) and supersedes the March 4, 2014, Procedure For Subject Matter Eligibility Analysis Of Claims Reciting Or Involving Laws Of Nature/Natural Principles, Natural Phenomena, And/Or Natural Products (March 2014 Procedure) issued in view of the Supreme Court decisions in Myriad and Mayo. The USPTO is seeking public comment on this Interim Eligibility Guidance along with additional suggestions on claim examples for explanatory example sets., 3484=Title I of the Patent Law Treaties Implementation Act of 2012 (“PLTIA”) amends the United States patent laws to implement the provisions of the Geneva Act of the Hague Agreement Concerning the International Registration of Industrial Designs, July 2, 1999, (hereinafter “Hague Agreement”) and is to take effect on the entry into force of the Hague Agreement with respect to the United States. Under the Hague Agreement, qualified applicants may apply for design protection in the Contracting Parties to the Hague Agreement by filing a single, standardized international design application in a single language. The United States Patent and Trademark Office is revising the rules of practice to implement title I of the PLTIA.}",
    "lastModified": "Thu, 04 Jun 2015 11:59:17 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 17918 - Changes To Implement the Hague Agreement Concerning International Registration of Industrial Designs 2015-04-02; vol. 80 # 63 - Thursday, April 2, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 37. Title 37 published on 2014-07-01. 68 FR 143351 1.1 , Mar. 25, 2003. , see 2. For nomenclature changes to part to 1.352 and the numbers to the right of the decimal point correspond with the respective rule numbers. 1. In Patent and Trademark Office publications and usage the part number is omitted from the numbers of §§ Editorial Notes: 24 FR 10332, Dec. 22, 1959, unless otherwise noted. Source:",
    "textAfterTable": "DEPARTMENT OF COMMERCE, United States Patent and Trademark Office Final rule. Effective date: The changes in this final rule take effect on May 13, 2015. Applicability date: The changes to 37 CFR 1.32, 1.46, 1.63, 1.76, and 1.175 in this final rule apply only to patent applications filed under 35 U.S.C. 111, 363, or 385 on or after September 16, 2012. The changes to 37 CFR 1.53(b) and (c) and 1.57(a)(4) in this final rule apply only to patent applications filed under 35 U.S.C. 111 on or after December 18, 2013. 37 CFR Parts 1, 3, 5, 11, and 41 Summary Title I of the Patent Law Treaties Implementation Act of 2012 (“PLTIA”) amends the United States patent laws to implement the provisions of the Geneva Act of the Hague Agreement Concerning the International Registration of Industrial Designs, July 2, 1999, (hereinafter “Hague Agreement”) and is to take effect on the entry into force of the Hague Agreement with respect to the United States. Under the Hague Agreement, qualified applicants may apply for design protection in the Contracting Parties to the Hague Agreement by filing a single, standardized international design application in a single language. The United States Patent and Trademark Office is revising the rules of practice to implement title I of the PLTIA.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}