{
    "relation": [
        [
            "Version",
            "7.x-1.2",
            "6.x-1.3-alpha1"
        ],
        [
            "Download",
            "tar.gz (8.78 KB) | zip (9.77 KB)",
            "tar.gz (9.39 KB) | zip (10.27 KB)"
        ],
        [
            "Date",
            "2011-May-02",
            "2013-May-09"
        ],
        [
            "Links",
            "Notes",
            "Notes"
        ]
    ],
    "pageTitle": "Module project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_module?f[2]=im_vid_3%3A7404",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916314139,
    "recordOffset": 916282736,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{26335=Since our documentation is somewhat lacking on drupal.org, you can watch this for a 1 hour overview of what services is and what it does. http://denver2012.drupal.org/program/sessions/services-inside-and-out If for some reason that site is down, the video can be found here http://www.youtube.com/watch?v=6-2kw7iXf1U}",
    "lastModified": "Mon, 03 Aug 2015 11:40:22 GMT",
    "textBeforeTable": "Recommended releases Downloads jQuery Easing plugin (note that the file has to be renamed to jquery.easing.js before being uploaded to sites/all/libraries/easing) Libraries module Recommended additions: For jQuery 1.9 and above you should either manually include the jQuery $.Browser plugin, via your theme .info file for example, or use the latest development release with the master branch of the Superfish library, which checks $.browser before using it. (Note the superfish.js for Drupal 8 won't include the IE6\\7 hack hence no $.browser trouble!) Drupal 7 users: jQuery 1.6.1 or higher, only if you want to use the jQuery Easing plugin animation effects. Drupal 6 users: jQuery 1.3.x or higher. (sfTouchscreen in the Master branch of the Superfish library requires at least jQuery 1.4.) jQuery Update Download Superfish library master branch for the latest development release. Download Superfish library 1.x for the latest stable release. Superfish library Requirements: And a whole lot more... Plenty of built-in options for designers. RTL (Right-to-left) language support. Window width (client-side) and UA string (client-side and server-side) detection for touch and small screen plugins (no CSS3 media-queries) Small-screen compatible. (<select> and vertical accordions) Touch-screen compatible. (almost) Automatic sub-menu width calculation (Supersubs plugin), automatic sub-menu placement (Supposition plugin; prevents sub-menus from appearing off-screen.) Automatic width calculation (sfAutomaticWidth plugin) (Use the development release)",
    "textAfterTable": "Development releases Version Download Date Links 7.x-1.x-dev tar.gz (30.75 KB) | zip (33.7 KB) 2014-Jul-05 Notes 6.x-1.x-dev tar.gz (28.28 KB) | zip (31.31 KB) 2014-Jul-05 Notes View all releases Read more about Superfish ⋅ Categories: Actively maintained, Under active development, Drush, JavaScript Utilities, Mobile, Site Navigation, Theme Enhancements, Utility Flex Slider Posted by ryanwebpage on October 20, 2011 at 9:32pm",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}