{
    "relation": [
        [
            "Sl.No",
            "",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "6.",
            "7.",
            "8.",
            "9.",
            "10.",
            "11.",
            "12.",
            "13.",
            "14.",
            "15.",
            "16.",
            "17.",
            "18."
        ],
        [
            "Particulars",
            "",
            "District industries centre, Coimbatore",
            "Tamilnadu industrial investment corporations",
            "Tamilnadu government",
            "Tamilnadu industrial development corporation",
            "Industrial And Technical Consultancy Organization Of Tamilnadu Limited",
            "Tamilnadu Small Industries Development Corporation Limited",
            "Tamil Nadu Small Industries Corporation Ltd",
            "National Bank for Agricultural and Rural Development",
            "Indian market data",
            "Indian traders market",
            "Indian market",
            "Indian industries",
            "Indian traders",
            "Indian exporters",
            "Potentiality of district",
            "Agricultural rural industries in India",
            "Indian business",
            "Agricultural marketing in India"
        ],
        [
            "Website Address",
            "",
            "http://diccoimbatore.com/functions.html",
            "http://tiic.org",
            "http://www.tn.gov.in",
            "http://www.tidco.com/goi.html",
            "http://www.itcot.com",
            "http://www.sidco.tn.gov.in",
            "http://www.tansi.com",
            "http://www.nabard.org",
            "http://www.indiandata.com",
            "http://www.trademart.in",
            "http://dir.indiamart.com",
            "http://www.indianindustry.com",
            "http://www.tradeindia.com",
            "http://www.exportersindia.com",
            "http://www.laghu-udyog.com",
            "http://ari.nic.in",
            "http://business.mapsofindia.com",
            "http://agmarknet.nic.in"
        ]
    ],
    "pageTitle": "Marketing",
    "title": "",
    "url": "http://agritech.tnau.ac.in/expert_system/paddy/marketingmanagement.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00028-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 3580467,
    "recordOffset": 3558660,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16276=Address to contact: Karnataka Food & Civil Supplies Corporation. Ltd 16/1, Ahara Bhavan, Miller Bund Area, Vasanth Nagar, Bengaluru, Karnataka 560052 Contact no: 080 2226 0932 ‎, 59552=The Codex Alimentarius Commission, established by FAO and WHO in 1963 develops harmonised international food standards, guidelines and codes of practice to protect the health of the consumers and ensure fair trade practices in the food trade. The Commission also promotes coordination of all food standards work undertaken by international governmental and non-governmental organizations., 56818=Caro Impex Exporters of basmati rice, 1121 basmati rice, long grain basmati rice, premium basmati rice, pusa basmati rice, super basmati rice. Business Type : Exporters / Manufacturer / Wholesale Suppliers Address: 1, Jaycee Flats , Balaji Nagar 1st Street, Nanganallur, Chennai, Tamil Nadu India Website : http://www.caroimpex.com, 53065=Hardcore Corporation Exporters of rice, basmati rice, non basmati rice, masoori rice. Address: Hardcore Corporation, Office No. 4, Chordiya Sankul, Nasik Road, Nasik- 422101 India Website : http://www.hcagroexports.com}",
    "lastModified": "Wed, 13 May 2015 15:21:21 GMT",
    "textBeforeTable": "Agricultural Marketing-Web links A country wide common four digit number 1551 has been allocated to these centers. (New Delhi, Mumbai, Chennai, Kolkata, Hyderabad, Banglore, Chandigarh and Luknow) These centers will operate through toll free telecom lines throughout the country. Provides expert advise to the farmers.   Kisan Call Centers   Arrange or organise seminars, workshops or exhibitions on subjects relating to agricultural marketing and farmers training programme on various aspects of agricultural marketing.  Some of the SAMBs are also promoting agro-business. Provides marketing related information to co-ordinate all the market committees in the state. Eliminate malpractices in the marketing system. Provide aid to financially weak or needy market committees in the form of loans and grants. To co-ordinate all the market committees for information services. Provide grading of agricultural produce in the markets. Provide infra-structural facilities for the marketing of notified agricultural produce. Implementation of the regulation of marketing in the state. State   Agricultural Marketing Boards",
    "textAfterTable": "Top Marketing-DO'S and DONT'S DO'S Harvest the paddy at proper time of maturity. Dry paddy in sheds for optimum time period. Threshing and winnowing on cemented (Pucca) floor. Market the paddy/rice after grading to get higher return. Get the market information regularly from www.agmarknet.nic.in website, newspaper, T.V., concerned APMC offices etc. before marketing the produce. Avail the facility of futures trading and forward contracts to avoid price risk arising due to wide fluctuation in rice prices. Take the benefits of contract marketing to insure better price of the produce. Store the paddy/rice during post harvest period and sell it when prices are favourable. Avail the facility of Price Support Scheme during glut situation. Use effective, efficient and proper post harvest technology and processing techniques to avoid post harvest losses. Select the shortest and efficient marketing channel to get higher share in marketing. Select the cheapest and convenient mode of transportation from the available alternatives. Use proper packing for paddy/rice to protect the quality and quantity during transit and storage. Transport paddy/rice in bags which minimises grain losses.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}