{
    "relation": [
        [
            "Ben O’Brien, Psychology",
            "Kat Tinker, Psychology",
            "Elizabeth Brown, Biology"
        ],
        [
            "Alex McAllister, Music",
            "Cory Dashiell, Biology",
            ""
        ],
        [
            "Shawna Blas, English",
            "Sarah Higgins, Chemistry",
            ""
        ]
    ],
    "pageTitle": "CSURF: UNCW",
    "title": "",
    "url": "http://www.uncw.edu/CSURF/AwardRecipients.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 805887691,
    "recordOffset": 805879794,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{18588=2004-2005, UNCW Undergraduate Research Fellowships (incomplete), 7950=2014-2015, 20354=2001-2002, UNCW Undergraduate Research Fellowships (incomplete), 12273=2012-2013, 16877=2007-2008, UNCW Undergraduate Research Fellowships, 13674=2011-2012, Paul E. Hosier Fellowships, 16119=2008-2009, UNCW Undergraduate Research Fellowships, 19685=2002-2003, UNCW Undergraduate Research Fellowships (incomplete), 17606=2006-2007, UNCW Undergraduate Research Fellowships (incomplete), 10348=2013-2014, 14431=2010-2011, Paul E. Hosier Fellowships, 4788=2015-2016, 17958=2005-2006, UNCW Undergraduate Research Fellowships (incomplete), 19215=2003-2004, UNCW Undergraduate Research Fellowships (incomplete), 15182=2009-2010, Paul E. Hosier Fellowships}",
    "textBeforeTable": "2011-2012, Paul E. Hosier Fellowships Megan Halloran, Psychology Bridgette Drummond, Biology Georgia and Gary Miller Fellowships: Zoe vanderPloeg, Economics Marissa Roman, Biology Luke McNulty, Chemistry Ann Sherman Skiba Undergraduate Fellowships: Victoria Willetts, Psychology Remy Welch, Psychology Samantha Ridgway, English Derek McMullen, Psychology Lauren Kipp, Chemistry Julienne Beblo, Biology Paul E. Hosier Undergraduate Research and Creativity Fellowships: 2012-2013 Kelsey Burnsed, Biology and Marine Biology Ahuja Academy for Water Quality Undergraduate Fellowship: Ben Shoesmith, Economics and Finance Sarah Bentil-Owusu , Chemistry and Biochemistry UNCW Board of Visitors Fellowships: Courtney Anderson Psychology Tavaris Avery, Chemistry and Biochemistry Georgia and Gary Miller Fellowships: David Silvia, History Melissa Alexander, Nursing Ann Sherman Skiba Undergraduate Fellowships: Michael Matthews, Psychology Nina Thigpen , Psychology Bridgette Drummond, Biology and Marine Biology Paul E. Hosier Undergraduate Research and Creativity Fellowships: 2013-2014",
    "textAfterTable": "2010-2011, Paul E. Hosier Fellowships Zachary Siders, Biology Mercedes Goetting, Nursing Melissa Deal, Psychology Sarah Edwards, Psychology Catharine Nealley, Psychology Chris Maier, Anthropology Alex Kreutzberger, Chemistry Samantha Welniak, Chemistry   2009-2010, Paul E. Hosier Fellowships Jamie Brummitt, Philosophy & Religion Brooke Wyatt, Political Sciene Will Hite, Economics Alex Elfner, Film Studies Caitlin Brooks, Education Megan Hardin, Nursing Kaitlin Johnson, Biology Elizabeth Saunders, Anthropology Whitney Knapp, Biology Rachel Smith, Psychology Cassandra Buchanan, Nursing   2008-2009, UNCW Undergraduate Research Fellowships Mallory Gleason, Psychology David Morgan, Biology Sarah McKone, English Lindsay Lawreck, Biology Dustin Klein, Film Studies Jamie Brummitt, Philosophy & Religion Rigel Kishton, Chemistry     2007-2008, UNCW Undergraduate Research Fellowships Ben O’Brien, Psychology Alex McAllister, Music Shawna Blas, English Kat Tinker, Psychology Cory Dashiell, Biology Sarah Higgins, Chemistry Elizabeth Brown, Biology     2006-2007, UNCW Undergraduate Research Fellowships (incomplete) Ian Sheffer, Biology/Marine Biology 2005-2006, UNCW Undergraduate Research",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}