{
    "relation": [
        [
            "",
            "IL-2",
            "Control"
        ],
        [
            "Description",
            "Consenting patients who were assigned IL-2 during the main phase of the study, including patients who took IL-2 alone as well as patients who took IL-2 with ART.",
            "Consenting patients who were in the control group during the main phase of the trial."
        ]
    ],
    "pageTitle": "Effect of Intermittent Aldesleukin Treatment With or Without Anti-HIV Drugs in HIV Infected People - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00110812?sect=Xk0156&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860908471,
    "recordOffset": 860892534,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Participants were enrolled by HIV care providers between December 2005 and June 2008. When the main study ended in February 2009, patients who consented to a study extension were followed another 2 years, during which study drug was not given. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: IL-2 Intervention: HIV Infections Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Open Label;   Primary Purpose: Treatment Study Design: Interventional Study",
    "textAfterTable": "IL-2 With Pericycle HAART During the main study, participants will receive aldesleukin under the skin twice daily for 5 consecutive days every 8 weeks for 3 cycles, then as needed to maintain CD4 counts at or above a goal level; in addition, this group will also take HAART for 3 days prior to the start of each aldesleukin cycle, throughout the 5-day aldesleukin cycle, and for 2 days after the end of each aldesleukin cycle (for a maximum of 10 days with each aldesleukin cycle). Patients did not receive aldesleukin during the extension phase. Participant Flow for 2 periods Period 1:   Main Study     No IL-2     IL-2 Without ART     IL-2 With Pericycle HAART   STARTED     91     89     87   COMPLETED     83     78     74  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}