{
    "relation": [
        [
            "Part #",
            "PF2W740-N04-67",
            "PFW720UIB990257",
            "PFW720UIB990053",
            "HR81LG015",
            "PFW72004UIB00015"
        ],
        [
            "Distributor",
            "Allied Electronics, Inc.",
            "Radwell",
            "Radwell",
            "Radwell",
            "Radwell"
        ],
        [
            "Manufacturer",
            "SMC CORPORATION",
            "Smc",
            "Smc",
            "Carrier",
            "Smc"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "Flow Switch, digital, for water, integrated display, 5-40 l/min, 1/2 port, PNP",
            "DIGITAL FLOW SWITCH WATER *LQA",
            "DIGITAL FLOW SWITCH (WATER)",
            "WATER CHILLER FLOW SWITCH",
            "DIGITAL FLOW SWITCH WATER"
        ]
    ],
    "pageTitle": "Water Flow Switch | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/water_flow_switch",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472360283,
    "recordOffset": 472332070,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{32895=Description: Sensor for bulk mass flow Large diameter for bulk measurement and custody transfer of liquids and gases Stainless Steel measuring tubes (NACE Compliant) Super Duplex option offering a maximum operating pressure of 180 barg Whilst the OPTIMASS 2000 has been developed to meet the demanding, 77591=Description: to +150°C Operating pressure up to 130 bar Upper limit of measurement for liquids: 1.6 to 160 l/h (water: 20°C) Upper limit of measurement for gases: 16 to 4,800 l/h (air: 20°C, 1.013 bar) 2 limit switches SIL 2 compliant acc. IEC61508 Accuracy 4.0 % of measured value acc. VDI/VDE}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Flow Switches for Oil/Gas Refinery Water Treatment , etc., that can be used in refinery wastewater treatment. They all, however, have one thing in common: liquid flow switches are necessary to monitor and control the flow of water and chemical additives throughout the wastewater treatment system. Flow switches are used at multiple points in water Flow Switches for Refinery Water/Wastewater Control To ensure quality production of petroleum-based products in oil refineries, including gasoline, diesel, kerosene, heating oil, and byproducts for plastics and a variety of lubricants, operators must establish reliable water monitoring and treatment. There are three refinery process areas Liquiphant M Replaces Flow Switch for Water Detection Case Study: Waste Water Management operation is an absolute requirement. All components of the system must have a high MTBF and any and every method of redundancy is taken advantage of to prevent shutdowns or accidents. This is especially true of the Ethernet switches in the network. If the network goes down, the flow stops, or worse. Municipal Water line. In conjunction with the two flowmeters, they would require a flow switch to detect flow direction.",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}