{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "Bengal pause on Tuesdays and Thursdays. Lots of clubs and activities!",
            "Wide variety. Pretty good",
            "Depends on where you're dorming. Perfect for meeting new people.",
            "Great if you apply yourself. Bigger classes but some smaller. Lots of choices",
            "Don't get caught up in the party life. Focus on your education. Get involved!"
        ]
    ],
    "pageTitle": "SUNY Buffalo State Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/SUNY-Buffalo-State/reviews?_escaped_fragment_=/show/1478",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912166759,
    "recordOffset": 912098453,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{221935=I will be starting in the fall of 2013 at Buffalo State, and currently don't really have much to say about the academic rigor. I do have to say though there are a lot of what they call foundation courses they make you take that I find useless to the actual degree I am going for., 339956=© 2015, Cappex.com, LLC, 12262=I am going to be a Music/Communications major at the school in the fall of 2011. I anticipate learning a lot, because despite this being the biggest SUNY school in the system, the music program at Buff State is small, selective, and home-y. The Communications department is one of the three accredited ones in New York State (Syracuse is one of the others, I don't remember the other), which is ridiculously impressive for a SUNY school; only about 15% or so of colleges NATIONALLY get accredited!, 2418=The professors I have had since beginning Fall 2008 have been extremely helpful. They are available before and after class if you would like to speak with them and also through email. No matter what your problem is, they do what they can to assist you., 25436=It's not really a tradition but we do the wobble. I learned it during my freshmen orientation it's one of those cute school spirit things that's fun to do every once in a while. They have a how to video on YouTube called the Orientation Wobble where some of the orientation leaders of 2011 show you the basic steps., 313634=There's a time span from 12:15-1:30 called Bengal Pause which is a time on campus where most students don't have classes and they can use this time in various ways whether they want to discuss their work with their professors, go to the student fitness center to workout, or just socialize. During times of the year when the weather is nice there's music blasting from speakers in the courtyard that student can listen or even dance to which is very refreshing., 92613=they have a new building which is beautiful which i spent my first year residing , the 2am, 415, and sometimes 5:30 fire drills do become annoying but as people get adjusted in the building it does stop., 76227=Campus police patrol the area quite a bit; however, this is not a school that you will feel safe walking around the campus at 1:00 AM. There is some crime in the area, but just be cautious.}",
    "textBeforeTable": "07/13/2009 Reviewer is A current student here. 18 out of 19 people found this review useful. 1 of 77 Jessica from Rochester, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. SUNY Buffalo State Reviews SUNY Buffalo State › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Claire from Amherst, NY 12/30/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 77 Categories Comments Great for these types of students Buffalo State is perfect for students looking for more than just an education, students hoping to make friends and get involved; it is large enough to feel like a real college but small enough to become acquainted with professors, to make friends easily and participate in some of the many clubs. There is a great social atmosphere at buff state including a lot of student-focused activities day and night. Tips for prospective students Whether you dorm or live at home, get involved on campus! The best way to make the most of your college experience is to try something new, you never know, you just might like it. Also, don't be afraid to talk to your teachers and ask questions, it's your grade, don't be too cool to do well. Teachers at Buff State have designated office hours and they love when",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}