{
    "relation": [
        [
            "Stonesoft Group",
            "Income Statement",
            "(1000 Euros)",
            "",
            "Net sales",
            "Other operating income",
            "Materials and services",
            "Personnel expenses",
            "Depreciation",
            "Other operating expenses",
            "Operating result",
            "Financial income and expenses",
            "Result before taxes",
            "Taxes",
            "Result for the accounting period",
            "",
            "Other comprehensive income",
            "Exchange differences on translating foreign operations",
            "Total other comprehensive income",
            "Total comprehensive income",
            "",
            "Basic earnings per share (EUR),",
            "continuing operations",
            "Diluted earnings per share (EUR),",
            "continuing operations"
        ],
        [
            "",
            "1-3/2012",
            "",
            "",
            "8 254",
            "269",
            "-1 458",
            "-4 787",
            "-142",
            "-2 710",
            "-574",
            "97",
            "-477",
            "-60",
            "-537",
            "",
            "",
            "5",
            "5",
            "-532",
            "",
            "",
            "-0,01",
            "",
            "-0,01"
        ],
        [
            "",
            "1-3/2011",
            "",
            "",
            "6 509",
            "118",
            "-1 078",
            "-4 031",
            "-124",
            "-2 222",
            "-827",
            "183",
            "-644",
            "-32",
            "-676",
            "",
            "",
            "-13",
            "-13",
            "-689",
            "",
            "",
            "-0,01",
            "",
            "-0,01"
        ],
        [
            "",
            "1-12/2011",
            "",
            "",
            "30 604",
            "904",
            "-5 240",
            "-16 665",
            "-479",
            "-10 262",
            "-1 137",
            "358",
            "-779",
            "-138",
            "-917",
            "",
            "",
            "-3",
            "-3",
            "-920",
            "",
            "",
            "-0,01",
            "",
            "-0,01"
        ]
    ],
    "pageTitle": "STONESOFT OYJ : STONESOFT CORPORATION INTERIM REPORT FOR JANUARY-MARCH 2012 | 4-Traders",
    "title": "",
    "url": "http://www.4-traders.com/STONESOFT-OYJ-441405/news/STONESOFT-OYJ--STONESOFT-CORPORATION-INTERIM-REPORT-FOR-JANUARY-MARCH-2012-14283503/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00029-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 271924911,
    "recordOffset": 271890917,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{68617=January-March 2012 - Net sales MEUR 8.3 (6.5), growth 27% - Product sales MEUR 4.9 (3.6), growth 38% - Operating result MEUR -0.6 (-0.8) - Operating result as percentage of net sales -7 (-13)% - Earnings per share EUR -0.01 (-0.01) - Operative cash flow MEUR 1.4 (1.8) - Liquid cash funds at the end of the fiscal period MEUR 9.1 (9.8). The corporate had no interest-bearing debts., 67785=Stonesoft Corporation Stock Exchange Release 20 April 2012 at 9:15 a.m., 71853=January-March 2012, 77753=In the beginning of the fiscal period on January 1, 2012, the price of Stonesoft share was EUR 0.86 (0.58). At the end of the fiscal period on 31 March 2012 the price was EUR 1.42 (0.56). The highest price was EUR 1.78 (0.64) and the lowest EUR 0.87 (0.51). During the fiscal period the total turnover of Stonesoft shares amounted to MEUR 14.7 (2.3) and 11.2 (3.8) million shares, which is 23.1 (6.1) % of the total amount of the shares. Based on the share price at the end of the fiscal period on March 31, 2012, Stonesoft's market value was MEUR 90.2 (35.5)., 78957=The AGM decided on 13.4.2011 to authorize the Board of Directors of the company to decide about one or more share issues as well as the issuance of option and other special rights so that the total number of new shares may be 12 600 000 at the maximum. , 81619=In 2011, a development started whereby Stonesoft and other companies specialized in network security grew strongly. Stonesoft assumes security threats to become increasingly worrying, which will create new business opportunities for the company., 75371=In March Stonesoft announced it had entered a partnership agreement with Cygate, whereby Cygate will start providing Stonesoft's network security solutions to companies and public sector organizations., 81196=Risks and uncertainties as well as the principles of Stonesoft's risk management are discussed more extensively at the company website and in the Annual Report 2011., 218105=A press conference for analysts and investors will be held on 20 April, 2012 at 10.30 am at the Stonesoft headquarters, street address Itälahdenkatu 22 A, 00210 Helsinki., 84659=The company has adopted certain new or revised IFRS standards and IFRIC interpretations at the beginning of the financial period as described in the Financial Statements for 2011. However, the adoption of these new and amended standards has not yet had an effect on the reported figures in practice. In other respects, the same accounting policies have been followed as in the Financial Statements for 2011. Key indicator calculations remain unchanged., 69239=During the first quarter of the year 2012 Stonesoft's product sales grew by 38% and net sales by 27%. Cash flow was clearly positive. Companies have continued their investments in network security despite the current financial insecurity. During the fiscal period, Stonesoft was selected as the vendor to a project which is the largest in the company's history., 80718=During the fiscal year 2012, Stonesoft's main risks and business uncertainties relate to the realization timetable of the sales projects and possible production disruption of our subcontractors and suppliers. Insecurities related to public economies may have a negative effect on the public sector projects. Stonesoft has no risks related to the order book, because it normally can process incoming orders within a couple of work days., 73541=In January Stonesoft announced it had, as the first non-French vendor, obtained the CSPN (Certification de Sécurité de Premier Niveau) certification delivered by ANSSI (French Network and Information Security Agency) in France., 80408=The authorization is in force until the end of the 2012 AGM., 74877=In February Stonesoft introduced the new Stonesoft Security Engine, which can be configured to act as seven different security solutions or as a combination of them. The Security Engine sets new criteria to network security and its cost efficiency., 75168=In March Stonesoft announced it had received the respected 'Recommend' rating for the Stonesoft FW-1301 in NSS Labs' Next Generation Firewall (NGFW) Group Test., 74390=In February Stonesoft announced its Firewall/VPN product family had received the Common Criteria Evaluation Assurance Level 4+ (EAL4+) certification., 67899=STONESOFT CORPORATION INTERIM REPORT FOR JANUARY-MARCH 2012, 83777=Stonesoft aims for at least 30% growth of net sales and a positive result for the year 2012., 73825=In January the Board of Directors of Stonesoft Corporation decided on a new stock option plan., 76748=The company had two valid stock option programs, Stock Option Program 2008, under which the subscription price is EUR 0.30 and the total number of stock options to be granted based on this program is 3 000 000 at the maximum and Stock Option Program 2012, under which the subscription price is EUR 1.42 and the total number of stock options to be granted based on this program is 4 500 000 at the maximum. The subscription period of the shares is graded and will end for all 2008 stock options on December 31, 2014 and for 2012 stock options in 2017-2019., 80091=The Board of Directors used the authorization granted by the AGM held on 13 April 2011 as it decided on the new Stock Option Plan 2012. The stock options issued by the plan can be used to subscribe for a maximum total of 4,500,000 new or existing shares held by the company., 73962=In January Stonesoft announced the availability of the Stonesoft(TM) IPS-1302 intrusion prevention system appliance for protecting data center and modern corporate network environments. Designed for demanding Web and encrypted traffic inspection, the appliance provides efficient protection against Advanced Evasion Techniques (AETs) without compromising traffic speed or availability., 81461=Based on Stonesoft's estimate the growth of the total market will continue to grow by 5% also during the year 2012., 84330=SUMMARY OF FINANCIAL STATEMENTS AND NOTES JANUARY 1 - MARCH 31, 2012, 69643=Our aim to develop increasingly flexible and secure solutions for demanding and critical environments was rewarded in the Next Generation Firewall (NGFW) Group test by NSS Labs. Stonesoft was selected in the best, so-called \"Recommend\" category. We delivered 100 percent protection against year 2011 exploits, and also full protection against evasions used in the test.}",
    "textBeforeTable": "The figures presented in this release are unaudited. The company has adopted certain new or revised IFRS standards and IFRIC interpretations at the beginning of the financial period as described in the Financial Statements for 2011. However, the adoption of these new and amended standards has not yet had an effect on the reported figures in practice. In other respects, the same accounting policies have been followed as in the Financial Statements for 2011. Key indicator calculations remain unchanged. The Interim Report has been prepared in accordance with the IAS 34 Interim Reports standard. Basis of preparation SUMMARY OF FINANCIAL STATEMENTS AND NOTES JANUARY 1 - MARCH 31, 2012 With regard to the development of the turnover and the operating result, variation is expected between the quarters in comparison to the corresponding quarter during the previous year as well as to the previous quarter as a consequence of, among others, long sales cycles and the relatively big impact of individual deals on the development of net sales and operating result. Stonesoft aims for at least 30% growth of net sales and a positive result for the year 2012. Based on Stonesoft's view, these issues will continue to have a positive impact on the company's net sales and profitability and will strengthen its competitiveness and market position as the general understanding and knowledge about advanced evasions techniques grow. The above mentioned issues have opened new business opportunities",
    "textAfterTable": "Stonesoft Group Balance Sheet  (1000 Euros) 31.3.2012 31.3.2011 31.12.2011 ASSETS Non-Current Assets Tangible assets 985 804 700 Intangible assets",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}