{
    "relation": [
        [
            "Patent application number",
            "20100264800",
            "20110044042",
            "20110103037",
            "20110138665"
        ],
        [
            "Description",
            "LED LAMP - An LED lamp includes a hollow lamp housing, a front optical part, a rear electrical part, and a middle heat dissipation part. The heat dissipation part includes a heat sink, a mounting seat in front of the heat sink, and a heat conducting member connecting the mounting seat with the heat sink. The lamp housing defines a plurality of air exchanging holes corresponding to the fins. The mounting seat includes a small top surface, an opposite large bottom surface, and a plurality of sloping heat absorbing surfaces between the top surface and the bottom surface. The optical part includes a plurality of light sources arranged on the heat absorbing surfaces, a light reflector located between the heat sink and the mounting seat and surrounding the heat conducting member, an optical lens located in front of the light reflector and the mounting seat.",
            "LED ILLUMINATION DEVICE - An LED illumination device includes a heat dissipation part, an optical part and an electric part. The optical part includes an LED module attached on the heat dissipation part and an envelope mounted on the heat dissipation part and covering the LED module. The electric part includes a casing and a lamp cap. The casing is cup-shaped. The lamp cap includes a sleeve electrode and a spring electrode attached at a bottom of the sleeve electrode. The sleeve electrode and the spring electrode electrically power the LED module. One end of the casing along an axis thereof is mounted on bottom ends of the heat dissipation part and the optical part. The sleeve electrode is disposed around the other end of the casing. The spring electrode is resiliently deformable along an axis of the sleeve electrode.",
            "LED LAMP - An LED lamp includes a housing and a light source located outside the housing. An electric module is received in the housing. The housing defines a receiving recess in an outer surface thereof. The light source is connected to the electric module electrically. The light source is pivotally mounted to the housing and pivotable between a rest state and a working state to adjust an illumination angle of the light source. When the light source is located at the rest state, the light source is received in the receiving recess. When the light source is located at the working state, the light source is pivoted up from the receiving recess. The LED lamp can be used for normal illumination, emergency illumination or mobile illumination.",
            "EMERGENCY EXIT INDICATOR - An emergency exit indicator includes a housing and a light source received in the housing. The housing includes two first connecting arms at top and bottom thereof and two second connecting arms at lateral sides thereof. The first and second connecting arms are connected with each other by four connecting units located respectively at four corners of the housing. Each connecting unit includes a seat and two engaging tabs extending from the seat. One engaging tab is engaged with a corresponding first connecting arm, and the other is engaged with a neighboring second connecting arm."
        ],
        [
            "Published",
            "10-21-2010",
            "02-24-2011",
            "05-05-2011",
            "06-16-2011"
        ]
    ],
    "pageTitle": "Qian, CN - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/qian-cn-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00248-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434972283,
    "recordOffset": 434937487,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jian-Bing Qian, Shenzhen City CN 02-06-2014 THROUGH SILICON VIA GUARD RING - The present disclosure relates to forming a plurality of through silicon vias guard rings proximate the scribes streets of a microelectronic device wafer. The microelectronic device wafer includes a substrate wherein the through silicon via guard ring is fabricated by forming vias extending completely through the substrate. The through silicon via guard rings act as crack arresters, such that defects caused by cracks resulting from the dicing of the microelectronic wafer are substantially reduced or eliminated. 20140038390 Published Description Patent application number Jiamin Qian, Shaghai CN 10-29-2009 BACKLIGHT MODULE - A backlight module including several light sources, a frame, a light guide plate and a flexible printed circuit board is provided. The flexible printed circuit board includes a body and a fixing structure. The body is bent, so that a first part and a second part of the body are respectively disposed on two sides of the frame. The light sources are disposed on the first part, and the light-emitting surfaces of the light sources face the light guide plate. The fixing structure including a structure body, several first connecting portions and two protrusions is disposed on the first part. The first connecting portions extend from the two opposite first sides and are fixed on the body, so that the structure body is positioned above the light sources. The protrusions respectively extend slantwise",
    "textAfterTable": "Jianmin Qian, Wuxi CN Patent application number Description Published 20120283522 Self-Service Surgical Retractor - A new self-service surgical retractor with the characteristics comprising: main post ( 11-08-2012 Jianping Qian, Hangzhou CN Patent application number Description Published 20120109946 Determination of category information using multiple - Providing category information includes: receiving a plurality of search key word sets that were previously input by a plurality of users; obtaining category information corresponding to the plurality of search key word sets; segmenting each of the plurality of search key word sets into search key word units; combining the search key word units into a plurality of search key word unit groups that correspond to a plurality of stages; based at least in part on the category information, determining category information that specifically corresponds to the plurality of search key word unit groups; and based at least in part on category information, establishing a plurality of search key word tables corresponding to the plurality of stages. 05-03-2012 20140074831 DETERMINATION OF CATEGORY INFORMATION USING MULTIPLE STAGES - Providing category information includes: receiving a plurality of search key word sets that were previously input by a plurality of users; obtaining category information corresponding to the plurality of search key word sets; segmenting each of the plurality of search key word sets into search key word units; combining the search key word units into a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}