{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "Whittier College is great for students that like to be part of a small community and that enjoy smaller classrooms, which means that you get more individual attention. This school is perfect for students that are ready to leave the overcrowded classroom, which make one feel like just another student in the class.",
            "Be prepared for the rigorous work, as you will no longer get by with the bare minimum. College - in general - asks more of students and this is preparing them for the workforce that will expect going above and beyond with your work. Attendance is crucial in college, as it not only affects your grade but your understanding of the course. Professors are no longer going to hold your hand and take you through all the steps, rather they will guide you to the correct path and let you choose if you want to take it. Most importantly, do not procrastinate because then you become overwhelmed when you glance at the piles of work that you have to do. It is best to do a bit of homework everyday because it ensures quality.",
            "I feel that the education is worth the money that I am paying. Both the teachers and other faculty members provide a genuine service to the students. The faculty has the students' best interest in mind so they do not waste their time rambling about something that will not benefit the student. Plus the faculty and other members of the college are extremely helpful in all situations, whether it be going to the registrar's office or the business office.",
            "Although I currently commute to the school, I find that the school has a wonderful atmosphere created by the diverse cultures that inhabit it. I enjoy being at Whittier College because it has a friendly environment that allows students to work with one another. Plus one feels encouraged to visit professors during their office hours as they are helpful and nice.",
            "At Whittier College, there is not a day that I am not learning something new. It offers a wide variety of courses that will meet everyone's needs. I especially found the freshman writing seminar beneficial, as it helped me improve my writing. All the courses offer rigorous work that will keep one busy yet not feeling overwhelmed. This learning community allows one to learn not only from the teachers but the students as well."
        ]
    ],
    "pageTitle": "Whittier College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Whittier-College/reviews?_escaped_fragment_=/show/9866",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901887159,
    "recordOffset": 901830108,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56054=First semester, freshman year is a hard transition for any college student. Coming from so far away, it was even harder. I wanted to transfer after my first semester, because I was so homesick and I felt there was nothing to do with my time. I was wrong. By Jan Term and second semester I was doing plays and getting more involved, and starting to really love my time at school. Getting involved helped me meet more people, which allowed me to have more opportunities. I began visiting the beach, going into the L.A. area, going to Disneyland, even exploring uptown Whittier. Even though it was a rough start, after the adjustment period, I really started to love my time there., 190208=The freshmen dorms are not the best. Whittier College has been around since 1887, so the renovations in the dorms have not really been remodeled. Therefore, the quality of them are not the best. It is good to live on campus because you have access to a living where you can relax but the financial part of the living in the dorms is not ideal., 244973=© 2015, Cappex.com, LLC, 6081=Plenty of opportunities such as major selection. This college has its own unique system called The Whittier's Scholars Program. It is essentially you creating your own major. Picking current majors that exist and blend it with others, it is unique! The atmosphere is great here too, always quiet, just so nice. The size, about 1800 or so students attend Whittier College, so it is pretty small, as well as the campus size, really small. Great campus security and lots of access to utilities. Oh and it is in Whittier, many things around! Not far from Los Angeles, nor Anaheim, party central basically. Come by!, 69574=Big things on campus, like dances and such, will be no surprise to students since you get a lot of e-mails on a regular basis from the Residential Life and L.E.A.P. office about them. From middle of March - end of April, there is a dance EVERY Friday. The dances are hosted by societies and clubs on campus, and are pretty fun., 448=I have found that Whittier is a magnet for those who are looking to be not only seen, but heard. The small classes and campus are perfect to create and close and intimate bond with others. So here you go, to sum it up, it you are looking for any of the following in a college, Whittier is your final destination! -Small beautiful campus -1:25 teacher:student ratio -leadership activities -volunteer work -job opportunities -clubs/sports/societies -close places off campus (shops, book/movie/music, restaurants, etc) -lots of friends! -many majors to choose from! -near major cities and hot spots in CA (Disneyland, Knotts Berry Farm, La, Hollywood, etc.) All-in-all Whittier is an amazing place and you would have the best educational and life experience if you came here!!}",
    "textBeforeTable": "01/15/2010 Reviewer is A current student here. 13 out of 14 people found this review useful. 1 of 48 Ashley from CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Whittier College Reviews Whittier College › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Ridwan from Van Nuys, CA 10/14/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 48 Categories Comments Great for these types of students Plenty of opportunities such as major selection. This college has its own unique system called The Whittier's Scholars Program. It is essentially you creating your own major. Picking current majors that exist and blend it with others, it is unique! The atmosphere is great here too, always quiet, just so nice. The size, about 1800 or so students attend Whittier College, so it is pretty small, as well as the campus size, really small. Great campus security and lots of access to utilities. Oh and it is in Whittier, many things around! Not far from Los Angeles, nor Anaheim, party central basically. Come by! Tips for prospective students Get ready to be known well. As you always see the same faces, if not, familiar faces over and over. It is only a month of my time here, I see the same",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}