{
    "relation": [
        [
            "Shipping and handling",
            "US $60.00",
            "Free Local Pickup"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (FedEx Ground or FedEx Home Delivery®)",
            "Local Pickup"
        ],
        [
            "Delivery*",
            "Estimated within 4-9 business days",
            ""
        ]
    ],
    "pageTitle": "Champion Power Equipment 12 000 Winch KIT 11200 | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Champion-12-000-Winch-Kit-11200-/290984977851?pt=Motors_ATV_Parts_Accessories&hash=item43c00e65bb&vxp=mtr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417195139,
    "recordOffset": 417147378,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{947= Generators-Plus ships within 24 hours after payment is received (Monday through Friday, 8:30 to 4:30). Shipments will be sent by Fed Ex Ground to the address provided by Buyer. Incorrect/ inaccurate addresses may result in delays and/ or additional costs for delivery. Shipping is calculated based upon the average freight cost for the item’s weight. Discounts based upon Generators-Plus shipping volume have been passed on to the Buyer. Please contact Generators-Plus for combined shipping on multiple items.}",
    "TableContextTimeStampAfterTable": "{73616=Join over 2000 satisfied customers who have bought online from Generators-Plus!}",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 11 items available. Please enter a number less than or equal to 11. -Select- Canada Mexico United States Change country: Quantity: Item location: Excludes: Africa, Asia, Central America and Caribbean, Europe, Middle East, Oceania, Southeast Asia, South America, Bermuda, Greenland, Saint Pierre and Miquelon Shipping to: Americas Medina, Ohio, United States",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 3 business days of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer is responsible for return shipping costs. Return policy details",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}