{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe.",
            "They know how to have fun without being crazy.",
            "Want strong academics and lots to do on campus.",
            "Annual lighting of the Christmas tree.",
            "If you don't want to do any of the many things on campus, go out on the town.",
            "Lots of different options, you won't grow tired of the food.",
            "Every dorm is different. There are all freshman dorms, two art dorms, and four class dorms.",
            "Great academics.",
            "Get involved on campus. Go to campus events.",
            "SMU has great teachers, lots of majors, and plenty to do on campus. The academic quality of the school is great, and you will learn a lot. Beautiful campus and plenty of ways to make friends."
        ]
    ],
    "pageTitle": "Southern Methodist University (SMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Southern-Methodist-University/reviews?_escaped_fragment_=/show/91603",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917723099,
    "recordOffset": 917644347,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{57504=Very large portion of school is Greek. However it is more important for guys to join than girls. Recruitment is in January which allows for potential new members to get to know all sororities and fraternities in the fall semester before rushing in the spring., 152584=Really the clubs and activities at SMU are endless. If you can't find a club or organization that fits your interests, start a new one! SMU holds the annual Night at the Club event a few days before classes start in August, and the event helps new students discover all of the clubs on campus., 339918=© 2015, Cappex.com, LLC, 31808=Heck yes. SMU gives you MANY opportunities to perform extra research and try out other projects AS AN UNDERGRAD (if you so seek). I'm always getting e-mails from my department about opportunities to get involved - and even get published. AS AN UNDERGRAD. (Dunno if you want to go to grad school, but if so - THAT IS HUGE) The faculty and staff here are STELLAR. AND THEY ACTUALLY CARE. And if you start to fall ... they won't let you hit rock bottom. :) You might also be interested to know that they also offer classes during May, Summer I, Summer II, August, and Winter Break. And they have so many interesting courses. Check out their listings: http://access.smu.edu, 24959=PHIL 1300 was a really interesting class, the professor was a little drab, but I learned a lot. Also Intro to EE was really engaging. I learned a lot of cool concepts and things that I could actually use & the prof was top-notch. I started to think differently about everything, but I now I hardly notice it. I think that's when you know you've really learned something.}",
    "textBeforeTable": "01/21/2010 Reviewer is A current student here. 25 out of 26 people found this review useful. 1 of 68 Sarah from Richardson, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Southern Methodist University Reviews Southern Methodist University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Bang for the buck SMU is definitely an expensive school. Because of the scholarships and financial aide I received I was able to attend the school of my choice. Although most of the people there are wealthy, there are also others receiving help so there is no need to feel inferior. SMU is a beautiful campus with many resources for the students to use. From the dance performances to the sporting events, the money paid is definitely worth it. Because it is a prestigious and private school, the cost is high but do not hesitate to apply, financial aide is available. Am enjoying being here Although grades are important, fun is necessary for staying sane. SMU's location is perfect because it is in the heart of Dallas. With the restaurants on Hillcrest and Greenville so close by, there is always somewhere to eat and locations to shop. On campus there are also many activities to do whether it be rockclimbing in the gym or socializing in Java City. Even the library becomes a fun hang out spot during study breaks. Am learning a lot SMU has an amazing academic curriculum and expects a lot from its students. Although the workload is intense, time management is the key to success.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}