{
    "relation": [
        [
            "",
            "1.",
            "2.",
            "3.",
            "4i.",
            "4e.",
            "5."
        ],
        [
            "cardinal",
            "kuru",
            "suru",
            "aru",
            "-iru",
            "-eru",
            "-u"
        ],
        [
            "negative",
            "ko(nai)",
            "shi(nai)",
            "nai",
            "-i(nai)",
            "-e(nai)",
            "-a(nai) or -wa(nai)"
        ],
        [
            "polite",
            "ki(masu)",
            "shi(masu)",
            "ari(masu)",
            "-i(masu)",
            "-e(masu)",
            "-i(masu)"
        ],
        [
            "suppositional",
            "kure(ba)",
            "sure(ba)",
            "are(ba)",
            "-ire(ba)",
            "-ere(ba)",
            "-e(ba)"
        ],
        [
            "imperative",
            "koi",
            "shiro",
            "are",
            "-iro",
            "-ero",
            "-e"
        ],
        [
            "intentional",
            "koyo(u)",
            "shiyo(u)",
            "aro(u)",
            "-iyo(u)",
            "-eyo(u)",
            "-o(u)"
        ]
    ],
    "pageTitle": "Introduction to Japanese",
    "title": "",
    "url": "http://homepage3.nifty.com/park/juku/introJap.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 114130255,
    "recordOffset": 114104537,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2316=   Three kinds of characters are used in writing Japanese, besides the Roman alphabet and Arabic numerals. They are kanji, hiragana, and katakana.    Japanese children start with hiragana. If you master the 46 characters of hiragana and some rules to use them, you can write anything in Japanese and read easy books for children. Katakana is reserved for loanwords, foreign names, onomatopoeias, etc. In order to read newspapers and books, you must learn about 2000 kanji or more.}",
    "lastModified": "Tue, 17 Apr 2007 03:20:35 GMT",
    "textBeforeTable": "Chapter 6. Verbs Cardinal forms of verbs, which you find among headwords of dictionaries, all end with -u. Verbs are divided into five types according to the way they are conjugated.   1. kuru ( to come )   2. suru ( to do ) and compound verbs that end with suru.   3. aru ( to exist )   4. all verbs which end with -iru or -eru, except a few which belong to Type 5.   5. all verbs which end with -u, except those belong to Types 1 to 4. Notes: 1.  There is another kuru, which means to draw near or wind ( rope, cord, string, line, etc.) or turn (pages). It is a Type 5 verb. Being archaic, it is often replaced by taguru for drawing near or mekuru for turning pages. 2.  Kanzuru (to perceive) belongs to Type 2, but in colloquialism it has been replaced by kanjiru, which belongs to Type 4. 3.  There is another suru, which means to strike ( a match ), pick ( a pocket ) and lose ( money in betting ). It is a Type 5 verb. 4.  Aru is a Type 5 verb, except that the negative form is irregular. 5.   Iru, which means to stay or exist, and eru, which means to obtain, belong to Type 3, while the iru, which means to need, and the eru, which means to",
    "textAfterTable": "Notes: 1.  Note that all the five vowels appear in the endings of Type 5 verbs. 2.  The negative form of those Type 5 verbs whose stems end with a vowel appears as -wanai. For example, the negative form of omou (to think) is omowanai. These verbs used to have -f at the end of their stems, which they have either changed to -w, assimilated to other consonants, or just lost, as time went by.   omowanai < omofanai < omofu (to think) + nai   omotta (past form) < omofta < omofitari < omofu + tari   omoeba < omofeba < omofu + ba Cardinal forms have no tense of their own. Cardinal forms are something like infinitives of the imperfect aspect, except when they are used as predicate verbs of the main clauses, in which case they represent the present or the future tense. eiga o miru ( to see a movie) Jon wa mainichi eiga o miru. ( John sees a movie every day. ) Jon wa ashita eiga o miru. ( John will see a movie tomorrow. ) Jon wa mainichi eiga o miru to ii mashita. ( John said that he saw a movie every day.) Jon wa ashita eiga o miru to ii mashita. ( John said that",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}