{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "On my tour, we didn't see much of the dining hall/food situation, so I can't really give a good review of this part.",
            "The freshman dorms aren't air conditioned, but after freshman year, there's better living conditions.",
            "Butler seems like it will be a great place to study, and hopefully I get to go there and find out for myself!"
        ]
    ],
    "pageTitle": "Butler University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Butler-University/reviews?_escaped_fragment_=/show/21686",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903782843,
    "recordOffset": 903718003,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34476=Being established in 1855, the dorms are a little out-dated and in need of major renovations, which are in order for the future., 87899=you've got to see hinkle fieldhouse..built in 1928 and is over 2 acres under 1 roof. plus their greek row is beautiful and they have the 2nd largest observatory telescope in the nation. so many neat places at butler, 245392=We have this thing called the Butler Bubble. It is our bubble, and we normally feel very safe in it. I have walked back to my dorm at 3, 4, and 5 o'clock in the morning and felt perfectly safe., 297688=© 2015, Cappex.com, LLC, 245761=There are 7 Pan-Hellenic sororities and 5 fraternities located on campus with houses. One NPHC sorority chapter, the Almighty Alpha Chapter of Sigma Gamma Rho, was founded on Butler's campus in 1922. Greek life is prevalent with activities for students, but partying is extremely optional.}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 22 out of 22 people found this review useful. 1 of 62 Anonymous Check out reviews left by other students or leave your own review. You could win a free scholarship. Butler University Reviews Butler University › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "For someone originally from the Indianapolis area, it must be said there are not too many attractions or exotic places to see around the campus or the outside area. The campus is nice and calm although some of the buildings and the dormitory halls could use an update. There are a few places that are unique to the area (IMA, NCAA Hall of Champions, Children's Museum). Am learning a lot For the most part, all of the classes are small enough that the professor knows your name and is able to pay more attention to the needs of the students. Because of this, it is much easier to learn more and to understand the topic without having to rush through anything. As long as you stay focused, I feel that the overall workload will never reach critical mass. Login to rate or flag the reviews Megan from West Chester, OH 11/09/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 2 of 62 Categories Comments Great",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}