{
    "relation": [
        [
            "",
            "Scan 1",
            "Scan 2",
            "Scan 3",
            "Scan 4",
            "Scan 5",
            "Scan 6",
            "Scan 7",
            "Scan 8",
            "Scan 9",
            "Scan 10",
            "Scan 11",
            "Scan 12",
            "Scan 13",
            "Scan 14",
            "Scan 15",
            "Scan 16"
        ],
        [
            "Number of Particles",
            "152",
            "151",
            "153",
            "152",
            "151",
            "150",
            "150",
            "150",
            "150",
            "150",
            "152",
            "150",
            "151",
            "153",
            "153",
            "150"
        ],
        [
            "Angularity",
            "3841.29",
            "3727.50",
            "3900.22",
            "3772.68",
            "3761.00",
            "3775.48",
            "3712.38",
            "3810.79",
            "3737.36",
            "3815.72",
            "3897.90",
            "3800.96",
            "3845.72",
            "3851.68",
            "3884.05",
            "3892.99"
        ],
        [
            "2D Form",
            "7.83",
            "7.72",
            "7.74",
            "7.79",
            "7.80",
            "7.82",
            "7.73",
            "7.78",
            "7.76",
            "7.74",
            "7.82",
            "7.73",
            "7.73",
            "7.79",
            "7.76",
            "7.74"
        ]
    ],
    "pageTitle": "Aggregate Imaging System (AIMS) Phase I Progress Report - Aggregate Imaging System - Highways for LIFE - FHWA",
    "title": "Table 20. Results of Dark 0.600 mm (ASTM #30) Fine Aggregates (Experiment 4)",
    "url": "http://www.fhwa.dot.gov/hfl/partnerships/aims/phase1/index.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440490959,
    "recordOffset": 440463345,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22531=Ruggedness, in this meaning, is not the ability of the equipment to stand up to abuse, but the ability of the testing methodology to handle small variations in the parameters used for capturing the data. Factors and limits were selected for the initial ruggedness study which followed the guidelines of ASTM C1067 \"Standard Practice for Conducting a Ruggedness or Screening Program for Test Methods for Construction Materials\". The new system is computer controlled with little operator input required to characterize material samples. As such, the ruggedness factors selected focused on gaining an understanding of the level of control required during system operation and system calibration to provide a rugged testing process. Special accommodation was made in the test software to permit imputing variability into the system to simulate the acquisition parameter variation. This special code to vary these acquisition parameters is not available for normal operation and was strictly in-place for the ruggedness testing., 33427=December 23, 2008, 38252=The purpose of the ruggedness study is to identify important operational and environmental factors which might cause significant variability in the results. The results of the ruggedness study can be used to establish appropriate ranges of the parameters in questions. The ruggedness test will be carried out according to ASTM C 1067-00 \"Conducting a Ruggedness or Screening Program for Test Methods for Construction Materials.\", 24982=Ruggedness testing was performed using several different material sources. Separate tests were run using dark colored coarse aggregates, light-colored coarse aggregates, dark colored fine aggregates, and light colored fine aggregates. Two sizes of fine samples were selected (#30 and #16). Each test of 16 separate characterizations was statistically analyzed for significance according to the ASTM C1067 procedure. For the fine aggregates, 2 outputs Angularity and Form2D were evaluated. For coarse aggregates, Angularity, Texture, Sphericity, and F&E were included in the analysis for factor significance., 18583=The second stage of the testing was designed to confirm that the testing methodology was rugged. The term rugged in this usage means that small, anticipated, variations in the operational parameters that occur within the equipment, laboratory environment, and system operation do not significantly impact the results. This testing utilized ASTM 1067 \"Standard Practice for Conducting a Ruggedness or Screening Program for Test Methods for Construction Materials\". Appendix A describes the Ruggedness Experiment and its findings., 78065=ASTM C1067 contains details about calculations necessary for determining the significance of the main factors using an effect factor. An effect factor ≥ 5.59 represents a significant effect with a 5% probability for drawing an erroneous conclusion (ASTM C1067, Section 7.6). If the effect factor is ≤5.59 then the factor is considered not significant (NS) with a 95% level of confidence. The summary of the analysis for the coarse aggregates are show in Table 12 and the fine aggregates are shown in Table 13., 38698=The study was conducted following ASTM procedures C 1067-00. The analysis was done for 1 coarse aggregate size and 2 fine aggregate sizes in the following sieve ranges, 12.5mm to 9.5mm (0.5 in to 0.375 in), 2.36 mm to 1.18 mm (ASTM #8 sieve to ASTM #16 sieve), and 1.18 mm to 0.600 mm (ASTM #16 sieve to ASTM #30 sieve). Particles in the 12.5 mm to 9.5 mm size range passed the 12.5 mm sieve but were retained on the 9.5 mm sieve. In this study the aggregate sieve ranges will be referred to by the retained sieve size, 12.5mm to 9.5mm (0.5 in to 0.375 in) will be abbreviated as 9.5mm (0.375 in). Two aggregates were used for each sieve size, one dark color aggregate and one light color aggregate. The coarse aggregates are characterized by analyzing the angularity, texture, sphericity, and flat and elongated parameters of 50 particles. The angularity and 2D form of 150 particles are used to characterize each of the sizes of the fine aggregates.}",
    "textBeforeTable": "Ruggedness testing was performed using several different material sources. Separate tests were run using dark colored coarse aggregates, light-colored coarse aggregates, dark colored fine aggregates, and light colored fine aggregates. Two sizes of fine samples were selected (#30 and #16). Each test of 16 separate characterizations was statistically analyzed for significance according to the ASTM C1067 procedure. For the fine aggregates, 2 outputs Angularity and Form2D were evaluated. For coarse aggregates, Angularity, Texture, Sphericity, and F&E were included in the analysis for factor significance. Ruggedness Findings The initial tests identified several significant factors. The factors include ambient lighting, light levels and magnification. A design change for the enclosure doors was indicated. The original doors were tinted but translucent. The testing indicated a requirement for non-translucent doors. The other factors were identified in this first round pointing to the need for tight control on some of the parameter settings. It was determined that many settings require fixed values rather than user adjustable values. This effectively reduced the options provided to a user, simplifying the operation of the system. The control of these parameters was already in place; this test simply demonstrated a need to limit the level of variability. It was hypothesized that some of the factors may have had some cross-influence on the outputs in this first series, so it was repeated with tightened limits on some parameters while retaining the original high-low limits of others. This second round further defined the requirements and confirmed the design change required",
    "textAfterTable": "Off For the coarse aggregates, each sieve range has an individual tray with different trough sizes to correctly position the aggregates under the camera. The limits for the tray size were selected as one tray size above and one tray size below the correct tray size. The light illumination is the top and bottom lighting required to capture the images. The light illumination limits were selected as +1 and -1 from the proper settings. The AIMS2 doors limits were chosen as completely open or closed to predict the significance of the door position which could let in additional ambient light. The focus, zoom level, and tray height are to check the impact of miscalculation in determining the proper levels. The tray height is the distance from the camera to the tray. The ambient light is to consider the performance of the doors in eliminating the effect changes in exterior lighting. For the fine aggregates, the light illumination, doors position, zoom level, and ambient light factors were kept to analyze the significance of the changes on the results. One tray size is used for all the fine aggregates, but the user must select the tray color, either clear or opaque, depending on the aggregate size and color. The lighting for the fine aggregates is directly related to the tray color, if the tray color is clear the bottom is used and if the tray color is opaque the top light is used. For the clear tray, the bottom",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}