{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "2 X LA Colours Black Lipstick Goth Punk Cyber L K | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/La-Colours-Black-Lipstick-GOTH-PUNK-CYBER-L-K-/150509148702",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416508775,
    "recordOffset": 416462803,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76788=Love Beauty Products PO BOX 1368 BATHURST NSW}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within Return policy receiving cleared payment - opens in a new window or tab. Will usually post within 1 business day of Domestic handling time",
    "textAfterTable": "Seller's payment instructions PLEASE PAY WITHIN 5 DAYS OF PURCHASE PLEASE SPECIFY ITEM NO WHEN DEPOSITING MONEY INTO BANK ACCOUNT TO MAKE IT EASIER FOR US AND TO MAKE DELIVERY QUICKER INTERNATIONAL BIDDERS PLEASE ASK FOR POSTAGE COSTS. IF YOU DO NOT CHOOSE TO REGISTER POST, ANY ITEM LOST IN POST SELLER WILL NOT BE LIABLE. THANKS MICHELLE Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}