{
    "relation": [
        [
            "Patent application number",
            "20090053224",
            "20090104201",
            "20110200606",
            "20120087917",
            "20130095101",
            "20130324705",
            "20140079707",
            "20140128284",
            "20140255951",
            "20140302524",
            "20140349309",
            "20140378464",
            "20140378491"
        ],
        [
            "Description",
            "LOX AND LOXL2 INHIBITORS AND USES THEREOF - The present application relates to anti-LOX and anti-LOXL",
            "METHODS AND COMPOSITIONS FOR TREATMENT AND DIAGNOSIS OF FIBROSIS, TUMOR INVASION, ANGIOGENESIS, AND METASTASIS - The present disclosure provides innovative methodology and related compositions and kits for preventing and treating various diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, by using an inhibitor of processed forms of lysyl oxidase or lysyl oxidase-like proteins, an inhibitor of LOX and an inhibitor of a LOXL, or a synergistic combination of an inhibitor of LOX or LOXL combined with other therapeutic agents. Also provided are innovative methods for selecting agents that prevent or inhibit tumor invasion, angiogenesis and metastasis, by contacting cells that are in an epithelial-mesenchymal transition (EMT) state with a candidate agent and detecting a change in the EMT state of the cells. Methods and related compositions and kits for diagnosing or monitoring various diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, by using molecules or agents that specifically recognize processed forms of LOX or LOXL are also provided. Also provided herein are methods and related compositions, medical devices, systems and kits for preventing or treating various diseases and conditions associated with fibrosis with compositions comprising inhibitors of LOX or LOXL. Such diseases or conditions include pathological cardiovascular conditions and diseases such as hypertension, hypertensive heart disease, myocardial infarction, atherosclerosis, and restenosis, liver fibrosis, kidney fibrosis, lung fibrosis, dermal scaring, keloid formation, and Alzheimer's disease.",
            "Antibodies that Bind to Lysyl Oxidase-Like 2 (LOXL2) and Methods of Use Therefor - The present disclosure provides lysyl oxidase-like-2 (LOXL2) polypeptide binding agents, including, for example, antibodies that specifically bind a LOXL2 polypeptide; and further provides compositions comprising same. The binding agents can be used in various treatment and diagnostic methods, which are also provided.",
            "LOX AND LOXL2 INHIBITORS AND USES THEREOF - The present application relates to anti-LOX and anti-LOXL2 antibodies and their use in purification, diagnostic and therapeutic methods. Antibodies include monoclonal antibodies, humanized antibodies and functional fragments thereof. Anti-LOX and anti-LOXL2 antibodies can be used to identify and treat conditions such as a fibrotic condition, angiogenesis, or to prevent a transition from an epithelial cell state to a mesenchymal cell state.",
            "METHODS AND COMPOSITIONS FOR TREATMENT AND DIAGNOSIS OF FIBROSIS, TUMOR INVASION, ANGIOGENESIS, AND METASTASIS - Provided are methodology, compositions and kits to prevent and treat diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, using processed lysyl oxidase or lysyl oxidase-like protein inhibitors, LOX inhibitors and LOXL inhibitors, or synergistic combinations of such inhibitors with therapeutic agents. Provided are methods for selecting tumor invasion, angiogenesis and metastasis inhibiting agents, by contacting cells in EMT states with candidate agents and detecting changes in such states; and methods, compositions, and kits for diagnosing or monitoring diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, using molecules or agents specifically recognizing processed LOX or LOXL. Provided are methods, compositions, medical devices, systems and kits for preventing or treating diseases and conditions associated with fibrosis, including pathological cardiovascular conditions and diseases, e.g., hypertension, hypertensive heart disease, myocardial infarction, atherosclerosis, restenosis, liver fibrosis, kidney fibrosis, lung fibrosis, dermal scaring, keloid formation, and Alzheimer's disease, with LOX or LOXL inhibitors.",
            "LOX AND LOXL2 INHIBITORS AND USES THEREOF - The present application relates to anti-LOX and anti-LOXL2 antibodies and their use in purification, diagnostic and therapeutic methods. Antibodies include monoclonal antibodies, humanized antibodies and functional fragments thereof. Anti-LOX and anti-LOXL2 antibodies can be used to identify and treat conditions such as a fibrotic condition, angiogenesis, or to prevent a transition from an epithelial cell state to a mesenchymal cell state.",
            "LOX AND LOXL2 INHIBITORS AND USES THEREOF - The present application relates to anti-LOX and anti-LOXL2 antibodies and their use in purification, diagnostic and therapeutic methods. Antibodies include monoclonal antibodies, humanized antibodies and functional fragments thereof. Anti-LOX and anti-LOXL2 antibodies can be used to identify and treat conditions such as a fibrotic condition, angiogenesis, or to prevent a transition from an epithelial cell state to a mesenchymal cell state.",
            "METHODS AND COMPOSITIONS FOR TREATMENT AND DIAGNOSIS OF FIBROSIS, TUMOR INVASION, ANGIOGENESIS, AND METASTASIS - Provided are methodology, compositions and kits to prevent and treat diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, using processed lysyl oxidase or lysyl oxidase-like protein inhibitors, LOX inhibitors and LOXL inhibitors, or synergistic combinations of such inhibitors with therapeutic agents. Provided are methods for selecting tumor invasion, angiogenesis and metastasis inhibiting agents, by contacting cells in EMT states with candidate agents and detecting changes in such states; and methods, compositions, and kits for diagnosing or monitoring diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, using molecules or agents specifically recognizing processed LOX or LOXL. Provided are methods, compositions, medical devices, systems and kits for preventing or treating diseases and conditions associated with fibrosis, including pathological cardiovascular conditions and diseases, e.g., hypertension, hypertensive heart disease, myocardial infarction, atherosclerosis, restenosis, liver fibrosis, kidney fibrosis, lung fibrosis, dermal scaring, keloid formation, and Alzheimer's disease, with LOX or LOXL inhibitors.",
            "ANTIBODIES THAT BIND TO LYSYL OXIDASE-LIKE 2 (LOXL2) AND METHODS OF USE THEREFOR - The present disclosure provides lysyl oxidase-like-2 (LOXL2) polypeptide binding agents, including, for example, antibodies that specifically bind a LOXL2 polypeptide; and further provides compositions comprising same. The binding agents can be used in various treatment and diagnostic methods, which are also provided.",
            "ANTIBODIES THAT BIND TO LYSYL OXIDASE-LIKE 2 (LOXL2) AND METHODS OF USE THEREFOR - The present disclosure provides lysyl oxidase-like-2 (LOXL2) polypeptide binding agents, including, for example, antibodies that specifically bind a LOXL2 polypeptide; and further provides compositions comprising same. The binding agents can be used in various treatment and diagnostic methods, which are also provided.",
            "METHODS AND COMPOSITIONS FOR TREATMENT AND DIAGNOSIS OF FIBROSIS, TUMOR INVASION, ANGIOGENESIS, AND METASTASIS - The present disclosure provides innovative methodology and related compositions and kits for preventing and treating various diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, by using an inhibitor of processed forms of lysyl oxidase or lysyl oxidase-like proteins, an inhibitor of LOX and an inhibitor of a LOXL, or a synergistic combination of an inhibitor of LOX or LOXL combined with other therapeutic agents. Also provided are innovative methods for selecting agents that prevent or inhibit tumor invasion, angiogenesis and metastasis, by contacting cells that are in an epithelial-mesenchymal transition (EMT) state with a candidate agent and detecting a change in the EMT state of the cells. Methods and related compositions and kits for diagnosing or monitoring various diseases associated with abnormal cell proliferation, angiogenesis and fibrosis, by using molecules or agents that specifically recognize processed forms of LOX or LOXL are also provided. Also provided herein are methods and related compositions, medical devices, systems and kits for preventing or treating various diseases and conditions associated with fibrosis with compositions comprising inhibitors of LOX or LOXL. Such diseases or conditions include pathological cardiovascular conditions and diseases such as hypertension, hypertensive heart disease, myocardial infarction, atherosclerosis, and restenosis, liver fibrosis, kidney fibrosis, lung fibrosis, dermal scaring, keloid formation, and Alzheimer's disease.",
            "PYRIMIDINEDIONE COMPOUNDS - Provided are novel pyrimidine dione compounds and pharmaceutically acceptable salts thereof, that are useful for the treatment of hypertrophic cardiomyopathy (HCM) and conditions associated with left ventricular hypertrophy or diastolic dysfunction. The synthesis and characterization of the compounds and pharmaceutically acceptable salts thereof, are described, as well as methods for treating HCM and other forms of heart disease.",
            "CYCLOALKYL-SUBSTITUTED PYRIMIDINEDIONE COMPOUNDS - The present invention provides novel cycloalkyl-substituted pyrimidine dione compounds that are useful for the treatment of hypertrophic cardiomyopathy (HCM) and conditions associated with left ventricular hypertrophy or diastolic dysfunction. The synthesis and characterization of the compounds is described, as well as methods for treating HCM and other forms of heart disease."
        ],
        [
            "Published",
            "02-26-2009",
            "04-23-2009",
            "08-18-2011",
            "04-12-2012",
            "04-18-2013",
            "12-05-2013",
            "03-20-2014",
            "05-08-2014",
            "09-11-2014",
            "10-09-2014",
            "11-27-2014",
            "12-25-2014",
            "12-25-2014"
        ]
    ],
    "pageTitle": "Rodriguez, CA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/rodriguez-ca-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434564287,
    "recordOffset": 434533380,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hector Rodriguez, Brisbane, CA US 06-10-2010 System and Method for Establishing Electronic Business Systems for Supporting Communications Services Commerce - A comprehensive electronic business support system comprises three layers: (1) the business layer, including various smart components which unify data and business processes across all customer interactions; (2) the integration layer, including various communications messaging interfaces and enterprise application integration adapters, which provide a flexible, automated, and process driven solution for integrating across business applications and operations support systems; and (3) the presentation layer, including various customer views, which are presented via particular business portals. A smart component server provides the core services and comprehensive business process logic required to successfully conduct business online. The communications messaging interfaces integrate with back-office systems for functions such as billing, provisioning, and interconnection. 20100145718 Published Description Patent application number Hal Rodriguez, San Francisco, CA US 10-22-2009 PET WASTE COLLECTION TOOL WITH INTEGRATED LEASH - A pet waste collection tool includes a body portion, a retractable trigger, a scoop portion, a chain, a leash attachment member, and a leash. The body portion may include a first end, a second end, and a handle portion. The retractable trigger may be coupled on one end to the body portion. The scoop portion may be coupled to the body portion and may comprise a fixed member coupled to the second end and a pivotal member coupled to the fixed member. The chain",
    "textAfterTable": "Patent applications by Hector Rodriguez, Brisbane, CA US Hector Javier Rodriguez, Daly City, CA US Patent application number Description Published 20090240627 PAYMENT PROCESSING SYSTEM TRUSTED AGENT IDENTIFICATION - Compliance with data security requirements is determined for an agent that processes transactions for merchants. An authorization request received from the agent for a transaction on an account that includes a bank identification number (BIN) licensed to an acquirer and an agent unique account result (AUAR) for the agent. The AUAR is valid when a primary account number (PAN) corresponding to the account and an agent identifier can be derived from the AUAR. The AUAR is invalid when the PAN lacks such correspondence or when the agent identifier lacks uniqueness among other agent identifiers. The acquirer receives the identify of the agent and the BIN when the AUAR is invalid, when the agent isn't registered to use the BIN, and when the agent identifier is invalid. When the agent is not registered to use the BIN, the acquirer will be informed. 09-24-2009 James E. Rodriguez, Aliso Viejo, CA US Patent application number Description Published 20080264497 Valve position indicator - A position",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}