{
    "relation": [
        [
            "No of thousand per annum",
            "L1000",
            "2000",
            "3000",
            "4000",
            "5000",
            "6000",
            "7000",
            "8000",
            "9000",
            "10,000",
            "11,000",
            "12,000",
            "13,000"
        ],
        [
            "Total tax subtracted",
            "L21",
            "59",
            "109",
            "184",
            "284",
            "434",
            "634",
            "880",
            "1100",
            "1530",
            "1930",
            "2380",
            "2880"
        ],
        [
            "Net produce",
            "L979",
            "1941",
            "2891",
            "3816",
            "4716",
            "5566",
            "6366",
            "7120",
            "7900",
            "8470",
            "9070",
            "9620",
            "10,120"
        ]
    ],
    "pageTitle": "The Rights Of Man",
    "title": "",
    "url": "http://xroads.virginia.edu/~hyper/Paine/rightsX.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.92/warc/CC-MAIN-20150728002310-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 858446007,
    "recordOffset": 858397357,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{84549=The tax on houses and windows is one of those direct taxes, which, like the poor-rates, is not confounded with trade; and, when taken off, the relief will be instantly felt. This tax falls heavy on the middle class of people. The amount of this tax, by the returns of 1788, was:, 48541=These matters admitted, the national expenses might be put back, for the sake of a precedent, to what they were at some period when France and England were not enemies. This, consequently, must be prior to the Hanover succession, and also to the Revolution of 1688.*[32] The first instance that presents itself, antecedent to those dates, is in the very wasteful and profligate times of Charles the Second; at which time England and France acted as allies. If I have chosen a period of great extravagance, it will serve to show modern extravagance in a still worse light; especially as the pay of the navy, the army, and the revenue officers has not increased since that time., 144789=It is now towards the middle of February. Were I to take a turn into the country, the trees would present a leafless, wintery appearance. As people are apt to pluck twigs as they walk along, I perhaps might do the same, and by chance might observe, that a single bud on that twig had begun to swell. I should reason very unnaturally, or rather not reason at all, to suppose this was the only bud in England which had this appearance. Instead of deciding thus, I should instantly conclude, that the same appearance was beginning, or about to begin, every where; and though the vegetable sleep will continue longer on some trees and plants than on others, and though some of them may not blossom for two or three years, all will be in leaf in the summer, except those which are rotten. What pace the political summer may keep with the natural, no human foresight can determine. It is, however, not difficult to perceive that the spring is begun.- Thus wishing, as I sincerely do, freedom and happiness to all nations, I close the SECOND PART., 27103=Notwithstanding taxes have increased and multiplied upon every article of common consumption, the land-tax, which more particularly affects this \"pillar,\" has diminished. In 1778 the amount of the land-tax was L1,950,000, which is half-a-million less than it produced almost a hundred years ago,*[30] notwithstanding the rentals are in many instances doubled since that period., 28343=Several of the most heavy and productive taxes are so contrived, as to give an exemption to this pillar, thus standing in its own defence. The tax upon beer brewed for sale does not affect the aristocracy, who brew their own beer free from this duty. It falls only on those who have not conveniency or ability to brew, and who must purchase it in small quantities. But what will mankind think of the justice of taxation, when they know that this tax alone, from which the aristocracy are from circumstances exempt, is nearly equal to the whole of the land-tax, being in the year 1788, and it is not less now, L1,666,152, and with its proportion of the taxes on malt and hops, it exceeds it.- That a single article, thus partially consumed, and that chiefly by the working part, should be subject to a tax, equal to that on the whole rental of a nation, is, perhaps, a fact not to be paralleled in the histories of revenues., 117723=There now remains only the national debt to be considered. In the year 1789, the interest, exclusive of the tontine, was L9,150,138. How much the capital has been reduced since that time the minister best knows. But after paying the interest, abolishing the tax on houses and windows, the commutation tax, and the poor-rates; and making all the provisions for the poor, for the education of children, the support of the aged, the disbanded part of the army and navy, and increasing the pay of the remainder, there will be a surplus of one million., 42552=With the Revolution of 1688, and more so since the Hanover succession, came the destructive system of continental intrigues, and the rage for foreign wars and foreign dominion; systems of such secure mystery that the expenses admit of no accounts; a single line stands for millions. To what excess taxation might have extended had not the French revolution contributed to break up the system, and put an end to pretences, is impossible to say. Viewed, as that revolution ought to be, as the fortunate means of lessening the load of taxes of both countries, it is of as much importance to England as to France; and, if properly improved to all the advantages of which it is capable, and to which it leads, deserves as much celebration in one country as the other., 44079=The amount of taxes for the year ending at Michaelmas 1788, was as follows:, 86417=Among the taxes most heavily felt is the commutation tax. I shall therefore offer a plan for its abolition, by substituting another in its place, which will effect three objects at once: 1, that of removing the burthen to where it can best be borne; 2, restoring justice among families by a distribution of property; 3, extirpating the overgrown influence arising from the unnatural law of primogeniture, which is one of the principal sources of corruption at elections. The amount of commutation tax by the returns of 1788, was L771,657.}",
    "lastModified": "Thu, 06 Nov 2003 05:06:57 GMT",
    "textBeforeTable": "Annual taxes levied by William the Conqueror, In contemplating a subject that embraces with equatorial magnitude the whole region of humanity it is impossible to confine the pursuit in one single direction. It takes ground on every character and condition that appertains to man, and blends the individual, the nation, and the world. From a small spark, kindled in America, a flame has arisen not to be extinguished. Without consuming, like the Ultima Ratio Regum, it winds its progress from nation to nation, and conquers by a silent operation. Man finds himself changed, he scarcely perceives how. He acquires a knowledge of his rights by attending justly to his interest, and discovers in the event that the strength and powers of despotism consist wholly in the fear of resisting it, and that, in order \"to be free, it is sufficient that he wills it.\" Having in all the preceding parts of this work endeavoured to establish a system of principles as a basis on which governments ought to be erected, I shall proceed in this, to the ways and means of rendering them into practice. But in order to introduce this part of the subject with more propriety, and stronger effect, some preliminary observations, deducible from, or connected with, those principles, are necessary. Whatever the form or constitution of government may be, it ought to have no other object than the general happiness. When, instead of this, it operates to",
    "textAfterTable": "L15,572,755 Since the year 1788, upwards of one million new taxes have been laid on, besides the produce of the lotteries; and as the taxes have in general been more productive since than before, the amount may be taken, in round numbers, at L17,000,000. (The expense of collection and the drawbacks, which together amount to nearly two millions, are paid out of the gross amount; and the above is the net sum paid into the exchequer). This sum of seventeen millions is applied to two different purposes; the one to pay the interest of the National Debt, the other to the current expenses of each year. About nine millions are appropriated to the former; and the remainder, being nearly eight millions, to the latter. As to the million, said to be applied to the reduction of the debt, it is so much like paying with one hand and taking out with the other, as not to merit much notice. It happened, fortunately for France, that she possessed national domains for paying off her debt, and thereby lessening her taxes; but as this is not the case with England, her reduction of taxes can only take place by reducing the current expenses, which may now be done to the amount of four or five millions annually, as will hereafter appear. When this is accomplished it will more than counter-balance the enormous charge of the American war; and the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}