{
    "relation": [
        [
            "First Name",
            "Kelly",
            "David"
        ],
        [
            "Last Name",
            "Kolb",
            "Garriepy"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=9BB609BD-30CF-436D-8ACB-5344117DA554&filingTypeID=82",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224489901,
    "recordOffset": 224479995,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14902=Wall Street Reform & Consumer Protection Act; Federal Reserve Implementation of Dodd-Frank interchange limitations; Legislation to delay implementation of the Durbin Amendment interchange limitations -- Debit Interchange Fee Study Act of 2011 (S 575) and Consumers Payment System Protection Act (HR 1081); Issues relating to Credit CARD Act; Regulation Z proposed revisions to Ability-to-Pay Requirements of Individual Credit Accounts (Docket No. R-1393); Regulation Z proposed rules concerning changes to Debt Cancellation Disclosures (Docket no. R-1390); Consumer Debit Card Protection Act (HR 3156), 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 35160=Issues related to the Safe Port Reauthorization Act; 9/11 Recommendations Implementation Act of 2007, 20048=Wall Street Reform and Consumer Protection Act; issues related to consumer credit; Regulation Z proposed revisions to Ability-to-Pay Requirements of Individual Credit Accounts (Docket No. R-1393) and proposed rules concerning changes to Debt Cancellation Disclosures (Docket no. R-1390); Issues related to the Credit CARD Act; SEC IFRS Convergence; SEC proposed rules implementing Dodd-Frank corporate governmenance changes (including CEO-median pay ratio disclosure, shareholder approval of executive compensation, whistleblower award program, independence of compensation committees and advisors); HR 1062, Burdensome Data Collection Relief Act; Debt limit; HR 1121, The Responsible Consumer Financial Protections Act of 2011; HR 1315, The Consumer Financial Protection Safety and Soundness Improvement Act of 2011; HR, 1667 Consumer Financial Protection Transfer Clarification Act; Foreign Bank and Financial Accounts (FBAR) reporting guidance; Financial Crimes Enformement Network (FinCEN) issues related to Bank Secrecy Act and final rule on prepaid access cards; issues related to notice and request for comment on defining larger participants in certain consumer financial products and services markets, CFPB docket No. CFPB-HQ-2011-2., 39495=Tax Legislation: Small Business Paperwork Mandate Elimination Act of 2011 (H.R. 4) and repeal of expanded 1099 reporting requirements; Tax Relief, Unemployment Insurance Reauthorization and Job Creation Act of 2010; Business and energy tax incentives/extenders (including 15-year cost recovery for improvements to qualified leaseholds and retail-owned property; deduction for state and local sales taxes; work opportunity tax credit; renewable energy tax credit; Subpart F active-financing and look-through exceptions); PPACA employer mandate repeal (HR 1744, S20); tax reform generally; value-added/national retail sales tax proposals; proposals to modify/repeal the last-in-first-out (LIFO) and lower-of-cost-or-market (LCM) inventory accounting methods; international tax proposals (including deferral of tax on foreign earnings, foreign tax credits and transfers of intangible property); business entity classification rules, Budget Congrol Act (S. 365); American Jobs Act, repeal of 3% witholding (HR 674), payroll tax cut extension (HR 3630, HR 3764) Regulatory: Income recognition rules for advanced payments; repair and capitalization rules; treatment of vendor allowances; reporting of uncertain tax positions; bonus depreciation implementation, Form 1099K, income reporting. Other: Health care related tax provisions; tax issues related to the Patient Protection and Affordable Care Act (P.L. 111-148) Health Care and Education Reconciliation Act of 2010 (HR 111-152); FUTA surtax repeal, FUTA credit reductions, unemployment insurance reform (HR 1745, S. 386); state taxation of digital goods legislation (HR 1860, S. 971); sales-tax collection legislation (S. 1452, S 1832, HR 2701, HR 3179)}",
    "textBeforeTable": "",
    "textAfterTable": "City Arlington State VA Zip Code 22209 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  WILLIAM HUGHES  7038412300  bills.hughes@rila.org 5. Senate ID#  20004-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}