{
    "relation": [
        [
            "Scenario",
            "Password reset requests",
            "Password reset responsiveness",
            "Completed approvals",
            "FIM Portal responsiveness",
            "General FIM Portal load"
        ],
        [
            "Counters to Turn On",
            "Calls or Calls Per Second on ServiceModelOperation instance resou##.resou##.put@##cemanagementservice|alternate",
            "Calls Duration on ServiceModelEndpoint instance resourcemanag##.resource @##cemanagementservice|alternate",
            "Calls or Calls Per Second on all ServiceModelEndpoint instances sequentialwor##.resourcefactory @[guid]",
            "Calls Duration on ServiceModelService instance resourcemanagementservice@exchange.mail",
            "Calls or Calls Per Second on ServiceModelService instance resourcemanagementservice@exchange.mail"
        ]
    ],
    "pageTitle": "Troubleshooting FIM 2010",
    "title": "",
    "url": "https://technet.microsoft.com/en-us/library/jj150427(d=printer,v=ws.10).aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898656375,
    "recordOffset": 898627738,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{87074=Migrating a configuration between two FIM Services often exposes unseen dependencies. To avoid many of these scenarios, follow the steps listed in the FIM 2010 Configuration Migration Tool Deployment Guide (http://go.microsoft.com/fwlink/?LinkID=165849) in the FIM documentation., 25062=Use this Troubleshooting Guide to help diagnose and resolve common issues encountered in your Microsoft® Forefront® Identity Manager (FIM) 2010 environment.}",
    "textBeforeTable": "The diagnostic log contains all Microsoft .NET exceptions from the FIM Service. The FIM log is an application-specific log found in the Event Viewer under Applications and Services Logs. FIM diagnostic log For more information, see the Workflow activities section. Request resources record the outcome of all operations in the FIM Service. Requests SOAP faults include diagnostic information that appears in the diagnostic log for the FIM management agent (MA). This information is not included by default for normal FIM Portal requests, and the FIM Portal user interface (UI) is not presently capable of displaying it. Simple Object Access Protocol (SOAP) faults The FIM Service makes diagnostic information available in four primary ways: FIM Service Use this Troubleshooting Guide to help diagnose and resolve common issues encountered in your Microsoft® Forefront® Identity Manager (FIM) 2010 environment. Troubleshooting FIM 2010 Test",
    "textAfterTable": "Resolution The first resolution step for any request failure is to inspect the request resource. To find the status of the request Find the request in Search Requests or in My Requests (use My Requests if you are investigating your own request). Open the request resource. On the Detailed Content tab, review the actual requested changes. Note the value that is listed in Request Status. Case 1: Request Status is “Denied” If the Request Status is Denied, refer to the Scenario: A request’s Request Status is “Denied” section. Case 2: Request Status is “Failed” If the Request Status is Failed, refer to the Scenario: A request’s Request Status is “Failed” section. Case 3: Request cannot be found If the request resource cannot be found, an error was likely encountered during the process of creating the request. The request may have timed out. The default timeout configuration for operations submitted to the FIM Service is 58 seconds, so if you notice that the request is taking longer than 58 seconds to process, the problem is likely due to a timeout. To collect more information to investigate the issue Repeat the request that is failing. Click Start, Programs, Administrative Tools, and then click Event Viewer. Click Applications and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}