{
    "relation": [
        [
            "This command...",
            "addHelpCommandGroup",
            "addHelpCommand"
        ],
        [
            "Enables you to...",
            "Adds a new help command group to those shown by the WLST help() command.",
            "Adds new command help for a command to an existing command group. Once added to the group, the command (along with a brief description) is displayed in the command list for the group when you enter the help('commandGroup') command."
        ],
        [
            "Use with WLST...",
            "Online or Offline",
            "Online or Offline"
        ]
    ],
    "pageTitle": "3 WLST Command and Variable Reference",
    "title": "",
    "url": "https://docs.oracle.com/middleware/1212/wls/WLSTC/reference.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00299-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 879986215,
    "recordOffset": 879904056,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{441860=The following example instructs WLST to wait 1000 seconds for HTTP sessions to complete or timeout (at 1000 seconds) before shutting down myserver:}",
    "lastModified": "Fri, 24 Jul 2015 11:50:26 GMT",
    "textBeforeTable": "Table 3-4 Customization Commands for WLST Configuration Use the WLST customization commands, listed in Table 3-4, to add the command group help and command help that is listed by the WLST help() and help('commandGroup') commands. For more information about adding command help to WLST, see \"Adding Integrated Help for Custom Commands\" in Understanding the WebLogic Scripting Tool. Customization Commands wlst:/offline/base_domain>validateConfig('InternalPortConflict')  The following example validates the internal listen port configuration in the domain base_domain: Example              Specify one of the following options: InternalPortConflict—Validate Administration Server and Managed Server listen port conflicts in the current domain configuration. ExternalPortConflict—Validate Administration Server and Managed Server listen port conflicts against ports in use by active processes on the current machine (host). KeyStorePasswords—Checks whether any selected template that contains a valid metadata does not yet have the credential store created for it.  option      Definition Argument     validateConfig(option)  Syntax",
    "textAfterTable": "addHelpCommandGroup Command Category: Customization Commands Use with WLST: Online or Offline Description Adds a new command help group to those shown by the WLST help() command, and specifies the resource bundle in which the help information is defined for the group. Syntax  addHelpCommandGroup(commandGroup, resourceBundleName) Argument Definition  commandGroup Use a unique name for the command group. Do not use a command group name that is already shown by the WLST help() command.  resourceBundleName Represents either a class name or property resource file name. The resource bundle contains help text for entries for the command group using a standard pattern. The resource bundle name will be passed to ResourceBundle.getBundle(...). Multiple command groups can use the same resource bundle. The resource bundle must be present in the classpath. See \"Adding Integrated Help for Custom Commands\" in Understanding the WebLogic Scripting Tool for information on how to define the help text",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}