{
    "relation": [
        [
            "Payment method",
            "",
            "Visa/MasterCard, Amex, Discover"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Volvo Penta 21766685 DPS B Ratio 2 14 Lower Unit Outdrive Boat Sterndrive | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/VOLVO-PENTA-21766685-DPS-B-RATIO-2-14-LOWER-UNIT-OUTDRIVE-BOAT-STERNDRIVE-/141120262598?pt=Boat_Parts_Accessories_Gear&hash=item20db6c51c6&vxp=mtr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00194-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 414101467,
    "recordOffset": 414058093,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{947=We stand behind our products and maintain great relationships with our customers. If you are having an issue, please contact us first before opening an eBay case and we will make every effort to resolve any concerns. We can be reached by eBay message or we are happy to take your call at 262-898-1855.}",
    "textBeforeTable": "Payment details BEFORE RETURNING ANY ITEM, contact us within 14 days for an approved RMA number and instuctions. Installed, powered, altered or unsellable items cannot be returned. Unapproved returns may be rejected at buyer's expense. Approved refunds shall be issued within 7 days of the return for the sale price less our original shipping cost (including our cost on “free shipping” items) minus 20% restock charge ($8 minimum). See the SELLER POLICY link on our listing/ad for full instructions and details. Return policy details The buyer is responsible for return shipping costs. Money back or item exchange (buyer's choice) 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy Ships to: United States",
    "textAfterTable": "Seller's payment instructions Paypal is our preferred method of payment. You may also call us at 262-898-1855 to pay by credit card over the phone. For more payment instructions, please click the link above to our Seller Policies. time left Current bid amount + Shipping amount Bid Count time left current bid + shipping bids",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}