{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 10 days Completed: Feb 2010 Languages: English to Russian",
            "Translation Volume: 5 days Completed: Feb 2010 Languages: English to Russian",
            "Translation Volume: 5 days Completed: Jan 2009 Languages: German to Russian"
        ],
        [
            "Project Summary",
            "PHARMACEUTICAL DETAILS of a vaccine Medical: Pharmaceuticals",
            "Translation of description of beauty aids Medical: Pharmaceuticals",
            "translation of the web-site Ferro-umformtechnik.de Mechanics / Mech Engineering"
        ],
        [
            "Corroboration",
            "positive Blue Board outsourcer (20 to 50 entries): Professional Translator. Friendly correspondence. Recommended",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "Experienced and Reliable German and English to Russian (native) and Tatar (native) translator, PhD",
    "title": "",
    "url": "http://www.proz.com/translator/974254?show_mode=profile&float=&no_arrows=y&forceview=&show_mode=portfolio",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00052-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 666655911,
    "recordOffset": 666628814,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "3 projects entered    1 positive feedback from outsourcers Project History PRO-level points: 1373, Questions answered: 2045, Questions asked: 187 KudoZ activity (PRO) EUR Preferred currency Less More Russian to English - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour Bashkir to Russian - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour German to Russian - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour English to Russian - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour Russian to German - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour German to Tatar - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour Tatar to Russian - Rates: 0.05 - 0.08 EUR per word / 20 - 30 EUR per hour",
    "textAfterTable": "More Less Payment methods accepted Visa, MasterCard Portfolio Sample translations submitted: 2 English to Russian: Ellis Island Immigration Museum Source text - English Ellis Island Immigration Museum Stop 2 – Baggage Room MALE 1– Walk over to the large display of luggage in the center of this room. In 1921, Eleanor Lenhart arrived with her family at the ferry slip behind you. It had been about two weeks since they’d left England. She was 7 years old. FEMALE 3 They put the gang plank down and there was a man at the foot and he was shouting at the top of his voice, “put your luggage here, drop your luggage here, men this way, women and children this way.” MALE 1 – For Eleanor and millions of other immigrants, this was their introduction to America. Beginning in 1892, all third-class and steerage passengers arriving by steamship to the Port of New York came through Ellis Island.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}