{
    "relation": [
        [
            "Patent application number",
            "20100069368",
            "20110065708",
            "20120142681",
            "20120302570",
            "20130005663",
            "20140004101"
        ],
        [
            "Description",
            "Organic Compounds and Their Uses - The present disclosure relates to compounds relating to the diagnosis and treatment of pathologies relating to the Hedgehog pathway, including but not limited to tumor formation, cancer, neoplasia, and non-malignant hyperproliferative disorders; specifically relating to compounds of formula I:",
            "HETEROCYCLIC OXIME COMPOUNDS - The invention relates to compounds of formula (I) and salts thereof:",
            "HETEROCYCLIC HYDRAZONE COMPOUNDS - The invention relates to compounds of formula (I) and salts thereof: wherein the substituents are as defined in the specification; a compound of formula (I) for use in the treatment of the human or animal body, in particular with regard to c-Met tyrosine kinase mediated diseases or conditions; the use of a compound of formula (I) for manufacturing a medicament for the treatment of such diseases; pharmaceutical compositions comprising a compound of the formula (I), optionally in the presence of a combination partner, and processes for the preparation of a compound of formula (I).",
            "HETEROCYCLIC OXIME COMPOUNDS - The invention relates to compounds of formula (I) and salts thereof:",
            "SMAC PEPTIDOMETICS USEFUL AS IAP INHIBITORS - The present invention is directed to a compound of the formula:",
            "SMAC PEPTIDOMETICS USEFUL AS IAP INHIBITORS"
        ],
        [
            "Published",
            "03-18-2010",
            "03-17-2011",
            "06-07-2012",
            "11-29-2012",
            "01-03-2013",
            "01-02-2014"
        ]
    ],
    "pageTitle": "Dai, Shanghai - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/dai-shanghai-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00026-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442227239,
    "recordOffset": 442197589,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Miao Dai, Shanghai CN 07-02-2015 SILICON-CONTROLLED RECTIFIER ELECTROSTATIC DISCHARGE PROTECTION DEVICE AND METHOD FOR FORMING THE SAME - Various embodiments provide SCR ESD protection devices and methods for forming the same. An exemplary device includes a semiconductor substrate having a P-type well region, an N-type well region adjacent to the P-type well region, a first P-type doped region and a first N-type doped region in the P-type well region, and a second N-type doped region and a second P-type doped region in the N-type well region. A first center-doped region and a second center-doped region doped with impurity ions of a same type are located between the first N-type doped region and the second P-type doped region and extend across the P-type well region and the N-type well region. The first center-doped region is located within the second center-doped region, has a doping concentration higher than a doping concentration in the second center-doped region, and has a depth smaller than a depth of the second center-doped region. 20150187749 Published Description Patent application number Meng Dai, Shanghai CN 07-24-2014 TRIAZINONE COMPOUNDS - The invention provides a compound of Formula (I) 20140206663 Published Description Patent application number Linlin Dai, Shanghai CN 12-26-2013",
    "textAfterTable": "Patent applications by Miao Dai, Shanghai CN Minghui Dai, Shanghai CN Patent application number Description Published 20150194254 MAGNETIC CORE STRUCTURE AND ELECTRIC REACTOR - The present application discloses a magnetic core structure and an electric reactor. The magnetic core structure includes an upper cover plate and a lower cover plate which are arranged oppositely and at least one wrapping post having two ends connected to the upper cover plate and lower cover plate, respectively. A cross-sectional area of the upper cover plate and/or of the lower cover plate is larger than that of the wrapping post. The upper cover plate, the lower cover plate and the wrapping post are made of a magnetic powder core material, an amorphous material, a nanocrystalline material or a silicon steel material. Since the cross-sectional area of the upper cover plate and/or of the lower cover plate is larger than that of the wrapping post, this may bring excellent DC-Bias characteristic to an electric reactor or inductor, and make the electric reactor or inductor have lower magnetic core loss. 07-09-2015 Mingzeng Dai, Shanghai CN Patent application number Description Published 20120034948 METHOD, DEVICE, AND SYSTEM FOR",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}