{
    "relation": [
        [
            "Rune",
            "Rune of the Fallen Crusader",
            "Rune of the Stoneskin Gargoyle"
        ],
        [
            "Type",
            "Heal",
            "Armor, Stamina"
        ],
        [
            "Level",
            "70",
            "72"
        ],
        [
            "Weapon Type",
            "Any",
            "Two-handed"
        ]
    ],
    "pageTitle": "Death Knight - WoWWiki - Your guide to the World of Warcraft",
    "title": "",
    "url": "http://wowwiki.wikia.com/Death_Knight?diff=cur&oldid=2622810",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 269409411,
    "recordOffset": 269335870,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{214130=A new group of death knights, the Death knights of Acherus, was later created by the Lich King to garrison the necropolis of Acherus: The Ebon Hold for the ultimate purpose of assaulting Light's Hope Chapel and destroying the Argent Dawn. In the Wrath of the Lich King expansion, these death knights are freed from the will of the Lich King and ally themselves with their former factions. Working closely under the guiding blade of Highlord Darion Mograine and the bolstered Argent Crusade, the newly-freed death knights have begun their march to Northrend.}",
    "textBeforeTable": "Runeforges can be found in Acherus: The Ebon Hold or in some of the Icecrown questing areas inside of the metal dams. A weapon can have an enchant from either runeforging or from Enchanting, but not both together (the runeforging enchants are always better for the death knight). A player will have to be near a runeforge in order to forge a rune onto their weapon. Once a weapon has been engraved with a rune it is impossible for the rune to be removed, though it can be changed at a runeforge. Also, even if it is not soulbound, once a weapon has been engraved with a rune it is impossible for that weapon to be traded. Runeforging allows the death knight to permanently enchant their weapon with enchants that are typically more powerful than enchants available to other classes. The enchants work just like the permanent weapon enchants provided by Enchanting, but are self-only and are designed specifically to benefit the death knight class. These are independent of the rune resource system. Runeforge Main article: Runeforging",
    "textAfterTable": "Rune of Spellshattering Anti-caster 57 Two-handed Rune Type Level Weapon Type Rune of the Fallen Crusader Heal 70 Any Rune of the Stoneskin Gargoyle Armor, Stamina 72 Two-handed Level Abilities (choose one) 56 Plaguebearer Plague Leech Unholy Blight 57 Lichborne Anti-Magic Zone Purgatory 58 Death's Advance Chillblains Asphyxiate 60 Blood",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}