{
    "relation": [
        [
            "Part #",
            "TC7WH157FU(TE12L,F)",
            "NTE74LS257",
            "RC28D",
            "SN74928N",
            "TC7WH157FU(TE12L)"
        ],
        [
            "Distributor",
            "Digi-Key",
            "AmericanMicroSemi",
            "Radwell",
            "Radwell",
            "National Microchip"
        ],
        [
            "Manufacturer",
            "Toshiba Semiconductor and Storage",
            "AMS",
            "Nec",
            "Texas Instruments Semi",
            "Toshiba"
        ],
        [
            "Product Category",
            "Integrated Circuits (ICs)",
            "Interface ICs:Digital Multiplexers:2-Line",
            "Telecommunications, Telecom Accessories",
            "Components, IC Chip",
            "Not Provided"
        ],
        [
            "Description",
            "IC MULTIPLEXER DIGITAL SM8",
            "IC-TTL QUAD MULTIPLEXER",
            "CHASIS ONLY DIGITAL MULTIPLEXER",
            "IC 2 INPUT DIGITAL MULTIPLEXER",
            "IC MULTIPLEXER DIGITAL SM8-8"
        ]
    ],
    "pageTitle": "Digital Multiplexer | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/digital_multiplexer",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468186735,
    "recordOffset": 468151917,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{70819=Description: . The MAX4999 is a differential 8:1 multiplexer. The MAX4999 features three digital inputs to control the signal path. Typical applications include switching a USB connector between eight USB hosts and a USB device. An enable input (EN) is provided to disable all channels and place the device, 57588=Description: S.I Tech Model 2006 Bit-Driver multiplexer is ideal for in-house data transmission where you have clustered terminal situations. It delivers eight full duplex ports capable of moving up to 19.2 Kbps in either synchronous or asynchronous modes, without using flow control or buffering techniques, 91008=Description: , or 3 and 4-wire modes for resistive measurements including RTDs and thermistors. With SCXI front-mounting terminal blocks, the SCXI-1127 becomes an 64x1 1-wire multiplexer, 32x1 2-wire multiplexer, 16x1 4-wire multiplexer, or 4x8 2-wire matrix. Expand the measurement power of your digital multimeter, 54010=Description: The NI PXIe-2527 is a high-voltage multiplexer switch module designed for medium- to high-density automated test systems. With a switching capacity of up to 300 VDC/300 VAC and up to 2 A, the NI PXIe-2527 is an effective front end for NI 4070 and NI 4072 digital multimeters, offering simple channel, 106910=Description: Fiber Optic Extension Features: SMPTE 259M and 305M Extension 143Mbps, 177Mbps, 270Mbps and 360Mbps supported Multimode and Single Mode Fiber Support Distances over 100Km Up to 30 SDI Extenders in a Single EdgeAccess®‚ UCS Model 1000 Chassis WWDM Wavelengths for Wave Division}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Modernizing a Passive Sonar Which Has a Beam-Former with Digital Output The customer's requirement is to capture 10 signals, lasting 0.6 milliseconds each. 120 such signals arrive sequentially from a multiplexer within a beam-former. The clock rate is 2 MHz. The beam-former creates 120 beams and the raw digital data (underwater acoustic signal) from each beam Using Digital Potentiometers to Design Low-Pass Adjustable Filters The most common filter found in a data acquisition system signal path is a low-pass filter. This type of filter is usually used to reduce A/D Converter (ADC) aliasing errors. If there is more than one signal that is applied to the A/D converter through a multiplexer, each signal source may have its Bridge Sensing with the MCP6S2X PGAs Resistive sensors configured as Wheatstone bridges are primarily used to sense pressure, temperature or loads. An external A/D converter (ADC) and a digitally Programmable Gain Amplifier (PGA) can easily be used to convert the difference voltage from these resistor bridge sensors to usable digital Sensing Light with a Programmable Gain Amplifier of the PGA / Analog-to- Digital (A/D) conversion allows the photo sensor input signal to",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}