{
    "relation": [
        [
            "Patent application number",
            "20120207967",
            "20140127112"
        ],
        [
            "Description",
            "CEMENT TO MAKE THERMAL SHOCK RESISTANT CERAMIC HONEYCOMB STRUCTURES AND METHOD TO MAKE THEM - An improved ceramic honeycomb structure is comprised of at least two separate smaller ceramic honeycombs that have been adhered together by a cement layer comprised of a cement layer has at least two regions of differing porosity or cement layer where the ratio of toughness/Young's modulus is at least about 0.1 MPa·m",
            "METHOD FOR MAKING POROUS ACICULAR MULLITE BODIES - Acicular mullite bodies are made in two-step firing process in which a green body is converted first to a fluorotopaz and then to acicular mullite. The bodies are contained within an enclosed region of the furnace. A flow of process gas is provided through the enclosed region during the fluorotopaz-forming step. The process gas is introduced into the enclosed region through multiple openings on at least one side of the enclosed region, and withdrawn through multiple openings on another side of the enclosed region. During the acicular mullite-forming step, a flow of purge gas is maintained in the exterior portion of the furnace. This purge gas may be removed by flowing it into the enclosed region of the furnace and out of the furnace from the enclosed region without re-entering the exterior portion for the furnace."
        ],
        [
            "Published",
            "08-16-2012",
            "05-08-2014"
        ]
    ],
    "pageTitle": "Goss, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/goss-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441610143,
    "recordOffset": 441575555,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Janet M. Goss, Saginaw, MI US 09-01-2011 TARGETED DELIVERY OF GLYCINE RECEPTORS TO EXCITABLE CELLS - The invention provides a method of modulating electrophysiological activity of an excitable cell. The method involves causing exogenous expression of a glycine receptor (GlyR) protein in an excitable cell of a subject. Thereafter, the excitable cell is exposed to an allosteric modulator of the GlyR protein. Modulation of the exogenous GlyR protein (an ion channel) in response to the allosteric modulator modulates the electrophysiological activity of the excitable cell. The method can be used to control pain in a subject. The invention further provides a replication-defective HSV vector comprising an expression cassette encoding a GlyR protein, stocks and pharmaceutical compositions containing such vectors, and a transgenic animal. 20110213017 11-20-2008 Targeted delivery of glycine receptors to excitable cells - The invention provides a method of modulating electrophysiological activity of an excitable cell. The method involves causing exogenous expression of a glycine receptor (GlyR) protein in an excitable cell of a subject. Thereafter, the excitable cell is exposed to an allosteric modulator of the GlyR protein. Modulation of the exogenous GlyR protein (an ion channel) in response to the allosteric modulator modulates the electrophysiological activity of the excitable cell. The method can be used to control pain in a subject. The invention further provides a replication-defective HSV vector comprising an expression cassette encoding a GlyR protein, stocks and pharmaceutical compositions containing such vectors, and a transgenic animal. 20080289058",
    "textAfterTable": "Jeffrey E. Goss, Asheville, NC US Patent application number Description Published 20130185357 Method for Advertising and Marketing Goods and Services Using an Online Lifestyle Shopping Center - A social networking system electronically assimilates a database of social networking system (SNS) member profiles and associated brand websites on a server connected by a data communications network to a plurality of remote computers. The system utilizes a respective psychographic profile to establish a lifestyle center website on the social networking system server, and the lifestyle center website includes a first set of digital content data related to the psychographic profile. The lifestyle center website displays an anchor tenant website hosted on the SNS server and having a second set of digital content data related to the psychographic profile. The system further identifies social networking system member profiles that match the identified psychographic profile for the lifestyle center website. The system allows SNS members and brand owners to connect within the social networking system for a more efficient online shopping experience. 07-18-2013 John Goss, Tucson, AZ US Patent application number Description Published 20140334893 Two Point Wheelchair Securement System - The embodiments described and claimed herein are improved wheelchair passenger securement systems and stations. In particular, one embodiment described and claimed herein is a drop-in system comprising a barrier module and a wall-side module, which incorporate two separate restraint devices which are configured to",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}