{
    "relation": [
        [
            "Value",
            "0",
            "0x8CCC0075 (2362179701)",
            "0x8CCC0060 (2362179680)",
            "0x8CCC005E (2362179678)",
            "0x8CCC00D1 (2362179793)",
            "0x8CCC005F (2362179679)",
            "0x8CCC00D0 (2362179792)"
        ],
        [
            "Definition",
            "Unknown",
            "Login request to authenticate user has timed out. Possible causes include LDAP server misconfiguration such as LDAP server referrals misconfiguration or Unified CM node experiencing high CPU usage. Recommended action is to verify the CPU utilization is in the safe range for Unified CM (this can be monitored using RTMT via CPU Pegging Alert)",
            "Directory login failed. Verify that credentials are not misconfigured, check the userID and password configured in the application matches with what is configured in Unified CM Admin under (User Management > End User/Application User)",
            "Directory is unavailable. Verify that the LDAP server is reachable from Unified CM node, make sure that the network connectivity between Unified CM and the LDAP server by pinging the LDAP server host from Cisco Unified OS Administration and take steps to establish connectivity if it has been lost",
            "Application is connecting to a non secure port but has security privileges enabled for the user associated with the application. Check the user group configuration for the user in Unified CM Admin under (User Management > End User/Application User), select the user and verify the associated permissions information",
            "Standard CTI Use permission is not enabled. Users associated with applications are required to be included in \"Standard CTI Enabled\" user group. Verify the user group configuration for the user in Unified CM Admin under (User Management > End User/Application User), select the user and review the associated permissions information",
            "User is not enabled for a secure connection but the application connecting to secure port. Consider the application configuration and security configuration for the user, for TAPI applications review the Control Panel > Phone and Modem Options > Advanced > select a CiscoTSP > Configure... > Security and disable \"Secure Connection to CTIManager\". For JTAPI applications from JTPrefs choose Security and disable Enable Secure Connection. Also check the user group configuration for the user in Unified CM Admin under (User Management > End User/Application User), select the user and verify the associated permissions information"
        ]
    ],
    "pageTitle": "Cisco Unified Communications Manager Managed Services Guide, Release 9.0(1) - Cisco Unified Serviceability alarms and CiscoLog messages [Cisco Unified Communications Manager (CallManager)] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cucm/service/9_0/rtmt/CUCM_BK_CCC892E7_00_cucm-managed-services-guide-90/CUCM_BK_CCC892E7_00_cucm-manager-managed-services-guide_chapter_0110.html?referring_site=smartnavRD",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374689391,
    "recordOffset": 374565883,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{105728=The maximum length of a complete CiscoLog message must not exceed 800 octets.The term octet is used for 8-bit data type instead of byte because byte is not 8 bits on some platforms. The words \"character\" and \"octet\" are not synonyms in parts of this specification because in places were internationalization is supported a single character may need to be represented with multiple octets. This limit is dictated by RFC 3164. The limit of 1024 octets reserves some extra space for syslog forwarding headers and/or fields that may be formalized in later specifications.}",
    "TableContextTimeStampAfterTable": "{45505=Must be one of the following three-character month designations followed by a single space (ASCII decimal value 32) as a delimiter character: Jan, Feb, Mar, Apr, May, Jun, Jul, Sep, Oct, Nov or Dec., 738695=CISCO_TELEPRESENCE_1000}",
    "textBeforeTable": "The following table details each field specification. Devices which are not aware of their clock, may choose to provide an uptime as a relative measure of time. If device is capable of providing uptime, it is recommended that does so as a substitute for unavailable time stamp. If uptime is provided it must be provided with a standard uptime tag as outlined in the CiscoLog Standard Tags specification. 11: host.domain.com: --- 00 0000 00:00:00.000 ---: %BACC-3-BAD_REQUEST: Bad request received from device [1.2.3.4]. Missing header. In some cases, it is possible that a device may not have the knowledge of the date and/or time due to hardware or software limitations. In such circumstances, the following string must be produced TIMESTAMP field: \"--- 00 0000 00:00:00.000 ---\". Below is an example of a CiscoLog message from a device which has no knowledge of date and/or time: *Feb 14 2003 01:02:03.005 EST Jun 22 2003 05:11:52.525 -0300 Jun 13 2003 23:11:52.454 UTCJun 3 2003 23:11:52.454 UTC Below are several examples of valid time stamps:  [ACCURACY]<MONTH> <DAY> <YEAR> <HOUR>:<MINUTES>:<SECONDS>.<MILLISECONDS> <TIMEZONE> The TIMESTAMP field provides date with year, time with milliseconds and a time zone identifier in the following format:   TIMESTAMP field  %BACC-3-BAD_REQUEST: Bad request received from device [1.2.3.4]. Missing header. 11: 1080:0:0:800:ba98:3210:11aa:12dd:",
    "textAfterTable": "SECONDS Must consist of exactly two number characters. Values range from 00 to 59. If seconds value is a single digit, it must be prefixed with a single zero character. The seconds value must be followed by a period as a delimiter character. MILLISECONDS Must consist of exactly 3 digit characters. Values range from 000 to 999. If milliseconds value is less then 3 digits in length it must be prefixed with extra zeros to make it a 3-character field. The milliseconds value is followed by a space as a delimiter character. TIMEZONE Must consist of at least one, but no more than 7 characters in the following ASCII decimal value range: 32-126. The value must not include a combination of colon-space-percent of characters – \": %\" (ASCII decimal values 58, 32, 37) – as this character combination is reserved as a field delimiter that follows the time stamp. There is no standard set of acronyms for time zones1. A list of common time zone acronyms and corresponding time offsets from UTC is provided in the UTC specification. Uppercase letters are recommended for time zone acronym values. CiscoLog recommends the use of time offset instead of time zone identifier in this field. The offset, if",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}