{
    "relation": [
        [
            "First Name",
            "Frederick",
            "Lisa",
            "Janice"
        ],
        [
            "Last Name",
            "McLuckie",
            "Kinard",
            "Oliver"
        ],
        [
            "Suffix",
            "Mr.",
            "Ms.",
            "Ms."
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=1E602E06-8F08-460C-AD88-DFBB1318F582&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223202844,
    "recordOffset": 223194642,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34234=Trade Adjustment Assistance Reform; U.S.-Colombia FTA; U.S.-South Korean FTA; U.S.-Panama FTA; trade and food safety issues regarding imports; Trade Promotion Authority (\"Fast Track\"); Trans-Pacific Partnership Trade Agreement; \"Buy American\" provisions in jobs and stimulus legislation; S. 1619, the Currency Exchange Rate Oversight Reform Act of 2011. H.R. 3078, U.S.-Colombia Trade Promotion Agreement; H.R. 3080, U.S. Korea Trade Promotion Agreement; H.R. 3630, Middle Class Tax Relief & Job Creation Act., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 27736=NAFTA cross boarder trucking pilot program (Pre-Authority Safety Audits; Safety Record and Violations of MX Carriers); H.R. 1574/S. 876, Safe Highways and Infrastructure Preservation Act (to regulate truck size and weight on National Highway Systems). H.R.12/S.1660, American Jobs Act of 2011 (funding for highway, bridge infrastructure); S. 1769 Rebuild America Jobs Act. S. 1950, Commercial Motor Vehicle Safety Enhancement Act of 2011., 22715=Clean Truck Program at Port LA/Long Beach (Federal Preemption Issues); HR 572/S.2011 Clean Ports Act of 2011, 15547=FY 2012 Transportation-HUD Appropriations bill(operating assitance for federalized public housing properties, Ayotte Hours of Service Admt ). S.1599/H.R.3070, Departments of Labor, Health and Human Services, Execution and Related Agencies, 2012; H.R. 2112, Consolidated and Further Continuing Appropriations Act, 2012 and H.R.2-55, Consolidation Appropriations Act, 2012: funding for Dept of Labor's worker misclassification initiatives; OSHA; Wage and Hour Division, work place safety enforcement programs; National Labor Relations Board, National Mediation Board;Administration and enforcement of Davis-Bacon and Service Contract Act requirements. Deficit reduction. FY 2012 funding for SSA, SEC, CFTC, CFPB, HJRes1., 37996=S.1950, Commercial Motor Vehicle Safety Enhancement Act; truck size/weight, hours of service exemptions; national clearing house for drug/alcohol convictions; medical forms; medical examination registry, electronic on board recorders. H.R. 756, to direct the Sec. of Transportation to prescribe standards for maximum hours that a CMV operator may be detained by a shipper. S. 936, American Infrastructure Investment Fund Act of 2011. H.R. 2459, The Safe Roads Act of 2011; Hours-of-service regulations relating to transportation of grapes., 44448=Veterans training/transition programs: military to civilian workplace. S 951, Hiring Heroes Act; S. 1549/HR 12, American Jobs Act of 2011 (Veterans hiring/employment).S. 1867/HR 1540, Dept. Defense Authorization Act; Veterans and CDL's., 41162=Mexican truck pilot program; truck size and weight; H.R. 2407, Protecting America's Road Act;, 19475=Wage&Hour Enforcement; Worker misclassification & independent contractors. Project labor agreements, prevailing wage/Davis-Bacon Act; McNamara-O'Hara Service Contract Act. H.R. 190, Protecting America's Workers Act; OSHA Enforcement Programs; OSHA state programs; NLRB- related rulemaking; DOL worker misclassification/UI initiatives. S. 770, Payroll Fraud Prevention Act; H.R. 3178, Employee Misclassification Prevention Act; NLRB rules governing union elections, LMRDA reporting requirements. H.R. 12/S.1549, American Jobs Act of 2011. H.R. 3094/S. 1843, Workforce Democracy and Fairness Act., 24869=Multi-employer pension funding rules/pension plan relief; partitioning of pension obligations; Social Security, Budget Control Act of 2011, 47298=Unemployment Extension; S. 1549/H.R. 12, American Jobs Act of 2011 (provisions related to unemployment insurance & unemployment assistance., 58211=H.R. 10, Regulations from Executive in Need of Scrutiny Act of 2011., 66598=H.R. 3261, Stop Online Piracy Act; S. 968 Preventing Real Online Threats to Economic Creative and Theft of Intellectual Property Act of 2011.}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20001 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  FREDERICK P. MCLUCKIE  2026248741  fmcluckie@teamster.org 5. Senate ID#  19855-12 7. Client Name Self Check if client is a state or local government or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}