{
    "relation": [
        [
            "Column",
            "",
            "1",
            "2",
            "",
            "4",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17"
        ],
        [
            "Entry",
            "",
            "1-b",
            "6.5 in.",
            "0.27",
            "800",
            "3500",
            "30",
            "2",
            "14",
            "44",
            "2.7",
            "1.19",
            "0.77",
            "0.5",
            "1.5",
            "1.16",
            "1.16"
        ],
        [
            "Explanation",
            "",
            "Section of system to be worked on from bag hood to Y junction",
            "Based on minimum transport velocity and minimum air volume required using Q=VA formula A=0.27 ft2, this gives a duct size of 6.5 in.",
            "Duct Area",
            "Air volume required, as calculated from Anderson, or others, or determined by past experience or testing",
            "Air velocity determined by Q/A = V",
            "Straight runs measured from prints or on site",
            "Number of elbows determined from schematic installation",
            "Taken from table ___ for an elbow with a centerline radius of 2.0 times the duct diameter. This number is multiplied times the number of elbows.",
            "Sum of straight rum length (col.7) and equivalent length (col.9)",
            "Frictional losses read directly from Figure ___, look at duct diameter vs. duct velocity and read frictional loss per 100 ft. of straight total duct length",
            "Total duct length (col.10) x frictional loss per 100 ft. of duct (col.11) divided by 100",
            "Velocity pressure of air in duct, VP = (V/P)2",
            "Entry loss for hood (given)",
            "The total exhaust hood loss. This represents the amount of energy required to get the air to flow into the hood (1.0 VP) plus the specific hood entry loss (col. 14).",
            "Product of cols. 13 and 15",
            "The governing static pressure in branch 1-b (col. 12 + col. 16)."
        ]
    ],
    "pageTitle": "Silica, Crytalline - Dust Control Handbook, Chapter 3: Dust Control Systems",
    "title": "",
    "url": "https://www.osha.gov/dsg/topics/silicacrystalline/dust/chapter_3.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 928045223,
    "recordOffset": 928015213,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "After gathering the above information you can start to fill in the worksheet table: -- -- 30 1,100 d-e -- 1-90º 0 1,100 c-d 1 -- 50 1,100 b-c -- 3-90º 35 300 2-b -- 2-90º 30 800 1-b Number of Entries Number of Elbows Straight Run (ft) Airflow Required (cfm) No. of Branch or Main Description of Material",
    "textAfterTable": "Repeat this procedure for each branch circuit, when you reach a junction of two branch circuits the balanced pressure method requires that governing static pressure at the junction be within 5% of one another. If this is not the case, as in our example, then design parameters must be altered to achieve balance Several things might be done: - lower the resistance in branch 2-b by increasing duct size, or reducing air volume - increase the resistance in branch 1-b by decreasing duct size or increasing air volume Engineering and economic judgment should be used to make this decision; for instance, whether you can use additional air volume or your fan cannot handle the static pressure may dictate the way in which you choose to balance your system. In the example we chose to increase the resistance in branch 1-b to achieve balance. This step may require several trial and error attempts until you become familiar with the process. Continue filling in the work sheet using the governing static pressure column to keep a running total of pressure (note that pressures in series circuits are additive; in parallel circuits they are not). The governing pressure in that branch is used. Finally, as the air exits the exhaust stack of the fan, the velocity pressure of the air is converted back to static pressure and results in the recovery of that energy which is subtracted from",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}