{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If you're looking for a well rounded school and new experiences, consider applying here. The Wisconsin Experience consists of an idea to connect in-class learning to the world outside. It's not just about getting good grades and passing the tests; it's about doing something meaningful with your life and becoming a good person.",
            "Football and basketball games are full of traditions.",
            "I'm from out of state but these experiences have been worth the money.",
            "There is always something going on, from movies at Union South to parties and concerts. Sports are great to watch here as well. You can always grab a couple of friends and take the time to try every restaurant on State Street!",
            "I'm pretty sure that the food here is a lot better than that of other schools. At Rheta's you get to choose from 6 different stations. There are burritos/tacos/quesadillas, burgers, desserts, mashed potatoes/chicken, pasta, pizza, salads and fruits, and sandwiches. Gordon's is even bigger.",
            "My floor is my family. We refer to our house fellow as mom. It gets loud at times but there is always something to do and someone to talk with. I've met so many different people and made such great friends. I couldn't have asked for a better dorm experience.",
            "The professors are knowledgable and ready to teach you all that they know. Academics are important and you will find the libraries packed during finals week and often busy on the weekends. The material is challenging but manageable as long as you stay on top of your work.",
            "Visit the campus and see if it is right for you! The transportation may seem a bit challenging at first, but all students are eligible to receive a bus pass. That definitely comes in handy and the bus system is easy to figure out. Try not to overload your schedule the first semester because chances are that these courses are harder than your average high school courses. Living on your own and feeding yourself may also present a challenge but it's great! You will definitely grow and learn a lot.",
            "UW-Madison is a school that offers an amazing liberal arts education that teaches students lifelong skills. The campus is beautiful and located between two lakes. This school offers many opportunities, great academics, and a warm environment."
        ]
    ],
    "pageTitle": "University of Wisconsin-Madison (UW-Madison) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Wisconsin-Madison/reviews?_escaped_fragment_=/show/76943",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00136-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889640819,
    "recordOffset": 889444128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{389112=During Fall, Saturdays on campus are a swarm of Red and White for Badger football games. While not everyone can score tickets (which go on sale every June and sell out within an hour), everywhere you go, you will pass by viewing parties. Other traditions focus on Bascom Hill, the stretch of land that was the original campus. From the 'Battle for Bascom' snowball fights (between Southeast and Lakeshore campus'), Tray sledding, studying under the shade of a tree on the first warm day, or rubbing Abe's foot for good luck, it's the place of tradition., 225606=Madison's cost are reasonable, although I heard that they will be raising tuition by $2000 every year. I didn't really get any financial aid except for an actuarial science scholarship, so I wish I could have gotten a little more help. But through internships and jobs I think the cost is manageable., 1037239=Apply during the first application window! I applied before in September, before the first deadline in October, and knew by early November that I had been accepted. Also, apply for the scholarships through your college in early February., 316538=I can not talk on dorm life as a personal experience, what I can say is my fellow classmates who live in dorms really do not complain much and the new state of the dorm building should be done for fall2012. It will be awesome. Plus plenty of opportunity to live off campus also., 973368=Lots of student orgs to join, may have to look around on the WIN website to find what you are interested in as there are so much and it is hard to find out about them all. May not be as close with the people in your org as you will other friends but that isn't true for all orgs on campus, 1101166=© 2015, Cappex.com, LLC, 94332=Madison has a world-class faculty full of brilliant and interesting (my chemistry professor was in the 1992 Olympics) instructors. Also my first semester instructors were very open about providing help and keeping their office hours to explain any questions. Because it is a very intelligent and motivated student body, students push each other to learn.}",
    "textBeforeTable": "06/08/2009 Reviewer is Researching this school. Reviewer has not been to campus. 37 out of 50 people found this review useful. 2 people found this inaccurate. 1 of 237 Sydney from Minnetonka, MN Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Wisconsin-Madison Reviews University of Wisconsin-Madison › Wisconsin › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Tips for prospective students Apply early, I really believe this will increase your chances of getting accepted and will get you a response a lot faster so you can make your decision. Really work to get a high ACT score and writing a good admissions essay. Bang for the buck Although this school is rather pricey for a public school I feel that it is definitely worth it. People are always impressed when they hear that I go to the University of Wisconsin-Madison, so I know that a degree from here will get me a great career. Am enjoying being here This campus and school has ALOT to offer, whether it be academically, socially, politically, or otherwise. Its location provides a perfect unison between city and campus life. The city is great, it's very active, and it's wonderful to see everyone out running, biking, shopping, walking down famous State St., etc. Am learning a lot I have learned so much since I began my schooling at University of Wisconsin-Madison. There is such a variety of classes to choose from which makes it easy for you to find classes that you are interested in. The professors here challenge you to think outside",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}