{
    "relation": [
        [
            "Elder",
            "Elder Sardis",
            "Elder Thoim",
            "Elder Arp",
            "Elder Graymane",
            "Elder Beldak"
        ],
        [
            "Zone",
            "Borean Tundra",
            "Dragonblight",
            "Borean Tundra",
            "The Storm Peaks",
            "Grizzly Hills"
        ],
        [
            "Coords",
            "59.1, 65.6",
            "48.8, 78.2",
            "57.3, 43.7",
            "41.2, 84.7",
            "60.6, 27.7"
        ],
        [
            "Location/Tips",
            "Valiance Keep: take the boat from Stormwind.",
            "Moa'ki Harbor: Take the flight (automatically learned) from Valiance Keep to Dalaran. Use the teleportation crystal to port down to Crystalsong Forest. Avoiding wolves, ride through the southwest part of the zone into Dragonblight. It will be convenient for later NPCs to pick up the flightpath at Windrunner's Overlook, just beyond the entrance to Dragonblight. Once in northern Dragonblight, you'll be in a gauntlet with 80+ worms--it's good to die. Take the spirit rez at The Crystal Vice. This will have saved you some travel time and place you right at the Path of the Titans, an aggro-free road. Take the Path all the way down, past Wyrmrest Temple. When you reach the sea, turn right and hop down the cliffs. You'll now be at the Moa'ki Harbor beach--the town is nearby.",
            "D.E.H.T.A.: Take the northern bridge out of Valiance Keep, riding through Farshire. May aggro some undead. The wildlife around D.E.H.T.A. is not hostile, making it an easy ride to the north.",
            "K3: If you've picked up the Windrunner's Overlook flight path earlier, fly back here. Make your way to the northeastern part of Crystalsong Forest--you may die a few times as not all mobs are neutral in the eastern half. The initial entrance to The Storm Peaks will be devoid of mobs. There will be a few kobolds as you head east to K3, but you should be able to stay mounted up.",
            "Westfall Brigade Encampment: If you've gotten Elder Tauros in Zul'Drak already, this will be easy. Start from Zim'Torga, going onto the main road to the north, always bearing to your right. The wide path will take you right into Grizzly Hills, from which it continues as a winding road, again without aggro from mobs. Keep following the road south, and you'll soon find the Elder outside the settlement."
        ]
    ],
    "pageTitle": "World of Warcraft: Warlords of Draenor News",
    "title": "",
    "url": "http://www.wowhead.com/news&tag=lunar-festival",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 857173339,
    "recordOffset": 857105855,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "These elders are located in Kalimdor. Elders of Kalimdor (21) Sekhemi the Elder Menkhaf the Elder Windsong the Elder Evershade the Elder Elder Wildmane Elder Splitrock Elder Ezra Wheathoof Elder Darkhorn Elder Bladeswift Elder Windtotem Elder Thunderhorn Elder Stonespire Elder Starweave Elder Skyseer Elder Skygleam Elder Runetotem Elder Riversong Elder Ragetotem Elder Primestone Elder Nightwind Elder Morningdew Elder Moonwarden Elder Mistwalker Elder High Mountain Elder Grimtotem Elder Dreamseer Elder Brightspear Elder Bloodhoof Elder Bladesing Elder Bladeleaf Cataclysm (4) Dungeons (2) Horde (2) Alliance (1) Kalimdor (21) Legend /wl loc map). Wowhead Looter (type Tip: Clicking on the coordinates in the tables below will open a map of the elder's location in a lightbox. To view your character and your mouse cursor's coordinates on the in-game world map, you can use our very own addon, the",
    "textAfterTable": "Thousand Needles 77.1, 75.6 Fizzle & Pozzik's Speedbarge Elder Nightwind Felwood 38.3, 52.9 Jaedenar Elder Primestone Silithus 30.8, 13.3 Crystal Vale Elder Ragetotem Tanaris 37.2, 79.1 Outside of Ruins of Uldum Elder Riversong Ashenvale 35.6, 48.9 Astranaar Elder Runetotem Durotar 53.2, 43.6 Razor Hill Elder Skygleam Azshara 64.7, 79.3 Ravencrest Monument Elder Skyseer Thousand Needles 46.4, 51.0 Freewind Post Elder Starweave Darkshore 49.5, 19.0 Near Lor'danel Elder Stonespire Winterspring 60.1, 49.9 Everlook Elder Thunderhorn Un'Goro Crater 50.4, 76.1 Slithering Scar Elder Windtotem Northern Barrens 68.4, 70.0 Ratchet Elders of the Alliance (1) These elders are located in Alliance capital cities. Elder Zone Coords Location Elder Bladeswift Darnassus 39.1, 31.9 Cenarion Enclave Elders of the Horde (2) These elders are located in Horde capital cities. Elder Zone Coords Location Elder Darkhorn Orgrimmar 52.4, 60.0 By Flight Master Elder Ezra Wheathoof Thunder Bluff 73.0, 23.3 Elder Rise",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}