{
    "relation": [
        [
            "Date",
            "Sep 20, 2005",
            "May 27, 2010",
            "May 28, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: STARMINE CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GATTO, JOSEPH G.;REEL/FRAME:016557/0499 Effective date: 20050917",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7149716 - Security analyst estimates performance viewing system and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7149716?dq=5,072,412",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477083247,
    "recordOffset": 476982979,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6414=FIGS. 14–18 further illustrate examples of how a user can select factors for inclusion in a model, define rules and N-score criteria for the factor and other features. For example, with reference to FIG. 14, the user may specify various selections associated with a first performance metric, referred to as Accuracy 1, by clicking on the Accuracy 1 tab 2172. The factor's potential components and other information will appear in Main Display area 2160. The user can select details in the text boxes, check boxes, etc. Preferably, a template is displayed including a performance Metric Definition area 2210 and a N-score definition area 2220.}",
    "TableContextTimeStampAfterTable": "{397856=The Global Analyst Data Object downloaded from the Originating Storing Object is typically comprised of numerous files and fields relating to historical data relevant to analyst earnings estimates and recommendations. An example of such a historical database is that maintained by financial information services provider IBES. IBES's database, known as the Daily Detail Earnings Estimate History, contains more than ten years of analyst estimate forecasts, compiled from data obtained from more than 200 brokerage houses and more than 2000 individual analysts, for United States companies. These files and fields contain both general and specific information on analyst estimates and related data including, but not limited to, information pertaining to financial instrument type and related identification codes, broker and analyst identification, industry groupings, and detailed information on such variables as the prices of particular securities on specific dates. Importantly, it should be noted that a Global Analyst Data Object may be used which contains analyst data pertaining not only to stocks publicly traded in the United States, but also international stocks and any other type of financial instrument currently in existence or created in the future., 364238=Summary section 4229 briefly describes the current data in chart 4230. In this example, chart 4230 displays current data regarding stock BHI for the current quarter (FQ 06-00) with an expected report at Jul. 28, 2000. Chart 4230 may display a high EPS estimate as shown by 4232, a low EPS estimate as shown by 4236, a IBES mean as shown by 4234, and the analyst's EPS estimate as shown by a 4238. Symbol 4237 marks the date of company's previous quarterly earnings. Symbol 4239 marks the begin date of a major estimate revision cluster of several analysts. The current date is shown by vertical line 4240., 399991=Various architectural and system configurations may be used. Various database techniques may also be used. For example, a predetermined system database may be constructed such that each analyst estimate record in the database contains unique fields related to that estimate. In general, these records may contain a combination of data fields present within a Global Analyst Data Object obtained from the FISP and data fields unique to and created within the system of the present invention. Typically, the fields in this restructured database may include an analyst identifier; an event identifier corresponding to a specific security; an event type and date (e.g., Apple, FY-1995 or Intel, Q2-1997); an estimate date; a raw error indicator which corresponds to an analyst's estimate minus the actual earnings for a particular event; other metrics such as the percent error from an analyst's estimate to either the actual earnings or the consensus error; or other error metrics defined by a user., 113620=In Model Selection area 1140, a user may select a model (created using the Models module described elsewhere herein) which when applied against analyst estimate data, creates an enhanced composite estimate that can be displayed in the chart or snapshot view. This enables a user to analyze, test, and compare the results of the selected model with selected analysts, consensus and other estimates or other information. In Model Selection area 1140, the user may select a model from a model list shown by clicking on a drop down window at 1140 a. At 1140 b, the value of the selected model's estimate as of the “As of Date” may be shown and the deviation from the mean may be shown at 1140 c (e.g., as a %, actual or other difference). Other comparisons and information may be used and displayed to assist the user in analyzing the selected model's estimates and identify the significance of it., 111877=The user may select the “As Of Date” in various ways. For example, under the Select Event area 1120, the user may click the Calendar icon 1120 e to display a Calendar and pick a date by clicking double arrows for years, single arrow for months, and finally a day of the month from the displayed month. Alternatively, the user may manually type a date in the “As Of Date” box 1120 d. In the History/Chart module, the user may drag an “As Of Date” bar (e.g., 1160) to a desired date displayed in Main Display window 1115. Bar 1160 graphically indicates the “As Of Date”. Also, the user may simply click on the X-axis on the desired date and the “As Of Date” bar 1160 will move to that date. Other ways of changing the “As Of Date” may also be available. In each case, the displayed “As of Date” will be changed to the selected date., 55511=This application is a continuation of U.S. application Ser. No. 09/722,050, filed Nov. 27, 2000, which is a continuation-in-part of U.S. application Ser. No. 09/524,253, filed Mar. 13, 2000, which is a continuation-in-part of U.S. application Ser. No. 09/296,620, filed Apr. 23, 1999 (which issued as U.S. Pat. No. 6,510,419 on Jan. 21, 2003), which claims priority from U.S. provisional application Ser. No. 60/082,868, filed Apr. 24, 1998, which are incorporated by reference., 365776=Summary section 4250 and chart 4252 may display current data detail information related to a mine-der alert as indicated by symbol 4224 in section 4210. Summary section 4250 may provide a brief description of the alert including a trigger date (e.g., May 29, 2000). For example, the alert associated with this estimate is that the estimate is over 100 days old, or the estimate is 133 days old. Additional detailed current data information may be displayed. For example, estimate information for chart 4252 may be displayed under Estimate column 4254, the associated date under Date column 4256, and the number of days active under column 4258. Other information may also be displayed. Also, in section 4259, cluster information may be presented. For example, in this example, 21 of the 31 analysts have revised since the last cluster on Apr. 27, 2000., 145432=By clicking New on the menu bar, a dialog box will appear with a text box for entering the name of the user's new model. The user can type the name of the new model. As shown, the user has entered the name “Joe”. The model name appears in a model name header in box 2120., 134708=A Models Folder window 2110 preferably contains model libraries and model names. Other organizational techniques and systems may be used. Models Folders window 2110 displays the available models to the user. Models classified under Research may be in the process of being tested. Models classified under Production are in actual use to calculate enhanced composite estimates. Other categories are also available to the user for classification., 153842=Based on these user specified parameters, each non-excluded analyst's average relative error percentage may be calculated. This metric may be converted to an N-score for this factor based on user specified rules as set forth in the N-score Definition area 2220. The N-score area 2220 enables certain analysts to be excluded (or give a zero score for this factor) and allows other analysts to be given a score by error rank., 115314=Main Display window 1115 may display estimate data in either chart or snapshot format, as selected by the user. Where the user selects a chart format, Source Selection panel 1110 may display a list of sources, or group of sources, which may include analysts, brokers and other potential sources in Source section 1110 a, calculated averages, calculated high, calculated low, and other calculated summaries in Calculated Summaries section 1110 b, and selected models in Models section 1110 c. Other sections may also be available to display other relevant information., 117722=The user can select a calculated estimate, for example, to compare an analyst's estimate record with the consensus or other calculated estimate, in Calculated Summaries section 1110 b. For example, the user may compare analysts' estimates with a calculated average, a calculated high, a calculated low, a mean plus standard deviation, a mean minus standard deviation, and other calculated estimates., 122315=Additionally, other information may also be displayed, such as actual reported earnings, which may be shown through vertical Earnings bar 1170 on the corresponding dates the earnings were reported. Previously reported earnings may also be shown as a vertical bar indicating the actual reported earnings. Mean estimate bar 1180 indicates the mean value of the previously reported earnings on the report date. The value of the bar may be shown above the Earnings bar 1170 and/or Mean bar 1180., 167116=2. The user can select a model from Models Folder window 2110, or create a new model., 114603=Cluster information may be displayed in Cluster area 1150. As detailed below, a cluster is a group of estimates satisfying user specified criteria. When new information about a company becomes available, some analysts may promptly revise their estimates. A group of such revisions may constitute a cluster. Such revised estimates tend to be more accurate than estimates made before the clusters. Cluster information displayed in Cluster area 1150 may include a begin date, detect date, number of analysts, cluster mean, cluster standard deviation, and other information. Clusters assist users in identifying potentially significant trends and changes in estimates., 129080=Attribute data may be provided under Experience column 1540, Broker List column 1546, and other types of attribute data. Under each attribute data, attribute information and an N-score may be displayed. For example, under Experience column 1540, the number of periods (e.g., quarters) an analyst has provided an estimate is displayed in column 1542 and the score assigned to the number of periods an analyst has provided an estimate is provided in column 1544. In another example, under Broker List column 1546, the group that the broker has been assigned to is displayed under column 1548 and the N-score assigned to that group is displayed in column 1550., 154312=In this example, an N-score may be assigned by Error Score, Error Rank, equally to all or a user specified number of top qualifying analysts (based on relative error percentage), or other options in N-Score area 2220., 144806=To create a model, from the Navigator 210, the user can select Models/Manage. The general appearance of the display will include the Navigator 210, a Models folders section 2110, a Main Display window 2160 including an Exclusions area 2130 (or other mechanism to enable selection display of various factors and other criteria relating to models) and a Factor Weights display and selection mechanism 2150. A tool bar (or other mechanism) will also be displayed to enable a user to select one or more of New, Copy, Save, Move, Delete or other functions., 116831=From the Source Selection panel 1110, the user can select, in Source section 1110 a, a check box of the analyst whose estimate history the user wants to display. For example, the user may click on the check box to activate the source. Preferably, a unique identifier for each analyst or source is used for that source's time series. For example, according to one embodiment, each check box in source selection panel has a semi-unique color and a line the same color as the check box area appears on the chart, showing the analyst's estimate history for that stock. The user can select/deselect as many analysts as the user want individually, or as a group. To select all analysts, or to deselect them, the user may right-click anywhere in the Analyst list and use a Show/Hide command that enables a user to show all or hide all analysts., 351588=Further, trigger dates, which may be defined as the date when the present invention flags a potential data issue, and corresponding number of mine-ders triggered on those dates may be displayed for the firm. Analyst may utilize trigger dates to track what mine-ders were created and when the mine-ders were created. For example, Trigger Date column 3840 displays a list of trigger dates and column 3842 displays the total number of mine-ders that are triggered by that date. A user may view a detailed list of mine-ders triggered on a particular date by selecting a desired trigger date in column 3840. For example, a user may select Jun. 30, 2000 as the trigger date to view a list of all mine-ders first triggered on that date for a particular firm or entity. In addition, a mine-der alert may not always be triggered by a change in an analyst's estimate. For instance, while an analyst's estimate may stay the same and within 2 standard deviations from the mean, the consensus may move away from the analyst's estimate thereby triggering an alert even though the analyst has not made any modifications., 121807=The user also has the ability to narrow in on a section of Main Display window 1115. For example, the user may box a portion of the Main Display window 1115 (e.g., by holding down the left mouse button to draw a box around an area) to view estimate data in greater detail in chart format. This feature is useful when estimate data from different sources are displayed closely together so that it becomes difficult to differentiate the estimates in chart format., 106972=4. With a stock set name selected, the user can type into the text box 870 a or otherwise add the tickers the user wants to add to the stock set. By clicking Add Ticker 870 after entering a stock name, the added tickers will be displayed in the list shown in Stock Display window 1010. To delete a ticker, the user can select it and click the Delete Ticker 860 button., 128105=The snapshot view simultaneously displays performance, attribute data, exclusion data and factor weights on a source by source basis. For example, performance data may be provided under Accuracy 1 column 1524, Accuracy 2 column 1530, Estimate Age column 1536, and other forms of performance data. Under each performance column, the actual score attributed to that performance as well as an N-score may be displayed. For example, under Accuracy 1 column 1524, the percentage of accuracy is displayed in column 1526 and an N-score is displayed in column 1528. In another example, under Accuracy 2 column 1530, the percentage of accuracy is displayed in column 1532 and an N-score is displayed in column 1534. In another example, under Estimate Age column 1536, the N-score assigned by user-defined criteria may be displayed in column 1538., 145845=By clicking Save, the new model is saved to the server (or elsewhere). By default, the new model may be saved in the Research Library as shown in Models Folders window 2110., 395013=According to another embodiment of the present invention, portfolio returns for one or more analysts may be calculated. A portfolio return may measure how much investors would have made had they built a portfolio around some or all of the analyst's picks. For example, the portfolio return may be calculated based on investing $1000 in each “buy” recommendation, $1500 in each “strong buy” recommendation, and short selling $1000 in each “sell” recommendation. Other values may be assigned to other recommendations. The present invention may rebalance the portfolio at predetermined time intervals (e.g., at the end of every month) and/or on the date of any recommendation change (or other event). The present invention may measure the portfolio return of all or some stocks (or earnings events) an analyst (or source) covers and/or the returns for portfolios based on stocks within specific industries. The present invention may also calculate each analyst's profitability for single stocks and/or stock sets. This adjusted return may measure an analyst's ability to time when to buy and sell a specific stock and/or stock sets. The return may indicate how much investors would have made had they bought the stock when the analyst recommendation was “buy” and shorted the stock when the analyst recommendation was “sell”. For example, the present invention may adjust the return to give bonus points for market outperformance while the recommendation was “strong buy” and the risk-free rate while the recommendation was “hold”., 364953=Additional detailed current data information may be displayed. For example, estimate information for chart 4230 may be displayed under Estimate column 4242, the associated date under Date column 4244, and the number of days active under column 4246. Other information may also be displayed. Section 4247 enables a user to easily report errors or other data issues to IBES or other entity. By selecting 4247, the user may supply information related to the error, such as the nature of the error, analysts involved, brokerage involved, and quarters/years where the error occurred. Also, in section 4248, detailed cluster information may be presented. In this example, 29 of the 32 analysts have revised since the last cluster on Apr. 27, 2000.}",
    "textBeforeTable": "Patent Citations Other embodiments and uses of the invention will be apparent to those skilled in the art from consideration of the specification and practice of the invention disclosed herein. Accordingly, the specification and examples set forth above should be considered exemplary only. The scope of the invention is only limited by the claims appended hereto. As discussed above, the system may provide the user with the option of viewing a large amount of information in a variety of different formats. Another metric that is useful in predicting how an analyst acquires and reacts to information is the hit percent. A hit percent is an evaluation of the number of times that an analyst successfully revises earnings. In a preferred embodiment, a swing is preferably an estimate that is outside a predetermined standard deviation of the mean of the consensus estimate. In a most preferred embodiment, a predetermined standard deviation of the consensus estimate is approximately 1.5. A hit is preferably a swing in which the analyst's estimate is closer to the actual earnings than the consensus estimate. A hit percent can then be determined by dividing the number of hits by the number of swings, and multiplying the result by 100%. where leads is the number of times that an analyst makes an estimate revision before the majority of the analysts following a particular security, lags is the number of times",
    "textAfterTable": "Mar 26, 1996 Thomson Shared Services, Inc. Investment research delivery system US5608620 Feb 17, 1995 Mar 4, 1997 Lundgren; Carl A. Method of eliciting unbiased forecasts by relating a forecaster's pay to the forecaster's contribution to a collective forecast US5613072 Jun 1, 1995 Mar 18, 1997 Risk Data Corporation System for funding future workers compensation losses US5675746 Sep 30, 1992 Oct 7, 1997 Marshall; Paul S. Virtual reality generator for use with financial information US5749077 Jan 23, 1997 May 5, 1998 Fs Holdings, Inc. Method and apparatus for updating and selectively accessing financial records related to investments US5761442 Aug 31, 1994 Jun 2, 1998 Advanced Investment Technology, Inc. Predictive neural network means and method for selecting a portfolio of securities wherein each network has been trained using data relating to a corresponding security US5774880 Feb 28, 1995 Jun 30, 1998 Cantor Fitzgerald & Co., Inc. Fixed income portfolio index processor US5774881 Oct 30, 1995 Jun 30, 1998",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}