{
    "relation": [
        [
            "Patent application number",
            "20100278322",
            "20130182832"
        ],
        [
            "Description",
            "USER-BASED AUTHENTICATION FOR REALTIME COMMUNICATIONS - Architecture for a communications system enabling a user to provision a telephone at a new location without network administrative pre-configuring. An input component (e.g., keypad) receives a numeric extension and PIN. The extension is a telephone extension of the user and the PIN can be administratively assigned. A location component provides location information of an enterprise communications server to the telephone based on the extension. The telephone uses the location information to send messages to the enterprise communications server. A registration component registers the telephone with the enterprise communications server based on the numeric extension. A telephony address is returned to the telephone. An authentication component authenticates the telephone based on the PIN. Upon authentication, the extension is assigned to the telephone, and telephone communications can be sent and received from that location.",
            "USER-BASED AUTHENTICATION FOR REALTIME COMMUNICATIONS - Architecture for a communications system enabling a user to provision a telephone at a new location without network administrative pre-configuring. An input component (e.g., keypad) receives a numeric extension and PIN. The extension is a telephone extension of the user and the PIN can be administratively assigned. A location component provides location information of an enterprise communications server to the telephone based on the extension. The telephone uses the location information to send messages to the enterprise communications server. A registration component registers the telephone with the enterprise communications server based on the numeric extension. A telephony address is returned to the telephone. An authentication component authenticates the telephone based on the PIN. Upon authentication, the extension is assigned to the telephone, and telephone communications can be sent and received from that location."
        ],
        [
            "Published",
            "11-04-2010",
            "07-18-2013"
        ]
    ],
    "pageTitle": "Kumar, WA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kumar-wa-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448128335,
    "recordOffset": 448099047,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76082=Patent applications by Pranish Kumar, Kirkland, WA US, 111802=Patent applications by Venkatesh H. Kumar, Mercer Island, WA US, 43957=Patent applications by Girish Kumar, Redmond, WA US, 73764=Patent applications by Nishant Kumar, Redmond, WA US, 96327=Patent applications by R. Syam Kumar, Redmond, WA US, 12987=Patent applications by Aruna B. Kumar, Camas, WA US, 37965=Patent applications by Dilip S. Kumar, Seattle, WA US, 31993=Patent applications by Dilip Kumar, Seattle, WA US, 91232=Patent applications by Rohan Kumar, Redmond, WA US, 24605=Patent applications by Dileep Kumar, Redmond, WA US, 64842=Patent applications by Namendra Kumar, Redmond, WA US, 9722=Patent applications by Anush Kumar, Seattle, WA US, 5184=Patent applications by Abhas Kumar, Redmond, WA US}",
    "textBeforeTable": "Namendra Kumar, Bellevue, WA US 12-26-2013 NOTIFICATION-BASED MONITORING OF WEB RESOURCES - A service allows client systems to register for push notifications from the service about changes to resources. The service monitors a resource for updates and then notifies the client system when the resource has an update. The client system registers a resource for monitoring and subscribes to receiving push notifications for resources that are monitored. The client system can provide a notification channel to the service over which the service can send push notifications. The service aggregates requests to monitor resources over multiple client systems. When the service detects a change to a monitored resource, the service broadcasts a push notification to the various client systems subscribed to receive notifications for that resource over their respective notification channels. 20130346589 01-10-2013 OPEN INVITE FOR VIDEO CALLS - In one embodiment, a video chat source 20130013701 09-13-2012 PROXY COMMUNICATIONS ON A SOCIAL NETWORK - The claimed subject matter provides a system and/or method for establishing proxy communications between users on a social network. An exemplary method includes creating an alias on a primary social network when a user logs in to the primary social network, wherein the alias comprises the user's identity on a secondary social network. The method further includes creating a cache comprising a map relating a second user's identity on the primary social network to the second user's identity on a secondary social network, wherein the",
    "textAfterTable": "Namendra Kumar, Redmond, WA US Patent application number Description Published 20120317207 Directing Messages Based On Domain Names - A communication system has a plurality of collections. Each collection comprises a security boundary within which private data is accessible. Each collection is associated with a director. The directors receive messages that specify domains. When a director for a given collection receives a message, the director identifies one of the collections as being a home collection for the domain specified by the message. If the specified domain's home collection is the given collection or another collection within a given privacy boundary, the director forwards the message to a server pool associated with the specified domain's home collection. Otherwise, if the specified domain's home collection is not within the given privacy boundary, the director forwards the message to the director of the specified domain's home collection. 12-13-2012 20140136878 Scaling Up and Scaling Out of a Server Architecture for Large Scale Real-Time Applications - Scaling up and scaling out of a server architecture for large scale real-time applications is provided. A group of users may be provisioned by assigning them to a server pool and allotting them to a group. Grouped users help to reduce inter-server communication when they are serviced by the same server in the pool. High availability may be provided by choosing a primary server and one or more secondary servers from the pool to ensure that grouped users",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}