{
    "relation": [
        [
            "Resource",
            "Concurrent requests per account",
            "Requests per second per account"
        ],
        [
            "Limit",
            "100",
            "1,000"
        ]
    ],
    "pageTitle": "AWS Service Limits - Amazon Web Services",
    "title": "",
    "url": "http://docs.aws.amazon.com/general/latest/gr/aws_service_limits.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72824804,
    "recordOffset": 72809216,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 24 Jul 2015 17:18:02 GMT",
    "textBeforeTable": "AWS Lambda Limits For information about additional documented limits, see Amazon Kinesis Sizes and Limits. US East (N. Virginia) region – 50 US West (Oregon) region – 50 EU (Ireland) region – 50 All other regions – 25 Shards per account Default Limit Resource Amazon Kinesis Limits For more information about AWS KMS limits, see Limits in the AWS Key Management Service Developer Guide. All of the limits in the preceding table apply per region and per AWS account. 100 Requests per second 30 Grants for a given principal per key 250 Grants per key 200 Aliases 100 Keys Default Limit Resource AWS KMS Limits For information about AWS Identity and Access Management (IAM) limits, see Limitations on IAM Entities in Using IAM.",
    "textAfterTable": "For information about additional documented limits, see AWS Lambda Limits in the AWS Lambda Developer Guide. Amazon Machine Learning Limits Resource Default Limit Number of simultaneous running jobs 5 Memory usage for all Amazon ML models with real time endpoints (GB) 10 Real time predictions throughput per Amazon ML model (TPS) 200 Real time predictions throughput for all Amazon ML models in an AWS account (TPS) 10,000 AWS OpsWorks Limits Resource Default Limit Stacks 40 Layers per stack 40 Instances per stack 40 Apps per stack 40 Amazon RDS Limits Resource Default Limit Instances 40 Reserved Instances 40 Total storage for all DB instances 100 TB Manual Snapshots 50 Parameter Groups 50",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}