{
    "relation": [
        [
            "Code",
            "1",
            "2",
            "3",
            "5",
            "6",
            "7"
        ],
        [
            "Statistic",
            "Number of successful calls to LIB$GET_VM_64",
            "Number of successful calls to LIB$FREE_VM_64",
            "Number of bytes allocated by LIB$GET_VM_64 but not yet deallocated by LIB$FREE_VM_64",
            "Number of calls to LIB$GET_VM_PAGE_64",
            "Number of calls to LIB$FREE_VM_PAGE_64",
            "Number of Alpha or I64 pagelets allocated by LIB$GET_VM_PAGE_64 but not yet deallocated by LIB$FREE_VM_PAGE_64"
        ]
    ],
    "pageTitle": "HP OpenVMS systems documentation",
    "title": "",
    "url": "http://h71000.www7.hp.com/doc/82final/5932/5932pro_046.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 110138452,
    "recordOffset": 110130250,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Condition Values Returned See the HP OpenVMS DCL Dictionary for a complete description of the SPAWN command. Programs depending on embedded DCL commands may not function properly when run under other command language interpreters that may be supported by future versions of OpenVMS operating systems. If an image is run directly as a subprocess or as a detached process, there is no CLI present to perform this function. In such cases, the error status LIB$_NOCLI is returned. This routine is supported for use only with the DCL command language interpreter. If used when the current CLI is MCR, the error status LIB$_NOCLI is returned. Unless the NOWAIT flags bit is set, the caller's process is put into hibernation until the subprocess finishes. Because the caller's process hibernates in supervisor mode, any user-mode ASTs queued for delivery to the caller are not delivered until the caller reawakes. Control can also be restored to the caller by means of an ATTACH command or by a suitable call to LIB$ATTACH from the subprocess. The subprocess does not inherit process-permanent files nor routine or image context. No LOGIN.COM file is executed. If neither command-string nor input-file is present, command input is taken from the parent terminal. If both command-string and input-file are present, the subprocess first executes command-string and then reads from input-file. If only command-string is specified, the command is executed, and the subprocess is terminated.",
    "textAfterTable": "If an error is encountered during subprocess creation, the status value for that error is returned by LIB$SPAWN. Example  ISTAT=LIB$SPAWN(,,,CLI$M_NOKEYPAD,,,,,,,'> ') IF (.NOT. ISTAT) CALL LIB$STOP(%VAL(ISTAT)) This Fortran fragment shows a call to LIB$SPAWN from within a Fortran program. A subprocess is spawned taking input from SYS$INPUT and giving output to SYS$OUTPUT. The keypad state is not passed to the subprocess. A prompt string of \"> \" is specified for the subprocess. LIB$STAT_TIMER The Statistics, Return Accumulated Times and Counts routine returns to its caller one of five available statistics accumulated since the last call to LIB$INIT_TIMER. Unlike LIB$SHOW_TIMER, which formats the values for output, LIB$STAT_TIMER returns the value as an unsigned longword or quadword. Format LIB$STAT_TIMER code ,value-argument [,handle-address] RETURNS OpenVMS usage: cond_value type: longword (unsigned) access: write only mechanism: by value Arguments code OpenVMS usage: longword_signed type: longword integer (signed) access: read only mechanism: by reference The address of a signed longword integer that",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}