{
    "relation": [
        [
            "Payment method",
            "",
            "Cash on pickup",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Other - See seller's payment instructions",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "2008 Celebrity Cuts Auto Ernest Borgnine 1 1 OF ONE Autograph Oscar Emmy Winner | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/2008-CELEBRITY-CUTS-AUTO-ERNEST-BORGNINE-1-1-OF-ONE-AUTOGRAPH-OSCAR-EMMY-WINNER-/300588728010?pt=AU_Movie_Memorabilia&hash=item45fc7bfeca",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 421129347,
    "recordOffset": 421076141,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54922=This auction is for one Hollywood Icons Authentic Autograph card of actor - ERNEST BORGNINE, from 2008 Donruss Celebrity Cuts Trading Cards. The signature is in Purple ink. The card is numbered #HI-EB on the back with serial number #1/1, in NRMT-MINT condition., 61943=From 1962 through 1966, he starred in the popular situation comedy television series McHale's Navy, for which he received an Emmy Award nomination for Outstanding Lead Actor in a Comedy Series, in 1963. Borgnine also starred in the 1964 film version of the series. Borgnine's later television work included a co-starring role (with Jan-Michael Vincent) as veteran helicopter pilot Dominic Santini in the action/espionage series Airwolf. The series ran from 1984 to 1986., 63565=For his contribution to the motion picture industry, Ernest Borgnine has received a star on the Hollywood Walk of Fame at 6324 Hollywood Blvd. In 1996, he was inducted into the Western Performers Hall of Fame at the National Cowboy & Western Heritage Museum in Oklahoma City, Oklahoma. Also in 1996, Borgnine toured the U.S. in a bus to meet his fans and see the country. The trip was the subject of a 1997 documentary, Ernest Borgnine on the Bus. He also served one year as the Chairman of the National Salute to Hospitalized Veterans, visiting patients in Department of Veterans Affairs medical centers., 65164=Since 1999, Borgnine has provided his voice talent to the cartoon SpongeBob SquarePants as the elderly superhero Mermaid Man (where he is once again paired up with his McHale's Navy co-star, Tim Conway, who voices Mermaid Man's sidekick Barnacle Boy). Borgnine has also appeared on an episode of The Simpsons as himself in addition to a number of television commercials. In 2000, he was the executive producer of Hoover, in which he is the only credited actor. In 2007, Borgnine starred in the Hallmark Original Movie A Grandpa for Christmas. For his performance, Borgnine received a Golden Globe nomination for Best Actor in a Mini-Series or Motion Picture made for Television. At 90, he was the oldest Golden Globe nominee ever., 55237=Ernest Borgnine (born January 24, 1917 – July 8, 2012) born Ermes Effron Borgnino, was an American film and television actor whose career spanned more than six decades. He was an unconventional lead in many films of the 1950s, winning an Oscar in 1955 for Marty. On television, he played Quinton McHale in the 1962–1966 series McHale's Navy and co-starred in the mid-1980s action series Airwolf, in addition to a wide variety of other roles. Borgnine earned an Emmy Award nomination at age 92 for his work on the series ER. He was also the voice of Mermaid Man on SpongeBob SquarePants., 56396=After a few years of drifting, Borgnine attended the Randall School of Drama in Hartford, Connecticut. Following graduation, he went to the famous Barter Theatre in Abingdon, Virginia. His first role was as the Gentleman Caller in Tennessee Williams' \"Glass Menagerie\". In 1949, he debuted on Broadway in the role of a nurse in the hit play Harvey. In 1951, he moved to Los Angeles, California, where he received his big break in From Here to Eternity (1953), playing the cruel Sergeant \"Fatso\" Judson, in charge of the stockade, who taunts fellow soldier Angelo Maggio (played by Frank Sinatra). After Maggio ends up in the stockade for being drunk on duty, Fatso beats him to death. However, Fatso meets his own end in a knife fight with Maggio's best friend, Private Robert E. Lee Prewitt (Montgomery Clift) as payback for Maggio's death., 59227=Borgnine built a reputation as a dependable character actor and appeared in early film roles as villains, including Johnny Guitar (1954) and Bad Day at Black Rock (1955). But in 1955, the actor starred as a warm-hearted butcher in the film version of the television play Marty, which gained him an Academy Award for Best Actor. Because of Borgnine's longevity, Marty currently stands as the oldest film with a Best Actor performance from someone still alive. With the passing of Charlton Heston, Borgnine is currently the only living actor who has won Best Actor for performances given prior to 1960. Later film roles include The Vikings (1958), The Flight of the Phoenix (1965), The Dirty Dozen (1967), The Wild Bunch (1969), The Poseidon Adventure (1972) and The Black Hole (1979).}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at The seller won't accept returns for this item. Return policy details Return policy business days of receiving cleared payment - opens in a new window or tab. Will usually send within 2 Domestic handling time cleared payment- opens in a new window or tabEstimated delivery dates- opens in a new window or tab . Delivery times may vary, especially during peak periods. include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will",
    "textAfterTable": "Seller's payment instructions Please pay by PayPal for all international transactions outside of Australia. No PayPal for local pick up (cash only). Thank you. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}