{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor"
        ],
        [
            "Comments",
            "Students have groups to join, I believe they have something goin on every week.",
            "Foods are great. Inexpensive.",
            "I never stayed in the dorm but it looks like that the houses are great. Very accommodating and clean.",
            "Great school to start your associate."
        ]
    ],
    "pageTitle": "Central Texas College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Central-Texas-College/reviews?_escaped_fragment_=/show/26254",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895566387,
    "recordOffset": 895520867,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{224262=© 2015, Cappex.com, LLC, 182443=They do have dorms and it is like $2000 per semester and includes dining., 163784=Ctc offers many opportunities for success in education and every penny will be worth it. Classes for a semester may only cost $1000 and sometimes it is the books that raise the bill, but either way nothing is wasted at Ctc if you put good effort into receiving the knowledge the professors provide for you.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 61 Mandy from Harker Heights, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Campus Safety It is very safe on our campus. Great for these types of students Online courses are available with online test sites close to home. Share any unusual traditions or locations on campus I think it is awesome that the Mayborn Planetarium is right around the campus! Great for families interested in space! Bang for the buck Going to Central Texas College enables you to also apply for the Central Texas College-Texarkana online BSN program. What to do for fun The mall is only ten minutes away, and so are several different shopping strips, salons, ect. Food and Dining The food selection in the Killeen area is awesome! Dorm Life I live at home with my family. Academic Rigor Parking is always difficult. Especially if you live thirty five miles away and you are a stay at home mom. Tips for prospective students Talk with other",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}