{
    "relation": [
        [
            "Name of ETC",
            "ETC/Thakurli",
            "ETC/Asansol",
            "ETC/Ghaziabad",
            "ETC/Gorakpur",
            "`ETC/Avadi",
            "ETC/ Vijayawada ETC/ Lallaguda",
            "ETC/Tata Nagar",
            "ETC/Vadodara ETC/Mahalaxmi",
            "ETC/Kanpur"
        ],
        [
            "Railway/Division",
            "Mumbai(CST),Bhusawal, Nagpur,Pune & Solapur Divisions of CR Jabalpur, Kota & Bhopal Divisions of WCR Agra & Jhansi of NCR",
            "Howrah,Malda, Sealdah & Asansol Divisions of ER Dhanbad, Danapur & Mughalasarai Divisions of ECR",
            "Delhi, Firozpur,Lucknow,Ambala & Moradabad Divisions NR",
            "Lucknow, Varanasi & Izzatnagar Divisions of NER Sonepur & Samastipur Divisions of ECR",
            "Chennai, Madurai, Palghat, Trichy & Trivandrum Divisions of SR Bangalore, Mysore & Hubli Divisions of SWR",
            "Secunderabad, Hyderabad, Guntkal, Guntur, Nanded & Vijayawada Divisions",
            "Kharagpur,Chakradharpur, Adra & Ranchi Divisions of SER Khurda Road, Waltair & Sambalpur Divisions of ECOR Raipur, Nagpur & Bilaspur Divisions of SER",
            "Mumbai(Central), Baroda, Ratlam,Amedabad, Rajkot, Bhavanagar Diisions of WR Jaipur, Ajmer, Jodhpur & Bikaner Divisions of NWR",
            "Allahabad Division of NCR Delhi, Firozpur, Lucknow, Ambala & Moradabad Divisions of NR ( for drivers)"
        ],
        [
            "Zones having Admn/ Budgetary Control.",
            "Central Railway",
            "Eastern Railway",
            "Northern Railway",
            "N.E. Railway",
            "Southern Railway",
            "S.C.Railway",
            "S.E.Railway",
            "Western Railway",
            "North Central Railway"
        ]
    ],
    "pageTitle": "Rly Board’s Estt. Circulars 2005 | The Rule Master !",
    "title": "",
    "url": "https://rulemaster.wordpress.com/2011/07/24/rly-boards-estt-circulars-2005/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895549451,
    "recordOffset": 895326310,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{312731=Board’s letter No. F(E)III/2000/PN1/57/Vol.II dated 18.3.05  (RBE No.47/05), 614364=Board’s Lt. .No. E(MPP)2001/3/9/Vol.III dt:5.8.2005 (RBE No.128/2005), 75981=NOTE: The Railway Services [Commutation of Pension] Rules, 1993 were published in the Gazette of India, Extraordinary vide No. S.O. 930 [E] the 3rd December, 1993 and subsequently amended by –, 128187=The Railway Administration are once again directed to follow Clause 4 of Section 4 of the Apprentices Act 1961 read with para 6(1) of the Apprenticeship Rules 1991 which stipulate as under:-, 704052=RBE No.152/2005, 237282=The flat rates of license fee (Standard Rent) for residential accommodation over the Indian Railways were last revised w.e.f. 1.4.2001 and notified vide Board’s letter number F(X)I-2001/11/1 dated 15.6.2001.  The revision had become due in 2004.  Accordingly, Ministry of Railways have decided to revise the license fee (Standard Rent) for residential accommodation over Indian Railways, as shown in the Annexure, w.e.f. 1.7.2004., 876430=Ref: Policy letter No.E(Sports)2000/Policy/2 dt.19.6.2000., 615428=Accordingly, Ministry of Railways have decided to modify the ‘Manual of Management on Training’ [Edition 1998] as per Correction Slip No. 4/2005 and the revised list of training centres [Appendix I] is enclosed with the correction slip.  This supersedes all other lists issued earlier., 448589=01-04-04, 724560=No.P(R )541/IV     Date: 14-10-2005, 444792=Pay element [@ 30%]                 =       Rs.2925 [on BP+DP], 342437=The Staff Side in the Forum of DC/JCM, had raised a demand for grant of Special Allowance to the Train Superintendents/Deputy Train Superintendents of Rajdhani Trains, working in the pay scale of Rs.5500-9000/6500-10500.  After careful consideration, the Board have decided to grant Special Allowance @ Rs.300/- p.m. to the staff drawn for manning Rajdhani Express Trains from the scale of Rs.5500-9000 also in addition to the scale of Rs.5000-8000 specified in the letter dated 09.10.1998., 420360=1413, 277396=Copy of Board’s  Order No.ERB-I/2004/23/56 dated 8.2.2005., 367332=Board’s letter No. PC-III/2003/UPG/2 dated 3.5.2005 (RBE No. 73/05)., 497175=In terms of Rule 75(15) of Railway Services (Pension) Rules,1993, as soon as a railway servant enters Railway service, he shall furnish details of his family in Form 6 to the Head of Office and if he has no family, he shall furnish details in Form 6 as soon as he acquires a family.  The Head of Office shall keep Form 6 filled in by the non-gazetted railway servants in safe custody and make necessary additions and alterations in the form on the basis of subsequent information furnished by the Railway servant.  In the case of gazetted railway servants, the Head of Office shall pass on the details of family in Form 6 as also subsequent additions and alterations thereto, to the Accounts Officer for updating the particulars and keeping the same in safe custody., 409537=employees on or after 7-2-96 and upto 28-4-99 were absorbed in alternative employment in accordance with the earlier scheme in grade[s] lower than the grade[s] held by them on regular basis at the time of disablement / medical decategorisation may be reviewed on representations received in this regard and decided at the level of the General Manager as per the revised scheme.  In other type of cases wherein disabled/ medically de-categorised employees had opted to retire asking for appointment of eligible ward on compassionate ground, the question of review does not arise., 1096696=Sub: Order dated 12th April, 2005, of the High Court of Judicature of Andhra Pradesh at Hyderabad in CC No. 312  of 2005 in WP No. 8532 of 2003 – Regarding restoration of one-third portion of commuted pension after 15 years from the date of commutation., 63141=Board’s letter No. E(W)2002/PS 5-8/5  Dated 20.1.05    (RBE No.11/05), 350123=Board’s letter No.  E(W)2005 ED2/1 dated 5.5.2005., 1007627=2.         It is clarified that in terms of Board’s letter No.E(P&A)II-83/RS-10(iv) dated 25.11.1992, Drivers in the pay scale of Rs.5000-8000 and above, who are medically decategorised upto Class “A-3”, are eligible to be considered for the post of Loco Inspector.  For them, it will be a case of absorption in alternative employment in the post of Loco Inspector for which the same procedure as is applicable to any other medically decategorised staff viz. by a process of screening by a Committee as provided in the scheme of absorption in alternative employment of medically decategorised staff, will be applicable., 979472=Instructions  have been issued vide Board’s letter No. E[NG]II/2000/RR-1/47 dated 3-8-2001 laying down the Educational qualification for recruitment to JE-II posts in scales Rs.5000-8000 as Diploma in Mechanical / Electrical / Electronics Engineering., 713570=Ref : Board’s letter No.E(NG)II/90/SB/10 dt.29.01.1991,, 501086=Board’s letter No. E(G)2003 QR1-6 dated 30.6.05   (RBE No.110/05), 1027398=Board’s letter No. F(E)Spl.2005/ADV.3 /05 dt.30.11.2005 (RBE No.181/05), 726999=Copy of Ministry of Finance, Deptt. of Economic Affairs/New Delhi’s Resolution dt. 21.4.2005., 134345=In continuation of this Ministry’s letter No.C-III/2000/GIS/2 dated 27.04.2004, a copy of  O.M.No. 7 (1)/EV/2004 dated 31.12.2004 of the  Ministry of Finance, Department of Expenditure on the above subject is forwarded herewith for information and necessary action., 411720=Board’s letter No. PC-V/97/1/9/6 dated 26.4.05 (RBE No.65/05, PC V/ 453), 643016=Board’s letter No. .E(D&A)2004/RG6-26 dated 12.8.05   (RBE No.135/05), 825399=Board’s letter No. E(MPP)2005/3/14 dated 3.10.05 (RBE No.168/05), 420432=14.5.1977, 414104=Board’s letter No. E(D&A)/2003/RG 6-8 Dated 27.5.05  (RBE No.88/05), 691496=ADVANCE CORRECTION SLIP TO THE INDIAN RAILWAY ESTABLISHMENT CODE VOLUME II, 1987 Edition., 1029264=(F(E)Spl.2003/ADV 3/6 dated 29.9.2003), 10939=The period during which the scheme has been made open is from the date of issue of this letter and upto 31.12.05 (Thirty first December two thousand five only)., 535095=3.1        The educational qualification for recruitment to all posts in Group ‘D’ in the Railways shall be Class 8th passed, as already stipulated in Ministry of Railway’s letter No.E(NG)II/98/RR-1/107 dated 4.12.1998., 6626=Advance Correction Slip No. 46 to the Railway Servants [Pass] Rules, 1986, [Second Edition, 1993], 205936=The undersigned is directed to say that as number of communications have been received from various Ministries/Department/Pay & Accounts Offices seeking clarification regarding conversion of 50% Dearness Relief into Dearness Pension in terms of this Department’s O.M.No.42/2/2204-P&PW(G) dated 15th March, 2004. The points raised are clarified below:-, 821526=Ref:  Board’s letter of even Number dated 28.1.2005, 710858=ii)                 Dearness allowance upto CPI 1510 i.e. @148%, 111% and 96% of the Basic Pay, as the case may be., 704098=Board’s letter No. .E(G)2005 RN5-8 dated 9.9.05 (RBE No.152/05), 1103284=A copy of the Payment of Wages (Amendment) Act, 2005 along with a copy of Notification No.S-31012/3/94 WC(PW) dated 8.11.2005 issued by the Ministry of Labour and Employment is sent herewith for information/ guidance.  The Ministry of Railways desire that the amended new provisions of the said Act which are enforced from 08.11.2005 should be strictly complied with by the Railways etc., 530806=In terms of instructions contained in this Ministry’s letter No.99/E(RRB)/25/11 dated 27.11.2001, recruitment to Group ‘D’ in the Railways were to be done through Railway Recruitment Boards.  Detailed guidelines/procedure for such recruitment were circulated under this Ministry’s letter No.E(RRB)2004/33/2 dated 10.8.2004 (RBE No.178/2004).  In the light of Hon’ble MR’s directions as also announcement made by him in his Budget (Railway) Speech for 2005-06, the issue has been reviewed and it has been decided by Ministry of Railways (Railway Board) that recruitment to all Group ‘D’ posts will henceforth be done directly by the Zonal Railways., 468004=G.S.R. – In exercise of the powers conferred by the proviso to article 309 of the Constitution, the President hereby makes the following rules further to amend the Railway Servants (Discipline and Appeal) Rules, 1968, namely:-, 431199=6.6.1998, 992412=3.         Board have also decided that the eligibility of a Group ‘B’ Officer; findings in respect of whom were kept in sealed cover by the Committee, for placement in the higher scale of Rs.8000-13500/- on conclusion of disciplinary proceedings etc; shall be decided in accordance with the procedure contained in para 3.2 of Board’s letter dated 21.1.1993 referred to ibid as modified by their letter No. E(D&A)95/RG –6- 65 dated 17.1.96., 242805=RBE No.37/2005, 884122=The words “ parivahan (Vidyut) Vibhag” appearing in Annexure ‘B’ (Anubandh) of Hindi version of Board’s letter No.PC-III/2003/CRC/6 dt.09.10.2003 may be corrected to read as “Parivahan (Power) Vibha., 429517=14-11-1992, 424775=6.7.1985, 1027352=RBE No.181/2005, 501003=RBE No.110/2005, 1077074=Further,  it is decided to rename Civil Engineering Training Centre/ Allahabad/NCR appearing under ‘Main Training Centres’ at Sl. No. 45 as ‘Indian Railway Track Machines Training Centre’.  Accordingly, Ministry of Railways have decided to modify the ‘Manual of Management on Training’ [Edition 1998] as per Correction Slip No. 6/2005 and the revised list of training centres [Appendix I] is enclosed with the correction slip.  This supersedes all other lists issued earlier., 1002153=Board’s letter No. E(P&A)I-2005/ALL/RPF/2 dated 29.11.2005 (RBE No.205/05), 715687=            In terms of instructions contained in this Ministry’s letter No. E[GP]2002/2/88 dated 15-6-2004  candidates taking the written examination as part of  selections / LDCE for promotion to Group ‘B’ posts are allowed to take the question papers with them after the examination is over., 306132=In terms of the provisions of the Assured Career Progression (ACP)Scheme issued vide Railway Board’s letter No. PC-V/99/I/1/1 dated 01.10.99, the extension of the benefits of higher pay scales under the ACP Scheme, in accordance with the existing hierarchy, is subject to fulfilment of certain conditions enumerated in Annexure-I of the said letter, Condition number  6 of the Annexure provides for fulfilment of the normal promotion norms  (bench-mark, departmental examination, seniority-cum-fitness in cases of Gr.D employees etc) prescribed in the Recruitment Rules.  It has further been clarified in reply to point of doubt number 46 of Annexure to Board’s letter No. PC-99/I/1/1 dated 19.2.2002 that various conditions specified in the Recruitment Rules for promotion to the next higher grade, including the higher/additional educational qualification, if prescribed, would needs to be met even for consideration under the ACP Scheme., 244990=RBE No. 43/2005, 134274=For the period from 1.1.2005 to 31.1.2005., 686992=IRCTC have now expressed difficulties in conducting selections etc. in terms of para 2(ii) of this Ministry’s letter of even No. dated 02.04.2004 stating that even while the catering activities of some divisions on the railways have been transferred to IRCTC, service records, seniority lists etc are still with the Railways and not all units have been transferred to IRCTC., 876522=1.       Please refer to Para 4.2.1(v) of Board’s policy letter No.E(Sports)2000/Policy/2 dt.19.6.2000., 1075157=2.       Other terms and conditions of the Scheme as stipulated in Board’s above referred letter dated 02-01-2004 remain unchanged., 1059725=‘1303. The railway servants both in group(i) and  group (ii) of Para 1302 cease to perform  the duties of the posts they are holding  from the date they are declared medically unfit for the present post.  No officer has the authority to permit the Railway Servant  concerned to perform duties in the post beyond that date.  If such a Railway servant  cannot be immediately adjusted against or absorbed in any  suitable alternative  post he may be kept on a special supernumerary post in the grade  in which the employee concerned was working on regular basis before being declared medically unfit pending location of suitable alternative  employment for  him with  the same pay scale and service benefits, efforts to locate suitable alternative employment starting  immediately.  The special supernumerary post so created will stand abolished as soon as the alternative employment is located”., 1068331=            Please refer to Board’s letter of even number dated 1.10.1999 regarding the Assured Career Progression Scheme (ACPS) and subsequent amendments/clarifications that have been issued from time to time., 881941=2.      ICF have raised doubts regarding the modified selection procedure as detailed in Para 4 of Board’s letter dated 06.01.2004 and have sought further elaboration of this aspect.  The issue has been examined and it is clarified that the existing selection procedure should be modified to the extent that the selection will be based only on scrutiny of service records and confidential reports without holding any written and/or viva-voce tests.  In this procedure, the Selection Board is supposed to consider the claims of the eligible staff one by one in order of their seniority.  It will scrutinize the service records and confidential reports of staff beyond the number equal to the number of posts calculated in terms of para 4.1 of Board’s restructuring order dated 06.01.2004 only to the extent the number of staff is found unsuitable for promotion.  Further, while implementing the restructuring on the basis of the above procedure, introductions contained in Board’s letter No.E(NG)I-92/CR/3 dated 08.10.93 should be kept in view., 574763=(1)  ‘Act’ means the Railways Act, 1989 (24 of 1989);, 845578=(ii)                Central Government Employees who had retired on CPF benefits before 18.11.1960 and are in receipt of Ex-gratia payment of Rs.654/-, Rs.659/-, Rs.703/-, and Rs.965/-., 803977=(i)                If the number of vacancies is less than or equal to 1500 (One thousand Five hundred), number of persons to be called for PET should be 04 (four) times; and, 1107507=3.   Throughout the principal Act, unless otherwise expressly provided for,  ‘the expressions the Central Government or a State Government’ and ‘the State Government’, wherever they occur, the expression ‘appropriate Government’ shall be substituted and such other consequential amendment as the rules of grammar may require shall also be made., 825586=Ref: Board’s letter No.E(NG)I-2000/PM1/41 dt.12.9.05., 342335=Ref: Board’s letter No.E(P&A)I-98/SP-1/Genl.-1 dated 09.10.1998., 828219=In partial modification of para 3 of this Ministry’s letter of even number dt.05.08.2004 as a result of further review of the matter it has been decided that only the employees working in grades lower than the grades for which GDCE is held, should be allowed to appear in the GDCE., 314758=(i)                This Department has not issued any OM on 4.12.2004 granting additional gratuity to pre 1996 pensioners as there is no such Supreme Court Judgement in that respect; and, 648587=RBE No.139/2005, 1012109=Copy of Ministry of Personnel, Public Grievances & Pensions, Deptt. Of Personnel & Training’s OM No.2/13/93-Estt(Pay-II) dt.26.10.1993., 609910=Footnote:  The Railway Servants (Hours of Employment) Rules, 1961 were published vide G.S.R. 40 dated 6.01.1962 and amended vide G.S.R. 430 dated 26.03.77., 403157=Attention is invited to Board’s letter of even number dated 28.1.2005 on the above subject.  The cities/towns which have been placed in a lower classification in the lists enclosed as Annexure-I & II to the said letter, as compared to their existing classification, shall continue to retain the existing classification until further orders and the Railway employees working therein will be entitled to draw the rates of House Rent Allowance and Compensatory (City) Allowance accordingly., 19655=Board’s letter No. E(P&A)II-2004/PLB-6  Dated 14.1.2005    (RBE No.06/05), 877765=Board’s letter No. F(E)III/2005/PF1/2 dated 2.11.2005 (RBE No.188/05), 154003=1.1.83          31.12.86                11%            70% from 1.1.88 and onwards, 612332=RBE No.125/2005, 693357=As the Railways are aware, instructions for elimination of viva-voce in departmental selections, except in the case of selection for promotion to the posts in the categories of Law Assistants, Physiotherapists, Telephone Operators and Teachers, were issued vide this Ministry’s letter of even number dt.07.08.2003.  With the change in procedure, written test has been made mandatory as part of  the selection process to assess the professional ability of the candidates as against written test and/or viva-voce earlier.  Accordingly, 15 marks earlier allotted to viva-voce have been added to written test making it for 50 marks; weightage under other factors remaining unchanged., 252551=4.       These rates will be effective from 01.12.2004 and remain in force for a period of two years or till further orders., 195283=RBE No.30/2005, 4508=RBE No.04/2005, 294890=Board’s letter No. E(NG)I/94/TR/29 Dated 28.3.05 (RBE No.55/05), 691662=Advance Correction Slip No. 56 R.II / 1987 Edition., 316429= Board’s letter No. E(W)2002 PS 5-1/10 dated 8.4.05  ., 970976=Board’s letter No. PC-III/2005/CRC/11 dated 28.10.2005   ( RBE No 186/05.), 1096564=   Board’s letter No. F[E]III/2005/PN1/23 dated 28-12-2005  ., 353393=Consequent to sanction of an additional instalment of Dearness Allowance vide this Ministry’s letter No.PC-V/97/1/7/14 dated 08-04-05, the President is pleased to decide that the rates of Night Duty Allowance, as notified vide Annexure A and B of Board’s letter No. E(P&A)II-2004/HW-1 dated 10.11.2004 stand revised with effect from 1.1.2005 as indicated at Annexure A in respect of ‘Continuous’, ‘Intensive’, ‘Excluded’ categories and workshop employees, and as indicated at Annexure B in respect of ‘Essentially Intermittent’ categories respectively., 352186=          Attention is invited to the instructions contained in Board’s letters No.E(NG)II/99/RR-2/3 dated 4.5.2000, E(NG)II/90/RR-2/1 dated 19.6.2000 and E(NG)II/2003/RR-2/3 dated 19.11.2003, inter alia laying down the detailed guidelines for recruitment against Cultural and Scouts & Guides Quota., 1103184=Sub:    The Payment of Wages (Amendment) Act, 2005., 242850=Board’s letter No. PC-V/2003/1/7/6/1 Dated 28.02.2005( RBE No.37/05), 648633=Board’s letter No. E(MPP)2005/13/2 dt. 22-08-05 (RBE No.139/05), 1105341=New Delhi, the 6th September, 2005/Bhadra 15, 1927 (Saka), 353308=Sub: Rates of Night Duty Allowance w.e.f. 1.1.2005., 134206=Scheme, 1980 – Tables of Benefits for the Savings Fund, 175946=1.1      The stipulation at [i]         above is based on the consideration that the scheme of introduction of the category of Master Craftsman vide para 1[iii] of this Ministry’s letter No. PC-III/82/PS3/10 dt. 14-02-1986 provides that the scale of pay attached to the post will be personal to the incumbent., 569868=3.       It has also been decided that on the same lines as “Pension Adalat”, the Railways/Pus should hold “Adalat for Pending Compassionate Appointment Cases”.  This Adalat should be held by ADRM & Sr.DPO at the Divisional level and AGM & CPO at the Headquarters level for pending compassionate ground appointment cases.  To start with, this Adalat may be held on 10th November 2005.  Necessary publicity to this Adalat may also be given through Newspapers and official notices.  Needless to say an effort should be made to consider such cases with more compassion, keeping in view the financial status of the ex-employee as also his dependencies., 568227=Hon’ble Minister for Railways in a recent meeting has expressed his concern over the large number of pending compassionate ground appointment cases as also the large number of representations being received in Railway Board’s office from different quarters regarding the delay taking place in finalization of such cases on the Zonal Railways.  It has also been observed that in many cases wherein compassionate ground appointments could have been easily considered as per extant rules, the same was not given for years together resulting in such references being made and dealt at the Railway Board’s level.  In Board’s letter of even number dated 30-07-02, railways have already been advised that the compassionate ground cases should be monitored by Sr.DPO at the Divisional level and the CPO at the Headquarters level.  There is however, an urgent need to give far more focused attention in resolving such pending / current cases with speed, to alleviate the suffering of  such families., 19610=RBE No.06/2005, 407459=[Authority : E(MPP)2003/3/35  dated 12.5.2005], 334596=RBE No.62/2005, 217968=(2)  They shall be deemed to have come into force from the 30th  day of  September,2000., 427491=02-12-1989, 318694=iv)               Duty Card passes to GRP personnel should be issued strictly in accordance with the provision contained in Board’’ letter No.E(W)86PS5-13/1 dt.21.2.86., 237117=Sub: Revision of flat rate of license fee (Standard Rent) for residential accommodation all over Indian Railways w.e.f. 01.07.2004., 1027503=Sub: Amendment to IREM Para 1132 of Ch.XI regarding House Building Advance (HBA) to Railway employees., 433224=29-3-2003, 422765=19.1.1980, 994482=Board’s letter No. E(GP)2005/2/61 dated 22.11.2005 (RBE No.200/05), 184407=The above action plan should be furnished to Board every quarter commencing from June 2005 onwards., 334641=Board’s letter No. E(D&A)2005/GS 1-1 dated 12.4.05 (RBE No.62/05), 646698=INDIAN RAILWAY ESTABLISHMENT MANUAL, VOLUME I 1989 EDITION, 819509=The issue regarding entitlement of officers to staff cars and replacement thereof in the light of the instructions issued by Ministry of Finance vide their O.M.No.7(5).Coord/2004 dated 24.9.2004 relating to austerity in expenditure was reviewed by Board at their meeting held on 28.2.2005 and it was decided as under., 63079=RBE No.11/2005, 823296=Reference IRISET’s letter No.ESB/V dt.26.07.2005 on the above subject., 1019891=In order to rectify this anomalous situation and in partial modification of the existing orders on the subject, the President is pleased to decide that Members of various Group A services appointed to posts in the Central Secretariat under the Central Staffing Scheme and who are approved for proforma promotion, while on Central deputation, to the Senior Administrative Grade and above in their parent cadres and exercise the option to continue on deputation till the completion of their prescribed tenure may also be permitted to draw their pay at the maximum of the scale of pay applicable for the lower deputation post w.e.f. the date they are promoted proforma to higher scale of pay in their parent cadres.  In other words, the pay of officers appointed to posts of Director and equivalent in the Central Government shall be fixed at the stage of Rs.18,300 in the pay scale of Rs.14300-400-18300 on their proforma promotion to the Senior Administrative Grade in their parent cadres. Similarly, the pay of officers appointed to posts of Joint Secretary and equivalent shall be fixed at the stage of 22,400 in the pay scale of Rs.18400-500-22400 on proforma promotion to posts in scales of pay above the Senior Administrative Grade. They shall also be entitled, in addition, to the adhoc stagnation increments from time to time in the scales of pay applicable to the lower deputation posts as prescribed in the Department of Expenditure Office Memorandum No.1(9)E.III/A/97 dated 22nd July,1998, subject to their fulfilling the conditions prescribed in this regard., 233279=RBE No.44/2005, 213624=2.         In this regard, Board also desire that the Railways and Production Units should furnish information regarding the sanctioned  strength of Jr. Clerks, Sr. Clerks, Jr. Accounts Assistants and Accounts Clerks as on 1.4.92 and as on 1.11.2004., 981568=            A copy of Ministry of Personnel, Public Grievances and Pensions [Department of Personnel and Training]’s Office Memorandum No. 6/7/2003-Estt.[pay.II] dated  3rd November, 2004 on the above cited subject is sent herewith for information and guidance.  The Cases of extensions of deputation / foreign service may be processed in strict observance of the instructions reiterated., 495460=It has come to the notice of this Ministry that disciplinary powers in respect of Group B officers, officiating in Senior Scale, are being exercised by the authorities mentioned in Schedule III to RS(D&A) Rules, 1968, by treating these officers as Group ‘B’ officers., 217942=Rules, 2005., 248803=The matter has been examined and it has been decided that upgradation of the posts of Sr.Traffic Costing Inspectors to the pay scale of Rs.7450-11500 cannot be granted.  However, the staff posted against the posts of Sr.Traffic Costing Inspectors in Traffic Costing Cell may be allowed to draw pay in the pay scale of Rs.7450-11500 if they are promoted to this pay scale in their respective parent cadres., 797377=The additional installment of Dearness Allowance payable under these orders shall be paid in cash to all Railway employees.  The arrears may be charged to the salary Bills for October,2005 and no honorarium is payable for preparing separate bill for this purpose., 2145=Certain doubts have been raised by one of the Railways regarding grant of Composite Transfer Grant to officers who are transferred and relinquish charge from the old HQs on or before 31.3.04 but join the new HQs on or after 1.4.04.  The issues have been examined in Board’s office and are clarified as under:, 4553=Board’s letter No. E(W)2004/PS 5-1/21  Dated  10.1.05     (RBE No.04/05), 254230=Board’s letter No. F(E)I/2005/AL-4/2  Dated 22.3.05(RBE No.51/05), 991174=Attention is invited to Board’s letter No.E(GP)2003/2/22 dated 16.6.2003 outlining the procedure to be followed for placement of 80% Group ‘B’ officers in scale Rs.7500-12000/-, in the higher Group ‘B’ scale of Rs.8000-13500/-., 312686=RBE No.47/2005, 984687=Board’s letter No. E[NG]II/2005/RR-1/14  dated 16-11-2005 (RBE No.195/05), 418431=30.10.1971, 72556=(2) Rule 5 shall be deemed to have come into force from the 19th day of July, 1997 and the remaining provisions of these rules shall be deemed to have come into force from the Ist day of January, 1996., 713639=04.11.1992   and E(NG)II/2001/SB/2 dt.04.01.2001., 837099=(b) Post Retirement Complimentary Passes shall also not be issued to those Railway servants who are removed from service on or after 26.10.2005., 19786=Sub: Payment of Productivity Linked Bonus to Apprentices – PNM/NFIR Item No.46/2004., 245145=Sub: Rates of Dearness Allowance in respect of Railway employees of who have continued to draw their pay/emoluments in the pre-revised scales of pay – effective from 1.7.2002, 1.1.2003,, 979762=2.         In the above context, item No. 23/2005 has been tabled by the staff- side in the PNM/NFIR stating that wards of deceased employees who are diploma holders are not being considered for the post of JE-II and are being offered lower posts., 346028=2.       The High Court of Delhi, in its judgment dated the 28th May 2004 in the Criminal Writ Petition No.1004/03 (Chandra Kumar Jain Vs.Union of India) has observed that a Government servant who had visited some foreign countries 161 times on private visits without permission was never questioned and no one in the customs and the other departments suspected why a Government servant was so frequently (161 times) making private visits without permission.  The High Court has, therefore, directed the Central Government to frame guidelines on foreign private visits of the Government servants., 514935=RBE No. 122/2005, 378543=Ministry of Human Resource Development, Department of Secondary & Higher Education have issued a further notification of same number dated 14.5.2004 extending the provisional recognition granted to the Prathama Examination conducted by Hindi Sahitya Sammelan, Allahabad for the purpose of employment under the Central Government for the post for which the desired qualification is a pass in matriculation for a further period of 03 (three) years from 27.7.2004 to 27.7.2007. A copy of the same is enclosed for guidance and compliance., 367556=            In para 12 of this Ministry’s letter No. PC-III/2003/CRC/6 dated 09.10.2003 it was stipulated that the post of Gateman (Engg.) should be operated in grade Rs.2750-4400 and the  Trackmen etc. at the time of their promotion to this grade should be posted as Gatemen (Engg.) subject to their fulfilling  the requirement of prescribed medical  standard and literacy level  etc.  Attention is also invited to this Ministry’s letter of even number dated 13.07.2004 which was kept in abeyance by this Ministry’s letter of even number dated 02.08.2004., 134654=No. 7(1)/EV/2004, 821321=Board’s letter No.2003/H/28/1/RELHS dated 21.10.2005, 327512=4/29/99-P&PW(D) dt.12.7.2000, 832387=Ref :  Board’s letter of even no. dt. 20-01-05., 986890=2        Consequent upon increase in Dearness Relief to pensioners/family pensioners, w.e.f. 1.7.2005 in terms of Board’s Circular No.PC-V/97/I/9/6 dated 27.10.2005 a dependent relative in relation to a Railway servant as described in Railway Servants (Pass) Rules, 1986 shall be deemed to be wholly dependent on the Railway servant only if his/her income w.e.f. 1.7.2005 including pension, dearness pay and dearness relief in terms of Board’s letter No.PC-V/97/I/9/6 dated 27.10.2005 does not exceed Rs.2723/- i.e. Rs.1500/- (pension/family pension)+ Rs.750 (DP) + 21% of Rs.2250 (1500+750) or 15% of the pay of Railway servant, whichever is more., 254185=RBE No.51/2005, 1103076=Railway Board’s letter No.E(LL)97/AT/PW/5 dtd.20.12.2005 (RBE No.216/2005), 1057389=In terms Para 1303(a) as modified vide ACS No. 148 issued  under this Ministry’s  letter No. E(NG)1-2001/RE-3/8 dated 1.7.2003 a Railway servant who has been declared totally  incapacitated  not fit for any alternative post even in the lowest medical category, should be declared invalidated and retired from service as per  procedure in force prior to coming into force of revised procedure laid down in ACS No.77 issued under the  Ministry’s letter No.E(NG)I-96/RE-3/9(2) dated 29.4.99., 836631=Advance Correction Slip No.49 to Railway Servants (Pass) Rules,1986 ( 2nd Edition 1993), 305838=RBE No. 50/2005, 722923=Board’s letter No. E(G)2004 RN5-11 dt. 4.2.05  (RBE No. 23/05), 1104963=No.47                     NEW DELHI, TUESDAY, SEPTEMBER 6,  2005/BHADRA 15, 1927, 838836=rates effective from 01.07.2005., 825673=Kindly refer Board’s letter No.E(MPP)2001/19/3-Recomm.37 dated 29.6.01 (RBE No.127/2001), 25.7.01 (RBE No.143/2001) and No.E(MPP)99/19/1/Pt. dated 11.03.03 (RBE No.49/2003) advising therein the process of selecting the Instructors/Trainers/Principal . In continuation of Board’s letter quoted above, it has been decided that while holding the selection of instructors/trainers/principals, the candidates will have to undergo viva-voce in addition to the written examination., 433573=30-10-2004, 250766=Revised rates effective from 1.12.2004, 881728=Please refer to this Ministry’s letter Nos. PC.III/2003/CRC/6 dated 09.10.2003 & 06.01.2004 and PC-III/2003/CRC/7 dt.03.03.2004 (applicable to RDSO only) on the above subject., 128411=“Apprentices Act, 1961, 561538=3.       Further, Rule 15 of RS(D&A) Rules, 1968 specifically provides about the course of action to be taken in respect of Railway employees who are on deputation to Central/State/Local Government or other authority.  Similarly, Rule 16 makes provision about officers on deputation from other Central/State Governments etc. to the Railways.  Roles of Lending Authority and the Borrowing Authority have been clearly specified in these rules.  Provisions contained in these Rules should be kept in view while initiating disciplinary proceedings against the Railway employees on deputation to other departments, etc. or employees belonging to other departments taken on deputation to the Railways., 977572=Instances of non-acceptance by certain Zonal Railways of the guardianship certificate issued by the Local Level Committee headed by the District Collector constituted under the National Trust Act,1999 for the Welfare of Persons with Autism, Cerebral Palsy, Mental Retardation and Multiple Disabilities, have come to the notice of Board. Board desire that in those cases where the Railway servant or the pensioner or the spouse, or the family pensioner, as the case may be, did not nominate a person to receive family pension for life in respect of his/her mentally retarded son or daughter, family pension may be sanctioned and released through the person in favour of whom legal Guardianship has been provided duly stating the purpose as for receipt of family pension, by the Local Level Committee, a statutory body constituted under the National Trust Act,199, without insisting on guardianship certificate from a court., 411993=Ref: Board’s letter No.PC-V/97/I/9/6 dated 22.2.2005 (R.B.E.No.33/2005)., 719785=dated  27.10.1997., 990823=Board’s letter No. E(D&A)2004/RG 6-40 dated 28.1.2005 (RBE No.18/05), 418768=4.12.1971, 448773=Members of RELHS who joined the scheme after 28-01-05 and have contributed more than the requisite amount are entitled to claim reimbursement of the amount paid in excess or vice-versa., 819328=Copy of Board’s letter No. E(G)2000 AL 4/13 pt.  dated 26.5.05 (RBE No.90/05), 567866=RBE No. 127/2005, 420695=2193, 493120=In this context, it is advised that it had already been clarified vide Board’s letter No.E(P&A)I-79/FE/4/2 dated 11.04.1980 that all the categories of Drivers of Motor Vehicles including Truck Drivers, Road Roller Drivers, EOT Crane Drivers, Fork Lift Drivers, Tractor, Jeep, Ambulance Drivers, Staff Car Drivers etc., whether working in the Workshops/sheds or in the Administrative Establishments and who are subjected to the prescribed Trade Test for promotion, should be classified as Artisan Staff.  This had further been clarified vide Board’s letter No.PC-III/93/Misc./3 dated 21.2.1994.  This position still holds good and it is clarified that Motor Vehicle/Staff Car Drivers should be classified as Artisan Staff and percentage distribution as prescribed for Artisan staff in Annexure’E’ of Board’s letter No.PC-III/2003/CRC/6 dated 09.10.2003 may be made applicable to all Motor Vehicle/Staff Car Drivers provided the pre-revised percentages of the Artisan categories were applicable to these categories., 724739=          Copy of Board’s letter No.F(E)III/2003/PF1/1 dt.30.05.05 is published for information, guidance  and necessary action, 684595=Ref: Policy letter No.E(Sports)2000/Policy/2 dated 19.6.2000., 1042676=While implementing Ministry of Finance’s O.M. 105/1/2004-IC dt.1.3.2004 certain doubts/clarifications were raised by various Ministries/Departments/PAOs. The matter was examined in consultation with the Ministry of Finance and clarificatory of O.Ms. Dated 27.1.2005 and 24.2.2005 were issued.  On receipt of further doubts the matter was again examined in consultation with the Ministry of Finance and Ministry of Law. The following clarifications are issued in supercession of the O.Ms. Dated 27.1.2005 and 24.2.2005:-, 876246=Board’s letter No. E(Sports)2004/Policy/2 dated 28.10.05 (RBE No.184/05), 323094=Ref: Board’s letter No.E(P&A)I-2001/RT-2 (KW) dated 2.1.2004., 838899=A copy each of Office Memorandum No. 42/2/2005-P&PW (G) dated 14.10.2005 of Ministry of Personnel, Public Grievances & Pensions (Department of Pension and Pensioners’ Welfare) on the above subject are  sent herewith for your information and necessary action. As stated in para 2 thereof, these orders will apply to Railway pensioners also., 285785=3.             The additional instalment of Dearness Allowance payable under these orders shall be paid in cash to all Railway employees.  The arrears may be charged to the Salary Bill for April 2005 and no honorarium is payable for preparing separate bill for this purpose., 565894=                        Attention is invited to para 3.5 of Board’s letter No. E[D&A]92/RG6-149 [A] dated 21-01-93 which deals with the situation where the disciplinary / criminal proceedings etc. against a non-gazetted railway servant, for whom vacancy had been reserved, is finalised and he is exonerated / acquitted in the proceedings., 184826=ACTION PLAN 2005-06 OF INDIAN RAILWAY INSTITUTE OF [CTI], 305884=Board’s letter No. PC-V/2004/ACP/1 dated 23.3.2005.(PC-V/450 RBE No. 50/05)., 1066148=In terms of proviso below Rule 75 (6) of Railway Services (Pension) Rules, 1993, if a son or daughter of a railway servant is suffering from any disorder or disability of mind, including mentally retarded, or is physically crippled or disabled so as to render him or her unable to earn a living even after attaining the age of twenty five years, family pension shall be payable to such son or daughter for life subject to certain conditions.  Certain Railway administrations have sought clarification whether blindness can be considered as a physical disability for the purpose of sanction of family pension for life under this proviso., 704345=Railway Board have reviewed the instructions contained in para 3 of Railway Board’s letter No.E(G)2000 QR1-23 dated 1.6.2001 regarding  retention of Railway accommodation in favour of Railway officers/staff posted on deputation to CRIS.  Considering the fact that CRIS is a Society which cannot make profit and its all expenditures are charged to the Railway Projects, CRIS has been separated from the group of other PSUs for the purpose of allotment/retention of Railway accommodation.  It has been decided that in the event of a Railway employee proceeding on deputation to CRIS retention of Railway accommodation at the previous place of posting will continue to be governed by para 3 of Railway Board’s instructions dated 1.6.2001 permitting retention of Railway quarter for a period of only two months.  In the event the deputationist Railway employee is posted by CRIS at the same station (from where the employee has proceeded on deputation to CRIS) where he/she is in allotment of Railway accommodation, on a request from CRIS with a certificate that no accommodation is available in its pool for allotment to the concerned employee, the deputationist Railway employee to CRIS may be allowed to retain the Railway accommodation under his occupation so long as the employee continues to be on deputation to CRIS and posted at the same station.  In case the deputationist Railway employee to CRIS is posted at a different station, Railway accommodation as per the entitlement of the said employee may be allotted for the entire period of deputation to CRIS., 722877=RBE No. 23/2005, 288653=RBE No.52/2005, 118298=Board’s letter No. E(MPP)2003/3/35  dated 31.1.05     (RBE No.20/05), 65405=RBE No.15/2005, 195345=Board’s letter No. F(E)Spl.2004/FR/1/2 Dated 22.2.05  (RBE No.30/05), 832483=            Issue of Post Retirement Complimentary Passes to retired railway servants is regulated in terms of provisions contained in Schedule IV of Railway Servants [Pass] Rules, 1986 (Second Edition,1993). Item No.(iv) under column 3 of Schedule IV provides as under:-, 819266=RBE No.90/2005, 988723=Ref: Board’s letter of even number dated 4.6.2003 (RBE No.90/2003)., 19904=A reference has been received from one of the Zonal Railways seeking clarification whether apprentices would be eligible for grant of Productivity Linked Bonus (PLB) if they are being paid stipend during the training period.  This issue has also been raised by the Staff side in the PNM/NFIR Meeting as Item No.46/2004., 715346=Board’s letter No. .E(NG)I-2004/PM1/25 dated 23.9.05  (RBE No.162/05), 118504=In partial modification of Board’s letter No.E(MPP)2003/3/35 dated 28.5.04 (RBE No.109/2004), it has been decided that, 724959= Copy of Board’s letter No. F(E)111/2003/PF1/1 dt.30.05.05 (RBE No.91/05), 804240=(ii)              If the number of vacancies is greater than 1500 (One thousand five hundred), the number of persons to be called for PET should be 03 (three) times., 420767=29.7.1978, 325443=RBE No. 69/2005, 367434=Sub: Filling up the post of Gateman (Engg.) in scale Rs .2750-4400., 530598=Board’s letter No. . E(NG)II/96/RR-1/62 dated 18.7.05 (RBE No.121/2005), 572382=RBE No.129/2005, 1070453=   Board’s letter No. E[W] 2004/WE-1/6 dated  8-12-05  (RBE No.212 /05), 708994=Board’s letter No.E(P&A)II-2005/RS-10 dt. 4.09.05 (RBE No111/05)., 795416=RBE No.172/2005., 65450=Board’s letter No. F(E)III/2003/PN1/25   Dated  20.1.05    (RBE No.15/05), 427150=11-11-1989, 386167=[b]   50%  by promotion from amongst existing Gr. ‘D’ staff in service as on 22-05-2002 not having the qualification of Class X Board Examination., 325489=Board’s letter No.  PC-V/97/1/9/6 dated 26.4.2005 ( PC-V/454 RBE No. 69/05)., 640720=Board’s letter No. E(NG) I-2005/PM1/31 dated 12.8.05  (RBE No.134/05), 195534=Ref: 1. Board’s letter No.F(E)Spl.98/FR/1/1 dated 28.1.2000, 327649=F(E)III/96/PNI/9 dt. 2.8.2000 RBE No.138/2k (SC No. 176/2k)., 243106=pay in newly revised pay scales w.e.f. 01.01.96., 153777=1.1.82          31.12.82                10%   Saving 68.75 from 1.1.82 to 31.12.87, 412099=A copy of Corrigendum No.45/1/2004-P&PW(G) dated 24.02.2005 of Ministry of Personnel, Public Grievances and Pension (Department of Pension & Pensioners’ Welfare) on the above subject is sent herewith for your information and necessary action., 431536=20.3.1999, 305678=[Authority: Board’s letter No. 2004/H/28/1 RELHS/Card dated 22.3.05], 252807=  Board’s letter No. E(W)2001/PS 5-1/1 dated 16.3.05, 648367=It has also been decided that indents  placed after issuance of Board’s letter dated 02-08-2005 ibid may be suitably amended., 245036=Board’s letter No. PC-V/97/1/7/14 Dated 16.3.2005 (PC-V/449, RBE No./43/05), 342041=RBE No.65/2005, 368811=“ As a result of implementation of this restructuring, more number of additional posts will be available in the highest grade of this category.   Henceforth, therefore, the posts of Gatemen (Engg.) should be operated in grade Rs. 2750-4400.”, 1070377=RBE No.212 /2005, 429176=22.2.1992, 994742=Please refer to Board’s letter No.2005-E(SCT)I/25/14 dated 16.11.2005 regarding adoption of post based roster for promotions from Group ‘C’ to Group  ‘B’ and within Group  ‘B’. For operation of post based roster, the Group ‘B’ cadre strength may be fixed as follows:, 380641=In terms of the provisions contained in paras 149, 150 and 151 of Indian Railway Establishment Manual, Volume-I (1989 Edition), the vacancies in the categories of ESM grade III, MSM grade III, TCM grade III and WTM grade III all in the pay scale of Rs.3050-4590 are filled as under :-, 640674=RBE No.134/2005, 514982=Board’s letter No.. F (E) III/2002/PNI/29 dated 20.07.2005  (RBE No. 122/2005.), 830187=All other terms and conditions contained in Board’s letter No. 97/H/28/1 dated 23-10-97, 17-5-99 and 27-12-99 and letters No. 2003/H/28/1/RELHS dated 28-1-2005 and letter No. 2005/H/28/1/RELHS/Cont. dated 24-6-2005 will remain unaltered., 1002245=Sub: Grant of Ration Money in lieu of Ration subsidy and Extra Duty Allowance to Non-gazetted RPF/RPSF personnel with effect from 1st August 1997 on introduction of revised scales of pay on the recommendations of V Central Pay Commission – Revised thereof., 468409=and Appeal)(Second Amendment) Rules, 2005., 818696=As the Railway administration are aware, in terms of instructions contained in Board’s letter No.E(G) 2000 AL 4/13 pt. Dated 26.5.2005, the General Managers, Additional General Managers, Principal Heads of Departments/Co-ordinating Heads of Departments and Divisional Railway Managers are entitled for replacement of their staff car on condemnation., 295067=Reference this Ministry’s letter No.E(NG)I/87/TR/34 (JCM/DC) dated 27.9.89 enclosing a comprehensive list of sensitive posts for the purpose of periodical transfers.  The categories of TIAs/ISAs were subsequently included in the list of sensitive posts vide this Ministry’s letter of even number dated 2.5.95., 93683=Simulator Training Centre at Bhusawal/Central Railway included earlier vide Board’s Lr.dt:10.7.2003 issued under RBE No.121/2003 has been deleted as per orders issued vide Board’s Lr.No.E(MPP)2003/3/26 Dt: 2.11.2004 (RBE No.231/2004) [CPO/SC’s SC No. 200/04], 495201=Board’s letter No. E(D&A)2005/RG 6-19 dated 24.6.05   (RBE No.106/05), 342086=Board’s letter No. E(P&A/I-2001/JCM/DC-2 dated 19.4.05 (RBE No.65/05), 310123=RBE No.53/2005, 713391=   Board’s letter No. E(NG)II/2005/SB/6 dated 12.9.05 (RBE No.144/05), 891830=Board’s letter No. PC-V/2004/RSRP/4 dated 14.11.2005 (RBE No.191/05), 500877=These instructions will come into force from 01-07-2005., 843102=2.         These orders apply to (I) All Civilian Central Government Pensioners/Family Pensioners (ii) The Armed Forces Pensioners, Civilian Pensioners paid out of the Defence Service Estimates, (iii) All India Service pensioners (iv) Railway pensioners and (v) The Burma Civilian pensioners/family pensioners and pensioners/families of displaced Government pensioners from Pakistan, who are Indian Nationals but receiving pension on behalf of Government of Pakistan, who are in receipt of ad-hoc ex-gratia allowance of Rs.1275/- p.m. in terms of this Department’s OM No.23/1/97-P&PW(B) dated 23.02.1998., 684690=Attention is invited to Para 4.2 & 4.3 of Board’s letter dated 19.6.2000 wherein norms are laid down for recruitment of sportspersons in Group C & Group D category., 547846=7.6        PET should be of the standard prescribed vide letter No.99/E(RRB)/25/11 dated 4.9.2002. It will be ONLY a qualifying test.  Physical Efficiency Test should be video recorded.  Passing of PET is mandatory.  Result of PET will be declared on the same day., 351988=Board’s letter No. E(NG)II/2005/RR-2/3 dated 3.5.2005 (RBE No  71/05), 292411=In order to facilitate operationalisation of New Zones, officers/staff on their posting to New Zones/Divisions were permitted retention of Railway Quarters at the previous place of posting for a period of one year in terms of Railway Board’s letter No.E(G)97 QR1-28 dated 2.9.2002. The period of retention of quarter was subsequently extended vide Railway Board’s letter of even number dated 25.9.2003 for a further period of one year in favour of officers/staff already posted to New Zones and retaining Railway quarter at the previous place of posting in terms of instructions dated 2.9.2002., 243188=The Nursing staff holding B.Sc. degree as additional qualification appointed before 01.01.96, were extended the benefit of two advance increments in terms of IREM (Vol.I)1989 edition, para 166, sub-para (iii).  The above scheme has been reviewed by the Ministry of Health and Family Welfare in consultation with the Department of Personnel and Training and it has been decided to continue the scheme.  The matter regarding treatment of these increments had been under examination in Board’s Office in consultation with Ministry of Health and Family Welfare., 795463=Board’s letter No. PC-V/97/1/7/14 Dt 13.10.2005 (PC-V/460, RBE No.172/05), 528466=INDIAN RAILWAY ESTABLISHMENT MANUAL VOLI, 1989 EDITION., 508388=(1)  Candidates will be issued with a printed passage containing a minimum of 400 words or 2000 strokes in English or 350 words or 1750 strokes in Hindi.  The passage may preferably be the one being regularly used in the day-to-day office working like a D.O.letter, proposal for creation of a post etc.  The passage should indicate the number of strokes at the end of each line, each para and at the end of the passage., 126772=Ref: Board’s letter No.E(MPP)95/6/13 dt.21.8.95., 345240=The undersigned is directed to refer to this Department’s O.M.No.11013/7/94-Estt.(A) dated the 18th May,1994 in which it has, inter alia, been clarified that the Government servant should take permission for leaving station/headquarters specially for private visits abroad.  It has also been clarified in O.M.No.11013/8/2000-Estt(A) dated the 7th November,2000 that the leave sanctioning authority while granting leave shall take prior approval, if required, for permitting the officer to go abroad as per the existing instructions.  Despite these instructions, instances have come to the notice of the Government where Government servants have left their headquarters without taking prior permission and proceeded abroad., 284574=Reference to this Ministry’s letter of even number dated 27.9.2004 ( S.No.PC-V/431  RBE No. 21/ 2004 ) on the  subject mentioned  above.  The President is pleased to, 322894=  Board’s letter No. E(P&A)I-2001/RT-2 (KW) dated 15.4.05  (RBE No.64/05), 134878=New Delhi, the 31st December, 2004., 750435=iii)        All the employees who entered into Railway service/ Central Government service or the service of an autonomous body set up by the Central Government on or before 31.12.2003 and who were governed by old  pension scheme under  the Railway Services (Pension) Rules, 1993/ Central Civil Services (Pension) Rules,1972 and who submit technical resignation on or after 1.1.2004, to take up new appointment under State Government, will be eligible for grant of pro-rata pensionary benefits for the period of Railway/Central Government or Central Autonomous Body service, on the lines as provided in Rule 53 of Railway Services (Pension) Rules,1993 or Rule 37 of Central Civil Service (Pension) Rules,1972, as the case may be, and related orders., 676650=i)                   The existing maximum limit of Rs.2500 (Rupees two thousand five hundred) per month laid down in sub-rule (11)(a)(i) revised upwards to Rs.15000 (Rupees fifteen thousand) per month., 563716=Ref :  Board’s letter No.97-E(SCT)I/25/4 dt. 11.1.2002., 72104=S.O.       In exercise of the powers conferred by the proviso to article 309 of the Constitution, the President hereby makes the following rules further to amend the Railway Services (Commutation of Pension) Rules, 1993, namely:-, 410331=RBE No.85/2005, 514140=Board’s letter No. E(NG)I-2002/PM1/23 dated 11.7.05 ., 4879=Blood donation and eye testing camps were being organised on the Railways by the Federations for which complimentary cheque passes used to be issued by Zonal Railways without obtaining Board’s approval.  Zonal Railways were, therefore, advised vide Board’s letter No.E(W)2001PS5-6/97 dt.25.2.02 that proposal for issue of special complimentary cheque passes for purposes not covered under Schedule VII of Railway Servants (Pass) Rules, 1986 (Second Edition, 1993) should be referred to Board’s Office for obtaining approval of the competent authority.  This has caused delay in issuing complimentary cheque passes at short notice to the doctors and para medical staff in connection with blood donation  and eye testing camps being organised on the Railways., 644192=RBE No.136/2005  , 532700=5.         Broad guidelines for recruitment to Group ‘D’ posts are enclosed as Annexure-I.  However, in case any further clarification is required, the Railways may consult Chairman/Railway Recruitment Boards and Manual for Railway Recruitment Boards, 2000 published by the Railway Board.  Certain shortcomings, which have been noticed in Railway Recruitment Board’s selections, have been listed out at Annexure II.  These may be guarded against in the selections to be done through this scheme., 889062=2.         Attention in this connection is invited to the instructions contained in Board’s letter No.E(P&A)II-2004/RS-13 dated 30.6.2004 wherefrom it is evident that for the purpose of calculating 30% of the basic pay of running staff under Rule 8(a) & Rule 25 of “The Rules for payment of Running and other Allowances to the Running staff on Railways, 1981”, Dearness Pay is also to be taken into account with effect from 1.4.2004, 382118=3                    The Federation in the PNM-AIRF have represented that the existing Group ‘D’ staff should be allowed promotion without insisting on enhanced qualification of Class X Board Examination. The matter has been discussed in successive PNM-AIRF Meetings in which  the Federation have been insisting on their demand that the condition of qualification should not be applicable to existing staff.  Pursuant to these discussions the Ministry of Railways have reviewed the matter and have decided that the condition of qualification of Matriculation having been accepted pursuant to RSRC’s recommendations and sophistication in S&T equipment/technology, the qualification cannot be done away with altogether.  However, keeping in view the aspirations of existing Group ‘D’ staff in service as on 22-05-2002 not having the qualification of Matriculation, it has been decided that 50% of the quota earmarked for promotion of Group ‘D’ staff in the categories mentioned above may be filled from amongst existing Group ‘D’ staff in   service as on 22-05-2002 not having the qualification of Class X Board Examination. The  balance of 50% of quota earmarked for promotion should continue to be filled from amongst Group ‘D’ staff in S&T Deptt. possessing the qualification of Class X Board Examination.  Accordingly the posts of ESM/ MSM Gr.III  TCM Gr.III and WTM Gr.III all in the pay scale of Rs.3050-4590 will henceforth be filled as under:, 245424=In continuation of Ministry of Railways letter of even number dated 13.6.2002 (S.No.PC-V/344, RBE No.84/2002) revising the rate of Dearness Allowance w.e.f. 1.1.2002 in respect of Railway servants who continue to draw their pay and emoluments in the pre-revised scale of pay, the revised rate of Dearness Allowance w.e.f. 1.7.2002, 1.1.2003, 1.7.2003, 1.1.2004 & 1.1.2004 would be as follows:-, 452874=i)                   The examination should be held combined for all departments for a Zonal Railway/PU by Railway Recruitment Boards catering to Zonal Rlys/PUs as nominated for conducting GDCE vide this Ministry’s letter No.E(RRB)2001/25/31 dated 8.8.2003.  For this purpose the Zonal Railway/PU should club vacancies of all Deptts./Units against this quota and forward applications of eligible employees to RRB concerned as per procedure already being followed by them for GDCE., 814332=Please refer to Board’s letter of even No.dated 16.08.2004 (RBV No.19/2004) laying down that a Railway servant has a right to appeal against an order of recorded warning., 121923=Manual on Management of Training (June 1998), 1113363=24 of 1989, 703549=Rule 1510 of the Indian Railway Establishment Code, Volume II,1987 Edition may be amended as indicated below:, 313241=Department of Pension & Pensioners’ Welfare’s OMs dt.4.12.2001 and 18.2.2003 referred to in the DOP&PW’s enclosed OM dt.17.2.2005, have been adopted/circulated on the Railways vide Board’s letter No.F(E)III/97/PN1/22 dated 25.2.2002 and No.F(E)III/2000/PN1/57 dated 20.5.2003, respectively., 299622=The IREM, Vol. I, 1989 is accordingly amended as in the ACS No.171 ., 65595=S.O.     –  In exercise of the powers conferred by the proviso to article 309 of the Constitution, the President hereby makes the following rules further to amend the Railway Services (Pension) Rules,1993, namely:-, 375466=RBE No. 76/2005, 427832=08-12-1990, 981175=   Board’s letter No. F[E]II/2005/DE/2 dated 23-11-2005  (RBE No.159/05), 518962=   Board’s letter No. E(NG)II/2004/RC-4/SC/2 dated 19.7.05  (RBE No.119/05), 684398=Board’s letter No. E(Sports) 2004/Policy/2 dated 5.9.05  (RBE No.146/05), 806539=3.         It has been decided that in the case of eligible employees mentioned in Para-1 above who were not placed under suspension, or had not quit service/retired/expired during the middle of the financial year 2004-2005 or were on leave where leave salary admissible is not less than that admissible on leave on  average pay,  may be paid an amount of Rs.4849/- towards Productivity Linked Bonus for the financial year 2004-2005.  In the case of employees other than those mentioned above, the amount of Productivity Linked Bonus may be calculated in accordance with the extant instructions on the subject., 443364=RBE No.94/2005, 210711=The powers to grant study leave within India to the Gazetted Officers of the Medical Department were delegated to the General Managers of Zonal Railways vide Railway Board’s letter No.F(E)III/89/LE-1/5 dated 19.2.90.  These instructions inter-alia provided that the General Managers, while considering proposals for grant of study leave, shall satisfy themselves that more than the required number of specialists are not already available and that the work can be managed without substitute during the absence of the officers, who have been granted study leave and that not more than five doctors on each of the Central, Eastern, Northern, Southern, South Central, South Eastern and Western  Railways three each on North Eastern and Northeast Frontier Railways and one doctor each on production units are granted study leave in a year.  The said limit was inclusive of the number of officers who are allowed the deputation terms or Extra Ordinary Leave for study purposes in certain medical specialities as per extant orders., 380203=RBE No.70/2005, 1101402=“ In view of the submission made by the Learned Standing Counsel and in the facts and circumstances of the case as to the pension of the members of the petitioner – association, without expressing any opinion on the merits of the contempt cases, in order to put a quitus to the lis, we feel it just and proper to modify the mode of calculation of the pension to the effect the that pension has to be calculated in respect of  the persons whose representations had been forwarded by the petitioner – Association to the respondents, as per the existing rules without reference to the mode calculation as adopted by the earlier Division Bench of this Court in WP No. 8532 of 2003, within a period of three months from the date of receipt of copy of this order., 1105771=(5TH September, 2005), 992993=Board’s letter No. E(MPP)2005/6/7 dated 22.11.05 (RBE No.202 / 05), 433917=19-02-2005, 1070738=         This  has reference to Ministry of Railway’s letter No. E[W]2003/WE-1/3 dated  23-4-2003 on the above subject., 810954=Reference Board’s letter of even number dated 05.09.2005 wherein it was advised that henceforth, in the discipline of Rifle Shooting, the ‘individual medal winning performance’ of the Shooter in the National Championship will only be considered for recruitment purpose., 401378=Board’s letter No.  E(Sports) 2004/Policy/2 dated 18.5.2005, 322821=RBE No.64/2005, 822056=It is clarified that as per para 2 under Heading “Mode of joining” of Board’s letter Number 97/H/28/1 dated 23.10.97, surviving spouses of the deceased retired railway employees who died after superannuation have already been made eligible to join RELHS-97, subject to fulfillment of other relevant conditions., 801124=Ref : This office letter of even No. dt.18.07.2005 (RBE No.121/2005)., 534549=2.2               Vacancies shall be counted as those existing on 1st January or 1st July of the year of recruitment plus those anticipated over the next two years.  The number of posts to be filled up should be got vetted by Associate Finance., 1053251= Board’s letter No. 2005-B-306 dated 06-12-05, 317148=i)                   Instructions contained in Railway Servants (Pass) Rules, 1986 (Second Edition, 1993) below schedule I, under item II(7) should be followed strictly., 885144=1.1        Prior to issue of instructions contained in Board’s letter No.E(NG)II-98/RR1/107 dated 4.12.98, prescribing the minimum educational qualification for recruitment to Group D posts in the pay scale of Rs.2550-3200 (RSRP) and Rs.2610-3540 (RSRP) as class VIII pass, no qualification for induction in Group D was in force except in the case of Diesel/Electric/EMU sheds and TMO for some time., 488433=Board’s letter No. F(E)III/2005/PN1/16 dated 23.6.05  (RBE No.104/05), 512136=The Indian Railway Establishment Manual, Volume-I, 1989 Edition may be amended as per Advanced Correction Slip No.173 enclosed., 192665=Board’s letter No. E(G)2004 AL1/39  Dated 18.2.05    (RBE No.29/05), 217557=S.O. In exercise of the  powers conferred by the proviso to article 309 of the Constitution, the President hereby makes the following rules further to amend the Railway Services (Pension) Rules, 1993, namely:, 375512=Board’s letter No.  E(NG) I-2005/PM 2/1 dated 6.5.2005(RBE No. 76/05)., 748191=i)                    All the employees who entered into Railway Service/Central Government service or in the service of an Autonomous Body set up by Central Government satisfying the conditions laid down in para 4 of Board’s letter dated 8.4.1985/DP&AR’s O.M. dated 29.8.1984 on or before 31.12.2003 and who were governed by old pension scheme under the Railway Services (Pension) Rules,1993 or Central Civil Services (Pension) Rules,1972 will continue to be governed by the same pension scheme and same rules, for the purpose of counting of their past service under the said rules or under the provisions of Board’s letter No.F(E)III/84/PN1/4 dt.8.4.1985/DP&AR’s OM No.28/10/84-PU dated 29.8.1984, as amended from time to time, if such employees submit technical resignation on or after 1.1.2004 to take up new appointment in another Ministry or Department of the Government of India or an Autonomous Body set up by the Central Government, in which the pension scheme under Railway services (Pension) Rules, 1993/Central Civil Services (Pension) Rules, 1972 already exists for the employees who entered into service on or before 31.12.2003., 878103=In exercise of the powers conferred by proviso to article 309 of the Constitution, the President is pleased to direct that Rules 925 (3), 925 (4) and 925 (5) of Indian Railway Establishment Code Vol. I, Fifth Edition 1985 (Second Reprint Edition 2003) may be modified as per Advance Correction Slip No.94 enclosed., 884671=In terms of instructions contained in this Ministry’s letter No.E(NG)I/99/TR/15 dated 8.2.2000, transfer on request of Railway employees from one Railway/Division/Unit to another Railway/Division/Unit in grades having an element of direct recruitment against DR quota post is accepted on bottom seniority if the employee possesses the educational qualification prescribed for direct recruitment to the post to which transfer is sought for., 674544=6.       These orders will take effect from 1.4.2005., 301750=Board’s letter No. E(NG)I-2005/PM2/1 dated 30.3.05 (RBE No.58/05), 488387=RBE No.104/2005, 971278=Reference Railway Ministry’s letter of even number dated 14.09.2005 laying down the instructions & percentage distribution of posts for cadre restructuring of Group ‘C’ & ‘D’ permanent staff in Centralised Training Institutes., 992946=RBE No.202 /2005, 679940=Board’s letter No. E(MPP)2005/3/43 dated 29.8.05 (RBE No.141/05), 490329=3.       Past cases may also be considered for sanction of family pension subject to fulfilment of all the conditions laid down in the scheme for grant of family pension to dependent parents.  Family pension shall be payable from 1.1.1998 or from the date it becomes due, whichever is later., 808830=Board’s letter No. E(W)2004/CN-1/4 dated 10.10.05 (RBE No.169/05), 841337=ii)                   F(E)III/97/PN1/Ex-gratia/5 dt.27.1.98 (RBE No.19/98, S.No.PC-V/38), 613773=3.       Other terms and conditions for supply of cloth and payment of stitching charges will remain the same as indicated in the Dress Regulations, 2004., 1105700=NO.41 OF 2005, 154451=1.1.90          31.12.00                12%   Risk 31.25% from 1.1.82 to 31.12.87, 503712=Para 2.1 of Board’s letter No.2000/2/84 dated 25.07.01 states as follows:, 563820=          It has since been decided that reservation will not apply to single post cadre. Accordingly, promotions made on ad hoc basis without applying reservation in terms of this Ministry’s letter of even No. dated 11.1.2002 may now be regularized subject to the condition that such promotions were made after following due process of selection or non-selection, as the case may be. Otherwise promotions may now be made on regular basis without applying reservation., 1038407=The absorption of Commission Vendors/Bearers was discussed in the Board Meeting held on 16th November,2005 and the Board have taken the following decisions:-, 420024=2897, 412383=A copy of Corrigendum No.45/1/2004-P&PW(G) dated 24.02.2005 of Ministry of Personnel, Public Grievances and Pension (Department of Pension & Pensioners’ Welfare), 71991=Board’s letter No. F(E)III/2003/PN1/25   Dated 24.1.05 (RBE No.16/05), 873889=RBE No.183/2005                                                                                                                    Board’s letter No. E(G)2003 QR 1-6 dated 28.10.05 (RBE No.183/05), 241433=1076, 234700=2.       The demand for removing the condition of age limit in favour of divorced/widowed daughters, who had already been sanctioned family pension, so that they continue to draw family pension even after attaining the age limit of 25 years, has been under consideration of the Government in Department of Pension & Pensioners’ Welfare and it has now been decided that there will be no age restriction in such cases and they shall continue to draw family pension even after their attaining 25 years of age subject to fulfilment of all other conditions prescribed in the case of son/daughter.  Such daughter, including disabled divorced/widowed daughter, shall, however, not be required to come back to her parental home as stipulated in para 2 (ii) of DOP&PW’s O.M. dated 25th July,2001 (circulated vide Board’s letter of even number dated 20.8.2001), which may be deemed to have been modified to that extent., 752491=Board’s letter No. E(RRB)2001/25/31 dated 29.9.05 (RBE No.164/05), 212778=RBE No.38/2005, 124728=Board’s letter No. TC-1/2001/108/4-Pt dated  1.2.05.     , 384182=(b)                  50% by promotion from amongst existing Gr.’D’ staff in service as on 22-05-2002 not having the qualification of Class X Board Examination., 241460=1230, 192619=RBE No.29/2005, 213015=Attention is invited to Board’s letter of even number dated 8.1.2003 on the above subject, wherein instructions had been issued for freezing of 25% of the vacancies falling within the direct recruitment quota in the category of Clerks in scale Rs.3050-4590 (RSRP) and in Senior Clerks in scale Rs.4500-7000 (RSRP) and 20% in the category of Junior Accounts Assistant and Accounts Clerk.  The question of continuance of the above freeze orders has been considered by the Board and it has been decided to extend the currency of the instructions mentioned for a further period upto 31.12.2006., 402627=Board’s letter No.  E(P&A)II-2004/HRA-16 dated 17.5.2005(RBE No. 84/05), 496824=RBE No.112/2005, 155718=CENTRAL GOVT.EMPLOYES GROUP INSURANCE SCHEME 1980, 424367=1822, 64664=Advance Correction Slip No.47 to Railway Servants (Pass) Rules, 1986 (Second Edition, 1993), 774327=2610-3540, 837508=(d) Post Retirement Complimentary Passes shall be issued to those railway servants who are dismissed or removed from service on or after 26-10-2005 but are granted compassionate allowance in terms of Rule 65 of Railway Services (Pension) Rules,1993. Post Retirement Complimentary Passes shall be issued to such dismissed/removed railway servants from the date of grant of compassionate allowance., 804504=It is further clarified that the rates shown in  the table in para 8 of Annexure-I of letter quoted above are only for guidance of the railways and that the actual rates may be at variance with those given in the table, as such, the railways shall follow the usual procedure of tendering and finalize the rates in terms of instructions contained in Board’s letter No. E(RRB)/2002/16/3 dated 04.12.2002 (RRCB No.15/2002)., 118253=RBE No.20/2005, 71946=RBE No.16/2005, 682048=Board’s letter No. E(G)2003 QR1-19 dated 2.9.05 (RBE No.145/05), 616071={Authority: Board’s Lt. .No. E(MPP)2001/3/9/Vol.III dt:5.8.2005], 126854=Kindly refer Board’s letter No.E(MPP)95/6/13 dt.21.8.95 (copy enclosed) directing the railway Administration to transmit all the contracts of apprenticeship for registration to the Apprenticeship Adviser well within a period of 3 months.  It is observed that some of the railways are still not following Apprentices Act,1961 which has been the cause of embarrassment to Ministry of Railways., 215184=(iii)            Apprentices given training in Railways under Apprenticeship Act, 1961, where there is no condition of appointment on regular basis., 287752=2.       The above issue was discussed in the PNM-AIRF Meeting held on 27-28.12.2004 wherein the official side explained that instructions already exist to the effect that combined service in the basic grade and the senior grade in the categories of Drivers and Guards can be taken into account for reckoning the two years residency period for promotion to the next functional grade which also means that a person with less than two years in the basic grade can be promoted to senior  grade.  However, the federation wanted that this should be explicitly clarified to the Railways as some element of doubt still existed on this aspect.  It was agreed to do the needful., 245344=1.7.2003, 1.1.2004 & 1.7.2004 – regarding., 979147=Board’s letter No. E[NG]II/2000/RC-1/Genl./16 dtd 17-11-2005  (RBE No.198/05), 516930=Revision of Pension of pre and post –1986 pension/family, 814105= Copy of Board’s letter No. 2005/V-I/DAR/1/3 dated 6.10.05 , 284502=Revised Rates effective from 1.1.2005., 579215=(9)                          ‘running staff’ means the staff who are defined to be so in Rule 1507 of Indian Railway Establishment Code Volume II (1990 Edition);, 292148=Board’s letter No. E(G)2003 QR1-6 Dated 24.3.05(RBE No.54/05), 324654=In para 3 of this Ministry’s letter of even number dated 22.9.2003 it has been conveyed that for promotion from Group D to Group C posts, the selections will henceforth consist of written test and record of service of 85 and 15 marks respectively.  In the procedure for promotion against 33 1/3% quota it has been provided that assessment under the heading Record of Service will be based on entries in the Service Book/Personal file regarding academic/technical qualifications, awards/punishment, etc.  It is clarified that in the selections for promotion of Group D staff to Group C posts against 16 2/3% quota also the same procedure for assessment under the heading record of service will be followed., 774344=2550-3200, 716959=RBE No 142/2005, 709369=In the PNM/AIRF Meeting held on 16th & 17th May,2005, the staff side mentioned in the above item  that on some of Zonal Railways, emoluments of Loco Inspectors who retired during the period from  01.01.1996 to 30.9.96 were not reckoned properly while computing their pension., 728461=Attention is invited to Board/s letter No.E(D&A)70/RG 6-71 dt.03.06.1971 inter-alia laying down that the fact of imposition of the penalty of ‘withholding of increments’ or ‘reduction to lower stage in the time scale of pay’ on a railway servant does not stand in the way of his consideration for promotion.  Such a Railway servant should also be considered for promotion by the Departmental Promotion Committee which meets after the imposition of the said penalty and after due consideration of full facts leading to imposition of the penalty, if he is still considered fit for promotion, the promotion may be given but only after the expiry of the currency of the penalty., 14644=          Attention is invited to Board’s letter No.PC-V/97/1/7/13 dated 16.10.1997 relating to grant of Compensatory ( City) Allowance (CCA) and House Rent Allowance (HRA) to Railway employees on the recommendations of the Fifth Central Pay Commission whereby a list of cities/towns classified as ‘A-1,’A’,’B-1’ and ‘B-2’  for the purpose of CCA was enclosed as Annexure-I and another list of cities/towns classified as ‘A-1,’A’,’B-1’ and ‘B-2’ and ‘C’ for the purpose of HRA was enclosed as Annexure-II. The matter relating to reclassification of cities/towns on the basis of Census 2001 for the purposes of grant of HRA and CCA to Railway employees has been considered by the Board., 680126=In continuation of Board’s letter No.E(MPP)2000/3/10 dated 10.8.2000 on the above subject it is clarified that the instructions issued in the above mentioned letter is in supercession of Board’s earlier instructions issued vide letter No.E(NG)62RR1/39 dated 15.12.1962., 565512=Board’s letter No. E[D&A]2004/RG6-37 dated 29-07-2005   (RBE No.123/2005), 810842=Ref: Policy letter No.E(Sports)2000/Policy/2 dated 19.6.2000., 241487=1522, 236574=iii)      Family pension  sanctioned to a widowed /divorced daughter and discontinued  on her   attaining  25 years  of   age  prior  to   25.8.2004  shall  be resumed w.e.f. 25.8.2004 and no arrears for the period prior to 25.8.2004 shall be paid., 644245=Board’s letter No. .E(NG)I-2004/PM9/6 dated 16.8.05  (RBE No.136/2005), 845235=(i)                  The widows and dependent children of the deceased CPF beneficiary who had retired from service prior to 01.01.1986 or who had died while in service prior to 01.01.1986 and are in receipt of Ex-gratia payment of Rs.605/-p.m., 378212=Kindly refer  to this Ministry’s letter No.E(NG)-II/2002/RR-1/7 dated 25.1.2002 forwarding therewith a copy of the Notification No. F.24-4/2001-TS-III dated 27.7.2001 issued by Ministry of Human Resource Development, Department of Secondary & Higher Education on the subject quoted above., 1105851=An Act further to amend the Payment of Wages Act, 1936., 347367=(See O.M.No.11013/7/2004-Estt.(A) dated 5th October,2004), 827770=Board’s letter No. E(NG)I-2004/PM 2/3 dated 20.10.05 (RBE No.177/05), 682002=RBE No.145/2005, 1053431=conveyances during 2005-2006., 17927=However, in cases of a trade union office bearer being involved in a Special Police Establishment/Vigilance case or where the Civil and Police Authorities have recommended immediate transfer of a Railway employee who is an office bearer of a recognized union on the ground of indulging in undesirable activities and affecting efficient functioning of the Railway, the procedure laid down in the preceding paragraph need not be followed. Instructions in this regard have been issued vide Board’s letter No.E(L)64UTI-113 dated 21.11.64 and No.E(LR)75 UTI-176 dated 8.8.75., 402581=RBE No. 84/2005, 414470=1.   (1) These rules may be called the Railway Servants (Discipline and Appeal) (Amendment) Rules,2005., 852004=2791-3230, 424439=27.4.1985, 241514=1825, 445373=Board’s letter No.  2005/H/28/1/RELHS/Cont. dated 24.6.2005, 709330=PNM/AIRF Item No.17/2005., 292103=RBE No.54/2005, 884424=Board’s letter No. E(NG)I-2005/TR/20 dated 9.11.2005 (RBE No.190/05), 826181=The revised procedure is applicable to selection notified on or after the date of issue of Board’s letter No.E(NG)I-2000/PM1/41 dt.12.9.05., 1027656=The Ministry of Railways are pleased to amend the existing provisions in Para 1132 of Chapter-XI of IREM Vol.I (Revised Edition, 1989) relating to House Building Advance as per enclosed Advance Correction Slip No.180., 496899=   Board’s letter No. F(E)III/2005/PN1/22 dated 5.7.05  (RBE No.112/05), 508156=[Encl: to Board’s letter No. E(NG)I-2004/CFP/8 dated 4.7.05  ], 135116=Tables of Benefits for the savings fund for the period from 1.1.2005, 434087=Board’s letter No. 2004/H/PNM/NFIR  dated 03-06-2005  ., 241282=1268, 312993=A copy of Department of Pension & Pensioners’ Welfare’s O.M.No.38/42/2005-P&PW(F) dated 17th February,2005 on the above referred subject, is enclosed for information and guidance of the Railways., 818419=Board’s letter No. E(G)2005 AL 4/16 dated 14.10.05 (RBE No.173/05), 241309=1521, 686279=As the Railway are aware it was clarified in para 2(ii) of this Ministry’s letter of even number dt.02.04.2004 that catering staff on their transfer to IRCTC on deemed deputation basis are also required to be extended the benefit of promotion in the normal course by IRCTC in accordance with the procedure applicable to Railway employees.  Subsequently on a reference received from Eastern Railway these instructions were modified vide this Ministry’s letter of even number dt.15.06.2004 to the effect that in cases where seniority of catering staff is maintained centrally, Zonal Railways may hold selections etc. to effect promotion of staff on deemed deputation to IRCTC., 565465=RBE No.123/2005, 336699=Board’s letter No. E(W)2003 PS 5-1/20 dated 12.4.05 (RBE No.63/05), 236999=  Board’s letter No. .F(X)I-2002/11/1  Dated 9.3.05., 290129=2.       Certain railway servants were promoted to Group B posts such as Stenographer, Asstt. Physiotherapy officer, Asstt. Health Officer, Asstt. Health Education Officer,  Asstt. Pharmaceutical Officer, Asst. Dietetics Officer and  Asstt. Nursing Officer in scale Rs.7500-12000 and  8000-13500 after adopting the same procedure/eligibility conditions as proposed to be prescribed in the recruitment rules i.e. selection through written examination, viva-voce and assessment of record of service.  Their promotions were, however, made on ‘adhoc’ basis till finalisation of recruitment rules.  Some of such railway servants have retired from railway service before completion of 3 years continuous service on ‘adhoc’ basis and as such they have been denied the benefit of Post Retirement Complimentary Passes corresponding to the higher posts held by them., 115909=2.2             However, since the pay scale of Rs.6500-10500 has also been introduced w.e.f. 8.1.2004, Board has decided that for selections to the Group ‘B’ post of Assistant Dietetics Officer (Rs.7500-12000) to be held upto 7.1.2007, Senior, 284327=Board’s letter No. PC-V/97/1/7/14 dt.8.4.05 (RBE No.61/2005, PC-V/452), 556188=Enclosure to Ministry of Railway’s letter No.E(NG)-II/96/RR-1/62 dated 18.07.2005., 420096=6.10.1973, 503526=Sub: Ad-hoc promotion of Private Secretaries in scale Rs.7500-12000, 217265=RBE No.41/2005, 179622=Board’s letter No. E(MPP)98/9/1/Pt  Dated 15.2.05 (RBE No.27/2005), 93975=Accordingly, the Ministry of Railways have decided to modify the “Manual on Management of Training “ (Edition 1998) as per the Correction Slip No.1/2005 and the revised list of training centers (Appendix-I) is enclosed with the correction slip.  This supersedes all other lists issued earlier., 810670=Board’s letter No. E(Sports)2004/Policy/2 dated 20.10.05 (RBE No.176/05), 210446=RBE No.35/2005, 1068630=2.         The issue whether an employee who has passed the selection test for financial upgradation under the ACPS should continue to appear in the selection at the time of normal promotion has been considered by Railway Board in consultation with the Department of Personnel & Training. Now, in supersession of the clarification contained in this Ministry’s letter of even number dated 22.2.2005, it has been decided as follows:, 501356=Pursuant to issue of instructions vide Board’s letter of even number dated 24.3.2005 on retention of Railway accommodation on transfer/posting to new zones, queries have been received from various Railway Units as to whether in the light of the fact that letter No.E(G)97 QR1-28 dated 2.9.2002 has been withdrawn, a Certificate of non-availability of accommodation at the new place of posting  would still be required for permitting retention of Railway quarter upto 31.3.2006 (permitted vide instructions dated 24.3.2005).  In this regard it is clarified that the instructions contained in Board’s letter dated 2.9.2002 although stand withdrawn vide letter dated 24.3.2005, the special dispensation for retention of quarter continues to be effective till 31.3.2006.  As such, so long as the special dispensation remains effective (i.e. 31.3.2006), the conditions attached to the grant of such dispensation will also remain valid.  In the circumstances, for the purpose of grant of permission for retention of Railway accommodation at the previous place of posting on posting to new Zones/Divisions in relaxation of the normal rules, the Certificate required to be given by the SDGM of the new zone (as provided in the instructions dated 2.9.2002), stating non-availability of Railway accommodation at the new place of posting will be necessary.  It is further clarified that the ground for grant of continued retention at the previous place of posting is non-availability of Railway accommodation at the new Zones/Divisions.  Therefore in the event, allotment is offered to a Railway officer/staff at the new place and he/she refuses to accept such allotment of accommodation, such refusal would make the employee ineligible for retention of Railway accommodation at the old place of posting., 678543=The procedure that should be followed in the conduct of disciplinary proceedings has been elaborately laid down in the Railways servants  (Discipline land Appeal) Rules, 1968 and the instructions issued thereunder.  Failure to follow the procedure not only causes avoidable hardship to the innocent officials but it also but it also affords an opportunity to the unscrupulous and dishonest officials to escape penal action on the plea of denial of a reasonable opportunity  of  defense.  It is, therefore, necessary that these rules and instructions are followed scrupulously in all  disciplinary cases as these are quasi-judicial proceedings.  In this connection, attention is also invited to Board’s letter No. E(D&A)94/RG6-87 dated 23.1.1995 wherein it has inter-alia been laid down that an officer discharging judicial or quasi-judicial duties is amenable to departmental inquiry into his conduct in discharge of his duties., 798875=Board’s letter No. E[NG]I-2005/TR/22 dated 06-10-05  (RBE No.170 /05), 307458=3.            In this regard, it is pointed out that, in terms of condition number 4 of the Annexure-1 to the letter dated 1.10.99, the first financial upgradation shall be allowed after 12 years of  regular service and the second financial upgradation after 12 years of regular service from the date of the first financial upgradation, subject to fulfillment of the prescribed conditions. Condition number 5.1. of the Annexure-I to the letter dated 1.10.99 further provides that two financial upgradations under the ACP Scheme shall be available only if no regular promotions during the prescribed periods ( 12 and 24 years) have been availed by an employee.  If an employee has already received one regular promotion, he shall qualify for the second financial upgradation only on completion of 24 years of regular  service under the Scheme.  Condition number 15 of the annexure-I to the letter dated 1.10.99 provides that, subject to condition number 4, where the employees have already completed 24 years of regular service, with or without a promotion, the second financial upgradation under the Scheme shall be granted directly., 410596=Reference is invited to Board’s letter of even number dated 9.12.2004 on the above mentioned subject, whereby the income ceiling for dependency was revised w.e.f. 01.07.2004 as Rs.2565/- p.m. i.e.Rs.1500/- (pension/family pension) plus + Rs.750 (DP) + 14% of Rs.2250/- (1500+750) or 15% of the pay of Railway servant, whichever is more., 217310=Board’s letter No. F(E)III/2003/PN1/1 Dated 10.3.05(RBE No.41/05), 559735=2.       In this connection, attention is invited to instructions contained in Board’s letter No.E(D&A)60/RG 6-30 dated 28.7.1962 read with their letters No.E(D&A)65/RG 6-6 dated 1.3.1967 and No.E(D&A)72/RG 6-13 dated 16.10.1973 wherein it had, inter-alia, been laid down that it would be procedurally wrong for an authority to initiate and finalise the disciplinary proceedings against an employee who is not under its administrative control.  These instructions also deal with the situations where a Railway servant commits an offence while working in one Railway administration but the same comes to light only after his transfer to another Railway administration or another division and it comes necessary to take disciplinary action against him for the offence.  Disciplinary action in such cases should be taken by the Railway/Division on which the person concerned might be working at the time of taking disciplinary action in consultation with the Railway/Division where the offence was committed.  The consultation with the parent Railway however, would be limited to obtaining the relevant information/documents which may be required for processing the disciplinary  action.  In a rare case where it is considered necessary that action should be taken by the Railway/ Division where the offence was committed, the Railway servant concerned should be transferred to that Railway/Division which should thereafter only initiate and finalize the disciplinary action.  In other words, disciplinary action by an authority in the parent Railway should be taken only after the Railway servant concerned has been brought under the administrative control of the authority proposing to take action., 514334=Reference South Central Railway’s letter No.P(R )535/V dt.30.6.2005 on the above subject., 1053511=A copy of Ministry of Finance, Department of Economic Affair’s OM F.No.5(2)-PD/2005 dated 7th October, 2005 regarding rate of interest to be charged on advances sanctioned during the year 2005-2006,  for purchase of conveyances is enclosed., 402741=Sub: Re-classification of  cities/ towns on the basis of 2001, 505641=ii)                   Record of service/ACR dossier may be the basic input and last 5 ACRs may be taken into account.  In case 5 ACRs in the feeder grade of Rs.7500-12000 are not available, ACRs in the next lower grade may be considered., 981446=Ref: Railway Board’s letter No. . F[E]II/2005/DE 1/1 dated  05-12-1994., 173164=1.1.01          31.12.01                11%            30% from 1.1.88 and onwards, 215421=The persons as mentioned at S.No.(i) to (iii) above fall within the purview of ‘Workman” as per Schedule II of Workmen’s Compensation Act. A ”workman” means any person who is a Railway Servant as defined in {Clause 34 of Section II of Railway Act,1989} not permanently employed in any administrative, district or Sub-Divisional office of a railway and is not employed in any such capacity as is specified in Schedule II of the Workmen’s Compensation Act,1923.., 130885=RBE No. 25/2005, 254595=Pursuant to merger of 50% of Dearness Allowance with Basic Pay, a reference has been made by AIRF for revision of pay range slabs for determining the eligibility limit for grant of Special Compensatory Remote Locality Allowance.  The matter has been considered in consultation with the Ministry of Finance and it has been decided to revise the existing pay range for determining the eligibility for special compensatory (remote Locality) Allowance w.e.f. 1.4.04 as follows., 272861=[ii]         Staff working on ex-cadre basis in computer centres at Divisions, Workshops and Stores Depots will be considered for deployment in the equivalent grade on their request in the new set up subject to the condition that they are holding the grade on regular basis after due selection, and are working for atleast 10 years in the Computer Centre either on continuous basis or in broken spells.  On absorption in the new set up they will be assigned seniority in the absorbing grade with reference to non-fortuitous length of service in the grade held by them on regular basis in their parent cadre as on 1.4.05.  Others will be repatriated to their cadre in due course.  Caderisation will start only from the entry grade and will cover the higher grades in the hierarchy in due course as and when the existing incumbents holding the posts on ex-cadre basis vacate the same and staff inducted in the new set up in terms of revised procedure as outlined in para 5 above become eligible for promotion., 849196=Rates of Night Duty Allowance with effect from 1.7.2005 for ‘Intensive’, ‘Continuous’ and ‘Excluded’ categories and Workshop staff at the various places classified as ‘A-1’, ‘A’, B-1, B-2, and Ordinary localities including ‘C’ Class Cities., 192896=As the Railway administration are aware, in terms of paragraph 1004 of IREM Vol.I (1989 Edition) read with instructions contained in Board’s letter dated 7.4.2000, General Managers are authorised to sanction an investigation of arrears claims when the claim is not over three years old (irrespective of the amount involved) and when the claim is over three  years old, but the amount of the claim pertaining to the period beyond three years does not exceed Rs.5000/-.  In terms of para 1005 ibid, in cases, where the amount of the claim for the period beyond three years exceeds Rs.5000/-, investigation of the portion within the three years limit is sanctioned by the General  Manager and, the balance (i.e. portion beyond three years) is referred to Railway Board for orders., 422101=17.11.1979, 646573=Accordingly, para 171(6) of IREM, Vol.I,1989 Edition is amended as per ACS No.175 enclosed., 340552=[Authority:  Board’s letter No. E(W)2003 PS 5-1/20 dated 12.4.05], 847024=10.        The offices of Accountant General and Authorised Public Sector Banks are requested to arrange payment of relief to pensioner etc. on the basis of above instructions without waiting for any further instructions from the Comptroller and Auditor General of India and the Reserve Bank of India in view of letter No.528-TA,II/84-80 II dated 23.04.1981 of the Comptroller and Auditor General of India addressed to all Accountants Generals and Reserve Bank of India Circular No.GANB No.2958/GA-64 (ii)(CGL)/81 dated the 21st May, 1981 addressed to State Bank of India and its subsidiaries and all Nationalised Banks., 203936=A copy of Office Memorandum No.45/1/2004-P&PW(G) dated 27.01.2005 of Ministry of Personnel, Public Grievances and Pensions  (Department of Pension & Pensioners’ Welfare) on the above subject is sent herewith for your information and necessary action., 609726=(File No.E(LL)2001/HER, 1105443=The following Act of Parliament received the assent of the President on 5th September, 2005 and is hereby published for general information:–, 351304=(This disposes RDSO’s letter No.WS/School Uniform dated 21.12.04.)., 130931=Board’s letter No E(NG)-II/2004/RR-1/48.   dated  9.2 .2005   (RBE No. 25/05), 326919=dated 24.9.2004., 360495=Rate of Night Duty Allowance with effect from 1.1.2005 for Essentially Intermittent categories  at the various places classified as ‘A-1’, ‘A’, B-1, B-2, and Ordinary localities including ‘C’ Class Cities., 282459=RBENo.46/2005, 210508=Board’s letter No. .F(E)III/2005/LE-1/1 Dated 23.2.05(RBE No.35/05), 988386=  Board’s letter No. E(RRB)2003/25/7 dated 21.3.2005 (RBE No.48/05), 1124993=Board’s letter No. E(W)95 UN1-19 dated 27.12.2005 (RBE No.219/05), 819860=(i)                  General Managers, Additional General Managers, Principal Heads of Departments/Co-ordinating Heads of Departments and Divisional Railway Managers be entitled for replacement of staff cars.  The staff cars used by these officers, if originally procured under revenue, may be replaced by a new staff car on the basis of 1:1 against condemnation of the old vehicle.  Wherever a vehicle was procured under Construction estimates, it may be replaced on the basis of 1:2 by condemnation of the vehicle being replaced and one more vehicle within the department., 68065=NOTE: The Railway Services [Pension] Rules, 1993 were published in the Gazette of India, Extraordinary vide No. S.O. 930 [E] the 3rd December, 1993 and subsequently amended by –, 126552=RBE No.28/2005, 408744=2.       The scheme so revised is being implemented in the Railways from the date of issue of the relevant instructions viz 29.4.99. Representations have been received to the effect that since the Act came into force with effect from the date on which it was notified in the Govt. of India Gazette viz 7.2.96, the benefit of revised scheme should be made available from 7-2-96. The matter has been considered carefully by this Ministry.  It has now been decided that the scheme contained in this Ministry’s letter of 29-4-99 as modified may be made effective from 7-2-96.  Accordingly in respect of   cases   in   which   the   disabled  /  medically   de – categorised, 993093=Sub: Cost of training for apprentices engaged under Apprentices Act,.1961, 492729=Board’s letter No. PC-III/2005/CRC/17 dated 28.6.05  ( RBE No.109/05), 728266=Board’s letter No. E(D&A)2005/RG 6-5 dt.26.05.05  (RBE No.89/05), 717276=A copy each of Office Memorandum No. 42/2/2004-P&PW (G) dated 21.06.2004 Corrigendum No.42/2/2004-P&PW(G) dated 4.11.2004 of Ministry of Personnel, Public Grievances & Pensions (Department of Pension and Pensioners’ Welfare) on the above subject are  sent herewith for your information and necessary action., 282531=  Board’s letter No. .E(MPP)2002/3/31 Dated 17.3.05 (RBENo.46/05), 575211=(a)        pay as defined in rule 1303 (F.R.9) of the Indian Railway Establishment Code volume-II (1990 Edition) and includes element of running allowance to the extent of 30 per cent of basic pay in the case of running staff as defined in Rule 1507 of the aforesaid Code;, 503371=RBE No.107/2005, 354170=Rates of Night Duty Allowance with effect from 1.1.2005 for ‘Intensive’, ‘Continuous’ and ‘Excluded’ categories and Workshop staff at the various places classified as ‘A-1’, ‘A’, B-1, B-2, and Ordinary localities including ‘C’ Class Cities., 703891=[Authority: Board’s letter No. E(P&A)II/2005/RS/11 dated 20.6.05   ], 315053=(ii) The extracts of OM reproduced by them purported to have been issued on 4.12.2004 is in fact a portion of this Department’s OM dated 4.12.2001 bringing out certain modifications to OM dated 27.10.1997. In that OM, the Government consequent upon acceptance of the 5th Pay Commission recommendations, inter-alia, prescribed that 100% of DA be added to the pay and on this the retirement/death gratuity be calculated. This was made effective from 1.1.196. It did not change any provisions regarding percentage on DA for those who retired before 1.1.1996. Vide OM dated 4.12.2001 the Government clarified that the addition to DA for calculation of gratuity would be applicable for calculation of all types of gratuities like death/retirement/service gratuity.  In this OM also there is no change in other provisions of OM dated 27.10.1997 including the cut off date of 1.1.1996. This was further clarified vide para (ii) of OM dated 18.2.2003. Hence, prior to 1.1.1996, only basic pay was reckoned as emoluments for computation of gratuity. It has not been agreed to extend the benefits to retirees prior to 1.1.1996 as for grant of any benefit, prescription of a cut off date is essential keeping in view various constraints including financial constraints., 1105629=THE PAYMENT OF WAGES (AMENDMENT) ACT, 2005, 682364=Attention is invited to the instructions contained in Railway Board’s letter No.E(G)2000 QR1-23 dated 1.6.2001 and 14.2.2002 and No.E(G)2003 QR1-19 dated 19.4.2004 providing for retention of Railway accommodation in the event of deputation of Railway officers under Central Staffing Scheme to Central Ministries, Govt. Bodies like UPSC, CVC, etc. Central Govt. Statutory/Autonomous/other bodies not covered under Central Staffing Scheme but are eligible offices for allotment of accommodation from General Pool and Group ‘A’& ‘B’ officers on deputation with Ministers/VVIPs in Central Govt. on co-terminus basis.  These instructions have been reviewed by Board in its meeting held on 29.7.2005 and it has been decided that Group A and B Railway officers appointed in the personal staff of President, Prime Minister and Ministers in Central Govt. may be separated from the above group of officers on deputation to Central Govt. Ministries/Department and be permitted to retain Railway quarter for the entire tenure of the posting with President, Prime Minister and Ministers in Central Govt. without the requirement of registering for allotment of General Pool accommodation for which they are otherwise eligible., 328158=(ii)                F(E)III/97/PNI/Ex-gratia/5 dt. 27.1.98 (RBE No. 19/98, S.No.PC-V./38) (SCNo. 44/98), 247986=Board’s letter No. PC-V/2003/1/11/2 dated 11.3.205 (PC-V/448, RBE No.42/05), 14434=Sub: Re-classification of cities/towns on the basis of 2001 Census- grant of House, 198143=(ii)              Where none of the three circumstances mentioned in Para 2 of Board’s letters of 21.1.1993 referred to above has arisen, a simple vigilance clearance would need to be furnished.  There is also  no need of furnishing a separate integrity certificate to the DPC., 397072=RBE No 78/2005, 418095=6.11.1971, 247941=RBE No.42/2005, 1003761=Board’s letter No. E(NG)I-90/PM7/34/Vol.III dated 2.12.2005 (RBE No.209/05), 1045382=   Board’s letter No. . E(MPP)98/3/8 dated 5.12.05 (RBE No.207/05), 851269=2606-2790, 312845=Sub: Payment of difference of gratuity to pre 1996 Central Government Pensions – clarification regarding., 986514=Reference is invited to Board’s letter of even number dated 20-05-2005 on the above mentioned subject, whereby the income ceiling for dependency was revised w.e.f. 01.01.2005 as Rs.2633/- p.m. i.e. Rs.1500/- (pension/family pension) plus Rs.750/- [DP] + 17% of Rs.2250 [1500+750]  or 15% of the pay of Railway servant, whichever is more., 250145=2.       Accordingly, in partial modification of all orders/guidelines issued on the subject matter in the past, it has now been decided to revise the rates of damages for unauthorized occupation of railway accommodation with effect from 01.12.2004 as under:, 126597=Board’s letter No. E(MPP)2001/12/10 Dated 18.2.05(RBE No.28/05), 707104=Since the retention of quarter at the previous place of posting in favour of the officers who have been transferred and posted to N.F.Railway is allowed for bonafide use of the dependent family of transferred Railway officer, he/she will furnish certificate on 1st July and 1st January of every year, stating that his/her dependent family members are actually residing in the Railway quarter at the last station of his/her posting.  Such a certificate will also have to be furnished at the time of seeking retention., 135033=Sub: Central  Government Employees Group Insurance Scheme-1980 –, 724424=  SERIAL CIRCULAR  NO. 164 /2005, 492683=RBE No.109/2005, 1008562=Board’s letter No. E(MPP)2005/3/18 dated 23.11.05 (RBE No.203/05), 397117=Board’s letter No.  PC-V/2004/ACP/1 dated 9.5.2005 PC-V/455 RBE No 78/2005., 837277=(c) Post Retirement Complimentary Passes shall not be issued to those retired railway servants on whom the penalty of cent percent cut in pension and gratuity has been imposed on or after 20.01.05., 424103=23.6.1984, 826354=The Ministry of Railways have decided that the Manual on Management of Training 1998 may be amended as per the attached Advance Correction Slip No.5/2005., 503417=Board’s letter No. E(GP)2000/2/84 dated 24.6.05   (RBE No.107/05), 65000=“(iv) Post Retirement Complimentary Passes shall not be issued to those Railway servants who are dismissed from service, and to those retired railway servants whose whole of gratuity and pension has been withheld permanently as a result of D&A proceedings”. [Authority: Board’s letter No. E(W)2002/PS 5-8/5  Dated 20.1.05], 797124=The provisions contained in Paras 3 and 4 of this Ministry’s letter No.PC-V/07/I/7/14 dated 16.10.1997 (S.No.PC-V/3, RBE No.139/97) shall continue to be applicable while regulating Dearness Allowance under these orders., 65992=(2) They shall be deemed to have come into force from the 19th day of July, 1997., 514457=2.       Instructions providing for taking into account the vacancies anticipated to occur during the next one year instead of six months in respect of Non-selection posts, promotion to which is based on scrutiny of Record of Service/Confidential Reports were valid upto 30.6.2004.  Since the instructions have not been extended further, the same have automatically lapsed w.e.f. 1.7.2004., 717204=revised Rates effective from 01.01.l2004., 644523=In terms of para 171(6) of IREM Vol.I, 1989 as modified vide ACS No.17 issued under this Ministry’s letter No.E(NG)I-91/PM9/13 dated 30.12.1994, the posts in the category of SO(A/Cs)ISA/TIA in grade Rs.6500-10500 are required to be filled by promotion of App.III qualified Accounts Assistants in the pay scale of Rs.1400-2600/Rs.5500-9000 after they have put in a minimum of two years service in the grade (according to the group for which they opt).  Whenever such App.III qualified Accounts Assistant become due for promotion, persons who might have passed in earlier examinations but who did not satisfy the condition of the minimum two years service in the immediate lower grade are also considered eligible for promotion direct from the grade in which they are working.  However, if no junior is eligible for promotion because of non-fulfillment of condition of two years in the immediate lower grade, the seniors have to wait for completion of requisite service., 523263=3.       This scheme is being launched on an experimental basis and will be valid till 31.7.2006., 338789=2.       In view of above decision, Railway Servants (Pass) Rules 1986 (Second Edition,1993) may be amended as per Advance Correction Slip no.48 (copy enclosed)., 377921=RBE No. 67/2005, 1113330=9 of 1890., 754722=Board’s letter No. PC-III/2005/CRC/II dated 14.09.2005   ( RBE No 156/05.), 410376=Board’s letter No. E(W)97 PS 5-1/71 dated 20.5.05 (RBE No.85/05), 999094=(These percentages are w.r.t. the revised Jr. Scale (Group ‘A’) Cadre strength as on 01.04.2005 for the respective departments)., 435376=Instructions were issue vide Board’s letter of even number dated 31.1.2003 delegating powers to Sr. Subordinates in grade Rs. 5000-8000 and above and who are also in direct and independent charge of the establishment to issue/sign First Class Post Retirement Complimentary passes to retired Railway Officers instead of First ‘A’ passes, if the retired officers opt for the same in writing.  The scheme introduced purely on an experimental basis was subsequently made on a permanent basis beyond 30.9.2004 vide Board’s letter of even number dated 9.12.2004., 497111=Services (Pension) Rules,1993., 336880=In terms of item (2) under Column 2 below Schedule VII (Special Passes) of Railway Servants (Pass) Rules,1986 (Second Edition,1993), whereas special passes on privilege account are to be issued to the employees or his family members or dependents who are participating in the sports events, the class of pass to be issued to railway servants traveling alone or with a team as an official or a coach has not been specified.  It has also been noticed that no provision exists to grant pass, higher than first class, to those Railway servants who are entitled for the same when participating in sports events.  Board has, therefore, decided that item (i) and (ii) under column 3 below Schedule VII (Special Passes) of Railway Servants (Pass) Rules,1986 (Second Edition,1993) may be replaced as under:-, 414214=GSR – In exercise of the powers conferred by the proviso to article 309 of the Constitution, the President hereby makes the following rules further to amend the Railway Servants (Discipline and Appeal) Rules,1968, namely:-, 1025592=Instances have been brought to the notice of this Department where the officer who is outside his cadre and has been given proforma promotion under NBR in his parent cadre is not allowed to draw pay in the higher pay scale of the post to which he has been promoted proforma, because his senior or junior has not joined the post and has not started drawing pay in the higher pay scale.  In order that the officer who has been granted proforma promotion does not suffer on this account, it has been decided to substitute the conditions (ii) and (iii) contained in O.M.No.2/13/93-Estt.(Pay-II) dated 26.10.93 as under:, 124501=[ Authority: Board’s letter No. E(MPP)2003/3/35  dated 31.1.05], 241255=1025, 518887=RBE No.119/2005, 155934=Contribution @ Rs.10/- p.m. 31.2.89 and Rs.15 throughout after 1.1.90, 340725=  Board’s letter No. E(NG)I-2005/PM1/16 dated 20.4.05  ., 674661=7.       It is  clarified that until such time the screening is done and the Faculty Members not found fit are repatriated to their respective parent cadres, such persons who have worked as Faculty Members may be allowed Training Allowance from the date of joining or 1.4.2005 whichever is later, till the date of reversion., 844970=5.         The following categories of CPF beneficiaries who are in receipt of Ex-gratia payment in terms of this department’s OM No.45/52/97-P&PW(E) dated 16.12.1997 will be paid DR @ 13% w.e.f. 01.07.2005., 254512=Ref: Board’s letter No.F(E)I/98/AL-4/6 dt.2.9.98., 841723=dated  2.7.99, 404767=Advance Correction Slip No.3/2005., 284282=RBE No.61/2005, 384460=4        The   Indian   Railway   Establishment  Manual Vol.I 1989 Edition is accordingly amended as in the ACS  Nos.172 enclosed., 309595=5.       In fact, this condition has been further relaxed in respect of cases where an employee has moved from one post to another post  on direct recruitment/absorption basis or on deputation basis, followed by absorption.  In such cases, as clarified in reply to point of doubt number 4-6 of Annexure to Board’s letter No.PC-V/99/I/1/1 dated 11.5.2000, past service in the same grade can also be counted towards the regular service., 711505=Provided that whenever the emoluments calculated as at (i) to (iv) above exceed the maximum of the revised scale of pay introduced w.e.f. 01.01.1996, the same should be restricted to the maximum of the said revised scale of pay., 525133=2.       Consequent upon the upgradation of the posts of Supervisors (Works) which earlier used to be filled up by promotion by seniority cum-suitability from amongst the Skilled Artisans Grade-I (re-designated  as Technicians(Trade) Grade-I), as  Junior Engineer (Works) II in terms of this Ministry’s letter No.PC-III/2003/CRC/6 dated 9.10.2003 instructions for filling up of 25% promotion quota posts of JE-II in all Departments  including JE(Works)II as referred to in para 1(iii) above were issued vide this Ministry’s letter No.E(NG)I-99/PM7/3 dated 22.2.2005 stipulating  inter-alia that the posts of JE-II earmarked for promotion by selection (hitherto from amongst Mistries) will be filled from amongst Sr. Technicians in the pay scale of  Rs. 5000-8000 subject to the condition that the existing Technicians Gr.I as may be senior to those fitted as Sr. Technicians as per procedure in force till 22.2.2005 will also be considered for selection for promotion as JE-II., 377967=Board’s letter No. E(NG)II/2005/RR-1/6 dated 26.4.2005 (RBE No. 67/05), 212563=3.       This also disposes of South Western Railway’s letter No.SWR/HQ/P.508 /Medical/Dr.MBR dated 29.12.2004., 179577=RBE No.27/2005, 648905=Kindly refer to this Ministry’s letter No. E(MPP)2002/13/3 dated 24.1.2003 (RBE No. 21/2003) wherein sanction of the Ministry of Railways was communicated for grant of training allowance to the various training centres., 1008756=In terms of para 2(1) and 2(v) of Board’s letter No.E(MPP)98/9/1/Pt dated 15.2.05 the Centralized Training Institutes were requested to carry out:-, 201509=3.       It is also clarified that there is no requirement of furnishing a separate integrity certificate to the DPC.  In terms of the judgment of the Hon’ble Supreme Court in the case of Union of India vs. K.V.Janakiraman etc. (AIR 1991 SC 2010), no promotion can be withheld merely on the basis of suspicion or doubt or where the matter is under preliminary investigation and has not reached the stage of issue of charge sheet etc.   If in the matter of corruption/dereliction of duty etc., there is a serious complaint and the matter is still under investigation of CBI or otherwise,  the Government is within its right to suspend the official.  In that case, the officer’s case for promotion would automatically be required to be placed in the sealed cover., 725922=The accumulations at the credit of the subscribers to New Pension System for the period from 1st January,2004 to 31st March,2004 and for the financial year 2004-2005 shall carry interest at the rate of 8% (Eight percent) per annum., 1040032=Board’s letter No. PC-V/97/1/9/6 DATED 5.12.2005 ( RBE No.208/05), 567218=2.1     Similar provisions also  exist in respect  of gazetted Railway servant in para 3 of Board’s letter No. E[D&A]92/RG6-149 [B] dated 21-01-93., 1000989=Kindly refer Board’s letter dated 27.8.04 (RBE No.191/2004) advising therein the procedure for filling up and observance of tenure of ex-cadre posts in Group ‘C’ & ‘D’ staff.  The matter has been considered and it has been decided that the tenure of the faculty members shall not exceed 8 years as stipulated in Board’s letter No.E(MPP)93/12/13 dated 28.7.97 and E(MPP)2001/19/3-Recom.37 dated 29.6.01 (RBE No.127/2001)., 844600=4.         The surviving CPF beneficiaries who had retired from service between the period 18.11.1960 to 31.12.1985 and are in receipt of Ex-gratia @ Rs.600/- p.m. with effect from 01.11.1997 under this Department’s O.M.No.45/52/97-P&PW(E) dated 16.12.1997 are entitled to Dearness Relief @ 21% w.e.f.01.07.2005., 888631=        basic pay w.e.f. 1.4.2004 – PNM/NFIR agenda item No.57/2005., 815884=In para No.1312 and 1313 of the Vigilance Manual, the procedure for administrative actions has been explained. It may be seen that in case of recorded warning, a show cause notice has to be served on the person and his representation has to be properly considered by the competent authority.  The person also has a right to appeal against an order of recorded warning., 571031=In terms of Explanation [2] below Rule 75[6] of Railway Services [Pension] Rules, 1993 read with para 7.2 [b] of Board’s letter No. F[E]III/97/PN1/22  dated 05-11-1997 dependent sons and daughters of deceased Railway  servants shall be eligible for family pension in their turn till they attain the age of 25 years or upto the date of their marriage / remarriage, whichever is earlier.  However, as per the proviso to the said rule, such of the sons or daughters as are suffering from any disorder or disability of mind including mentally retarded or are physically crippled or disabled so as to render them unable to earn a living even after attaining the age of 25 years, family pension shall be payable to them for life subject to fulfilment of certain conditions stipulated thereunder.  In this context, a query has been raised by one of the Railways about admissibility of family pension to a mentally retarded MARRIED son.  The matter has been examined in consultation with the Department of Pension & Pensioners’ Welfare and it is clarified that the MARRIED sons and daughters, who are suffering from any disorder or disability of mind, including mentally retarded or are physically crippled or disabled shall NOT be eligible for family pension., 79162=Board’s letter No. E(D&A)2003 GS 1-5  Dated  28.1.05 (RBE No.19/05), 236221=ii)                 A widowed/divorced daughter, who has been sanctioned family pension before attaining the age of 25 years and has been in receipt of the same as on 25.8.2004 shall continue to be paid family pension even after attaining the age of 25 years., 339167=Advance Correction Slip No.48   to Railway Servants (Pass) Rules 1986 (Second Edition,1993), 727840=For the financial year 2004-2005, accumulations at the credit of subscribers to the said subscribers shall carry interest at the rate of 8% (eight percent) per annum as announced vide Resolution of even number dated July, 22,2004., 370022=  Board’s letter No. E(MPP)2002/3/31  dated 06-05-05 (RBE No.74/05), 79117=RBE No.19/2005, 293665=ii)                   Officers/Staff posted to New Zones/Divisions and retaining Railway accommodation at their previous place of posting in terms of Railway Board’s instructions dated 2.9.20202 and 25.9.2003 may be permitted retention thereof upto 31.3.2006. Officers/staff who are relieved on posting to New Zones/Divisions after the issue of these instructions shall be allowed retention in terms of the instructions/rule governing retention of railway accommodation in the case of permanent transfer or upto 31.3.2006, whichever is later., 848431=Consequent to sanction of an additional instalment of Dearness Allowance vide this Ministry’s letter No.PC-V/97/I/7/14, dated 13.10.2005, the President is pleased to decide that the rates of Night Duty Allowance, as notified vide Annexures ‘A’ and ‘B’ of Board’s letter of even number dated 4.5.2005 stand revised with effect from 1.7.2005 as indicated at Annexure ‘A’ in respect of “Continuous’, ‘Intensive’, ‘Excluded’ categories and workshop employees, and as indicated at Annexure ‘B’ in respect of ‘Essentially Intermittent’ categories respectively., 892454=INDIAN RAILWAY ESTABLISHMENT MANUAL VOLUME-I (1989 EDITION), 298400=As the Railways are aware in terms of instructions contained in this Ministry’s letter of even number dt.22.8.2003, Psychological Test renamed as Aptitude Test has been given a weightage of 20% in the departmental selections for promotion as ASM, Dsl/ Elec.Asstts. and Motorman and has been integrated in the selection proceedings with the stipulation that the Aptitude Test is not of qualifying nature., 430183=30.1.1993, 634154=Board’s letter No. E[W]2003/PS5-8/1 dated 12-08-05  ., 404139=RBE No. 83/2005  , 1064629=Ref: Railway Board’s letter No.E(G)2004 FE1-5 dated 16.9.2004., 807238=4.         The Ministry of Railways have also decided that in relaxation of the provisions in Rule 905(2), 908 and 909 of State Railway Provident Fund Rules, as contained  in Chapter 9 of R.I/1985 edition, such of the subscribers to the SRPF as are entitled to Productivity Linked Bonus may, if they so desire, deposit the whole or part of the amount admissible under the Scheme in their respective State Railway Provident Fund  Accounts., 822582=All other terms and conditions contained in Board’s letter No.97/H/28/1 dated 23.10.97 and subsequent orders  No.97/H/28/1 dated 17.5.99 and 27.12.99 and also in the letter under reference will remain unchanged., 503845=“The posts in grade Rs.8000-13500 may be filled from amongst the Stenographers who are in grade Rs.7500-12000 with minimum one year of non-fortuitous service in the grade and volunteer for the post.  Suitability for the post shall be assessed through personal interview and assessment of record of service only, by the Additional General Manager.  Those found suitable will be appointed to the grade with the approval of General Manager.   The selection for this post will be processed by the Personnel Branch.  Till such time candidates with minimum one year’s non-fortuitous service in grade Rs.7500-12000 are available, the posts in grade Rs.8000-13500 may be operated in the lower grade of Rs.7500-12000”., 703054=In exercise of the powers conferred by the proviso to Article 309 of the Constitution, the President is pleased to direct that Rule 1510 of the Indian Railway Establishment Code, Volume II,1987 edition may be amended as in the Advance Correction Slip No.55 enclosed., 690462=RBE No.150/2005, 249616=In terms of this Ministry’s letter No.F(X)I-86/11/9 dated 1.4.1989, it was decided that the rates of damages fixed for unauthorized occupation of Railway accommodation would remain in force for a period of two years or till further orders, from the date of effect of orders issued on the subject matter.  As a result, the rates of damages for unauthorized occupation of Railway accommodation last fixed vide this Ministry’s letter of even number dated 24.7.2002 have now undergone revision., 1030211=(F(E)Spl.2004/ADV 3/10 dated 28.10.2004), 558480=Board’s letter No. E(D&A)2005/RG 6-23 dated 18.7.05   (RBE No.120/05), 296283=Board’s letter No. E(W)2005 PS5-6/32  Dated 24.3.05(RBE No.56/05), 490775=Board’s letter No. PC-V/97/I/7/14 dated 18.6.05 (PC-V/457,RBE No.103/05), 733583=Board’s letter No. E(GP)2005/2/42 dt.21.9.05 (RBE No.161/05), 389370=Board’s letter No.  F(E)III/2003/PN1/5 dated 9.5.2005(RBE No. 79/2005)., 417090=24.6.1969, 513768=PNM/NFIR Item No.46/2004., 425790=19.9.1987, 1060834=“1305 Absorption in  posts identified for employment of physically handicapped persons/creation of supernumerary posts.  The Railway servants falling in group (i) mentioned in Para 1302 i.e. those who are declared unfit even  for the lowest medical category, may be absorbed in a post/category identified as suitable for employment  of physically handicapped persons and fresh recruitment to that post/category from open market from amongst physically handicapped withheld.  In case the alternative post  is  not carrying the requisite pay scale, a supernumerary post may be created in appropriate scale of pay and the employee adjusted against the same keeping the lower grade post vacant by withholding fresh recruitment thereto.  The supernumerary post so created  to accommodate a disabled /medically incapacitated employee shall stand abolished as soon as a suitable post in the appropriate scale is found for the Railway servant concerned or the post is vacated by him for other reasons, whichever is earlier.”, 1104233=New Delhi, the 8th November, 2005, 647446=RBE No.140/2005, 445809=In view of the clarification sought by Zonal Railways regarding contribution for joining Retired Employees Liberalized Health Scheme [RELHS-97] for retired railway employees joining the scheme after 28-1-05, it has been decided by Board that the contribution shall be calculated as under:, 449651=Board’s letter No. E(NG)I-2005/PM1/20 dated 17.6.05 (RBE No.102/05), 690508=Board’s letter No. E[P&A]I-2004/HL-1 dated 13-09-05 (RBE No.150/05), 1024448=The undersigned is directed to refer to O.M.No.2/13/93-Estt.({Pay II) dated 26.10.93 on the above mentioned subject., 529803=(Authority: Railway Board’s letters No. E(NG)I/99/PM7/3 dt. L22.2.2005 & E(NG)I/2004/PM5/8 dated 14.7.2005)., 435052=RBE No. 96/2005, 614447=Training Manual Correction slip No.4/2005, 805025=Board’s letter No. E(P&A)II-2005/PLB/11 dt. 04.10.05. (RBE No.167/05), 385523=[b]    50%  by promotion from amongst existing Gr. ‘D’ staff in service as on 22-05-2002 not having the qualification of Class X Board Examination., 267599=The re-organisation will take effect from 01.04.05. These instructions will supercede all instructions issued earlier on Staffing Pattern for EDP Centres at Zonal Railway Headquarters and Pus and other computer centres at Divisions, Workshops and Stores Depots., 636110=RBE No.130/2005, 754675=RBE No 156/2005, 991435=2.         Board have decided that the sealed cover procedure as laid down in their letter No.E(D&A)92/RG 6-149(B) dated 21.1.1993 would be applicable also in respect of placement of Group B Officers in the higher scale of Rs.8000-13500/-.  Since the date of effect of placement in the higher scale is 1st January and 1st July every year, sealed cover procedure would apply only if the officer is under suspension or disciplinary/court proceedings are pending against him as on 1st Januar/1st July and not as on the date his case for placement in higher scale is actually considered by the Committee of HODs.  In case of initial placement in the year 2003, application of sealed cover procedure in a case would depend upon the position as on 25.4.2003 i.e. the date from which the placement in the higher pay scale was initially made effective ., 395397=Board’s letter No.  F(E)Spl.2005/ADV. 4/1 dated 11.5.2005(RBE No. 82/05.), 389324=RBE No. 79/2005, 247734=2.        All other conditions as laid down in the letter dated 16.11.2000 will continue to apply., 82626=Denotification of categories of employees in receipt of  employees in receipt of Risk Allowance was circulated vide Board’’ letter cited above.  In the forum of PNM and DC/JCM, staff side had requested for review of these categories.  The entire issue of identification of categories of employees as eligible for receipt of Risk Allowance was examined by the Board in line with the recommendations of the V CPC.  Accordingly in supersession of earlier instructions contained in Board’s letter No.E(P&A)I-97/SP-1/AD-1 dated 27.2.2004, the revised list of categories of employees in receipt of Risk Allowance to be denotified is enclosed as Annexure I., 7580=RBE No. 07/2005, 404192=Board’s letter No.  E(MPP)2003/3/35  dated 12.5.2005(RBE No. 83/05), 513589=Board’s letter No. E(P&A)II –2004/PLB-6 dated 12.7.05 (RBE No.115/05), 243789=2             It has now been decided that on electing to come over to revised scales under V CPC, the pay of the Nursidng staff who were enjoying the benefit of upto two advance increments in the IV CPC pay scale as on 01.01.1996 may be fixed in the revised pay scale with reference to the pay in the pre-revised scale excluding the quantum of two advance increments enjoyed by them.  After the pay is fixed in the revised scale (V CPC), two additional increments at the revised rate (non-absorbable) may be granted in the revised scale., 64221=2.    In view of the above decision, item (iv) under column 3 of Schedule IV (Post Retirement Complimentary Passes) of  Railway Servants (Pass) Rules, 1986 (Second Edition, 1993) may be amended as in the enclosed Advance Correction Slip No.47., 443711=          The Staff side in the cited Agenda Item have stated that on some of the Zonal Railways, the pay element for determining emoluments of Loco Inspectors for the purpose of computation of their pensionary benefits is not being allowed on Dearness Pay admissible in terms of Board’s letter No. PC-V/2004/A/DA/1 dated 11-03-2004., 79277=Sub: Rule 16(4)(i) of Railway Services (Conduct) Rules, 1966 –Clarification regarding borrowing of money from a relative or a personal friend and definition of the term ‘small amount’         given in the first proviso to rule 16(4)(i)., 569271=2.       Hon’ble Minister for Railways has stressed upon the need for personal attention to be paid by the General Managers for timely and expeditious disposal of such cases.  It has, therefore, been decided to launch a “Special Drive to clear the backlog CG Appointment Cases” so as to ensure that all such cases are finalized latest by 15th Sept. 2005.  The position of pending cases as on 01-08-2005 should be sent immediately to this office.  A progress report should be sent thereafter every fortnight., 432203=24.11.2001, 426471=21.5.1988, 564463=RBE No.126/2005, 826542=Manual on Management of Training(June 1998), 465749=As the Railways are aware instructions were issued vide this Ministry’s letter No.E(NG)I/93/SR6/9 dated 30.11.1994 as modified/clarified vide letter dated 7.8.95 that special supernumerary posts with matching surrender may be created for accommodating sportspersons who are promoted on out of turn basis or are recruited on sports grounds in Intermediate grades having no element of direct recruitment., 1062583=Pursuant to the Board’s letter No.PC-V/2004/A/DA/1 dated 11.3.2004, references have been received from railway units seeking clarification as to whether merger of 50% of Dearness allowance with the basic pay as Dearness pay (DP) should be taken into consideration for the calculation of Deputation (Duty) Allowance or not.  The matter has been examined in consultation with the Deptt. Of Personnel & Training. It is now clarified that DP may be taken into account for the purpose of calculating Deputation (Duty) Allowance w.e.f. 1.4.2004 subject to prescribed ceiling for payment of Deputation (Duty) Allowance., 199207=The undersigned is directed to refer to the Department of Personnel and Training office memorandum No. 22011/4/91-Estt.A dated 14th September, 1992 (Copy enclosed) which has been  issued pursuant to the judgment of the Hon’ble Supreme Court in the case of Union of India vs. K.V. Janakiraman etc (AIR 1991 SC 2010), and is in supersession of all previous instructions on the subject, and to say that para 2.1 of the said Office Memorandum provides that the DPC shall assess the suitability of the Government servants coming within the purview of the circumstances mentioned in para 2 of the Office Memorandum, along with other eligible candidates, without taking into consideration the disciplinary case/criminal prosecution pending.  Therefore,  it is made clear that only a bare statement that case of an employee in the zone of consideration/extended zone of consideration is covered by any of the three situations indicated in para 2 of the said Office Memorandum is to be furnished to the DPC to enable it to place its recommendations in the sealed cover.  No other details about the pending inquiry or the nature of charges etc. are to be furnished to the DPC lest these details weigh with the DPC in making its recommendations, which are to be placed in the sealed cover., 419438=25.11.72, 993411=Ref: Board’s letter No.E(TRG)l76(33)/44 dated 20.3.79., 302099=The scheme of General Departmental Competitive Examination (GDCE) introduced vide Board’s letter No.E(NG)II-92/PM2/16 dt.20.8.1993 was last extended up to 31.3.2005 vide this Ministry’s letter No.E(NG)I-2000/PM2/12 dt.21.8.2001., 745309=          In column 4 of Proforma for Medical Certificate i.e. ‘Near Vision’  sent under letter of even number dated 4-1-2002 quoted  above, for A-2 classification of Assistant Station Master [ASM], ‘SN 6/9, 6/9 without glasses’  may be corrected as ‘SN 0.6/0.6 without glasses’., 423763=17-12-1983, 804979=RBE No.167/2005, 375885=Reference this Ministry’s  letter  of even number dt: 30.03.2005 extending the scheme of  General  Departmental Competitive Examination (GDCE) for a period of one year upto 31-03-2006, as an interim measure.  It has now been decided to extend the currency of  this scheme up to 31-03-2008 on the existing terms and conditions., 1028153=The following amendments may be carried out in Para 1132 of Chapter XI of IREM Vol.I (Revised Edition,1989) regarding House Building Advance.:-, 205006=42/2/2004-P&PW(G) dated 15.3.2004., 701013=4.         Accordingly the Indian Railway Establishment Manual, Volume I,1989 is also amended as per ACS No.177 enclosed., 511912=RBE No.114/2005, 754480=3.       The above is in replacement of para 2(3) of Board’s letter dated 11.1.2002 referred to above., 1074009=One of the Railways have brought out that session in certain ITIs /Professional institutions concludes in July/August and the cut off date for reckoning the eligibility being 30th June, the Drivers whose wards have appeared in final year / waiting for final result from such institutions cannot avail this Retirement Scheme in that particular year.  Keeping this aspect in view, it has been decided that where the employee and his ward  is otherwise eligible  and the ward is already admitted to a course in such Technical Institutions rendering him eligible for Assistant Driver’s post, relaxation in cut off date  for eligibility i.e. 30th June laid down in para 2 [vii] of the above referred Board’s letter may be given by Zonal Railway but in any case not beyond the last date fixed for withdrawal of such request i.e. 30th  of September.  However, for this purpose, the employee will have to obtain such relaxation from Railway Administration within the cut off date for submission of application i.e. 31st July of the respective year., 209291=Please refer to Board’s letter of even number dated 1.10.1999 regarding the Assured Career Progression Scheme (ACPS) and subsequent amendments/clarifications that have been issued from time to time., 826614=Advance Correction Slip No.5/2005., 343351=Board’s letter No. E(P&A)1-2003/FE-2/1 dated 15.4.05 (RBE No.66/05), 94511=Advance Correction Slip No.1/2005, 1045656=Ref: Board’s letters of even number dated 20.1.2000 (RBE No.11/2000), dt. 9.10.2002(RBE No.182/2002), dt.11.2.03 (RBE No.28/03), dt.3-4-2003(RBE No.57/2003) and 22.4.2003 (RBE No.65/2003), dt. 5-03-04 (RBE No.47/2004), dt.23-03-04 (RBE No. 65/2004), and dt. 21-04-04 (RBE No. 90/2004)., 677270=iii)               The existing maximum limit of Rs.1250 (Rupees one thousand two  hundred and fifty ) per month laid down in sub-rule 11(b) revised upwards to Rs.9000 (Rupees nine  thousand) per month., 573904=New Delhi, the 28th February, 2005, 890449=Board’s letter No. 2005-E[SCT]I/25/14 dated 16-11-2005 (RBE No.194/05), 14300=Board’s letter No.E(P&A)II-2004/HRA-16 dated 28.1.2005(RBE No.12/2005), 1003084=The other terms and conditions as stipulated in Board’s letter No.E(P&AI-98/ALL/RPF/1 dated 1.4.1998 shall remain unchanged., 1060727=II.  After the existing Para 1304 insert the following as Para 1305., 886652=(i)                Group D staff recruited prior to 4.12.98 without the condition of qualification and those recruited after 4.12.98 with relaxation of qualification will be eligible to seek transfer on request in recruitment grade on bottom seniority., 196332=RBE No. 34/2005, 183741=II.    will prepare an Action Plan every year commencing from 2005-06, 344621=A copy of O.M.No.11013/7/2004-Estt.(A) dated 5.10.2004 received from the Ministry of Personnel, Public Grievances & Pensions (Department of Personnel & Training) on the above subject is enclosed herewith for information and necessary action., 492442=2.       All other conditions as laid down in the letter dated 16.11.2000 will continue to apply., 791915=Ref: Board’s order of even number dated 17.6.2005., 837918=[Authority: Board’s letter No. E(W)2002PS5-8/5 dated 26.10.2005 ], 172939=1.1.90          31.12.00                12%   Risk 31.25% from 1.1.82 to 31.12.87, 82517=Ref: Board’s letter No. F(P&A)I-97/SP-1/AD-1   Dated 27.2.05., 688470=Board’s letter No.E(NG)I-2003/PM7/10 dated 06.09.2005 ( RBE No.148/2005), 137569=Year of cessation of membership 2005, 686036=Board’s letter No. E(NG)I-2003/PM3/5 dated 5.9.05 (RBE No.147/05), 1041806=(RBE No.33/2005, PC-V/446), 634343=Ref: Board’s letter of even number dated 01-01-04, 511978=Board’s letter No. E(NG)I-2004/PM 1/25 dated 6.7.05 (RBE No.114/05), 1016627=In terms of the decisions conveyed in this Department’s Office Memorandum No.2/13/93-Estt(Pay II) dated 26th october,1993, Members of various Group A services appointed to post in the Central Secretariat under the Central Staffing Scheme and who are approved for proforma promotion, while on Central Deputation, to the Senior Administrative Grade and above in their parent cadre and exercise the option to continue on deputation till the completion of their prescribed tenure are entitled to draw pay only in the scale of pay applicable to the lower post held on deputation.  They shall be no claim to the pay of the higher post.  However, on subsequent reversion to the parent cadre and assumption of duties of the higher post, the period of service covered by the proforma promotion shall count towards initial fixation of pay in such higher post and increment without any arrears being paid.  Further, the Central Deputation on Tenure Allowance (CDTA) is presently admissible to the Group A officers appointed under the Central Staffing Scheme only to posts of Under Secretary Deputy Secretary and Director., 313780=Sub: Payment of difference of gratuity to pre 1996 Central Government Pensioners – clarification regarding., 850534=2550-2605, 343306=RBE No.66/2005, 1104326=S.O. 1577(E)—In exercise of the powers conferred by Sub-Section (2) of Section 1 of the Payment of Wages (Amendment) Act, 2005 (4) of 2005), the Central Government hereby appoints the 9th day of November, 2005 as the date on which the said Act shall come into force., 1077802=Advance Correction Slip No.6/2005, 253587= Board’s letter No. E(W)2001/PS 5-1/1 dated 12.04.05, 993499=The Railway Ministry have decided that the expenditure incurred on the training of Apprentices recruited under Apprentices Act, 1961 who are imparted training in Railway Establishments including the Railway Workshops, RDSO & Metro may be booked under the sub-detailed Head K-12-512 under Demand No.12.  Since demand No.12 is not in operation in Production Units, the cost of training of Act Apprentices in PUs may be booked under WMS head only.  Reimbursement of the cost of related instructions from the Government should be strictly ensured and should be taken as a minus debit to the concerned Head of account.  Necessary Budget provision may, therefore, be made accordingly., 506258=RBE No.113/2005, 391486=i)                               The decision for grant of compassionate allowance or gratuity or both, or otherwise, shall be taken at the time of passing orders of removal/dismissal keeping in view the guidelines given in para 310 of the Manual of Railway Pension Rules, 1950., 723738=RCIL have requested Railway Board for  grant of further permission to retain Railway accommodation in favour of deputationist officers/staff to RCIL.  Keeping in view the position brought out by the Corporation, Board have decided to extend the period of retention of Railway accommodation at the previous place of posting in favour of Railway employees posted on deputation to RCIL by a further period of one year from 26.9.05 to 25.9.06 on the terms and conditions laid down in the letter dated 31.05.2002., 805323=The President is pleased to sanction Productivity Linked Bonus equivalent to 59 (Fifty Nine) days wages without any ceiling on wages for eligibility for the financial year 2004-2005 to all non-gazetted group ‘B’, ‘C’ & ‘D’ Railway employees (excluding all RPF/RPSF personnel).  Where wages exceed Rs.2500/- (Rupees Two thousand & Five hundred only) per month, Productivity Linked Bonus will be calculated as if ‘wages”  are Rs.2500/- p.m., 1135508=For all other purposes, provision contained in the Dress Regulations, 2004 shall apply., 208984=Board’s letter No.PC-V/2004/ACP/1/PC-V/445 dated  22.2.2005 (RBE no.32/05)., 745187=Ref: RRCB No. 1/2002 issued vide Board’s letter of even number dt. 4-1-2002., 331681=will  be paid DR @ 9% w.e.f. 01.01.2005., 253799=Staff / Officers of Railway Audit Department are entitled to Post Retirement Complimentary Passes as applicable to staff/ officers of equivalent status and pay on Railways, I terms of Board’s letter No. E[G] 58 PS 5-20/1 dated 8-6-61.  Board’s letter No. E(W)2001/PS 5-1/1 dated 16.3.05 may, therefore, be treated as rescinded., 284773=decide that the Dearness Allowance payable to Railway employees with effect from Ist January,2005 shall stand modified as follows:-, 137358=Accumulated value of contribution from 1st Jan.of year of entry to the month and year of cessation, 259483= Copy of Board’s letter No. 2002/AC-II/37/8 dated 17.11.2004., 389563=          Reference s are being received from Zonal Railways, etc., seeking clarification as to whether, compassionate allowance can be sanctioned to the removed/dismissed Railway servants and family pension to  the eligible members of the family on the basis of representations received from them and the family after a lapse of many years from the date of removal/dismissal and death, respectively of such removed/dismissed Railway servants.  In this respect, attention is invited to Rule 65 of Railway Services (pension) Rules, 1993. In terms of this rule, if the case of a removed/dismissed Railway servant is deserving of special consideration, the authority competent to dismiss or remove the Railway servant from service may sanction a compassionate allowance not exceeding two-thirds of pension or gratuity or both, which would have been admissible to him if he had retired on compensation pension. The power to sanction or otherwise compassionate allowance is a discretionary power vested in the authority competent to remove/dismiss the Railway servant, to be exercised by that authority suo-motu, at the time of passing orders of dismissal or removal from service or immediately thereafter.  Hence past cases where the competent authority, in exercise of its discretionary powers, had not sanctioned compassionate allowance at the time of  passing orders of removal/dismissal or immediately thereafter, cannot be reopened  for review on the basis of representations received from the removed/dismissed employees and members of their family at a later date., 135198=to 31.12.2005., 488651=In terms of DOP&PW’s O.M.No.45/51/97-P&PW(E) dated 21st July,1999 circulated vide Board’s letter No.F(E)III/98/PN1/4 dated 9.9.1999, admissibility of family pension to parents is subject to the conditions, inter-alia, that parents were wholly dependent on the Government servant when he/she was alive and that the Government servant has not left behind a widow/widower, eligible son or daughter or a widowed/divorced daughter, who will have a prior claim to family pension in the order indicated.  Reiterating these stipulations, further clarifications were issued vide Board’s letter No.F(E)III/98/PN1/4 dated 11.9.2000., 300331=[Authority: Board’s letter No. E(NG)I-2002/PM1/31 Dated  9-9-2003 & 29.3.05], 412936=In this Department’s OM No.45/1/2004-P&PW(G) dated 27th January,2005, on the subject mentioned above, the date mentioned in line 4  of clarification No.1, as 1.1.2004 may be substituted as 1.4.2004., 892729=RSRP 1997 (V Central Pay Commission) may be incorporated for the categories mentioned in the Chapter., 114075=RBE No.2/2005, 77232=RBE No.17/2005, 395722=Under the extant  rules, as modified from time to time, the maximum limit that had been prescribed for grant of Computer Advance was Rs. 80,000/- on the 1st occasion and Rs. 75,000/- on the second and subsequent occasions in terms of Board’s letter dated 26.12.1997., 289548=In terms of Board’s letter No.E(W)95PS5-1/11 dt.31.5.95, railway servants, who have been promoted to higher grade on regular basis and retire from the higher grade, are given Post Retirement Complimentary Passes corresponding to the higher post as to their number and class.  However, in case of railway servants, who are officiating in the higher grade without regular promotion i.e. ‘adhoc’ basis, the benefit of Post Retirement Complimentary Passes corresponding to the higher post is given only after 3 years of officiating/adhoc service., 404391=In partial modification of Board’s letter of even number dated 31.1.05 (RBE No.20/2005) the medical classification in column  5 of item No.3 Track Machine Maintainers/Technicians may be corrected as B-1.  Other things remain  unchanged., 676975=ii)                 The existing maximum limit of Rs.2500 (Rupees two thousand five hundred) per month laid down in sub-rule (11)(a)(ii) revised upwards to Rs.15000 (Rupees Fifteen thousand) per month., 791708=   Board’s letter No. E(NG)II/2004/RC-4/1 dated 26.9.05 (RBE No.158 /05), 1024140=Copy of Ministry of Personnel, Public Grievances & Pensions, Deptt. Of Personnel & Training’s OM No.2/2/2004-Estt(Pay-II) dt.1.6.2005., 125053=(ii) Board’s letter No.TC-1/2004/109/4 dated 4.11.2004., 1007257=Board’s letter No. E(P&A)II-2005/RS-24 dt.1.12.2005. (RBE No.206/05), 127447=“We have already extracted the relevant portion of the Apprentices Act,1961. The Act prohibits that any person to be engaged as Apprentice unless there is a contract and the contract has also to be registered.  If the respondents (Southern Railway) have engaged any person without any contract as an apprentice then they are liable to be punished under Section 30 and 31 of the Act.  The circumstances also show that there is failure on the part of the Railways in not taking necessary action and these applicants from 1991 onwards have been asked to move from pillar to post and at present the Railways wanted to wash their hands stating that they have done whatever they could do at their end”., 196378=Board’s letter No.  E(D&A)2004/RG-6/52   dated 22.2.2005 (RBE No. 34/05)., 298147=  Board’s letter No. E(NG)I-2002/PM1/31 Dated  29.3.05 (RBE No.57/05), 746778=Board’s letter No. F(E)III/2005/PN1/36 dated 26.9.05 (RBE No. 163/05), 293419=i)                    The instructions contained in Board’s letter No.E(G)97 QR1-28 dated 2.9.2002 stand withdrawn with immediate effect., 331760=(i)                The widows and dependent children of the deceased CPF beneficiary who had retired from service prior to 01.01.1986 or who had died while in service prior to 01.01.1986 and are in receipt of Ex-gratia payment of Rs,.605/-. p.m., 614666=In continuation of Board’s letter .of even number dated 25-1-2005 issued under RBE No. 14/2005, the following two training centres included under ‘ Other Training Centres’ at S.Nos. 171 and 216 have  been deleted., 573263=RBE No.131/2005, 88652=In continuation of Board’s Lr.No. E(MPP)2001/3/9 Dt: 10.7.2003 issued under RBE No.121/2003, Ministry of Railways have decided to include the following Training Centres under “Other Training  Centres” as shown below:-, 77277=Board’s letter No. F(E)III/2005/PN1/2   Dated 25.1.05  (RBE No.17/05), 888423=   Board’s letter No E(P&A)II-2005/RS-28 dated 8.11.2005 RBE No.189/05), 131454=In terms of this Ministry’s letter No. E(NG)-II/94/RR-3/2 dtd. 31.1.1995 persons appointed against sports quota to the categories of Clerk and Senior Clerk in the pay scales of Rs. 3050-4590 and Rs. 4500-7000 respectively are required to pass typewriting test at 30 w.p.m. in English or 25 w.p.m. in Hindi within a period of two years from the date of appointment and their appointment is provisional subject to their acquiring the prescribed typing qualification  within the stipulated period.  The period of two years is extendable with General Manager’s approval up to four years in terms of instructions subsequently issued vide this Ministry’s letter No. E(NG)-II/97/RR3/1 dated 2.6.1997., 194548=3.       The matter has been considered by the Board and keeping in view the difficulty faced by the Railways, it has been decided that in cases of arrear claims arising out of antedating of the aforesaid instructions, where the amount of the claim for the period beyond 3 years exceeds Rs.5,000/-, sanction for investigation of the entire claim may be done at the General manager’s level, as a one time exception, in relaxation of para 1005 of IREM Vol.I, 1989 edition., 135241=The undersigned is directed to refer to this Ministry’s O.M. No. 7(2)/EV/2003 dated 8th  January, 2004 forwarding therewith Tables of Benefits under CGESIS for the year 2004.  New Tables of Benefits for the savings fund of the Scheme based on  a subscription of Rs. 10 per month from 1.1.1982 to 31.12.1989 and Rs. 15 per month w.e.f. 1.1.1990 onwards have been prepared for the year 2005 and a copy of the same is enclosed.  Another Table of Benefits for the savings fund based on a subscription of Rs. 10 per month for those employees who had opted out of the revised rates of subscription w.e.f. 1.1.1990 have also been drawn up or the year 2005 and as copy of the same is also enclosed.  The amounts in the Tables have been worked out on the basis of interest @ 10% per annum (compounded quarterly) for the period from 1.1.1982 to 31.1.1982.  11% per annum (compounded quarterly) w.e.f. 1.1.1983 to  31.12.1986, 12 % per annum (compounded quarterly) w.e.f. 1.1.1987 to 31.12.2000, 11% per annum (compounded quarterly) we.e.f. 1.1.2001 to 31.12.2001, 9.5% per annum (compounded quarterly) w.e.f. 1.1.2002 to 31.12.2002, 9.0% per annum (compounded quarterly) w.e.f. 1.1.2003 to 31.12.2003 and 8% per annum (compounded quarterly) w.e.f. 1.1..2004 onwards.  The mortality rate under the Scheme has been taken as 3.75 per thousand per annum upto 31.12.1987 and 3.60 per thousand per annum thereafter in both the cases.  While calculating the amount it has been assumed that the subscription has been recovered or will be recovered from the salary of the month in which a member ceases to be in service failing which it should be deducted from accumulated amounts payable., 752839=modified by their letter of same number dated 08.08.2005., 506304=Board’s letter No. E(NG)I-2004/CFP/8 dated 4.7.05   (RBE No.113/05), 341039=Reference Board’s letter No.E(NG)I-98/PM1/17 dt.20.10.1999 forwarding therewith guidelines for Personnel Officers and Members of Selection Boards constituted for conducting selections for promotion to posts classified as “selection”., 1103998=No.1173)       NEW DELHI, TUESDAY, NOVEMBER 8, 2005/KARTIKA 17, 1927, 1038194=  Board’s letter No. 2004/TG-III/639/2 dated 01.12.2005 ., 861589=Rate of Night Duty Allowance with effect from 1.7.2005 for Essentially Intermittent categories  at the various places classified as ‘A-1’, ‘A’, B-1, B-2, and Ordinary localities including ‘C’ Class Cities., 432542=24-8-2002, 573533=Copy of notification (GSR No.75) dated 28.02.2005 in Hindi and English version containing Railway Servants (Hours of Work & Period of Rest) Rules, 2005 to amend the Railway Servant (Hours of Employment)Rules, 1961 is sent herewith., 826697=The following line may be added under para 6.2 of item No.6 of the Manual on Management of Training (June 1998):-, 1040338=A copy  of the Office Memorandum No.45/1/2004-P&PW(G) dated 26.10.2005 of Ministry of Personnel, Public Grievances and Pensions (Department of Pension & Pensioners’ Welfare) on the above subject is sent herewith for your information and necessary action., 395656=F(E)Spl.2000/ADV/4/1 dated 26.3.2001., 564492=Copy of Board’s letter No. E(NG)II/94/RR-1/29 dated 02-08-05 ( RBE No.126/2005), 249390= Board’s letter No. . F(X)I-99/11/1 Dated 17.3.05, 154671=1.1.01          31.12.01                11%            30% from 1.1.88 and onwards, 641759=In the General Managers’ Meeting held on 14.6.2005 concern has been expressed on the large number of vacancies in safety categories which are as high as 21% on one of the Zonal Railways.  It has been emphasized that urgent priority should be accorded to filling up of vacancies in safety categories., 842137=Copy of  Ministry of Personnel, Public Grievances & Pensions Department of Pension & Pensioners welfare’s O.M. No.42/2/2005-P&PW(G) dated 14.10.2005, 773811=2650-4000, 573309=the Railway Board’s letter No.E(LL)2001/HER/9, dt.9.08.2005 (RBE No.131/2005), 428174=11-12-1990, 115406=2.1             As regards Group ‘B’ posts of Assistant Dietetics Officer in the pay scale of Rs.7500-12000, it has been decided by the Board that the same may be filled through  the normal process of selection consisting of written test and viva-voce (including assessment of record of service) from amongst the Senior Dieticians with three (03) year’s regular service in the pay scale of Rs.6500-10500., 114119=Board’s letter No. E(GP)2004/2/73   Dated 2.2.05     (RBE No.2/05), 1053970=Copy of Ministry of Finance, Dept. of Economic Affair’s OM F.No. 5(2)-PD/2005 dt. 7th October, 2005, 124979=Ref: (i) MT’s D.O.letter No.2004/TC(FM)10/6 dated 19.8.2004., 513827=The last sentence of Para 2 of Board’s letter of even number dated 14.1.2005 may be deleted., 324377=RBE No.60/2005, 322225=The issue of observing 5 days week for training centres/institutes was raised in the meeting of ZRTI held on 16th and 17th September 2004.  This matter has been examined and it is clarified that training centres like ZRTIs/ STCs/ S&TTC/ETC/CETC/BTC, etc are field units and hence do not come under the purview of 5 days week and Staff/faculty in all training centres will observe 8 days Casual Leave, in terms of Board’s letter No.E(G)2001LE1/7 (Master Circular) dated 24.1.91 and 27.1.2002., 449920=In terms of para 11 of instructions contained in this Ministry’s letter No.PC-III/2003/CRC/6 dt.09.10.2003, an element of direct recruitment to the extent of 20% of the posts in the categories of Office Superintendent (OS) Gr.II in the pay scale of Rs.5500-9000, Personnel Inspector (PI) in the scale of Rs.6500-10500 and Depot Material Superintendent (DMS) in the pay scale of Rs.6500-10500, has been introduced to be filled through Railway Recruitment Boards.  The staff side in the PNM-NFIR and PNM-AIRF as also in the DC-JCM have represented that orders for direct recruitment quota as introduced in the above categories may be revised.  A suggestion has also been made that instead of direct recruitment the posts may be filled by LDCE., 809079=In terms of para 3(iii) of Board’s letter No.E(W)90/CN-1/8 dated 19.11.1980, service rendered by employees of statutory canteens and 11 Delhi based non-statutory canteens, and employees of other non-statutory subsidized recognized canteens prior to 22.10.80 and 1.4.1990 respectively, will be taken into account for pensionary benefits to the extent it qualifies for the purpose as per rules. It has come to the notice of Board that some confusion is prevailing on the Zonal Railways, etc. about determining the quantum of qualifying service out of pre 22-10-1980 and 1.4.1990 service for being taken into account along with the post 22.10.80 and 1.4.90 service of such employees for the purpose of pensionary benefits and post retirement complimentary passes., 15894=3.       The special orders relating to grant of HRA/CCA in localities as listed in para 3 of this Ministry’s letter No.E(P&A)II/90/HRA/CCA-18 dated 19-7-1993 shall continue to be applicable. The special orders issued vide this Ministry’s letters(i) No.E(P&A)II/98/HRA-4 dated 18.2.1998 for grant of HRA at ‘B-2’ class city rates within the municipal limits of Jammu City, (ii) No.E(P&A)II/97/HRA-19 dated 4-6-1998 relating to classification of Calcutta & Chennai  as ‘A-1’ class for grant of HRA and (iii) No.E(P&A)II-2004/HRA-4 dated 13.7.2004 for classification of Goa, Port Blair and other areas of Andaman & Nicobar Islands shall also continue to be applicable., 718780=dated 27.10.1977, 1073785=Board’s letter No. E[P&A]I-2005/RT-14 dated 20-12-05  (RBE No.215 /05), 121730=The Ministry of Railways have decided to modify the “Manual on Management of Training”(Edition 1998) as per the Correction Slip No.2/2005 enclosed., 822400=Railways may therefore act accordingly and permit surviving spouses of deceased retired employees, who intend to join the RELHS-97, till 31.12.2005., 125142=Member Traffic, Railway Board vide D.O. letter of even No. dated 19.8.2004 referred to above has issued instructions to shift the staff working on sensitive posts for long durations in the same place, particularly in parcel offices and goods sheds/siding.  Standing instructions regarding transfer every four years of staff holding sensitive posts already exist.  The list of sensitive posts has also been circulated vide Board’s letter No.E(NG)I/87/TR/34/NFIR/JCM/DC dated 27.9.1989. Vide Board’s letter dated 4.11.2004 referred at (ii) above instructions have also been given interalia regarding proper calibration and functioning of weigh-bridges., 564723=Ref: Board’s letter of even number dated 09-09-04 (RBE No.199/04)., 707681=If no such certificate is received by 31st January and 31st July every year respectively, the quarter controlling may cancel the allotment of the quarter in question., 516006=2.         DPO&PW’s O.M. No (1) 45/86/97-P&PW(A) Part IV dated 8.5.98, 30.11.l98 and 17.12.98 and O.M. No. 45/86/97/P&PW(A)-Part III dated  18.7.2001, 2.4.2002, 26./3.2003 and 15.3.2004 were circulated /adopted on the Railways vide Board’s letters No.F(E)III/98/PN1/11 dated 5.6.98,23.12.98, F(E)III/98/PN1/29 dated 15.1.99 and letters No.F(E)III/2000/PN1/61 dated 23.8.2001 and F(E)III/2002/PN1/29 dated 3.9.2002, 24.4.2003 and 26.3.2004 respectively., 408104=          Chapter XII of Indian Railway Establishment Manual, Vol.I, 1989 incorporating the scheme for absorption in alternative employment of medically de-categorised staff has been amended pursuant to Section 47(1) of the Persons with Disabilities ( Equal Opportunities, Protection of Rights and Full Participation) Act, 1995, vide ACS No.77 issued under this Ministry’s letter number E(NG)I/96/RE3/9 (2) dt. 29-4-99 read with ACS Nos.122 and 148 issued under their letters No.E(NG)I/2000/RE3/5 dt. 31.7.2001 and E(NG)I/2001/RE-3/8 dt. 1.7.2003, respectively., 197520=(i)                In  respect of employees in the Zone of consideration for promotion, a bare statement as to whether the case of the Railway servant is covered by any of the three conditions mentioned at para 2 of  Board’s letters of 21.1.1993 only need to be furnished to the DPC to enable it to place its recommendations in the sealed cover.  No other details about the pending inquiry or the nature of charges etc. are to be furnished to the DPC lest these details weigh with the DPC in making its recommendations., 720654=Copy of  Ministry of Personnel, Public Grievances & Pensions Department of Pension & Pensioners welfare’s O.M. No.42/2/2004-P&PW(G) dated 21.6.2004, 129495=“Apprenticeship Rules, 1991., 344904=Copy of Ministry of Personnel, Public Grievances & Pensions (Department of Personnel & Training)’sO.M.No.11013/7/2004-Estt.(A) dated 5.10.2004, 490729=RBE No.103/2005, 746881=Sub:Counting of past service on submission of technical resignation on or after   1.1.2004 by employees governed by Railway Services (Pension) Rules,1993/ Central Civil Services (Pension) Rules,1972., 805219=& ‘D’ Railway employees for the financial   year 2004-2005., 137279=CENTRAL GOVT.EMPLOYEES GROUP INSURANCE SCHEME 1980, 1073755=RBE No.215 /2005, 636184=   Board’s letter No. E(G)91 AL6-1 dated 16.8.05 (RBE No.130/05), 1098044=2.       The Society for the Welfare of Former Central Government Employees Absorbed in Public Undertakings, Hyderabad, had filed OA No. 1345/2001 in the Hyderabad Bench of Central Administrative Tribunal requesting for certain reliefs, which were allowed by the Tribunal vide their order dated 28th November, 2002.  Aggrieved by this order, Government [Office of the Comptroller and Auditor General of India] filed Writ Petition No. 8532/2003 in the High Court, of Judicature of Andhra Pradesh at Hyderabad, against the said order.  The High Court, vide their order dated the 24th December, 2003, prescribed a different formula for restoration of one-third pension to such absorbees.  It was felt in the Government that there was an error apparent on record in the said order dated the 24th December, 2003, hence a review petition No. WPMP SR No.78433 in WP No. 8532 of  2003 was filed in the High Court praying for rectification of the error.  In the meantime, a Contempt Petition No. 312/2005 was filed by the respondents in  the  High  Court  for  non-implementation of   the  order dated 24th December, 2003 of the High Court.  The High Court, vide their order on 12th April, 2005 dismissed the review petition since it did not find any calculation error in their order dated 24th December, 2003 and also dismissed the Contempt Petition holding that it is for the individual employees to make detailed representations with regard to the eligibility of pension keeping n view their order dated the 24th December, 2003.  While disposing of the contempt petition, the Court directed the petitioner association  to forward the individual representations of the employees concerned to the respective departments and the same shall be considered and disposed of in the light of the principles laid down by the Court in their order dated the 24th December, 2003, as expeditiously as possible, within a period of eight weeks from the date of submission of the applications., 313573=A copy of Department of Pension & Pensioners’ Welfare’s O.M.No.38/42/2005-P&PW(F) dated 17th February,2005, 443409=Board’s letter No. E[P&A]II-2005/RS-15 dated 03-06-05 (RBE No.94/05), 703452=Advance Correction Slip No.55- R-II/1987 Edition, 282718=Kindly  refer Board’s letter No.98/Safety-1/27/1 dated 20.10.2004 conveying Board’s decision about placing ZRTI under the control of Chief Operations Manager (COM) of the Railway. Accordingly the designation “CSO” wherever occurring in Board’s letter of even number dated 29.7.03 (RBE No.129/2003) may be replaced by “COM”. All other terms and conditions of the letter remain the same., 436769=Board’s letter No. E(G)2004 HO1/15 dated 3.6.2005(RBE No. 95/05), 339302=Replace item (i) & (ii) under column 3 against item (2) ‘on sports account’ below schedule VII of Railway Servants (Pass) Rules 1986 (Second Edition,1993) as under:, 302361=The Board have decided that the scheme may be extended further for a period of one year up to 31.3.2006, as an interim measure on the existing terms and conditions., 174620=The avenue of promotion of Mistries  [ Redesignated as Supervisors] and Master Craftsmen [ Redesignated as Sr. Technicians] to the post of  JE Gr.II scale Rs. 5000-8000 has been laid down in this Ministry’s letters No. E[NG]/I/87/PM7/9   dated 29-9-1987 and No. E[NG]/I/86/PM7/8  dated 17-10-1990.  In terms of these instructions, the then existing Gr. I Artisans as on 29-9-1987, till such time they remain available for promotion, along with Master Craftsmen and Mistries are eligible to be considered for promotion by selection as JE Gr.II based on their integrated seniority with reference to their date of entry on regular basis in the category of Skilled Gr.I Artisans and Mistires, keeping in view the stipulations that:-, 421765=8.9.1979, 445681=Ref:  Board’s letter No. 2003/H/28/1/RELHS dated 28-1-05., 377388=2.       It is also clarified that since in the case of promotions by Non-Selection, promotions are made on the basis of seniority-cum-fitness and the concept of merit is not involved in such promotions,  instructions contained in Board’s letter dated 07-08-02 and 20-06-03 referred to above do not apply to the promotions made by Non-Selection method., 892864=[Authority: Board’s letter No. PC-V/2004/RSRP/4 dated 14.11.2005], 127284=The Hon’ble CAT/Chennai in their judgement dt.10.1.2001 in O.A.No.807/99 filed by S/Shri G.Ganesan and M.Sivakumar had observed:-, 395579=Ref: Board’s letters No.F(E)Spl.97/ADV.2/2 dated 26.12.1997 and, 517166=The undersigned is directed to refer to this Department’s OM of even number dated 15.-3.2004 extending the date of submission  of applications for revision of pension/family pension of pre-1986 pension/family pensioners upto 30.09.2004.  Representations have been received in this department for extending the date for submission of applications beyond 30.09.2004.  The matter has been considered in this department and it has been decided to extend the date of submission of application for revision of pension/family pension in such cases upto 31.12.2005. However, Defence civilian  pensioners will continue to be governed by orders issued by the Ministry of Defence., 324422=Board’s letter No. E(NG)I-2003/CFP/2 dated 7.4.2005  (RBE No.60/2005), 117447=4.0     Similarly, Board has also reviewed the matter regarding promotion to Group ‘B’ post of Assistant Physiotherapy Officer. In partial modification of para 4 of Board’s orders dated 30.11.99 referred to above, it has been decided that the selection for promotion to the Group B posts of Assistant Physiotherapy Officer, which are also operated on floating basis, will be conducted by Northern Railway.  For this purpose, the seniority of the Physiotherapists in Group C will also be maintained by Northern Railway.  The orders of promotion to the Group B posts of Assistant Physiotherapy officer would however, be issued by the General Managers of the respective Railways where the empanelled employees may be working., 1078053=(Authority:- Board’s Lr.No.E(MPP)2001/3/9/Vol.III Dt :09.12.2005), 298102=RBE No.57/2005, 203335=Board’s letter No.PC-V/97/1/9/6   Dated   22.2.2005 (PC No.V-446) (RBE No.33/2005)., 673179=(g)              The admissibility of the allowance in each individual case will be examined by a Committee at appropriate level to be constituted as per Board’s letter No.E(MPP)2001/19/3-Recommendation No.37 dated 29.6.2001 (RBE No.127/2001). These committees would adopt a strict selection process to find excellent trainers for such appointments. The guidelines for such selection should not only take into account the outstanding service records but also good training capability and aptitude for the job.  Regard should also be given for participation in trainers training course, keenness of interest taken by the officials in providing requisite training to their subordinates in the various jobs held by them and to their performance in their earlier assignment, if any, in posts relating to training. The above instructions should be read with Board’s letter No.E(MPP)99/19/1/Pt dated 11.03.2003 [RBE No. 49/2003]. It should be ensured that before the training centre/institute and trainers are sanctioned this allowance, they must satisfy the above guidelines. The trainers not recommended by the Committee should be repatriated to their respective parent cadres. Adhoc appointees will not be allowed this Training Allowance till they are regularised., 410966=Consequent upon increase in Dearness Relief to pensioners/family pensioners, w.e.f. 01.01.2005 in terms of Board’s Circular No.PC-V/97/I/9/6 dated 26.4.05 a dependent relative in relation to a Railway servant as described in Railway Servants (Pass) Rules, 1986, shall be deemed to be wholly dependent on the Railway servant only if his/her income w.e.f. 01.01.2005 including pension, dearness pay and dearness relief in terms of Board’s letter No.PC-V/97/I/9/6 dated 26.4.2005 does not exceed Rs.2633/- i.e. Rs.1500/-(Pension/family pension) + Rs.750 (DP) +17% of Rs.2250 (1500+750) or 15% of the pay of Railway servant, whichever is more., 430522=16-07-94, 573420=Sub:   Revision of Railway Servants (Hours of Employment) Rules, 1961, 417018=1531, 1054094=Sub: Advances to Government servants – Rate of interest for purchase of conveyances during 2005-2006., 1033953=(F(E)Spl.2000/ADV 3/7 dated 16.12.2000), 465427=  Board’s letter No. .E(Sports)2005/Policy/2(S.posts) dated 27.6.05   (RBE No.108/05), 976567=In terms of proviso to Rule 75(6) of Railway services (pension) Rules,1993 as amended vide Gazette Notification No.F(E)III/94/PN1/31/Amendment dt.3.2.1995 and No.F(E)III/99/PBN1/38/Modification dated 23.5.2000, family pension for life in respect of mentally retarded son or daughter shall be payable to a person nominated by the railway servant or the pensioner, as the case may be, and in case no nomination was furnished to the Head of Office by such Railway servant or pensioner during his/her life time, to the person nominated by the spouse of such Railway servant or family pensioner, as the case may be, later on.  In case no nomination was filed by the Railway servant or the pensioner, as the case may be, or by the spouse or family pensioner later on, family pension in respect of mentally retarded son or daughter shall be paid through the guardian, as if he/she were a minor, on the basis of guardianship certificate or the guardian appointed by a court., 445646=Re-opened on 28-1-05., 205210=Copy of Govt. of India, Ministry of Personnel, Public Grievances and Pensions/ Deptt. of Pension  and Pensioners Welfare’s Office Memorandum No.45/I/2004-P&PW(G) dated 27th January, 2005., 701188=Indian Railway Establishment Manual, Volume I,(1989 Edition), 426130=21.11.1987, 752763=Ref: Railway Board’s letter of even number dated 11.01.2002 as, 379544=F 24-4/2001-TS-III. In continuation of this Department’s Notification of even number dated 27.07.2001, the Government of India has decided to extend the provisional recognition granted to the Prathama Examination being  conducted by Hindi Sahitya Sammelan, Allahabad for the purpose of employment under the Central Govt. for the post for which the desired qualification is a pass in matriculation for a further period of 3 years from 27.07.2004 to 27.07.2007, after which the Committee  will review the recognition granted.  This has the approval of the Competent authority., 195607=2. Board’s letter No.PC-V/2004/A/DA/1 dated 25.8.2004., 198827=Copy of  Ministry of Personnel, Public Grievances and Pensions Deptt. of Personnel & Training New Delhi’s  Office Memorandum No. 22012/1/99-Estt(D) dated 25.10. 2004., 690945=            In exercise of the powers conferred by the proviso to Article 309 of the Constitution, the President is please to direct that Rule 1424 in Chapter 14 of Indian Railway Establishment Code, Volume II, 1987 Edition may be amended as per the enclosed Advance Correction Slip No. 56., 328729=Copy of Ministry of Personnel, Public Grievances & Pensions, DOP & PW’s O.M. No.42/2/2005-P&PW(G) dated 04-04-2005, 88368=RBE No.14/2005, 432883=1-2-2003, 286861=Board’s letter No. E(NG)I-2004/PM7/16 Dated  22.3.05(RBE No.49/05), 1104657=(F.No.S-31012/3/94-WC(PW)), 731713=   Board’s letter No. F(E)I/2005/AL-28/7 dt.21.9.05 (RBE No.157/05), 1115472=A presiding officer of any Labour Court or Industrial Tribunal, constituted under the Industrial Disputes Act, 1947 or under any corresponding law relating to the investigating and settlement of industrial disputes in force in the State., 721086=In continuation to this Department’s O. M. of even No. Dated 15th March, 2004 on the Above subject, the undersigned is directed to say that it has been brought to the notice of this Department that some of the pension sanctioning authorities have doubts about allowing pension beyond Rs.15,000/- in view of Para 5 of OM No. 45/86/97-P&PW(A) part I dated 27th October, 1997 despite the fact that this Para stands amended vide Para 3 of this Office O.M.No. 43/2/2004-P&PW (G) dated 15th March, 2004-P&PW(G) dated 15th March 2005., 253004=Ref: Your U.O.No.59-Rly/Misc.17.7/2-4 dated 15.2.2005., 881410=Board’s letter No. PC-III/2004/CRC/7 dt.06.04.04 (RBE No.78/2004), 325687=Revised rate effective from –1.1.2005., 523888=Board’s letter No. E(NG)I-2004/PM5/8 dated 14.7.05 (RBE No.117/05), 976233=   Board’s letter No. F(E)III/2005/PN1/37 dated 17.11.2005 (RBE No.197/05), 115091=2.0             The Recruitment Rules for filling up the posts of Sr. Dieticians in the pay scale of Rs.6500-10500 have already been laid down in Board’s letter No.E(NG)II/2004/RR-1/22 dated 17.6.2004., 400376=Consequent upon upgradation of pay scales of Accounts staff, SO(A)s/TIAs/ISAs working against the ex-cadre post of Sr. Traffic Costing Inspectors  in Traffic Costing Cell have been allowed to draw pay in the pay scale  of Rs. 7450-11500 vide Ministry of Railways’ letter of even number dated 11.3.2005 (S.No.PC-V/448, RBE No. 42/2005), if they have already been promoted to this pay scale in their respective parent cadres.  On the same analogy, it has been decided that SO(A)s/TIAs/ISAs working against the ex-cadre posts of Input Output Supdt. in EDP Centre, Vigilance Inspectors and Instructors in Zonal Training School, should be allowed to draw pay in the pay scale of Rs. 7450-11500, if they have already been promoted to this pay scale in their respective parent cadres., 271440=[i]  The existing staff in the EDP Centres who are encadred would be suitably trained and adjusted in corresponding/equivalent grade in the new IT Cadre.  The grade in which they are working shall be the basis for their absorption in the corresponding/equivalent grade.  They will be assigned seniority in the absorbing grade with reference to length of non-fortuitous service in the corresponding/ equivalent grade as on 1.4.05 subject to the condition that inter-se seniority of persons in the same category will not be disturbed.  However, staff in the lowest grade Rs.4500-7000 will have to pass the selection for entering into entry grade Rs.5000-8000 in the reorganised setup.  A concession/relaxation to the extent of 10% in standard may be allowed to them to facilitate their deployment/promotion in the said grade failing which they will be repatriated to their parent cadre.  Once the existing staff is so adjusted, the induction/direct recruitment for new setup will come into force for any vacancy remaining unfilled and that arising in future.In the meanwhile, fresh recruitment at the entry level (Rs.4500-7000) in the cadre of DEOs should be stopped forthwith since that grade will not be there in the new setup and to that extent, the problem of their promotion/deployment in next higher grade (Rs.5000-8000) in the new setup will not arise., 1042260=Copy of Office Memorandum No.45/1/2004-P&PW (G) dated 26.10.2005 of Ministry of Personnel, Public Grievances and Pensions (Department of Pension & Pensioners’ Welfare), 335274=2.       In this connection it is clarified that it is the responsibility of the railway employees to look after their families, failing which they can be taken up for violating RS(Conduct) Rules,1966 for such conduct as ‘unbecoming of a railway servant’. Neglect by a railway employee of his wife and family in a manner unbecoming of railway servant should be regarded as a good and sufficient reason to justify action being taken against him under Rule 6 of RS(D&A) Rules,1968., 344317=RBE No.67/2005, 469665=Foot Note: Principal rules were published in the Gazette of India vide Notification No. E[D&A]66/RG6-9 dated 22nd August, 1968 in  Part II, Section 3, Sub-Section [ii], vide number S.O. No. 3181 dated the 14th September, 1968 and subsequently amended by –, 842485=Pensioners – Revised rate effective from 01.07.2005., 235697=3.       These orders shall take effect from 25.8.2004. It is accordingly clarified that subject to all other conditions prescribed in the case of son/daughter:, 1011454=Board’s letter No. F(E)II/2005/NBR dated 23.11.2005 (RBE No.160/05), 1028749=Subsequent sub-paras of Para 1132 (3) (vi) onwards may be re-numbered accordingly., 193722=2.       In the PNM/AIRF meeting at Board’s level it was pointed out that considerable difficulty is being experienced on the Railways, in finalizing the arrear claims of employees arising out of minimum benefit of Rs.100/- on promotion, the instructions regarding which were circulated vide letter No.F(E)II/99/FR1/1 dated 27.9.99, and which were subsequently made effective from 1.1.96 vide Board’s letter of the same number dated 26.5.2000.  The Federation had sought a special dispensation to allow the Railways to sanction investigation of arrear claims arising out of implementation of the aforesaid instructions from 1.1.96, without making a reference to the Board for claims beyond 3 years as provided in para 1005 of IREM Vol.  I 1989 edition., 572428=Board’s letter No. E[P&A]II-98/HRA-6 dated 09-08-2005 (RBE No.129/05), 304485=Advance Correction Slip to Para 626(1) of IRMM, 2000., 679893=RBE No.141/2005, 398156=3.       The matter has been examined in consultation with the Department of Personnel & Training and it has been decided that cases where the persons are medically de-categorized and were appointed to some other posts for which they are suitable in terms of medical conditions could be decided on the basis as that of the persons declared surplus and re-deployed viz. by counting the past service.  However, while in the case of surplus employees, if the re-deployment is to a lower post, the last pay scale is protected as personal to the employee and, therefore, in terms of clarification no. 36 of Board’s letter No.PC-V/99/I/1/1 dated 19.2.2002, the two financial upgradations are allowed in the hierarchy of a new organization with reference to the protected pay scale to the fulfillment of the promotional norms, in the case of de-categorized employees, there appears to be no provision for protection of pay scale in the event of transfer to a lower post.  If so, in such cases, past service may also be counted towards ACP Scheme and the benefit of financial upgradation allowed as per the hierarchy of the re-deployed posts.  Even where a person had earned one financial upgradation prior to medical decategorization and appointment to a lower post, since the transfer is not on own volition, there is no objection to counting of the past service including for the period he held a higher service on promotion, for deciding the two financial upgradations as per the hierarchy of the new post., 465381=RBE No.108/2005, 523812=   RBE No.117/2005, 325759=A copy of Office Memorandum No.42/2/2005-P&PW(G) dated 04.04.2005 of Ministry of Personnel, Public Grievances & Pensions (Department of Pension and Pensioners’ Welfare) on the above subject is sent herewith for your information and necessary action. As stated in para-2 thereof, these orders will apply to Railway pensioners also. A concordance of various instructions and orders referred to  in the enclosed office memorandum with reference to corresponding Railway instructions is indicated below:-, 527935=subject to the condition  that the existing Technicians grade-I  as may be senior to those fitted as Sr. Technicians as per procedure in force prior to issue of instructions contained in this Ministry’s letter No.E(NG)1-99/PM7/3 dated 22.2.2005 will also be considered for selection for promotion as JE(Works)II., 574334=(1)  These rules may be called the Railway Servants (Hours of Work and Period of Rest) Rules, 2005., 1054229=The undersigned is directed to state that the rates of interest for advances sanctioned to the Government servants for purchase of conveyances during 2005-2006 i.e. from 1st April, 2005 to 31st March,2006  will continue to be at the same level as for 2004-2005, as under:-, 795806=Reference to this Ministry’s letter of even number dated 8.04.2005 (S.No.PC-V/452, RBE No.61/2005) on the subject mentioned above.  The President is pleased to decide that the Dearness Allowance payable in Railway employees with effect from Ist July,2005 shall stand modified as follows:-, 196708=The procedure and guidelines to be followed in respect of promotion of Gazetted and Non-Gazetted Railway servants against whom disciplinary proceedings /Criminal prosecution etc are pending, were circulated to the Zonal Railways respectively vide Board’s letter No. E(D&A) 92/RG 6-149(B)  and E(D&A)92/RG 6-149(A), both dated 21.1.1993.  These were based on the instructions contained in DOP&T’s O.M.No. 22011/4/91-Estt.(A) dated 14.9.1992. A further clarification has since been issued by  the DOP&T vide their O.M.No.22012/1/99-Estt.(D) dated 25.10.2004 and the same is circulated herewith for guidance and compliance., 436723=RBE No. 95/2005, 675470=RBE No.132/2005, 317962=iii)               Duty Card passes to eligible railway employees should be issued affixing photographs excepting in the case of card passes issued to IRPOF, AIRPF and to both the recognised federations i.e. AIRF and NFIR (Ref.Board’s letter No.E(W)2002PS5-1/10 dt.18.6.02, Board’s 1982 PS5-1/1 dt.23.6.82, 24.12.82, 4.5.83 and 30.7.93).  Vigilance inspectors may also be exempted from filling up the entries in the card passes (Ref. Board’s letter No.E(W)1981 PS5-1/2 dt.7.8.82) One photograph of the person whom Duty Card Pass has been issued should be pasted in the relevant page of the register alongwith other details., 214190=Sub: Workmen’s Compensation Act,1923 – Compensation to Trainee Skilled  Artisans during training period., 1106063=1.(l) This Act may be called the Payment of Wages (Amendment) Act, 2005., 233541=As per clauses (ii) and (iii) of sub-rule (6) of Rule 75 of the Railway Services (Pension) Rules,1993 read with clause (b) of para 7.2 of Board’s letter No.F(E)III/97/PN1/22 dated 5.11.97, son/daughter, including widowed/divorced daughter, shall be eligible for grant of family pension till he/she attains the age of 25 years or up to the date of his/her marriage/remarriage, whichever is earlier (subject to income criterion to be notified separately).  The income criterion has been laid down in Department of Pension & Pensioners’ Welfare’s O.M.No.45/51/97-P&PW(E) dated the 5th March,1998 circulated vide Board’s letter of even number dated 27.4.98 according to which, to be eligible for family pension, a son/daughter (including widowed/divorced daughter) shall not have an income exceeding Rs.2550/- per month from employment in Government, the private sector, self employment, etc.  Further orders were issued vide Board’s letter of even number dated 20.8.2001 regarding eligibility of disabled divorced/widowed daughter for family pension for life subject to conditions specified therein., 403687=2.       These orders shall be effective from 1.4.2004.  All other conditions governing grant of House Rent Allowance/Compensatory (City) Allowance under existing rules/orders shall  continue to apply., 892021=On acceptance of the recommendations of V CPC by the Government, revised pay scales have been implemented in Ministry of Railways vide Railway Board’s letter No. PC-V/97/I/RSRP/1 dated 16.10.97., 426810=17.9.1988, 1061977=[Authority: Board’s letter No. E(NG)I-2004/RE-3/9 dated 7.12.2005], 675516=Board’s letter No. F(E)III/98/PN1/4 dated 8.8.2005 (RBE No.132/2005), 238378=(Enclosure to letter No.F(X)I-2002/11/1 dated 9.3.2005), 610627=Board’s letter No. E(G)2005 EC 2-3 dated 3.8.05 (RBE No.124/2005), 376481=Board’s letter No. .99-E[SCT]1/25/13 dated 6-5-05 (RBE No.77/05), 1065926=Board’s letter No.F(E)III/2000/PN1/55 dated 14.12.05(RBE No.214/05), 88413=Board’s Lr.No. E(MPP)2001/3/9/Vol.III Dt:25.1.2005 (RBE No.14/2005), 847945=12.        This issues with the concurrence of Ministry of Finance, Department of Expenditure vide their U.O.No.400/E.V/2005 dated 13th October,2005., 515188=5th Central Pay Commission – Revision of pension of pre and post – 1986, 17118=Ref: Board’s letter No.E(L)60/UTI-31 dated 19.2.1960., 874888=Under Railway Board’s instructions contained in letter of even number dated 30.6.2005 it was provided that “in the event allotment of accommodation is offered to a Railway officer/staff at the new place and he/she refuses to accept such allotment, such refusal would make the employee ineligible for retention of Railway accommodation at the old place of posting”.  In this regard it is clarified that only refusal for acceptance of entitled category of accommodation by an employee shall disqualify the employee and make him/her ineligible for retention of accommodation at the old place of posting, as provided for in letter of even number dated 24.3.2005., 216085=RBE No.39/2005, 195695=Pursuant to the Board’s letters mentioned above, it is clarified that the ceiling of Rs.26,000/- p.m. fixed for grant of dual charge allowance i.e. Basic Pay + Additional Pay @ 10% of the presumptive pay of the additional post, will be enhanced to Rs.26000+50% D.P. i.e. Rs.39,000/- w.e.f. 1.4.2004. The 10% presumptive pay should be calculated on basic pay + D.P. In other words, aggregate of pay and additional pay shall in no case exceed Rs.39,000/- per month., 285497=2.       Provision contained in Paras 3 and 4 of this Ministry’s letter No.PC-V/97/I/7/14 dated 16.10.1997 (S.No.PC-V/3, RBE No.139/97) shall continue to be applicable, while regulating Dearness Allowance under these orders., 533504=Enclosure to Ministry of Railway’s letter No. E(NG)II/96/RR-1/62 dated 18.7.05, 1097012=         Instructions were issued vide Department of Pension and Pensioners’ Welfare vide O.M. No. 4/59/97-P&PW[D] dated 14th July 1998 and OM No. 4/29/99-P&PW[D] dated 12-7-2000 circulated vide Board’s letter No. F[E]III/96/PN1/9 dated 18-8-98 and 2-8-2000 respectively for restoration of one third commuted  portion of pension after 15 years from the date of commutation or 1st April, 1985, whichever is later, in respect of Government servants who had drawn lumpsum payment on absorption in PSU / autonomous body.  In terms of those instructions, the basic pension sanctioned at the time of permanent absorption of such Government servants is to be notionally revised in accordance with the then prevailing instructions and one third of the revised pension is to be restored after 15 years from the date of commutation or 1-4-1985, whichever is later, and Dearness Relief is to be paid on the full notional pension., 421104=23.12.1978, 677881=  Board’s letter No. E(D&A)2003/RG-6 dated 22.8.2005 (RBE No. 137/05)., 8012=Reference para 3 (iii) of this Ministry’s letter No. E(NG)1/97/SR6/3 (Vol.III) dated 8.3.2002 indicating that since the earlier instructions issued pursuant to Hon’ble Supreme Court’s judgement in Virpal Singh Chauhan’s case (JT 1995(7) SC 231) as incorporated in para 319A of IREM Vol,.1 1989 Edition were effective from 10.2.95 and the revised instructions issued pursuant to Constitution (85th) Amendment Act, 2001 were being made effective from 17.6.95, the question as to how the cases falling between 10.2..95 and 16.6.95 should be regulated was under consideration in consultation with DOP&T and that separate instructions in this regard would issue., 612663=Instructions prescribing length of cloth to be supplied to the Public Image Categories were issued vide Board’s letter of even No.dt.21.3.02. The length of cloth for overcoat has been indicated therein as 1.850 meters for normal size and 2.20 meters for special size., 176329=2.        Consequent upon the implementation of V Pay Commission scales of pay in which while Senior Technicians [ erstwhile MCMs] and JE-II came to be placed in the identical scales of pay though the former continued to be held as personal by Skilled Gr.I Artisans , the Mistires  were placed distinctly in the lower scale of pay Rs.4500-7000 plus Rs.100 as special allowance, the question of revision of the basis of filling up the promotion quota posts of JE-II has been under consideration of this Ministry in consultation with the recognised federations.  The federations have, however,  been insisting  on the question of upgradation of posts of Mistires,  being decided in the first instance.  The posts of Supervisors [erstwhile Mistires] have since been upgraded in all departments  except P.Way Mistires in Civil Engineering Department as JE-II vide instructions contained in this Ministry’s letter No. PC-III/2003/CRC/6 dt. 9-10-2003.  Accordingly the question as to what should be the basis for promotion of  Master Craftsmen  to the post of JE Gr.II, has been considered afresh by the Ministry of Railways., 407818=Protection of Rights and Full Participation) Act, 1995-, 976356=Sub: Acceptance of Legal guardianship provided under National Trust Act,1999 for grant of family pension to mentally retarded son/daughter of a railway servant., 1002546=In terms of the instructions contained in Board’s letters of even number dated 5.6.2002 and 30.12.2004, the Ration Money Allowance @ Rs.681/- per head per month is presently being granted to non-gazetted RPF/RPSF personnel on the Railways.  The Ministry of Railways ( Railway Board) have now decided that the non-gazetted RPF/RPSF personnel upto the rank of Inspector Grade I (Rs.6500-10500) shall now be entitled to Ration Money Allowance @ Rs.680/- per head per month w.e.f. 1.4.2005 to 31.3.2006., 88494=Training Manual Correction slip No.1/2005, 708441=In continuation to Board’s letter of even number dated 28.8.03 Board have since decided that Helmet may be issued as a T&P item to 10% of the strength of the Gangman category who are required to work at bridge construction sites in tunnels and for working around track machines. The standard specification of helmet should be IS:2925/1984., 1783=RBE No.03/2005, 465223=4.       These orders will be in force till 31.3.2006., 828737= Board’s letter No. 2005/H/28/1/RELHS dated 31-10-2005, 1026946=This issues with the approval of Ministry of Finance vide their I.D.No.7(10)E-III(A)/2004 dated 27.12.2004., 388012=The extant instructions regarding posting of husband and wife at the same station are contained in the Ministry of Railways’ letter No. E(NG)II/71/TR/14 dated 1.10.71 as reiterated in their letters No .E(NG)I-86/TR/14 dated 6.1.88 and as part of the consolidated instructions vide  letter No.E(NG)I-96/TR/28 dated 6.12.96.  Further  detailed instructions on the subject have been issued pursuant to recommendation of the Fifth Central Pay Commission under this  Ministry’s letter No. E(NG)I-97/TR/28 dated 5.11.97.  One of the guidelines incorporated in the last  letter viz. 5.11.97 is to the effect that posting  of husband and wife may be ensured at one place  even by considering sympathetically the request  for  change of category., 974374=*Foot Note : ( i) The revised percentage distribution of posts will be made applicable in the unified cadre as per the provisions contained in para 17 incorporated in Board’s letter dated 14.09.2005 vide this letter., 489330=2.       In the wake of a Court case, the matter regarding admissibility of family pension to dependent parents of the deceased Railway servants, whose spouse has either remarried or died leaving behind no eligible child for grant of family pension, has been re-examined in Board’s office in consultation with the Department of Pension & Pensioners’ Welfare (DOP&PW).  It is  accordingly clarified that parents of the deceased Railway servants/pensioners, who were wholly dependent on the Railway servant/pensioner when he /she was alive, shall be eligible for family pension if the spouse of the deceased Railway servant/pensioner dies or re-marries and no children, who will have a prior claim for family pension have been left behind.  The grant of family pension to such parents shall, however, be subject to fulfillment of the income criterion stipulated in Board’s letter No.F(E)III/98/PN1/4 dated 27.4.98., 795737=Revised rates effect from 1.7.2005., 706505=Instructions have been issued from time to time regarding grant of permission for retention of Railway accommodation on payment of normal rent at the previous place of posting in favour of officers posted to N.F.Rly. The existing instructions issued vide letter No.E(G)2002 QR1-9 dated 28.6.2002 were valid upto 30.6.20005. The question of further extension of this facility beyond 30.6.2005 has been considered and it has now been decided to extend these instructions for a period of three years upto 30.6.2008 or till revised orders are issued whichever is early., 813112=Board’s letter No. E(G)2004 FE 1-4 dated 18.10.04 (RBE No.175/05), 425452=4.4.1987, 16907=  Board’s letter No. E(LR)III/2004/UTF-2  Dated 11.1.2005 ., 310366=Ref: Ministry of Railways’ letter of even number dated 28.5.98, 681090=Ministry of Railways have reviewed clause 3(v) of Railway Board’s instructions contained in letter No.E(G)99 QR1-16 dated 16.3.2004 in its Meeting held on 29.7.2005.  It has been decided to substitute para 3(v) of letter No.E(G)99 QR1-16 dated 16.3.2004 as under., 417687=2501, 184312=A format of the Action Plan for the year 2005-06 is enclosed., 302628=Board’s letter No. 2004/H/28/1 RELHS/Card dated 22.3.05 ., 1016154=Copy of Ministry of Personnel, Public Grievances & Pensions, Deptt. Of Personnel & Training’s OM No.2/8/97-Estt(Pay-II) dt.9.4.2001., 211785=2.       With the operationalisation of seven new Zonal Railways viz., East Central, East Coast, North Central, North Western, South East Central, South Western and West Central Railways, the existing instructions dt.19.2.1990 regarding the maximum number of doctors that can be granted Study Leave/EOL for study purpose or sent on deputation terms in a year have been reviewed and it has been decided by the Board that henceforth, not more than three medical officers on each of the 16 Zonal Railways and not more than one medical officer on each of the Production Units may be granted study leave in a year.  The other provisions stipulated in Board’s letter dated 19.2.90 shall continue to remain in force., 747173=References have been received from certain Zonal Railways, seeking clarifications from Board whether the employees appointed on or before 31.12.2003, who were governed by old pension scheme under the Railway Services (Pension) Rules, 1993/Central Civil Services (Pension) Rules,1972, will be eligible for counting of their past service under Rule 41 (2)/Rule 26(2) respectively of the said rules or under the provisions of Board’s letter No.F(E)III/84/PN1/4 dt.8.4.1985 (based on DP&AR’s O.M.No.28/10/84-PU dated 29.8.1984), as amended from time to time, in the situation where such employees submit technical resignation, on or after 1.1.2004 to take up new appointment in the new Ministry/Department/Central Autonomous Body., 564881=Attention is invited to this Ministry’s letter under reference vide which the currency of the relaxation contained in letter of even number dated 10.5.99 (RBE No.99/99) was extended for a period of one  year i.e. upto 03.08.2005., 520089=iii)                 These contract engagements should be made against clear vacancies for a maximum period of one year or up to 31.7.2006 or availability of a regular selected candidate, which ever is earliest;, 517889=2.          Similarly it has also been decided to extend the date of submission of applications for revision  of pension/family pension with reference to this department’s OM No.(1) 45/86/97-P&PW(A)-Part IV dated 08.05.1998 read with OM dated 30.11.1998 and dated 17.12.1998 for submission of applications by the pensioners covered under these OM upto 31.12.2005., 886092=2.       The question whether Group D employees recruited prior to 4.12.98 without the condition of qualification and those recruited to Group C posts with pre-revised qualification wherever the qualifications have been revised, should be made eligible for transfer on request on bottom seniority in grades having element of direct recruitment, has been considered carefully by the Board.  The issue has been raised in the PNM NFIR and by AIRF as well.  It has been decided as follows:-, 1068025=Board’s letter No. PC-V/2004/ACP/1 dated 20.12.2005 (RBE No.217/05), 572671=The question of extending the currency of the sanction contained in this office letter of even number dated 09-03-2004  has been considered by the Board subsequent to issue of letter No. E[G]2003 QR1-6 dated 24-03-2005 and it has been decided to extend currency of the instructions contained in letter dated 09-03-2004 ibid upto 31-03-2006., 114249=Sub: Selection for promotion to the floating posts in scale Rs.6500-10500 and Rs.7500-12000     in the cadre of Dieticians and in scale Rs.7500-12000 in the cadre of Physiotherapists., 415607=Foot Note: Principal rules were published in the Gazette of India vide Part II, Section 3, Sub-Section [ii], vide number S.O. No. 3181 dated the 14th September, 1968 and subsequently amended by –, 214066=Board’s letter No. E(LL)2004/AT/WC/3  Dated 16.3.05, 702601=[Authority: Board’s letter No. E(NG)I-2003/PM7/10 dated 06.09.2005 and  E(NG)I-2000/PM1/41 dated 12.09.2005], 191994=Attention is drawn to Board’s letter No.PC-III/2003/CRC/6 dated 09.10.2003 (RBE No.177/2003) wherein it has been stated that the scheme of restructuring is to be a self financing and expenditure neutral proposition.  While crediting money value in the Railways/Railway Board’s Vacancy Banks, it may be ensured that surrenders made to the extent of providing matching money value for restructuring are not credited to the vacancy Bank., 721001=Pensioners – Revised rate effective from 01.0-1.l2004., 677804=RBE No. 137/2005., 21326=RBE No.11/2005, 610811=The issue of filling up of vacancies and creation of additional posts of Ticket Checking Staff has been under consideration of Board for quite some time.  The matter was discussed in the full Board Meeting held on 23.6.2005 wherein the following decision was taken:, 643297=Ref: IRCTC’s letters No.2003/IRCTC/HRD/D&AR dated 9.6.2004 and 13.7.2005., 1037556=F(E)Spl.2001/ADV 3/11 dated 7.11.2001), 692806=[Authority: Board’s letter No. E[P&A]I-2004/HL-1 dated 30-11-2004 and  13-09-05], 328951=Subject: Grant of dearness relief to Central Government pensioners/ family pensioners-  Revised rate effective from 01.01.2005., 401613=Ref:  Policy letter No.E(Sports)2000/Policy/2 dated 19.6.2000., 448075=1-1-96 but prior to 01-04-04, 982066=Copy of Ministry of Personnel, Public Grievances and Pensions [Department of Personnel and Training]’s Office Memorandum No. 6/7/2003-Estt.[pay.II] dated  3rd November, 2004, 253092=In terms of provisions in the Railway Servant’s Pass Rules,1986 (2nd Edition 1993), Post Retirement Complimentary Passes are granted to those Railway Servants who have completed a minimum of 20 years Railway Service.  Audit Staff working on the Railways are not Railway Servants.  They are, therefore, not eligible for grant of Post Retirement Complimentary Pass even if they retire from Railways with a minimum of 20 years Railway Service., 322028=Board’s letter No. E(MPP)2004/3/41 dated 31.3.05   (RBE No.59/05), 428838=5.10.1991, 21371=Board’s letter No. E(MPP)2003/3/14   Dated  24.1.05    (RBE No.11/05), 283431=In terms of instructions contained in Board’s letter No.F(E)II/2002/DEI/I dt.22nd Nov., 2002, issue of duty cheque passes to the deputationists to Rail Tel Corporation was available for a period of two years which has since been expired.  On a request from the Rail Tel Corporation further extension of issue of duty cheque passes to the staff and officers of Rail Tel Corporation has been considered and it has been decided by Board that the facility for issue of duty cheque passes may further be extended for a period of another 2 years beyond 22nd November ‘04. In the meantime, Rail Tel Corporation should take necessary action to reimburse the cost of duty cheque passes issued to their staff and officers to Northern Railway, periodically., 834692=iii)                 Post Retirement Complimentary Passes shall not be issued to those retired railway servants on whom the penalty of cent percent cut in pension and gratuity has been imposed on or after 20.01.05, 1075624=          In continuation of Board’s letter .of even number dated 5-8-2005 issued under RBE No. 128/2005, the following training centres included under ‘ Other Training Centres’ at S.Nos. 14, 65, 66, 67 and 210 which have been placed inadvertently under SECR  has  been corrected and now placed under CR., 417759=3.7.1971, 702788=RBE No.100/2005, 688778=            In terms of extant procedure the posts of Goods Driver and Passenger Driver are required to be filled up by a positive act of selection. After elimination of viva-voce from departmental selections in terms of instructions contained in this Ministry’s letter No.E(NG)I-2000/PM1/41 dt. 07.08.2003 written test has been made mandatory as part of selection process to assess professional ability of the candidates as against written test and /or viva-voce, earlier., 749470=ii)       The employees who entered into service on or before 31.12.2003 and who were governed by CPF/SRPF[C] scheme or any pension scheme of Central or State Government, other than the pension scheme under  Central Civil Services (Pension) Rules 1972/Railway Services (Pension) Rules,1993, on submission of technical resignation to take up new appointment on or after 1.1.2004, cannot be allowed to join the old pension scheme under Railway Services (Pension) Rules,1993/Central Civil Services (Pension) Rules,1972 because entry to the said scheme ceased w.e.f. 31.12.2003 and no new entry can be allowed in the old pension scheme under above Rules.  However, such employees can seek pensionary/terminal benefits, from the previous organization/Department, if admissible under the rules of that organization/Department, for the period of service rendered under that organisation/Department., 285274=1.01.2005, 843784=3.         Central Government Employees who had drawn lumpsum amount on absorption in a PSU/Automonous body and have become eligible to restoration of 1/3rd commuted portion of pension as well as revision of the restored amount in terms of this department’s OM no.4/59/97-P&PW(D) dated 14.07.1998 will also be entitled to the payment of DR @ 21% w.e.f. 01.07.2005 on full pension i.e. the revised pension which the absorbed employee would have received on the date of restoration had he not drawn lumpsum payment on absorption and Dearness Pension subject to fulfilment of the conditions laid down in para 5 of the O.M. dated 14.07.98. In this connection, instructions contained in this Deptt.’s O.M.No.4/29/99-P&PW(D) dated 12.07.2000 refers., 558830=A case has come to the notice of this Ministry where disciplinary proceedings against a Railway officer working in Railway Claims Tribunal was instituted by the General Manager of the parent Railway because the alleged misconduct was committed by the officer while working on the Zonal Railway.  The exercise of disciplinary powers as above was not correct because at the time of taking disciplinary action the concerned officer was working under the control of the Chairman, Railway Claims Tribunal who has also been vested with the disciplinary powers in respect of staff/officers working in the Railway Claims Tribunal, in terms of Notification bearing No.GSR 845/E dated 19.9.1989. Since the disciplinary proceedings had been instituted by an authority who was not competent to do so, the proceedings against the concerned officer had to be dropped subsequently., 134017=Board’s letter No. PC-III/2000/GIS/2 dated 11.1.2005    (PC-V/Nil,RBE No.05 ), 573998=G.S.R. 75.—In exercise of the powers conferred by section 136 of the Railway Act, 1989 (24 of 1989) the Central Government hereby makes the following rules, namely:-, 376786=            Please refer to Board’s letters quoted above wherein  it has been clarified that SC/ST candidates promoted on their own merit will be adjusted against unreserved points.  In this connection it is further clarified that instructions contained in Board’s letters of even number dated 07-08-02 and 20-06-03 shall take effect from 07-08-02.  However, the cases where SC/ST candidates promoted on their merit before 07-08-02 have been adjusted against unreserved points need not be reopened., 881168=(Authority: Ministry of Railway’s letter No.F(E)III/2005/PF1/2 dated 2.11.2005)., 723242=In terms of the policy contained in Railway Board’s letter No.E(G)2000 QR1-23 dt.1/06/2001, Railway officers/staff on deputation to RailTel Corporation of India Ltd.(RCIL) were permitted to retain Railway accommodation at their previous place of posting for a period of 5 years from  the date of incorporation of RCIL, i.e. from 26.9.2000 to 25.09.2005 vide Board’s letter of even No.dt.31.05.2002 subject to payment of rent as specified in the said letter., 82332=Board’s letter No. E(P&A)I-97/SP-1/AD-1   Dated 2.2.05 (RBE No.21/05), 832999=2.         Subsequently, it was decided by the Board that retired railway employees in whose cases the whole of gratuity and pension has been withheld permanently as a result of D&A proceedings shall not be entitled to Post Retirement Complimentary Passes and accordingly, item no.(iv) under column 3 of Schedule IV of Railway Servants (Pass) Rules,1986 was amended vide Advance Correction Slip No.47 ( circulated vide Board’s letter No.E(W)2002 PS5-8/5 dated 20.1.2005) as under:-, 296502=Consequent upon the announcement made by the Minister of Railways in his Budget Speech 2005-06, it has been decided that special complimentary cheque passes in second/sleeper class should be issued to the persons stranded in the national calamities/ disasters which are notified by the Central Government.  The passes may be issued from the stations falling under the area notified to the destination station of the victims., 400105=Board’s letter No . PC-V/2003/1/11/2 dated 11.5.2005 PC-V/456. (RBE No. 81/05)., 708288=Board’s letter No. E(W) 95 UNI/19 dated 10.5.05 (RBE No.75/05), 771168=Annexure to Board’s letter No.PC-III/2005/CRC/11 dated 14.09.2005, 353203=Board’s letter No. E(P&A)II-2005/HW-1 dated 04-05-05 (RBE No.72/05), 114562=ii) Railway Board’s letter No.PC-V/2003/1/11/1 dated 8.1.2004., 343781=AIRF had raised a demand in the PNM to review the stipulation of the words “On tenure basis” appearing in 2nd line of para 3 of the Board’s letter No.E(P&A)I-99/SP-1/WS-1 dated 10.08.99.  The issue has been examined by Board and it has been decided that tenure for SE/SSEs posted to PCOs, will henceforth be decided by the concerned Railway/Production Units with the personal approval of the General Manager depending upon their local conditions., 675816=Consequent upon the revision of the rates and minimum and maximum limits of the family pension following the implementation of the recommendations of the Fifth Central Pay Commission, the question of revision of the maximum of ceilings on two family pensions admissible under sub-rule (11) of Rule 75 of the Railway Services (Pension) Rules, 1993 to child/children, where both of his/her/their deceased parents were Government/Railway servants and governed by the said rules or the corresponding provisions of the Central Civil Services (Pension) Rules, 1972, has been under consideration of the Government in the Department of Pension & Pensioners’ Welfare.  After careful consideration it has been decided by the Government to revise the existing limits on two family pensions as follows:-, 836167=4.       In view of the above position, item (iv) under column 3 of Schedule IV (Post Retirement Complimentary Passes)of Railway Servants (Pass) Rules,1986 ( Second Edition,1993) stand amended as in the enclosed Advance Correction Slip No.49., 1062146=Board’s letter No.F(E)II/2004/DE1/1 dated 9.12.05(RBE No.204/05), 524122=In terms of para 145 of IREM, Vol. I, 1989 Edition , posts in the category  of JE(Works)II in the pay scale of Rs. 5000-8000 are filled up as under:-, 401694=As per Para 3.2.1 of Board’s policy letter No. E(Sports)2000/Policy/2 dated 19.06.2000, Production Units/Workshops can recruit sportspersons, as per the quota allotted to them, in the category of Skilled Artisans (in the initial recruitment grade), waiving the prescribed training period., 353158=RBE No.72/2005, 690746=Ref: Board’s letter No. E[P&A]I-98/HL/1 dated 22-12-1998,, 641185=In terms of instructions contained in this Ministry’s letter No.E(NG)I-87/PM1/4 dt.18.08.1987 and letter No.E(NG)I-87/PM1/14 dt.22.7.1988 Zonal Railways are required to draw up a calendar for conducting selections for various grades to help them plan various activities connected with selections and to ensure better compliance of Board’s orders regarding holding of selections at regular intervals.  These instructions have been reiterated by this Ministry from time to time and lastly vide letter No.E(NG)I/2003/PM1/35 dt.04.12.2003., 313930=The undersigned is directed to say that a number of representations have been received seeking confirmation whether in pursuance of Supreme Court judgement, vide  this Department’s OM No.45/86/97-P&PW(A) Pt.I dated 4.12.2004, pre-1996 pensioners have been made eligible for receiving additional gratuity.  They have asked the concerned pensioners to apply to their respective Departments by furnishing details of PPO number, date of retirement, Bank details etc.  It also contains a portion of the OM purported to have been issued by this Department but does not indicate the name of Officer under whose signature it has been issued., 702834=Board’s letter No. E(P&A)II/2005/RS/11 dated 20.6.05 (RBE No.100/05), 216389=Ref: Board’s letter of even No.dt.13.9.03., 1011687=A copy each of O.M.No.2/13/93 –Estt(Pay-II) dated 26.10.93, No.2/8/97-Estt(Pay-II) dated 9.4.2001 and No.2/2/2004-Estt(Pay-II) dated 01.06.2005 received from the Ministry of Personnel, Public Grievances & Pensions, Deptt. Of Personnel & Training is sent herewith for information and guidance. The instructions contained therein will apply mutis mutandis to Railway employees also., 708243=RBE No.75/2005, 343682=Ref: Board’s letter No.E(P&A)I-99/SP-1/WS-1 dated 10.08.1999., 324080=Other terms and conditions of the scheme as stipulated in Board’s above referred letter dated 2.1.2004 remains unchanged., 189664=Attention is invited to Para 4.3 of Board’s letter No.E(Sports)2000/Policy/2 dated 19.6.2002 inter-alia stipulating that the sportsperson concerned should have represented State School/University/State Junior or Senior Team in National School Games/Inter-University Championships Junior or Senior National Championships except Marathon and Cross Country is eligible to be considered for the recruitment in Group D against sports quota.  Some of the Zonal Railways have sought  clarification as to whether Inter University Championship indicated in the norms for recruitment against sports quota should be within a Zone or participation should be in All India University Championship., 805813=2        In the revised (Fifth Central Pay Commission) Scales of pay, ‘Wages’ for the purpose of Productivity Linked Bonus actually drawn during the financial year, shall include ‘pay’ as defined in Rule 103(35)/R-I (1985 Edition) and dearness allowance sanctioned in the revised scales during the financial year 2004-2005.  In the case of Running staff, the term ‘pay’ shall include 30% of pay constituting the pay element in Running Allowance payable on leave salary.  Other conditions of eligibility, method of calculation of wages etc. as prescribed in this Ministry’s instructions and clarifications from time to time, shall remain unchanged., 444123=2.       It is advised that the correct method for determining  emoluments of Loco Inspectors / Sr. Loco Inspectors, governed by the scheme contained in Board’s letter No. E[P&A]II-83/RS-10[iv] dated 25-11-92, for computing their pensionary benefits with effect from 1-4-2004 is as under:, 606552=Ever;y Railway Administration shall send each financial year a return in Form `B’ appended to these rules, so as to reach the Regional Labour Commissioner not later than  the 15th day of May following the end of the financial year to which it relates., 700814=3.1        All the remaining provisions as mentioned in this Ministry’s letter of even number dt.07.08.2003 will remain unaltered., 114638=iii)) Railway Board’s letter No.E(NG)II/2004/RR-1/22 dated 17.6.2004., 1828=Board’s letter No. F(E)1/2004/AL-28/15   Dated 12.1.05     (RBE No.03/05), 1064424=Sub: Recommendation No.67 of the Railway Accident Enquiry Committee,1978 (Sikri Committee) – 90% re-imbursement of membership fee in respect of recognized professional Institutions/Societies., 982431=The undersigned is directed to invite reference to para 8.4 of Department of Personnel and Training  O.M. No. 2/29/91-Estt [Pay.II] dated 5th January, 1994 and to say that above instructions inter-alia provide that in cases where extension is beyond the fifth year or second year in excess of the period prescribed in the Recruitment Rules,  the same would be allowed only after obtaining the approval of the Department of Personnel and Training, whether Central Government is the lending organization or the borrowing organization.  The instructions lay down that proposal in this regard should reach this Department with the approval of the Minister of the borrowing  Department at least three months before the  expiry of the  extended tenure with full particulars.  The prescribed check-list has to be annexed with the proposal., 848214=RBE No.179/2005, 892249=Indian Railway Establishment Manual, Vol.I (1989 Edition ) may be amended incorporating the above and related changes as per Advance Correction Slip (ACS) No.176 enclosed., 287229=As the Railways are aware with reference to a clarification sought for by Northern Railway in the year 1994 their presumption that in the categories of Drivers and Guards the minimum two years service for promotion to functional grade in the hierarchy has to be the combined service in the equivalent & lower grade, was confirmed vide instructions contained in this Ministry’s letter No.E(NG)I-94/PM1/9 dated 2.9.94 also endorsed to other Railways for information and necessary action., 400021=RBE No. 81/2005, 515448=In continuation of Board’s letter No F(E)III/2002/PN1/29 dated 26.3.2004 extending  the date of submission of application for revision of pension/family pension of pre and post –1986 pension/family pensioners upto 30.09.2004, a copy of DOP&PW’s O.M. No.45/86/97-P&PW(A) Part III dated 7.6.2005 extending the date of submission of application further upto 31st December, 2005 is circulated for information and guidance .  These instructions will apply mutatis mutandis  on the Railways also., 129835=Copy of Board’s letter No.E(MPP)95/6/13 dt.21.8.95., 846062=7.         Other provisions governing grant of dearness relief in respect of employed family pensioners and re-employed Central Government Pensioners will be regulated in accordance with the provisions contained in this Department’s OM No.45/73/97-P&PW(G) dated 02.07.1999.  The provisions relating to regulation of DR where pensioner is in receipt of more than one pension will remain unchanged., 417353=1925, 1000790=Board’s letter No. E(MPP)2005/3/14 dated 22.11.05 (RBE No.201/05), 430860=27-12-97, 174212=RBE No.31/2005, 740740=It has been mentioned in Para 2 of Board’s letter of even number [RRCB No.5/2001] dated 04-09-2001 that the candidates applying for the post of Assistant Drivers / ASMs may be asked to enclose a medical certificate from an Eye Specialist regarding vision in a prescribed proforma.  The format of the medical certificate has now been modified to include the test for ‘colour vision’ also.  A copy of the modified format of the medical certificate is enclosed., 491030=pre-revised scales of pay – effective from 1.1.2005 – regarding., 81659=3.       It may, however, be noted that “Loan” is considered as a movable property in terms of Explanation-I below Rule 18(5) of Railway Services (Conduct) Rules, 1966 and hence any “Loan” advanced or taken by the Railway servant that exceeds the limit prescribed under Rule 18(3) of the said Rules is to be reported to the  Government.  It is always open to the authorities to verify the correctness/genuineness of the transaction if they have any doubt in the matter, by requiring the Railway servant to produce necessary documents., 423100=23.2.1980, 529985=RBE No.121/2005                                                                                                ., 1042130=(RBE No.68/2005, PC-V/453), 1075402=Board’s letter No. E(MPP)2001/3/9/Vol.III dated 09.12.2005    (RBE No.211 /05), 302848=In terms of provisions contained in para 626(1) of Indian Railway Medical Manual, 2000, it is necessary to produce medical identity card for availing of facilities in Railway Hospitals.  It has been brought to the notice of Board that retired railway employees/their eligible family members find it difficult to avail of medical facilities when one of the family members moves out of station carrying RELHS card., 283202=  Board’s letter No. E(W)2002 PS 5-1/9 Dated 21.3.05, 381288=2                    As the Railways are aware vide this Ministry’s letter of even number dated 22-05-2002 pursuant to acceptance of recommendation of Railway Safety Review Committee qualification of Class X Board Examination  was prescribed for promotion of  group ‘D’ staff in the S&T Department to the posts of ESM Grade III, MSM Grade III, TCM Grade III and WTM Grade III all in the pay scale of Rs.3050-4590 with the stipulation that the existing Group ‘D’ staff in service as on 22-05-2002 not possessing  the qualification of Class X Board Examination may be allowed two chances to appear in the two consecutive trade  tests conducted after the issue of the letter ibid., 1056607=   Board’s letter No. E(NG)I-2004/RE-3/9 dated 7.12.2005 .(RBE No.210/05), 191672=Board’s letter No. E(MPP)2004/1/98 Dated 10.2.05  (RBE No.26/2005), 1064241=Board’s letter No. E(G)2005/FE1-2 dated 12.12.05 (RBE No.213/05), 9624=“Seniority of Railway servants determined in the light of para 319 A shall be revised as if this para did not exist on and after 17.6.95.  However, seniority determined and promotion effected in between the period 10.2.95 and 16,6.95 (both days inclusive) in terms of para 319A in force during the period in question shall be protected as personal to the incumbents”., 13480=The scheme is open from the date of issue of this letter upto 31.12.2005 and would not be extended further in any circumstances., 456028=Enclosure to Ministry of Railway’s letter No.E(NG)I-2005/PM1/20 dated 17.06.2005., 842568=The undersigned is directed to refer to this Department’s O. M. No. 42/2/2005-P&PW(G)  Dated 4.04.2005 sanctioning the instalment of dearness relief  admissible from 01.01.2005 and to say that the President is pleased to decide that dearness relief shall be paid to the Central Government Pensioners/Family Pensioners to compensate them for the rise in cost of living at the rate of 21% w.e.f. 01.07.2005 in supersession of the rate mentioned in the OA dated 4.4.2005 referred to above., 974624=(ii) Existing Note to Annexure ‘C’ as issued in letter dated 14.09.2005., 706263=Board’s letter No. E(G)2005 QR1-3 dated 12.9.05 (RBE No.151/05), 702940=Sub: Amendment to the Indian Railway Establishment Code, Volume-II 1987 edition., 293039=On representation from New Zones about acute shortage of accommodation and the need for extension of the period of retention, the matter has been reviewed by Railway Board.  In exercise of the powers vested in Board as per letter No.E(G)99 QR 1-16 dated 16.3.2004, the Ministry of Railways (Railway Board) have taken the following decisions:, 570659=RBE No.133/2005, 497985=2.       It has been observed that above instructions are not being followed scrupulously by some of the Zonal Railways which leads to difficulties while processing cases for grant of family pension, particularly cases of death while in service.  Recently, a case has come to the notice of Board, wherein for want of records of the family of a former railway servant, family pension was wrongly sanctioned to a person, impersonating himself as the son of a deceased railway servant whereas the railway servant died as a bachelor.  Board, therefore, desire that the Railway Administrations should ensure that the procedure laid down in Rule 75(15) of the Pension Rules, is followed strictly by the concerned Head of Office and Accounts Officer.  The Railway Servants appointed on or before 31.12.2003 and are governed by the Railway Services (Pension) Rules 1993 should be advised to fill in Form 6, if not already filled in, and that it is their duty to communicate to the Head of Office whenever any change takes place in the size of their family., 690821=24-03-1999, 12-10-1999 and E[P&A]I-2004/HL/1 dated, 114486=Ref: i) Railway Board’s letter No.E(GP)99/2/69 dated 30.11.99., 467882=   Board’s letter No. . E(D&A)98/RG6-52 dated 23.6.05 (RBE No.105/05), 77598=In the meeting of the Consultative Committee of MPs for the Ministry of Railways held on 4.11.2004, Shri Abdul Mannan Hossain, MP, raised the issue regarding timely payment of settlement of staff of the Railways.  In this connection attention is invited to Chapters VII and IX of the Railway Services (Pension) Rules, 1993, wherein the procedures for processing the settlement papers in respect of  retiring Railway servants and of those who die while in service, have been laid down in order that the payment of settlement dues is made in time.  Further, instructions issued in this connection by the Department of Pension & Pensioners Welfare (DOP&PW) vide its OM No.38/116/93-P&PW(F) dt.2.5.94 and OM No.38/64/98 P&PW(F) dt.5.10.1999 were circulated vide Ministry of Railways letters No.F(E)III/94/PN1/18 dt.21.7.1994 and F(E)III/99/PN1/35 dt.21.1.2000 respectively for information and guidance of and strict compliance by the Railway administrations.  The Railway administrations are once again urged to meticulously follow the procedures given in the Railway Services (Pension) Rules,1993 and the aforesaid OMs of the DOP&PW and ensure that the settlement dues of the Railway servants are paid on the date of retirement itself and to the family of those who die while in service as early as possible in order that the retiring Railway servants and the families of the deceased Railway servants, are not put to hardships., 329121=The undersigned is directed to refer to this Department‘s OM No.42/2/2004-P&PW(G) dated 24.09.2004 sanctioning the instalment of dearness relief admissible from 01.07.2004 and to say that the President is pleased to decide that dearness relief shall be paid to the Central Government Pensioners/Family Pensioners to compensate them for the rise in cost of living at the rate of 17% w.e.f. 01.01.2005  in supersession of the rate mentioned in the OM dated 24.09.2004 referred to above., 308700=4.            It is, therefore, clear from  harmonious reading of condition number 6 of the Annexure-I to the letter dated 1.10.99 with the other conditions and stipulations of the ACP Scheme that, while a person has to be eligible in all other aspects (Educational qualification, departmental examination, skill/trade test, bench mark etc) to hold the higher post, in terms  of the Recruitment Rules, the scale of which is being considered under the ACP Scheme, insofar as the requirement of “eligibility service” is concerned, the only requirement is that he should have completed the prescribed 12 or 24 years’ regular service , as the case may be,  counted from the direct entry grade without insistence on further completion of residency period in any particular grade., 130035=Under the clause 4 of Section 4 of the Apprentices Act,1961, and para 6(1) of the Apprenticeship Rules,1991, the employer is required to send to the Apprenticeship Adviser each and every contract of Apprenticeship for registration within 3 months from the date of signing of the contract.  DGE&T have informed that the time stipulation is not being observed by most of the Railway Units and in many cases the contract reaches them in a year’s time.  This sort of delay defeats the spirit of the Act and may lead to embarrassment to the Railways only., 751263=3.       Para 3(A) (ii) 3 (B)(ii) of Board’s letter No.F(E)III/84/PN1/4 dt.8.4.85, which corresponds to the DP&AR’s OM No.28/10/84-PU dated 29.8.1984 may be treated as deleted w.e.f. 1.1.2004. Further, the provisions of the Board’s letter No.F(E)III/84/PN1/4 dated 8.4.85 or any other related order shall, insofar as it provides for any of the matters contained in this letter, cease to operate., 417425=8.5.1971, 727208=It is announced for general information that accumulations at the credit of the subscribers to the New pension System (Defined Contribution Pension Scheme) for all new recruits to the Central Government service with effect from January 1,2004 (except the armed forces in the first stage) announced vide Ministry of Finance, Department of Economic Affairs Notification F.No.5/7/2003-ECB &PR, dated December, 22,2003, shall carry interest at the rate of 8% (eight percent) per annum for the period January,01,2004 to March 31, 2004 as announced vide Resolution of even number dated March 12,2003., 379115=Copy of Notification No.F 24-4/2001-TS-III dated14th May, 2004 of Ministry Of Human Resource Development,   Department Of Secondary & Higher Education., 387723=Board’s letter No.  E(NG)I-2005/TR/7 dated 10.5.2005(RBE No. 80/05), 229510=Note: The Railway Services (Pension) Rules,1993 were published in the Gazette of India, Extraordinary , vide number S.O.930 dated the 3rd December,1993 and subsequently amended by –, 191627=RBE No.26/2005, 677586=These orders shall be deemed to have taken effect from the Ist January, 1996. The relevant rules under the Railway Services (Pension) Rules,1993 will be amended suitably in due course., 848260=Board’s letter No. E(P&A)II-2005/HW-1 dated 25.10.05 (RBE No.179/05), 407593=RBE No.93/2005, 835039=iv)                 Post Retirement Complimentary Passes shall be issued to those railway servants who are dismissed or removed from service on or after the date of issue of this letter but are granted compassionate allowance in terms of Rule 65 of Railway Services (Pension) Rules,1993. Post Retirement Complimentary Passes shall be issued to such dismissed/removed railway servants from the date of grant of compassionate allowance and after their death, their widows would also be entitled to widow pass in terms of provisions contained in Schedule V of Railway Servants (Pass) Rules,1986., 815335=Copy of Board’s  Confidential  letter No. 2004/V-I/DAR/1/3   Dated 16.8.04 (RBV No.19/04), 396038=In view of the prevailing funds crunch and the fact that computers were available in the market at much lower rates, the maximum limit of PC advance for Railway employees was reduced to Rs. 60,000/- on the first occasion and Rs. 55,000/- on the second and subsequent occasions vide Board’s letter dated  26.3.2001., 407638=Board’s letter No.  E(NG)I/2004/RE-3/9 dt. 31-5-2005 ( RBE No.93/2005), 425113=22.2.1986, 350372=With reference to Board’s letter No. PC-V/2004/A/DA/1  dated 11.3.2004 in which instructions regarding merger of 50% of Dearness Allowance /Dearness Relief with basic pay/pension w.e.f. 1.4.2004 have been  conveyed, a clarification has been sought as to whether pay limit  regarding eligibility for supply of free uniform as mentioned in para 8.2 of the Master Circular would be revised or not., 823014=Board’s letter No. E(NG)I-2005/PM2/1 dated 13.10.05, 1062390=Ref: Board’s letter No.(i) F(E)II/94/DE/1/1 dated 5.12.1994 (ii) F(E)II/98/DE/1/1 dated 25.3.1998 and (iii) F(E)II/94/DE/1/1 dated 24.12.1998., 690889=30-11-2004, 214333=An issue was raised by the Staff Side in DC/JCM vide their Item No.15/2004 in March 2004 in regard to treating the cases of injury to Trainee Artisans caused in the course of performing jobs as “Injury on duty”., 813400=Ministry of Railways have decided that International Society of Nephrology having its global Headquarters at Avenue de Tervueren, 300, B-1150 Brussels, Belgium, Tel + 3227431546, FAX +3227431550 be included in Annexure ‘B’ circulated alongwith Board’s letter No.E(G)83 FE 1-4 dated 29.4.88. This will entitle Railway officials to 90% reimbursement of annual membership fee towards membership of International Society of Nephrology subject to all other conditions stipulated under extant instructions., 1115284=14 of 1947, 133975=RBE No.2005, 114767=In terms of Railway Board’s letter dated 8.1.2004, mentioned above, two higher grades of Rs.6500-10500 (Gr.‘C’)and 7500-12000 (Gr.‘B’) have been introduced in the category of Dieticians on functional basis with designations as Senior Dieticians and Assistant Dietetics Officer respectively., 788322=1.         * Board’s letter No.E(NG)II/92/CD/1 dt.17.07.92 should be kept in view while restructuring., 218116=2                    In the Railway Services (Pension) Rules, 1993, after rule 53, the following rule shall be inserted, namely :-, 565149=The matter has been reviewed and it has now been decided that the relaxation of  03 (three) years  above the prescribed upper age limit for recruitment to Group ‘C’ & ‘D’ posts including engagement of Substitutes stands withdrawn w.e.f. 04.08.2005., 675618=Sub: Ceiling on two family pensions admissible to child/children of deceased  Railway servants under Rule 75 (11) of the Railway Services (Pension) Rules 1993., 1075372=RBE No.211 /2005, 419103=8.4.1972, 848346=Sub: Rates of Night Duty Allowance w.e.f. 1.7.2005., 706217=RBE No.151/2005, 491148=In continuation of Ministry of Railways letter of even number dated 16.3.2005 (S.No.PC-V/449, RBE No.43/2005) revising the rate of Dearness Allowance w.e.f. 1.7.2004 in respect of Railway servants who continue to draw their pay and emoluments in the pre-revised scale of pay, the revised rate of Dearness Allowance w.e.f. 1.1.2005 would be as follows:-, 549309=7.9        Existing provisions of verification of the original educational/caste certificate(s) and other relevant documents of the candidates, mentioned in Para 6 of Board’s letter No.99/E(RRB)/25/2 dated 18.3.99, will be applicable., 344362=Board’s letter No. E(P&A)I-2005/CPC/LE-1 dated 15.4.05  (RBE No.67/05), 570705=Board’s letter No. F[E]III/2003/PN1/43  dated 10-08-05   (RBE No.133/05), 82287=RBE No.21/2005, 94782=(Authority:- Board’s Lr.No.E(MPP)2001/3/9/Vol.III Dt:25.1.2005), 693058=Board’s letter No. E(NG)I-2000/PM1/41 dated 12.09.2005 (RBE No.154/2005), 79587=The term “small amount” appearing in first proviso to Rule 16(4)(i) of the Railway Services (Conduct)Rules, 1966, as defined in Board’s letter No.E(D&A)88 GS 1-5 dated 10.8.1988, has since been reviewed by the Board in consultation with the Department of Personnel and Training.  It has now been decided that this term need not be specifically defined as it will have the same meaning as understood in common parlance.  Accordingly, the monetary limits laid down in Board’s letter of 10.8.88 shall not longer hold good., 225248=(18) Lumpsum amount of the pro rata pension shall be determined in accordance with the Table of the values in Appendix to the Railway Services (Commutation of Pension) Rules, 1993., 1026806=All other conditions prescribed in the O.M.No.2/13/93-Estt.(Pay-II) dated 26.10.93 shall remain unchanged.}",
    "textBeforeTable": "Certain doubts have been raised by one of the Railways regarding grant of Composite Transfer Grant to officers who are transferred and relinquish charge from the old HQs on or before 31.3.04 but join the new HQs on or after 1.4.04.  The issues have been examined in Board’s office and are clarified as under:             Sub: Grant of Composite Transfer Grant – clarification regarding.   Board’s letter No. F(E)1/2004/AL-28/15   Dated 12.1.05     (RBE No.03/05) RBE No.03/2005 July 24, 2011 Rly Board’s Estt. Circulars 2005 Forum About me About Indian Railways: Home …….a bouquet of Information for Beginners of Railway Personnel Dept. The Rule Master ! Skip to content",
    "textAfterTable": "  RBE No. 07/2005   Board’s letter No. E(NG)I-97/SR 6/3 Vol. IV  Dated  13.1.2005      (RBE No. 07/05).   Sub:- Principles for determining the seniority of staff belong to SC/ST promoted earlier vis-a-vis General/OBC Staff  promoted later. …. Reference para 3 (iii) of this Ministry’s letter No. E(NG)1/97/SR6/3 (Vol.III) dated 8.3.2002 indicating that since the earlier instructions issued pursuant to Hon’ble Supreme Court’s judgement in Virpal Singh Chauhan’s case (JT 1995(7) SC 231) as incorporated in para 319A of IREM Vol,.1 1989 Edition were effective from 10.2.95 and the revised instructions issued pursuant to Constitution (85th) Amendment Act, 2001 were being made effective from 17.6.95, the question as to how the cases falling between 10.2..95 and 16.6.95 should be regulated was under consideration in consultation with DOP&T and that separate instructions in this regard would issue. The matter has since been considered in consultation with the Department of Personnel & Training and Legal Advisor, Railway Board.  It has been decided that since the Constitution (85th) Amendment Act, 2001 has been made effective from 17.6.1995, the promotions, if any, of Railway servants which had taken place during the period from 10.2.95 to 16.6.95 as per the principle of regaining seniority by General/OBC staff in terms of procedure in force at that point of time in implementation of Hon’ble Supreme Court’s judgment in R.K. Sabarwal’s and Virpal Singh Chauhan’s cases vide this Ministry’s letters No. E(NG)1-97/SR6/3 dated 28.2.97 and 15.5.98 may be protected as personal to them.  Accordingly the existing para 3(iii)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}