{
    "relation": [
        [
            "",
            "MS EDGE",
            "StrokEDGE",
            "TBI EDGE"
        ],
        [
            "Acute Care",
            "UR",
            "UR",
            "NR"
        ],
        [
            "Inpatient Rehabilitation",
            "UR",
            "UR",
            "LS"
        ],
        [
            "Skilled Nursing Facility",
            "UR",
            "UR",
            "LS"
        ],
        [
            "Outpatient Rehabilitation",
            "UR",
            "UR",
            "LS"
        ],
        [
            "Home Health",
            "UR",
            "UR",
            "NR"
        ]
    ],
    "pageTitle": "Rehab Measures",
    "title": "",
    "url": "http://www.rehabmeasures.org/Lists/RehabMeasures/Admin.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 676930099,
    "recordOffset": 676872961,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{1165403=Initially reviewed by Gail L. Widener, PT, PhD and the MS EDGE task force in the neurology section of the APTA on August 2011., 809256=Initially reviewed by Kirsten Potter, PT, DPT, MS, NCS and the MS EDGE task force of the Neurology Section of the APTA in 3/2011; Updated with the TBI population by Katie Hays, PT, DPT, and the TBI EDGE task force of the Neurology Section of the APTA in 5/2012; Updated for PD population by Cathy Harro MS, PT, NCS and the PD EDGE Task Force of Neurology Section, APTA 3/2013. Updated for the Vestibular EDGE task force of the Neurology section by Diane Wrisley PT, PhD, NCS and Elizabeth Dannenbaum MScPT 11/2013, 119797=Initially reviewed by Diane D. Allen, PT, PhD and the MS EDGE taskforce of the Neurology Section of the APTA in July 2011., 1194576=Initially reviewed by Jessica Guzman, Elizabeth Hirsch, Evelyn Ingargiola, Occupational Therapy students at the University of Illinois at Chicago in February 2015., 1077216=Initially reviewed by Jason Raad, MS of the Rehabilitation Measures Team and Dorian Rose, PT, PhD of the StrokEdge Taskforce of the Neurology Section of the APTA in 9/2011; Updated with references for Stroke and Fibromyalgia populations by Denise Toombs, SPT and Marina Yusupova, SPT in 2011, 1019186=Initially reviewed by Gail L. Widener and the MS task force of the neurology section of the APTA in 2011.}",
    "lastModified": "Fri, 31 Jul 2015 04:57:58 GMT",
    "textBeforeTable": "  For detailed information about how recommendations were made, please visit:  http://www.neuropt.org/go/healthcare-professionals/neurology-section-outcome-measures-recommendations   Recommendations for use of the instrument from the Neurology Section of the American Physical Therapy Association’s Multiple Sclerosis Taskforce (MSEDGE), Parkinson’s Taskforce (PD EDGE), Spinal Cord Injury Taskforce (PD EDGE), Stroke Taskforce (StrokEDGE), Traumatic Brain Injury Taskforce (TBI EDGE), and Vestibular Taskforce (VEDGE) are listed below. These recommendations were developed by a panel of research and clinical experts using a modified Delphi process. 1/22/2014 Initially reviewed by the Rehabilitation Measures Team in 2010; Updated with references from the Alzheimer's Disease population by Jenna Poulter, SPT and Mackenzie Riebel, SPT in 2011; Updated with references from the Spinal Cord Injury population by Candy Tefertiller, PT, DPT, ATP, NCS and Jennifer H. Kahn, PT, DPT, NCS and the SCIEDGE task force of the Neurology section of the APTA in 2012; Updated with references from the Traumatic Brain Injury population by the TBIEDGE task force of the Neurology section of the APTA in 2012; Updated by Kathleen Chizewski, SPT and Jessica Wierdak, SPT in 11/2012; Updated with references from the Parkinson's Disease population by Jeffrey Hoder, PT, DPT, NCS and the PD EDGE tast force of the Neurology section of the APTA in 2013. Updated by  Karen Lambert PT,",
    "textAfterTable": "HR HR HR StrokEDGE HR HR HR VEDGE LS LS LS   Recommendations Based on Parkinson Disease Hoehn and Yahr stage:   I",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}