{
    "relation": [
        [
            "Field",
            "Application Name",
            "Display Name"
        ],
        [
            "Description",
            "Enter a name to identify the application within WebCenter Spaces. The name must be unique (across all connection types) within the WebCenter application. For example: yahoo Note: Once registered, you cannot edit the Application Name.",
            "Enter a user friendly name for the application that WebCenter users will recognize. WebCenter end-users working with this external application will see the display name you specify here. The display name must be unique across all external applications within WebCenter Spaces. For example: My Yahoo If you leave this field blank, the Application Name is used."
        ]
    ],
    "pageTitle": "Configuring Services, Portlet Producers, and External Applications - 11g Release 1 (11.1.1.5.0)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E25054_01/webcenter.1111/e10149/config_svcs_prod_extapp.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74187303,
    "recordOffset": 74150034,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 20 Sep 2012 18:06:50 GMT",
    "textBeforeTable": "Table 6-22 External Application Connection - Name Enter a unique name for the external application and a display name that WebCenter users working with this external application will see. See also, Table 6-22. Description of \"Figure 6-12 Configuring External Application Connections\" Figure 6-12 Configuring External Application Connections External application options display (Figure 6-12). Description of \"Figure 6-11 Registering External Applications\" Figure 6-11 Registering External Applications To register a new external application, click Register (Figure 6-11). Under Services & Providers, select External Applications. Click Configuration, then Services. Open WebCenter Spaces Administration. For details, see Chapter 4, \"Accessing WebCenter Spaces Administration Pages.\" To register an external application for WebCenter Spaces: Application - Manage Configuration permission - Enables access to the WebCenter Administration page. AppConnectionManager role - Enables you to manage external applications. See also, \"Granting Application Roles Through Fusion Middleware Control\"",
    "textAfterTable": "Enter login details for the external application. For details, see Table 6-23. Table 6-23 External Application Connection - Login Details Field Description Enable Automatic Login Select to allow automatically log users in to this application. Choosing this option requires you to complete the Login URL, HTML User ID Field Name, and HTML User Password Field Name fields With automated single sign-on, the user directly links to the application and is authenticated automatically, as their credentials are retrieved from the credential store. Selecting this option provides the end user with a seamless single sign-on experience. Note: Automated login is not supported for: External applications using BASIC authentication. External applications configured for SSO. External applications with a customized login form (built using ADF Faces) that does not implement the J2EE security container login method j_security_check for authentication. External sites that do not support UTF8 encoding. Login URL Enter the login",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}