{
    "relation": [
        [
            "Patent application number",
            "20110048015",
            "20110302922",
            "20110304155",
            "20110314815",
            "20130118179"
        ],
        [
            "Description",
            "POWER PLANT WITH CO2 CAPTURE AND COMPRESSION - A power plant frequency response characteristic is implemented by controlling the power consumption of a CO",
            "POWER PLANT WITH CO2 CAPTURE - A method is provided for operating a combined cycle power plant including a CO",
            "POWER PLANT WITH CO2 CAPTURE AND COMPRESSION",
            "POWER PLANT WITH CO2 CAPTURE - A method is provided for operating a combined cycle power plant having at least one gas turbine, a heat recovery steam generator (HSRG), a steam turbine and a CO2 capture system. The method includes recirculating a first partial flow of flue gases from the HRSG. The method also includes capturing CO2 from a second partial flow of flue gases from the HRSG; and operating a supplementary firing to increase the net power output of the plant and to at least partly compensate the power consumption of the CO2 capture system. A combined cycle power plant is also provided. The plant includes at least one gas turbine, at least one heat recovery steam generator, at least one steam turbine at least one CO2 capture system, and flue gas recirculation. The plant also includes a low excess air supplementary firing.",
            "POWER PLANT WITH CO2 CAPTURE - A method is provided for operating a combined cycle power plant having at least one gas turbine, a heat recovery steam generator (HSRG), a steam turbine and a CO2 capture system. The method includes recirculating a first partial flow of flue gases from the HRSG. The method also includes capturing CO2 from a second partial flow of flue gases from the HRSG; and operating a supplementary firing to increase the net power output of the plant and to at least partly compensate the power consumption of the CO2 capture system. A combined cycle power plant is also provided. The plant includes at least one gas turbine, at least one heat recovery steam generator, at least one steam turbine at least one CO"
        ],
        [
            "Published",
            "03-03-2011",
            "12-15-2011",
            "12-15-2011",
            "12-29-2011",
            "05-16-2013"
        ]
    ],
    "pageTitle": "Nagel, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/nagel-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435803483,
    "recordOffset": 435766457,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Holger Nagel, Stuttgart DE 03-05-2015 METHOD FOR PRODUCING A SOLAR CELL - The invention relates to a method for producing a solar cell having a substrate made of silicon, which substrate has a silicon oxide layer present on the surface of the substrate and an antireflection layer applied to the silicon oxide layer, which antireflection layer is deposited onto the dielectric passivation layer in a process chamber. According to the invention, in order to achieve a stability of corresponding solar cells or solar cell modules produced therefrom against a potential induced degradation (PID), the dielectric passivation layer is formed from the surface of the substrate in the process chamber by means of a plasma containing an oxidizing gas. 20150064835 12-06-2012 SOLAR CELL MODULE - The invention relates to a solar cell module comprising electrically interconnected solar cells with front and backs, a transparent first layer running along the front sides, which is covered on the front laterally by a transparent cover, as well as a second layer running along the backsides, which is covered at the back by a second cover. In order to prevent and/or minimize a potential-induced reduction to a large extent and/or obtain an improved stability vis-à-vis thermo-cycling, it is suggested that first layer consists of a first polymer material and the second layer consists of a second polymer material deviating from the first polymer material and the fact that specific resistance is larger p 20120305056 07-19-2012",
    "textAfterTable": "Holger Gerhard Nagel, Stuttgart DE Patent application number Description Published 20120216547 POWER PLANT FOR CO2 CAPTURE - An exemplary fossil fuel fired power plant is disclosed with minimum impact of the CO2 capture system on a power part of the plant. A power plant is disclosed which is ready for the retrofit of a CO2 capture plant, and a method is disclosed for retrofitting an existing plant into a power plant with CO2 capture. A power plant part is disclosed which can provide steam and power to operate CO2 capture system, and provide a CO2 capture system, which has the capacity to remove CO2 from flue gas flow of the power part, and of the additional power plant part. 08-30-2012 Ingo Nagel, Karlsbad DE Patent application number Description Published 20120117772 Device for working, in particular stamping and joining, of a work piece, and a working tool - An apparatus for working has an upper tool. A lower tool co-operates with the upper tool. The lower tool is arranged on a turntable of the apparatus. The turntable is pivotable from a loading position, in which the turntable is remote from the upper tool, to a working position, in which the lower tool is aligned with the co-operating upper tool. By a pivoting movement of the turntable, the work piece, inserted into the apparatus when the turntable is in the loading position,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}