{
    "relation": [
        [
            "Opponent nation",
            "Belgium",
            "Czechoslovakia",
            "Estonia",
            "Finland",
            "France",
            "Greece",
            "Netherlands",
            "Norway",
            "Sweden",
            "United States",
            "Total"
        ],
        [
            "Wins",
            "1",
            "1",
            "2",
            "1",
            "4",
            "1",
            "2",
            "0",
            "0",
            "6",
            "18"
        ],
        [
            "Losses",
            "1",
            "0",
            "0",
            "10",
            "0",
            "0",
            "0",
            "2",
            "4",
            "0",
            "17"
        ],
        [
            "Percent",
            ".500",
            "1.000",
            "1.000",
            ".091",
            "1.000",
            "1.000",
            "1.000",
            ".000",
            ".000",
            "1.000",
            ".514"
        ]
    ],
    "pageTitle": "Denmark at the 1920 Summer Olympics - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Denmark_at_the_1920_Summer_Olympics",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861042299,
    "recordOffset": 861011873,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{109248=A single rower represented Denmark in 1920. It was the nation's second appearance in the sport. Denmark's lone sculler placed second in his quarterfinal heat, not advancing to the semifinals., 128866=Three tennis players, one man and two women, competed for Denmark in 1920. It was the nation's second appearance in the sport. The team won no medals, but the mixed pair of Hansen and Tegner took fourth place after winning two matches to advance to the semifinals before losing there and in the bronze medal match., 106558=Four pentathletes represented Denmark in 1920. It was the nation's second appearance in the sport, having competed at both instances of the Olympic modern pentathlon., 149833=Ten wrestlers competed for Denmark in 1920. It was the nation's third appearance in the sport. All of the Danish wrestlers competed in Greco-Roman wrestling, with none participating in the freestyle competitions. Hansen was the only Dane to win a medal match, taking the heavyweight silver. Eriksen also won a bronze medal, after losing the silver medal match in the only weight class in which no bronze tournament was held. Frisenfeldt reached a silver medal final, while Torgensen reached a bronze match; both lost those matches., 10626=Denmark competed at the 1920 Summer Olympics in Antwerp, Belgium. 154 competitors, 150 men and 4 women, took part in 66 events in 14 sports.[1], 37272=12 boxers represented Denmark at the 1920 Games. It was the nation's second appearance in boxing. Three boxers advanced to the finals in their weight classes, but none was able to win a gold medal. The three silvers were Denmark's first Olympic boxing medals, and placed the nation in sixth for the boxing medal count in 1920., 70948=Six cyclists represented Denmark in 1920. It was the nation's second appearance in the sport. The road cycling team came in fourth in the team time trial, the closes the Danish cyclists had come to a medal in either Games to that point., 146427=Five weightlifters, one in each weight class, represented Denmark in 1920. It was the nation's second appearance in the sport, having competed in 1896 but not in 1900. Ejnar Jensen had the best result, placing fourth in the unlimited heavyweight class., 21419=18 athletes represented Denmark in 1920. It was the nation's fifth appearance in athletics, a sport in which Denmark had competed each time the country appeared at the Olympics. Henry Petersen took the country's only medal, a silver in the pole vault. This was Denmark's best ever result in athletics at the time, topping Ernst Schulz's bronze from 1900, and remains tied for best result through the 2008 Games., 98437=Forty-five gymnasts represented Denmark in 1920. It was the nation's fourth appearance in the sport. Denmark sent teams in two out of the three team events, but no individual all-around competitors. The Danish gymnasts took the gold medal in the free system and the silver medal in the Swedish system., 76949=Five divers, three men and two women, represented Denmark in 1920. It was the nation's debut appearance in the sport. Clausen took the nation's only diving medal of the Games, winning the gold in the women's 10 metre platform event., 82439=Eight fencers represented Denmark in 1920. It was the nation's fifth appearance in the sport—the most of any nation in 1920. The country's best individual result was Osiier's eighth-place finish in the foil, with the best team finish also coming in the foil with a fourth-place showing., 111107=Fifteen shooters represented Denmark in 1920. It was the nation's fifth appearance in the sport as well as the Olympics; Denmark was one of three nations (along with France and Great Britain) to have competed in each edition of the Olympic shooting events to that point. With a victory in the standing military rifle, Denmark took its first gold in shooting since 1900. Larsen and Madsen (both among the members of that five-man team) also added a silver medal each.}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "5 Did not advance  Ireland (GBR) L  De Smet (BEL) W Bye Welterweight August Suhr 9 Did not advance  Colberg (USA) L  Heuckelbach (NED) W Welterweight Ivan Schannong 02 !  Rawson (GBR) L  ",
    "textAfterTable": "Round of 16 5 5 .500 Quarterfinals 3 4 .429 Semifinals 3 0 1.000 Final 0 3 .000 Bronze match 0 0 – Total 12 12 .500 Cycling[edit] Main article: Cycling at the 1920 Summer Olympics Six cyclists represented Denmark in 1920. It was the nation's second appearance in the sport. The road cycling team came in fourth in the team time trial, the closes the Danish cyclists had come to a medal in either Games to that point. Road cycling[edit] Cyclist Event Final Result Rank Georg Claussen Time trial 5:02:12.2 20 Kristian Frisch Time trial 5:01:18.8 19 Johan Johansen Time trial 4:52:00.2 11 Johan Lundgren",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}