{
    "relation": [
        [
            "Condition:",
            "Size:",
            "Colours:"
        ],
        [
            "New without tags: A brand-new, unused and unworn item that is not in its original retail packaging or may be missing its original retail packaging materials (such as the original box or bag). The original tags may not be attached. For example, new shoes (with absolutely no signs of wear) that are no longer in their original box fall into this category. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "28mm/32mm",
            "Beige/Black/Lt Brown/Dk Brown"
        ],
        [
            "Style:",
            "Brand:",
            ""
        ],
        [
            "Hair Clip",
            "Yewig",
            ""
        ]
    ],
    "pageTitle": "10pcs/50pcs 28/32mm Hair Extension Snap Clips for Wig Weft 4Colours | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/10pcs-50pcs-28-32mm-Hair-Extension-Snap-Clips-for-Wig-Weft-4Colours-/131089851084?pt=UK_Women_s_Wigs&var=&hash=item1e859062cc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 411750011,
    "recordOffset": 411691504,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics moc.liamg@40pihsehtnixob :liamE 24778982)020( :enohP 國中 省东广 ,州广 000015 房603A层三第楼号1园业产网联互州广路普高区河天市州广 魁北阙 View all revisions Last updated on  05 Jun, 2015 10:17:02 BST  Seller assumes all responsibility for this listing. 131089851084 eBay item number: Postage and payments Description Report item - opens in a new window or tab Brown Black Blonde Hair Piece Snap Clips...",
    "textAfterTable": "boxintheship004 Visit my eBay Shop   Sign up for newsletter Search Shop Items On Sale Shop categories Shop home US Nail Art Hair Extensions Make Up Toy Car/Car Models-US Seller Watch Fashion Jewelry Hi-end Audiophile Cables Hifi UK Bikini,Swimsuit Nail Art Hair Extensions Make up Wall Stickers Watch Clothes & Accessories Women's Men's Adult Zone Shoes Home&Garden HD Canvas Print Nautical Decor Wall Stencils Camera Bag & Acces RC/Diecast Model Car Toys -BMW -Porsche -Lamborghini -Land Rover",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}