{
    "relation": [
        [
            "Patent application number",
            "20090086678",
            "20090175201",
            "20130242733",
            "20140112297"
        ],
        [
            "Description",
            "METHOD AND DEVICE FOR FEEDING BACK LINK PARAMETER CONFIGURATION RESULT - A method for feeding back a link parameter configuration result includes the following steps. After receiving a configuration request for at least one link parameter from the higher layer to the lower layer, a media independent handover layer instructs the lower layer to perform link parameter configuration, and the lower layer returns the configuration result for each link parameter to the media independent handover layer after the link parameter configuration completes; the media independent layer receives the configuration result for each link parameter, and feeds back the configuration result for each link parameter to the higher layer. The method overcomes the disadvantages in the prior art, and achieves the objective that the configuration results are fed back accurately when configuration requests to a plurality of link parameters is brought up simultaneously and the configuration of some parameters is successful, failed, or rejected, thereby enabling the higher layer to obtain the accurate configuration results for link parameters.",
            "METHOD AND APPARATUS FOR CONFIGURING LINK PARAMETER THRESHOLDS - A method and apparatus for configuring link parameter thresholds are provided. The method includes the following steps. An upper layer sends link parameter thresholds corresponding to different traffic types of a link type to an intermediate layer through a first threshold configuration request (",
            "SERVICE CONTROL METHOD AND SYSTEM, EVOLVED NODEB, AND PACKET DATA NETWORK GATEWAY - Embodiments of the present invention disclose a service control method and system, an evolved NodeB, and a packet data network gateway, to perform resource scheduling on a packet. The method provided in an embodiment of the present invention includes: receiving, by an evolved NodeB, a packet; determining, by the evolved NodeB, a service control policy corresponding to the packet according to correspondence between a service application type and a service control policy and a service application type corresponding to the packet; and performing, by the evolved NodeB, resource scheduling on the packet according to the service control policy corresponding to the packet. Embodiments of the present invention further include a service control system, an evolved NodeB, and a packet data network gateway.",
            "METHOD, USER EQUIPMENT, AND BASE STATION FOR CONTROLLING UPLINK APPLICATION LAYER SERVICE - The present invention provides a method, a user equipment, and a base station for controlling an uplink application layer service. The method includes: obtaining, by a user equipment, scheduling information of an uplink application layer service stream to be scheduled. The scheduling information includes service priority information, which corresponds to the uplink application layer service stream. Alternatively, the service priority information corresponds to a service type of the uplink application layer service stream. An uplink application layer service stream with a high service priority according to the service priority information is preferentially scheduled by the user equipment. The embodiments of the present invention implement control over application layer service streams."
        ],
        [
            "Published",
            "04-02-2009",
            "07-09-2009",
            "09-19-2013",
            "04-24-2014"
        ]
    ],
    "pageTitle": "Guo, Shenzhen - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/guo-shenzhen-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432200027,
    "recordOffset": 432143782,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Junxiang Guo, Shenzhen CN //]]> BarDraw('2537872',['Patent applications by Jingkui Guo, Shenzhen CN'],[[2,1,1]],['2008','2009','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2537872\" align=\"center\"></div> </div> <canvas id=\"bg2537872\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jingkui Guo, Shenzhen CN</p> <div class=\"bar2537872\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>04-14-2011</td> <td><a href=\"/patents/app/20110084023\">PORTABLE WATER PURIFIER AND METHOD OF PURIFYING WATER OF USING THE SAME</a> - A portable water purifier having a shell, a solar cell, a power storage system, a micro booster pump, and a membrane module. The solar cell is disposed on the shell. The power storage system, the micro booster pump, and the membrane module are disposed integratedly in the shell. The solar cell is connected to the power storage system and the combination thereof provides power for the micro booster pump. The micro booster pump is connected to the membrane module. A method of purifying water with the portable water purifier is also taught. The portable water purifier can produce instant safe, and healthy drinking water even when power supply is lacking.</td> <td>20110084023</td> <tr> </tr> <td>08-20-2009</td> <td><a href=\"/patents/app/20090206036\">METHOD FOR CLEANING RECLAIMED WATER REUSE DEVICE</a> - A method for cleaning a reclaimed water reuse device, the reclaimed water reuse device comprising a clean water supply device, a first aeration device, a backwash device and a membrane module, the method comprising detecting an operating signal of the clean water supply device; enabling the first aeration device or the backwash device according to the operating signal,",
    "textAfterTable": "Patent applications by Junxiang Guo, Shenzhen CN Lei Guo, Shenzhen CN Patent application number Description Published 20120284674 TOUCH CONTROL METHOD AND APPARATUS - Embodiments of the present disclosure disclose a touch control method and an apparatus. The method includes: entering, when it is detected that a user triggers a function control, a function state corresponding to the function control; detecting a touch control operation performed by the user on an operation object on a touch control panel; under the function state corresponding to the function control, performing corresponding processing on the operation object according to the touch control operation of the user. 11-08-2012 20140113686 METHOD AND APPARATUS FOR TERMINAL TO DETERMINE APPROACH OF OBJECT - Embodiments of the present invention provide a method and an apparatus for a terminal to determine whether an object is approaching, wherein the method includes: reading, by an infrared receiver, a first infrared intensity value when an infrared emitting diode does not work, and reading, by the infrared receiver, a second infrared intensity value when the infrared emitting diode works; obtaining a first difference value between the second infrared intensity value and the first infrared intensity value as an intensity value of a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}