{
    "relation": [
        [
            "Condition:",
            "Country of Manufacture:",
            "To Fit:"
        ],
        [
            "New: A brand-new, unused, unopened and undamaged item in original retail packaging (where packaging is applicable). If the item comes direct from a manufacturer, it may be delivered in non-retail packaging, such as a plain or unprinted box or plastic bag. See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Korea, Republic of",
            "Accessories only"
        ],
        [
            "Brand:",
            "MPN:",
            ""
        ],
        [
            "Ciesta",
            "CSP-001-M01",
            ""
        ]
    ],
    "pageTitle": "kk",
    "title": "",
    "url": "http://www.ebay.ie/itm/Ciesta-Flexible-Camera-Insert-Partition-Padded-Bag-Case-for-DSLR-SLR-Lens-Medium-/111249725711?pt=US_Camera_Cases_Bags&hash=item19e700190f",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00048-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424244775,
    "recordOffset": 424203191,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  19 Mar, 2014 08:23:00 GMT  Seller assumes all responsibility for this listing. 111249725711 eBay item number: Postage and payments Description Report item - opens in a new window or tab Learn more Pay with PayPal and you're fully protected. Coverage: 14 days money back, buyer pays return postage |  See details Any Returns:",
    "textAfterTable": "kk Ciesta Flexible Camera Insert Partition for DSLR SLR Lens Medium DESCRIPTION CIESTA is the meaning of taking a nap and the same meaning of a homonym of SIESTA in Spanish. It means a comfortable and a valuable existence feeling. Relax and Dream again with CIESTA. Since starting the canvas camera bag CSB1746 in 2006, CIESTA brand has achieved continued growth and development by making full use of time. CIESTA brand has known professional camera accessories made in Korea. CAMERA BODY JACKET / HALF CASE is a premium leather case for various cameras such as Leica M8/M9, X1, Olympus E-P3, E-PL3, Sony NEX-5N, NEX-7, Fujifilm X10, X-PRO1, Panasonic GX1, GF3, and etc. This leather jacket protects the camera and raises the dignity of the Camera. Ciesta brings you the best solution to carry your camera and lenses in your own handbag. Made of waterproof fabric, Ciesta CSP-001-M01 insert bag separates your camera body and lenses with",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}