{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6"
        ],
        [
            "RxCUI",
            "198240",
            "198240",
            "198240",
            "313195",
            "313195",
            "313195"
        ],
        [
            "RxNorm NAME",
            "tamoxifen citrate 10 MG Oral Tablet",
            "Tamoxifen 10 MG Oral Tablet",
            "tamoxifen 10 MG (as tamoxifen citrate 15.2 MG) Oral Tablet",
            "tamoxifen citrate 20 MG Oral Tablet",
            "Tamoxifen 20 MG Oral Tablet",
            "tamoxifen 20 MG (as tamoxifen citrate 30.4 MG) Oral Tablet"
        ],
        [
            "RxTTY",
            "PSN",
            "SCD",
            "SY",
            "PSN",
            "SCD",
            "SY"
        ]
    ],
    "pageTitle": "DailyMed - TAMOXIFEN CITRATE- tamoxifen citrate tablet, film coated",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?id=71052&dictionary=on",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00047-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62580699,
    "recordOffset": 62519441,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{150133=The second trial, the Royal Marsden Trial (RMT) was reported as an interim analysis. The RMT was begun in 1986 as a feasibility study of whether larger scale trials could be mounted. The trial was subsequently extended to a pilot trial to accrue additional participants to further assess the safety of tamoxifen. Twenty-four hundred and seventy-one women were entered between 1986 and 1996; they were selected on the basis of a family history of breast cancer. HRT was used in 40% of participants. In this trial, with a 70 month median follow-up, 34 and 36 breast cancers (8 noninvasive, 4 on each arm) were observed among women on tamoxifen and placebo, respectively. Patients in this trial were younger than those in the NSABP P-1 trial and may have been more likely to develop ER (-) tumors, which are unlikely to be reduced in number by tamoxifen therapy. Although women were selected on the basis of family history and were thought to have a high risk of breast cancer, few events occurred, reducing the statistical power of the study. These factors are potential reasons why the RMT may not have provided an adequate assessment of the effectiveness of tamoxifen in reducing the incidence of breast cancer., 243522=The Early Breast Cancer Trialists’ Collaborative Group (EBCTCG) conducted worldwide overviews of systemic adjuvant therapy for early breast cancer in 1985, 1990, and again in 1995. In 1998, 10 year outcome data were reported for 36,689 women in 55 randomized trials of adjuvant tamoxifen using doses of 20 to 40 mg/day for 1 to 5+ years. Twenty-five percent of patients received 1 year or less of trial treatment, 52% received 2 years, and 23% received about 5 years. Forty-eight percent of tumors were estrogen receptor (ER) positive (> 10 fmol/mg), 21% were ER poor (< 10 fmol/l), and 31% were ER unknown. Among 29,441 patients with ER positive or unknown breast cancer, 58% were entered into trials comparing tamoxifen to no adjuvant therapy and 42% were entered into trials comparing tamoxifen in combination with chemotherapy vs. the same chemotherapy alone. Among these patients, 54% had node positive disease and 46% had node negative disease., 24913=Tamoxifen citrate tablets USP, 20 mg (base) are white to off-white, round, biconvex, film-coated, unscored tablets debossed “93” and “782” and are supplied in bottles of 30, 100, 500, and 1000., 4297=Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088., 25127=Tamoxifen citrate tablets USP, 10 mg (base) are white, round, biconvex, film-coated, unscored tablets debossed “93” and “784” and are supplied in bottles of 60, 180, 500, and 1000., 151260=The first was the Italian Tamoxifen Prevention trial. In this trial women between the ages of 35 and 70, who had had a total hysterectomy, were randomized to receive 20 mg tamoxifen or matching placebo for 5 years. The primary endpoints were occurrence of, and death from, invasive breast cancer. Women without any specific risk factors for breast cancer were to be entered. Between 1992 and 1997, 5,408 women were randomized. Hormone Replacement Therapy (HRT) was used in 14% of participants. The trial closed in 1997 due to the large number of dropouts during the first year of treatment (26%). After 46 months of follow-up there were 22 breast cancers in women on placebo and 19 in women on tamoxifen. Although no decrease in breast cancer incidence was observed, there was a trend for reduction in breast cancer among women receiving protocol therapy for at least 1 year (19 placebo, 11 tamoxifen). The small numbers of participants along with the low level of risk in this otherwise healthy group precluded an adequate assessment of the effect of tamoxifen in reducing the incidence of breast cancer., 233463=The incidence of contralateral breast cancer is reduced in breast cancer patients (premenopausal and postmenopausal) receiving tamoxifen compared to placebo. Data on contralateral breast cancer are available from 32,422 out of 36,689 patients in the 1995 overview analysis of the Early Breast Cancer Trialists Collaborative Group (EBCTCG). In clinical trials with tamoxifen of 1 year or less, 2 years, and about 5 years duration, the proportional reductions in the incidence rate of contralateral breast cancer among women receiving tamoxifen were 13% (NS), 26% (2p = 0.004) and 47% (2p < 0.00001), with a significant trend favoring longer tamoxifen duration (2p = 0.008). The proportional reductions in the incidence of contralateral breast cancer were independent of age and ER status of the primary tumor. Treatment with about 5 years of tamoxifen reduced the annual incidence rate of contralateral breast cancer from 7.6 per 1,000 patients in the control group compared with 3.9 per 1,000 patients in the tamoxifen group., 24327=Jerusalem, 91010, Israel, 3749=Rev. C 8/2008, 230977=In this trial 1,804 women were randomized to receive either tamoxifen or placebo for 5 years: 902 women were randomized to tamoxifen citrate 10 mg tablets twice a day and 902 women were randomized to placebo. As of December 31, 1998, follow-up data were available for 1,798 women and the median duration of follow-up was 74 months., 5182=This Medication Guide is a summary of information about tamoxifen citrate tablets for women who use tamoxifen citrate tablets to lower their high chance of getting breast cancer or who have DCIS. If you want more information about tamoxifen citrate tablets, ask your doctor or pharmacist. They can give you information about tamoxifen citrate tablets that is written for health professionals. For more information about tamoxifen citrate tablets or breast cancer, call 1-888-838-2872., 213783=In this trial, 13,388 women of at least 35 years of age were randomized to receive either tamoxifen or placebo for five years. The median duration of treatment was 3.5 years. As of January 31, 1998, follow-up data is available for 13,114 women. Twenty-seven percent of women randomized to placebo (1,782) and 24% of women randomized to tamoxifen (1,596) completed 5 years of therapy. The demographic characteristics of women on the trial with follow-up data are shown in Table 2., 27450=In three single agent adjuvant studies in women, one 10 mg tamoxifen citrate tablet was administered two (ECOG and NATO) or three (Toronto) times a day for two years. In the NSABP B-14 adjuvant study in women with node-negative breast cancer, one 10 mg tamoxifen citrate tablet was given twice a day for at least 5 years. Results of the B-14 study suggest that continuation of therapy beyond five years does not provide additional benefit (see CLINICAL PHARMACOLOGY). In the EBCTCG 1995 overview, the reduction in recurrence and mortality was greater in those studies that used tamoxifen for about 5 years than in those that used tamoxifen for a shorter period of therapy. There was no indication that doses greater than 20 mg per day were more effective. Current data from clinical trials support 5 years of adjuvant tamoxifen therapy for patients with breast cancer., 24132=Rev. J 12/2009, 235570=In the EBCTCG 1995 overview, the reduction in recurrence and mortality was greater in those studies that used tamoxifen for about 5 years than in those that used tamoxifen for a shorter period of therapy., 138755=For women whose risk factors are not described in the above examples, the Gail Model is necessary to estimate absolute breast cancer risk. Health Care Professionals can obtain a Gail Model Risk Assessment Tool by dialing 1-888-838-2872., 237472=Three prospective studies (ECOG-1178, Toronto, NATO) using tamoxifen adjuvantly as a single agent demonstrated an improved disease-free survival following total mastectomy and axillary dissection for postmenopausal women with positive axillary nodes compared to placebo/no treatment controls. The NATO study also demonstrated an overall survival benefit.}",
    "textBeforeTable": "Number of versions: 6 TAMOXIFEN CITRATE- tamoxifen citrate tablet, film coated View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Teva Pharmaceuticals USA Inc (118234421) 02/21/2003 ANDA074858 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 1000 in 1 BOTTLE NDC:0093-0782-10 4",
    "textAfterTable": "RxNorm TAMOXIFEN CITRATE- tamoxifen citrate tablet, film coated RxCUI RxNorm NAME RxTTY 1 198240 tamoxifen citrate 10 MG Oral Tablet PSN 2 198240 Tamoxifen 10 MG Oral Tablet SCD 3 198240 tamoxifen 10 MG (as tamoxifen citrate 15.2 MG) Oral Tablet SY 4 313195 tamoxifen citrate 20 MG Oral Tablet PSN 5 313195 Tamoxifen 20 MG Oral Tablet SCD 6 313195 tamoxifen 20 MG (as tamoxifen citrate 30.4 MG) Oral Tablet SY Get Label RSS Feed for this Drug TAMOXIFEN CITRATE- tamoxifen citrate tablet, film coated To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=407a372d-4448-4d53-afd4-eb0e74bbc336 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}