{
    "relation": [
        [
            "Version",
            "7.x-1.x-dev",
            "6.x-1.x-dev"
        ],
        [
            "Download",
            "tar.gz (9.43 KB) | zip (10.36 KB)",
            "tar.gz (9.87 KB) | zip (10.71 KB)"
        ],
        [
            "Date",
            "2015-Mar-19",
            "2013-Oct-01"
        ]
    ],
    "pageTitle": "Module project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_module?page=13",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919709847,
    "recordOffset": 919676435,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 06:06:00 GMT",
    "textBeforeTable": "Recommended releases Downloads Entity Reference (rudimentary support) Menu (Drupal core) Taxonomy (Drupal core) The Drupal 7 version integrates with: Drupal 7 version For a good overview of what Hierarchical Select can do, look at this demo! Hierarchical Select has the ability to save the entire lineage of a selection or only the \"deepest\" selection. You can configure it to force the user to make a selection as deep as possible in the tree, or allow the user to select an item anywhere in the tree. Levels can be labeled, you can configure limit the number of items that can be selected, configure a title for the dropbox, choose a site-wide animation delay, and so on. You can even create new items and levels through Hierarchical Select! This module defines the \"hierarchical_select\" form element, which is a greatly enhanced way for letting the user select items in a hierarchy. Description September 4, 2007 at 10:43am Wim Leers on Posted by Hierarchical Select Categories: Actively maintained, Under active development, RDF, Syndication, Views ⋅",
    "textAfterTable": "Development releases Version Download Date 7.x-3.x-dev tar.gz (87.97 KB) | zip (106.02 KB) 2015-May-29 6.x-3.x-dev tar.gz (96.34 KB) | zip (116.26 KB) 2015-Jan-30 View all releases Read more about Hierarchical Select ⋅ Categories: Actively maintained, Under active development, Administration, Content, Content Construction Kit (CCK), Content Display, Fields, JavaScript Utilities, Performance and Scalability, Taxonomy, Utility, Views ImageCache Token Posted by pavel.karoukin on February 9, 2012 at 9:40pm This module provides additional tokens for image fields. For each image style available, a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}