{
    "relation": [
        [
            "Parameter",
            "res",
            "xpath",
            "bnamespace"
        ],
        [
            "Description",
            "XDBResource",
            "XPath to check",
            "Namespace to use"
        ]
    ],
    "pageTitle": "DBMS_XDBRESOURCE",
    "title": "",
    "url": "http://docs.oracle.com/cd/E11882_01/appdev.112/e25788/d_xdbresource.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 70253316,
    "recordOffset": 70236922,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 19 May 2015 17:53:22 GMT",
    "textBeforeTable": "Table 167-26 HASCHANGED Function Parameters Parameters RETURN BOOLEAN; namespace IN VARCHAR2) xpath IN VARCHAR2, res IN XDBResource, DBMS_XDBRESEROUCE.HASCHANGED (  Syntax  Given an XPath, this function determines whether the element or attribute represented by the XPath has changed. HASCHANGED Function       XDBResource res Description Parameter Table 167-25 HASAUTHORCHANGED Function Parameters Parameters RETURN BOOLEAN; res IN XDBResource) DBMS_XDBRESEROUCE.HASAUTHORCHANGED (  Syntax  This function returns TRUE if the author of the given resource has changed, FALSE otherwise. HASAUTHORCHANGED Function       XDBResource res Description Parameter Table 167-24 GETACL Function Parameters",
    "textAfterTable": "HASCHARACTERSETCHANGED Function This function returns TRUE if the character set of the given resource has changed, FALSE otherwise. Syntax  DBMS_XDBRESEROUCE.HASCHARACTERSETCHANGED ( res IN XDBResource) RETURN BOOLEAN; Parameters Table 167-27 HASCHARACTERSETCHANGED Function Parameters Parameter Description res XDBResource HASCOMMENTCHANGED Function This function returns TRUE if the comment of the given resource has changed, FALSE otherwise. Syntax  DBMS_XDBRESEROUCE.HASCOMMENTCHANGED ( res IN XDBResource) RETURN BOOLEAN; Parameters Table 167-28 HASCOMMENTCHANGED Function Parameters Parameter Description res XDBResource",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}