{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "Very save feeling.",
            "Students that like that small school feel.",
            "So many. One of the most famous in the area ... campus is home of the Green Bay Packers during training camp.",
            "New caf. Very good food.",
            "Housing improves as you become a higher level in school.",
            "Very focused on academics. 4 year graduation for all students.",
            "Visit campus and apply early."
        ]
    ],
    "pageTitle": "St. Norbert College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/St-Norbert-College/reviews?_escaped_fragment_=/show/21112",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989826.86/warc/CC-MAIN-20150728002309-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 901725135,
    "recordOffset": 901682965,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10757=Homecoming is something that all schools do, but St. Norbert's is especially awesome. With events like Scream Your Theme and Air Bands, the whole school gets excited. There are 2000 students, so it is easy for everyone to get involved., 156556=© 2015, Cappex.com, LLC, 113204=St. Norbert just got a new cafeteria spring 2012. It has many dining options. They also have a coffee shop in the library and a small convenience store and a sports lounge. There are also many places nearby that deliver., 133285=The cafeteria did is delicious most days. And Phil's is excellent when you are craving food at 8-10:30 when the cafeteria is closed., 22659=The professors are all very helpful and insightful. Though there are some classes I have taken that were not my favorite, I cannot say that I truly dreaded going to any class. I have learned so much since coming here, and believe that when I graduate in 2012, I will truly be ready for a career., 45335=There are always different things to do! Athletic events are always fun to attend, especially since we are the home the 2011 Division 3 hockey nation champions! For almost every sport students get in to the games for free with your I.D. card. There are also clubs to join, sororities and fraternities to join, campus entertainment (hypnotists, concerts, etc.) and meeting up with friends is always very easy to do because people are always looking for fun.}",
    "textBeforeTable": "05/01/2012 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 33 Katie from Green Bay, WI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Tips for prospective students If you are looking for a small campus with friendly people, St Norbert is a great school for you. In three sentences The faculty at St Norbert are friendly, knowledgeable, and very helpful. The campus is always beautiful. Here at St Norbert we students have a strong sense of community. Login to rate or flag the reviews Domonique from Milwaukee, WI 01/11/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 33 Categories Comments Great for these types of students Those looking for a small school, capable of being close to your teachers and knowing all of your peers. Friendly faces are never hiding, and help is always there. Tips for prospective students Get your scholarships and just come to St. Norbert's. :) Bang for the buck This is a private school so of course it's a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}