{
    "relation": [
        [
            "Payment method",
            "",
            "Cash on pickup"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Vintage 1950s NEW OLD Stock Ladies Gemex Watch Band | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Vintage-1950s-New-Old-Stock-Ladies-Gemex-watch-band-/250763838384",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988051.33/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412574687,
    "recordOffset": 412525469,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at All return shipping will be paid by buyer except in the rare instance where grossly misrepresented by seller Return policy details The buyer is responsible for return postage costs. Money Back 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions Hi, Please pay with paypal within 5 days of purchase. If wanting a combined shipping discount please send me a message through e-bay messaging and I will send you a combined invoice in a timely fashion. Thank You for your purchase. At all times I strive to provide 5 star service and products. If at any time you do not feel that I deserve a full 5 star rating please contact me and give me a chance to improve this. Thanks! Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}