{
    "relation": [
        [
            "Alliaceae",
            "Apiaceae",
            "Asteraceae",
            "Boraginaceae",
            "Brassicaceae",
            "Caryophyllaceae"
        ],
        [
            "Chenopodiaceae",
            "Convolvulaceae",
            "Cyperaceae",
            "Ericaceae",
            "Euphorbiaceae",
            "Fabaceae"
        ],
        [
            "Juncaceae",
            "Lamiaceae",
            "Malvaceae",
            "Onagraceae",
            "Orobanchaceae",
            "Phrymaceae"
        ],
        [
            "Plantaginaceae",
            "Poaceae",
            "Polemoniaceae",
            "Polygonaceae",
            "Ranunculaceae",
            "Rhamnaceae"
        ],
        [
            "Rosaceae",
            "Saxifragaceae",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Sagehen Events",
    "title": "",
    "url": "http://sagehen.berkeley.edu/events.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 203894443,
    "recordOffset": 203871528,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Map and directions (286K). 11-30-02   Information Sheet (323K). 5-20-03}",
    "TableContextTimeStampAfterTable": "{12495=July 22, 8741=In 2004 we began a journey that took us from testing a theory designed to interrupt forest fire behavior, to managing a forest more holistically through a collaborative process. Our speaker series this summer will take us back through that journey by telling 6 different stories. More information | Flyer, 13169=August 12, 42326=Tuition:          $1200 Includes catered food and lodging at Sagehen Creek Field Station, instruction, field trip transportation, and course materials., 22882=1-week Adult Immersion Course: $1032.13*. Includes station accommodations, meals, course instruction, graduation certificate, registration with California Naturalist and website support. 2015 Syllabus and schedule | Registration form., 35146=Plants and Butterflies-iNaturalist Field Day at Sagehen with California Naturalist Janet Zipser Zipkin: 9am-1pm, Saturday, July 25th. Meet at the entrance gate to the Field Station at 9am. Email sagehen.programs@gmail.com to sign up., 4101=2004 | 2005 | 2006 | 2007 | 2008 | 2009 | 2010 | 2011 | 2012 | 2013 | 2014 | 2015, 12793=August 5, 12073=July 8, 33934=BioBlitz Pre-Event Practice Session: 10-1pm, Saturday, June 20th, Trip Leaders: Kaitlin Backlund and Reenie McMains-Meet at the Entrance gate at 10am. Not required for participating in the BioBlitz, but available for those who want the practice using iNaturalist.org or have technical questions. For more information or to register, go tohttp://sagehenbioblitz.eventbrite.com/, 17444=Time: Meet at Sagehen Creek Field Station at 9am Saturday, January 10 (directions on website). Closing is at 1:00 pm Sunday, January 11. Friday night lodging is available for a nominal extra fee. Contact the station to make arrangements., 10724=The station opens to the public at 4:30pm (2:30 for field trips). We invite you to come in and bring a picnic dinner. The talks begin at 6:00pm & run until around 8:00pm., 34419=Plants and Wildflowers-iNaturalist Field Day at Sagehen with California Naturalist Rick Ramos: 10-1pm, Saturday, June 27th, Meet at the entrance gate to the field Station at 10am. Email sagehen.programs@gmail.com to sign up., 36556=River restoration has become big business in the US, with well over $17b spent on over 40 thousand projects since 1990. Despite strong public support and the magnitude of the investment, the field has not advanced as quickly as one might expect, because learning through post-project evaluation is rare, and insights from current research are often not effectively incorporated in planning and design. River restoration can be more effective when it is designed with an understanding of processes and the larger context, when it benefits from systematic learning from previous built projects, and when it is based on predictive connections between objectives and actions., 33229=The goal of this citizen science project is to confirm the Field Station's plant and animal lists with actual, geo-referenced observations for use by the greater scientific community. So far, we have only documented 399 of 1366 taxa assumed to exist in the Basin. Using smart phones and cameras, volunteers accompanied by a California Naturalist will work together to find and identify as many different species as possible within Sagehen Creek Basin – everything from ants to Lodgepole Pines. Our observations will be recorded using iNaturalist.org., 34752=Sagehen BioBlitz: July 11-July 12. You bring your smart phone and tons of enthusiasm. We’ll rally some experts and folks who know the plants and animals of Sagehen Creek Basin. Together we’ll make some science! Registration required.http://sagehenbioblitz.eventbrite.com/, 11675=June 24}",
    "lastModified": "Tue, 21 Jul 2015 21:37:03 GMT",
    "textBeforeTable": "The following plant families will be covered, plus some others with similar characteristics: Tools available to help identify native plants Plant description terminology (Latin and Greek) How to use identification keys, focusing on the family keys in the Jepson Manual Tips to remembering the differences between similar plant families and species How to identify many tree and shrub species, as well as herbaceous species, by sight and using written dichotomous keys, focusing on characteristics that define plant families How to recognize at least 25 families of the most common/dominant/frequently encountered vascular plants found in California Participants will learn: Join the California Native Plant Society for this intensive introductory course on how to recognize plant families, focusing on the 25 dominant families of native plants found in California. Registration is now open and closes June 21! * * * Introduction to Plant Family Identification July 6-8, 2015 Dates: TBA Times: 3pm, Friday Night - Noon on Sunday Ages: All family members welcome, teens can be camp interns Cost: Includes overnight camping/cabin, science instruction and delicious meals for the entire family. Due to the hands on nature of this camp, participation is limited. We recommend that you sign",
    "textAfterTable": "More information, or to register. * * * Youth Fishing Camp July 11-12, 2015 \"Boys and Girls ages 9-11 are encouraged to apply for a chance at one of 15 spots. Cost is $150 to cover UC expenses, lodging and food. All equipment and instruction is being donated. To get more information or want to volunteer, contact Trout Unlimited: dlass@tu.org.\" Here's last year's flyer... Application. Press release. * * * iNaturalist BioBlitz at Sagehen July 11-12 & July 25, 2015 Join us for UC Berkeley Sagehen Creek Field Station's first BioBlitz as we celebrate the 50th Anniversary of the University of California Natural Reserve System (http://nrs.ucop.edu)!   Sagehen BioBlitz! Come help us document life in the Sagehen Creek Basin! The goal of this citizen science project is to confirm the Field Station's plant and animal lists with actual, geo-referenced observations for use by the greater scientific community. So far, we have only documented 399 of 1366 taxa assumed to exist in the Basin. Using smart phones and cameras, volunteers accompanied by a California Naturalist will work together to find and identify as many different species as possible within Sagehen Creek Basin – everything",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}