{
    "relation": [
        [
            "Renal Impairment (no. of patients)",
            "Healthy Volunteers GFR >80 mL/min/1.73 m2 (n=6)",
            "Mild Renal Impairment GFR 50 to 80 mL/min/1.73 m2 (n=6)",
            "Moderate Renal Impairment GFR 25 to 49 mL/min/1.73 m2 (n=6)",
            "Severe Renal Impairment GFR <25 mL/min/1.73 m2 (n=7)",
            "Hepatic Impairment (no. of patients)",
            "Healthy Volunteers (n=6)",
            "Alcoholic Cirrhosis (n=18)"
        ],
        [
            "Dose",
            "1 g",
            "1 g",
            "1 g",
            "1 g",
            "Dose",
            "1 g",
            "1 g"
        ],
        [
            "Tmax (h)",
            "0.75 (±0.27)",
            "0.75 (±0.27)",
            "0.75 (±0.27)",
            "1.00 (±0.41)",
            "Tmax (h)",
            "0.63 (±0.14)",
            "0.85 (±0.58)"
        ],
        [
            "Cmax (μg/mL)",
            "25.3 (±7.99)",
            "26.0 (±3.82)",
            "19.0 (±13.2)",
            "16.3 (±10.8)",
            "Cmax (μg/mL)",
            "24.3 (±5.73)",
            "22.4 (±10.1)"
        ],
        [
            "AUC (0-96h) (μg•h/mL)",
            "45.0 (±22.6)",
            "59.9 (±12.9)",
            "52.9 (±25.5)",
            "78.6 (±46.4)",
            "AUC (0-48h) (μg•h/mL)",
            "29.0 (±5.78)",
            "29.8 (±10.7)"
        ]
    ],
    "pageTitle": "DailyMed - MYCOPHENOLATE MOFETIL- mycophenolate mofetil tablet",
    "title": "Table 2 Pharmacokinetic Parameters for MPA [mean (±SD)] Following Single Doses of Mycophenolate Mofetil Capsules in Chronic Renal and Hepatic Impairment",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=9974ddc0-f47b-11dc-89a9-0002a5d5c51b",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 63438159,
    "recordOffset": 63376530,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{117216=In the National Transplantation Pregnancy Registry (NTPR), there were data on 33 MMF-exposed pregnancies in 24 transplant patients; there were 15 spontaneous abortions (45%) and 18 live-born infants.  Four of these 18 infants had structural malformations (22%).  In postmarketing data (collected 1995-2007) on 77 females exposed to systemic MMF during pregnancy, 25 had spontaneous abortions and 14 had a malformed infant or fetus.  Six of 14 malformed offspring had ear abnormalities.  Because these postmarketing data are reported voluntarily, it is not always possible to reliably estimate the frequency of particular adverse outcomes.  These malformations are similar to findings in animal reproductive toxicology studies.  For comparison, the background rate for congenital anomalies in the United States is about 3%, and NTPR data show a rate of 4-5% among babies born to organ transplant patients using other immunosuppressive drugs., 145029=In patients with delayed renal graft function posttransplant, mean MPA AUC0-12h was comparable, but MPAG AUC0-12h was 2-fold to 3-fold higher, compared to that seen in posttransplant patients without delayed renal graft function. In the three controlled studies of prevention of renal rejection, there were 298 of 1483 patients (20%) with delayed graft function. Although patients with delayed graft function have a higher incidence of certain adverse events (anemia, thrombocytopenia, hyperkalemia) than patients without delayed graft function, these events were not more frequent in patients receiving mycophenolate mofetil than azathioprine or placebo. No dose adjustment is recommended for these patients; however, they should be carefully observed (see CLINICAL PHARMACOLOGY: Pharmacokinetics and DOSAGE AND ADMINISTRATION)., 22746=© 2013 Endo Pharmaceuticals Inc.  All rights reserved, 34487=In acute oral toxicity studies, no deaths occurred in adult mice at doses up to 4000 mg/kg or in adult monkeys at doses up to 1000 mg/kg; these were the highest doses of mycophenolate mofetil tested in these species. These doses represent 11 times the recommended clinical dose in renal transplant patients and approximately 7 times the recommended clinical dose in cardiac transplant patients when corrected for BSA. In adult rats, deaths occurred after single-oral doses of 500 mg/kg of mycophenolate mofetil. The dose represents approximately 3 times the recommended clinical dose in cardiac transplant patients when corrected for BSA., 1108=Issued: August 2013, 22662=xxxxxxx/ August 2013, 60642=Patients receiving mycophenolate mofetil alone or as part of an immunosuppressive regimen are at increased risk of developing lymphomas and other malignancies, particularly of the skin (see WARNINGS: Lymphoma and Malignancy). The incidence of malignancies among the 1483 patients treated in controlled trials for the prevention of renal allograft rejection who were followed for ≥1 year was similar to the incidence reported in the literature for renal allograft recipients., 946=© 2013 Endo Pharmaceuticals Inc.  All rights reserved., 3587=Call your doctor for medical advice about side effects. You may report side effects to the FDA at 1800-FDA-1088 or to Endo Pharmaceuticals at 1-800-462-3636.}",
    "textBeforeTable": "Mean MPA AUC values following administration of 1 g bid intravenous mycophenolate mofetil over 2 hours to renal transplant patients for 5 days were about 24% higher than those observed after oral administration of a similar dose in the immediate posttransplant phase. In hepatic transplant patients, administration of 1 g bid intravenous mycophenolate mofetil followed by 1.5 g bid oral mycophenolate mofetil resulted in mean MPA AUC values similar to those found in renal transplant patients administered 1 g mycophenolate mofetil bid. Shown below are the mean (±SD) pharmacokinetic parameters for MPA following the administration of mycophenolate mofetil given as single doses to healthy volunteers and multiple doses to renal, cardiac, and hepatic transplant patients. In the early posttransplant period (<40 days posttransplant), renal, cardiac, and hepatic transplant patients had mean MPA AUCs approximately 20% to 41% lower and mean Cmax approximately 32% to 44% lower compared to the late transplant period (3 to 6 months posttransplant). Pharmacokinetics in Healthy Volunteers, Renal, Cardiac, and Hepatic Transplant Patients Mean (±SD) apparent half-life and plasma clearance of MPA are 17.9 (±6.5) hours and 193 (±48) mL/min following oral administration and 16.6 (±5.8) hours and 177 (±31) mL/min following intravenous administration, respectively. Negligible amount of drug is excreted as MPA (<1% of dose) in the urine. Orally administered radiolabeled mycophenolate mofetil resulted in complete recovery of the administered dose, with 93% of the administered dose recovered in the urine",
    "textAfterTable": " 0.90 (±0.24) (n=23)  24.1 (±12.1) (n=23)  65.3 (±35.4) (n=23) Cardiac Transplant Patients (bid dosing) Time After Transplantation Dose/Route Tmax (h) Cmax (μg/mL) Interdosing Interval AUC0-12h (μg•h/mL)  Early (Day before discharge)  1.5 g/oral  1.8 (±1.3) (n=11)  11.5 (±6.8) (n=11)  43.3 (±20.8) (n=9)  Late (>6 months)  1.5 g/oral  1.1 (±0.7) (n=52)  20.0 (±9.4) (n=52)  54.1a (±20.4) (n=49) Hepatic Transplant Patients (bid dosing) Time After Transplantation Dose/Route Tmax (h) Cmax (μg/mL) Interdosing Interval AUC0-12h (μg•h/mL)  4 to 9 days  1 g/iv  1.50 (±0.517) (n=22)  17.0 (±12.7) (n=22)  34.0 (±17.4) (n=22)",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}