{
    "relation": [
        [
            "Week",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Title[18]",
            "Dream Table",
            "19th Hole",
            "Hecklers",
            "World Champions",
            "Cowboys",
            "International",
            "Jam Up",
            "Gus & Ladies",
            "Love at First Raise",
            "Commentators"
        ],
        [
            "6th Place",
            "Mike Matusow",
            "David Oppenheim",
            "Mike Matusow",
            "Huck Seed",
            "Hoyt Corkins",
            "Daniel Negreanu",
            "Barry Greenstein",
            "J. J. Liu",
            "Erica Schoenberg",
            "Howard Lederer"
        ],
        [
            "5th Place",
            "Daniel Negreanu",
            "Erick Lindgren",
            "Sam Grizzle",
            "Chris Ferguson",
            "Doyle Brunson",
            "John Juanda",
            "Mike Matusow",
            "Gus Hansen",
            "Phil Laak",
            "Phil Gordon"
        ],
        [
            "4th Place",
            "Scotty Nguyen",
            "Daniel Negreanu",
            "Gavin Smith",
            "Berry Johnston",
            "Chau Giang",
            "Gus Hansen",
            "Eli Elezra",
            "Erica Schoenberg",
            "Jennifer Harman",
            "Robert Williamson III"
        ],
        [
            "3rd Place",
            "Ken Light",
            "Doyle Brunson",
            "Jean-Robert Bellande",
            "Jamie Gold",
            "Chris Ferguson",
            "Roland De Wolfe",
            "Howard Lederer",
            "Beth Shak",
            "Jennifer Tilly",
            "Chad Brown"
        ],
        [
            "Runner-Up",
            "Jennifer Harman",
            "Phil Ivey",
            "Shawn Sheikhan",
            "Phil Hellmuth",
            "Andy Bloch",
            "Patrik Antonius",
            "Antonio Esfandiari",
            "Clonie Gowen",
            "Marco Traniello",
            "Ali Nejad"
        ],
        [
            "Winner",
            "Phil Hellmuth",
            "Gavin Smith",
            "Phil Hellmuth",
            "Johnny Chan",
            "Gabe Kaplan",
            "Johnny Chan",
            "David Williams",
            "Vanessa Rousso",
            "David Benyamine",
            "Mark Gregorich"
        ]
    ],
    "pageTitle": "Poker After Dark - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Poker_After_Dark",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00251-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 861111931,
    "recordOffset": 861074765,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41895=Season 3 was taped in October 2007 at the South Point Casino in Las Vegas.[16], 33929=Season 2 was taped in May 2007 at the South Point Casino in Las Vegas.[16], 16828=Eventually, repeats of the series began to air in late time slots on the NBC Sports Network with that network's January 2012 rebranding., 57340=Most of Season 5 was taped December 19–21, 2008 at the Golden Nugget Las Vegas. The season's first three weeks include episodes originally announced as Season 4 episodes and were taped at South Point.[19][20], 5348=The program returned to American television over the NBC Sports Network on March 5, 2012 with previously aired repeats,[6] with unaired episodes from season 7 airing for the first time beginning June 4, 2012.[7] NBCSN schedules the show on weeknights at midnight, although the start time varies due to overruns by sporting events., 50260=Season 4 was taped in April 2008 at the South Point Casino in Las Vegas.[9] Season 4 episode titles and presumed seating order taken from NBC's Web site.[18], 14841=NBC abruptly stopped airing Poker After Dark on September 23, 2011,[11] a few days after Preet Bharara, the U.S. Attorney for the Southern District of New York, issued a statement alleging production underwriter Full Tilt Poker had perpetrated a Ponzi scheme on its customers. Replacing the show was a rebroadcast of the Hoda Kotb/Kathie Lee Gifford-hosted fourth hour of Today, and on the weekends, a second episode of In Wine Country from San Francisco Bay Area NBC station KNTV. NBC Sports has since removed their poker section entirely from their webpage, and previous episodes have been removed from Hulu. Although NBC did not issue a definitive statement regarding the schedule change or the future of the show, NBC Sports Senior Director of Communications Adam Freifeld has stated that NBC will \"continue to evaluate our poker programming.\"[12], 3692=Poker After Dark is an hour-long poker television program on NBC.[2] The show made its debut on January 1, 2007,[1] and was cancelled on September 23, 2011 following the \"Black Friday\" criminal case, which involved major sponsor Full Tilt Poker as one of the defendants.[3] For its first two seasons, both of which originally aired in 2007, the show was presented by Shana Hiatt.[4] The host for season 3 was Marianela Pereyra, and Leeann Tweeden took over starting with season 4.[5] All seasons have contained voice-over commentary by Oliver \"Ali\" Nejad., 12817=Poker After Dark aired six times a week, at 2:05 a.m. ET (1:05 CT) Tuesday through Saturday, and then at 1:00 a.m. ET (12:00 CT) on Sundays, though times vary according to the preferences of the affiliates.[10] The early Sunday show is a \"director's cut\" weekly summary of the previous week's shows., 19331=In France Poker After Dark airs at night on RTL9. In Germany, it airs on SPORT1, with commentary provided by Michael Körner.[13] In Ireland, Poker After Dark airs on Setanta Ireland and Setanta Sports 1[14] on most weeknights with little change from the US version. In The Netherlands, it airs on Veronica; episodes feature the original English commentary with Dutch subtitles.[citation needed] In Sweden, Poker After Dark airs on afternoons and nights on TV4 Sport[citation needed] and on TV 10 weekday nights at 01:30.[citation needed] In Denmark, it airs at night on TV3+.[citation needed] In Italy, Poker After Dark airs at night on POKERItalia24. In Poland, Poker After Dark airs during evenings on Sportklub and Sport Klub+; commentary is provided by Paweł Majewski and Marcin Grzywacz.[citation needed]. In Russia, the show airs on 7TV at 11:30pm every day until the Febral, and now shows on REN-TV at 3:00 pm., 18732=In Canada Poker After Dark aired afternoons and late nights on Rogers Sportsnet and, since fall 2009 on the French network V.[citation needed], 13652=Several NBC affiliates, most notably those owned by Post-Newsweek Stations, Barrington Broadcasting, some Raycom Media stations, WBBH-TV in Fort Myers, Florida, and the LDS Church-owned KSL-TV in Salt Lake City refused to air the show due to management or locality objections against programs featuring gambling (the Post-Newsweek stations also refused to carry Face the Ace in August 2009), while other stations did not carry it due to existing syndication contracts precluding it from airing the series or to retain control of their overnight schedules., 70267=Season 6 was taped in October 2009 at the Golden Nugget Las Vegas and is scheduled to have 13 weeks of episodes.[21], 112793=As of April 9, 2011, 2 of the 4 weeks aired from season 6 were cash games, and are omitted from the results table.}",
    "lastModified": "Sat, 01 Aug 2015 10:07:28 GMT",
    "textBeforeTable": "Season 1 (2007)[edit] Episode list[edit] Full Tilt Poker regularly advertised during Poker After Dark broadcasts and in some countries,[specify] Full Tilt Poker is included in the show's title, which for a time prompted players associated with a rival site (Poker Stars) to stop appearing on the show. Full Tilt Poker held promotional tournaments that offered a seat on the show as the grand prize. The first of these winners, Ken Light, appeared in the first week of Season 3, and was said[who?] to have picked his own opponents, though Light later said on the show itself that he was only asked to provide a list of his favorite players and that he did not know that players from the list would join him on the show.[4] Sponsorship[edit] In the U.S., the show had some early ratings success: during season one's second week, it attracted on average a larger audience among adults 18-34 than The Late Late Show with Craig Ferguson did the same week,",
    "textAfterTable": "Apr 16-21 Loose Lips Mike Matusow Allen Cunningham David Benyamine Barry Greenstein Shawn Sheikhan John Juanda 10 55-60 May 14–19 Ladies' Week Clonie Gowen Evelyn Ng Dee Luong Vanessa Rousso Jennifer Harman Cyndy Violette Season 2 (2007)[edit] Season 2 was taped in May 2007 at the South Point Casino in Las Vegas.[16] Week Episodes Original Airdates[17] Title[16] Seat 1 Seat 2 Seat 3 Seat 4 Seat 5 Seat 6 1 1-6 Jun 11-16 Golden Men Jamie Gold Joe Hachem Greg Raymer Huck Seed Doyle Brunson Johnny Chan 2 7-12 Jun 18-23 International Gus Hansen David Benyamine Patrik Antonius Daniel Negreanu Marco Traniello Brad Booth 3 13-18 Jun 25-30 Queens and Kings Gabe Kaplan Howard Lederer Ali Nejad Vanessa Rousso",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}