{
    "relation": [
        [
            "",
            "13-17",
            "18-24",
            "25-34",
            "35-44",
            "45-54",
            "55-64",
            "65+"
        ],
        [
            "April 2011",
            "355.600",
            "1.244.820",
            "1.208.140",
            "547.060",
            "284.600",
            "135.260",
            "128.940"
        ],
        [
            "May 2011",
            "348.320",
            "1.188.020",
            "1.158.100",
            "543.500",
            "286.960",
            "139.360",
            "132.920"
        ],
        [
            "June 2011",
            "340.780",
            "1.186.080",
            "1.162.540",
            "560.860",
            "299.380",
            "146.340",
            "140.060"
        ],
        [
            "July 2011",
            "360.360",
            "1.278.400",
            "1.242.300",
            "591.200",
            "313.660",
            "152.500",
            "156.860"
        ]
    ],
    "pageTitle": "750 Million Facebook Users worldwide, 4.1 million in South Africa | Social Media Blog",
    "title": "",
    "url": "http://www.socialmedialogue.com/750-million-facebook-users-worldwide-4-million-in-south-africa/646/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00103-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 720382943,
    "recordOffset": 720371416,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6220=Compared to May 2011:, 33939=Copyright © 2015 Social Media Blog, 4753=In May 2011, Facebook “only” counted 3.797.180 users in South Africa. But this doesn’t mean that FB users deleted their accounts. If we talk of “users” we always mean “active users” who logged in to Facebook at least once within the last 30 days. We don’t know the exact reason why in May 100.000 less users logged in than in April. Most probably people in South Africa rather enjoyed the last warm days at the beach and on their surfboard than spending their time surfing on the web 😉, 5650=User numbers increased by almost 300.000 over the May-July period, pushing the country’s total user base to 4.095.280.}",
    "textBeforeTable": "In numbers: Compared to May 2011: The following chart lists the demographic distribution of active Facebook users in South Africa: User numbers increased by almost 300.000 over the May-July period, pushing the country’s total user base to 4.095.280. But finally we can tell that Facebook South Africa has more than 4 million active users: In May 2011, Facebook “only” counted 3.797.180 users in South Africa. But this doesn’t mean that FB users deleted their accounts. If we talk of “users” we always mean “active users” who logged in to Facebook at least once within the last 30 days. We don’t know the exact reason why in May 100.000 less users logged in than in April. Most probably people in South Africa rather enjoyed the last warm days at the beach and on their surfboard than spending their time surfing on the web 😉 3 month ago we announced that Facebook will soon hit the 4 million user mark in South Africa. At that moment Facebook had 3.904.420 active South African users. But it took longer than expected as you can see in the chart below.",
    "textAfterTable": "An here is another interesting news: Worldwide, Facebook now has more than 750.000.000 users, CEO Mark Zuckerberg said yesterday during a product release event (via). What people are looking for: south african girls on facebook | South africa girls facebook id | south african girls facebook id | fb babes south africa | african grls fb acc | south afrika girl fb com | south african girls face book id | South african Facebook user names | South africa in girls fb | south africa girls facebook ides |  Related posts: Facebook Statistics South Africa – 4 million Users in April 2011 South Africa: Rapid Growth in Facebook Users Facebook Usage in South Africa – March",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}