{
    "relation": [
        [
            "Attribute",
            "orclmaxfiltsize",
            "orclrefreshdgrmems",
            "orclautocatalog",
            "orclrienabled",
            "orclstatsdn",
            "orcldataprivacymode",
            "orclencryptedattributes",
            "orclhashedattributes",
            "orclpkimatchingrule",
            "orclgeneratechangelog",
            "orcljvmoptions",
            "orclinmemfiltprocess",
            "orclmatchdnenabled",
            "orclskewedattribute",
            "orclskiprefinsql",
            "orcltlimitmode",
            "orclecacheenabled",
            "orclecachemaxentries",
            "orclecachemaxsize",
            "orclrscacheattr",
            "orclenablegroupcache"
        ],
        [
            "Description",
            "Maximum Filter Size See Section 9.2.2, \"Configuring Shared Properties.\"",
            "Refresh Dynamic Group Memberships. See Chapter 14.",
            "Index attributes on first search. See Section 20.1.3.4, \"About Indexing Attributes.\"",
            "Referential Integrity. See Chapter 21.",
            "User DNs for statistics collection. See Chapter 24.",
            "Sensitive attributes encrypted when returned See Chapter 27.",
            "Sensitive attributes stored in encrypted format. See Chapter 27.",
            "Attributes stored in hashed format. See Chapter 27.",
            "PKI Matching Rule for mapping user's PKI certificate DN to the user's entry DN. See Chapter 32.",
            "Whether to generate change logs for user operations. See Chapter 42 and the Oracle Internet Directory chapter of Oracle Fusion Middleware Performance and Tuning Guide",
            "Options passed to the JVM when a server plug-in is invoked. See Chapter 44.",
            "Search Filters to be processed in memory See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Whether to provide detailed MatchDN information when base DN of a search is not present. See the Oracle Internet Directory chapter of Oracle Fusion Middleware Performance and Tuning Guide",
            "Skewed attributes. Server restart recommended after changing. See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Skip referral for search. Server restart recommended after changing. See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Specify search time limit mode to be either accurate or approximate. See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Enable Entry Cache. See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Maximum Entries in Entry Cache. See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Entry Cache Size in bytes. See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Result Set Cache Attributes See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide.",
            "Enable/Disable Group cache See the Oracle Internet Directory chapter in Oracle Fusion Middleware Performance and Tuning Guide."
        ],
        [
            "Update Mechanism",
            "EM, LDAP",
            "LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "LDAP",
            "LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "EM, LDAP",
            "LDAP",
            "EM, LDAP, WLST",
            "EM, LDAP, WLST",
            "EM, LDAP, WLST",
            "EM, LDAP, WLST",
            "LDAP"
        ],
        [
            "Default",
            "24576",
            "0",
            "1",
            "0",
            "Empty",
            "0",
            "See Table 27-1.",
            "Empty",
            "2",
            "1",
            "-Xmx64M",
            "See list in Oracle Fusion Middleware Performance and Tuning Guide",
            "1",
            "objectclass",
            "0",
            "0",
            "1",
            "100000",
            "200000000 Bytes",
            "cn, mail, uid, orclguid",
            "1"
        ],
        [
            "Possible Values",
            "Integer",
            "Set to 1 to cause a refresh. Server will reset it to 0.",
            "0: Disabled 1: Enabled",
            "0: Disabled 1: Enabled",
            "DNs of entries",
            "0: Disabled 1: Enabled",
            "Attributes",
            "Attributes",
            "0: Exact match. 1: Certificate search. 2: Combination of 0 and 1. 3: Mapping rule only. 4: Try in order: 3, 2",
            "1: enable 0: disable",
            "Valid JVM options",
            "Valid search filters",
            "0: Do not match 1: Match",
            "List of attributes",
            "0: Disabled 1: Enabled",
            "0: Accurate 1: Approximate",
            "1: Enable, 0: Disable",
            "Integer",
            "Size_t (can be specified using K, M, or G as Kilo, Mega and Giga bytes respectively). For example, 200M is a valid value.",
            "Comma-separated list of attributes. Typically these attributes are not modified for the life of the entry.",
            "1 Enable, 0 Disable"
        ]
    ],
    "pageTitle": "Managing System Configuration Attributes",
    "title": "",
    "url": "http://docs.oracle.com/cd/E23943_01/admin.1111/e10029/oid_oper_attr.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00286-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 74834239,
    "recordOffset": 74812219,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1236=Integer, up to 1024., 29285=1024}",
    "lastModified": "Wed, 13 May 2015 05:21:34 GMT",
    "textBeforeTable": "Table 9-2 Attributes in the DSA Configuration Entry DSA is an X.500 term for the directory server. Note: LDAP–LDAP command-line tools, such as ldapmodify and ldapadd. See Section 9.4, \"Managing System Configuration Attributes by Using LDAP Tools.\" EM – Oracle Enterprise Manager Fusion Middleware Control. See Section 9.2, \"Managing System Configuration Attributes by Using Fusion Middleware Control.\" Table 9-2 shows shared attributes in the DSA configuration entry. The Update Mechanism column contains the following abbreviations: cn=dsaconfig,cn=configsets,cn=oracle internet directory  The DSA configuration entry has the DN: 9.1.4 Attributes of the DSA Configuration Entry       0: Generate stack trace file. 1: Do not generate stack trace file, but generate a core file. 0 LDAP Generate stack dump. See Appendix S. orclsdumpflag Integer (seconds) 3600 EM, LDAP, WLST Maximum time that server can spend for a given ldapsearch operation orcltimelimit Integer",
    "textAfterTable": "9.1.5 Attributes of the DSE The DSA-specific entry (DSE) is the root of the DIT. This is where Oracle Internet Directory publishes information about itself, such as naming contexts, supported controls, and matching rules. Most attributes of the DSE should not be modified directly. Some attributes that you might need to modify are listed in Table 9-3. Table 9-3 Attributes of the DSE Attribute Description Update Mechanism Default Possible Values namingcontexts Naming contexts. See Chapter 11. LDAP c=us dc=com Any valid naming context. ref Referral specification. See Chapter 19. LDAP     orclaci Access control at the root DSE level. See Chapter 29. LDAP    ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}