{
    "relation": [
        [
            "",
            "Chest",
            "Neck",
            "Sleeve",
            "Waist"
        ],
        [
            "S",
            "36 - 38in (91.4 - 96.5cm)",
            "15 - 15.5in (38.1 - 39.4cm)",
            "33in (83.8cm)",
            "29 - 30in (73.7 - 76.2cm)"
        ],
        [
            "M",
            "39 - 41in (99.1 - 104.1cm)",
            "15.5 - 16in (39.4 - 40.6cm)",
            "34in (86.4cm)",
            "31 - 33in (78.7 - 83.8cm)"
        ],
        [
            "L",
            "42 - 45in (106.7 - 114.3cm)",
            "16.5 - 17in (41.9 - 43.2cm)",
            "35in (88.9cm)",
            "34 - 36in (86.4 - 91.4cm)"
        ],
        [
            "XL",
            "46 - 48in (116.8 - 121.9cm)",
            "17 - 17.5in (43.2 - 44.5cm)",
            "36in (91.4cm)",
            "38in (96.5cm)"
        ],
        [
            "XXL",
            "49 - 51in (124.5 - 129.5cm)",
            "17.5 - 18in (44.5 - 45.7cm)",
            "37in (94cm)",
            "40 - 42in (101.6 - 106.7cm)"
        ]
    ],
    "pageTitle": "Endurance Conspiracy EC Bomber T-Shirt | Competitive Cyclist",
    "title": "Men's Apparel",
    "url": "http://www.competitivecyclist.com/endurance-conspiracy-ec-bomber-t-shirt-short-sleeve-mens?ti=UExQIEJyYW5kOjoxOjY",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987174.71/warc/CC-MAIN-20150728002307-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363464835,
    "recordOffset": 363425668,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Endurance Conspiracy Size chart 90 days Manufacturer Warranty: coffee casual Recommended Use: no Antimicrobial: no Thumbholes: waist Length: casual Fit: 100% organic cotton Material: Tech Specs The Endurance Conspiracy Men’s EC Bomber T-Shirt is available in sizes S through XL and comes in Grass Stain and Lava. All Endurance Conspiracy T-Shirts are made with 100% organic cotton and adhere to Bluesign resource productivity, consumer safety, air emission, water emission, and occupational health and safety standards. You could be arrested just for wearing this shirt. The Endurance Conspiracy EC Bomber T-shirt is just that fast... Endurance Conspiracy is owned and managed by passionate endurance athletes who are in it for much more than a quick buck. EC is a company that has been built around the idea of an outdoor",
    "textAfterTable": "How To Measure: For best results, take measurements over your underwear. Chest: Measure under your arms, around the fullest part of your chest. Neck: Measure around the base of your neck. Sleeve: Have someone measure from the center of the back or your neck down the arm, with arm slightly bent, to the wrist bone. Waist: Bend to the side and measure around the place where your waist bends, keeping the tape a bit loose. We recommend together Add to cart 100% Guaranteed Returns Free Shipping on orders over $50 Reviews & Community What do you think of the Endurance Conspiracy EC Bomber T-Shirt ? Share",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}