{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Occupation",
            "Aircraft and Avionics Equipment Mechanics and Technicians",
            "Automotive Service Technicians and Mechanics",
            "Diesel Service Technicians and Mechanics",
            "Industrial Machinery Mechanics and Maintenance Workers and Millwrights",
            "Small Engine Mechanics"
        ],
        [
            "Job Duties",
            "Aircraft and avionics equipment mechanics and technicians repair and perform scheduled maintenance on aircraft. They also may perform aircraft inspections as required by the Federal Aviation Administration (FAA).",
            "Automotive service technicians and mechanics, often called service technicians or service techs, inspect, maintain, and repair cars and light trucks.",
            "Diesel service technicians and mechanics inspect, repair, or overhaul buses, trucks, and anything else with a diesel engine.",
            "Industrial machinery mechanics and maintenance workers maintain and repair factory equipment and other industrial machinery, such as conveying systems, production machinery, and packaging equipment. Millwrights install, dismantle, repair, reassemble, and move machinery in factories, power plants, and construction sites.",
            "Small engine mechanics inspect, service, and repair motorized power equipment. Mechanics often specialize in one type of equipment, such as motorcycles, motorboats, or outdoor power equipment."
        ],
        [
            "ENTRY-LEVEL EDUCATION",
            "See How to Become One",
            "High school diploma or equivalent",
            "High school diploma or equivalent",
            "High school diploma or equivalent",
            "High school diploma or equivalent"
        ],
        [
            "2012 MEDIAN PAY",
            "$55,230",
            "$36,610",
            "$42,320",
            "$45,840",
            "$32,640"
        ]
    ],
    "pageTitle": "Heavy Vehicle and Mobile Equipment Service Technicians : Occupational Outlook Handbook: : U.S. Bureau of Labor Statistics",
    "title": "",
    "url": "http://www.bls.gov/ooh/Installation-Maintenance-and-Repair/Heavy-vehicle-and-mobile-equipment-service-technicians.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438043062635.98/warc/CC-MAIN-20150728002422-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 339772547,
    "recordOffset": 339747172,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11649=Percent change in employment, projected 2012-22, 13540=In May 2012, median annual wages for heavy vehicle and mobile equipment service technician occupations were as follows:, 18960=Median annual wages, May 2012, 6602=Employment of heavy vehicle and mobile equipment service technicians is projected to grow 9 percent from 2012 to 2022, about as fast as the average for all occupations.  , 13883=The median annual wage for heavy vehicle and mobile equipment service technicians was $43,820 in May 2012. The median wage is the wage at which half the workers in an occupation earned more than that amount and half earned less. The lowest 10 percent earned less than $27,730, and the top 10 percent earned more than $62,960., 33752=The median annual wage for heavy vehicle and mobile equipment service technicians was $43,820 in May 2012., 12704=Compared with workers in all occupations, heavy vehicle and mobile equipment service technicians had a higher percentage of workers who belonged to a union in 2012., 33552=Employment of heavy vehicle and mobile equipment service technicians is projected to grow 9 percent from 2012 to 2022, about as fast as the average for all occupations. Those with formal training should have very good job opportunities., 26079=Heavy vehicle and mobile equipment service technicians held about 176,300 jobs in 2012. Most technicians worked for private companies, but about 7 percent worked for state and local government. Industries employing the largest numbers of heavy vehicle and mobile equipment service technicians in 2012 were as follows:}",
    "TableContextTimeStampAfterTable": "{13536=The projected numeric change in employment from 2012 to 2022., 13041=The employment, or size, of this occupation in 2012, which is the base year of the 2012-22 employment projections., 8794=Publish Date: Wednesday, January 8, 2014, 20152=U.S. Bureau of Labor Statistics | Office of Occupational Statistics and Employment Projections, PSB Suite 2135, 2 Massachusetts Avenue, NE Washington, DC 20212-0001, 13281=The projected percent change in employment from 2012 to 2022. The average growth rate for all occupations is 11 percent., 11928=The wage at which half of the workers in the occupation earned more than that amount and half earned less. Median wage data are from the BLS Occupational Employment Statistics survey. In May 2012, the median annual wage for all workers was $34,750., 7986=Bureau of Labor Statistics, U.S. Department of Labor, Occupational Outlook Handbook, 2014-15 Edition, Heavy Vehicle and Mobile Equipment Service Technicians, on the Internet at http://www.bls.gov/ooh/installation-maintenance-and-repair/heavy-vehicle-and-mobile-equipment-service-technicians.htm (visited July 14, 2015).}",
    "textBeforeTable": "This table shows a list of occupations with job duties that are similar to those of heavy vehicle and mobile equipment service technicians. Similar Occupations About this section Similar Occupations -> <- Pay [XLS] 500 2 21,700 21,200 49-3043 Rail car repairers [XLS] 12,300 10 131,600 119,300 49-3042 Mobile heavy equipment mechanics, except engines [XLS] 3,400 10 39,200 35,800 49-3041 Farm equipment mechanics and service technicians [XLS] 16,200 9 192,500 176,300 49-3040 Heavy vehicle and mobile equipment service technicians and mechanics SOURCE: U.S. Bureau of Labor Statistics, Employment Projections program Numeric Percent Employment by Industry Change, 2012-22 Projected Employment, 2022 Employment, 2012 SOC Code Occupational Title",
    "textAfterTable": "<- Job Outlook More Info -> Contacts for More Information About this section For more details about job openings for heavy vehicle and mobile equipment service technicians, consult local heavy and mobile equipment dealers and distributors, construction contractors, and government agencies. Local offices of the state employment service also may have information on job openings and training programs. For general information about careers and training programs, visit Associated Equipment Distributors National Automotive Technicians Education Foundation National Institute for Automotive Service Excellence O*NET Mobile Heavy Equipment Mechanics, Except Engines Rail Car Repairers Farm Equipment Mechanics and Service Technicians <- Similar Occupations Suggested citation: Bureau of Labor Statistics, U.S. Department of Labor, Occupational Outlook Handbook, 2014-15 Edition, Heavy Vehicle and Mobile Equipment Service Technicians, on the Internet at http://www.bls.gov/ooh/installation-maintenance-and-repair/heavy-vehicle-and-mobile-equipment-service-technicians.htm (visited July 14, 2015).",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}