{
    "relation": [
        [
            "Region",
            "Western Himalayan Region",
            "Eastern Himalayan Region",
            "Western Plains Region",
            "Eastern Plains Region",
            "Central Region",
            "Southern Region"
        ],
        [
            "States",
            "J&K, HP, Punjab Hills (Area South & West of the Inter state Border between HP & Punjab and North and east of road of Mukerian, Hoshiarpur, Garhshankar, Ropar ) Garhwal & Kumaon regions of Uttranchal.",
            "Nagaland, Manipur, Tripura, Mizoram, Meghalaya , Assam , Arunachal Pradesh , Sikkim and Hill Region of West Bengal ( Darjeeling and Kalimpong Districts)",
            "Punjab, Haryana, Chandigarh , Delhi , Rajasthan and Western UP ( Meerut and Agra Division)",
            "Eastern UP, Bihar, West Bengal and Orissa",
            "Madhya Pradesh, Chattisgarh, Gujarat Maharashtra, Dadar, Nagar-Haveli, Daman and Diu",
            "Andhra Pradesh, Karnataka Tamil Nadu, Kerala, Goa And Pondicherry"
        ],
        [
            "Height (Cms)",
            "166 163*",
            "160 157*",
            "170",
            "169",
            "168 167*",
            "165"
        ],
        [
            "Weight (Kgs)",
            "48",
            "48",
            "50",
            "50",
            "50",
            "50"
        ],
        [
            "Chest (Cms)",
            "77",
            "77",
            "77",
            "77",
            "77",
            "77"
        ]
    ],
    "pageTitle": "(Exam Info) Indian Army Soldiers Clerk Examination | CBSE X, CBSE XII, JEE-MAIN, ICSE, Papers, Downloads",
    "title": "",
    "url": "http://www.cbseportal.com/exam/competitive-exams/Indian-Army-Soldiers-Clerk-Examination",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361171579,
    "recordOffset": 361148786,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10426=Eligible candidates will be required to appear for a written test. Common Entrance Examination (CEE) is conducted on 4th Sunday of Jan, Mar, May, Jul. Sep & Nov. for recruitment of Soldiers. It comprises of following two papers:}",
    "lastModified": "Sat, 01 Aug 2015 16:11:13 GMT",
    "textBeforeTable": "Region wise minimum physical standards are as follows - Physical Standards *** Dispensation of educational qualification as per the rules. Educational Qualification: 10+2/ Intermediate exam passed in Science with Physics, Chemistry, Maths and English.  No weightage for higher qualification. Age: 17½-23 Years  Nationality: Unmarried Indian male citizens (including those of Nepal) are eligible. Eligibility Criteria: Enrolment and Dispatch of selected candidates in order of merit to Centres. g Preparation of merit list. f Written examination. e Medical examination. d Physical fitness test. c Physical measurements. b Checking of documents. a Recruitment Procedure: Indian Army offer dignified, discipline and prestigious career. There are literally hundreds of diverse activities in the Indian Army. Accordingly, the nature of responsibilities also varies. The Indian Army consist various arms divisions and services. Among these clerk service is one. For the recruitment of clerks Indian Army conducts an exam namely Indian Army Soldier Clerk Exam.  The examination is held four times a year and is advertised in the Employment",
    "textAfterTable": "  Special Physical Standards   Region- States - category Height (Cms) Weight (kgs) Chest  (Cms) Ladakhi 157 50 77 Gorkhas both Nepalese and Indians 160 48 77 Andaman, Nicobar Islands, Lakshadweep Group including Minicoy : Settlers 165 50 77 Locals 155 50 77 Tribals of recognized  areas 162 48 77 Brigade of the Guards 173 50 77 Med Arty 170 50 77 Corps Military Police 173 50 77 *Clerks GD/SKT 162 50 77 Soldier Tradesmen:  Normal Physical Standards given above minus 2 Cms height, 1 cm Chest and 2 Kgs weight. *** Dispensation of physical standards as per the rules. Medical Standards A candidate should have robust physique and good mental health. Chest should be well developed having",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}