{
    "relation": [
        [
            "Add Subject - free, open Educational Software Tools",
            "Engrade",
            "Edmodo",
            "Mozilla Drumbeat",
            "Net Squared",
            "Social Media Classroom",
            ""
        ],
        [
            "Web Site",
            "http://www.engrade.com/",
            "http://www.edmodo.com/",
            "http://www.drumbeat.org",
            "http://www.netsquared.org/",
            "http://socialmediaclassroom.com/index.php/",
            "http://"
        ],
        [
            "Organization (if any)",
            "Engrade",
            "Edmodo",
            "Mozilla",
            "Net Squared",
            "Howard Rheingold",
            ""
        ],
        [
            "Degree / Non-degree",
            "Engrade is a free set of web-based tools for educators allowing them to manage their classes online while providing parents and students with 24/7 real-time online access. It's private, secure, truly free, and unbelievably easy to use with over 1.5 million users.",
            "Edmodo is a free and secure social learning network for teachers, students and schools. Edmodo provides classrooms a safe and easy way to connect and collaborate, offering a real-time platform to exchange ideas, share content, and access homework, grades and school notices. Accessible online and from any mobile device via free smart phone applications, Edmodo has grown from a teacher tool into a district-wide resource as word of the free online service spreads through schools around the world.",
            "Facilitates a better, more open internet by creating community around the world. It's a launch-pad and a playground – an open web hub that sits at the intersection of community, resources and funding.",
            "Share your ideas! Tools to share ideas on the web.",
            "Classroom and Collaboratory Software",
            ""
        ],
        [
            "Location",
            "All ages",
            "All ages",
            "All ages",
            "All ages",
            "All ages",
            "All ages"
        ],
        [
            "Other Info",
            "",
            "",
            "",
            "Remixing the web for social change",
            "",
            ""
        ],
        [
            "Language",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Tags",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Educational Software - World University",
    "title": "",
    "url": "http://worlduniversity.wikia.com/wiki/Educational_Software",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 77,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 259238523,
    "recordOffset": 259176783,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{279136=3D Learn. 2013. http://www.learningin3d.info/, 242297=ltjohhed. 2012. Free/Open Deduplication Software?. January 4. ask.slashdot.org., 282288=SmallWorlds. 2014. https://www.smallworlds.com/, 243382=MIT Media Lab. 2012. What I did on my summer vacation Or, The Media Lab at Aspen Ideas Festival 2012. San Franscisco, CA: Storify.com., 267219=Flyer seeking degree-oriented, WUaS students: 'Quaker-informed World University & School seeks friendly, undergraduate students for free, online, Greatest Universities-centric, bachelor’s degrees to apply in the autumn of 2013, for matriculation in autumn 2014' - http://scottmacleod.com/WUaSFriendsFlyerforProspectiveStudentApplicants.pdf - and accessible here, also - http://scottmacleod.com/WUaSNoticeArchive.html. WUaS holds open, electronically-mediated, hour-long, monthly business meeting on the second Saturdays at 9 am Pacific Time, in the manner of Quakers - email worlduniversityandschool@gmail.com if you'd like to participate., 256122=MediaWiki Administration and Development. 2012. MediaWiki Administration and Development: Administration and optimization of a MediaWiki installation. codelesson.com., 252592=Recording Skype calls for Free w/ Audacity. 2010. http://www.youtube.com/watch?v=XlPT7b-Hkuk (for interviews). YouTube., 252834=Monroy-Hernandez, Andres. 2012. Designing for Remixing: Computer-supported Social Creativity. Cambridge, MA: cyber.law.harvard.edu., 279291=Active Worlds Educational Universe (AWEDU). 2012. http://www.activeworlds.com, 231604=Wikipedia List of educational software. 2013. List of educational software. en.wikipedia.org/wiki/List_of_educational_software ., 244468=10 Free Screen Recording Softwares For Creating Attractive Screencasts. 2009. 10 Free Screen Recording Softwares For Creating Attractive Screencasts. (Windows, Mac). webresourcesdepot.com., 281314=Primary Games. 2013. http://www.primarygames.com/arcade/virtualworlds.php, 236637=Google Apps for Education. 2014. Google Apps for Education - Free email and collaboration tools for schools. Mountain View, CA: Google, Inc., 237805=TED Ed - Lessons Worth Sharing. 2012. TED Ed - Lessons Worth Sharing. (TED-Ed Website Tour - http://www.youtube.com/watch?v=JQDgE_eJGTM). TED Ed., 242548=Massive study on MOOCs. 2015. Massive study on MOOCs: Harvard, MIT report provides new insights on an evolving space. April 1. Cambridge, MA: news.harvard.edu/gazette/story/2015/04/massive-study-on-moocs/ ., 246687=Deeds, David. 2012. Best Practices Showcase: 3D Virtual Worlds in (K-12/International) Schools. March 13. slideshare.net., 240106=Alcock, Mike. 2015. Creating An Online Learning Platform From Scratch. April 3. elearningindustry.com/creating-online-learning-platform-scratch ., 251368=Binkley, Ken. 2010. Immune Attack Demo. Federation of American Scientists., 241784=Kolowich, Steve. 2013. With Open Platform, Stanford Seeks to Reclaim MOOC Brand. Palo Alto, Calif: Chronicle of Higher Education., 253908=Van Deusen-Scholl, Nelleke. 2014. Yale Center for Language Study Shared Course Initiative. (At the Online Education Open Forum held on February 24, 2014, Nelleke Van Deusen-School, Director of the Center for Language Study, shared the collaborative arrangement with Cornell and Columbia to share less commonly taught languages, offer several languages that are not otherwise taught on our campuses, via videoconferencing from a partner institution in the CLS Shared Course Initiative). New Haven, CT: Yale University., 280479=OpenSim. 2012. http://opensimulator.org/wiki/Main_Page (http://www.scribd.com/doc/57959626/OpenSimulator-School-Quick-Start-Guide), 255911=Khan Academy Knowledge Map. 2014. Khan Academy Knowledge Map. khanacademy.org/exercisedashboard ., 241467=Introducing the Learning Dashboard. 2014. Introducing the Learning Dashboard. khanacademy.org/about/blog/post/58354379257/introducing-the-learning-dashboard ., 235576=Audacity. 2011. http://audacity.sourceforge.net/ (Audacity is free, open source software for recording and editing sounds. It is available for Mac OS X, Microsoft Windows, GNU/Linux, and other operating systems)., 289556=List of Wikipedias. 2015. List of Wikipedias. meta.wikimedia.org/wiki/List_of_Wikipedias ., 252080=Hope, Alexis. 2015. FOLD, a new tool for storytelling. Cambridge, MA: vimeo.com/125113571 ., 279973=ISTE – SIGMS. 2013. http://sigms.iste.wikispaces.net/secondlifeplayground2010, 243133=MIT Center for Mobile Learning @ The Media Lab. 2012. MIT Center for Mobile Learning @ The Media Lab. Cambridge, MA: mitmobilelearning.org., 241203=Gerald, Olympia Shilpa. 2012. Village children take the Skype route to education. July 9. New Dehli, India: The Hindu., 281158=Open Wonderland. 2012. http://openwonderland.org/, 251867=Doherty, Paul. 2012. Exploratorium Tour - Part 1 of 5. San Francisco, CA: KirkwoodSLGroup., 236897=HTTPS Everywhere. 2014. HTTPS Everywhere. San Francisco, CA: eff.org/https-everywhere ., 296470=SDL Free Translation. 2015. SDL Free Translation. freetranslation.com/ ., 279612=Minecraft. 2012. www.minecraft.net, 280327=Open Cobalt. 2013. http://www.opencobalt.org/, 242904=MasterPatricko. 2011. OpenSUSE 12.1 Released. November 16. linux.slashdot.org., 296985=Amara.org. 2015. Amara.org: Captions, subtitles, and translations simplified. (Amara makes video globally accessible: Captions, subtitles, and translations simplified). amara.org/en/, 237363=MindTapCengage. 2011. My Favorite Textbook: The Next Generation. (Mindtap Learning Path digital learning application for Harvard Law Professor's Greg Mankiw's 'Macroeconomics' text book; Chris Vento, with Cheryl Lazar at TED Studios). June 6. Cambridge, MA: gregmankiw.blogspot.com, 237089=IBM Watson Developer Cloud. 2015. IBM Watson Developer Cloud. Armonk, NY: ibm.com/smarterplanet/us/en/ibmwatson/developercloud/ ., 296129=Free-translator.com. 2015. Free-translator.com. free-translator.com/ ., 295595=Babelxl. 2015. Babelxl: the best translator. http://babelxl.com/ ., 279476=Alice. 2012. http://www.alice.org/, 12722=Hendrik Jan Runhaar, 256444=Teach Your Technology. 2012. Teach Your Technology: Bring your technical expertise to the CodeLesson learning community. codelesson.com., 242058=Lifshits, Yury. 2011. 100+ Online Resources That Are Transforming Education. January 7. Mashable.com., 240402=Connell, Genia. 2012. My 35 Favorite Free Apps for Teaching. December 20. scholastic.com/teachers/top-teaching/2012/12/my-35-favorite-free-apps-teaching., 236154=Evernote. 2012. Evernote. (Remember everything and organize it. Capture anything. Access anywhere. Find things fast. See also Devon Think and Tinderbox - http://gigaom.com/apple/faceoff-devonthink-pro-office-vs-evernote-premium/). Evernote., 251565=Digital Scores - Top 10 technical advantages of having our music in MuseScore format. 2013. Digital Scores - Top 10 technical advantages of having our music in MuseScore format. Youtube.com., 295844=Babylon Online Translation. 2015. Babylon Online Translation. (Offering hundreds of dictionaries and translation in more than 800 language pairs). translation.babylon.com/ ., 280188=Kaneva. 2014. http://www.kaneva.com/, 231046=CNET Download Educational Software. 2013. http://download.cnet.com/windows/educational-software/ Educational Software]. download.cnet.com/windows/educational-software/., 283041=World of Warcraft in School. 2014. http://wowinschool.pbworks.com/w/page/5268731/FrontPage, 217981=Open Journal Systems. 2012. Open Journal Systems. Public Knowledge Project., 281520=Quest Atlantis. 2012. http://atlantisremixed.org/ (http://www.youtube.com/watch?v=SZoT3pilNPI)., 244145=timothy. 2012. Best Software For Putting Lectures Online? December 31. hardware.slashdot.org., 279663=Edusim. 2013. http://edusim3d.com/, 243657=Nesson, Charles. 2011. free to all. May 25. Cambridge, MA: blogs.law.harvard.edu/nesson., 235901=CNET Educational Software. 2014. CNET educational software download. SF, CA: download.cnet.com/mac/educational-software/ ., 280866=Open Croquet. 2012. http://c2.com/cgi/wiki?OpenCroquet and http://www.opencroquet.org/, 296307=Google Translate. 2015. Google Translate. translate.google.com/ ., 253373=Stegman, Melanie. 2011. ImmuneAttack SMHS Feb 2011. Federation of American Scientists., 296654=Word Lingo Free Translation Tools. 2015. Word Lingo Free Translation Tools and Machine Translation Products. worldlingo.com/en/products/ ., 253582=TED Ed - Lessons Worth Sharing. 2012. - TED-Ed Website Tour. (http://ed.ted.com/ TED Ed - Lessons Worth Sharing). TED Ed., 282766=Unity3D. 2012. http://unity3d.com/, 282900=WiloStar3D. 2013. https://www.wilostar3d.com/, 282432=There.com. 2014. http://www.there.com/, 243885=Quinnelly, Travis. 2009. 5 Free Screencasting Apps for Creating Video Tutorials. makeuseof.com., 244841=androidandosx. 2011. Top 5 Free Screen Recording Utilities for Mac OSX. (Mac) (Quicktime in MacOS Snowleopard, IShowU HD, Jing, CaptureMe, Copernicus)., 282572=Twinity. 2014. http://www.twinity.com/en/choose-your-free-avatar, 279798=Gifted Kids.ie. 2013. http://www.giftedkids.ie/daynuv.html, 252267=Pesenti, Jerome. 2014. Cognitive Computing: New Ways of Developing Software for a New Era of Computing (SATURN Keynote). Pittsburgh, PA: Software Engineering Institute | Carnegie Mellon University Youtube channel., 232467=Mizushima, Tsukasa. 2011. India Place Finder. Tokyo, Japan: Mizushima Lab at The University of Tokyo., 240725=Despres, Draxtor. 2014. the drax files radio hour (with jo yardley). Berlin, DE: draxfiles.com/2014/03/14/show-10-oculus/., 281829=SimScience. 2012. http://simscience.org/, 256688=Wi-Phi: open access philosophy. 2013. Wi-Phi: open access philosophy. New Haven, CT: wi-phi.com/., 297272=TED Open Translation Project. 2015. TED Open Translation Project. (See - https://www.ted.com/about/programs-initiatives/ted-open-translation-project - and - https://www.ted.com/participate/translate/get-started). ted.com/about/programs-initiatives/ted-open-translation-project ., 253115=Starner, Thad. 2013. Thad Starner on Singularity 1 on 1: Reduce the Time Between Intention and Action. Nikola Danaylov Youtube channel., 255718=Educational Freeware. 2013. Educational Freeware. educational-freeware.com/., 240975=Free e-Learning Resources. 2011. Free e-Learning Resources. blog.efrontlearning.net., 281972=Second Life - Harvard's virtual island. 2012. http://slurl.com/secondlife/Berkman/115/53/25 - and teach, learn and share ideas - in group voice chat, or in group type chat, and via building., 231349=Gizmo's Freeware Best Free Educational Software. 2013. Best Free Educational Software. techsupportalert.com/view/educational ., 300786=World University and School - like Wikipedia with Greatest Universities' OpenCourseWare - incorporated as a nonprofit effective April 2010 and is a 501(c)(3) tax-exempt, educational organization charity.}",
    "lastModified": "Fri, 08 May 2015 20:12:16 GMT",
    "textBeforeTable": "Astronomy Educational SoftwareEdit Educational softwareEdit [show] Contents Add great, free, open, educational software. Free, educational software. Welcome to World University which anyone can add to or edit. The Global, Virtual/Digital, Open, Free, {potentially Degree- and Credit-Granting}, Multilingual University & School where anyone can teach or take a class or course World University and School {in a virtual world} } document.write(' Advertisement",
    "textAfterTable": "Languages Tags Tweet Chat http://tweetchat.com/room/ocrsf Made by Twitter Twitter Chat room - helps put your blinders on to the Twitter-sphere while you monitor and chat about one topic. CitiesEdit Add Subject - free, open educational software Web Site Made by Other Info Level Languages Tags HyperCities http://hypercities.com/about/ Developed though collaboration between UCLA and USC HyperCities is a digital research and educational platform for exploring, learning about, and interacting with the layered histories of city and global spaces. English Environment Educational SoftwareEdit Add Subject - free, open educational software Web Site Made by Other Info Level Languages Tags Trout in the Classroom http://www.troutintheclassroom.org/ Trout in the Classroom (TIC) is an environmental education program in which students in grades k-12 . . . raise trout from eggs to fry; monitor tank water quality; engage in stream habitat study; learn to appreciate water resources;",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}