{
    "relation": [
        [
            "Date",
            "12/16/2004",
            "2/24/2005",
            "2/8/2011",
            "10/2/2001",
            "12/14/2004",
            "8/1/2002",
            "12/8/2003",
            "3/25/2003",
            "12/15/2004",
            "1/18/2005",
            "1/18/2007",
            "2/15/2002",
            "4/10/2003",
            "5/6/1994",
            "3/3/2004",
            "2/2/2005",
            "6/26/2006",
            "8/8/2008",
            "1/3/2013",
            "7/15/2013",
            "12/14/2004",
            "8/9/2002",
            "5/16/2007",
            "8/6/2004",
            "4/5/2004",
            "3/27/2006",
            "1/25/2011",
            "7/16/2010",
            "7/16/2010",
            "9/22/2006",
            "5/21/2010",
            "5/21/2010",
            "8/7/2003",
            "1/29/2004",
            "1/9/2003",
            "11/8/2001",
            "10/11/2005",
            "3/20/2003",
            "6/19/2006",
            "7/19/2002",
            "4/10/2001",
            "3/17/2008",
            "7/17/2002",
            "3/23/2001",
            "1/31/2005",
            "2/5/2008",
            "6/28/2006",
            "4/24/2006",
            "5/1/2006",
            "4/5/2004"
        ],
        [
            "Title",
            "Board Issues a Reporting Requirement for Briefing within 20 Days Responding to Enclosed Comments and to Include Crosswalk",
            "Board Issues a Reporting Requirement for Briefing within 30 Days of CD-1 Approval to Provide NNSA's Rationale for Use of Design-Build Approach for the CMR-R Project",
            "Board Issues a Reporting Requirement for Briefing within 30 days on Actions Taken or Planned by NNSA to Change the CMRR Facility Safety Strategy and Design",
            "Board Issues a Reporting Requirement for DOE to Provide a Briefing within 30 Days Containing Details on Procedural Compliance Issues at Pantex and the Corrective Actions Proposed by DOE",
            "Board Issues a Reporting Requirement for Monthly Briefing from Senior NNSA Managers on the Status of Commitments under the Recommendation 98-2 Implementation Plan",
            "Board Issues a Reporting Requirement for NNSA Briefing in 30 Days on Action Taken to Ensure Support of the National Laboratories, the Design Agencies for Nuclear Explosives",
            "Board Issues a Reporting Requirement for NNSA to Forward the Plan and Associated Schedule for Revising Safety-Related Orders, Standards, Supplemental Directives, and Site Office Procedures; FRA Manual",
            "Board Issues a Reporting Requirement for NNSA to Provide a Report within 30 Days on Action to Improve Software Quality Assurance for Interactive Electronic Procedures and the Move Right System",
            "Board Issues a Reporting Requirement for NNSA to Provide a Report within 30 Days on the Impact of Tooling Problems on the Safety of Nuclear Explosive Operations at the Pantex Plant",
            "Board issues a Reporting Requirement for Report and Briefing within 45 days Concerning the High Level Waste Tank Integrity Program",
            "Board Issues a Reporting Requirement for Report and Briefing within 45 Days Describing Risks, Pathway and Strategy for LANL Transuranic Operations",
            "Board Issues a Reporting Requirement for Report within 60 days Addressing Sealing Multi-Canister Overpacks into a Safety Condition",
            "Board Issues a Reporting Requirement for Report within 60 days Providing Path Forward or Revised Implementation Plan for Sludge Removal",
            "Board Issues a Reporting Requirement for Report within 90-Days on DOE's Nuclear Safety Management Program and Implementation Responsibilities",
            "Board Issues a Reporting Requirement Requesting the April 30, 2004, Update Promised by the Office of Environmental Management Provide a Revised Implementation Plan for Sludge Disposition",
            "Board Issues a Reporting Requirement that DOE and Fluor Fernald Inform the Board on Actions Taken to Ensure that the Silos 1 and 2 Remediation Facility is Fully Ready to Operate Safely",
            "Board Issues a Reporting Requirement that DOE Issue a Report within 120 Days Reviewing Standard 1027 for Areas that Might Benefit from Improvement",
            "Board Issues a Reporting Requirement that NNSA Provide a Briefing Prior to Resumption of W76 Operations",
            "Board Issues a Reporting Requirement that Provides the DOE Senior Leadership Assessment of the Current State of Public and Worker Protection for PF-4 Seismic Accident Scenarios at the Plutonium Facility (PF-4) at the Los Alamos National Laboratory (LANL)",
            "Board Issues a Reporting Requirement that Provides the Schedule for Completing a Revised Recommendation 2010-2 Implementation Plan",
            "Board Issues a Reporting Requirement to DOE Establishing a Monthly Requirement for a Briefing on the Status of Commitments under the Recommendation 98-2 Implementation Plan",
            "Board Issues a Reporting Requirement to DOE for a Briefing within 30 Days Describing the actions DOE will Take to Accelerate Material Stabilization at LANL",
            "Board Issues a Reporting Requirement to DOE for a Briefing within 45 Days on Specific Action DOE will Take on Risk Assessment; Board Includes Specific Comments on Draft Department of Energy Risk Assessment Policy for Nuclear Safety",
            "Board Issues a Reporting Requirement to DOE for a Briefing within 45 Days Providing the Results of Evaluations of the Training and Qualification Programs at LANL, LLNL, and NTS in Accordance with DOE Standard 1070-94",
            "Board Issues a Reporting Requirement to DOE for a Briefing within 60 Days on Ongoing and Planned Programs and Policies for Assessing, Prioritizing, and Managing Risk",
            "Board Issues a Reporting Requirement to DOE for a List of Vital Safety Systems at Each Site and Qualifications of Safety Personnel",
            "Board Issues a Reporting Requirement to DOE for a Report and Briefing within 30 Days Explaining \"Expedited\" Review Process and Doe Orders 226.1B and 450.2",
            "Board Issues a Reporting Requirement to DOE for a Report and Briefing within 90 Days Detailing Corrective Actions to Bring Savannah River's Procedures into Compliance with the Requirements of Part 830",
            "Board Issues a Reporting Requirement to DOE for a Report and Briefing within 90 Days Detailing Corrective Actions to Bring Savannah River's Procedures into Compliance with the Requirements of Part 830",
            "Board Issues a Reporting Requirement to DOE for a Report to be Submitted when the CD-3 Approval Request Package is Submitted Addressing Safety Related Issues Identified by Board in March 27, 2006 Board Letter",
            "Board Issues a Reporting Requirement to DOE for a Report within 120 Days Setting Forth Basis for Final Deposition Velocity and Default Values for DOE MACCS2 Computer Code Application Guidance",
            "Board Issues a Reporting Requirement to DOE for a Report within 120 Days Setting Forth Basis for Final Deposition Velocity and Default Values for DOE MACCS2 Computer Code Application Guidance",
            "Board Issues a Reporting Requirement to DOE for a Report within 30 Days Explaining How DOE Plans to Provide Effective, Detailed Guidance to Contractors on Electrical Safety Programs (DOE-HDBK-1092-98)",
            "Board Issues a Reporting Requirement to DOE for a Report within 30 Days for a Briefing on Comments on the Proposed Title 10 Code of Federal Regulations, Part 851, Worker Safety and Health",
            "Board Issues a Reporting Requirement to DOE for a Report within 45 Days Documenting the Implementation History of Action Listed in Enclosure to June 4, 2001 Letter on HEPA Filters",
            "Board Issues a Reporting Requirement to DOE for a Report within 45 Days for a Schedule of When Sites with Defense Nuclear Facilities Will Complete Their ISM Annual Updates",
            "Board Issues a Reporting Requirement to DOE for a Report within 45 days on Approach and Schedule to Address Board Comments",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days Addressing Changes to Mission of the R&D Program for Recommendation 94-1",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days Describing its Plans for the Staging, Assessment, and Disposition of a Damaged Nuclear Weapon or Improvised Nuclear Device, G-Tunnel",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days Describing the Seismic Detection and Alarm System Test Program, Tritium Extraction Facility",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days on the Accident Dose Methodology Being Advanced for Use at the Hanford Site",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days on the Increased Rejection Rate of HEPA Filters at the Filter Test Facility",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days Outlining Actions DOE will Take to Implement Recommendations of the DOE Commission on Fire Safety and Preparedness",
            "Board Issues a Reporting Requirement to DOE for a Report within 60 Days to Identify Actions Taken to Accelerate the Stabilization and Packaging of Plutonium at Savannah River Site and Los Alamos",
            "Board Issues a Reporting Requirement to DOE for A Report within 90 Days on Conditions of Approval in CFR Part 830, Nuclear Safety Management",
            "Board Issues a Reporting Requirement to DOE for a Report within 90 Days Regarding DOE's Evaluation of Independent Validation, Safety Basis Control",
            "Board Issues a Reporting Requirement to DOE for a Report within 90 Days to Supplement the Nuclear Criticality Safety Report, Year 2005",
            "Board Issues a Reporting Requirement to DOE for a Response within 30 Days on Comments on DOE's Draft Repackaging Prioritization Methodology for Recommendation 2005-1",
            "Board Issues a Reporting Requirement to DOE for a Response within 30 Days on DOE Manual M441.1, Nuclear Material Packaging Manual",
            "Board Issues a Reporting Requirement to DOE that Next Year's Annual Report on Nuclear Criticality Safety Address Stated Concerns"
        ],
        [
            "Author",
            "John T. Conway",
            "John T. Conway",
            "Peter S. Winokur",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "A. J. Eggenberger",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "A. J. Eggenberger",
            "A. J. Eggenberger",
            "Peter S. Winokur",
            "Peter S. Winokur",
            "John T. Conway",
            "John T. Conway",
            "A. J. Eggenberger",
            "Linton Brooks",
            "John T. Conway",
            "A. J. Eggenberger",
            "Peter S. Winokur",
            "Peter S. Winokur",
            "Peter S. Winokur",
            "A. J. Eggenberger",
            "Peter S. Winokur",
            "Peter S. Winokur",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "A. J. Eggenberger",
            "John T. Conway",
            "A. J. Eggenberger",
            "John T. Conway",
            "John T. Conway",
            "A. J. Eggenberger",
            "John T. Conway",
            "John T. Conway",
            "John T. Conway",
            "A. J. Eggenberger",
            "A. J. Eggenberger",
            "A. J. Eggenberger",
            "A. J. Eggenberger",
            "John T. Conway"
        ],
        [
            "Type",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter",
            "Letter"
        ],
        [
            "Download",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF",
            "PDF"
        ]
    ],
    "pageTitle": "Recent Board Activity | DNFSB",
    "title": "",
    "url": "http://www.dnfsb.gov/recent-board-activity?page=12&order=title&sort=asc&type=All",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988840.31/warc/CC-MAIN-20150728002308-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 410219667,
    "recordOffset": 410203273,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sat, 01 Aug 2015 16:21:01 GMT",
    "textBeforeTable": "<Any>Board Member SpeechBoard Member TestimonyBoard Notational VotesCorrespondence LogLetterOther Federal Register NoticesPress ReleasePublic HearingPublic Hearing Federal Register NoticePublic Hearing PresentationPublic Hearing Speaker BioPublic Hearing TestimonyPublic Hearing TranscriptRecommendationRecommendation Federal Register NoticeRecommendation Implementation PlanReport to CongressStaff Issue ReportTechnical ReportVacancy Announcement Type Recent Board Activity Search This Website: Use your technical skills to improve safety at DOE Defense",
    "textAfterTable": "« first ‹ previous … 9 10 11 12 13 14 15 16 17 … next › last » FOIA Reading Room Our Policies Federal Regulations Information Quality Customer Service Standard Contact Us Defense Nuclear Facilities Safety Board 625 Indiana Ave NW Suite 700 Washington, DC 20004 (202) 694-7000 (800) 788-4016 www.dnfsb.gov Contact Privacy OpenGov USA.gov No FEAR Survey Results",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}