{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "the clubs are small and do a lot! i've been most impressed with the athletics on campus. i have been able to be on the track and field team. which i though would be an impossibility in college.",
            "there is a coffee shop and a cafeteria on campus with pretty good food. they are very popular and it's a great place to meet and talk to other students.",
            "there are no dorms or housing at gcc.",
            "gcc has a variety of classes for all academic levels. i was an honors student and had a full schedule, which was pretty challenging.",
            "don't be afraid to talk to the teachers! they are really understanding and helpful. some of my teachers have been able to help me out so much just by listening to my problems and giving me advice.",
            "this college is great because it has small classes and dedicated staff. i love attending college here and know that many other students do too."
        ]
    ],
    "pageTitle": "Glendale Community College - Arizona Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Glendale-Community-College-Arizona/reviews?_escaped_fragment_=/show/9885",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889843311,
    "recordOffset": 889763047,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{361612=They are usually people patrolling the campus but they never seem to catch the bad people I see smoking and whatnot on campus. Recently (Nov 2013) a female was sexually harassed at 6 or 7 pm in the center of school during night classes., 11300=Glendale Community College is one of our surrounding community colleges in Arizona since 1965. Last year, more than 32,000 students enrolled in a wide variety of degree and certificate programs; on their way to achieving personal goals. From learning a particular subject to earning a degree or certificate to preparing for a new career or transfer to a university, students are always working hard, making life happen. The main campus at GCC North locations offers classes and programs throughout the West valley. There are supportive faculty members and helpful student services. They are ready to provide each student with the knowledge, skills and support they will need to succeed in the college and the world beyond it. For the past year, it has been a great opportunity for me to go to school there (ACE Plus program).I am going to be so prepared when I transfer to a university. GCC is an excellent beginning college for anyone!, 88667=the school is good. the teachers really seem to care about the students. also, they are going to be a smoke-free campus in july of 2012!, 456145=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/22/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 7 out of 8 people found this review useful. 1 of 113 Breanna from Peoria, AZ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); });",
    "textAfterTable": "Try your hardest on the placement test. It's nothing too difficult however if you do place in honors criteria, you will receive a full-ride presidential scholarship as I did. You will need to keep up with the requirements such as a 3.25 GPA and 12 credit hours which include one honors class. As long as you study, be attentive, and do your homework it will not be difficult to keep! Bang for the buck Glendale Community College is extremely affordable. They offer academic scholarships through high school placement, placement testing, and an honors program. Saving money is critically important, and going through community college either to achieve an associates degree or transfer to a university is the way to go! Glendale Community College is the school everyone should consider around the Maricopa County. Am enjoying being here The atmosphere overall is positive and pleasant. Professors are also fun and enjoyable through class. I found that it was very easy to be attentive in all of my classes and I never got bored. There are a lot of staff at the campuses that are more than willing to help new students with smiles. Am learning a lot The professors at the Glendale Community College Main",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}