{
    "relation": [
        [
            "Patent application number",
            "20130291910",
            "20130291911"
        ],
        [
            "Description",
            "Gear-Type Umbrella Runner - The invention provides a gear-type umbrella runner. A pentagonal handle is configured on the runner; a gear is configured inside the runner; the handle is coaxially connected with the gear; the gear is connected with the pull rod; the movement of the pull rod is driven by the rotation of the gear. The gear-type umbrella runner of the invention features simple structure, low manufacturing cost and ease and convenience in use. It is applicable to all fields that need runners, especially to parasol umbrella.",
            "Lever-Type Umbrella Runner - The invention provides a lever-type umbrella runner. A lever is configured on the runner; the lever is hinged with the runner; the upper end of the lever is connected with a pull rod inside the runner. The lever-type umbrella runner of the invention features simple structure, low manufacturing cost and ease and convenience in use. It is applicable to all fields that need runners, especially to parasol umbrella."
        ],
        [
            "Published",
            "11-07-2013",
            "11-07-2013"
        ]
    ],
    "pageTitle": "Ling - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ling-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442379887,
    "recordOffset": 442341236,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ling Luo, Taizhou CN 01-09-2014 ENERGY SAVING CONTROLLING METHOD AND DEVICE OF INVERTER AIR-CONDITIONER - The present disclosure provides an energy saving controlling method of an inverter air-conditioner, including: a main controlling unit of the inverter air-conditioner receiving settings of an energy consumption and an operating time; according to the set energy consumption and the set operating time, calculating or retrieving operational parameters of the inverter air-conditioner based on that the inverter air-conditioner consumes the set energy consumption in the set operating time; and controlling the inverter air-conditioner to operate according to the calculated or retrieved operational parameters. By receiving the settings of the energy consumption and the operating time from user which can be combined with the target indoor temperature, and calculating or retrieving the corresponding operational parameters of the inverter air-conditioner, the inverter air-conditioner can operate according to the operational parameters, which allows the user to control the energy consumption and the using cost of the inverter air-conditioner directly and accurately. 20140012423 Published Description Patent application number Ling Luo, Foshan City CN 02-12-2015 PHOTONIC CRYSTAL SURFACE-EMITTING LASERS - A photonic-crystal surface-emitting laser (PCSEL) includes a gain medium electromagnetically coupled to a photonic crystal whose energy band structure exhibits a Dirac cone of linear dispersion at the center of the photonic crystal's Brillouin zone. This Dirac cone's vertex is called a Dirac point; because it is at the Brillouin zone center, it is called",
    "textAfterTable": "Ling Luo, Wuhan CN Patent application number Description Published 20140287496 HEAT-RESISTANT NEWCASTLE DISEASE VIRUS LIVE VACCINE VECTOR SYSTEM AND USE THEREOF - A heat-resistant NDV live vaccine vector system includes a transcription plasmid, three helper plasmids, and host cells. The transcription plasmid is constructed by through cloning complete genomic cDNA of a heat-resistant NDV vaccine strain to a pBR322 vector. The three helper plasmids are constructed by cloning sequences coding nucleoprotein (NP), phosphoprotein, large polymerase protein of a heat-resistant NDV vaccine strain respectively to pcDNA3.1 vectors. A recombinant NDV artificially obtained by cotransfacting host cells with the transcription plasmid and the three helper plasmids shows heat-resistance. 09-25-2014 Ling Ma, Beijing CN Patent application number Description Published 20130256602 MANNICH-BASE INHIBITOR FOR DECALCIFICATION, PREPARATION METHOD AND APPLICATION THEREOF - A mannich-base inhibitor for decalcification, a preparation method and application thereof are provided. The inhibitor comprises 10-80% mannich-base component calculated in the total weight percent of the inhibitor, while the rest is at least one compound selected from imidazoline inhibitor with molecular weight between 110 and 750, and alkynyloxy amine inhibitor. The mannich-base inhibitor component is prepared through mannich reaction with 1 mol organic polyamine containing three or more primary amine bases and/or secondary amine bases, 3-7 mol ketones, and 3-7 mol aldehydes. The inhibitor which can be effectively compounded and cooperated with oil demulsifying agent and oil decalcifying agent, have the advantages",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}