{
    "relation": [
        [
            "Equipment",
            "Hunter's Sword",
            "Flametongue",
            "Ice Ball",
            "Twin Lance",
            "Blurry Moon"
        ],
        [
            "User",
            "Tidus",
            "Tidus",
            "Wakka",
            "Kimahri",
            "Auron"
        ],
        [
            "Cost",
            "843 → 1,293 gil",
            "1,406 → 2,156 gil",
            "1,406 → 2,156 gil",
            "3,262 → 5,002 gil",
            "2,306 → 3,536 gil"
        ]
    ],
    "pageTitle": "Moonflow - The Final Fantasy Wiki - 10 years of having more Final Fantasy information than Cid could research!",
    "title": "",
    "url": "http://finalfantasy.wikia.com/wiki/Moonflow",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 96345695,
    "recordOffset": 96291523,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 28 Jul 2015 20:52:58 GMT",
    "textBeforeTable": "O'aka - South WharfEdit Final Fantasy XEdit ShopsEdit In Final Fantasy X, a Mega-Potion may be found on the left, midway through the road. The North Bank Road leads from the North Bank up towards Guadosalam. It is much shorter than the corresponding South Bank Road. North Bank RoadEdit Like the South Bank, the North Bank is a small area overlooking the waters of the Moonflow. In Final Fantasy X, Rikku may be found here. A chest with four Antidotes may be found to the right after Rikku's tutorial. North BankEdit In Final Fantasy X, a Save Sphere may be found in the section the party ends up at after riding the shoopuf. In the adjoining area, O'aka may be found, but he sells only items during this encounter. In the nearby waiting area, a treasure chest with an Ether may be found. The North Wharf is located on the opposite",
    "textAfterTable": "Equipment User Cost Double-Edge Tidus 2,175 gil Switch Hitter Wakka 975 gil Snakehead Kimahri 3,075 gil Mythril Ring Yuna 1,575 gil Emerald Bangle Lulu 1,125 gil Serum Bracer Auron 1,425 gil South Wharf - Fat man (before airship)Edit Available at any time. However, after Tidus mentions Seymour's departure for Macalania Temple, the prices both items and equipment will increase by 12.5%. Item Cost Potion 100 → 112 gil Phoenix Down 200 → 225 gil Antidote",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}