{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No.",
            "Directorate Identifier"
        ],
        [
            "regulations.gov",
            "2015-11522",
            "2120-AA64",
            "FAA-2015-1480",
            "2014-SW-071-AD"
        ]
    ],
    "pageTitle": "14 CFR Part 39 - AIRWORTHINESS DIRECTIVES | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/14/part-39",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 425,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 936929815,
    "recordOffset": 936820982,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1000=Title 14 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{553671=We are superseding Airworthiness Directive (AD) 2007-03-18, AD 2008-17-02, AD 2012-08-03, and AD 2012-15-14, for certain Airbus Model A300 B4-2C, B4-103, and B4-203 airplanes; Model A300 B4-600, B4-600R, and F4-600R series airplanes, and Model A300 C4-605R Variant F airplanes (collectively called Model A300-600 series airplanes); and Model A310 series airplanes. AD 2007-03-18, AD 2008-17-02, AD 2012-08-03, and AD 2012-15-14 required repetitive inspections of the forward lugs of the aft bearing at rib 5 of the main landing gear (MLG) on the left-hand (LH) and right-hand (RH) wings, and repair if necessary; and installation of new bushes with increased interference fit in the forward lug of the aft bearing at rib 5 of the MLG on the LH and RH wings. This new AD adds airplanes to the applicability; and adds, for certain airplanes, repetitive inspections of the MLG rib 5 aft bearing forward lugs, and repair if necessary. This AD was prompted by reports of cracking in the forward lug of the MLG rib 5 aft bearing attachment. We are issuing this AD to detect and correct cracking of the forward lugs of the aft bearing at rib 5 of the MLG on the LH and RH wings, which could affect the structural integrity of the MLG attachment, resulting in possible MLG collapse during landing or rollout., 202722=We are publishing a new airworthiness directive (AD) for Enstrom Helicopter Corporation (Enstrom) Model F-28A, 280, F-28C, F-28C-2, F-28C-2R, 280C, F-28F, F-28F-R, 280F, 280FX, and 480 helicopters. This AD was sent previously to all known U.S. owners and operators of these helicopters and supersedes Emergency AD (EAD) 2015-04-51, dated February 12, 2015. This AD requires inspecting certain main rotor spindles (spindles) for cracks and reporting the inspection results to the FAA. This AD is prompted by a fatal accident and reports of spindles with cracks. The actions specified in this AD are intended to detect a crack in a spindle and prevent loss of a main rotor blade and subsequent loss of control of the helicopter., 213762=We are superseding Airworthiness Directive (AD) 2004-07-11 for all The Boeing Company Model 767-400ER series airplanes. AD 2004-07-11 requires repetitive high frequency eddy current (HFEC) inspections of the aft lower lugs of the deflection control track of the outboard flap for cracks, and replacement of any cracked deflection control track with a new track assembly. This AD retains those requirements, provides optional terminating action for the repetitive inspections, and adds airplane models to the applicability. This AD was prompted by our determination that additional airplane models require repetitive HFEC inspections of the aft lower lugs of the deflection control track of the outboard flap for cracks, and replacement of any cracked deflection control track with a new track assembly. We are issuing this AD to detect and correct fatigue cracking in the aft lower lug run-out region of the deflection control track, which could result in the loss of the secondary load path for the outboard flap, resulting in the loss of the outboard flap and consequent reduced controllability of the airplane in the event that the primary load path also fails., 597361=We are adopting a new airworthiness directive (AD) for certain Rolls-Royce Corporation (RRC) AE 2100 series turboprop engines and AE 3007A and 3007C series turbofan engines. This AD was prompted by reports of pitting in the wheel bores and subsequent RRC analysis that concluded that lower life limits are needed for the affected turbine wheels. This AD requires a reduction for the approved life limits of the affected turbine wheels. This AD also requires an eddy current inspection (ECI) of certain RRC engines with affected turbine wheels. We are issuing this AD to prevent uncontained failure of the turbine wheels, damage to the engine, and damage to the airplane., 625196=We are superseding Airworthiness Directive (AD) 2013-19-19 for certain Eurocopter France Model AS332C, AS332L, AS332L1, AS332L2, and EC225LP helicopters. AD 2013-19-19 required replacing certain serial-numbered main gearbox (MGB) bevel gear vertical shafts and inspecting and replacing, if necessary, each MGB bevel gear vertical shaft (shaft). This new AD requires the same actions as AD 2013-19-19 but corrects an error in the term used to identify an inspection qualification and updates the type certificate holder's name. This AD is prompted by two incidents of emergency ditching after warning indications of loss of MGB oil pressure . These actions are intended to detect a cracked shaft, which could result in loss of MGB oil pressure, loss of the MGB lubrication system, and subsequent loss of control of the helicopter., 711754=We are adopting a new airworthiness directive (AD) for Pilatus Aircraft Ltd. Model PC-7 airplanes. This AD results from mandatory continuing airworthiness information (MCAI) issued by an aviation authority of another country to identify and correct an unsafe condition on an aviation product. The MCAI describes the unsafe condition as possible cracking from stress corrosion on various parts of the airplane structure made of aluminum alloy AA2024-T351. We are issuing this AD to require actions to address the unsafe condition on these products., 241414=We are adopting a new airworthiness directive (AD) for DG Flugzeugbau GmbH Model DG-1000T gliders equipped with a Solo Kleinmotoren Model 2350 C engine that supersedes AD 2013-22-14 R1. This AD results from mandatory continuing airworthiness information (MCAI) issued by the aviation authority of another country to identify and correct an unsafe condition on an aviation product. The MCAI describes the unsafe condition as engine shaft failure with consequent propeller detachment. We are issuing this AD to require actions to address the unsafe condition on these products., 734346=We are superseding Airworthiness Directive (AD) 2011-09-11, for certain The Boeing Company Model 777-200 and -300 series airplanes. AD 2011-09-11 required repetitive inspections for hydraulic fluid contamination of the interior of the strut disconnect assembly; repetitive inspections for discrepancies of the interior of the strut disconnect assembly, if necessary; repetitive inspections of the exterior of the strut disconnect assembly for cracks, if necessary; corrective action if necessary; and an optional terminating action for the inspections. This new AD adds, for certain airplanes, an inspection of the side and top cover plates to determine if all cover plate attach fasteners have been installed, and installing any missing fasteners including doing an inspection for damage, and repair if necessary. This AD was prompted by reports of side and top cover plates installed with missing fastener bolts, which results in an unsealed opening on the system disconnect assembly. We are issuing this AD to detect and correct hydraulic fluid contamination, which can cause cracking of titanium parts in the system disconnect assembly; and also to detect and correct missing fasteners, which results in unsealed openings on the system disconnect assembly. Both unsafe conditions can compromise the engine firewall and result in fire hazards for both the engine compartment and the strut., 1453537=We propose to supersede Airworthiness Directive (AD) 98-20-27, for all Airbus Model A300 B4-600, B4-600R, and F4-600R series airplanes, and Model A300 C4-605R Variant F airplanes (collectively called Model A300-600 series airplanes). AD 98-20-27 currently requires repetitive inspections to detect fatigue cracking of the wing top skin at the front spar joint; and a follow-on eddy current inspection and repair, if necessary. Since we issued AD 98-20-27, we have received reports of cracking of the wing top skin in an area not required for inspection by AD 98-20-27. This proposed AD would reduce the inspection compliance time and intervals, and extend the inspection area of the wing top skin at the front spar joint. We are proposing this AD to detect and correct fatigue cracking of the wing top skin at the front spar joint, which could result in reduced structural integrity of the airplane., 103660=We are superseding airworthiness directive (AD) 2014-02-08 for Agusta Model A109C, A109S, A109K2, A109E, and AW109SP helicopters. AD 2014-02-08 required inspecting the lock wires securing the tail rotor (T/R) duplex bearing locking nut (locking nut) to determine whether any lock wires are missing or damaged. This AD retains some of the requirements of AD 2014-02-08 but removes the terminating action, expands the applicability, and adds a daily pilot check. This AD was prompted by reports of loosening T/R locking nuts. These actions are intended to prevent failure of the T/R and subsequent loss of control of the helicopter., 52837=We are superseding airworthiness directive (AD) 2006-15-08 for all Honeywell International Inc. TPE331-1, -2, -2UA, -3U, -3UW, -5, -5A, -5AB, -5B, -6, -6A, -10, -10AV, -10GP, -10GT, -10P, -10R, -10T, -10U, -10UA, -10UF, -10UG, -10UGR, -10UR, -11U, -12JR, -12UA, -12UAR, and -12UHR turboprop engines with certain Honeywell part numbers (P/Ns) of Woodward fuel control unit (FCU) assemblies, installed. AD 2006-15-08 required initial and repetitive dimensional inspections of the fuel control drives for wear, and replacement of the FCU and fuel pump. This new AD requires initial and repetitive dimensional inspections of the affected fuel control drives and insertion of certain airplane operating procedures into the applicable flight manuals. This AD was prompted by reports of loss of the fuel control drive, leading to engine overspeed, overtorque, overtemperature, uncontained rotor failure, and asymmetric thrust in multi-engine airplanes. We are issuing this AD to prevent failure of the fuel control drive that could result in damage to the engine and airplane., 831914=We propose to supersede Airworthiness Directive (AD) 2005-01-09, which applies to certain The Boeing Company Model 747-100, 747-100B, 747-100B SUD, 747-200B, 747-200C, 747-200F, 747-300, 747-400, 747-400D, 747-400F, and 747SR series airplanes. AD 2005-01-09 requires a one-time detailed inspection for discrepancies of the frame web and inner chords on the forward edge frame of the number 5 main entry door cutout, and corrective action if necessary. Since we issued AD 2005-01-09, additional cracking was found in the same area after completion of the one-time detailed inspection. This proposed AD would add repetitive high frequency eddy current inspections for cracking of the frame inner chords (forward and aft), and corrective action if necessary. We are proposing this AD to detect and correct discrepancies of the frame web and inner chords, which could result in cracking, subsequent severing of the frame, and consequent rapid depressurization of the airplane., 332635=We are superseding Airworthiness Directive (AD) 2015-02-04 for certain Dassault Aviation Model MYSTERE-FALCON 50 airplanes. AD 2015-02-04 required installing two protective plates between the electrical wiring under the glare shield and the engine fire pull handles. This new AD continues to require installing two protective plates between the electrical wiring under the glare shield and the engine fire pull handles. This AD was prompted by our determination that the published version of AD 2015-02-04 incorrectly identified the AD number as “AD 2014-02-04” in a certain paragraph. We are issuing this AD to prevent chafing of the electrical wiring, which could result in a short circuit and generation of smoke in the cockpit, potential loss of several functions essential for safe flight, and consequent reduced controllability of the airplane., 1200074=We propose to supersede Airworthiness Directive (AD) 2011-21-06 for all BAE SYSTEMS (Operations) Limited Model 4101 airplanes. AD 2011-21-06 currently requires revising the maintenance program. Since we issued AD 2011-21-06, we have determined that the life limit of certain main landing gear components must be reduced, and certain post-repair inspections of critical structure are necessary. This proposed AD would require a new revision of the maintenance/inspection program. We are proposing this AD to prevent failure of certain structurally significant items, including the main landing gear and nose landing gear, which could result in reduced structural integrity of the airplane; and to prevent fuel vapor ignition sources, which could result in a fuel tank explosion and consequent loss of the airplane., 286141=We are superseding Airworthiness Directive (AD) 2007-14-05 for all Airbus Model A310 and Model A300 B4-600, B4-600R, and F4-600R series airplanes, and Model A300 C4-605R Variant F airplanes (collectively called Model A300-600 series airplanes). AD 2007-14-05 required revising the Airworthiness Limitations section of the Instructions for Continued Airworthiness by incorporating certain certification maintenance requirements. This new AD requires revising the maintenance or inspection program to incorporate more restrictive maintenance requirements and airworthiness limitations. This AD was prompted by a determination that more restrictive maintenance requirements and airworthiness limitations are necessary. We are issuing this AD to prevent safety-significant latent failures that would, in combination with one or more other specific failures or events, result in a hazardous or catastrophic failure condition of avionics, hydraulic systems, fire detection systems, fuel systems, or other critical systems., 487135=We are superseding Airworthiness Directive (AD) 2009-20-05 for certain Airbus Model A318, A319, A320, and A321 series airplanes. AD 2009-20-05 required one-time inspections for cracking, damage, correct installation, and correct adjustment of the main landing gear (MLG) door hinge and actuator fittings on the keel beam, and corrective actions if necessary. This new AD expands the applicability, reduces the compliance time, and requires repetitive inspections instead of the one-time inspection. This AD also requires revising the maintenance or inspection program. This AD was prompted by reports of cracks on fittings that had successfully passed certain required inspections. We are issuing this AD to detect and correct cracking on the MLG door hinge fitting and actuator fitting on the keel beam, which could lead to in-flight detachment of an MLG door, possibly resulting in injury to persons on the ground and/or damage to the airplane., 1524319=We propose to supersede Airworthiness Directive (AD) 2012-13-06, for all Airbus Model A300 series airplanes and all Model A300 B4-600, B4-600R, and F4-600R series airplanes, and Model A300 C4-605R Variant F airplanes (collectively called Model A300-600 series airplanes). AD 2012-13-06 currently requires a one-time detailed inspection to determine the length of the fire shut-off valve (FSOV) bonding leads and for contact or chafing of the wires, and corrective actions if necessary. Since we issued AD 2012-13-06, a determination was made that the description of the inspection area specified in the service information was misleading; therefore, some operators might have inspected incorrect bonding leads. This proposed AD would instead require a new one-time detailed inspection of the FSOV bonding leads to ensure that the correct bonding leads are inspected, and corrective action if necessary. We are proposing this AD to detect and correct contact or chafing of wires and the bonding leads, which, if not detected, could be a source of sparks in the wing trailing edge, and could lead to an uncontrolled engine fire. May 5, 2015., 1529393=We propose to supersede Airworthiness Directive (AD) 2013-13-04, for certain Airbus Model A318, A319, A320, and A321 series airplanes. AD 2013-13-04 currently requires installing a power interruption protection circuit for the landing gear control interface unit (LGCIU). Since we issued AD 2013-13-04, we have determined that additional work is necessary to adequately address the identified unsafe condition. This proposed AD would require a new modification of any previously modified LGCIU. This proposed AD would also require revising the maintenance or inspection program to reduce a certain functional check interval. This proposed AD also adds airplanes to the applicability. We are proposing this AD to prevent untimely unlocking and/or retraction of the nose landing gear (NLG), which, while on the ground, could result in injury to ground personnel and damage to the airplane., 570648=We are revising Airworthiness Directive (AD) 2014-12-11 for Sikorsky Aircraft Corporation (Sikorsky) Model S-92A helicopters. AD 2014-12-11 required revising the Rotorcraft Flight Manual (RFM) to include the appropriate operating limitations for performing Class D external load-combination operations. As published, AD 2014-12-11 referenced an incorrect date for Revision No. 12 of Sikorsky RFM SA S92A-RFM-003, Part 1. This AD corrects the error while retaining the requirements of AD 2014-12-11. These actions are intended to require appropriate operating limitations to allow operators to perform Class D external load-combination operations, including human external cargo, in this model helicopter that now meets the Category A performance standard., 706550=We are superseding Airworthiness Directive (AD) AD 2011-14-06 for all Airbus Model A318, A319, A320, and A321 series airplanes. AD 2011-14-06 required revising the maintenance program. This new AD requires revising the maintenance program to incorporate new, more restrictive limitations. This AD was prompted by the determination that more restrictive limitations are necessary. We are issuing this AD to prevent fatigue cracking, accidental damage, or corrosion in principal structural elements, and possible failure of certain life limited parts, which could result in reduced structural integrity of the airplane., 1066950=We propose to supersede Airworthiness Directive (AD) 2014-14-02, which applies to certain Pratt & Whitney Canada Corp. (P&WC) PW120, PW121, PW121A, PW124B, PW127, PW127E, PW127F, PW127G, and PW127M turboprop engines. AD 2014-14-02 requires removal of the O-ring seal from the fuel manifold fitting. Since we issued AD 2014-14-02, we received reports of fuel seepage past the metal-to-metal sealing surfaces of the fuel nozzle and fuel manifold flow adapter. This proposed AD would require replacement of the fuel nozzle and the fuel manifold flow adapter. We are proposing this AD to prevent in-flight fuel leakage, engine fire, damage to the engine, and damage to the airplane., 416101=We are superseding an airworthiness directive (AD) 2014-06-03 for British Aerospace Regional Aircraft Model Jetstream Series 3101 and Jetstream Model 3201 airplanes. This AD results from mandatory continuing airworthiness information (MCAI) issued by an aviation authority of another country to identify and correct an unsafe condition on an aviation product. The MCAI describes the unsafe condition as stress corrosion cracking of the main landing gear spigot housing. We are issuing this AD to require actions to address the unsafe condition on these products., 387593=We are superseding Airworthiness Directive (AD) 2011-13-07 for all Dassault Aviation Model FALCON 7X airplanes. AD 2011-13-07 requires revising the airplane flight manual (AFM) to include a procedure to power off a radio-altimeter or revert to the correct radio-altimeter output. This new AD requires revising the AFM to include a simpler procedure to revert to the correct radio-altimeter output. This AD was prompted by an analysis which showed that AFM procedures could be simplified. We are issuing this AD to ensure that the flightcrew has procedures in the event of a radio-altimeter lock-up, which inhibits the display of warnings along with certain abnormal conditions, during the switch into landing mode during altitude cruise. If not corrected, this could result in the flightcrew being unaware of possible system failures that require immediate action by the flightcrew, leading to possible loss of control of the airplane., 298642=We are superseding Airworthiness Directive (AD) 2013-26-05 for all Dassault Aviation Model FAN JET FALCON, FAN JET FALCON SERIES C, D, E, F, and G airplanes; Model MYSTERE-FALCON 200 airplanes; and Model MYSTERE-FALCON 20-C5, 20-D5, 20-E5, and 20-F5 airplanes. AD 2013-26-05 required repetitive weighing of fire extinguisher bottles having a certain part number, and eventual replacement of those bottles to terminate the repetitive weighing. This new AD continues to require repetitive weighing of fire extinguisher bottles having a certain part number, and eventual replacement of those bottles to terminate the repetitive weighing. This AD was prompted by our determination that certain text in the method of compliance language specified in AD 2013-26-05 incorrectly refers to Airbus, instead of “Dassault Aviation.” We are issuing this AD to detect and correct a dormant failure in the fire suppression system, which could result in the inability to put out a fire in an engine, auxiliary power unit (APU), or rear compartment., 1560124=We propose to supersede Airworthiness Directive (AD) 2007-16-08, which applies to all The Boeing Company Model 747-100, 747-100B, 747-100B SUD, 747-200B, 747-200C, 747-300, 747-400, 747-400D, and 747SR series airplanes. AD 2007-16-08 currently requires repetitive inspections for cracking of the station 800 frame assembly, and repair if necessary. Since we issued AD 2007-16-08, we have received additional reports of cracks found at the forward and aft inner chord strap and angles on the station 800 frame on the left-side and right-side main entry doors. This proposed AD would expand the inspection area. We are proposing this AD to detect and correct fatigue cracks that could extend and fully sever the frame, which could result in development of skin cracks that could lead to rapid depressurization of the airplane., 58893=We are superseding Airworthiness Directive (AD) 2007-13-05 for all The Boeing Company Model 777-200, -200LR, -300, and -300ER series airplanes. AD 2007-13-05 required repetitive measurements of the freeplay of the right and left elevators, rudder, and rudder tab, and related investigative and corrective actions if necessary. This new AD requires repetitive freeplay inspections and lubrication of the right and left elevators, rudder, and rudder tab, and related investigative and corrective actions if necessary. This AD was prompted by the manufacturer's determination that the procedure for the rudder freeplay inspection does not properly detect excessive freeplay in the rudder control load loop. We are issuing this AD to detect and correct excessive wear in the load loop components of the control surfaces, which could lead to excessive freeplay of the control surfaces, flutter, and consequent loss of control of the airplane., 458443=We are superseding Airworthiness Directive (AD) 2015-02-06 for certain Bombardier, Inc. Model CL-600-2B16 (CL-604 Variant) airplanes. AD 2015-02-06 required a revision to the airplane flight manual, a revision to the maintenance or inspection program, as applicable, and replacement of horizontal stabilizer trim actuators (HSTAs) having certain part numbers. This new AD continues to require those actions and corrects certain typographical errors. This AD was prompted by the discovery of three typographical errors in AD 2015-02-06. We are issuing this AD to detect and correct loose spur gear bolts on the HSTA, which, if combined with the failure of the primary load path, could lead to failure of the HSTA and subsequent loss of the airplane., 1585774=We propose to supersede Airworthiness Directive (AD) 2005-18-18, which applies to certain The Boeing Company Model 757 airplanes. AD 2005-18-18 currently requires inspections of certain wire bundles in the left and right engine-to-wing aft fairings for discrepancies; installation of back-to-back p-clamps between the wire and hydraulic supply tube at the aft end of the right-hand strut only; and associated re-routing of the wire bundles, if necessary. Since we issued AD 2005-18-18, we have determined that the service information referenced in AD 2005-18-18 did not adequately address fuel shutoff valve (FSV) wires at the aft end of the struts. This proposed AD would add an installation of spiral cable wrap on FSV wires at the aft end of the strut, for both left and right engines, and related investigative and corrective actions. We are proposing this AD to prevent chafing between the wire bundle and the structure of the aft fairing, which could result in electrical arcing and subsequent ignition of flammable vapors and possible uncontrollable fire., 280210=We are superseding Airworthiness Directive (AD) 99-01-05 R1, which applied to certain aircraft equipped with wing lift struts. AD 99-01-05 R1 required repetitively inspecting the wing lift struts for corrosion; repetitively inspecting the wing lift strut forks for cracks; replacing any corroded wing lift strut; replacing any cracked wing lift strut fork; and repetitively replacing the wing lift strut forks at a specified time for certain airplanes. This new AD retains all requirements of AD 99-01-05R1 and adds additional airplane models to the Applicability section. This AD was prompted by a report that additional Piper Aircraft, Inc. model airplanes should be added to the Applicability section. We are issuing this AD to correct the unsafe condition on these products., 608217=We are superseding Airworthiness Directive (AD) 2013-24-13 for certain The Boeing Company Model 737-100, -200, -200C, -300, -400, -500, -600, -700, -700C, -800, and -900 series airplanes. AD 2013-24-13 required replacing the pivot link assembly for certain airplanes, replacing the seat track link assemblies or modifying the existing seat track link assembly for certain airplanes, or modifying the existing seat track link assembly fastener for certain other airplanes. AD 2013-24-13 also required inspecting, changing, or repairing the seat track link assembly for certain other airplanes. Since we issued AD 2013-24-13, a certain paragraph reference in that AD was found to be mis-identified; this AD corrects this paragraph reference. We are issuing this AD to prevent seat detachment in an emergency landing, which could cause injury to occupants of the passenger compartment and affect emergency egress., 162502=We are superseding Airworthiness Directive (AD) 2014-09-05, for certain Airbus Model A330-200 and -300 series airplanes, and Model A340-200 and -300 series airplanes. AD 2014-09-05 required repetitive inspections of certain sidestay upper cardan pins of the main landing gear (MLG) and associated nuts and retainer assemblies, and pin replacement if necessary. This AD was prompted by a determination that a previously optional measurement is necessary to address the identified unsafe condition. This new AD continues to require a detailed inspection for visible chrome of each affected MLG sidestay upper cardan pin, associated nuts, and retainer assembly, and pin replacement if needed, and adds new requirements for measuring cardan pin clearance dimensions (gap check), doing corrective actions, and reporting all findings. We are issuing this AD to detect and correct migration of the sidestay upper cardan pin, which could result in disconnection of the sidestay upper arm from the airplane structure, and could result in a landing gear collapse and consequent damage to the airplane and injury to occupants., 398865=We are superseding Airworthiness Directive (AD) 2014-06-08 for certain Bombardier, Inc. Model DHC-8-100, -200, and -300 series airplanes. AD 2014-06-08 required repetitive functional checks of the nose and main landing gear, and corrective actions if necessary; and also provided optional terminating action modification for the repetitive functional checks. This new AD requires a terminating action modification. This AD was prompted by a report that the emergency downlock indication system (EDIS) had given a false landing gear down-and-locked indication and a determination that a terminating action modification is necessary to address the identified unsafe condition. We are issuing this AD to detect and correct a false down-and-locked landing gear indication, which, on landing, could result in possible collapse of the landing gear., 219672=We are superseding Airworthiness Directive (AD) 2014-26-04 for certain GROB-WERKE Models G115EG and G120A airplanes. This AD results from mandatory continuing airworthiness information (MCAI) issued by an aviation authority of another country to identify and correct an unsafe condition on an aviation product. The MCAI describes the unsafe condition as a defective starter solenoid. We are issuing this AD to require actions to address the unsafe condition on these products., 75266=We are superseding Airworthiness Directive (AD) 2008-06-18 for all Airbus Model A300 B4-600, B4-600R, and F4-600R series airplanes, and Model A300 C4-605R Variant F airplanes (collectively called Model A300-600 series airplanes); and Model A300 series airplanes. AD 2008-06-18 required repetitive inspections for any cracking of the wing lower skin panel and associated internal support structure, and if necessary, corrective actions such as modifying the lower panel inboard of rib 9 aft of the rear spar and repairing cracks. This new AD continues to require actions required by AD 2008-06-18, and reduces certain compliance times. This AD was prompted by a report that information from an analysis and a fleet survey shows a need for reduced compliance times and intervals. We are issuing this AD to detect and correct cracking, which could lead to reduced structural integrity of the airplane., 1420984=We propose to supersede Airworthiness Directive (AD) 2011-07-10, for certain Bombardier, Inc. Model BD-100-1A10 (Challenger 300) airplanes. AD 2011-07-10 currently requires revising the Airworthiness Limitations section of the Instructions for Continued Airworthiness; doing detailed visual inspections; removing discrepant material; cleaning the surfaces of the valves, the plug of the sensing port, and the cabin pressure-sensing port plug; securing the insulation; installing a new safety valve, and replacing certain cabin pressure-sensing port plugs. Since we issued AD 2011-07-10, we have received reports of in-flight loss of cabin pressurization that was attributed to partial blockage of a safety valve cabin pressure-sensing port in conjunction with a failed safety valve manometric capsule. This proposed AD would retain all requirements of AD 2011-07-10. This proposed AD would also require a detailed visual inspection of both safety valves and the surrounding area for foreign material, room temperature vulcanizing (RTV) silicone, contamination, foam on the bulkhead structure, tape or insulation, and loose material; and corrective actions if necessary. We are proposing this AD to detect and correct blockage of a safety valve cabin pressure-sensing port, which could result in loss of cabin pressure., 190645=We are superseding Airworthiness Directive (AD) 2012-09-09 for all International Aero Engines AG (IAE) V2500-A1, V2525-D5, and V2528-D5 turbofan engines, and certain serial numbers (S/Ns) of IAE V2522-A5, V2524-A5, V2527-A5, V2527E-A5, V2527M-A5, V2530-A5, and V2533-A5 turbofan engines. AD 2012-09-09 required cleaning, eddy current inspection (ECI) or fluorescent penetrant inspection (FPI), and initial and repetitive ultrasonic inspections (USIs) of certain high-pressure compressor (HPC) stage 3 to 8 drums, as well as replacement of the drum attachment nuts. This new AD expands the affected population for initial and repetitive USIs of the HPC stage 3 to 8 drum, revises the inspection intervals, requires performing ECI or FPI, requires removal of the affected attachment nuts and any HPC stage 3 to 8 drum found cracked, and adds a mandatory terminating action. This AD was prompted by the discovery that additional attachment nuts for certain HPC stage 3 to 8 drums are affected. We are issuing this AD to prevent failure of the HPC stage 3 to 8 drum, which could result in uncontained drum failure, damage to the engine, and damage to the airplane., 950579=We propose to adopt a new airworthiness directive (AD) for all Fokker Services B.V. Model F.28 Mark 1000, 2000, 3000, and 4000 airplanes. This proposed AD was prompted by a design review, which revealed that no controlled bonding provisions are present on a number of critical locations outside the fuel tank. This proposed AD would require installing additional and improved fuel system bonding provisions, and revising the airplane maintenance or inspection program, as applicable, by incorporating fuel airworthiness limitation items and critical design configuration control limitations. We are proposing this AD to prevent an ignition source in the fuel tank vapor space, which could result in a fuel tank explosion and consequent loss of the airplane., 179656=We are superseding Airworthiness Directive (AD) 2014-20-11, for Zodiac Seats France 9140, 9166, 9173, 9174, 9184, 9188, 9196, 91B7, 91B8, 91C0, 91C2, 91C4, 91C5, 91C9, 9301, and 9501 series passenger seat assemblies. AD 2014-20-11 required a general visual inspection for cracking of backrest links; replacement with new links if cracking is found; and eventual replacement of all links with new links. This AD was prompted by a determination that a model designation specified in paragraph (c)(1) of that AD was incorrect. This new AD identifies the correct model designation. We are issuing this AD to detect and correct cracks in the backrest links, which could affect the structural integrity of seat backrests. Failure of the backrest links could result in injury to an occupant during emergency landing conditions., 1415829=We propose to supersede Airworthiness Directive (AD) 2013-23-03, which applies to certain The Boeing Company Model 747-100, 747-100B, 747-100B SUD, 747-200B, 747-200C, 747-200F, 747-300, 747-400, 747-400D, 747-400F, and 747SR series airplanes. AD 2013-23-03 currently requires doing a detailed inspection of certain attach fittings for a cylindrical defect and replacing if necessary. Since we issued AD 2013-23-03, we received a report that a machining defect was also found on some of the actuator assemblies inspected during manufacture. This defect could lead to fatigue cracking and subsequent fracture. For certain airplanes, this proposed AD would mandate new inspections of the inboard actuator attach fittings for machining defects, and overhaul or replacement, if necessary. This proposed AD would also limit the compliance time for doing the replacement for certain other airplanes. We are proposing this AD to detect and correct defective inboard actuator attach fittings which, combined with loss of the outboard actuator load path, could result in uncontrolled retraction of the outboard flap, damage to flight control systems, and consequent reduced controllability of the airplane., 602781=We are superseding Airworthiness Directive (AD) 95-24-04 for all Airbus Model A300 series airplanes; Model A300 B4-600, B4-600R, and F4-600R series airplanes; and Model A300 C4-605R Variant F airplanes. AD 95-24-04 required inspections to detect cracks at the aft spar web of the wings, and repair if necessary. This new AD reduces certain compliance times, and expands the applicability. This AD was prompted by a determination that the inspection threshold and interval must be reduced to allow timely detection of cracks and accomplishment of applicable repairs, because of cracking in the rear spar web of the wings between certain ribs due to fatigue-related high shear stress. We are issuing this AD to detect and correct fatigue-related cracking, which could result in reduced structural integrity of the wing., 955733=We are revising an NPRM for SOCATA Model TBM 700 airplaness (type certificate previously held by EADS SOCATA) that was proposed to revise AD 2007-04-13. This proposed AD results from mandatory continuing airworthiness information (MCAI) originated by an aviation authority of another country to identify and correct an unsafe condition on an aviation product. The MCAI describes the unsafe condition as cracks found on the main landing gear cylinders. This action revises the NPRM by including the actions against those airplanes that reach a certain number of landings after the effective date of the AD. We are proposing this supplemental NPRM (SNPRM) to correct the unsafe condition on these products. Since this action imposes an additional burden over that proposed in the NPRM, we are reopening the comment period to allow the public the chance to comment on this proposed change., 525719=We are superseding Airworthiness Directive (AD) 2012-09-07 for certain Airbus Model A319-111, -112, and -132 airplanes; Model A320-111, -211, -212, -214, and -232 airplanes; and Model A321-111, -211, -212, and -231 airplanes. AD 2012-09-07 required an electrical bonding test between the gravity fill re-fuel adaptor and the top skin panels on the wings; and, if necessary, an inspection for corrosion of the component interface and adjacent area; and repairing the gravity fuel adaptor if necessary. This new AD adds airplanes to the applicability and requires inspecting those airplanes to determine if a repair was done, and doing the electrical bonding test and corrective action if necessary. This AD was prompted by a determination that more airplanes are subject to the identified unsafe condition. We are issuing this AD to detect and correct corrosion and improper bonding, which, in combination with a lightning strike in this area, could create a source of ignition in a fuel tank, resulting in a fire or explosion and consequent loss of the airplane., 1595999=We propose to supersede Airworthiness Directive (AD) 2012-18-05, which applies to The Boeing Company Model DC-9-10, DC-9-20, DC-9-30, DC-9-40, and DC-9-50 series airplanes; and Model DC-9-81 (MD-81), DC-9-82 (MD-82), DC-9-83 (MD-83), DC-9-87 (MD-87), MD-88, and MD-90-30 airplanes; equipped with a center wing fuel tank and Boeing original equipment manufacturer-installed auxiliary fuel tanks. AD 2012-18-05 currently requires adding design features to detect electrical faults and to detect a pump running in an empty fuel tank. Since we issued AD 2012-18-05, we have determined that it is necessary to clarify the actions for airplanes on which the auxiliary fuel tanks are removed. This proposed AD would allow certain actions as optional methods of compliance. We are proposing this AD to reduce the potential of ignition sources inside fuel tanks, which, in combination with flammable fuel vapors, could result in fuel tank explosions and consequent loss of the airplane., 1271271=We propose to supersede airworthiness directives (ADs) 2001-18-06 and 2008-22-16, which apply to certain General Electric Company (GE) CT58 turboshaft engines. ADs 2001-18-06 and 2008-22-16 require recalculating the lives of life-limited rotating parts using a Repetitive Heavy-Lift (RHL) multiplying factor and removal from service of parts that exceed the recalculated cyclic or hourly life limit. This proposed AD would consolidate ADs 2001-18-06 and 2008-22-16, and further reduce the life capability of certain parts. We are proposing this AD to prevent failure of life-limited rotating parts, uncontained part release, damage to the engine, and damage to the aircraft., 1555456=We propose to supersede airworthiness directive (AD) 2014-05-06 for certain Eurocopter Deutschland GmbH (ECD) (now Airbus Helicopters Deutschland GmbH) Model EC135 and MBB-BK 117 C-2 helicopters to correct an error. AD 2014-05-06 currently requires inspecting the flight-control bearings repetitively, replacing any loose bearing with an airworthy flight-control bearing, and installing bushings and washers. This proposed AD would require the same actions. This proposed AD results from the discovery of an error in the compliance time for AD 2014-05-06. These proposed actions are intended to prevent the affected control lever from shifting, contacting the helicopter structure, and reducing control of the helicopter., 1032840=We propose to supersede Airworthiness Directive (AD) 97-20-07, for certain Airbus Model A300 B4-600, B4-600R, and F4-600R series airplanes, and Model A300 C4-605R Variant F airplanes (collectively called Model A300-600 series airplanes). AD 97-20-07 requires repetitive inspections to detect fatigue cracking in the left and right wings in the area where the top skin attaches to the center spar, and repair or modification of this area if necessary. Since we issued AD 97-20-07, we have determined that the inspection compliance time and repetitive inspection interval must be reduced to allow timely detection of cracking in the left and right wings in the area where the top skin attaches to the center spar. This proposed AD would reduce the inspection compliance time and repetitive inspection intervals. We are proposing this AD to detect and correct this cracking, which could reduce the residual strength of the top skin of the wings, and consequently affect the structural integrity of the airframe., 646915=We are superseding Airworthiness Directive (AD) 2009-06-06 for all Airbus Model A310 and A300-600 series airplanes. AD 2009-06-06 required revising the Airworthiness Limitations Section of the Instructions for Continued Airworthiness to incorporate new limitations and maintenance tasks for aging systems maintenance. This new AD requires revising the maintenance or inspection program to incorporate new maintenance requirements and airworthiness limitations. This AD was prompted by a determination that more restrictive maintenance requirements and airworthiness limitations are necessary. We are issuing this AD to prevent reduced structural integrity and reduced control of these airplanes due to the failure of system components., 1153397=We propose to supersede airworthiness directive (AD) 2002-13-11 for Eurocopter France (now Airbus Helicopters) Model EC120B helicopters. AD 2002-13-11 currently requires installing front and side covers on the cabin floor to protect the yaw control at both the pilot and co-pilot stations. Since we issued AD 2002-13-11, we have determined that the required actions should apply only to the cabin's right-hand pilot station. This proposed AD would retain the requirements of AD 2002-13-11 but for only the pilot station. These proposed actions are intended to prevent an object from sliding between the canopy and the cabin floor, loss of yaw control, and subsequent loss of helicopter control., 1037784=We propose to supersede Airworthiness Directive (AD) 96-18-06 for certain Airbus Model A320-211 and -231 airplanes. AD 96-18-06 currently requires visual inspections to detect cracks of the pressurized floor fittings at frame (FR) 36, and renewal of the zone protective finish or replacement of fittings with new fittings if necessary. Since we issued AD 96-18-06, an extended service goal analysis by the manufacturer revealed that the compliance times and repetitive inspection intervals should be reduced to meet the design service goal. This proposed AD would retain the requirements of AD 96-18-06, with reduced compliance times and repetitive inspection intervals. This proposed AD would also add Model A320-212 airplanes to the applicability. We are proposing this AD to detect and correct fatigue cracking in the pressurized floor fittings at FR 36, which could result in failure of a floor fitting and subsequent depressurization of the fuselage., 1042675=We propose to supersede Airworthiness Directive (AD) 98-18-26, for certain Airbus Model A320 series airplanes. AD 98-18-26 currently requires repetitive inspections to detect fatigue cracking of the front spar vertical stringers on the wings; and repair, if necessary. Since we issued AD 98-18-26, we have received reports that indicate new repetitive inspections having new thresholds and intervals are needed and that additional work is needed to accomplish the inspections on airplanes on which a previous modification has been accomplished. This proposed AD would require repetitive high frequency eddy current (HFEC) inspections for cracking of the radius of the front spar vertical stringers and the horizontal floor beam on frame 36, and a rototest inspection for cracking of the fastener holes of the front spar vertical stringers on frame 36, and repair if necessary. We are proposing this AD to detect and correct fatigue cracking of the front spar vertical stringers on the wings, which could result in the reduced structural integrity of the airframe., 1348989=We propose to supersede Airworthiness Directive (AD) 97-07-14, for certain Airbus Model A320-111, -211, and -231 airplanes. AD 97-07-14 currently requires modification of an area on the front spar of the wing center section by installing shims and new fasteners to reinforce pressure floor fittings. Since we issued AD 97-07-14, we have determined the need for repetitive inspections on airplanes on which the modification of the rib flange on the front spar of the wing center section has been done. This proposed AD would continue to require modifying the rib flange on the front spar of the wing center section by installing shims and new fasteners to reinforce pressure floor fittings; and would require repetitive high frequency eddy current inspections for cracking of the radius of the rib flanges and vertical stiffener at frame 36, a rototest inspection for cracking of the fastener holes of the rib flanges, repair if needed, and adding additional airplanes to the applicability. We are proposing this AD to prevent fatigue cracking on the rib flange area of the front spar of the wing center section, which can reduce the structural integrity of fuselage frame 36 and the wing center section., 97873=We are superseding Airworthiness Directive (AD) 95-26-11 for all Lockheed Martin Corporation/Lockheed Martin Aeronautics Company Model L-1011 series airplanes. AD 95-26-11 required repetitive inspections to detect cracking of the fittings that attach the aft pressure bulkhead to the fuselage stringers, repetitive inspections to detect cracking of the fittings and of the splice tab of the aft pressure bulkhead, and corrective actions if necessary. This new AD requires repetitive inspections to detect cracking of the fittings that attach the aft pressure bulkhead to the fuselage stringers, repetitive inspections to detect cracking of the fittings and of the splice tab of the aft pressure bulkhead, repetitive inspections for cracking of certain aft fuselage skin panels, a structural modification, a post-modification inspection program, and corrective actions if necessary. This AD was prompted by a determination that the fittings at stringer attachments to the upper region of the aft pressure bulkhead are subject to widespread fatigue damage (WFD). We are issuing this AD to prevent simultaneous failure of multiple stringer end fittings through fatigue cracking at the aft pressure bulkhead, which could lead to rapid decompression of the airplane., 1406235=We propose to adopt a new airworthiness directive (AD) for GA 8 Airvan (Pty) Ltd Model GA8-TC320 airplanes that would revise AD 2015-06-02. This proposed AD results from mandatory continuing airworthiness information (MCAI) originated by an aviation authority of another country to identify and correct an unsafe condition on an aviation product. The MCAI describes the unsafe condition as missing required engine mount fire seal washers, which could reduce the engine retention capability in the event of a fire. We are issuing this proposed AD to require actions to address the unsafe condition on these products., 767462=We are superseding Airworthiness Directive (AD) 2014-03-05, for certain Bombardier, Inc. Model BD-700-1A10 airplanes. AD 2014-03-05 required modification of the air data probes and sensors. This new AD continues to require modification of the air data probes and sensors. This new AD also adds airplanes to the applicability. This AD was prompted by a report that the manufacturer has determined that some completion centers used the heater current/brake temperature monitor unit (HBMU) logic circuit to control the line voltage of the drain mast heaters. We are issuing this AD to detect and correct an unannunciated failure of two pitot static probe heaters, which could affect controllability of the airplane in icing conditions., 354542=We are superseding Airworthiness Directive (AD) 2011-09-03 for all Lockheed Martin Corporation/Lockheed Martin Aeronautics Company Model 382, 382B, 382E, 382F, and 382G airplanes. AD 2011-09-03 required repetitive eddy current inspections to detect cracks in the center wing upper and lower rainbow fittings, and corrective actions if necessary; and repetitive replacement of rainbow fittings, which would extend the repetitive interval for the next inspection. This new AD requires reduced intervals for inspections of the upper rainbow fittings. This AD was prompted by analysis of in-service cracking, which has shown that a reduction in the inspection intervals is necessary for the upper rainbow fittings. We are issuing this AD to detect and correct fatigue cracking of the upper and lower rainbow fittings on the center wings, which could grow large and lead to the failure of the fitting and a catastrophic failure of the center wing., 700859=We are superseding Airworthiness Directive (AD) 2011-13-09 for all Airbus Model A330-200, -200F, and -300 series airplanes. AD 2011-13-09 required revising the maintenance program to incorporate new limitations and maintenance tasks for certain certification management requirements (CMRs). This new AD requires revising the maintenance or inspection program to incorporate new maintenance requirements and airworthiness limitations. This AD was prompted by a determination that more restrictive maintenance requirements and airworthiness limitations are necessary. We are issuing this AD to prevent safety-significant latent failures that would, in combination with one or more other specific failures or events, result in a hazardous or catastrophic failure condition., 786269=Title 14 published on 2015-01-01, 252401=We are revising airworthiness directive (AD) 2014-17-08 for all Pratt & Whitney Canada Corp. (P&WC) PT6A-114 and PT6A-114A turboprop engines. AD 2014-17-08 required initial and repetitive borescope inspections (BSIs) of compressor turbine (CT) blades, and the removal from service of blades that fail inspection. This new AD adds an additional single crystal CT blade, reduces the affected population, and corrects the Credit for Previous Action paragraph. This AD was prompted by P&WC development of an additional single crystal CT blade that corrects the unsafe condition. We are issuing this AD to prevent failure of CT blades, which could result in damage to the engine and damage to the airplane., 520434=We are superseding Airworthiness Directive (AD) 2007-22-10 for all Airbus Model A330-200, A330-300, A340-200, A340-300, A340-500, and A340-600 series airplanes. AD 2007-22-10 required repetitive inspections of the left-hand and right-hand wing main landing gear (MLG) rib 6 aft bearing lugs (forward and aft) to detect any cracks on the two lugs, and replacement if necessary. Since we issued AD 2007-22-10, we have received reports of additional cracking of the MLG rib 6 aft bearing forward lug. This new AD expands the applicability and reduces certain compliance times. We are issuing this AD to detect and correct cracking of the MLG rib 6 aft bearing lugs, which could result in collapse of the MLG upon landing., 1245386=We propose to supersede Airworthiness Directive (AD) 2011-24-05, for certain Airbus Model A330-201, -202, -203, -223, -243, -301, -302, -303, -321, -322, -323, -341, -342, and -343 airplanes; and Model A340-200 and -300 series airplanes. AD 2011-24-05 currently requires repetitive inspections for cracking of the hole(s) of the horizontal flange of the keel beam, and repair if necessary. Since we issued AD 2011-24-05, a determination was made that the rototest inspection and applicable corrective actions of a certain fastener hole were inadvertently omitted from the requirements in that AD. This proposed AD would change the inspection compliance times, and, for certain airplanes, would add a one-time ultrasonic inspection for cracking at a certain fastener hole. This proposed AD would also provide optional terminating action for the repetitive inspections. We are proposing this AD to detect and correct cracking of the fastener holes, which could result in rupture of the keel beam, and consequent reduced structural integrity of the airplane., 1580862=We propose to supersede Airworthiness Directive (AD) 2013-08-23, which applies to all The Boeing Company Model DC-10-10, DC-10-10F, DC-10-15, DC-10-30, DC-10-30F (KC-10A and KDC-10), DC-10-40, DC-10-40F, MD-10-10F, MD-10-30F, MD-11, and MD-11F airplanes. AD 2013-08-23 currently requires adding design features to detect electrical faults and to detect a pump running in an empty fuel tank. Since we issued AD 2013-08-23, we have determined that it is necessary to clarify the requirements for the design features and to remove a terminating action for certain inspections. This proposed AD would clarify certain requirements and remove a terminating action. This proposed AD would also provide an optional method of compliance for the proposed actions. We are proposing this AD to reduce the potential of ignition sources inside fuel tanks, which, in combination with flammable fuel vapors, could result in fuel tank explosions and consequent loss of the airplane., 174065=We are superseding airworthiness directive (AD) 2014-01-01 for all Turbomeca S.A. Arrius 2F turboshaft engines. AD 2014-01-01 required a one-time inspection of the ejector assembly nozzle of certain serial number (S/N) lubricating devices and, if a discrepancy was found, removal and replacement of the affected ejector assembly nozzle with a part eligible for installation. This AD requires the same action as AD 2014-01-01 and expands the list of affected S/N lubricating devices. This AD was prompted by the determination that additional lubricating devices, identifiable by S/N, may have an incorrect bonding of the nozzle on the ejector assembly. We are issuing this AD to prevent failure of the ejector assembly nozzle, which could lead to an in-flight shutdown (IFSD) of the engine, damage to the engine, and damage to the helicopter., 619850=We are superseding airworthiness directive (AD) 2012-14-06 for certain Rolls-Royce Corporation (RRC) 250-C20, -C20B, and -C20R/2 turboshaft engines. AD 2012-14-06 required a one-time visual inspection and fluorescent-penetrant inspection (FPI) on certain 3rd-stage and 4th-stage turbine wheels for cracks in the turbine blades. This new AD replaces the one-time visual inspection and FPI with repetitive visual inspections and FPIs. This AD also adds certain engine models to the applicability. This AD was prompted by the determination that the one-time inspections required by AD 2012-14-06 should be changed to repetitive inspections. We are issuing this AD to prevent failure of 3rd-stage and 4th-stage turbine wheel blades, which could cause engine failure and damage to the aircraft., 1209596=We propose to supersede Airworthiness Directive (AD) 2004-14-09, for certain Airbus Model A320-211, -212, and -231 airplanes. AD 2004-14-09 currently requires repetitive inspections for fatigue cracking of the lower surface panel on the wing center box, and repair if necessary; and modification of the lower surface panel on the wing center box, which constitutes terminating action for the repetitive inspections. Since we issued AD 2004-14-09, we have determined that, based on the average flight duration, the average weight of fuel at landing is higher than that defined for the analysis of the fatigue-related tasks; and that shot peening might have been improperly done on the chromic acid anodizing (CAA) protection, which would adversely affect fatigue crack protection. This proposed AD would reduce the compliance times for the repetitive inspections, and would require a repair for certain airplanes. We are proposing this AD to detect and correct fatigue cracking of the lower surface panel on the wing center box, which could result in reduced structural integrity of the airplane., 431690=We are superseding Airworthiness Directive (AD) 2014-04-14 for Agusta S.p.A. (Agusta) Model A109S, AW109SP, A119, and AW119 MKII helicopters. AD 2014-04-14 required removing certain rod end assemblies from service because of reports of fractures. This new AD retains the requirements of AD 2014-04-14 but expands the scope of applicable rod end assemblies. This AD was prompted by reports of additional fractured rod end assemblies. We are issuing this AD to prevent failure of a rod end assembly, which could result in damage to the main rotor assembly and loss of control of the helicopter., 679358=We are superseding airworthiness directive (AD) 2011-23-01 for all Technify Motors GmbH (TMG) models TAE 125-01 and TAE 125-02-99 reciprocating engines with certain part number (P/N) and serial number (S/N) clutch assemblies installed. AD 2011-23-01 required replacement of certain P/N and S/N clutch assemblies. This AD requires the same actions but expands the population of affected P/N and S/N clutch assemblies. This AD was prompted by an additional report of a clutch assembly that malfunctioned due to disk springs that received a nonconforming heat treatment process. We are issuing this AD to prevent failure of the clutch assembly, which could lead to failure of the engine, in-flight shutdown, and loss of control of the airplane., 930758=This document proposes superseding Airworthiness Directives (AD) 2000-05-17 and AD 2001-04-12, which apply to Eurocopter France (now Airbus Helicopters) Model EC120B helicopters. AD 2000-05-17 and AD 2001-04-12 require repetitive visual checks of the engine-to-main gearbox (MGB) coupling tube assembly (coupling tube) for a crack and replacing any cracked tube with an airworthy tube. This proposed AD would require removing certain engine mount parts from service, measuring the height of the engine mounting base for certain helicopters, replacing the engine mount if a certain height is exceeded, inspecting the flared coupling on certain helicopters for a crack, and replacing the coupling if it is cracked. Since we issued AD 2000-05-17 and AD 2001-04-12, there have been reports of additional cracks in coupling tubes. The proposed actions are intended to prevent coupling tube failure, loss of engine drive, and a subsequent forced landing of the helicopter., 916866=We propose to supersede Airworthiness Directive (AD) 97-02-02, which applies to certain Models SA26-AT, SA26-T, SA226-AT, SA226-T, SA226-T(B), SA226-TC, SA227-AC (C-26A), SA227-AT, SA227-BC (C-26A), SA227-CC, SA227-DC (C-26B), and SA227-TT airplanes. AD 97-02-02 currently requires applying torque to the control column pitch bearing attaching nuts, inspecting the bearing assembly, inspecting the elevator control rod end bearing retainer/dust seals, and replacing or installing new parts as necessary. Since we issued AD 97-02-02, an operator experienced a complete loss of elevator control because of failure of the bolt attaching the elevator control rod to the elevator walking beam under the cockpit floor. This proposed AD would prevent loss of pitch control, which if not corrected, could result in loss of airplane control. We are proposing this AD to correct the unsafe condition on these products., 852277=The FAA is withdrawing a notice of proposed rulemaking (NPRM). The NPRM proposed a new airworthiness directive (AD) that had applied to AlliedSignal oil scavenge pumps, part numbers (P/Ns) 101633-01 and -02 and Rajay Inc. oil scavenge pumps, P/Ns 1025-1 and -2 installed on Continental Motors, Inc. (CMI) IO-470 and TSIO-520 reciprocating engines and on Lycoming Engines, Inc., (Lycoming) IO-360, IO-540, and O-360 reciprocating engines. We have found no service difficulties with these model oil scavenge pumps when installed on the affected engines. Accordingly, we withdraw the proposed rule., 592127=We are superseding airworthiness directive (AD) 2013-15-10 that applies to certain Rolls-Royce plc (RR) RB211 turbofan engines. AD 2013-15-10 required inspecting the intermediate-pressure compressor (IPC) rotor shaft rear balance land for cracks. This AD requires inspecting the IPC rotor shaft rear balance land for cracks, eliminates a terminating action, expands one inspection, and eliminates certain other inspections. We are issuing this AD to detect cracking on the IPC rotor shaft rear balance land, which could lead to uncontained engine failure and damage to the airplane., 145724=We are superseding Airworthiness Directive (AD) 2013-18-01 for Eurocopter France Model EC 155B, EC155B1, SA-365N, SA-365N1, AS-365N2, AS 365 N3, and SA-366G1 helicopters. AD 2013-18-01 required inspecting the collective pitch lever for correct locking and unlocking conditions. As published, AD 2013-18-01 contained certain errors. This new AD retains the requirements of AD 2013-18-01, corrects the errors, and updates the type certificate holder's name. The actions in this AD are intended to detect an incorrectly adjusted collective pitch lever, which could result in loss of control of the helicopter., 291815=We are superseding Airworthiness Directive (AD) 2014-26-53 and AD 2015-03-02 for certain Airbus Model A319-115, A319-133, A320-214, A320-232, and A320-233 airplanes. AD 2014-26-53 required repetitive detailed visual inspections to detect discrepancies of the wing lower skin surface and inboard main landing gear (MLG) support rib lower flange location fasteners and, depending on findings, accomplishment of applicable corrective action(s). AD 2015-03-02 required repetitive detailed visual inspections of the outboard MLG support rib lower flange fasteners for discrepancies, and corrective actions if necessary. This new AD retains the repetitive detailed visual inspections to detect discrepancies of the fasteners located in the wing lower skin surface and inboard MLG support rib lower flange with extended compliance times and repetitive intervals, and accomplishment of applicable corrective actions. This new AD also retains the repetitive detailed visual inspections of the outboard MLG support rib lower flange fasteners for discrepancies, and corrective actions if necessary. In addition, this new AD adds airplanes to the applicability. This AD was prompted by a determination that certain airplanes were missing from the applicability of AD 2014-26-53 and AD 2015-03-02 and that those airplanes may be affected by the unsafe condition addressed in AD 2014-26-53 and AD 2015-03-02. We are issuing this AD to detect and correct discrepancies of the fasteners at the external surface of the lower wing skin and inboard and outboard MLG support rib lower flanges, which could result in an airplane not meeting its maximum loads expected in service. This condition could result in structural failure., 1158040=We propose to supersede Airworthiness Directive (AD) 2004-20-14, for all Airbus Model A300 B4-2C, B4-103, and B4-203 airplanes; and all Model A300 B4-600, B4-600R, and F4-600R series airplanes. AD 2004-20-14 requires repetitive inspections to detect cracking of the splice fitting at fuselage frame (FR) 47 between stringers 24 and 26 (left- and right-hand sides), and corrective actions if necessary. Since we issued AD 2004-20-14, we have determined that the inspection compliance time and repetitive inspection interval must be reduced to allow timely detection of cracks in the splice fitting at fuselage FR 47. This proposed AD would reduce the inspection compliance time and repetitive inspection intervals, and add Model A300 C4-605R Variant F airplanes to the applicability. We are proposing this AD to detect and correct cracking of the splice fitting at fuselage FR 47, which could result in reduced structural integrity of the airplane., 404753=We are superseding Airworthiness Directive (AD) 2014-23-15 for all Airbus Model A318, A319, A320, and A321 series airplanes. AD 2014-23-15 required revising the maintenance or inspection program to incorporate new, more restrictive airworthiness limitations. This new AD retains the requirement to revise the maintenance or inspection program and removes a conflicting requirement. This AD was prompted by a determination that certain limitations required by AD 2014-23-15 conflict with limitations required by another AD. We are issuing this AD to prevent fatigue cracking, accidental damage, or corrosion in principal structural elements, and possible failure of certain life limited parts, which could result in reduced structural integrity of the airplane.}",
    "lastModified": "Wed, 01 Jul 2015 20:01:41 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 37150 - Airworthiness Directives; Dassault Aviation Airplanes 2015-06-30; vol. 80 # 125 - Tuesday, June 30, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 14. Title 14 published on 2015-01-01. 67 FR 48003 447014011349 U.S.C. 106(g) § 39.27 — What do I do if the airworthiness directive conflicts with the service document on which , July 22, 2002, unless otherwise noted. Doc. No. FAA-2000-8460, Source: . , , Authority:",
    "textAfterTable": "Amendment 39-18195 AD 2015-13-08 DEPARTMENT OF TRANSPORTATION, Federal Aviation Administration Final rule; request for comments. This AD becomes effective June 30, 2015. We must receive comments on this AD by August 14, 2015. 14 CFR Part 39 Summary We are adopting a new airworthiness directive (AD) for all Dassault Aviation Model FALCON 2000EX airplanes. This AD requires revising the airplane flight manual to include a procedure for addressing minimum fan speed rotation (N1) values during stand-alone engine anti-ice system operation for engines equipped with certain air inlets. This AD was prompted by a quality review of recently delivered airplanes which identified a manufacturing deficiency of some engine air inlet anti-ice piccolo tubes. We are issuing this AD to detect and correct reduced performance of the engine anti-ice protection system, leading to ice accretion and ingestion into the engines, which could result in dual engine power loss and consequent reduced controllability of the airplane. 2015-06-29; vol. 80 # 124 - Monday, June 29, 2015 80 FR 36911 - Airworthiness Directives; Przedsiebiorstwo Doswiadczalno-Produkcyjne Szybownictwa “PZL-Bielsko” Sailplanes",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}