{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "ET Docket Nos.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2015-04032",
            "",
            "15-26, 11-90, 10-28, RM-11555, RM-11666, and WT Docket No. 11-202",
            "15-16"
        ]
    ],
    "pageTitle": "47 CFR 1.20006 - Assistance capability requirements. | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/1.20006",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917894003,
    "recordOffset": 917865740,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1017=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{52698=§ 1404 - National security restrictions on use of funds and auction participation, 28995=This document contains corrections to the final regulations to the Commission's rules which were published in the Federal Register on Thursday, November 6, 2014 (79 FR 65906). The Commission published a clarification in the Declaratory Ruling, which clarifies how the Commission intends to preserve the “coverage area” of eligible broadcasters in the repacking process associated with the broadcast television spectrum incentive auctions. This document contains corrections to the adopted date., 92413=The Auction 1000 Request for Comment initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals. The Auction 1000 Request for Comment includes specific proposals, including on determination of the initial broadcast television spectrum clearing target, opening bid prices, benchmarks for the final stage rule, and the final television channel assignment process, and seeks comment on those proposed procedures., 53227=Title 47 published on 2014-10-01, 86611=In this document, the Wireless Telecommunications Bureau (Bureau) further extends the deadline for filing comments on the Auction 1000 Request for Comment, which initiates the pre-auction process by which the Federal Communications Commission will develop detailed procedures for the broadcast television spectrum incentive auction, taking into account public comment received in response to its proposals., 52616=§ 1403 - Enforcement, 33768=This document amends procedural rules implemented by the Commission's 2011 determination that docketing and electronic filing be utilized in proceedings involving “[n]ewly filed formal common carrier complaints and newly filed pole attachment complaints before the Enforcement Bureau.” The rule changes also apply to future filings made in existing Section 208 formal complaints and pole attachment complaints. In addition, the amendments make a few procedural changes to existing Section 208 formal complaint and pole attachment complaint filing rules to create uniformity among them and ease of administration for parties and staff when initiating service of pleadings or filing confidential matters with the Commission. The rules further establish a single electronic inbox within Electronic Comment Filing System (ECFS) to handle the initial filing of the above-identified new complaints. Accepted complaints will receive a distinct ECFS docket number; rejected complaints will remain on ECFS but will be stored within the Inbox., 157982=The Federal Communications Commission published a document in the Federal Register of October 27, 2014 (79 FR 63883), regarding Petitions for Reconsideration filed of Action in a rulemaking proceeding. The document contained the incorrect deadline for filing replies to an opposition to the Petition. This document revises the deadline for replies to an opposition to the Petition., 66958=In this document, the Federal Communications Commission (Commission) proposes to authorize radar applications in the 76-81 GHz band. The Commission seeks to develop a flexible and streamlined regulatory framework that will encourage efficient, innovative uses of the spectrum and to allow various services to operate on an interference-protected basis. In doing so, it further seeks to adopt service rules that will allow for the deployment of the various radar applications in this band, both within and outside the U.S. The Commission takes this action in response to a petition for rulemaking filed by Robert Bosch, LLC (Bosch) and two petitions for reconsideration of the 2012 Vehicular Radar R&O., 52841=§ 1451 - Deadlines for auction of certain spectrum}",
    "lastModified": "Wed, 08 Apr 2015 21:15:55 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 15688 - Cargo Airlines Association Petition for Expedited Declaratory Ruling 2015-03-25; vol. 80 # 57 - Wednesday, March 25, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. A manufacturer of telecommunications transmission or switching equipment and a provider of telecommunications support service shall, on a reasonably timely basis and at a reasonable charge, make available to the telecommunications carriers using its equipment, facilities, or services such features or modifications as are necessary to permit such carriers to comply with the assistance capability requirements of 47 U.S.C. 1002. (c) Telecommunications carriers shall consult, as necessary, in a timely fashion with manufacturers of its telecommunications transmission and switching equipment and its providers of telecommunications",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Exemption. Effective March 25, 2015. 47 CFR Parts 1 and 64 Summary In this document, the Commission grants a request to exempt package delivery notifications from the Telephone Consumer Protection Act's (TCPA) restrictions on autodialed and prerecorded calls and messages to wireless telephone numbers, as long as consumers are not charged and may easily opt out of future messages if they wish, among other pro-consumer conditions. Congress gave the Commission the authority to exclude from this prohibition calls and texts that are not charged to the called party, subject to conditions necessary to protect the called party's privacy rights. This action is necessary to allow wireless consumers to receive package delivery notifications that will be welcome both as a convenience and as a way to guard against package theft. 2015-03-03; vol. 80 # 41 - Tuesday, March 3, 2015 80 FR 11326 - Reform of Rules and Policies on Foreign Carrier Entry Into the U.S. Telecommunications Market GPO FDSys XML |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}