{
    "relation": [
        [
            "First Name",
            "Stacey",
            "Laurie"
        ],
        [
            "Last Name",
            "Long",
            "Young"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=7AE37356-992C-418A-BC1A-5C7CCB33A1FA&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224085685,
    "recordOffset": 224077483,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31937=Housing Non Discrimination Act HR 4828. Lobbied in support of ammending the Fair Housing Act to prohibit housing discrimination based on the basis of sexual orientation or gender identity and the civil rights act of 1964 to prohibit such discrimination in housing accomodations and public facilities and for other purposes., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 14948=Emplyment Non Discrimination Act HR 3014 and S 1584. Lobbied in support of passing this act to end discrimination based on sexual orientation and gender identity., 23320=Safe Schools Improvement Act HR 2262. Lobbied in support of instructing school districts to implement anti harrassment policies that specifically include sexual orientation and gender identity, provide funding for anti bullying programs and require states to collect data on bullying and harrassment in schools., 12251=End Racial Profiling Act HR 3618 and S 1670, lobbied in support of this bill., 17729=Uniting American Families Act HR 1024 and S 424. Lobbied for allowing lesbian, gay, bisexual and transgender people in the United States who cannot get married and who's marriages are not recognized under federal law to sponsor partners for citizenship and permanent residency., 20627=Runiting Families HR 2709 Lobbied in support of this bill as stand alone legislation., 34868=Comprehensive Immigration Reform HR 2892 and S 3932. Lobbied in support of.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  JULIE CHILDS  2023935177  jchilds@thetaskforce.org 5. Senate ID#  306658-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}