{
    "relation": [
        [
            "Date",
            "Apr 19, 2011",
            "Jul 23, 2014"
        ],
        [
            "Code",
            "CC",
            "FPAY"
        ],
        [
            "Event",
            "Certificate of correction",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7895079 - Method and device utilizing polymorphic data in e-commerce - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7895079?ie=ISO-8859-1&dq=6188988",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474989699,
    "recordOffset": 474952979,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22383=This application is a continuation of U.S. application Ser. No. 09/730,489 (scheduled to issue as U.S. Pat. No. 6,993,506 on 31 Jan. 2006) entitled “Method and Device Utilizing Polymorphic Data in E-Commerce” by Mudita Jain, Jari Koistinen, Charles Boyle and Brian Hayes filed on 5 Dec. 2000.}",
    "textBeforeTable": "Patent Citations While the present invention is disclosed by reference to the embodiments and examples detailed above, it is understood that these examples are intended in an illustrative rather than in a limiting sense. It is contemplated that modifications and combinations will readily occur to those skilled in the art, which modifications and combinations will be within the spirit of the invention and the scope of the following claims. Each method practicing the present invention may readily be recast as a device or article of manufacture. It is inherent in the present invention that methods practicing the present invention can be expressed as articles of manufacture by describing the method as embodied in a program stored on a magnetic medium. It is further inherent that those methods can be expressed as a broker server device running the broker portion of the method or as a system including buyer, broker and supplier servers running their respective portions of the method. . Cancellation and error messages, referred to above, are described by schemas following the general form of the schemas presented in the examples. FIG. 2 Additional aspects of a system practicing the present invention may include forwarding a purchase order, as depicted in </schema> </elementtype>  </extends>",
    "textAfterTable": "May 22, 1997 Feb 8, 2000 Currency Scientific, Inc. Polymorphic data structures for secure operation of a virtual cash system US6049785 Mar 2, 1998 Apr 11, 2000 Open Market, Inc. Open network payment system for providing for authentication of payment orders based on a confirmation electronic mail message US6125391 Oct 16, 1998 Sep 26, 2000 Commerce One, Inc. Market makers using documents for commerce in trading partner networks US6195651 * Nov 19, 1998 Feb 27, 2001 Andersen Consulting Properties Bv System, method and article of manufacture for a tuned user application experience US6256664 * Mar 19, 1999 Jul 3, 2001 Bigfix, Inc. Method and apparatus for computed relevance messaging US6341353 Dec 10, 1999 Jan 22, 2002 The Brodia Group Smart electronic receipt system US6697824 * Aug 31, 1999 Feb 24, 2004 Accenture Llp Relationship management in an E-commerce application framework US6968513 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}