{
    "relation": [
        [
            "Related Topic",
            "IPv4 BGP configuration tasks",
            "Multiprotocol BGP configuration tasks",
            "BGP and multiprotocol BGP commands: complete command syntax, command mode, defaults, usage guidelines, and examples",
            "Cisco nonstop forwarding",
            "IPv6 supported feature list",
            "IPv6 commands: complete command syntax, command mode, defaults, usage guidelines, and examples"
        ],
        [
            "Document Title",
            "Cisco IOS IP Routing Protocols Configuration Guide",
            "Cisco IOS IP Routing Protocols Configuration Guide",
            "\"BGP Commands,\" Cisco IOS IP Routing Protocols Command Reference",
            "\"Cisco Nonstop Forwarding,\" Cisco IOS High Availability Configuration Guide",
            "\"Start Here: Cisco IOS Software Release Specifics for IPv6 Features,\" Cisco IOS IPv6 Configuration Guide",
            "Cisco IOS IPv6 Command Reference"
        ]
    ],
    "pageTitle": "IPv6 Configuration Guide, Cisco IOS Release 12.4T - Implementing Multiprotocol BGP for IPv6 [Cisco IOS Software Releases 12.4 T] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/ipv6/configuration/12-4t/ipv6-12-4t-book/ip6-mptcl-bgp.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371141523,
    "recordOffset": 371103734,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{244991=RFC 2545, 154078=Router(config-route-map)# set ip next-hop 10.21.8.10, 245304=RFC 2858}",
    "textBeforeTable": "Related Documents Additional References set ip next-hop 10.21.8.10 route-map rmap permit 10 ! neighbor 2001:DB8:yyyy::2 route-map rmap in neighbor 2001:DB8:yyyy::2 peer-group 6peers neighbor 6peers soft-reconfiguration inbound neighbor 6peers activate address-family ipv4 neighbor 2001:DB8:yyyy::2 remote-as 65002 neighbor 6peers peer-group ! router bgp 65000  The following example advertises IPv4 routes between IPv6 peers when the IPv6 network is connecting two separate IPv4 networks. Peering is configured using IPv6 addresses in the IPv4 address family configuration mode. The inbound route map named rmap sets the next hop because the advertised next hop is likely to be unreachable.   Example Advertising IPv4 Routes Between IPv6 Peers   redistribute rip address-family ipv6 unicast no bgp default ipv4-unicast router bgp 64900  The following example redistributes RIP routes into the IPv6 unicast database of the local router:   Example Redistributing Prefixes into IPv6 Multiprotocol BGP   match ipv6 address prefix-list cisco route-map rtp permit 10 ipv6 prefix-list cisco seq 10 permit 2001:DB8::/24 neighbor 2001:DB8:0:CC00::1",
    "textAfterTable": "Standards Standards Title No new or modified standards are supported by this feature, and support for existing standards has not been modified by this feature. -- MIBs MIBs MIBs Link None To locate and download MIBs for selected platforms, Cisco software releases, and feature sets, use Cisco MIB Locator found at the following URL: http://www.cisco.com/go/mibs RFCs RFCs Title RFC 2545",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}