{
    "relation": [
        [
            "Information",
            "CPU usage",
            "Process state",
            "Disk usage",
            "Memory",
            "Network status",
            "Reboot server",
            "Collect Traces/logs"
        ],
        [
            "Linux Command",
            "top",
            "ps",
            "df/du",
            "free",
            "netstats",
            "reboot",
            "Sftp, ftp"
        ],
        [
            "Serviceability GUI Tool",
            "RTMT Go to View tab and select Server > CPU and Memory",
            "RTMT Go to View tab and select Server > Process",
            "RTMT Go to View tab and select Server > Disk Usage",
            "RTMT Go to View tab and select Server > CPU and Memory",
            "",
            "Log in to Platform Web page on the server Go to Restart > Current Version",
            "RTMT Go to Tools tab and select Trace > Trace & Log Central"
        ],
        [
            "CLI commands",
            "Processor CPU usage: show perf query class Processor Process CPU Usage for all processes: show perf query counter Process \"% CPU Time\" Individual process counter details (including CPU usage) show perf query instance",
            "show perf query counter Process \"Process Status\"",
            "show perf query counter Partition\"% Used\" or show perf query class Partition",
            "show perf query class Memory",
            "show network status",
            "utils system restart",
            "List file: file list Download files: file get View a file: file view"
        ]
    ],
    "pageTitle": "Cisco Unified Communications Manager Managed Services Guide, Release 9.0(1) - Cisco Unified Communications Manager systems management and monitoring [Cisco Unified Communications Manager (CallManager)] - Cisco",
    "title": "Table 8 Summary of CLI commands and GUI selections",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cucm/service/9_0/rtmt/CUCM_BK_CCC892E7_00_cucm-managed-services-guide-90/CUCM_BK_CCC892E7_00_cucm-manager-managed-services-guide_chapter_011.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00012-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361702579,
    "recordOffset": 361651957,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{32246=The Appliance's software image contains all security updates and patches made to firmware, drivers, native OS, database and Cisco Unified CM application components. Customers who keep current with Cisco maintenance releases are automatically covered for security updates. For more details, refer to the Application Note \"Appliance Security Update Process for Cisco Unified Communications Manager\" (C27-412838-00), available on request from your Cisco account team.}",
    "TableContextTimeStampAfterTable": "{46774=Cisco CDP advertises Cisco Unified Communications Manager to other applications, so the application, for example, SNMP or CiscoWorks2000, can perform network management tasks for Cisco Unified Communications Manager., 36445=This service provides SNMP access to variables that are defined in RFC 1213, which read and write variables; for example, system, interfaces, IP, and so on.}",
    "textBeforeTable": "The following table provides a summary of the CLI commands and GUI selections that you can use to gather information troubleshoot various system problems. Cisco Unified Communications Manager server with root access disabled. This section provides a quick reference for commands and utilities to help you troubleshoot a Useful commands and utilities When you switch versions by using Cisco Unified Communications Operating System Administration or the CLI, you get a message reminding you about the requirement to reset database replication if you are reverting to an older product release. If you revert the servers in a cluster to run an older product release, you must manually reset database replication within the cluster. To reset database replication after you revert all the cluster servers to the older product release, use the utils dbreplication reset command all on the publisher server. Reset database replication when reverting to prior release Then, use the utils dbreplication stop and then utils dbreplication reset all commands on the publisher server. If the servers are not in Replication State 2, use the utils dbreplication stop command on all subscriber servers. Solution   ",
    "textAfterTable": "Related documentation It supplements but does not replace the existing documentation including the following: Maintain and operate guides index at http:/​/​www.cisco.com/​en/​US/​products/​sw/​voicesw/​ps556/​prod_​maintenance_​guides_​list.html Cisco Unified Communications Manager Serviceability Administration Guide Cisco Unified Communications Manager Serviceability System Guide Changing the IP Address and Hostname for Cisco Unified Communications Manager 5.x, 6.x, and 7.x Servers Cisco Unified Communications Real-Time Monitoring Tool Administration Guide Cisco Unified Communications Operating System Administration Guide Disaster Recovery System Administration Guide Install and upgrade guides index at http:/​/​www.cisco.com/​en/​US/​products/​sw/​voicesw/​ps556/​prod_​installation_​guides_​list.html Replacing a Single Server or Cluster for Cisco Unified Communications Manager Upgrading to Cisco Unified Communications Manager Installing Cisco Security Agent for Cisco Unified Communications Manager For documentation for CDR/CMR, see the following documents: For Cisco Unified CM Release 8.0(1) http:/​/​www.cisco.com/​en/​US/​docs/​voice_ip_comm/​cucm/​service/​8_0_1/​cdrdef/​cdradmin.html",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}