{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "JOHNNY THUNDERS & WAYNE KRAMER NY Dolls + MC5: Gang War! | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/JOHNNY-THUNDERS-WAYNE-KRAMER-NY-Dolls-MC5-Gang-War/220793918834?_trkparms=aid%3D444000%26algo%3DSOI.DEFAULT%26ao%3D1%26asc%3D20131113144648%26meid%3D7707159763160649932%26pid%3D100029%26prg%3D20131113144648%26rk%3D5%26rkt%3D15%26sd%3D221214928968",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424935055,
    "recordOffset": 424880517,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75914=In 1979, JOHNNY THUNDERS, legendary Heartbreakers and New York Dolls guitarist, teamed up with WAYNE KRAMER, equally legendary guitarist of Detroit’s seminal MC5, to form ‘GANG WAR’, an alliance that lasted the best part of a year. , 78842=SMALL PRINT: Payment Paypal is smoothly integrated into ebay, and works well.  If you don’t have PayPal or want to pay by credit-card, you can still do so through PayPal.  Just don’t log into an account, and look for the button saying ‘Pay by credit-card’.  We also accept cheques from UK banks in Pounds Sterling, and UK Postal Orders.  Checks in US Dollars from US banks can be accepted with a $3 surcharge.  PayPal eCheques and orders paid by any method outside of PayPal may take longer to process and be subject to delays. Postage UK and particularly international postage charges have risen sharply (May 2012).  The amount we charge is what we expect to pay plus approx 20-30p for packing materials.  Multiple items postage If you are ordering multiple items, there will be automatic approximated reduction in postage costs – but make sure you order them together, not individually.  If the estimate still looks excessive, don't pay but click on the 'Request total from seller' button in the shopping basket.  We'll then recalculate the costs for your combined items postage and send you an invoice.  The postage may or may not calculate as less; we’re trying to refine the accuracy of the automation. (Note: the date printed on our postage is two days after we print it, ie the date it remains valid until with Royal Mail.) Problem? We want you to be really happy with your purchase.  If you’re not, or something’s gone wrong, please message us.  We will do our very best to resolve any problem.  If our item description isn’t quite right, or you think we’ve overcharged on postage, please let us know instead of marking down our ebay feedback.  If you have an order problem you’d like to resolve quickly, you can try phoning us on +44(0)208 537 3445.  Good manners are appreciated! Ebay Messaging The ebay messaging system doesn’t include your name, date of purchase or payment, or even the order reference number!  It’ll help us deal with your query faster if you can include those.  Please remember, the ebay shop is not our main business so we may not always respond immediately; but we will get back to you.}",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). receiving cleared payment - opens in a new window or tab. Will usually dispatch within 3 working days of Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Seller ships within 3 days after receiving cleared payment - opens in a new window or tab. Wed. 12 Aug. and Thu. 20 Aug. Estimated between",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}