{
    "relation": [
        [
            "Chunk",
            "merged73",
            ""
        ],
        [
            "Target category",
            "Variability: high priority",
            "Variability: low priority"
        ],
        [
            "primtarget",
            "0x81000000",
            "0x80800000"
        ],
        [
            "# of targets",
            "318",
            "660"
        ],
        [
            "Selection",
            "See text, and i < 19.5",
            "See text, and 19.5 ≤ i < 21"
        ]
    ],
    "pageTitle": "Data products: Spectra: Special plates - SDSS DR7",
    "title": "",
    "url": "http://classic.sdss.org/dr7/products/spectra/special.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 50416975,
    "recordOffset": 50399762,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32980=In Chunk 22, observed in Fall 2001, we used direct extensions of the main survey target selection algorithms. In particular, the main galaxy sample (Strauss et al. 2002) was modified only slightly, by removing the cut on objects with half-light Petrosian r band surface brightness μ50,r below 24.5 mag/arcsec2. This adds less than one object per square degree., 40698=We have carried out a survey of low-redshift galaxies to 2 magnitudes fainter than the SDSS main sample limit in order to add more low-luminosity galaxies to the sample. Our redshift selection used photometric redshifts derived from second-order polynomial fits to observed Petrosian r magnitudes and model colors, with separate fits done in bins of model g-r color. For Chunks 45, 52, and 62, we used the SDSS EDR photometry and spectroscopy then available to derive photometric redshifts, while for Chunks 74 and 97, we were able to derive improved photometric redshifts using catalog-coadded Stripe 82 SDSS photometry, combined with all available SDSS redshift data on the Southern Equatorial Stripe as of 11 July 2003. This included much of the data taken for the express purpose of calibrating the photometric redshift relation in the SDSS photometric system., 49721=For objects that satisfied the above cuts, the quantity exp[c((g-r) - (0.40 +0.6(u-g)))] was calculated; if it was larger than a random number chosen between zero and one, the object was targeted for spectroscopy. The coefficient c=0.1411 was chosen to obtain an appropriate density of targets. Note that plates 672 and 809 have the same center, and some of the same objects were inadvertently observed twice., 21612=SEGUE data obtained prior to the start of SDSS-II (July 1, 2005) is being made available to general users as part of the SDSS-I data release on a limited basis as effort permits. SEGUE was given a head start, and a number of SEGUE program plates were observed during SDSS-I, which are being released now to the public. A more detailed explaination of targeting is linked from the SEGUE section of the target selection algorithms page. SEGUE stellar spectroscopy does not fill the sky. The full three year program will distribute approx. 200 pointings around approx. 2pi steradians, sampling the Galaxy's halo and disks at a spacing with approximately 10 to 20 degree separations. Each of the 200 pointings will have a pair of 640 fiber plates observed, with 550 brighter (13 < g < 18) and 550 fainter (18 < g < 20) stars targeted in each pointing. The approximate number of targets in each stellar category, as well as approximate color cuts for these categories, are tabulated below. The colors are dereddened; the s-color is a linear combination of (u-g), (g-r), (r-i) which runs parallel to the stellar locus from F5-M0; p1(s) is a color perpendicular to s (and thus the stellar locus)., 52117=The SDSS LRG sample (Eisenstein et al. 2001) targets high-redshift (0.2 < z < 0.55), luminous galaxies by their colors and magnitudes. As part of Southern targeting, we have explored this algorithm in several ways. The first, the Deep LRG sample, uses double-length spectroscopic exposures to get higher S/N spectra of LRGs with z > 0.25 which satisfied the Cut I criteria from Eisenstein et al. 2001. These serve two purposes: first, to obtain measurements of velocity dispersion for galaxies where the current, single-pass spectroscopy is only \"good enough for a redshift\". Second, given the discontinuity in targeting algorithm at z ≅ 0.4 (the distinction between Cut I and Cut II; see Eisenstein et al. 2001) higher S/N spectra allow the exploration of possible spectroscopic differences at this transition, implying differences in stellar populations. XXX This sounds a bit rough., 27046=As part of an exploration of the full stellar locus, as well as a search for unusual objects of all sorts, we carried out a survey of all stellar objects (\"Spectra of Everything\"), which was used as a filler for a series of so-called merged program plates, which included a mixture of mostly extragalactic targets. In 2002 (chunk merged48), this included a random sampling of all point sources with clean photometry (see the discussion of fatal and non-fatal flags in Richards et al. 2002) with reddening-corrected i-band PSF magnitudes brighter than 19.1. Not surprisingly, the vast majority of the targets were chosen from the densest core of the stellar locus in color-color space., 64634=As discussed above, the Southern Equatorial Stripe has been imaged multiple times in the course of the SDSS, allowing photometric variability to be studied. Variable sources were selected for follow-up spectroscopy using pairs of observations of unique unsaturated point sources with i < 21, and requiring that the changes in the g and r bands exceed 0.1 mag, and are at least 3 sigma significant (using error estimates computed by the photometric pipeline). The time difference between the two observations varied from 56 days to 1212 days., 19715=NOTE Among the SEGUE plates, plate 1664 is a special radial-velocity standards plate which targets F, G and K stars (mostly dwarfs). It includes very faint stars and has been observed twice to explore the accuracy of radial velocity determinations at faint magnitudes. Thus, the table below does not include counts for objects from plate 1664 with its fainter magnitude limits., 50762=Imaging scans were taken centered roughly on the Perseus cluster at z ≅ 0.018, and were used to target galaxies. The double exposure plates 1665, 1666 targeted, and obtained redshifts for, approximately 400 galaxies as faint as rfiber = 18.8 in a region centered on the cluster at (α,δ) = (49.96°, 41.53°). The majority of the galaxies are associated with the cluster, although there are 50 objects in a background overdensity at z≅0.05 (Brunzendorf & Meusinger 1999). These plates also included approximately 300 foreground F-stars.}",
    "textBeforeTable": "Special plates Back to spectra Overview table of special programs Note that querying special-plate spectra and joining them to their photometry data requires special care. See special-query caveat and the SEGUE sample SQL query. The Programname is stored in the platex table in the CAS. See the SQL sample query showing how to use the extra spectra and the sample query for special spectra. The links in the Program column point to the tables below describing individual target flags and targeting criteria.    Search    Helpdesk    DR Papers    Known Issues    Glossary    FAQ Help",
    "textAfterTable": "Imaging available in CAS, either in BESTDR6 or SEGUEDR6 (see SEGUE sample SQL query) seguetest84 1665-1666 Perseus-Pisces F stars and galaxies Imaging available only in DAS fstar72 1468,1471,1472 F stars, quasars in M31 Imaging available only in the DAS. fstar51 1149,1150,1152-1155 F stars Double-length exposures fstar29 797 F stars Imaging not available lowz45, lowz52, lowz62, lowz74, lowz97 1021-1037, 1156, 1157, 1243, 1538, 1539, 1541-1543, 1551, 1555-1566, 1859 Low-z galaxies, Deep LRG, BCGs Double-length exposures merged73 1473-1476, 1485-1502, 1504-1518,1521-1523,1529 Complete Main, u-band galaxies, Spectra of Everything, Variability, High Proper motion stars, Fainter LRG Standard merged program merged48 1062-1096, 1101, 1103-1108, 1114-1117 Complete Main, u-band galaxies, Double-lobed radio sources, faint quasars, Spectra of Everything Standard merged program rockosi50 1133-1135,1137,1143 MS Turnoff stars munn49 1118-1132 Thick and thin disk photoz21, photoz29, photoz79 669-672, 807-810, 1629, 1632-1636 photo-z loveday29 811 low-z galaxies annis29 802-806 low-z galaxies south22 673-714 Main Extension: Galaxies, Quasars Extensions of standard algorithms Schlegel/Locus 323-324 Stellar locus Descriptions of individual programs and primtarget categories Note The descriptions on this page pertain to targeting cateogries,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}