{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 4737 words Completed: Oct 2012 Languages: English to Turkish",
            "Translation Volume: 100000 words Completed: Aug 2012 Languages: English to Turkish",
            "Translation Volume: 2158 words Completed: Oct 2011 Languages: Turkish to English",
            "Translation Volume: 3575 words Completed: Oct 2011 Languages: Turkish to English",
            "Translation Volume: 1798 words Completed: Jun 2011 Languages: English to Turkish",
            "Translation Volume: 3696 words Completed: Mar 2011 Languages: English to Turkish",
            "Translation Volume: 40000 words Completed: Jan 2011 Languages: English to Turkish",
            "Translation Volume: 100000 words Duration: Sep 2011 to Dec 2011 Languages: English to Turkish"
        ],
        [
            "Project Summary",
            "Translation of JetScan iFX i400 guide Involved in the Multilingual Project, including the Translation of JetScan iFX i400 guide, for Cummins Allison as the Turkish translator IT (Information Technology)",
            "GAIA AG Lilly Diabetes Motivational Interviewing (LDMI) Webcoach Involved in the 2-Month Lasting Multilingual Project, including the Translation (Adaptation) of Shell, Handouts, and PO files for the Project of \"GAIA AG Lilly Diabetes Motivational Interviewing (LDMI) Webcoach\" from English into Turkish Medical (general)",
            "Four Page Translation of a Clinical Trial Translation of the clinical trial with title of \"Postoperative pain therapy after laparoscopic cholecystectomy: paracetamol versus diclofenac\" from Turkish into English, which has been published in Journal of The Turkish Society of Algology; AGRI 2010; 22(3): 117-120 Medical (general)",
            "Six Page Translation of an Experimental and Clinical Study Translation of the Experimental and Clinical Study with title of \"Does i.v. paracetamol have preemptive analgesic effect on lumbar disc surgeries?\" from Turkish into English, which has been published in Journal of The Turkish Society of Algology; AGRI 2008; 20(2): 14-19 Medical (general)",
            "6 page translation of European Patent Specification Medical (general)",
            "21-page Pfizer ECG Procedure Manual Translation of Biomedical Systems Corporation Centralized ECG Procedure Manual Medical: Instruments",
            "\"Localization of Online Video Game [Maestia]\" Worked in the Maestia project in the localization of the online game Maestia as a freelance translator in colloboration with Bigpoint Localization Department, Hamburg, Germany. Games / Video Games / Gaming / Casino",
            "Localization of many online/video games Localization of many online/video games in different genres (RPG, soccer, etc.) from English to Turkish Games / Video Games / Gaming / Casino"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment.",
            "positive On Target Consulting & Translation Services, LLC™: Excellent quality translations from highly technical (medical) documents.",
            "positive On Target Consulting & Translation Services, LLC™: Excellent quality translations from highly technical (medical) documents.",
            "positive On Target Consulting & Translation Services, LLC™: Great quality",
            "No comment.",
            "positive Blue Board outsourcer (5 to 10 entries): good quality and right on time! Colleague feedback: Bahadir Turan: No comment.",
            "positive ProZ.com member : No comment."
        ]
    ],
    "pageTitle": "English/German to Turkish Translator specialized in Medicine (with a 3-year undergraduate study in Medicine)",
    "title": "",
    "url": "http://www.proz.com/translator/1342226",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 665252591,
    "recordOffset": 665205975,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "8 projects entered    5 positive feedback from outsourcers    1 positive feedback from colleagues Project History PRO-level points: 103, Questions answered: 65 KudoZ activity (PRO) Less More Philosophy Management Business/Commerce (general) Chemistry; Chem Sci/Eng Education / Pedagogy Tourism & Travel General / Conversation / Greetings / Letters Computers: Systems, Networks Environment & Ecology Livestock / Animal Husbandry Psychology Social Science, Sociology, Ethics, etc. Archaeology Patents Science (general)",
    "textAfterTable": "More Less Blue Board entries made by this user  13 entries Access to Blue Board comments is restricted for non-members. Click the outsourcer name to view the Blue Board record and see options for gaining access to this information. Outsourcer name Country LWA Comment Outsourcer feedback Accento, The Language Company United States 5 Hidden Hidden TranslationGenius® / Genius Group (previously On Target Immigration & Translation Services™) United Kingdom 5 Hidden Hidden Papyrus Translation Turkey 5 Hidden Hidden Merkez Ltd / Formerly: Gizce Translation Turkey 5 Hidden Hidden",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}