{
    "relation": [
        [
            "Patent application number",
            "20100107200",
            "20110023080",
            "20140250476"
        ],
        [
            "Description",
            "CONVERTING VIDEO DATA INTO VIDEO STREAMS - A data streaming server, including at least one data storage device, at least one controller configured to control at least one of data transmission to- and reception from- the device, and at least one packet processor adapted to process streaming data and exchange data with the data storage device without passing the data through the controller, but while using the control by the controller. Related apparatus and methods are also described.",
            "CONTROLLED RATE VOD SERVER - A distributed stream processing system including a plurality of storage devices, at least one of which is configured to process at least one segment of a data stream, thereby producing a changed segment of the data stream, and provide output of at least the changed segment of the data stream, and a server configured to accept the output of the storage devices and combine the output into a transport stream. A method for combining a plurality of data streams including using one or more storage devices for processing at least one segment of a data stream, thereby producing a changed segment of the data stream, and providing output of at least the changed segment of the data stream, and combining the output of the storage devices into a combined data stream. Related apparatus and methods are also described.",
            "CONTROLLED RATE VOD SERVER - A distributed stream processing system including a plurality of storage devices, at least one of which is configured to process at least one segment of a data stream, thereby producing a changed segment of the data stream, and provide output of at least the changed segment of the data stream, and a server configured to accept the output of the storage devices and combine the output into a transport stream. A method for combining a plurality of data streams including using one or more storage devices for processing at least one segment of a data stream, thereby producing a changed segment of the data stream, and providing output of at least the changed segment of the data stream, and combining the output of the storage devices into a combined data stream. Related apparatus and methods are also described."
        ],
        [
            "Published",
            "04-29-2010",
            "01-27-2011",
            "09-04-2014"
        ]
    ],
    "pageTitle": "Nir - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/nir-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430516307,
    "recordOffset": 430480126,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Nir Drang, Hod-Hasharon IL 05-30-2013 Nanoparticles for Targeted Delivery of Active Agents to the Lung - The present invention concerns a delivery system administered to the lung preferably by inhalation comprising a polymer-based nanoparticle; and a linker comprising a first portion non-covalently anchored to said nanoparticle, wherein at least part of said first portion comprises a hydrophobic/lipophilic segment embedded in said nanoparticle; and a second portion comprising a coupling group, preferably a maleimide compound, exposed at the outer surface of said nanoparticle. In accordance with one embodiment, the delivery system comprises one or more targeting agents, each covalently bound to said coupling group, preferably maleimide compound, and is administered as an aerosol in the therapy or diagnosis of lung cancer or bronchial dysplasia. In accordance with yet another embodiment, the delivery system comprises a drug and/or a radiopharmaceutical and/or a contrasting agent. A specific example for a linker in accordance with the invention is octadecyl-4-(maleimideomethyl)cyclohexane-carboxylic amide (OMCCA). 20130136688 10-30-2008 Nanoparticles for Targeted Delivery of Active Agent - The present invention concerns a delivery system comprising a polymer-based nanoparticle; and a linker comprising a first portion non-covalently anchored to said nanoparticle, wherein at least part of said first portion comprises a hydrophobic/lipophilic segment embedded in said nanoparticle; and a second portion comprising a maleimide compound exposed at the outer surface of said nanoparticle. In accordance with one embodiment, the delivery system comprises one or more targeting agents, each covalently bound to said maleimide compound.",
    "textAfterTable": "Patent applications by Nir Drang, Hod-Hasharon IL Nir Dvash, Petach-Tikva IL Patent application number Description Published 20110321149 SYSTEM AND METHOD FOR AUTHENTICATING A SOURCE OF RECEIVED ELECTRONIC DATA - A method for verifying and identifying users, and for verifying users' identity, by means of an authentication device capable of transmitting, receiving and recording audio or ultrasonic signals, and capable of converting the signals into digital data, and performing digital signal processing. Voice pattern(s) and user(s) information of one or more authorized user(s) are recorded and stored on the authentication device. User(s) identification is verified by inputting to the authentication device a vocal identification signal from a user, and comparing the voice pattern of the vocal identification signal with the recorded voice pattern(s) of the authorized user(s), and if a match is detected issuing an indication that the user is identified as an authorized user. 12-29-2011 20130218571 SYSTEM AND METHOD FOR IDENTIFYING AND/OR AUTHENTICATING A SOURCE OF RECEIVED ELECTRONIC DATA BY DIGITAL SIGNAL PROCESSING AND/OR VOICE AUTHENTICATION - A method for verifying and identifying users, and for verifying users' identity, by means of an authentication device capable of transmitting, receiving and recording audio or ultrasonic signals, and capable of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}