{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Tips for prospective students",
            "Bang for the buck",
            "Am enjoying being here",
            "Am learning a lot"
        ],
        [
            "Comments",
            "This school is amazing for students that are looking for a good school that also has opportunities to relax when you need to. And of course there are tons of clubs! Also, this is a research institution so if you are going into a professional school that would look at research experience, this is a spectacular place to go!",
            "I think my number one advice is definitely GO TO CLASS! So much money is going into your education why let it go to waste? And besides, you could find that you really love your classes if you put time into them. Another tip of mine is of course study. A half hour to an hour per day of studying notes (this doesn't include homework) from each class starting the first day was enough to ROCKET my grades upwards compared to last year. Don't procrastinate! The other advice I can give you, which is also very important, HAVE FUN. Don't burn yourself out! Make sure that you reward yourself for how hard you've been working at least on the weekend. Trust me, you will thank yourself for it. Go to the CUB, there is always something to do there! And remember... GO COUGS!",
            "Some of the classes are rigorous and take time. But this is a good thing! This school wants so badly for us to all succeed and go on to professional schools if need be. There is SO much help offered here including the writing center, free tutoring 5 days a week at the CUB, and chemistry TA office hours ALL DAY monday through thursday. This and just going to your classes makes this school so worth the cost of college.",
            "Are you kidding me? This is WSU! Of course I enjoy being here! And despite what you hear, it is not all about partying here. The school holds concerts, probably hundreds of clubs, and we also have these things called up all nights at out Compton Union building (CUB) which are themed with things like Halloween, Hawaiian, and game night! WSU gives me so much opportunity to other things besides drown in my school work. GO COUGS!",
            "Most of the professors I've had are amazing! They are entertaining and you can tell that they love what they are teaching. I find that as long as I go to class (which I recommend), the topics end up being interesting and studying comes easier. I truly am learning a lot."
        ]
    ],
    "pageTitle": "Washington State University (WSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Washington-State-University/reviews?_escaped_fragment_=/show/84454",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915634127,
    "recordOffset": 915432932,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{75914=I've been in contact with WSU for over a year now and it's been a huge hassle every step of the way. You have fees for this and fees for that. Classes start in August, but your academic advisor won't be back until September and you can't register because there's a new-student hold on your account, but if you don't register for the Fall semester, they'll charge you a fee and expel you from attending for two semesters., 995325=Don't take all of your clothes at once when school starts in August! In the hot months of August and September you don't need the snow gear necessary in December-February., 739077=There are a bazillion hills in Pullman, so be prepared to get a workout going to class and build up your 'Cougar Calves.' The weather is also extremely bipolar--apparently it snows in May, so be prepared for that. Also, don't feel pressured into going Greek because other reviews say that if you don't join a frat or a sorority, you're left out--both Greeks and non-Greeks have amazing opportunities., 1013715=Okay, some dorms are worth five, six, or seven stars. However, there are plenty that don't, so I'm averaging this at three stars. First of all, the August and September months are tough without air conditioning, but that's not a big fault. What is problematic, though, is the age of a few buildings, which comes with a variety of unwanted extras. Extra-strange smells, curvatures in the wood, leaks... etc. Nevertheless, WSU has extraordinary service that attempts to fix these as soon as possible. Sometimes, though, the wear on the oldest buildings show., 566046=WSU is actually getting really expensive. The tuition rate had the largest increase out of all the universities in Washington and we now have the highest tuition. It jumped about $1500., 595634=There are a couple of dinning options available on campus that can be paid with RDA (room and dinning assistance) if you are living in a dorm, Cougar Cash (gives discounted meal price), cash, or debit. The meals provided by these dining centers include breakfast, lunch, and dinner. Food include: pizza, sandwiches, burgers, fries, salad bar, fruits, cereal, pastries, cakes, ice-cream, etc. Drinks include: soda, juice, coffee, milk, tea, shakes, smoothies, etc. These dining centers are located north and south of campus and are open from 6:00 a.m. to 7:00 p.m. There are late night dinning centers that are open from 6:00 a.m. to 1:00 a.m. for people who plan to eat later. The best dining center in WSU is Flix which serves juicy burgers and fresh fries, milkshakes, lattes, frappes, and Italian sodas. There are two television screens for football fans and pool table. Flix also sells convince store items for students.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 69 out of 70 people found this review useful. 1 of 284 John from Clarkston, WA Check out reviews left by other students or leave your own review. You could win a free scholarship. Washington State University Reviews Washington State University › Washington › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Laurel from Conifer, CO 12/30/2009 Reviewer is A current student here. 32 out of 33 people found this review useful. 2 of 284 Categories Comments Great for these types of students Anyone! Students interested in Hospitality, Agriculture, Veterinary and Architecture: Washington State is excellent in these fields. Tips for prospective students Keep those grades up, it's getting competitive! :) Bang for the buck As an out of state student I have a much higher tuition price than most, but Washington State is very good at offering scholarships and loans. I receive a scholarship making my out of state tuition almost the price of instate tuition. It is so worth it though. Like I said the earlier, the campus is awesome, the people are extremely friendly and helpful, and scholarships are plentiful. Am enjoying being here As an out of state student I can say that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}