{
    "relation": [
        [
            "",
            "CIS 110",
            "CIS 111",
            "OST 137"
        ],
        [
            "",
            "Introduction to Computers",
            "PC Literacy",
            "Office Software Applications"
        ],
        [
            "C-L-SHC",
            "2-2-3",
            "1-2-2",
            "2-2-3"
        ]
    ],
    "pageTitle": "Catalog - Registrars Office, CCCC - Central Carolina Community College",
    "title": "",
    "url": "http://www.cccc.edu/registrar/catalog/2008-2010/business/",
    "hasHeader": true,
    "headerPosition": "NONE",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 360087443,
    "recordOffset": 360057083,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{364937=Last updated Wednesday, 28 January 2015 Page Issues? Web Admin Find us on Facebook Find us on MySpace Follow us on Twitter Watch us on YouTube}",
    "textBeforeTable": "A. General Education Courses (16 SHC) Course Requirements for Accounting Degree Program Sites: Lee Campus - Day Program, Selected Evening; Distance Education Career Pathway Option: Associate in Applied Science Degree in Accounting Program Length: 4 semesters Academic Standards: See General Academic Standards. Entrance Standards: See General Admission Standards. Graduates should qualify for entry-level accounting positions in many types of organizations including accounting firms, small businesses, manufacturing firms, banks, hospitals, school systems, and governmental agencies. With work experience and additional education, an individual may advance in the accounting profession. In addition to coursework in accounting principles, theories, and practice, students will study business law, finance, management, and economics. Related skills are developed through the study of Communication, computer applications, financial analysis, critical thinking skills, and ethics. The Accounting curriculum is designed to provide students with the knowledge and the skills necessary for employment and growth in the accounting profession. Using the \"language of business,\" accountants assemble and analyze, process, and communicate essential information about financial operations. Accounting Credential: Associate in Applied Science Degree in Accounting A25100 Business Technologies College Catalog 2008-2010 Table of Contents Money for College College Services Distance Education Continuing Education",
    "textAfterTable": "Humanities/Fine Arts Elective 3-0-3 *MAT 140 Survey of Mathematics 3-0-3 Social/Behavioral Science Elective 3-0-3 B. Required Major Core Courses (23/24 SHC) C-L-SHC ACC 120 Principles of Financial Accounting 3-2-4 ACC 121 Principles of Managerial Accounting 3-2-4 ACC 129 Individual Income Taxes 2-2-3 ACC 220 Intermediate Accounting I 3-2-4 BUS 115 Business Law I 3-0-3 **CIS 110 Introduction to Computers 2-2-3 Select One (3 SHC) C-L-SHC ECO 151 Survey of Economics 3-0-3 ECO 251 Prin of Microeconomics 3-0-3 ECO 252 Prin of Macroeconomics 3-0-3 *Student may substitute MAT 115 (nontransferable). **Student may substitute CIS 111 (nontransferable). C. Other Major Hours Required for Graduation (28 SHC) C-L-SHC ACC 122 Principles of Financial Accounting II 3-0-3 ACC 130 Business Income Taxes 2-2-3 ACC 140 Payroll Accounting 1-2-2 ACC 150 Acct Software Appl 1-2-2 ACC",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}