{
    "relation": [
        [
            "Application",
            "Employer compliance",
            "Employer compliance maximum fee"
        ],
        [
            "$CAN",
            "230",
            "690"
        ]
    ],
    "pageTitle": "Fee list",
    "title": "",
    "url": "http://www.cic.gc.ca/English/information/fees/fees.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367822597,
    "recordOffset": 367806203,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1100=Note: New fees to be paid by employers and open work permit applicants are being introduced on February 21, 2015. There is also a new process that employers must follow when hiring Labour Market Impact Assessment-exempt foreign workers.}",
    "textBeforeTable": "Citizenship – Fees 1. Citizenship Other applications and services Right of Permanent Residence Fee Applications to remain in Canada as a permanent resident Applications for eTAs, visas and permits Citizenship Most of our applications require you to pay a fee. Information on fees can be found in the application guides. Read about the changes and how they may affect you. Note: New fees to be paid by employers and open work permit applicants are being introduced on February 21, 2015. There is also a new process that employers must follow when hiring Labour Market Impact Assessment-exempt foreign workers. Fee list Pay your fees My Application Immigration & citizenship Home You are here: More services Taxes Health Benefits Business Travel Immigration Jobs Topics menu",
    "textAfterTable": "Application $CAN Adult Grant of Citizenship (Adoption) 530 Adult Grant of Citizenship 530 Adult Grant of Citizenship for Stateless Persons Born to a Canadian Parent (Subsection 5(5)) - Right of Citizenship 100 Minor Grant of Citizenship (Adoption) 100 Minor Grant of Citizenship 100 Minor Grant of Citizenship for Stateless Persons Born to a Canadian Parent (Subsection 5(5)) - No fee 0 Change of Citizenship – Fees Application $CAN Retention of Citizenship 100 Adult Resumption of Citizenship 530 Minor Resumption of Citizenship 100 Renunciation of Citizenship 100 Renunciation of Citizenship (for certain persons who acquired citizenship on April 17, 2009) (R7.1) - No fee 0 Citizenship Status Documents – Fees Application $CAN Proof of Citizenship 75 Search for Record of Citizenship 75 2. Applications for Electronic Travel Authorizations, visas and permits Permanent Resident Visas – Fees Family Class applicants Application $CAN Sponsorship application (per application) 75 Principal applicant 475 Principal applicant, if under 19 years of age and not a spouse or common-law partner (including a dependent child",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}