{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students"
        ],
        [
            "Comments",
            "We're in Boston. The whole city is out there.",
            "With the new dining hall on Bay State Road, I feel comfortable in rating the food a solid four stars. While the food does become a little repetitive, health and tasty options are alway available.",
            "There are many different dorm options for both returning and incoming students. Students can choose the dorm that is right for them, and most of the time are very happy with their choice. Despite there being no in depth survey of likes and dislikes, I have yet to meet anybody who is not happy with their roommate",
            "As a student on a science track, Boston University requires students to dedicate a substantial amount of time to academics. In particular, the Chemistry 101 course, required for nearly all students majoring in a natural science, is extremely challenging.",
            "If you are an incoming freshman, don't feel that you have to live in Warren. You can be very happy living in another dorm if you feel that the atmosphere of Warren Towers isn't right for you. Incoming science/pre-meds: Chem is going to be hard. Start preparing now, and be willing to start studying right from the beginning."
        ]
    ],
    "pageTitle": "Boston University (BU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Boston-University/reviews?_escaped_fragment_=/show/80356",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900952215,
    "recordOffset": 900818631,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{296198=Definitely visit campus before applying as the city life is not for all people. Also, study hard because Boston University accepts mainly AP class kids and 2000 SAT score kids., 40346=As soon as I visited BU on Accepted Students Day in Spring of 2010 I knew I wanted to go here! Ever since it's been perfect. I can absolutely see myself here for the completion of my undergraduate career. The only reason why I'm not really considering it for graduate school is because of the weather - coming from Maine, I'm already sick of the winters. I always say that BU is in its own corner of Boston; if we want to stay only around college peers all we have to do is stay on campus, but there's literally a 5 minute walk to Kenmore Square, 10 minutes to Fenway, and 20 minutes to Newbury St. It's amazing!, 584975=It is what you make of it, Busy schedules don't leave a lot of time for social interaction on the floor. I met my roommate on BU facebook page class of 2017. We chatted for several weeks before we felt we were compatible. We love the same music, books, poetry and we are both science majors. Our floor has monthly meetings, but we haven't had any social outings yet., 548355=The new mean SAT score at BU is 2016, and it's rising every year-- 2013 had an all time low admittance rate of around 30%. It sits right across the river from the mavericks: MIT and Harvard-- and it's doing everything in its power to compete., 612040=Unfortunately, SATs are one of the most important things BU looks at when awarding financial aid. Make sure you score above a 1950 and you'll probably get a merit scholarship., 694949=© 2015, Cappex.com, LLC, 608687=There is a huge seal on the ground in Marsh Plaza (located in central campus) that is rumored to hold bad luck (namely, no diploma awarded) for those students who walk over it. After graduation in May, one can see many graduated seniors triumphantly standing on top of it, having their pictures taken., 225778=I love living in Warren Towers. It houses about 1800 students (primarily freshman) and you get that true dorm living lifestyle!, 329832=All dining foods are great. There are special nights in each dormitory where chefs come in and compete. The GSU (student union center) also has good food. There is a new dining place opening fall 2012 with a whole new variety. There are literally tons of good restaurants in nearby Boston that anyone could access although the food may be a little overpriced., 126853=Let this be a cautionary tale for those with tight budgets (or budgets at all...)- This is the only field I can really fill out- I just got accepted here as a transfer student, and I was nominated for a scholarship through my community college. Shortly after my acceptance, however, I received notice of my financial aid assistance. Out of the $50,000+ in tuition and fees, I was eligible to receive only $9,100, which includes the loans they offered me, which is a hole I am not planning on digging for myself. No- I did not receive my scholarship, and I was frankly not expecting to. A scholarship is a gift, a happy surprise. But still - the ONLY need-based aid they were willing to give me was my $2600 Pell Grant! Seriously? Let me give you my background- I am one of four children. We live in a *tiny* condo. Only *one* of my parents works full-time, and his pay schedule is at times unreliable. OK, we do have enough money to eat, be clothed, and have heating and electricity, but still! We don't go on exotic vacations. We do stay-cations in Boston. Or sometimes hop on a bus to NYC to visit my aunt and baby cousins. C'mon. I'm sorry, no matter how great of an academic/social/whatever experience other students have had, this is a big deal-breaker. I kind of hope this some mistake- someone forgot to add an extra zero, or they fell asleep at the calculator. But I am only too sure that I would be so wrong., 352084=You name it they have it. I am into music, accapella and theater groups. However, there are so many to mention. SPLASH, in September, is where they all come together.}",
    "textBeforeTable": "07/30/2009 Reviewer is A current student here. 82 out of 82 people found this review useful. 1 of 159 Alex from Waco, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Boston University Reviews Boston University › Massachusetts › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Cristina from Haverstraw, NY 07/16/2009 Reviewer is A current student here. 26 out of 29 people found this review useful. 2 of 159 Categories Comments Great for these types of students Great for anyone! There is definitely something for anyone as long as you are willing to look. Tips for prospective students Save save save your money and work work work hard! Then you will get the bang for your buck. Bang for the buck Simply put, BU is expensive. Am enjoying being here There is so much to do here! Thousands of students that provide student-led activities as well as the school providing stuff to do. For example, at BU Central, students book bands to come and play for students for FREE! The school also does things for students, like teh parade held last year to honor the hockey team in their national victory.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}