{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have great officers, so the students are well protected. They have officers and student workers that patrol the campus daily.",
            "Greek Life at AU has been getting better. There have been many fraternities and sororities coming back on campus.",
            "We have a lot of clubs. I believe over 60. AU try their best in planning great activities for the students and they are usually entertaining.",
            "Any students who want a great education and want to receive a full college experience",
            "We have the spartan spot where students go to get fast food, watch television, and also play pool. We have a lot of traditions and one of them is pancake night.",
            "People usually go to local parties if there are any around. Aurora is a train ride from Chicago. Also we our close to tinsel town movie theater where AU students get a discount of $4.25 for a movie.",
            "The food is okay but there will come a time when you miss your home cook meals.",
            "Dorm life is great it is a way to stay connect on campus. Also AU have nice size rooms.",
            "If you want to be a successful student at AU you should stay involved and also use the great resources; for example, free tutoring, counseling center, and also the professors office hours.",
            "Aurora University is great if you are looking for a school that is small, have a good student- teacher ratio, and also very fun."
        ]
    ],
    "pageTitle": "Aurora University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Aurora-University/reviews?_escaped_fragment_=/show/71778",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00198-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904000727,
    "recordOffset": 903943244,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{291069=© 2015, Cappex.com, LLC, 180017=I got food poisoning last December from the cafe. I went to the hospital and brought back a doctors note and brought it to the manager. He did nothing. He didnt even e-mail me back. He simply apologized when I spoke to him in person and has avoided me since., 129931=I haven't taken any courses yet because i dont start school until Aug. but I sat in a class session and it seemed to be quite rigorous., 175264=Campus safety is a joke. There was a bomb threat the first month of the 2012-2013 school year.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 16 out of 16 people found this review useful. 1 of 68 Becca from Illinois Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp =",
    "textAfterTable": "Bang for the buck AU is a private school, but if you qualify for scholarships and grants it isn't bad. The classes are small and you get individual attention from the professors. They can call you by name within a few classes periods. AU offers amazing teachers and a quality education that you can be proud of. Am enjoying being here I love AU, but as a senior with an internship I do not have alot of time for the extras. As of now AU does not offer any classes on-line. As a non traditional student with a family that is the one thing I would like to see even if only for the gen. ed classes. Am learning a lot I am a non traditional student who transferred from a community college. The education is wonderful, the professors challenge the students and the education is all the better for it. When you leave you will be prepared. Login to rate or flag the reviews Vanessa from Elk Grove Village, IL 10/13/2010 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}