{
    "relation": [
        [
            "id",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13"
        ],
        [
            "Super pathways (with members indented)",
            "SIDS Susceptibility Pathways36",
            "Interleukin-1 signaling53 Show member pathways IL-1 Signaling Pathway36 IL1-mediated signaling events36",
            "Prolactin signaling pathway29 Show member pathways Prolactin Signaling Pathway36 Development Prolactin receptor signaling58 Leptin signaling pathway36",
            "Development Endothelin 1 EDNRA signaling58 Show member pathways Inflammatory mediator regulation of TRP channels29 Estrogen signaling pathway29 GnRH signaling pathway29 Cytoskeleton remodeling FAK signaling58 Development Endothelin 1 EDNRA transactivation of EGFR58",
            "B Cell Receptor Signaling Pathway36 Show member pathways B cell receptor signaling pathway29 BCR signaling pathway36 TCR Signaling Pathway36 T cell receptor signaling pathway29",
            "Apoptosis Pathway59 Show member pathways Akt Pathway59 NF-kappaB Pathway59",
            "Endometrial cancer29 Show member pathways Colorectal cancer29 Signal transduction PTEN pathway58 Acute myeloid leukemia29",
            "Glioma29 Show member pathways Melanoma29 Non-small cell lung cancer29 Bladder cancer29 Prostate cancer29 Signaling Pathways in Glioblastoma36",
            "Integrated Breast Cancer Pathway36",
            "Thyroid cancer29",
            "Interferon Signaling53 Show member pathways ISG15 antiviral mechanism53 Cytokine Signaling in Immune system53 Regulation of IFNG signaling53 Interferon gamma signaling53 Antiviral mechanism by IFN-stimulated genes53",
            "NOD-like Receptor Signaling Pathways52 Show member pathways Toll-Like receptor Signaling Pathways52 Pathogen or Damage-activated C-Type Lectin Receptor Signaling Pathways52 Inflammasome Activation Pathways52 Mucin expression in CF via TLRs, EGFR signaling pathways58 IL-1 Family Signaling Pathways52 Immune response Role of TLRs 3 and 4 in cell antiviral response TICAM1 specific signaling pathways58 Immune response IL 1 signaling pathway58",
            "Signaling by Interleukins53 Show member pathways Interleukin-3, 5 and GM-CSF signaling53 Interleukin-1 processing53 Regulation of signaling by CBL53 Interleukin-6 signaling53 Interleukin-2 signaling53 Interleukin-7 signaling53 Interleukin receptor SHC signaling53"
        ],
        [
            "Score",
            "9.4",
            "9.4",
            "9.1",
            "9.1",
            "9.1",
            "9.1",
            "9.0",
            "9.0",
            "9.0",
            "9.0",
            "8.6",
            "8.6",
            "8.6"
        ],
        [
            "Top Affiliating Genes",
            "IL1RN, IL1B",
            "IL1B, IL1RN",
            "KRAS, IL1RN",
            "KRAS, IL1B",
            "KRAS, IL1B",
            "KRAS, IL1B",
            "KRAS, CDH1",
            "CDH1, KRAS",
            "CDH1, KRAS",
            "CDH1, KRAS",
            "IL1RN, IL1B, KRAS",
            "KRAS, IL1B, IL1RN",
            "KRAS, IL1B, IL1RN"
        ]
    ],
    "pageTitle": "Gastric Cancer Risk After H. Pylori Infection disease: Malacards - Research Articles, Symptoms, Drugs, Genes, Clinical Trials",
    "title": "",
    "url": "http://www.malacards.org/card/gastric_cancer_risk_after_h_pylori_infection",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 563347743,
    "recordOffset": 563305144,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "(show all 13) Pathways related to Gastric Cancer Risk After H. Pylori Infection according to GeneCards Suite gene sharing: See all sources R&D Systems 52 Tocris Bioscience, 59 Thomson Reuters, 58 KEGG, 29 Reactome, 53 NCBI BioSystems Database, 36 PathCards, 48 Sources: Pathways for genes affiliated with Gastric Cancer Risk After H. Pylori Infection Jump to section Aliases & Classifications Anatomical Context Animal Models Compounds Drugs & Therapeutics Expression Genes Genetic Tests GO Terms Pathways Products Publications Related Diseases Sources Summaries Symptoms Variations Top Bottom GEO for disease gene expression data for Gastric Cancer Risk After H. Pylori Infection. Search See all sources Gene Expression Omnibus DataSets 15 Sources:",
    "textAfterTable": "Jump to section Aliases & Classifications Anatomical Context Animal Models Compounds Drugs & Therapeutics Expression Genes Genetic Tests GO Terms Pathways Products Publications Related Diseases Sources Summaries Symptoms Variations Top Bottom Compounds for genes affiliated with Gastric Cancer Risk After H. Pylori Infection Sources: 43Novoseek, 12 DrugBank, 49 PharmGKB, 24 HMDB, 28 IUPHAR, 59 Tocris Bioscience, 2 BitterDB See all sources Compounds related to Gastric Cancer Risk After H. Pylori Infection according to GeneCards Suite gene sharing: (show top 50)    (show all 69) id Compound Score Top Affiliating Genes 1 anakinra43 12 10.9 IL1RN, IL1B 2",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}