{
    "relation": [
        [
            "Play Type",
            "Walk",
            "Error-wild-pitch",
            "Single",
            "Home-run",
            "Out",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Ross Gload walked. Runner on first with none out and Wes Helms due up.",
            "Ross Gload advanced to second on a wild pitch. Runner on second with none out and Wes Helms at the plate.",
            "Wes Helms reached first on Alberto Gonzalez's throwing error. Runners on first and second with none out and Jeremy Hermida due up.",
            "Jeremy Hermida none-out, three-run Home Run 2 (3) to right-center scored Ross Gload and Wes Helms. Hanley Ramirez due up.",
            "Hanley Ramirez popped out to first. None on with one out and John Baker due up.",
            "John Baker grounded out second to first. None on with two outs and Dan Uggla due up.",
            "Dan Uggla struck out swinging to end the inning."
        ]
    ],
    "pageTitle": "Saturday, April 18, 2009 Miami Marlins - Washington Nationals Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Marlins_Nationals/2009/04/18",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 54451151,
    "recordOffset": 54440015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2354=View all MLB box scores for 4/18/2009}",
    "textBeforeTable": "Top of the 1st Tim Timmons  3B Mark Wegner  2B Jeff Kellogg  1B Rob Drake  H Umpires 9.53 13 18 1 0 1 1 1 1 Wilfredo Ledezma  4.05 16 32 2 2 1 2 0 1 Julian Tavarez (L, 0-1) 9.00 20 27 3 0 3 3 3 1 Joel Hanrahan (BS, 2) 1.35 11 20 0 0 0 0 1 1 Joe Beimel (H, 3) 9.00 71 103 5 1 2 3 6 7 Scott Olsen  ERA Strikes Pitches SO BB ER R H IP Name 1.59 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Nationals pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/nationals_22t.png 10 17 1 0 0 0 0 1.1 Kiko Calero (W, 1-0) 3.38 17 29 2 1 0 0 0 1.2 Dan Meyer  2.25 15 21 0 1 0 0 1 1 Renyel Pinto  4.50 13 21 3 1 0 0 0 1 Logan Kensing  2.91 70 101 6 2 6 6 6 6 Josh Johnson  ERA Strikes Pitches SO BB ER R H IP Name Hit by pitch: Nick Johnson \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Marlins pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/marlins_22t.png",
    "textAfterTable": "Single Ryan Zimmerman singled to center scoring Anderson Hernandez with none out. Runners on first and third and Adam Dunn due up. Walk Adam Dunn walked. Bases loaded with none out and Elijah Dukes due up. Out Josh Bard struck out looking. Bases loaded with one out and Austin Kearns due up. Home-run Austin Kearns one-out, Grand Slam (2) to left scored Nick Johnson, Ryan Zimmerman and Adam Dunn. Roger Bernadina due up. Out Roger Bernadina flied out to left. None on with two outs and Alberto Gonzalez due up. Out Alberto Gonzalez grounded out second to first to end the inning. Top of the 2nd Play Type Play Single Jorge Cantu singled to left. Runner on first with none out and Dan Uggla due up. Out Dan Uggla grounded into a fielder's choice, third to second. Runner on first with one out and Ronny Paulino due up. Home-run Ronny Paulino one-out, two-run Home Run (1) to center scored Dan Uggla. Cody Ross due up. Double Cody Ross doubled to center. Runner on second with one out and Cameron Maybin due up. Walk Cameron Maybin walked. Runners on first and second with one out",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}