{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Public Notice"
        ],
        [
            "regulations.gov",
            "2014-30232",
            "1400-AD25",
            "8979"
        ]
    ],
    "pageTitle": "22 CFR Part 126 - GENERAL POLICIES AND PROVISIONS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/22/part-126",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918011931,
    "recordOffset": 917996380,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1046=Title 22 published on 2014-04-01.}",
    "TableContextTimeStampAfterTable": "{19888=In an effort to streamline, simplify and clarify the recent revisions to the International Traffic in Arms Regulations (ITAR) made pursuant to the President's Export Control Reform (ECR) initiative, the Department of State is amending the ITAR as part of the Department of State's retrospective plan under Executive Order 13563 completed on August 17, 2011., 49135=The Department of State proposes to amend the International Traffic in Arms Regulations (ITAR) to clarify requirements for the licensing and registration of U.S. persons providing defense services while in the employ of foreign persons. This amendment is pursuant to the President's Export Control Reform effort, as part of the Department of State's retrospective plan under Executive Order 13563 completed on August 17, 2011. The Department of State's full plan can be accessed at http://www.state.gov/documents/organization/181028.pdf ., 40795=Title 22 published on 2014-04-01, 39134=§ 2791 - General provisions, 40472=Executive Order ... 12918, 38993=§ 2780 - Transactions with countries supporting acts of international terrorism, 7309=The Department of State is correcting a final rule that appeared in the Federal Register of July 1, 2014 (79 FR 37536) and making other, minor changes., 38784=§ 2752 - Coordination with foreign policy, 39223=§ 2797 - Licensing, 38887=§ 2778 - Control of arms exports and imports, 11515=On May 24, 2013, the Department of State published a rule (78 FR 31444) proposing to amend the International Traffic in Arms Regulations (ITAR) by revising Category XV of the U.S Munitions List (USML) as part of the President's Export Control Reform (ECR) effort. After review of comments to the proposed rule, on May 13, 2014, the Department published an interim final rule that allowed a final comment period until June 27, 2014. The Department is now making final the interim final rule and correcting the interim final rule that appeared in the Federal Register of May 13, 2014., 28558=The Department of State is correcting a final rule that appeared in the Federal Register of January 2, 2014 (79 FR 34). The final rule amended the International Traffic in Arms Regulations (ITAR) as part of the President's Export Control Reform (ECR) effort.}",
    "lastModified": "Mon, 01 Jun 2015 06:40:45 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 30614 - Amendment to the International Traffic in Arms Regulations: Policy on Exports to the Republic of Fiji 2015-05-29; vol. 80 # 103 - Friday, May 29, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 22. Title 22 published on 2014-04-01. 22 U.S.C. 287c22 U.S.C. 2651a27912780 58 FR 39312, July 22, 1993, unless otherwise noted. Source: ; E.O. 12918, 59 FR 28205; 3 CFR, 1994 Comp., p. 899; Sec. 1225, Pub. L. 108-375; Sec. 7089, Pub. L. 111-117; Pub. L. 111-266; Section 7045, Pub. L. 112-74; Section 7046, Pub. L. 112-74. ; , and 2797); E.O. 11958, 42 FR 4311; 3 CFR, 1977 Comp., p. 79; ,",
    "textAfterTable": "DEPARTMENT OF STATE Final rule. This rule is effective on May 29, 2015. 22 CFR Part 126 Summary The Department of State is revising the International Traffic in Arms Regulations (ITAR) to rescind the previous policy of denying the export of defense articles and defense services to Fiji. 2014-12-29; vol. 79 # 248 - Monday, December 29, 2014 79 FR 77884 - Amendment to the International Traffic in Arms Regulations: United States Munitions List Category XI (Military Electronics), Correction, and Other Changes GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2014-30232 RIN 1400-AD25 Public Notice 8979 DEPARTMENT OF STATE Final rule; correction and correcting",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}