{
    "relation": [
        [
            "Nutritional Information",
            "Energy Value",
            "Protein",
            "Carbohydrate of which sugar",
            "Fat",
            "Dietary Fiber",
            "Salt",
            "Caffeine of which from Guarana extract",
            "Taurine"
        ],
        [
            "Per 100 ml",
            "6,3 kJ (1,5 Kcal)",
            "0 g",
            "0 g 0g",
            "0 g",
            "0 g",
            "0 g",
            "32 mg 2 mg",
            "400 mg"
        ],
        [
            "Per Serving (250ml)",
            "15,75 kJ (3,8 Kcal)",
            "0 g",
            "0 g 0g",
            "0 g",
            "0 g",
            "0 g",
            "80 mg 5 mg",
            "1000 mg"
        ]
    ],
    "pageTitle": "Dark Dog Energy Drink - Home",
    "title": "",
    "url": "http://www.darkdog-energydrink.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 393672303,
    "recordOffset": 393651316,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{159141=©DARK DOG 2015, 1520=The DARK DOG trademark was created in Austria in 1995. The final concept was approved and launched in 2000. The product successfully entered the Latin America market in 2003, and today DARK DOG is a leading and top-recognized brand worldwide, in countries like Paraguay, Uruguay, Chile, Sweden, Austria, France, etc. DARK DOG is one of the best energy drinks and distributed in more than 30 countries worldwide.}",
    "textBeforeTable": "More Information Water, sugar, blood orange juice (13%), orange juice (12%), carbon dioxide, taurine, citric acid, guaraná extract, elderberry extract, caffeine, flavours, safflower extract, vitamins (C, niacin, pantothenic acid, B2, B6, B1). Ingredients DARK DOG Energy Drink is available in cans of 250 ml, 330 ml, 355 ml, 500 ml and 568 ml. The orange energy drink contains 25% orange juice, 13% of which is delicious blood orange juice from Sicily, Italy. As well as lots of Vitamin C, it also features the B Vitamins found in all DARK DOG drinks (Niacin, Pantothenic Acid, B6, B2 and B1) and caffeine extracted from the guarana berry. DARK DOG ORANGE is a fruity and fizzy energy drink full of vitamin C. Each can contains 100% of the recommended vitamin C daily allowance, offering the perfect healthy start to an action-packed day.   1,5l   1l   0,5l",
    "textAfterTable": "More Information Nutritional Information Per 100 ml Per Serving (250ml) Energy Value 213 kJ (50 Kcal) 532 kJ (125 Kcal) Protein 0 g 0 g Carbohydrate of which sugar 12,1 g 12,1 g 30,3 g 30,3 g Fat 0 g 0 g Dietary Fiber 0 g 0 g Salt < 0,005 g < 0,013 g Caffeine of which from Guarana extract 32 mg 2 mg 80 mg 5 mg Taurine 400 mg 1000 mg More Information Nutritional Information Per 100 ml Per Serving (250ml) Energy Value 213 kJ (50 Kcal) 532 kJ (125 Kcal) Protein 0 g 0 g Carbohydrate of which sugar 12,1 g 12,1 g 30,3 g 30,3 g Fat 0 g 0 g Dietary Fiber 0 g 0 g Salt < 0,005 g < 0,013 g Caffeine of which from Guarana extract 32 mg 2 mg 80 mg 5",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}