{
    "relation": [
        [
            "Player",
            "Dan LeFevour, Central Michigan*",
            "Colt McCoy, Texas*",
            "Matt Grothe, South Florida*",
            "Justin Willis, SMU*",
            "Kellen Lewis, Indiana*",
            "Thaddeus Lewis, Duke",
            "Nate Davis, Ball State",
            "Juice Williams, Illinois",
            "Riley Skinner, Wake Forest*",
            "Matt Stafford, Georgia"
        ],
        [
            "A-C-I",
            "225-135-5",
            "186-126-3",
            "104-165-7",
            "174-122-3",
            "202-108-3",
            "186-96-9",
            "128-90-5",
            "166-70-7",
            "109-74-1",
            "67-125-7"
        ],
        [
            "Pct.",
            "60.0",
            "67.7",
            "63.0",
            "70.1",
            "53.4",
            "51.6",
            "70.3",
            "42.2",
            "67.9",
            "53.6"
        ],
        [
            "Yds.",
            "1,613",
            "1,449",
            "1,388",
            "1,273",
            "1,244",
            "1,197",
            "1,147",
            "1,081",
            "912",
            "849"
        ],
        [
            "TDs",
            "13",
            "20",
            "9",
            "19",
            "5",
            "4",
            "12",
            "8",
            "4",
            "3"
        ]
    ],
    "pageTitle": "HuskerOnline.com - Freshman QBs making their mark",
    "title": "",
    "url": "https://nebraska.rivals.com/content.asp?CID=599750",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884814539,
    "recordOffset": 884796102,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1928=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 HuskerOnline.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{49422=And while only two freshmen \u0096 Oklahoma true freshman Jamelle Holieway in 1985 and Miami redshirt freshman Bernie Kosar in 1983 \u0096 ever started at quarterback on national championship teams, there are three who either start or play significant roles for teams near the top of the current rankings \u0096 Texas' Colt McCoy, Florida's Tim Tebow and Arkansas' Mitch Mustain., 40054=October 26, 2006}",
    "textBeforeTable": "Leave it to a freshman to keep things simple. \"Maybe there were a lot of old quarterbacks last year,\" he said. However, Mustain offered another theory why so many freshman quarterbacks are playing this season. All freshman quarterbacks do. But because of seven-on-seven drills, imaginative high school offenses and the opportunity to join the team in the summer, they're learning faster and playing sooner. \"I think it's helped in the fact that I had a pretty good understanding of the offense when I came in,\" Mustain said. \"I knew what to expect, but I still have a lot to learn.\" Mustain also has an advantage no other freshman has. Offensive coordinator Gus Malzahn was Mustain's high school coach. \"It's big for us to have Darren and Felix and Michael,\" Mustain said. \"They do a great job. When you're able to give the ball to them and they get yards for you, it takes pressure off the quarterback.\" Arkansas averages 6 yards per rush, which means the Razorbacks don't face many third-and-long situations. They are converting 41.6 percent on third down and have faced third down just 77 times, the sixth fewest in Division I. Mustain, who said he has performed below his expectations, acknowledged that his progress has been aided by luxury of having explosive running backs Darren McFadden, Felix Jones and Michael Smith in",
    "textAfterTable": "Riley Skinner, Wake Forest* 109-74-1 67.9 912 4 Matt Stafford, Georgia 67-125-7 53.6 849 3 Olin Buchanan is the senior national college football writer for Rivals.com. To send him a question or comment for his Friday Mailbag, click here. Talk about it in Red Sea Scrolls FEATURED PRODUCT adidas Nebraska Cornhuskers White 2015 Coaches Sideline Climalite Polo",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}