{
    "relation": [
        [
            "Field",
            "Table",
            "Column",
            "Lookup",
            "Enable range validation one"
        ],
        [
            "Value",
            "Assignment",
            "Work_at_home",
            "YES_NO",
            "Deselected"
        ]
    ],
    "pageTitle": "Oracle Fusion Applications Compensation Management Implementation Guide",
    "title": "",
    "url": "http://docs.oracle.com/cd/E28271_01/fusionapps.1111/e20376/F566540AN40D6B.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72194383,
    "recordOffset": 72139299,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{95771=Action complete: July 2nd. Start date: August 1st., 95128=For example, a calendar year period with biweekly pay periods beginning on December 6th and December 20th. Action complete: November 10th. Start date: December 6th, which is the first day of the last complete pay period for the plan year. The payroll period starting on December 20th is considered to be the first pay period of the next plan year., 128188=Jane adopts a child into her family during June. As a current employee, Jane participates in the wellness program, medical plan type, PPO medical plan, employee plus spouse option. Although the open enrollment period for the wellness program occurs only in November, Jane does not need to wait for the open enrollment period. The life event in plan override provides an immediate enrollment opportunity to change the enrollment option to employee plus family. However, Jane must wait for the open enrollment period to change enrollment in any object within the recreational plan type., 128818=Enrollment criteria set at lower levels in the hierarchy override higher-level criteria. For example, the program level enrollment period does not allow enrollment at any time other than November. However, life event set up at the plan level overrides the program level criteria. This set up creates an overriding enrollment opportunity whenever a child joins a participant's family., 95854=For example, action complete: July 1st. Start date: July 1st., 130219=A legal employer is setting up an open enrollment period for the wellness program to recur every November. The wellness program contains two plan types: recreational and medical. The medical plan type includes a health maintenance organization (HMO) plan in program and a preferred provider organization (PPO) plan in program. Within the medical plans are options for covering the employee, employee plus spouse, and employee plus family., 72794=Scenario: Life Event A is processed on 1/15/2010. An outstanding action item exists with a due date of 1/30/2010, and it is configured for suspension. Enrollment is suspended, and interim coverage exists. On 1/28/2010, the benefits administrator attempts to process Life Event B, which has an occurred date of 1/20/2010., 94657=Assuming a calendar plan year, the start date would typically be December 1st of the plan year in which the required action items are completed., 96376=For example, action complete: March 10th. Start date: April 1st., 70797=Scenario: Life Event A is processed on 1/15/2010. An outstanding action item exists with a due date of 1/30/2010, and it is configured for suspension. Enrollment is suspended, and interim coverage exists. On 1/25/2010, Life Event B is processed with an occurred date of 1/1/2010., 71352=Scenario: Life Event A is processed on 1/15/2010. An outstanding action item exists with a due date of 1/30/2010, and it is configured for suspension. Enrollment is suspended, but no interim coverage exists. On 1/28/2010, the Benefits Administrator attempts to process Life Event B., 71861=Scenario: Life Event A is processed on 1/15/2010. An outstanding action item for beneficiary designation exists, and suspended enrollment is configured for the beneficiary designee only, not for the benefits offering itself.}",
    "lastModified": "Thu, 20 Sep 2012 07:51:18 GMT",
    "textBeforeTable": "A commercial diving company wants to offer different benefit rates to employees who dive to depths greater than 330 feet. This data is stored for each employee in a custom attribute called Dive_Depth in the Person table. To define eligibility based on diving depth, set the following values on the Create or Edit User-Defined Criteria page: Set Eligibility Based on Custom Attribute The following scenarios illustrate how to define different types of user-defined criteria. In each example, you must first create the user-defined criteria and then add it to an eligibility profile and set the criteria values to use in the profile. User-Defined Criteria: Examples After you have created your user-defined criteria, you can add it to an eligibility profile. You can define two sets of criteria on the User-Defined Criteria page. The participant must meet the criteria defined in either set to be considered eligible (or to be excluded from eligibility if the Exclude check box is selected when the criteria is added to an eligibility profile). If the data is stored in a table other than the Person or Assignment table, you must first create a formula to retrieve the data from the table, and then set the formula type to User-Defined Criteria. To select the correct values for the column and lookup fields, you must have a basic understanding of the structure of the table that stores the eligibility criterion information. Note The",
    "textAfterTable": "Save the user-defined criteria, and then add it to an eligibility profile. Set the following values on the User-Defined Criteria tab, which is under the Other tab on the Create or Edit Eligibility Profile page: Field Value Set 1 Meaning 329 Set 1 To Meaning 9999 Exclude Deselected Save the eligibility profile and associate it with a variable rate profile. Exclude Work-at-Home Assignments from Eligibility An employer wants to exclude work-at-home assignment from eligibility for a transportation benefit option. To accomplish this, set the following values on the Create or Edit User-Defined Criteria page: Field Value Table Assignment Column Work_at_home Lookup YES_NO Enable range validation one Deselected Save the user-defined criteria, and then add it to an eligibility profile. Set the following values on the User-Defined Criteria tab:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}