{
    "relation": [
        [
            "Embassy/Consulates",
            "Embassy Of India, Washington DC",
            "Consulate General Of India, New York",
            "Consulate General Of India, Chicago",
            "Consulate General Of India, Houston",
            "Consulate General of India, San Francisco"
        ],
        [
            "Address/Contact information",
            "2536 Massachusetts Avenue, NW Washington, DC 20008 Tel: (202) 939-9806 Fax: (202) 797-4693",
            "3 East, 64th Street, New York, NY 10021,USA Tel : 212-774-0600 Fax : 212-861-3788",
            "455 North Cityfront Plaza Drive, #850 Chicago, IL 60611, U.S.A., Tel(312) 595-0405 Email: info@indianconsulate.com",
            "1990 Post Oak Blvd. Suite 600 Houston, TX 77056 Tel: (713) 626-2355 Fax: (713) 626-2450, Email :cgi-hou@accesscomm.net",
            "540 Arguello Boulevard San Francisco, CA 94118 Tel: (415) 668-0662 | Fax: (415) 668-7968 Email: Info@IndianConsulate-sf.org"
        ],
        [
            "Consular Jurisdiction",
            "Delaware, Kentucky, Maryland, North Carolina, South- Carolina, Tennessee, Virginia, West Virginia, Washington, DC.",
            "Connecticut, Maine, Massachusetts, New Hampshire, New Jersey, New York, Ohio, Pennsylvania, Puerto Rico, Rhode Island, Vermont, Virgin Islands.",
            "Illinois, Indiana, Iowa, Michigan, Minnesota, Missouri, North Dakota, South Dakota, Wisconsin.",
            "Alabama, Arkansas, Florida, Georgia, Kansas, Louisiana, Mississippi, Oklahoma, Texas.",
            "Alaska, Arizona, California, Colorado, Hawaii, Idaho, Montana, Nebraska, New Mexico, Nevada, Oregon, Utah, Washington, Wyoming."
        ]
    ],
    "pageTitle": "Immigration",
    "title": "",
    "url": "http://www.laindian.com/desi/immigrationPassport.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 550017452,
    "recordOffset": 550001492,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11738=To advertise on this site or our local portals please contact us at 425-443-2067}",
    "textBeforeTable": "DUPLICATE PASSPORTS (IN LIEU OF LOST/DAMAGED PASSPORTS) If you lost your passport you will need to fill up few documents and also also need to lodge a complain with the police. Application for a duplicate passport is normally not accepted by mail except with prior approval of the Consular Officer. Application must be submitted with the following documents: i) Application Form For a New Passport, Declaration in the form must be notarized ii) 7 photographs (color, front facing, 2\" X 2\"). One photograph to be pasted on the application and notarized. iii) Personal Particulars Proforma iv) Police Report about the loss of passport v) Copy of lost passport vi) Copies of school certificates/ birth certificate/ Indian driving license / ration card/ Election Commission I.D./ employment letter/ any other photo-identification from India (whichever available) vii) Letter from school / college , if student viii) Proof of residence in USA from the date indicated in the application such as copies of utility bills and copy of lease deed of house/ flat occupied/ bank certificate/ insurance policy ix) Copy of Green Card/ Employment Authorization Card, as applicable. The Consulate may demand to see the original. x) Letter on plain paper explaining the circumstances of loss of passport. xi) Fee of $ 125 for duplicate passport. xii) Applications for duplicate passports are normally neither",
    "textAfterTable": "Instructions taken from: http://www.cgisf.org/ Advertise to Indian Community in USA To advertise on this site or our local portals please contact us at 425-443-2067",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}