{
    "relation": [
        [
            "Patent application number",
            "20110271123",
            "20110302459",
            "20120005321",
            "20120095717",
            "20120102309",
            "20120124242",
            "20120154280",
            "20120162166",
            "20120178378",
            "20120180038",
            "20120249411",
            "20120271980",
            "20120271983",
            "20120274472"
        ],
        [
            "Description",
            "POWER CONTROL SYSTEM OF A BASEBOARD MANAGEMENT CONTROLLER AND METHOD THEREOF - A method controls power of a baseboard management controller (BMC). A power control signal of the BMC is generated for powering up or powering down the BMC. An enabling signal is generated according to the power control signal. A power supply device is directed to output one or more voltages to the BMC.",
            "SYSTEM AND METHOD FOR TESTING HARD DISK PORTS - A method tests hard disk ports located on a motherboard of a computing device. Each of the hard disk ports connects to a respective serial port of a test fixture. The test fixture includes a group of serial ports, a multiplexer and a storage device. Each of the hard disk ports is selected to be tested during the process of hard disk ports test. A data transmission path is formed by building a connection between the storage device and a channel of the multiplexer corresponding to the hard disk port. Data are written to the storage device and read from the storage device through the data transmission path. The hard disk port is working normal if the written data are identical to the read data. The hard disk port is not working normally if the written data are not identical to the read data.",
            "ROUTER AND REMOTE BOOT METHOD USING THE ROUTER - A router providing remote boot for computers includes a DHCP/proxy DHCP service module to send an IP address to a computer, in response to a DHCP Discover packet sent from the computer, a boot service module to send a DHCPACK packet, which includes a filename of a remote boot mirror image and configuration parameters of TFTP/MTFTP, to the computer in response to a BSDP packet sent from the computer, and a MTFTP/TFTP service module to establish a connection between the router and computer enabling the computer to download the remote boot mirror image according to the configuration parameters of TFTP/MTFTP, in response to a request packet sent from the computer.",
            "SYSTEM AND METHOD FOR TESTING SERIAL PORTS - In a system and method for testing a serial port of a computing device, the serial port electronically connects to a test fixture. Test data is sent to a receive data (RXD) pin by a transmit data (TXD) pin. A test result is received from the serial port by the RXD pin. The TXD pin and the RXD pin work normally if the test data is identical to the test result. When voltages of a request to send (RTS) pin and a data terminal ready (DTR) pin are set at high level, the RTS pin, a data carrier detect (DCD) pin, the DTR pin, a ring indicator (RI) pin, a data send ready (DSR) pin and a clear to send (CTS) pin work normally, upon the condition that status values of the serial port indicate the voltages of the above six pins are at high level.",
            "PREBOOT EXECUTION ENVIRONMENT TEST DEVICE AND METHOD - A preboot execution environment (PXE) test device includes a microprocessor, one or more indicators, a network interface, a power connector, and a storage device. The network interface connects the PXE test device with a computer. The power connector connects an external power source to supply a voltage to the PXE test device. The storage device stores a boot loader, an embedded operating system, and one or more programs. The microprocessor executes the boot loader and the embedded operating system to start the PXE test device. The one or more indicators indicate a power supply status and a starting status of the PXE test device. The microprocessor further executes the one or more programs to remotely boot the computer for test PXE of a network card in the computer.",
            "SERVER AND METHOD FOR TESTING PXE FUNCTION OF NETWORK INTERFACE CARD - In a method for testing a preboot execution environment (PXE) function of a NIC of a server, an IP address is allocated for the NIC by sending a DHCP offer message to the NIC in response to receiving a DHCP discover message from the NIC. TFTP parameters are provided to the NIC by sending a DHCP ACK message to the NIC in response to receiving a DHCP request message from the NIC. A connection based on a MTFTP or a TFTP between the BMC and the NIC is established according to the TFTP parameters. A PXE image file is provided to the NIC for downloading through the connection in response to receiving a request for downloading the PXE image file from the NIC, and the downloaded PXE image file is executed to test whether the PXE function of the NIC is normal.",
            "COMPUTING DEVICE AND METHOD FOR ADJUSTING DISPLAY PARAMETERS OF MONITOR - In a method for adjusting display parameters of a monitor of a computing device, the computing device electronically or wirelessly connects to a mouse that includes a primary button, a secondary button, a scroll wheel, a function button and a microcontroller. The microcontroller detects whether the function button is pressed, clicking of the primary button or the secondary button, motions of the scroll wheel, and motions of the mouse. An adjustment mode of the monitor is predefined. The monitor is controlled into the adjustment mode by pressing the function button. The display parameters can be adjusted with the primary button, the secondary button or the scroll wheel when the monitor is in the adjustment mode.",
            "DISPLAY APPARATUS AND AUTOMATIC ADJUSTMENT METHOD THEREOF - A display apparatus includes a photoelectric sensor disposed on an inner side of a frame and located corresponding to a corner of a pixel area of a display panel in a predetermined position. When the display apparatus is turned on, the display panel provides a light spot at a corner of a current pixel area of the display apparatus corresponding to the photoelectric sensor, and a micro-control circuit compares an electronic signal received from the photoelectric sensor with a sample value. If different, an interrupt is triggered to execute a position offsetting interrupt program to adjust the display parameter of the display apparatus, thereby moving the pixel area to adjust the relative position of the light spot and the photoelectric sensor, so that the relative position becomes identical to that when the pixel area of the display panel is in the predetermined position.",
            "WIRELESS TEST SERVER AND METHOD FOR TESTING ELECTRONIC DEVICES - In a method for testing electronic devices using a wireless test server, the server communicates with one or more workstations through a radio frequency unit. Each of the workstations includes a signal converter and a universal asynchronous receiver-transmitter (UART) adaptor. The server predefines an ID number for each of the workstations, and creates a wireless connection between the wireless test server and each of the workstations. The server generates a test command according to the ID number of the workstation, and converts the test commands into wireless signals and transmits each of the wireless signals to the UART adaptor corresponding to the workstation. Each of the signal converters converts the wireless signal received by the UART adaptor into a booting command. Each of the electronic devices performs a boot test operation according to the booting command, and generates a test result which is sent back to the test server.",
            "SYSTEM AND METHOD FOR UPGRADING FIRMWARE OF A PRINTED CIRCUIT BOARD - A printed circuit board (PCB) includes a microcontroller and a plurality of firmware. The microcontroller determines which firmware to be upgraded according an update code of an update request received by a radio frequency device of the PCB. If the microcontroller is in an update mode, the server sends an update file of the determined firmware to the microcontroller. The microcontroller upgrades the determined firmware according to the update file.",
            "SCREEN PROTECTION SYSTEM AND METHOD OF AN ELECTRONIC DEVICE - In a screen protection system and method, a first operation temperature of an electronic device is detected from each of one or more first temperature sensors, and a first ambient temperature is detected from a second temperature sensor, when a display screen is activated. Once there is no operation on the electronic device, a timer is started timing. Once the electronic device is being operated, a duration is temporarily stored and the timer is reset. If the duration is equal to a screensaver time, a second operation temperature of the electronic device is detected from each of the first temperature sensors, and a second ambient temperature is detected from a second temperature sensor. The method further determines whether the electronic device is currently being held by a hand of a user, according to the above-mentioned temperatures. If the electronic device is not being held by a hand of the user, the display screen is controlled to be in an inactive state.",
            "TEST DEVICE AND METHOD FOR TESTING SERIAL PORTS OF COMPUTING DEVICE - A test device for testing serial ports of the computing device includes a multiplexer, a USB interface, a signal conversion unit, a switch unit, and multiple serial port interfaces. The USB interface is connected to a USB port of the computing device. Each of the serial port interfaces is connected to a serial port of the computing device. The signal conversion unit is connected to the USB interface of the test device, and connected to the serial port interfaces through the multiplexer. The signal conversion unit converts serial signals into USB signals, or converts USB signals into serial signals, to transmit testing signals between the USB port and the serial ports. The switch unit controls a serial port to be tested to connect to the signal conversion unit through the multiplexer, to form a test channel to test functions of the serial port.",
            "COMPUTING DEVICE AND DATA SYNCHRONIZATION METHOD - A server includes a Southbridge chip, a first storage device, and a baseboard management controller (BMC) electrically connected to the Southbridge chip. A field replacement unit (FRU) is electrically connected to the BMC and the first storage device. The BMC reads data from a second storage device electrically connected to the BMC, writes the data into the FRU, sends a first control signal to a switch positioned between the BMC, the first storage device and the FRU, to switch on an electrical connection between the BMC and the first storage device for reading data stored within the first storage device. If the data stored within the first storage is different from the data stored within the FRU, the BMC reads the data from the FRU, and writes the data into the first storage device, to synchronize the data within the first storage device and the FRU.",
            "POWER SUPPY SYSTEM - A power supply system includes a current detection module, an analog-to-digital converter, a control module and a display module. The current detection module detects current signals output from the power supply system and converts the current signal to voltage signal. The analog-to-digital converter converts the analog voltage signal to digital voltage signal. The control module receives the digital voltage signal output from the analog-to-digital converter and converts the digital voltage signal to digital current digital, and calculates the actual output power of the power supply system. The display module displays the actual output power of the power supply system. A method for displaying the power of a power supply system is also disclosed."
        ],
        [
            "Published",
            "11-03-2011",
            "12-08-2011",
            "01-05-2012",
            "04-19-2012",
            "04-26-2012",
            "05-17-2012",
            "06-21-2012",
            "06-28-2012",
            "07-12-2012",
            "07-12-2012",
            "10-04-2012",
            "10-25-2012",
            "10-25-2012",
            "11-01-2012"
        ]
    ],
    "pageTitle": "Hu, Shenzhen City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hu-shenzhen-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438206127,
    "recordOffset": 438158949,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ming-Xiang Hu, Shenzhen City CN 01-16-2014 METHOD AND APPARATUS FOR CLUSTERING SEARCH TERMS - A method and apparatus for clustering search terms are provided by the present invention. The method includes: A, establishing a candidate search term set, wherein the candidate search term set comprises a first search term provided by a user, and a second search term related to the first search term; B, performing a clustering operation on the first search term and the second search term related to the first search term in the candidate search term set according to text characteristic and/or semantic characteristic of search term. The accuracy and relevance of search term clustering can be improved by use of the method. 20140019452 Published Description Patent application number Lixin Hu, Shenzhen City CN 06-18-2009 SURFACE TREATMENT PROCESS FOR COLORING METAL ARTICLES - A surface treatment process for coloring metal articles includes following steps. In a first step, a metal article is anodized to form a first anodic oxide layer including a first portion and a second portion on the original metal article. In a second step, the anodized metal article is dyed. In a third step, the first portion of the first anodic oxide layer is removed from the anodized metal article to partially expose a metal body of the anodized metal article. In a fourth step, the exposed metal body of the anodized metal article is anodized to form",
    "textAfterTable": "Peng Hu, Shenzhen City CN Patent application number Description Published 20110258277 Multi-Source Transmission System And Method Of Instant Messaging File - A multi-source transmission system of an IM file which includes a sender IM terminal and a receiver IM terminal connected through a network to exchange data. The receiver IM terminal is configured to search for replicas of a file according to file information sent by the sender IM terminal. When at least one replica is found, the IM terminal receives the file from at least two file sources by using a multi-source mode. The at least two file sources include the sender IM terminal and a file source of the at least one replica. A conventional P2SP system is used to search for the replicas, and the file with a replica is received by using the multi-source transmission mode. 10-20-2011 20130294349 Method, Apparatus and System for Sending Messages - The present invention discloses a method for sending messages, including: acquiring a destination region to which an outgoing message is to be sent; determining a first base station identifier corresponding to the destination region, and acquiring a first unique user identifier corresponding to the first base station identifier; and sending the outgoing message to a mobile terminal of a first user, where the first user is a user identified by the first unique user identifier. The present invention also discloses an apparatus for sending messages, including: a destination",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}