{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe environment",
            "Music majors",
            "Spending time in music practice rooms and coffee houses.",
            "Go to chapel and Bible studies to further your walk with God and to grow spiritually.",
            "Greenville College is an institution that has become a welcoming harbor to students, both freshman and veteran. Focused on building community between faculty and students as well as between students and students, Greenville implements excellence in all areas. Graduates employ their academic excellence and use their experience gained in hands-on classroom activities to make a lasting impact in the real world after school."
        ]
    ],
    "pageTitle": "Greenville College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Greenville-College/reviews?_escaped_fragment_=/show/14867",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00222-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893821915,
    "recordOffset": 893782549,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116201=© 2015, Cappex.com, LLC, 16788=Are you looking to study abroad? If so, GC is an excellent place for you. A cross cultural experience is actually an academic requirement for GC students, and it is highly encouraged that students take a semester to study abroad. If you come to GC, you will work with your adviser in your respective major to plan out your four years, classes you should take, when you should take them, stuff like that (VERY handy!), and they will work with you to include a study abroad semester in your four-year plan. The cool thing is, you can still graduate after four regular years, despite going away from GC for a semester! Also, if you're a music major looking into getting a recording contract, GC has the connects to help you get there. Rod Kim, Class of 2005, just put out his debut album last fall (sold at Best Buy, iTunes, Amazon, etc.) and his song Tomorrow She's Mine is featured on Rock Band 2 (I played it, and it was fantastic :)) and}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 1 of 26 Melanie from Harvard, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Login to rate or flag the reviews Imari from Fort Walton Beach, FL 12/14/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 26 Categories Comments Great for these types of students * Those who have lived in rural areas before * City students that are looking to get away from it all * Education, Music, Digital Media, and Business majors * Christians and non-Christians * Students looking for a smaller college Tips for prospective students If you are looking to apply to any college or university - not just Greenville College - look into making contact with someone within the college prior to you applying! It not only shows your initiative, but it can also benefit you during the application process or when you just need a good reference! Bang for the buck Greenville College is one of the best Christian colleges in the nation! You definitely get the bang for your buck if you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}