{
    "relation": [
        [
            "Patent application number",
            "20130148895",
            "20130226667",
            "20140270355",
            "20150016730"
        ],
        [
            "Description",
            "METHODS, APPARATUS, AND ARTICLES OF MANUFACTURE TO MEASURE GEOGRAPHICAL FEATURES USING AN IMAGE OF A GEOGRAPHICAL LOCATION - Methods, apparatus, and articles of manufacture to measure geographical features using an image of a geographical location are disclosed. An example method includes dividing, with a processor, an image of a geographic area of interest into a plurality of geographical zones, the geographical zones being representative of different geographical areas having approximately equal physical areas, measuring, with the processor, a geographical feature represented in the image for corresponding ones of the plurality of geographical zones, storing descriptions for the geographical zones in a computer memory, and storing values representative of the geographical feature of the geographical zones.",
            "METHODS AND APPARATUS TO ANALYZE MARKETS BASED ON AERIAL IMAGES - Methods and apparatus to analyze market channels based on aerial images are disclosed. An example method includes determining, using a processor, whether a first element in an aerial image of a geographic area represents a man-made object; determining, using the processor, whether a second element in the aerial image represents a natural object; and estimating a market channel for the geographic area based on a second market channel for a second geographic area when the first element represents a man-made object and the second element represents a natural object",
            "METHODS AND APPARATUS TO ESTIMATE DEMOGRAPHY BASED ON AERIAL IMAGES - Methods and apparatus to estimate demography based on aerial images are disclosed. An example method includes analyzing a first aerial image of a first geographic area to detect a first plurality of objects, and estimating a demographic characteristic of the first geographic area based on the first plurality of objects.",
            "METHODS, APPARATUS, AND ARTICLES OF MANUFACTURE TO MEASURE GEOGRAPHICAL FEATURES USING AN IMAGE OF A GEOGRAPHICAL LOCATION - Methods, apparatus, and articles of manufacture to measure geographical features using an image of a geographical location are disclosed. An example method includes dividing an image of a geographic area of interest into geographical zones, the geographical zones being representative of different physical geographical areas; modifying boundaries of a first one of the geographical zones to more closely conform to an observable landmark or a geographical location observable by a person located in the first one of the geographical zones; storing descriptions for the geographical zones in a computer memory based on the modified boundaries of the first one of the geographical zones; and storing a value representative of a geographical feature represented in the image for the first one of the geographical zones."
        ],
        [
            "Published",
            "06-13-2013",
            "08-29-2013",
            "09-18-2014",
            "01-15-2015"
        ]
    ],
    "pageTitle": "David Miller - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/david-miller-2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 450172403,
    "recordOffset": 450152231,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "David Miller, Annandale, VA US 03-07-2013 SYSTEM AND METHOD FOR DATABASE GENERATION AND RETRIEVAL - Systems, methods and apparatus are disclosed for database generation of synchronized actions. In one aspect a method is provided for generating a database of data items indicative of synchronized actions. The method includes determining a set of devices for execution of a storyboard. The set of devices includes packaging of a consumer product. The storyboard relates to promotion of the consumer product. The method further includes generating the storyboard. The storyboard includes a set of actions for the devices. The storyboard includes a set of interrelated actions that form a message for communication to an audience. The method further includes generating data items. The data items correspond to the actions of the storyboard. At least a portion of the data items include time synchronization information for the set of actions. The method further includes storing the data items and the time synchronization information relating to the storyboard in the database. 20130060821 Published Description Patent application number David Miller, Zurich CH 01-29-2015 PYRIDAZINONE COMPOUNDS AND THEIR USE AS DAAO INHIBITORS - The present invention provides compounds of formula (I) and pharmaceutically acceptable salts thereof, wherein R 20150030704 09-04-2014 PYRIMIDINONE COMPOUNDS AND THEIR USE - The present invention provides compounds of formula (1) and pharmaceutically acceptable salts thereof, wherein R 20140248378 08-28-2014 5- OR 6-SUBSTITUTED 3-HYDROXY-2(1H)-PYRIDINONES",
    "textAfterTable": "Patent applications by David Miller, Annandale, VA US David Miller, San Antonio, TX US Patent application number Description Published 20130247401 SYSTEMS AND METHODS FOR MOUNTING PICTURE FRAMES - A frame assembly is provided for easily hanging a frame at a desired orientation. The base frame has a central mount that is fastened to a wall, to permit the base frame to be rotated to the desired orientation. Off-center mounts are thereafter fastened to the wall to maintain the desired orientation. The base frame is configured to fit within an outer frame, which holds an artistic or functional insert. Once the outer frame is mounted over the base frame, the base frame is obscured and the outer frame is flush with the wall surface. Further, multiple base frames can be hung in alignment by simply marking the desired center point for each base frame. The outer frame is removably secured to the base frame by a catch, to permit the easy exchange of the artistic insert or outer frame. 09-26-2013 David Miller, Monticello, IN US Patent application number Description Published 20130331192 METHOD AND SYSTEM TO PROVIDE LOCATION-BASED COMPETITIVE GAMES, TOURNAMENTS,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}