{
    "relation": [
        [
            "Patent application number",
            "20100313910",
            "20100324736",
            "20110236026",
            "20110238214"
        ],
        [
            "Description",
            "ROBOT CLEANER AND METHOD OF CONTROLLING TRAVELING THEREOF - Disclosed herein are a robot cleaner that has an improved traveling performance, and a method of controlling traveling thereof. The robot cleaner allows driving wheels, which move the robot cleaner, and a brush unit, which sweeps dust on a floor, to be rotated in the same direction.",
            "Robot cleaner, docking station, robot cleaner system including robot cleaner and docking station, and method of controlling robot cleaner - A robot cleaner system is described including a docking station to form a docking area within a predetermined angle range of a front side thereof, to form docking guide areas which do not overlap each other on the left and right sides of the docking area, and to transmit a docking guide signal such that the docking guide areas are distinguished as a first docking guide area and a second docking guide area according to an arrival distance of the docking guide signal. The robot cleaner system also includes a robot cleaner to move to the docking area along a boundary between the first docking guide area and the second docking guide area when the docking guide signal is sensed and to move along the docking area so as to perform docking when reaching the docking area.",
            "Robot cleaner, docking station, robot cleaner system including robot cleaner and docking station, and method of controlling robot cleaner - A robot cleaner system is described including a docking station to form a docking area within a predetermined angle range of a front side thereof, to form docking guide areas which do not overlap each other on the left and right sides of the docking area, and to transmit a docking guide signal such that the docking guide areas are distinguished as a first docking guide area and a second docking guide area according to an arrival distance of the docking guide signal. The robot cleaner system also includes a robot cleaner to move to the docking area along a boundary between the first docking guide area and the second docking guide area when the docking guide signal is sensed and to move along the docking area so as to perform docking when reaching the docking area.",
            "Robot cleaner, docking station, robot cleaner system including robot cleaner and docking station, and method of controlling robot cleaner - A robot cleaner system is described including a docking station to form a docking area within a predetermined angle range of a front side thereof, to form docking guide areas which do not overlap each other on the left and right sides of the docking area, and to transmit a docking guide signal such that the docking guide areas are distinguished as a first docking guide area and a second docking guide area according to an arrival distance of the docking guide signal. The robot cleaner system also includes a robot cleaner to move to the docking area along a boundary between the first docking guide area and the second docking guide area when the docking guide signal is sensed and to move along the docking area so as to perform docking when reaching the docking area."
        ],
        [
            "Published",
            "12-16-2010",
            "12-23-2010",
            "09-29-2011",
            "09-29-2011"
        ]
    ],
    "pageTitle": "Ko, KR - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ko-kr-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00125-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440842923,
    "recordOffset": 440810333,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jang Youn Ko, Gwangsan-Gu KR 08-13-2009 APPARATUS AND METHOD FOR PARTIAL ADAPTIVE TRANSMISSION IN MULTIPLE-INPUT MULTIPLE-OUTPUT SYSTEM - An apparatus and method for partial adaptive transmission in a Multiple-Input Multiple-Output (MIMO) system are provided. The method includes estimating a correlation matrix between Transmit (Tx) antennas and an average Signal to Noise Ratio (SNR) and generating a long-term precoding matrix composed of a predetermined number of dominant eigen dimensions of the correlation matrix by using the estimated correlation matrix and average SNR. The apparatus and method provide a new adaptive MIMO transmission method capable of reducing the feedback information overhead and maximizing performance. 20090203335 Published Description Patent application number Jaeyun Ko, Uiwang-Si KR //]]> BarDraw('2601908',['Patent applications by Jae Pyung Ko, Yangsan-Si KR'],[[1,3,4]],['2008','2009','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2601908\" align=\"center\"></div> </div> <canvas id=\"bg2601908\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jae Pyung Ko, Yangsan-Si KR</p> <div class=\"bar2601908\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-27-2011</td> <td><a href=\"/patents/app/20110261907\">WIRELESS WAKE-UP SYSTEM AND OPERATION METHOD THEREOF</a> - A wireless wake-up system and an operation method thereof are provided to optimize power consumption when wireless data is received. The wireless wake-up system activates a wake-up detection module and then compares a wireless input signal received through an antenna with a pre-stored reference value. If the wireless input signal is equal to the reference value, the wireless wake-up system determines that the input signal",
    "textAfterTable": "Jang-Youn Ko, Gwangju-City KR Patent application number Description Published 20080300720 Cleaning robot - An improved cleaning robot that uses a simple structure to sense an obstacle is disclosed. The cleaning robot includes a robot main body comprising a driving unit to drive the cleaning robot, and a cleaning unit to remove dust, a bumper unit which is movably mounted in the robot main body to protect the robot main body from collision with an obstacle, a sensor unit which supports the bumper unit movably in a plurality of directions to sense the collision of the bumper unit and the obstacle, and a control unit which controls the driving unit on the basis of a signal sensed by the sensor to avoid the obstacle. 12-04-2008 20090071732 Wheel driving assembly of a moving apparatus - A wheel driving apparatus for a moving apparatus is provided. The wheel driving apparatus includes a wheel, a driving motor to generate a driving power to rotate the wheel, a gear box to transmit the rotational force of the driving motor to the wheel, and a guide shaft movable vertically with respect to the base member, wherein the wheel, the driving motor, the gear box, and the guide shaft are connected integrally with each other to move vertically with respect to the base member in unison. 03-19-2009 Patent applications by",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}