{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $5.99"
        ],
        [
            "Each additional item",
            "Free",
            "US $2.95"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (USPS First Class Package®)",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated between Thu. Aug. 6 and Tue. Aug. 11",
            "Estimated between Wed. Aug. 5 and Sat. Aug. 8"
        ]
    ],
    "pageTitle": "Philips in Sight M100 Wireless Home Monitor Surveillance for Android Apple | eBay",
    "title": "",
    "url": "http://www.ebay.com/itm/-/251261188357?roken=cUgayN",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424519631,
    "recordOffset": 424467625,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 5 or 9 numbers for the ZIP Code. Please enter a valid ZIP Code. ZIP Code: Select a valid country. There are 302 items available. Please enter a number less than or equal to 302. -Select- Australia Austria Belgium Bulgaria Canada Chile Costa Rica Croatia, Republic of Cyprus Czech Republic Denmark Dominican Republic Estonia Finland France Germany Greece Hong Kong Hungary Ireland Israel Italy Japan Korea, South Latvia Lithuania Malta Netherlands New Zealand Norway Philippines Poland Portugal Romania Slovakia Slovenia Spain Sweden Switzerland Taiwan Ukraine United Kingdom United States Change country:",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Handling time Estimated sales tax Will usually ship within 2 business days of receiving cleared payment - opens in a new window or tab. Seller charges sales tax for items shipped to: NJ (7.0%). Return policy To qualify for a hassle-free return, you must pay with PayPal and have the item shipped to a US address. The item must be returned in the same condition it was received. See terms and conditions - opens in a new window or tab.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}