{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "If you were hesitant about leaving home for college, FGCU is the perfect place. Most people are from close areas and are sharing their home away from home experiences together.",
            "Paying for a dorm like this is definitely worth every penny.",
            "My friends and I just enjoy spending time with each other in our rooms, the television rooms, or even just sitting in the middle of the hallway. Occasionally we will bring out a board game and just get a huge group of students from our floor involved. There is a game room on my fourth floor with a ping pong table and table soccer. Of course that is all just things to do on campus.",
            "South Village Dining Hall really never lets me down. The only downside to the dining hall is that it is generally the same food over and over again. You have to make your own variation with what they give everyday, but don't be fooled, there is plenty of food.",
            "The dorms are one of the main reasons I picked FGCU. I love how you get your own individual bedroom and only have to share a bathroom with one (or two, depending on which dorm you are in) other person. The RAs are the nicest and most helpful people you will ever meet. The facilities are always clean and user friendly, from the mini gym to the communal kitchen.",
            "Like any other school, the work load and difficulty depends on the classes you take and the professors who teach them. It is a tremendous help to be in such small classes so that if you ever do have questions or need help, it is easy to build an academic relationship with your professor. There is always free tutoring on campus for almost every subject.",
            "There isn't as much pressure here as there would be if you were going somewhere else. Living in the dorms is great as long as you take advantage of the people around you and make all the friends you can. Cars are not necessary to get around the campus. It will take you an average of 15 minutes to walk to and from the main academic buildings.",
            "Florida Gulf Coast University is a great school with great people. The class sizes are all small and allow for better one-on-one time with your professor. The dorms are amazing because you get the experience of a roommate and the ability to have total privacy."
        ]
    ],
    "pageTitle": "Florida Gulf Coast University (FGCU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-Gulf-Coast-University/reviews?_escaped_fragment_=/show/18571",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899785407,
    "recordOffset": 899676117,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{187397=you can go to sporting events on campus, or you can go off campus, there is even a beach on campus that you can use. fgcu is close to just about everything, across the way is gulf coast town center, and just a few miles up the road is miromar outles., 400972=FGCU is in Ft. Myers which is close to Cape Coral, where I am from. Since its pretty close, I am taking it into consideration. FGCU has also gotten a lot of rave because of March Madness., 95639=Miromar and Coconut point, and the shopping plaza where Target is was the most fun and that has to be what I miss most about Fort Myers., 430894=Gulf Coast Town Center is only a five minute drive, as are the Miromar Outlets. Both have lots of shopping, food choices, movie theaters and other activities on a weekly basis. The beaches are about 45 minutes away and usually worth the drive when it's hot., 496860=FGCU basketball team made it to March Madness in 2013. There's a shopping mall with food and entertainment not too far from campus. FGCU is about 20 to 30 minutes away from the Gulf of Mexico. Many hang out at the Union Hall., 126236=A lot of people have different interests and that's perfectly fine. For the person who likes gaming/being indoors: There are several Computer labs on campus as well as in the dorm buildings. The internet I'll admit isn't super fast, so use the ethernet cable to connect to the network rather than the Wifi. Because there is about 2,000 other students on the same network, so just be patient. There is also a room in the dorm buildings to watch movies, play table tennis, air hockey, piano, and just study. For the Outdoors person: There's several soccer size fields to play sports on, theres also the ROC (Recreational Outdoor Complex) I mentioned earlier to do really whatever you want. There's even a nature trail through the forest on campus. Check out the Bass Pro up the street from campus to get even more of a outdoor experience. For the Studious person: There's the library obviously, but there's always a lot of people there and it's hard to focus in there. (Believe me, I've tried) So you can always study in your room, if you won't get distracted. The walls in the dorms aren't the thickest so sometimes you can hear people. Just be polite and ask them to stay quiet while you study. There's also mandatory quiet hours too all day, during finals week so you can get all your studying done. Also check out the study rooms in your dorm building for more study space. For the Outgoing person: Meeting people at FGCU is incredibly easy, especially in the freshman dorms. There's almost 5000 freshman in one area. You're bound to meet a few dozen new friends. Check out the pool in South Village, that's always fun. Spend some time in the Cohen Center. There's ALWAYS people in there during the week usually in the middle of the day, around 12:30 in the afternoon., 223427=Great school. My older sister went there and she said it has grown so much. To think this University began in 1991 is truly amazing., 24218=Living off campus (and being a bit reserved as is), I initially thought it would be difficult for me to make new friends and enjoy the college lifestyle. I was quickly proven wrong. The other students that I've encountered while here have all been extraordinarily nice. Campus involvement also helps, and there are a ton of clubs to join, as well as school-funded activities to participate in (lots of tournaments, concerts, game days, etc.) The campus is laid out beautifully and provides an ever-relaxing setting in which to either study, hang out with friends, or just sit an relax. The campus itself is lovely enough, but there's a lot more to be done just outside school grounds at either GulfCoast Town Center, Miromar Outlets, or my favorite, the Estero Community Center. Because the college is centrally located, there's always something to do whether you want to stick around school or not., 658507=© 2015, Cappex.com, LLC, 590542=There are many club sports and intramural sports available on campus. There are also clubs, like glee, and facilities, like the fitness center or the pool, you can go to on campus. Just off campus is the Gulf Coast Town Center at one side with a movie theater, clothing stores, restaurants, and cool activities, like glow mini golf, that you can do, and Miromar Outlet which is full of designer stores selling their products at a discounted price. About 4 miles from campus is Coconut Point Mall which is basically the same as Gulf Coast Town Center, but with different stores and restaurants. The school has an Outdoor Pursuits division that holds adventures, like ski trips and learning air sports, open to students. There are also university sanctioned concerts, i.e. Nest Fest and Eaglepalooza, with celebrity artists.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 38 out of 38 people found this review useful. 1 of 164 Joni-marie from Coral Springs, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Great for these types of students This is a great school for someone that wants to attend a major university, yet one where they won't be lost in the chaos. People who like being away from a major city but also close enough if they need one will do well here. The campus is beautiful and the people are great! Tips for prospective students Make multiple copies of the syllabus and keep them everywhere. Keep up with reading and it helps to start studying when you find out a test date, not the night or just hours before. Also, go to extra help if a professor offers it and participate in class. Bang for the buck It's affordable for Florida Residents. Am enjoying being here I love the atmosphere! It's not huge, but it's big enough. The people are amazing and always there to help. Most of my professors knew me by name and I wasn't just a name on a long list to them. Am learning a lot I am learning a lot both through lectures and self-teaching. When your professor says read, READ!",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}