{
    "relation": [
        [
            "Condition:",
            "Brand:",
            "Style:",
            "Size (Men's):"
        ],
        [
            "New without tags: A brand-new, unused, and unworn item (including handmade items) that is not in original packaging or may be missing original packaging materials (such as the original box or bag). The original tags may not be attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Nike",
            "Jersey",
            "44"
        ],
        [
            "Color:",
            "Sport:",
            "Size Type:",
            ""
        ],
        [
            "Red",
            "Basketball",
            "Regular",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Authentic-Nike-Michael-Jordan-Chicago-Bulls-Jersey-Rare-Size-44-L-Sewn-Red-Air-/121368499236?pt=US_Mens_Athleticwear&hash=item1c42205424",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 411042663,
    "recordOffset": 411004288,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Aug 28, 2014 02:55:03 EDT  Seller assumes all responsibility for this listing. 121368499236 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "New without tags authentic nike team sports Michael Jordan jersey rare size 44... Just a classic jersey! Flawless condition! Everything's crispy and clean...harder and harder to find to true authentics like this... Please check out all the photos If you have any Questions offers concerns please message me... Ships priority with tracking... Check my other items for more cool stuff! Thanks and good luck! Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing. Shipping and handling This item will ship to United States, but the seller has not specified shipping options. Contact the seller-",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}