{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Public Safety (P-Safe) is always driving around and that makes it feel pretty safe.",
            "Freshmen can not join until second semester of their freshman year. However, this is good because it does take up a lot of time. The greek life is great and has so many benefits like the fact that they are local so they do not cost a lot and they are kept relatively small.",
            "There is such an awesome variety of clubs to get involved in. However, they make it really easy to start up a new club if you don't find one that is right for you.",
            "If you are an academic student Redlands is the right place for you. That is their main focus and it has some really tough classes.",
            "We have the och-tamale which is a chant that is just a bunch of jibberish.",
            "Redlands is a really expensive school. If you get good grades they will help you out. However, apply for a bunch of scholarships because you will end up having to get loans and be in a hole as soon as you graduate.",
            "There are events through your dorm hall that are fun but their are also all school parties to go to. Redlands also has some great shopping down town and some really good restaurants.",
            "The food gets really old really fast! But they have a coffee shop that is so good!",
            "The dorm life is so much fun! They provide community activities to get you involved and to give you a chance to meet your neighbors and make new friends. They also have decent size rooms and an overall good sense of homeyness. Watch out for the buildings with no air conditioning it can get hot!",
            "It is a challenging school where you will suffer if you fall behind! However, they do provide different ways where you can get help and maintain good grades. The main thing is to focus and complete all of your assignments and reading material.",
            "Research scholarships options because it is expensive. Also, go and visit the school as much as possible to get a better feeling of what to expect and see if it is the right fit for you.",
            "The University of Redlands is a beautiful school in Southern California. It has small class sizes, excellent professors, and the perfect amount of students in your class so it is not overwhelming. They provide things for every type of person and it is so easy to get involved with something you will love."
        ]
    ],
    "pageTitle": "University of Redlands Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Redlands/reviews?_escaped_fragment_=/show/27319",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907945843,
    "recordOffset": 907882767,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{286836=- Get to know your College advisor, once you are accepted they will call you around once a month to help get you ready for college until around July, when they will hand you off to your Orientation mentor (an upperclassman that applied and went through training to help you through your first few months!) - Make sure to read through the housing opportunities. In addition to the normal communities, there are 'themed' communities open to Freshmen as well. Some of these include the Wellness, Catalyst, and Environmentally Conscious communities. -Don't let the price get to you, they offer a lot of financial aid and if you are eligible for work study they will make sure you get ten hours of work a week. - -DEFINITELY- get involved with Outdoor programs. It's a program on campus that offers cheap outdoor workshops and adventures. These can go from backpacking to rockclimbing, beach bumming, and more. I personally didn't do a First Year Journey, but those are run by the same people that run Outdoor Programs., 231011=You don't have to be a super genius to get into the U of R, my gpa when I graduated HS was 3.8, my ACT score was 21 and my SAT score was 1500. I would suggest going to Prospective Students Day or a tour so you can get a feel for campus., 290665=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/22/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 57 Alaina from Portland, OR Check out reviews left by other students or leave your own review. You could win a free scholarship. University of Redlands Reviews University of Redlands › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot The classes and professors are absolutely wonderful. The professors here like to encourage a challenge upon you. Although it may be challenging, they are excellent helpers. They sort of act like parents—they really care about you and they definitely show it. They are here to help you if you have any questions or problems regarding the classroom environment or workload. I absolutely love the classroom sizes here. I tried to imagine being in a big class where I was one out of 300 students and I was terrified. Luckily, University of Redlands’ classes are nothing like that. The biggest class I’m in has about 20 students. What’s great about the classes too are that there are unlimited amount of sources of help. There’s one-on-one tutoring with either the teacher (during class and their office hours which are most of the time flexible), the tutors on campus, and there’s actually a tutoring center here as well—so there’s services here for YOU literally everywhere. Also, the school offers a lot of opportunities such as work study, internships and I’ve heard that even if you graduate from the University of Redlands, the job services are still there to help you until you get the job you want. Login to rate or flag the reviews Kelly from",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}