{
    "relation": [
        [
            "Pokemon",
            "Pidgey",
            "Metapod",
            "Reward:"
        ],
        [
            "Level",
            "7",
            "5",
            "$160"
        ],
        [
            "Type",
            "Normal/Flying",
            "Bug",
            ""
        ]
    ],
    "pageTitle": "Pokemon X FAQ/Walkthrough for 3DS by RedIsPoetic - GameFAQs",
    "title": "",
    "url": "http://www.gamefaqs.com/3ds/696959-pokemon-x/faqs/68035",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00175-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 451658351,
    "recordOffset": 451628720,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38166=May as well try and head back to your mother now. Start heading south and you'll get stopped by Shauna as you're leaving. Throwback to Gen I, it's time for a starting Pokemon battle!, 115290=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use}",
    "textBeforeTable": "The in-game controls vary depending on whether you're in battle, navigating a menu or exploring the world. The varying uses are explained below. The control is listed on the left and it function's listed to its right. Controls - RedIsPoetic I hope you guys enjoy the guide. It was genuine fun writing for it and a bit of an adventure in its own right. Have fun! The newest installment of Pokemon, on a basic level, included a lot of additions that should have happened a while ago but simply never did, as well as including the best bits of a lot of the previous installments. It also has some beautiful pop culture references which are just awesome and really cater to the older audience, which is much appreciated. Hey, hey, hey everyone! I'm back with another Pokemon guide, this time for the newest generation! Get keen! I know I am! It's been a while since I've done a decent FAQing project, so I figured I'd smash it out. And with all of the great feedback from the last one, how could I say 'no'? So here I am, writing a guide for you guys. I really hope you enjoy! Introduction Spoiler Warning: This guide naturally contains plot spoilers, as well as spoilers on who Gym Leaders are, what other characters are present in the game etc. You've received fair warning. Like this author on Facebook at: facebook.com/redispoetic Did you find",
    "textAfterTable": "Start No Use Select No Use Up Move character up, scroll up options Down Move character down, scroll down options Left Move character left, move left through options Right Move character right, move right through options L Switch between minigames R Switch between minigames Touch Screen Select pressed option Circle Pad Use roller skates Exploring, Collecting and Battling Exploring the world of Pokemon, collecting Pokemon and using them to battle are the three primary elements that constitute the core of every Pokemon game's gameplay. Each of these will be given an overview. Exploring An integral part of any Pokemon game is its sense of adventure and seeing wondrous things. Visiting towns and cities with your Pokemon and speaking to residents to hear many of the entertaining, informative and quirky things that they have to say are just one element of the many that make up exploration. The Pokemon world is made up of a three primary places, which are: Towns and cities Routes Special Wilderness Locations Within towns and cities, there are few trainer battles, except in specially designated areas such as Pokemon Gyms where there are many more. In these places you can buy and sell items,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}