{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There is a lot of fun things to do at AVC if you look for it. Joining teams, dance classes and clubs. These are fun and can also add to the extra curricular that some universities look at.",
            "This college's cafeteria really is not the greatest. they sell fast food such as burgers, fries, among other. It could improve by adding more healthy foods to their main menu and not just salads.",
            "No Dorms available",
            "This college promotes academic rigor, but it is almost impossible to do for the lack of classes they have.",
            "My tip for prospective students is that if you live close to AVC you will get the same education than if you were to go to any other college in Southern California. AVC professor's follow state guidelines and will give you the correct information. Be prepare to struggle to get into the classes, my best tip would be to join a sport team for they get priority registration making it an easy ride through college.",
            "Antelope Valley College, is a developing college. They do not have enough classes for the mass of students that attend this school. They are developing a bigger campus with new equipment coming soon for prospective students."
        ]
    ],
    "pageTitle": "Antelope Valley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Antelope-Valley-College/reviews?_escaped_fragment_=/show/78742",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916242731,
    "recordOffset": 916186414,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{300612=© 2015, Cappex.com, LLC, 286324=The work instructors expect of you isn't necessarily perfect but they do expect good college-level work. For example, when submitting an essay or research paper, check your punctuation, grammar, cite your sources correctly, and keep everything organized. The work can be challenging because of the amount of time needed to complete an assignment but the actual work isn't hard. Spending a good amount of time studying can go a long way which will help you in the long run.}",
    "textBeforeTable": "11/26/2010 Reviewer is Researching this school. Reviewer has been to campus. 7 out of 7 people found this review useful. 1 of 81 mc Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Someone from Lancaster, CA 01/17/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 2 of 81 Categories Comments Great for these types of students Anyone who dreams of pursuing higher education. Tips for prospective students Community college is a great stepping stone for those beginning their college careers. It's cheaper than big name universities and you get the same quality education; as well as living in a tight-knit community that's friendly and enjoyable. Bang for the buck With the rising costs of tuition, community college is a wise start for those who can't afford to go to a University. You get the same education but at a cheaper price which makes going to school more efficient. Am enjoying being here The school is community friendly and feels warm and welcoming. It also helps that I can stay close to home without commuting. The school also has many options to get involved in clubs",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}