{
    "relation": [
        [
            "Year",
            "2015-16",
            "2016-17",
            "2017-18",
            "2018-19",
            "2019-20",
            "2020-21",
            "2021-22",
            "2022-23"
        ],
        [
            "Nike",
            "$6.6",
            "$3.8",
            "$3.9",
            "$4.0",
            "$4.0",
            "$4.1",
            "$4.2",
            "$4.3"
        ],
        [
            "adidas",
            "$4.7",
            "$4.7",
            "$4.9",
            "$4.9",
            "$4.9",
            "$4.9",
            "$4.9",
            ""
        ]
    ],
    "pageTitle": "VolQuest.com - Vols to 'just do it' in 2015",
    "title": "",
    "url": "https://tennessee.rivals.com/content.asp?CID=1604260",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884421583,
    "recordOffset": 884400402,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1930=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 VolQuest.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{46870=The contract runs through June 30, 2023 and Nike has exclusive negotiating rights on the contract from 12-30-21 through 3-30-22, but extensions can be agreed upon at any time. Also, worth noting obviously any changes in uniforms in any sport has to be agreed to by the University of Tennessee., 44989=Hart noted to Volquest.com in 2013, it wasn't just about money. Other factors included recruiting impact, quality of product, product availability for all 20 sports, customer service, and branding and marketing assets., 42456=That thoroughness included members of the Vols' athletics department who traveled to Oregon last summer to meet with Nike executives, and apparel talks took place with multiple people in advance of the Vols' road football game at Oregon in mid-September., 39788=Vols to 'just do it' in 2015, 45346=\"Not only will we be the best team, but we will be the best dressed. I'm so excited,\" 2015 offensive line commitment and Top 100 prospect Jack Jones told VolQuest.com., 40760=The completion of the deal ends a negotiation with Nike and adidas, Tennessee's partner since 1997. Under Armour and Tennessee did have discussions, but a formal proposal was never made to Hart by Under Armour., 39750=January 31, 2014, 42726=The current adidas contract runs through June 30, 2015, but Tennessee will feel the effects of Nike in its bank account before then. According to a contract obtained by Volquest.com, via an Freedom of Information open records request this month, Nike will pay the University of Tennessee a $2 million signing bonus on July 1, 2014. The front-loaded contract also will give Tennessee an extra $800,000 in product in the first year to help with the transition from adidas to Nike.}",
    "textBeforeTable": "The completion of the deal ends a negotiation with Nike and adidas, Tennessee's partner since 1997. Under Armour and Tennessee did have discussions, but a formal proposal was never made to Hart by Under Armour. The deal is an eight-year, $35-million agreement, which puts Tennessee in the top 10 among colleges with Nike agreements. Beginning July 1, 2015, the \"swoosh\" is returning to the orange and white uniforms of all 20 Tennessee athletic teams as Vice Chancellor and Director of Athletics Dave Hart announced on Friday a new, comprehensive apparel and equipment contract with Nike for the University of Tennessee's athletics department that will marry the Vols and the globally recognized \"Just Do It\" company into the 2020s. January 31, 2014 Vols to 'just do it' in 2015 Brent Hubbs and John Brice VolQuest.com Staff Vol Shop",
    "textAfterTable": "\"We were very thorough and deliberate in assessing and evaluating our options with our apparel partner decision,\" Hart said in a University release. \"NIKE is the right partner for the University of Tennessee moving forward. We appreciate our current partner and the strong relationship we have had for many years. We will continue to work together through the end of the existing contract.\" That thoroughness included members of the Vols' athletics department who traveled to Oregon last summer to meet with Nike executives, and apparel talks took place with multiple people in advance of the Vols' road football game at Oregon in mid-September. The current adidas contract runs through June 30, 2015, but Tennessee will feel the effects of Nike in its bank account before then. According to a contract obtained by Volquest.com, via an Freedom of Information open records request this month, Nike will pay the University of Tennessee a $2 million signing bonus on July 1, 2014. The front-loaded contract also will give Tennessee an extra $800,000 in product in the first year to help with the transition from adidas to Nike. Year product cash total 2015-16 $3.6 mil. $3 mil. $6.6 mil. 2016-17 $2.8 mil. $1 mil. $3.8 mil 2017-18 $2.9 mil. $1 mil. $3.9 mil. 2018-19 $3.0 mil. $1 mil. $4 mil 2019-20 $3.1 mil. $900k $4 mil. 2020-21 $3.2",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}