{
    "relation": [
        [
            "Title",
            "OW2 Project",
            "Keywords",
            "Description",
            "Project contact person and e-mail",
            "Estimated workload",
            "Topic type"
        ],
        [
            "25. Port Orbeon Forms and Form Runner to the Google App Engine",
            "Orbeon Forms",
            "Java, Google App Engine",
            "The Google App Engine now supports Java. Orbeon Forms can eventually run on it, but it needs a new persistence implementation supporting the Google APIs. You will need to address the persistence implementation as well as make other changes to Orbeon Forms required by App Engine.",
            "Erik Bruchez (ebruchez@orbeon.com) Alessandro Vernet (avernet@orbeon.com)",
            "1-2 manmonths",
            "undergrad or master"
        ]
    ],
    "pageTitle": "Programming Contest 2010: Topics - OW2",
    "title": "",
    "url": "http://www.ow2.org/bin/viewrev/Events2010ProgrammingContest/Topics?rev=13.1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 638835235,
    "recordOffset": 638817574,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Full list of topics Implement an metric plug-in upon Spago4Q or Alitheia (Spago4Q) Web Service QoS Search Engine and Selection Tool (Trustie) Issue Tracking System for Open Source Projects Assistant for Using Online Code Increased performance by permanent cache (SpagoBI) Generic OLAP client (SpagoBI) In-memory analysis (SpagoBI) My BI with SaaS (SpagoBI) What-if simulation (SpagoBI) Semantic search (SpagoBI) OW2 Geolocation (all OW2 projects) Implement and integrate a state of the art cost-aware caching mechanism (Orbeon Forms) Port Orbeon Forms and Form Runner to the Google App Engine (Orbeon Forms) Implement an automatic XForms generator based on an XML Schema description (Orbeon Forms) An XForms Engine Dependency System for Orbeon Forms (Orbeon Forms) Implement the XProc W3C Standard in Orbeon Forms (Orbeon Forms) Smartphone application for JASMINe Monitoring (JASMINe) Data compression in JASMINe monitoring (JASMINe) GreenIT rules for JASMINe monitoring (JASMINe) Map view in JASMINe Monitoring (JASMINe) New connectors for JASMINe Monitoring (JASMINe) Version tracking in JOnAS admin console (JOnAS) EasyBeans & servlet proxy (EasyBeans) Plugin maven for JOnAS (JOnAS) Add a flex module for controlling Camel in the JOnAS console (JOnAS) Add a flex module for controlling JORAM in the JOnAS console (JORAM,",
    "textAfterTable": "Title 2. A Shell bundle dedicated to Joram administration OW2 Project JORAM Keywords Java EE, JMS, OSGi, Shell, Administration, OSGi RFC-147, Felix Gogo, Joram Description Felix GoGo is a reference implementation of the OSGi Alliance specification for “Command line interface” (known as RFC 147), and it defines an extensible shell service. Since release 5.3 Joram is now designed with an OSGi based services architecture to provide a dynamically adaptable messaging server. The goal of this project is to provide a dedicated Command line interface (CLI) for Joram JMS provider. This CLI will define command for Joram administration and monitoring, it could provide multiple user interfaces: textual, graphical, etc. References: Joram: http://joram.ow2.org Felix Gogo: http://felix.apache.org/site/apache-felix-gogo.html Project contact person and e-mail Andre Freyssinet, ScalAgent D.T. CTO, andre.freyssinet@scalagent.com Guillaume Surrel, ScalAgent D.T., guillaume.surrel@scalagent.com Estimated workload 2 to 4 manmonths depending of the number and complexity of the implemented function Topic type master/PhD Title 3. Joram over AMQP OW2 Project JORAM Keywords Java EE, JMS, MOM, interoperability, AMQP Description The Advanced Message Queuing Protocol (AMQP) is an open standard application layer protocol for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}