{
    "relation": [
        [
            "Temperature (ºC)",
            "Summer: December - February",
            "Autumn: March - May",
            "Winter: June - September",
            "Spring: September - November"
        ],
        [
            "Min",
            "20",
            "17",
            "6",
            "14"
        ],
        [
            "Max",
            "32",
            "26",
            "20",
            "23"
        ]
    ],
    "pageTitle": "Weather in Australia",
    "title": "",
    "url": "http://www.portaloceania.com/au-diverses-climate-ing.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 671336563,
    "recordOffset": 671323911,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22047=Summer can be tough, with temperatures reaching up to 40 degrees Celsius or more in some places. Four years ago by end of January in Melbourne, I've got 44º C while I was going to a meting wearing jacket and tie. Don't need to say that I got there so sweating that I was looking like coming out of a swimming pool fully dressed. My salvation was the public library with the best air conditioning system on the planet. The Outback and the Deserts of Australia are no go zone during hot summers, unless you are staying in one of the subterranean town built so due the heat. Over there, things can warm up trespassing the 50º in shade (if you find one). In Other parts of Australia, summer time can bring heat waves that can last for many days. I am talking about temps of 38º C for 8 or 9 consecutive days. For sure for people without air conditioning, summer is the worst time for human reproduction in Australia, with couples keeping a large distance from each other on bed. The positive side are the fantastic Australian beaches, providing great happy days outdoor, with plenty of surfing, picnics in parks, Waterfalls in the National Parks and so on...Sumer in Australia goes more or less from middle of December, to about end of February., 26639=Cyclones can Occur Between December and May on the North, Northeast and Northwest part of Australia. Some times Cyclones and tropical storms can flood large areas, cutting roads and connections with the rest of the country., 20203=During Winter, cool and warm weather play cat and rat all day long. The day may start freeze around 5º Celsius by 6 in the morning, with a deep blue bright sky that makes you feel like placing an X ray on the top of you sun glasses. By 10 in the morning, is the strip tease time, when everybody starts taking layers of cloth out. By noon is like summer time, and by 4 afternoon you have to put all layers back again. Tasmania which is cooler, has a different weather during winter time, as well as the North part of Australia which is warmer most part of the year. The Australian deserts gets minus something early morning and goes up to about 33 degrees by noon. The winter in Australia starts to show up by end of May to about middle of August. Even in July (supposed to be the peak of the winter) the day temperature is mild and vary nice to any outdoors activity. Depending about how strong is the winter, the Australian ski fields located between Melbourne and Sydney can have temperatures as low as - 8. In other words, if you are planing a trip to Australia, the best agenda is be on the South by Sumer time and travel up North or to the deserts by Winter time., 286=Since 2002}",
    "lastModified": "Mon, 20 Jul 2015 21:37:15 GMT",
    "textBeforeTable": "Temperatures in Adelaide Temperatures in the cities: The temperatures below are averages registered, and can be higher or lower depending on El Niño, El Father, El Mother, Global Warming, or any other nature phenomena the Met guys come with.. The Ozone hole in the Skies of Australia is big enough to cause serious burns. It is impressive how red a person gets for only 15 minutes under the sun on the beach. Use of heavy sun block is a must, or you may be candidate to a skin cancer Australian style.  The climate in Australia is officially classified as Tempered in the South to Tropical in the North. Australia is located entirely in the South Hemisphere below the Equator line. Cyclones can Occur Between December and May on the North, Northeast and Northwest part of Australia. Some times Cyclones and tropical storms can flood large areas, cutting roads and connections with the rest of the country. Most Humid City: Cairns and Darwin - The proximity to the equator reaching tropical zones and the mountains and vegetation around, provide a nice environment for the wild life but foe the humans the sensation to be cooked in vapour.",
    "textAfterTable": "Temperatures in Brisbane Temperature (ºC) Min Max Summer: December - February 21 32 Autumn: March - May 17 26 IWinter: June - September 5 21 Spring: September - November 15 25 Temperatures in Melbourne Temperature (ºC) Min Max Summer: December - February 20 28 Autumn: March - May 12 24 Winter: June - September 5 16 Spring: September - November",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}