{
    "relation": [
        [
            "Poster",
            "MarkH",
            "Home away from home Joined: 2005/7/20 From: The Great White North Posts: 494",
            ""
        ],
        [
            "Thread",
            "Posted: 2007/11/26 11:14 Updated: 2007/11/26 11:35",
            "Re: New Jeep Concept Vehicle: 2008 Jeep Renegade My sources tell me a lot of oil pricing/fluctuations is related not only to supply & demand, but strongly to refining capacity --which is limited in the U.S. (actually, consider it a \"fixed\" capacity because no one in the U.S. wants a new refinery built in their backyard --NIMBY syndrome! )...and yes, by the tight OPEC production control of the fraction of oil we get from the Middle East (the GIGA-rich greedy Arab bastards we love to hate!) So much for real \"competition\" in the oil industry in a free society. Looks more like price fixing to us! Oh, well, can't do much about it from my Dilbert cube. As for 110 MPG in the near future, the term WET DREAM comes to mind. I believe there is a standing $10,000,000.00 \"X prize\" award for a viable 100 MPG vehicle, and of course no one has claimed it yet. Hell, the reality is that lots of us would be ecstatic if the Compass & Patriot even got a measily 35MPG on the highway! At 40 MPG they'd be raging successes even without batteries, solar panels, hydrogen fuel cells, corn, sugar cane, saw grass, gerbil wheels, french fry oil, steam, hydraulic, or cold fusion options. Here's the X-Prize link for all you dreamers. Hey I'm not against anyone trying, it's just that I forgot how good a WET DREAM feels, before you come to your senses and realize it was all just a dream... X-Prize Organization",
            ""
        ]
    ],
    "pageTitle": "mike's totally free jeep news now - News",
    "title": "",
    "url": "http://www.jeepnewsnow.com/modules/news/article.php?storyid=2170",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 527269487,
    "recordOffset": 527242582,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3323=Chrysler LLC let loose a sneak peek of the next Jeep concept car - to debut at the 2008 North American International Auto Show (NAIAS) - the 2008 Jeep Renegade. From the press release: The 2008 Jeep Renegade Concept is a sporty B-segment-sized two-seater ideally suited for the all-weather delights of off-roading and dune surfing. Featuring a cut-down speedster windshield, a roll bar, openings in the door lowers and a hose-out interior, it is an \"eco-friendly\" vehicle with minimized use of materials \u0096 designed for those who want to enjoy the earth while taking care of its future. The propulsion system combines a 40-mile lithium-ion battery pack and a small-displacement BLUETEC diesel engine. The result: fuel economy of more than 110 miles per gallon. As far as I can tell, it looks to fit right at home in the lineup of the recent Jeep concept vehicles that have debuted at NAIAS the past few years. A couple of readers have mentioned that it looks like Master Chief's Warthog's from the Halo video game series.}",
    "textBeforeTable": "You must login or register to post a comment. We aren't responsible for their content. The comments are owned by the poster. FlatThreadedNested Oldest FirstNewest First margin:3px;\"> //--> google_color_text = \"000000\"; google_color_url = \"006633\"; google_color_link = \"006699\"; google_color_bg = \"FFFFFF\"; google_color_border = \"006699\"; google_ad_channel =\"\"; google_ad_format = \"468x15_0ads_al\"; google_ad_height = 15; google_ad_width = 468; google_ad_client = \"pub-0495763959545387\"; Reader Reactions",
    "textAfterTable": "Poster Thread Renegade Posted: 2007/11/27 15:25   Updated: 2007/11/27 15:25 Just can't stay away Joined: 2005/8/11 From: Atlanta, GA Posts: 80  Re: New Jeep Concept Vehicle: 2008 Jeep Renegade HA! It's good to see the boards alive like that. Learn a lot, too. I think the Compass could be retooled like this as well but a new name and new outlook would be good. I think a vehicle like this could easily be produced and priced somewhere between 15K and 18K without bells and whistles. There was a time when the Wrangler wasn't the only Jeep in the line-up that had a huge supply of aftermarket products. You had the Wrangler, the Cherokee and the Comanche (not so much the Grand). Give us another Jeep to build on our own time, Chrysler. A two-seater wouldn't compete with the Wrangler for those who are simply buying for looks & street use and if it was more of dune-buggy/rally type then it would have a completely separate market in off-road. Plus, this would fit well with this ORT idea that they're",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}