{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25"
        ],
        [
            "School",
            "Virginia",
            "Nebraska",
            "Oklahoma",
            "Ohio State",
            "Texas A&M",
            "Maryland",
            "Texas",
            "Georgia",
            "Arizona",
            "LSU",
            "Michigan",
            "Tennessee",
            "Virginia Tech",
            "Iowa",
            "Alabama",
            "UCLA",
            "Southern Cal",
            "Texas Tech",
            "Arkansas",
            "Clemson",
            "Miami-FL",
            "Purdue",
            "NC State",
            "Florida",
            "Auburn"
        ],
        [
            "Total Commits",
            "24",
            "15",
            "14",
            "11",
            "18",
            "18",
            "10",
            "10",
            "15",
            "9",
            "12",
            "10",
            "13",
            "11",
            "17",
            "11",
            "7",
            "14",
            "12",
            "13",
            "6",
            "11",
            "7",
            "6",
            "8"
        ],
        [
            "Points",
            "1,555",
            "1,448",
            "1,371",
            "1,260",
            "998",
            "972",
            "947",
            "896",
            "877",
            "850",
            "841",
            "832",
            "777",
            "675",
            "644",
            "615",
            "575",
            "568",
            "560",
            "543",
            "538",
            "477",
            "417",
            "400",
            "384"
        ],
        [
            "Stock",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Breakdown",
            "UVA remains the No. 1 team in the recruiting rankings, but as mentioned before with its class about 95 percent complete, it's going to be tough for them to stick in the top spot. Still it's a great class, nonetheless.",
            "Lose to Iowa State on Saturday and then get lucky on Sunday. That was the story for the Huskers this weekend. After dropping a tough contest to ISU, the Huskers went out and landed the nation's No. 2 running back Marlon Lucky.",
            "The Sooners move up a spot in this week's rankings after junior college offensive lineman Brandon Keith finally was ranked as a four-star player. Sooners have a great shot at finishing in the top five.",
            "How good is Ted Ginn? Last year's No. 2 player has provided a spark for the Bucks, just like many will in this very solid OSU 2005 class. Ohio State still has many heavy-hitters left on its wish list.",
            "The Aggies still have one of the Big 12's best classes, and they might have landed another big-time steal with QB Jamie McCoy.",
            "The Terps continue to hold steady with a solid class. Recent upgrades in prep school rankings allowed the Terps to climb slightly and it looks like Maryland has a great shot at signing a top 20 type class.",
            "The Horns added Henry Melton on Sunday. Melton is a 6-foot-3, 275-pound athlete that has running back speed. With a smaller class, UT likely won't have a top five group but in the end it'll be another very solid effort from Mack Brown and Co.",
            "It's only a matter of time before you see the Dawgs climb higher and higher up the rankings. UGA is involved with too many kids for them to not be a potential top five class once the smoke clears.",
            "Mike Stoops won his first Pac 10 game last week, and the Wildcats have been doing plenty of damage on the recruiting front with a great early effort. There are still some big names from California, junior colleges and Texas that the Cats are involved with, so this might end up being a top 20 type class.",
            "You know that Nick Saban will produce a great recruiting class, and the Tigers are still on many heavy hitters in Texas, Florida and throughout the nation. This class likely will be a top 10 group come signing day.",
            "Justin King remains target No. 1 for the Wolverines, and if UM is able to add the nation's top corner to their list, they have a great shot at finishing in the top 10.",
            "The Vols added DB Antonio Wardlow to the list this weekend and look to still be climbing the charts with many other blue-chippers.",
            "The Hokies still have some big names left on their visit list for the rest of the recruiting season, meaning that Tech could have a great shot at a top 20 class. Deveon Simmons will be a monster for Tech",
            "The Hawkeyes have a very solid foundation in this class with a big-time QB, DT and RB. Now it's time to add the final pieces of the puzzle.",
            "Prep-school commitments Brandon Fanney and Lorenzo Washington should be able to play quickly for the Crimson Tide. But with most of the class already done it might be tough to keep them in the top 20, but only time will tell.",
            "UCLA has surprised some on the field this year and the Bruins are becoming more and more of a threat again in the Pac 10 recruiting battles. Hard to tell if they'll finish in the top 25 or not, but this year's class still has some impressive players in it.",
            "How about we go out on a limb and say that USC will finish with a top-five recruiting class? The Trojans still are in on too many big-timers for that not to happen. Count on USC being in contention for a recruiting national championship.",
            "The Red Raiders have made strides and continue to be one of the better recruiting teams in the state of Texas. How they close will determine if this class remains in the top 25 or not.",
            "The Hawgs have some big junior college players on their wish list. If they're able to snag one or two of them, then they might have picked up on of Houston Nutt's best classes ever.",
            "There are still enough blue-chippers on the Tigers' board for them to end up in the top 25, possibly even top 15 once February arrives.",
            "Even though Miami has dropped two straight, the thought from many recruits is that Miami is still Miami. Canes could get good news this week from LB Antonio Clay.",
            "Stealing away five-star LB from 2004, Kyle Williams is a huge piece of this recruiting class. How they close with other Midwest players could determine if the Boilermakers remain a top 25 class.",
            "The Pack is back again in Florida making big waves with many of the area's top players. If N.C. State can pull off a surprise or two, then there is no reason to believe they have a great shot at a top 20 class.",
            "Until the Gators get a head coach in line, UF is fighting an uphill battle. When they do, look for them to make a run back up the charts.",
            "The Tigers likely have a great shot at a top 10 class. Like USC, Auburn simply has too many big name players looking hard at it, plus a run to the SEC title game has peaked even more interest from some of the top guys."
        ]
    ],
    "pageTitle": "BulldogBlitz.com - Huskers, Horns make move in team rankings",
    "title": "",
    "url": "https://mississippistate.rivals.com/content.asp?CID=352256",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887306455,
    "recordOffset": 887287838,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1936=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 BulldogBlitz.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40108=November 8, 2004}",
    "textBeforeTable": "The Big 12 turned in a good week and especially a good weekend with two conference powers picking up major commitments. It started first when the Nebraska Cornhuskers landed a commitment from the nation's No. 2 running back Marlon Lucky. It then continued when Texas landed a pledge from one of the nation's best athletes, Henry Melton. Rivals.com national analyst Jeremy Crabtree breaks down the entire top 25 in the team rankings, along with a few teams to keep an eye on. TD { font-family: Verdana; font-size: x-small; }TD.main { background-color: #ffffff;font-family: Verdana; }-->",
    "textAfterTable": "Down but not out for long: Notre Dame: The Irish pulled off a big win at Tennessee, and a victory like that can really help with Notre Dame's national recruiting efforts. Oklahoma State: The Cowboys collapsed against Texas and that might hurt with some Lone Star State prospects, but OSU does such a great job in Houston and in the Dallas Metroplex that you have to think they'll still make a run at a top 25 class. Wisconsin: The Badgers have two of the best recruiting assistant coaches in the business - Rob Ianello and Bret Beliema - and that's enough to allow them to capitalize on a great season on the field. They have a shot at a top 20 class then the smoke clears. Utah: Yes, the Utes can also recruit with the best of them. They already have a great quarterback, a great receiver and one of the nation's best kickers. The only thing that could possibly keep them out of the top 25 would be the questions on whether or not their coach will remain in Salt Lake City. Florida State: The Noles always close strong, and there",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}