{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Even though Rider is an open campus, there are always patrols walking and driving around campus.",
            "I don't know much about Greek Life but I heard it is safe and fun to take part in.",
            "There's a club for every student. I'm in accounting society, and Rider SERVES.",
            "ALL STUDENTS!",
            "Only touch the Rider Rock once, otherwise you won't graduate! Also don't step on a certain quad of grass at Westminster, it's bad luck.",
            "It's worth the price, I wouldn't even consider another school.",
            "There is an endless amount of clubs and organizations to join as well as many intramural sports going on all the time.",
            "Daly's, Cranberry's, and Westminster Dining Commons were all just redone this summer, they're completely renovated.",
            "Entire buildings get cleaned every day, as long as you keep your own room clean the dorms are pretty nice.",
            "You will most likely never have a professor who does not have the highest degree in their field.",
            "Rider just updated their cable so make sure you have a QAM tuner in your tv and a co-axel cable. Also, classes are difficult but there is free tutoring and many professors have quite lengthy office hours, and all are willing to help.",
            "Rider is a great place to be with a strong community and sense of belonging for every student. The programs they have for each major are always growing and being improved upon as well as the campus itself. Rider is my home!"
        ]
    ],
    "pageTitle": "Rider University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rider-University/reviews?_escaped_fragment_=/show/108004",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908172051,
    "recordOffset": 908113349,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{173150=Their academic programs are massive and very well taught. The events planned are amazing, just this last school year(2012-2013) we had J. Cole as one of our performers. There was also a casino night to promote the awareness of alcohol and safe sex. The prizes in the end were even better than the ones they give out at bingo night., 256729=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/14/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 1 of 59 Jeremy from Monroe Township, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Categories Comments Great for these types of students Athletes,Education Majors, Well-rounded people Tips for prospective students Get involved and keep yourself occupied as much as possible, college is definitely what you make of it. If you find an organization you will instantly have common interests and make friends. Also, stay organized know who your advisor is and where his/her office is so when time for scheduling comes you're all set! :) Login to rate or flag the reviews Robert from Hamilton, NJ 01/21/2011 Reviewer is A current student here. 6 out of 7 people found this review useful. 4 of 59 Categories Comments Tips for prospective students Get to know people. I'm a commuter and I didn't really reach out to other people. Everyone's friendly here at Rider, and they are really easy to get along with. Bang for the buck Sometimes it seems that Rider is priced too highly for the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}