{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6",
            "Step 7",
            "Step 8"
        ],
        [
            "Command or Action",
            "enable Example: Router> Enable",
            "configure terminal Example: Router# configure terminal",
            "voice service voip Example: Router(config)# voice service voip",
            "signaling forward {none | unconditional} Example: Router(conf-voi-serv)# signaling forward unconditional",
            "exit Example: Router(conf-voi-serv)# exit",
            "interface serial slot / port : timeslot Example: Router(config)# interface serial 1/0:23",
            "isdn supp-service name calling Example: Router(config-if)# isdn supp-service name calling",
            "exit Example: Router(config-if)# exit"
        ],
        [
            "Purpose",
            "Enables privileged EXEC mode. Enter your password if prompted.",
            "Enters global configuration mode.",
            "Enters voice-service configuration mode.",
            "Specifies whether or not the originating gateway (OGW) forwards the signaling payload to the terminating gateway (TGW). Keywords are as follows: none --Prevent the gateway from passing the signaling payload to the TGW. unconditional --Forward the signaling payload received in the OGW to the TGW, even if the attached external route server has modified the GTD payload.",
            "Exits the current mode.",
            "Specifies a serial interface created on a channelized E1 or channelized T1 controller. You must explicitly specify a serial interface. Arguments are as follows: slot / port --Slot and port where the channelized E1 or T1 controller is located. The slash is required. : time-slot --For ISDN, the D-channel time slot, which is the 23 channel for channelized T1 and the 15 channel for channelized E1. The colon is required.",
            "Sets the calling-name display parameters sent out an ISDN serial interface.",
            "Exits the current mode."
        ]
    ],
    "pageTitle": "SIP Configuration Guide, Cisco IOS Release 15M&T - Configuring SIP ISDN Features [Cisco IOS 15.5M&T] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/voice/sip/configuration/15-mt/sip-config-15-mt-book/voi-sip-isdn.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374667383,
    "recordOffset": 374624358,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49243=To attain ISUP transparency in VoIP Networks, the gateway needs to externally interface with the Cisco SC node. The Cisco SC node is the combination of hardware (Cisco PGW 2200 and Cisco SLTs) and signaling controller software that provides the signaling controller function. The Cisco SC node transports the signaling traffic between the SC hosts and the SS7 signaling network. A brief example of the process of an ISDN message containing an ISUP GTD message that comes into the Cisco OGW from a Cisco SC node is described below and shown in the figure below., 62114=The ISDN UDI to SIP Clear-Channel feature maps the ISDN bearer capability to an appropriate codec on the Session Initiation Protocol (SIP) trunk. When an ISDN bearer capability message is received as an Unrestricted Digital Information (UDI), only the clear-channel codec is used for negotiation on the SIP trunk. When the ISDN bearer capability message is non-UDI, like speech, the specific voice codecs are used for negotiation on the SIP trunk. The ISDN UDI to SIP Clear-Channel feature is applicable only for clear-channel and voice codecs. Integrated Service Router (ISR) gateways receive calls on ISDN trunks and forward them to SIP IP trunks., 11246=The workaround created in Cisco IOS Release 12.3(2)XB is no longer supported with the release of this feature. The workaround handled the CIC parameter by including it in the called-party number. The To header in the SIP INVITE message that contained the called-party number was prefixed with 101xxxx, where xxxx was the CIC parameter. The number was then sent to the ISDN in the SETUP message. When the ISDN received the number, for example, 101032119193921234 the ISDN ignored the 101 and then routed the call to carrier 0321, as if 0321 was in the TNS IE of the outgoing SETUP message. The rest of the number, formatted as the called-party number, was forwarded to the carrier., 140423=Configure the Cisco PGW2200 to encapsulate SS7 ISUP messages in GTD format before using the signaling forward command with the Cisco PGW 2200 signaling controller on the Cisco gateway., 164094=Enables clear-channel codec to UDI bearer capability mapping and UDI bearer capability to clear-channel codec mapping., 7370=The Cisco PGW 2200 SC is formerly known as the Cisco Media Gateway Controller (MGC) and the Cisco SC 2200 signaling controller.}",
    "textBeforeTable": "DETAILED STEPS 8.    exit 7.    isdn supp-service name calling 6.    interface serial slot / port : timeslot 5.    exit 4.    signaling forward {none | unconditional} 3.    voice service voip 2.    configure terminal 1.    enable SUMMARY STEPS To enable SIP IP phones to display caller-name identification for calls that originate on an ISDN network, perform the following task. Configuring ISDN Calling Name Display Configuring ISDN UDI to SIP Clear-Channel Feature Troubleshooting Tips Verifying SIP ISDN Support Features Configuring SIP PSTN Transport Using the Cisco Generic Transparency Descriptor Configuring SIP ISDN Suspend Resume Support Configuring SIP CLI for Caller ID When Privacy Exists Configuring SIP Carrier Identification Code Configuring Signal ISDN",
    "textAfterTable": "Configuring Signal ISDN B-Channel ID to Enable Application Control of Voice Gateway Trunks SUMMARY STEPS 1.    enable 2.    configure terminal 3.    voice service voip 4.    sip 5.    ds0-num 6.    exit DETAILED STEPS   Command or Action Purpose Step 1 enable Example:  Router> Enable   Enables privileged EXEC mode. Enter your password if prompted.   Step 2 configure terminal Example:  Router# configure terminal   Enters global configuration mode.   Step 3 voice service voip Example:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}