{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Will enjoy being here",
            "Will learn a lot"
        ],
        [
            "Comments",
            "I feel it is a bit more expensive than it should be given the small campus and smaller student population. However, ask me again in four years and I might think different.",
            "I am also into theater and singing. I am sure I will be in my element as Belmont is loaded with musically inclined students.",
            "The Journalism Department is top notch and cutting edge. I am sure I will be more than adequately prepared once I graduate!"
        ]
    ],
    "pageTitle": "Belmont University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Belmont-University/reviews?_escaped_fragment_=/show/60299",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00111-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890944631,
    "recordOffset": 890873113,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{199119=After the freshman orientation week in August, there is a candlelight event under the bell tower. The bell tower rings every hour on the hour. Thankfully, you can't usually hear it in your dorm room., 366995=© 2015, Cappex.com, LLC, 338315=Depending on your situation, the most accessible source of food is the cafeteria and though it may not be the best at times, it is the best choice due to your meal plan than spending seven to ten dollars eating out. For the year 2014-2015 there will be a new dining hall and other food places being opened to the students which expands the variety of food offered to them., 129606=the dorm life is strict but fair. the students have a curfew of 11:00 pm or weekdays and 1:00 am on weekends. the opposite sex has to sign in at the front desk to go to the other persons room. this system is very safe and allows the students to get their school work done but also have a good time at school., 39947=Even though the newer dorms are certainly nicer, the older dorms are the best place to be. Everyone bonds so quickly through the events hosted by Residence Life. I live in a dorm built in 1960, and all of the people who live in the new dorms come to hang out in our dorm because there's always something to do!, 201399=You need to realize that tuition goes up between $1000 and $2000 each year. Be prepared. Your professors are great sources of help and wisdom - use them!, 239665=The caf right now doesn't always have the highest quality food. However, Belmont is currently building a new Dining Hall which is said to be completed in 2015. There are plenty of other good on campus and close to on campus eating options as well., 46441=Although I am not involved in Greek Life, my roommates all are. Belmont has a strong Greek system. They hold eight different sororities and fraternities. All of which get to participate in Greek Week come March}",
    "textBeforeTable": "08/11/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 33 out of 34 people found this review useful. 1 of 84 Nicole from Brentwood, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp =",
    "textAfterTable": "It will be a huge change from UT, but after visiting and meeting many of the teachers, students, and employees I felt right at home. The environment is welcoming and there are so many great opportunities to take part in at Belmont. The transition will be hard, but I hoping for the best. Will learn a lot The tour I was given at the Nursing building was phenomenal. My advisor was helpful in every way possible and fully capable of answering all my questions and concerns. At Belmont, the class sizes are smaller so the student feels comfortable and can have the one on one teacher time if needed. The nursing program is one of the very best in the state! Login to rate or flag the reviews Jordan from Nashville, TN 01/27/2010 Reviewer is A current student here. 17 out of 17 people found this review useful. 2 of 84 Categories Comments Great for these types of students Belmont is perfect for all prospective students interested",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}