{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "CG Docket Nos.",
            "FCC"
        ],
        [
            "regulations.gov",
            "2014-25275",
            "",
            "10-51 and 03-123",
            "13-82"
        ]
    ],
    "pageTitle": "47 CFR Part 64, Subpart Z - Prohibition on Exclusive Telecommunications Contracts | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/47/part-64/subpart-Z?qt-cfr_tabs=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 918140743,
    "recordOffset": 918124800,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1017=Title 47 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{34185=Title 47 published on 2014-10-01, 13399=The Commission published in the Federal Register of December 10, 2014, a document concerning an Order on Reconsideration ( Order ) affirming the Commission's commitment to ensuring that high quality telephone service must be available to all Americans. In the Order, the Commission established rules to combat extensive problems with successfully completing calls to rural areas, and created a framework to improve the ability to monitor call problems and take appropriate enforcement action. In the Order, the Commission denies several petitions for reconsideration that, if granted, would impair the Commission's ability to monitor, and take enforcement action against, call completion problems. The Commission does, however, grant one petition for reconsideration because the Commission finds that modifying its original determination will significantly lower providers' compliance costs and burdens without impairing the Commission's ability to obtain reliable and extensive information about rural call completion problems., 79411=In this document, the Commission issues a Further Notice of Proposed Rulemaking (FNPRM) seeking comment on amending the definition of Telecommunications Relay Services (TRS) in the Commission's rules to conform to changes made to this definition by the Twenty-First Century Communications and Video Accessibility Act of 2010 (CVAA), which allows compensation for TRS calls between two or more individuals with disabilities. The Commission also seeks comment on eliminating as a mandatory minimum standard the requirement that TRS providers provide voice-carry-over to voice-carry-over (VCO-to-VCO) and hearing-carry-over to hearing-carry-over (HCO-to-HCO), subject to exceptions for Captioned Telephone Service (CTS) and Internet Protocol Captioned Telephone Service (IP CTS), as HCO-to-HCO and VCO-to-VCO calls would not require a communications assistant (CA) to provide functionally equivalent communication. These proposals are made to ensure that the intent of Congress in enacting the CVAA is implemented and that the mandatory minimum standards imposed for TRS are applicable and appropriate for each type of TRS to which they are applied.}",
    "lastModified": "Sun, 07 Jun 2015 23:37:15 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 15688 - Cargo Airlines Association Petition for Expedited Declaratory Ruling 2015-03-25; vol. 80 # 57 - Wednesday, March 25, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 47. Title 47 published on 2014-10-01. 66 FR 2334 § 64.2502 — Effect of state law or regulation. § 64.2501 — Scope of limitation. § 64.2500 — Prohibited agreements. next prev | , Jan. 11, 2001, unless otherwise noted. Source:",
    "textAfterTable": "FEDERAL COMMUNICATIONS COMMISSION Exemption. Effective March 25, 2015. 47 CFR Parts 1 and 64 Summary In this document, the Commission grants a request to exempt package delivery notifications from the Telephone Consumer Protection Act's (TCPA) restrictions on autodialed and prerecorded calls and messages to wireless telephone numbers, as long as consumers are not charged and may easily opt out of future messages if they wish, among other pro-consumer conditions. Congress gave the Commission the authority to exclude from this prohibition calls and texts that are not charged to the called party, subject to conditions necessary to protect the called party's privacy rights. This action is necessary to allow wireless consumers to receive package delivery notifications that will be welcome both as a convenience and as a way to guard against package theft. 2015-03-04; vol. 80 # 42 - Wednesday, March 4, 2015 80 FR 11593 - Rural Call Completion Recordkeeping and Reporting Requirements GPO FDSys XML |",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}