{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The intramural sports at Methodist makes the experience at Methodist much better. All students are allow to participate in intramural sports. Methodist SAC program hosts event that also improve campus life for students.",
            "Methodist has pool tables and ping pong tables in which students can entertain themselves. They are host of activities for students to partake in.",
            "The food in the dinning hall is satisfactory for the most part. It offers a variety of choices for students to choose from; the only downfall is the dinning hall is not open late for students to grab a quick bite to eat.",
            "The first year of dorm life was uncomfortable for; having a roommate and community bathroom was whole change of scenery. Dorm life improves as students change class status, and students are allowed to choose their roommates. There are on campus apartments, but a meal plan is not included.",
            "The classes at Methodist are challenging in the own way. The professors go out the way to make each class intriguing. The classes provide students with knowledge they will need post graduation.",
            "For new students at Methodist it's an easy place to fit in and make new friends. Don't be afraid to speak with you professors they are here to help you. Lastly improve your skills as a writer.",
            "My experience at Methodist has been worth while. I found a group of people that I could identify with, and made feel at home even though I am away from my home. The small environment makes it easier for students to learn."
        ]
    ],
    "pageTitle": "Methodist University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Methodist-University/reviews?_escaped_fragment_=/show/8280",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00030-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908550631,
    "recordOffset": 908510901,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33133=The food and dining on campus is great. Starting 2013/2014 school semester their will be opportunities for even better food and dining experiences., 2249=They put a lot into their academics. when I went there in April 2009, they were finishing one building ( i believe it was the science building) and starting a new theater., 164717=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/08/2009 Reviewer is Researching this school. Reviewer has been to campus. 8 out of 9 people found this review useful. 1 person found this inaccurate. 1 of 37 Sarah from King Of Prussia, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464",
    "textAfterTable": "Categories Comments Great for these types of students Professional Golf Management students. We are the top PGM school in the Nation. Also, Biology students. We have brand new facilities as well as the Physician Assistant school that has just expanded and the Nursing Program opened this year. Tips for prospective students Come and visit!!!!! I never thought I'd actually want to go to Methodist until I went and visited! It is a beautiful campus fully equipped with a golf course, fountain, and beautiful landscaping. The best advice I can offer is to simply go and take a tour of the school and see first hand what it is like. I loved the school as soon as I set foot on campus! Bang for the buck Methodist University is expensive tuition wise. On the bright side, I don't know many people who actually have to pay the full tuition and scholarships are very promising for most students! Our tuition money goes to maintaining the campus. We are currently expanding so most of the money is going towards modernizing some of the older buildings as well and breaking ground on new houses and on campus living. Am enjoying being here I absolutely LOVE it! Yes, it",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}