{
    "relation": [
        [
            "First Name",
            "Raymond",
            "James",
            "Angie"
        ],
        [
            "Last Name",
            "Bracy",
            "Hirni",
            "Beehler"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=4F2C2571-195E-4F03-B424-41A7557F4AB1&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 230600563,
    "recordOffset": 230584866,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49319=H.R. 800 and S. 1041, Employee Free Choice Act of 2007. Family Medical Leave Act regulations. H.R. 1644 and S. 969, Re-Empowerment of Skilled and Professional Employees and Constructions Trade workers (RESPECT) Act. H.R. 2831, Lilly Ledbetter Fair Play Act of 2007 and S. 1843, Fair Pay Restoration Act. H.R. 3195, ADA Restoration Act and S. 1881, Americans with Disabilities Restoration Act of 2007. Strengthening Communities through English and Integration Act., 12215=Generalized System of Preferences. Extend trade preference programs for developing and least developed countries. H.R. 5274, U.S. - Colombia Trade Promotion Agreement Implementation Act. Proposed changes to the table grape marketing order. H.R. 5635, Digital Television Transition Consumer Relief Act. A bill to eliminate duties on Digital TV converter boxes. H.R. 4040, Consumer Product Safety Modernization Act of 2007 and S. 2045, CPSC Reform Act of 2007. H.R. 3934 & S. 2372, Affordable Footwear Act of 2007. HR 4499; HR 4500; HR 4501; HR 4502; HR 4503, bills to temporarily suspend duties on whistles, compasses, Christmas tree lamps and ski equipment. H.R. 4994, elimination of duties for air mattresses. China trade: H.R. 1229, the Non-Market Economy Trade Remedy Act; H.R. 2942; H.R. 2714; S. 1677, H.R. 782 and S. 1607, the Fair Currency Act of 2007 House bills: imposition of countervailing duties on imports from non-market economies; make currency manipulation a countervailable subsidy; reinstate the practice of zeroing. Senate bills: pressure China to revalue its currency through pressure in international organizations and through anti-dumping duties on Chinese exports. H.R. 3890, Reinstatement of Competitive Need Limit waiver for Indian and Thai jewelry. Import Safety. Work with HHS to provide private sector leadership on its import safety action plan. Enhanced market access for investment in China and India. H.R. 3610, to amend Food Drug and Cosmetic Act to place new requirements on imported food, drugs and devices; FDA restructuring, ban on closing FDA labs, user fees, country of origin labeling, and adding carbon monoxide to a list of additives. Introduction of Wal-Marts international labor practices and ethical standards program., 64592=H.R. 4088, The SAVE Act of 2007. A bill to provide immigration reform by securing America's borders, clarifying and enforcing existing laws, and enabling a practical employer verification program., 56811=H.R. 3700 & S. 1951, legislation amending title XIX of the Society Security Act to ensure that individuals eligible for medical assistances under the Medicaid Program continue to have access to prescription drugs, and for other purposes Average Manufacturers Price. H.R. 1585, National Defense Authorization Act for Fiscal Year 2008, amendment 2912 TRICARE. H.R. 3668, TMA, Abstinence Education and Q1 Programs Extension Act of 2007 extension of deadline of requirement to use tamper-resistant prescription pads under Medicaid. HR 6331, Medicare bill for E-Meds, DME competitive bidding, and AMP. H.R. 5839, a bill to amend the Federal Food, Drug, and Cosmetic Act to improve the safety of drugs., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 18532=H.R. 4040, Consumer Product Safety Modernization Act of 2007 and S. 2045, CPSC Reform Act of 2007. H.R. 5635, the Digital Television Transition Consumer Relief Act, A bill to eliminate duties on Digital TV converter boxes. S. 1178, Identity Theft Protection Act, a bill to strengthen data protection and safeguards, require data breach notification, and further prevent identity theft., 36560=ERISA preemption of State laws on health benefits requirements. Educational outreach and information sharing on Company's health care benefits, open enrollment online tools, $4 generic prescriptions, health clinics and health information technology. H.R. 4296, Medicare Electronic Medication and Safety Protection (E-MEDS) Act of 2007 - supply chain safety., 61313=S. 2191, Americas Climate Security Act of 2007., 27719=H.R. 3970, Tax Reduction and Reform Act of 2007. H.R. 3735, to extend look-through treatment of payments between related controlled foreign corporations. S. 271, to provide shorter recovery period for depreciation of certain improvements to retail space. H.R. 3312, to extend work opportunity tax credit for Hurricane Katrina employees. H.R. 6, Energy Independence and Security Act of 2007. H.R. 3359, Mobile Workforce State Income Tax Fairness and Simplification Act of 2007. S.34 and H.R. 3396, Sales Tax Fairness and Simplification Act. H.R. 3996, Temporary Tax Relief Act of 2007. H.R. 1591, the Small Business Work Opportunity and Tax Act of 2007. H.R.3220, New Direction for Energy Independence, National Security, and Consumer Protection Act Titles 4 & 9. H.R. 3221, Foreclosure Prevention Act (energy tax provisions). S. 2886, Alternative Minimum Tax and Extenders Tax Relief Act of 2008. HR 6049, Energy and Tax Extenders Act of 2008. S. 3098, Alternative Minimum Tax and Extenders Tax Relief Act of 2008., 46009=H.R. 2419 and S. 2302, the Farm Bill. Food Stamp Program expansion and modernization & Country of Origin Labeling., 53039=H.R. 3221, Renewable Energy and Energy Conservation Tax Act of 2007 efficiency standards for appliances, lighting, and buildings. H.R. 3220, New Direction for Energy Independence, National Security, and Consumer Protection Act, Titles 4 & 9. H.R. 3237, Smart Grid Facilitation Act of 2007. H.R. 6, Energy Independence and Security Act of 2007. H.R. 3220, New Direction for Energy Independence, National Security, and Consumer Protection Act, Title 4 & Title 9.}",
    "textBeforeTable": "",
    "textAfterTable": "State AR Zip Code 72716 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  RAYMOND BRACY  2024340999  Raymond.Bracy@wal-mart.com 5. Senate ID#  40305-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}