{
    "relation": [
        [
            "Key",
            "loader.path",
            "loader.home",
            "loader.args",
            "loader.main",
            "loader.config.name",
            "loader.config.location",
            "loader.system"
        ],
        [
            "Purpose",
            "Comma-separated Classpath, e.g. lib:${HOME}/app/lib.",
            "Location of additional properties file, e.g. /opt/app (defaults to ${user.dir})",
            "Default arguments for the main method (space separated)",
            "Name of main class to launch, e.g. com.app.Application.",
            "Name of properties file, e.g. loader (defaults to application).",
            "Path to properties file, e.g. classpath:loader.properties (defaults to application.properties).",
            "Boolean flag to indicate that all properties should be added to System properties (defaults to false)"
        ]
    ],
    "pageTitle": "Spring Boot Reference Guide",
    "title": "",
    "url": "http://docs.spring.io/spring-boot/docs/current/reference/htmlsingle/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75933647,
    "recordOffset": 75772915,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1062527=8.0.23, 1080223=9.2.11.v20150529, 444209=Health responses are also cached to prevent “denial of service” attacks. Use the endpoints.health.time-to-live property if you want to change the default cache period of 1000 milliseconds., 1098601=1.10.19, 949088=The class name of the source that contributed this property. For example, if the property was from a class annotated with @ConfigurationProperties this attribute would contain the fully qualified name of that class. May be omitted if the source type is not known., 472662=The information exposed by the health endpoint varies depending on whether or not it’s accessed anonymously. By default, when accessed anonymously, any details about the server’s health are hidden and the endpoint will simply indicate whether or not the server is up or down. Furthermore, when accessed anonymously, the response is cached for a configurable period to prevent the endpoint being used in a denial of service attack. The endpoints.health.time-to-live property is used to configure the caching period in milliseconds. It defaults to 1000, i.e. one second., 949785=The default value which will be used if the property is not specified. Can also be an array of value(s) if the type of the property is an array. May be omitted if the default value is not known., 943571=A short description of the group that can be displayed to users. May be omitted if no description is available. It is recommended that descriptions are a short paragraphs, with the first line providing a concise summary. The last line in the description should end with a period (.)., 1103601=1.7.12, 1054979=1.2.17, 1055416=5.1.35, 1093306=4.3.10.Final, 947447=The class name of the data type of the property. For example, java.lang.String. This attribute can be used to guide the user as to the types of values that they can enter. For consistency, the type of a primitive is specified using its wrapper counterpart, i.e. boolean becomes java.lang.Boolean. Note that this class may be a complex type that gets converted from a String as values are bound. May be omitted if the type is not known., 945009=The full name of the method (include parenthesis and argument types) that contributed this group. For example, the name of a @ConfigurationProperties annotated @Bean method. May be omitted if the source method is not known., 1086991=2.2.0.v201112011158, 689340=When set to on Tomcat will compress responses with a length that is at least 2048 bytes. This limit can be configured by specifying an integer value rather than on, e.g.:, 1068288=2.3.11, 950296=Specify if the property is deprecated. May be omitted if the field is not deprecated or if that information is not known., 1454=Copyright © 2013-2015, 480701=By default the remote shell will listen for connections on port 2000. The default user is user and the default password will be randomly generated and displayed in the log output. If your application is using Spring Security, the shell will use the same configuration by default. If not, a simple authentication will be applied and you should see a message like this:, 1088813=2.3.22}",
    "textBeforeTable": "The following embedded servlet containers are supported out of the box: 9.1 Servlet containers Although you can use Spring Boot with Java 6 or 7, we generally recommend Java 8 if at all possible. Tip By default, Spring Boot 1.2.5.RELEASE requires Java 7 and Spring Framework 4.1.5 or above. You can use Spring Boot with Java 6 with some additional configuration. See Section 73.9, “How to use Java 6” for more details. Explicit build support is provided for Maven (3.2+) and Gradle (1.12+). 9. System Requirements Absolutely no code generation and no requirement for XML configuration. Provide a range of non-functional features that are common to large classes of projects (e.g. embedded servers, security, metrics, health checks, externalized configuration). Be opinionated out of the box, but get out of the way quickly as requirements start to diverge from the defaults. Provide a radically faster and widely accessible getting started experience for all Spring development. Our primary goals are: You can use Spring Boot to create Java applications that can be started using",
    "textAfterTable": "You can also deploy Spring Boot applications to any Servlet 3.0+ compatible container. 10. Installing Spring Boot Spring Boot can be used with “classic” Java development tools or installed as a command line tool. Regardless, you will need Java SDK v1.6 or higher. You should check your current Java installation before you begin: $ java -version If you are new to Java development, or if you just want to experiment with Spring Boot you might want to try the Spring Boot CLI first, otherwise, read on for “classic” installation instructions. Tip Although Spring Boot is compatible with Java 1.6, if possible, you should consider using the latest version of Java. 10.1 Installation instructions for the Java developer You can use Spring Boot in the same way as any standard Java library. Simply include the appropriate spring-boot-*.jar files on your classpath. Spring Boot does not require any special tools integration, so you can use any IDE or text editor; and there is nothing special about a Spring Boot application, so you can run and debug as you would any other Java program. Although you",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}