{
    "relation": [
        [
            "Draft Round",
            "Round 1",
            "Round 2",
            "Round 4",
            "Round 5",
            "Round 6"
        ],
        [
            "Player",
            "Star Lotulelei",
            "Kawann Short",
            "Edmund Kugbila",
            "A.J. Klein",
            "Kenjon Barner"
        ],
        [
            "Position",
            "DT",
            "DT",
            "OG",
            "LB",
            "RB"
        ],
        [
            "Height",
            "6'2\"",
            "6'3\"",
            "6'4\"",
            "6'1\"",
            "5'9\""
        ],
        [
            "Weight",
            "311",
            "299",
            "317",
            "250",
            "196"
        ],
        [
            "Draft Grade",
            "A",
            "C+",
            "D",
            "C",
            "A+"
        ],
        [
            "Preseason Grade",
            "C+",
            "A-",
            "F",
            "D-",
            "C-"
        ]
    ],
    "pageTitle": "Team-by-Team NFL Rookie Class Report Card Heading into Preseason Week 4 | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/1750005-team-by-team-nfl-rookie-class-report-card-heading-into-preseason-week-4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 24822747,
    "recordOffset": 24738210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121676=Surprisingly, the first rookie to emerge in August has been undrafted free agent Kenbrell Thompkins. His play has been so impressive that he’s pressing both Aaron Dobson and Boyce for playing time in the season opener., 126739=The New York Jets are hoping to turn their fortune around in 2013 with a much-improved offense. The only problem is they really didn’t address the offense in this draft other than grabbing quarterback Geno Smith in the second round along with a few offensive linemen. Their real need is at the skill positions., 251777=Kenny Vaccaro reminds me a lot of a Troy Polamalu-type at safety. He recklessly throws his body around and loves getting in the mix of a scrum. So far he has lived up to expectations and he will need to play a pivotal role for the Saints defense in 2013., 306022=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 115027=The Dolphins appeared to have a distinct plan for this draft—get faster on the defensive side of the ball. Well, they certainly did that with the additions of Dion Jordan, Jamar Taylor, Will Davis and Jelani Jenkins., 261860=The Cardinals may have arguably the best draft class of 2013., 132866=Arthur Brown was drafted to fill the role of Dannell Ellerbe at the Will linebacker position. His sideline-to-sideline ability is among the best of the 2013 rookie crop, however, he has struggled to take on blocks and needs to get both stronger and more physical at the point of attack. This has been my concern with him coming out of college and it seems to be haunting him early on., 273696=San Francisco knew they could address their future in the 2013 draft which is exactly what they did when they picked up Tank Carradine and Marcus Lattimore., 121913=Linebacker Jamie Collins is one of my favorite players of the 2013 draft class. He has struggled a bit in pass coverage and whiffed on a few tackles, but don’t underestimate this kid’s enormous potential. He will eventually prove to be one of the most versatile and talented players on that defense.}",
    "textBeforeTable": "Jeremy Brevard-USA TODAY Sports Carolina Panthers Next » 34 of 27 « Prev Overall Grade: C+ Keep an eye on undrafted free agent LB Paul Warrilow. This guy has been a tackling machine. Malliciah Goodman is a nice pickup in the fourth round who should be able to add some much-needed depth on the DL. His upside makes him a great value pick while also filling a big-time need for the Falcons. Many people believed cornerback Desmond Trufant was overrated; I was not one of those people. As it turns out, it appears I was wrong. But one of the benefits of “double dipping” in an area of need is that you increase your chances of finding the right guy. So far that guy appears to be Robert Alford. Overachieving undrafted free agents: LB Paul Worrilow (A). C  C- 219  6'3\"  QB  Sean Renfree  Round 7  B  C+ 213  6'2\"  S  Zeke Motta  Round 7 D+  D 206  5'11\"  DB  Kemal Ishmael  Round",
    "textAfterTable": "The Panthers are looking extremely stout in the middle with rookies Star Lotulelei and Kawann Short plugging things up. Each of these players seems to have Pro Bowl potential and should make for a highly frustrating duo for years to come against opposing offenses. Rookie RB Kenjon Barner was supposed to be a big-time steal in the seventh-round, but so far he’s played the part of underachiever. The Panthers still need help at the receiver position but at least they have some young pieces on defense to build upon. Overall Grade: C   « Prev 28 of 34 Next » New Orleans Saints Derick E. Hingle-USA TODAY Sport Draft Round Player Position Height Weight Draft Grade Preseason Grade Round 1 Kenny Vaccaro  S  6'0\"  214  A A-  Round 3 Terron Armstead  OT  6'5\"  306  B- A Round 3 John Jenkins  DT  6'4\"  346  B- C+  Round 5 Kenny Stills  WR  6'0\"  194  C",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}