{
    "relation": [
        [
            "Datasheet",
            "View Datasheet",
            "View Datasheet",
            "View Datasheet",
            "View Datasheet",
            "View Datasheet",
            "View Datasheet",
            "",
            "View Datasheet",
            "View Datasheet"
        ],
        [
            "Accessory",
            "TCA-1MEG",
            "TCA-292MM",
            "TCA-BNC",
            "TCA-N",
            "TCA-SMA",
            "TCA-VPI50",
            "TCA292D",
            "TCA75",
            "TPA-BNC"
        ],
        [
            "Description",
            "AMPLIFIER; HIGH IMPEDANCE BUFFER;1 MEG OHM/10PF;TEKPROBE BNC-TO-TEKCONNECT;WITH P6139B, CERTIFICATE OF TRACEABLE CALIBRATION STANDARD",
            "TEKCONNECT 2.92MM; TEKCONNECT ADAPTER WITH 2.92MM INPUT CONNECTOR",
            "TEKCONNECT BNC; TEKCONNECT ADAPTER WITH BNC INPUT CONNECTOR",
            "TEKCONNECT N; TEKCONNECT ADAPTER WITIH N-CONNECTOR INPUT",
            "TEKCONNECT SMA; TEKCONNECT ADAPTER WITIH SMA INPUT CONNECTOR",
            "TekVPI to TekConnect Adapter for 50ohm terminated accessories",
            "2.92 MM TEKCONNECT ADAPTER",
            "TEKCONNECT ADAPTER; 75 OHM TO 50 OHM, WITH 75 OHM BNC INPUT CONNECTOR",
            "Probe adapter from TekProbe-BNC to TekVPI"
        ]
    ],
    "pageTitle": "MSO/DPO70000 Oscilloscope | Tektronix",
    "title": "",
    "url": "http://www.tek.com/oscilloscope/dpo70000-mso70000",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 756774071,
    "recordOffset": 756736652,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{112574=Duration: 1:05, 68176=O/E CONVERTER; DC-1GHZ, 1100-1650NM, TPI - CERTIFICATE OF TRACEABLE CALIBRATION STANDARD, 103560=Duration: 5:50, 111422=Duration: 3:57, 93008=The 2015 catalog covers key product information, applications, and quick-reference selection charts on our complete range of Oscilloscopes, Logic Analyzers, Signal Generators, Real-Time Spectrum Analyzers, Digital Multimeters, Power Analyzers, Power Supplies, Frequency Counter/Timers and Signal Generators and software solutions., 110332=Duration: 4:56, 108026=Duration: 3:06, 105765=Duration: 5:27, 104631=Duration: 2:57, 126346=© 2015 Tektronix, Inc., 109148=Duration: 4:05, 113779=Duration: 6:18, 106907=Duration: 2:38}",
    "lastModified": "Sun, 02 Aug 2015 00:05:14 +0000",
    "textBeforeTable": "Configure & Quote Current Probe: 100 MHz, Amplifier (Requires Probe) TCPA400 View Datasheet Configure & Quote Current Probe: 100 MHz, Amplifier (Requires Probe) TCPA300 View Datasheet Configure and Quote Description Probe Data Sheet Current Probe Configure & Quote 17 channel differential input logic probe for MSO70000 with solder-in accessories P6780 View Datasheet Configure & Quote PROBE, P6750 DMAX FOR MSO70K INSTRUMENTS P6750 View Datasheet Configure & Quote PROBE, GENERAL PURPOSE UPGRADED W/ ACCESSORY KIT P6717A View Datasheet Configure and Quote Description Probe Data Sheet",
    "textAfterTable": "Data Sheet Software Package / Software Option Description Configure and Quote View Datasheet TekScope Anywhere™ TekScope AnywhereTM brings the power of the scope analysis environment to the PC. Users now have the flexibility to perform analysis tasks including timing, eye, and jitter analysis outside the lab. Contact Account Manager Application DeveloperToolkit Available with TekScope Firmware v.6.4 or later; a set of tools which enable users access to the Tektronix Oscilloscope and measurement system to develop and deploy custom analysis capabilities. (Note: This software is automatically included in all models of this series and doesn't need to be ordered.) Contact Account Manager View Datasheet Opt. 10G-KR 10GBASE-KR/KR4 Compliance and Debug Solution. Contact Account Manager View Datasheet Opt. BRR Automated compliance and measurement solution for BroadR-Reach 1.2. Contact Account",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}