{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Police are always on campus. If you need someone to walk home with at 3 in the morning, just call the police, and they will send an escort to walk with you. The police report crime not only on the Georgia Southern campus, but also throughout Statesboro. GSU is one of the safest universities in the nation.",
            "Georgia Southern has many clubs and activities that reflect its diversity. If you want to join a certain club, chances are that GSU already has that club. If GSU does not already have the club, then you can create one with a certain number of people.",
            "Georgia Southern University is a college that is great for basically any type of student. No matter who you are, you will definitely make friends and may possibly find your special someone here.",
            "Join a club. Go out to eat with friends. Go on road trips with friends on the weekends. Go work out at the RAC. If you're a music major, go practice some more and make it fun by setting bigger goals for yourself. If you're feeling tired, take a nap. Call your parents every once in a while. Spend time with your family when they visit or when you go back home.",
            "There are several dining locations on campus. Beginning Fall 2013, the meal plans are changing from the traditional 3, 6, 10, 15, and 19 meal plans to unlimited Lakeside and Landrum with a limited amount of Dining Dollars to spend at other locations and a limited number of guest passes to Lakeside and Landrum. I have enjoyed the meal plan that I had this year, but I have to wait and see what it is like beginning next year.",
            "When applying for housing, you have the option of choosing a roommate. Otherwise, GSU Housing will choose the roommate(s) for you using a small survey. Whether you are friends with your roommate(s) or not, it is important to get along with him/her/them. Each hall has a Community Leader (CL) who helps enforce the rules. Each building has a Resident Assistant (RA). GSU Housing organizes some activities throughout the year to encourage residents to get to know each other.",
            "To be in good academic standing, you need to maintain a 2.5 GPA. It isn't that hard if you go to class and keep at your studies. If you need help with a certain subject, tutoring is available. You may also want to form study groups. If you are in the University Honors Program, you need to maintain a 3.3 GPA.",
            "Apply for housing as soon as possible. If you wait until the last minute, then you may be stuck in a dorm with a shared bedroom and a community bathroom. Apply for FAFSA before the priority deadline. Always look for scholarship opportunities. If you are up to it, apply for the University Honors Program. Don't wait until the last minute to finish your essay. If you are invited to 1906 Scholars' Showcase or Scholars' Day, be prepared for at least one interview. Google college interview questions, and make sure you know the answers to questions like these. The interviews determine who gets scholarships.",
            "At Georgia Southern University, you will make friends because GSU is large and diverse and has all kinds of students. The professors are kind and want to get to know you. GSU has a bus system that makes all buildings easier to get to."
        ]
    ],
    "pageTitle": "Georgia Southern University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Georgia-Southern-University/reviews?_escaped_fragment_=/show/85060",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899233555,
    "recordOffset": 899036161,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{943058=Starting in 2004, Freedom, American Bald Eagle, takes flight before each home football game and flies over Spring commencement. Homecoming is BIG down here! Yellow School Buses, GUS, True Blue, Whose House? Our House! and other chants, Day One, and many more., 1109809=There are many places on campus where you can eat including Chick-Fil A and Starbucks. There are also two all you can eat dining halls, Lakeside and Landrum. I cannot offer an honest opinion on the dining halls because they will be opened in Fall 2013 but it is said that they should have a variety of different cuisines and also vegetarian and gluten free foods. Across from campus there is a Subway which is open for 24 hours, a Domino's and a Chinese food business which both delivers., 363663=Some of our on-campus traditions include: Walking around Sweetheart Circle. It is said that if you and significant other walk around Sweetheart circle 3 times you will marry each other.(most couples chose that as the opportunity to start their engagement) Watermelon cutting is another long lasting tradition. Every summer in the month of July, every Monday at 10am watermelon is cut by the University President for the surrounding community who chooses to join us on campus. There is also the flight of Freedom, the Eagles' own eagle, as she soars over the graduates during graduation as a symbol of You can SOAR anywhere from Here. These are some of the most popular traditions but certainly not all, you'll experience the rest and make your own once you are here!, 382067=Activities and clubs. Humans Vs. Zombies organized by students. Weekly movies in the Russel Union. Archery and Shooting range coming Fall 2012., 358341=You do pay what you get for. All the fees are used to make the students life better. They have a plethora of activities throughout the year such as a concert with big name like, The Band Perry and The Fray who comes this year, 2012. Our gym, the RAC, is equipped with a number of machines to do you exercise plan. Our campus has so many computers, one could not count them all. Georgia Southern University's library is a four story high structure that is open 24/7 to all students., 778660=Meal Plans are expensive and you will tend to get tired of eating the same thing from the same places. The only franchise restaurants on campus are Chic Fil A , Einstein and Bros, Starbucks, and Cold Stone Creamery. However the Landrum is being rebuilt for FALL 2013 which is our official cafetiere along with Lakeside Cafe another Dining Hall on campus near the lake. As far as off-campus dining there are a handful of fast food restaurants and places like Longhorn or Applebees., 551942=The annual watermelon cutting every Tuesday and Thursday each July, 1084982=I am not sure how Fall 2013 will treat you, since I had a different meal plan. On my meal plan, I had ten meals that I could eat at any of the on-campus restaurants. It allowed me a lot of variety in food choices. One of the best places on campus, though, was the Nest, which is a temporary cafeteria-style eatery. This is more similar to what you'll find on the 2013-2014 dining plans, with your unlimited meals at Lakeside and Landrum Cafes. The best things about the Nest were the variety (four different lines serving different meals) and the close proximity to my dorm. I anticipate that future freshmen will find the unlimited dining plans very convenient., 395571=The on-campus dorms are close to each other and easy to access. They vary in style giving students choices in where they want to stay. Freedom's Landing is a new dorm room that will open Fall 2012., 336423=greek students are actively involved in over 180 organizations. some of them are ronald mcdonald house, arthritis foundation,crippled childrens home, march of dimes and leukemia foundation., 72764=georgia southern was named as one of the best values in public college by kiplinger's personal finance magazine in 2010., 160075=Night Life -there are a number of places located adjacent to campus where students go for fun at night. You can dance, play team trivia, eat some chicken wings, or just relax with some friends depending where you go. On campus activities: -The RAC provides a number of recreational fields, indoor basketball courts, racket ball courts, indoor/outdoor pools and hot tubs, a sauna, an extremely large fully equipped gym and an indoor rock climbing wall! You can also rent kayaks from here to kayak on local rivers. -Wildlife and Raptor Center is free to students and is home to a number of reptiles and large birds of prey, including several bald eagles. -the Botanical Gardens are a nice place to go and be in peace with nature. -Sweetheart Circle provides students a beautiful picnic and recreation Area -Athletic events! Georgia Southern is known for its successful football program, which is moving to the FBS. Off Campus -Splash in the Boro is a local water park for all ages -The Clubhouse includes bowling, laser tag, mini-golf, batting cages, and a driving range. Mon-Thur for students offers unlimited bowling, laser tag, and mini golf for $10! -Georgia Southern is located 45mins from Savannah and just over 1hr to two beaches! By 2015 Georgia Southern and the Department of Natural Resources will have complete a 32 lane on campus shooting range!, 1082984=Southern is great for any student, really. Out of the 20,000 people that will attend there in fall of 2013, you will be able to seek out opportunities to make Georgia Southern fit you, rather than having to conform yourself to fit a generic university's standards., 183525=How rigorous a class depends on the class you are take 1000 - 2000 level classes tend to be very easy at Georgia Southern and 3000 - 4000 level classes are more rigorous requiring constant studying and practice, however 5000 level classes are the most rigorous requiring almost no sleep and constant work, 70547=georgia southern has been named one of america's best colleges by forbes magazine based on the student's point of view. georgia southern's college of business administration has been named one of the best business schools in the country by the princeton review. georgia southern's online master of science in computer science has been ranked as one of the top 10 best buys in the country by the education web site geteducated.com.georgia southern was named one of the most military friendly universities in the country in military advanced education's 2012 guide to military-friendly colleges and universities. georgia southern's master of science in nursing - family nurse practitioner program has been ranked in the top 20 nationally by u.s. news & world report. georgia southern's online graduate programs in business, education, information technology and nursing have been ranked among the nation's best in the first-ever edition of top online education program rankings by u.s. news & world report. georgia southern has been ranked fourth in the nation for graduating african-americans majoring in the physical sciences by diverse: issues in higher education. and for the sports fans, georgia southern currently holds the southern conference football title., 19797=I feel that I am learning a lot at GSU. When I started my second semester in Fall 2009, I attended Summer 2009, I thought i would be able to just breeze through my classes, but that was not the case at all. I feel that I was being challenged in all classes. It was not where i could just skim over the material and be okay. I actually had to sit down and study, which I never did before. In the end it did pay off, i was better prepared for class and the information did not just leave my head after I took an exam. It was there to stay. Your professors are there to help you., 1104217=I live in Watson Pods and I love the community. It is a traditional style dorm but the people are all nice and easy to get along with. There is the occasional shut ins or noise-makers as there are anywhere. I love where i live and I intend to stay if the housing department lets me in the Fall of 2014., 466902=I had mainly positive experiences with dorm life there inside and outside of my own building. My dorms had a great location on campus and were pretty new, considering that they were finished around 2007 or so. The other dorms may not have been as close to campus, but what they lacked in convenience they made up for with more spacious rooms that were already furnished and had full kitchens., 425622=The dorms are pretty great. I lived in Eagle Village my first year, and I had a blast. May sure you get to know your neighbors on your hall. They'll probably end up being your best friends later in the year., 487718=Some classes can be difficult, but only if you don't attend class. Again utilize the resources available to you! New biology building will be completed at the end of the Spring of 2013., 858789=Georgia Southern is transitioning right now in their dining halls, so our cafeteria is a big trailer. Don't get me wrong, the food is still good. But for fall 2013 there will be a new dining hall with a new meal plan system. So for prospective students, I don't have much information on how the new dining plan system will work., 957023=GSU is affordable but is still college!! I will be starting a summer program in June 2013 which will cost my family around $5000.00. Any help with that would be tremendous., 546684=Southern Pines is where I lived at during my Freshman year. It is a nice place with a full-sized bed and your own room. You share a bathroom with one other person and have a choice to live with two or four people. I believe Southern Courtyard is the best place to stay for the best price. It has a full-sized bed, full kitchen and a shared bathroom. For 2012 freshman, Freedom's Landing is a new establishment that used to be apartments. You have your own full-sized bed, own bathroom, and share a kitchen and living room with three other people., 1013634=Brand new dining halls for the 2013 Fall semester. Also, Chik-Fil-A, Starbucks, and Einstein Bros. all on campus., 843155=Great campus and wonderful traditions. All though the school is now reaching 21000 students the small feel is definitely felt all throughout campus. GATA Eagles!, 344369=haven't quite figured that out yet . . . there is always tybee island and savannah though! i visited in early february, and it felt like summertime - it was awesome! the nights get colder though. i also heard that the walmart there is the fourth largest in either the country or world., 486852=New renovations to the two major dining halls which will be completed in the Fall of 2013. We also have a Starbucks, Chick-Fil-A, Einstein Bagels, and Cold Stone Creamery., 346833=in early february i visited for open house, and throughout the day i became convinced that this was the undergraduate school for me! the campus and population is ideal, and i really look forward to the research opportunities here. i'm about to apply for my housing right now! yay!, 871309=There are some neat options for food to eat. My college even has a new website for college students to order delivery too. The best restaurants were closed down for maintenance until Fall of 2013, and I am very excited for them to open again., 975112=There are several dining locations on campus. Beginning Fall 2013, the meal plans are changing from the traditional 3, 6, 10, 15, and 19 meal plans to unlimited Lakeside and Landrum with a limited amount of Dining Dollars to spend at other locations and a limited number of guest passes to Lakeside and Landrum. I have enjoyed the meal plan that I had this year, but I have to wait and see what it is like beginning next year., 977089=Apply for housing as soon as possible. If you wait until the last minute, then you may be stuck in a dorm with a shared bedroom and a community bathroom. Apply for FAFSA before the priority deadline. Always look for scholarship opportunities. If you are up to it, apply for the University Honors Program. Don't wait until the last minute to finish your essay. If you are invited to 1906 Scholars' Showcase or Scholars' Day, be prepared for at least one interview. Google college interview questions, and make sure you know the answers to questions like these. The interviews determine who gets scholarships.}",
    "textBeforeTable": "06/18/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 53 out of 56 people found this review useful. 1 of 302 Ivory from Union City, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. Georgia Southern University Reviews Georgia Southern University › Georgia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Tips for prospective students I love Georgia Southern! I come from metro Atlanta and I love being where I can retreat to the out doors. The campus is so beautiful and peaceful. It is very diverse in its students and always has something going on for students to do. I just finished my freshman year and I lived in a traditional dorm on campus and I would never trade that first year experience for anything! It was a lot of fun and you walk away with a lot of friend who live on your hall. Yes, it can be loud at times but simply ask people to quiet down and it is usually not a problem. I am involved with GSU Adrenaline Show Choir. It is a blast! Getting involved with some sort of club or activity is a great way to stay focused and really find some great people you can meet with. Southern has the biggest Recreation Center in the south. It is a great place to get out some steam if thats what you do when you work out. It also has two pools and hot tubs (indoor and outdoor) with a sauna. There are also great classes that you can take like yoga (my favorite!) to aerobics to self defense. It is always great for you mind and body to relax and do something for your self. So pick different things to try out and find your favorite! If you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}