{
    "relation": [
        [
            "Severity",
            "Campus Wide Outage",
            "Major Administrative Process inoperable or degraded",
            "Application feature error"
        ],
        [
            "Response",
            "15 Minutes",
            "30 Minutes",
            "2 Hours"
        ],
        [
            "Target Close / Timeframe",
            "4 Hours, 24x7",
            "6 Hours, 24x7",
            "12 Hours, M-F 8am-5pm"
        ]
    ],
    "pageTitle": "Services Catalog | UNT SYSTEM",
    "title": "",
    "url": "https://itss.untsystem.edu/services/data-communications/eduroam",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 872410063,
    "recordOffset": 872385764,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{347=Availability support is provided 24x7, excluding planned downtime. Planned downtime can occur during maintenance windows which are identified as every Saturday, 7:00 pm-noon on Sunday and every Tuesday and Thursday from 7:00pm-9:30pm.}",
    "TableContextTimeStampAfterTable": "{17503=Availability: 98.9%, 24x7, excluding planned downtime, calculated monthly. Planned downtime can occur during maintenance windows which are identified as every Saturday, 7:00 pm-noon on Sunday and every Tuesday and Thursday from 7:00pm-9:30pm., 127420=System Availability: 98.9%, 24x7, excluding planned downtime, calculated monthly. Planned downtime can occur during maintenance windows which are identified as every Saturday, 7:00 pm-noon on Sunday and every Tuesday and Thursday from 7:00pm-9:30pm., 215165=1155 Union Circle #305398 Denton, TX 76203-5017, 111408=Availability: 98.9%, excluding planned downtime, calculated monthly. Planned downtime can occur during maintenance windows which are identified as every Saturday, 7:00 pm-noon on Sunday and every Tuesday and Thursday from 7:00pm-9:30pm.}",
    "lastModified": "Tue, 04 Aug 2015 09:37:45 GMT",
    "textBeforeTable": "Incident Response: Availability support is provided 24x7, excluding planned downtime. Planned downtime can occur during maintenance windows which are identified as every Saturday, 7:00 pm-noon on Sunday and every Tuesday and Thursday from 7:00pm-9:30pm. Service Level: Production Job definition and scheduling Point of contact with vendor technical support Standards and practice for migration of software customizations and modifications Assessment and execution of major software upgrades Application of software patches & fixes Installation, Configuration and Administration of Application Software Application software architecture assessment and consultation Hosting and running of applications including, but not limited to, EIS (PeopleSoft), Degree Management System (DARS), Cognos, and BlackBoard Analytics Base Level Services: Application Administration & Support Print All Services Catalog Services Catalog Services Catalog Home",
    "textAfterTable": "Services Not Included: Does not include clinical, research or local UNTHSC systems or support. Customers Served: UNT, UNTD, UNTHSC, UNTS Application Development Base Level Services: Business case development with customer Define detailed requirements Design solution Develop solution with in-house staff or via third party Test, implement and provide ongoing support for the application Service Level: Ongoing as needed and as planned Services Not Included: Does not Include Local Application Development Customers Served: UNT, UNTD, UNTHSC, UNTS Application Performance Monitoring (Zabbix) Base Level Services: System administration and operation of the Zabbix availability and performance monitoring system including user administration and user support. Monitoring",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}