{
    "relation": [
        [
            "Attribute",
            "name",
            "scope",
            "cache-on-match",
            "cache-on-match-failure"
        ],
        [
            "Default",
            "none",
            "request.parameter",
            "true",
            "false"
        ],
        [
            "Description",
            "Specifies the input parameter name.",
            "(optional) Specifies the scope from which the input parameter is retrieved. Allowed values are context.attribute, request.header, request.parameter, request.cookie, request.attribute, and session.attribute.",
            "(optional) If true, caches the response if matching succeeds. Overrides the same attribute in a constraint-field-value subelement.",
            "(optional) If true, caches the response if matching fails. Overrides the same attribute in a constraint-field-value subelement."
        ]
    ],
    "pageTitle": "C (Sun Java System Application Server Enterprise Edition 8.2 Developer's Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19900-01/819-4734/6n6s7sigs/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00159-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77895034,
    "recordOffset": 77879400,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 27 Jan 2011 07:23:02 GMT",
    "textBeforeTable": "cache Subelements Table A–9 The following table describes subelements for the cache element. Subelements sun-web-app (sun-web.xml) Superelements Configures caching for web application components. cache C Next: D Previous: B Sun Java System Application Server Enterprise Edition 8.2 Developer's Guide Appendix A Deployment Descriptor Files  > C Sun Java System Application Server Enterprise Edition 8.2 Developer's Guide  > Documentation Home  >",
    "textAfterTable": "Attributes The following table describes attributes for the cache element. Table A–10 cache Attributes Attribute   Default   Description   max-entries 4096 (optional) Specifies the maximum number of entries the cache can contain. Must be a positive integer.  timeout-in-seconds 30 (optional) Specifies the maximum amount of time in seconds that an entry can remain in the cache after it is created or refreshed. Can be overridden by a timeout element. enabled true (optional) Determines whether servlet and JSP caching is enabled.  Properties The following table describes properties for the cache element. Table A–11 cache Properties Property   Default   Description   cacheClassName com.sun.appserv.web.cache.LruCache Specifies the fully",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}