{
    "relation": [
        [
            "Value for -F recover-options",
            "beginning",
            "continue",
            "wait"
        ],
        [
            "Description",
            "After a fault recovery, printing restarts from the beginning of the file.",
            "After a fault recovery, printing starts at the top of the page where the printing stopped. This recovery option requires a print filter.",
            "After a fault recovery, printing stops until you enable the printer. After you enable the printer by using the enable command, printing starts at the top of the page where printing stopped. This recovery option requires a print filter."
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19253-01/819-7355/gfjpw/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00306-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76763302,
    "recordOffset": 76753675,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 06 Jan 2011 10:49:23 GMT",
    "textBeforeTable": "Table 6–1 Printer Administration by Using LP Print Commands (Task Map) Administers Printers Using LP Print Commands (Task Map) Next: Administering Printers That Are Associated With PPD Files (Task Map) Previous: Chapter 5 Setting Up Printers by Using LP Print Commands (Tasks) System Administration Guide: Printing Chapter 6 Administering Printers by Using LP Print Commands (Tasks)  > Administers Printers Using LP Print Commands (Task Map) System Administration Guide: Printing  > Documentation Home  >",
    "textAfterTable": "Give users a choice to turn off printing of a banner page when they submit a print request.   How to Make Banner Pages Optional by Using LP Print Commands Turn off banner pages.  Set the -o banner=never variable for a printer you can turn off banner pages under all circumstances. How to Turn Off Banner Pages by Using LP Print Commands Define a class of printers.  Group printers in a class by using the lpadmin -c command. Printers can be grouped in the following classes: Printer type Location Work group How to Define a Class of Printers by Using LP Print Commands Set fault alters for a printer.  The print service can notify you when it detects a printer fault. Use the -A option with the lpadmin command to set fault alerts for a printer. How to Set Fault Alerts for a Printer by Using LP Print Commands Set printer fault recovery.  You can choose not to receive any fault notification. You can find out about printing faults",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}