{
    "relation": [
        [
            "Responder",
            "Philip Jägenstedt",
            "Leif Halvard Silli",
            "Gregory Rosmaita",
            "Eric Carlson",
            "aurélien levy",
            "Marco Ranon",
            "Masatomo Kobayashi",
            "Denis Boudreau",
            "Joshue O Connor",
            "Jon Gunderson",
            "Richard Schwerdtfeger",
            "Laura Carlson",
            "Sean Hayes",
            "John Foliot",
            "Silvia Pfeiffer",
            "Judy Brewer"
        ],
        [
            "Production practice and resulting requirements",
            "Do not accept this section for the following reasons",
            "Accept this section as proposed",
            "Accept this section as proposed",
            "Do not accept this section for the following reasons",
            "Accept this section as proposed",
            "Abstain",
            "Abstain",
            "Abstain",
            "Accept this section as proposed",
            "Accept this section as proposed",
            "Accept this section as proposed",
            "",
            "Accept this section with the following changes",
            "Abstain",
            "Accept this section as proposed",
            "Abstain"
        ],
        [
            "Comments",
            "What is a \"proprietary workstation\"? Is it a workstation that runs proprietary software, or something else? I have no major issue with any of the requirements, but am voting to reject this as it seems like advice to authors and organizations rather than something the HTML WG needs to consider when developing the technical solutions. The exception might be (PP-2), but the metadata issue has also been mentioned in other requirements, so there's no need to repeat it.",
            "",
            "",
            "This is advice for people authoring media, not HTML. It isn't something the HTML WG needs to consider.",
            "",
            "Abstaining since I believe that this issue is not strictly related to accessibility but related to proprietary formats and copyright - therefore not really my remit.",
            "I am not sure whether this kind of requirements should be included or not.",
            "I agree that this does not seem to be something directly related to accessibility or even HTML5.",
            "",
            "",
            "",
            "",
            "I think this probably needs to be recast to indicate that specific technical choices for HTML are not made in a vacuum, and need to consider wider impliations of the production of media. So this section is not really a user need, (apart from a general requirement to maximise the amount of accessible content being produced), but may influence specific technical choices later on.",
            "While I understand and support the requirements, I am concerned again that this is out of scope for the delivery of and content, as it feels more like authoring agent requirements",
            "",
            ""
        ]
    ],
    "pageTitle": "Results of Questionnaire Review of Media Accessibility Requirements - Web-Based Straw-poll and Balloting System",
    "title": "",
    "url": "http://www.w3.org/2002/09/wbs/44061/20080526_media-requirements/results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 818361787,
    "recordOffset": 818326146,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6542=This questionnaire was open from 2010-05-27 to 2010-06-07.}",
    "lastModified": "Wed, 29 Jul 2015 10:34:11 GMT",
    "textBeforeTable": "Details Abstain Do not accept this section for the following reasons 11 Accept this section with the following changes 5 Accept this section as proposed Results All responders Choice Summary Accept this section? (AD-14) Support metadata, such as copyright information, usage rights, language, etc. (AD-13) Allow the author and the user to relocate the description track within the audio field, with the user setting overriding the author setting. The setting should be readjustable as the media plays. [what is the difference to AD-8?] (AD-12) Provide a means to prevent descriptions from carrying over from one program or channel when the user switches to a different program or channel. (AD-11) Support the simultaneous playback of both the described and non-described audio tracks so that one may be directed at separate outputs (e.g., a speaker and headphones). (AD-10) Allow the user to select from among different languages of descriptions, if available, even if they are different from the language of the main soundtrack. (AD-9) Allow the author to use a codec which is optimised for voice only, rather than requiring the same codec as the original soundtrack. (AD-8) Allow the author to provide fade and pan controls to",
    "textAfterTable": "2. Texted Audio Description Refer to 2.2 Texted Audio Description. Audio descriptions that are given as text rather than recorded voice create specific requirements. Texted audio descriptions are delivered to the client as text and rendered locally by e.g. a screen-reader or through a braille device. This can have advantages for users who are frequent screen-reader users and are thus given detailed control of the preferred voice and speaking rate, and many more options to control the speech synthesis. Texted audio descriptions are provided as text files with a start time for a description cue. Since the duration that a screenreader takes to read out a description cue cannot be determined during authoring of the cues, it is difficult to make sure they don't run over into the main audio or into other description cues. This is likely to be caused by at least three reasons: A typical author of textual audio descriptions does not have a screen reader. This means s/he cannot check if the description fist within the time frame. Even if s/he has a screen reader, a different screen reader may take longer to read out the same sentence; Some screen reader users (e.g. elderly and people with learning disabilities) may slow down the speech rate; or A visually-complicated scene (e.g. figures on a blackboard in an online physics class) may not be sufficiently described within any time",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}