{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque",
            "Credit card"
        ],
        [
            "Preferred/Accepted",
            "PayPal preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Silverline 125mm 5 Bench Grinder Wire Wheel grinding rust cleaning polishing | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/Silverline-125mm-5-Bench-Grinder-Wire-Wheel-grinding-rust-cleaning-polishing-/360840369157",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428314455,
    "recordOffset": 428257541,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93260=©2011 Midlands Tool Supplies Ltd. All rights reserved. Copying or other use of images, text or descriptions in any of our listings is strictly forbidden unless prior written permission has been given by us. We report image and description theft immediately to Ebay without notice.}",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). receiving cleared payment - opens in a new window or tab. Will usually dispatch within 1 working day of Domestic dispatch time This item doesn't post to United States Please enter up to 7 characters for the postcode Please enter a valid postcode. Postcode: Select a valid country. There are 23 items available. Please enter a number less than or equal to 23.",
    "textAfterTable": "Seller's payment instructions MAKE CHEQUES TO \"MIDLANDS TOOL SUPPLIES LTD\" Goods ship upon receipt of funds to our account. We allow 6 working days from receipt for cheques to clear. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}