{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus security is tight here, they really do make sure everyone feels safe.",
            "If we have any GREEK life, you certainly don't hear about it.",
            "They don't have as many clubs as i would like, and the clubs are pretty lousy about communicating with the student body.",
            "Anyone and everyone",
            "They host a zombie run every year, SO MUCH FUN!",
            "Super cheap, and super convenient, I don't see how it could get better.",
            "The Brevard zoo is a ten minute drive from the Melbourne campus and they have a ton to do, even for adults! Also all of the campuses are just a few minutes drive away from some of the best beaches in Florida!",
            "Althought I've never eaten at the cafe' all of my friends say the food is great! There are a ton of other food places around though to satisfy even the pickiest of eaters.",
            "No dorms unfortunately, the only exception is student athletes who live in nearby apartments.",
            "Most students have no problems in the classes, but if you do experience difficultly there are free tutoring programs offered at all of the campuses.",
            "Make friends with your admissions and guidance counselors, they will be your saviors during your college experience.",
            "Brevard Community College upholds and inspiring student atmosphere, with a staff that is willing to coach students through any problems. The campuses are not as high tech as major universities in the area; however, they are making new additions and updating all of their resources. Brevard is an excellent place for someone looking to start their higher education and is a great stepping stone for future transfer students."
        ]
    ],
    "pageTitle": "Eastern Florida State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Brevard-Community-College/reviews?_escaped_fragment_=/show/22701",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899522727,
    "recordOffset": 899432862,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{220818=Do your research! Don't just jump into something thinking it will be fun. I did that right out of high school, I graduated in 2006. Now I'm still going to college. Be sure to take your time, there's no rush!, 573545=© 2015, Cappex.com, LLC, 473147=Eastern Florida State is a very safe campus. I have been attending since 2004 and have never come across any issues. The security team really keeps up with what needs to be done., 392949=Brevard Community College is a great school. The science department taught by Dr. James Yount is especially great. I attend the Titusville campus and will be attending the Cocoa campus in the fall of 2013. I am consistently surprised at the quality that this school provides. I am grateful to call it MY school.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 147 linda from Palm Bay, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Login to rate or flag the reviews Emily from Rockledge, FL 12/18/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 4 of 147 Categories Comments Great for these types of students Financially strapped students- at $80 a credit for Florida residents, almost anyone can afford tuition. Students without direction- for those that have no intended major yet but know they want to go to college, BCC allows for an environment to try new things and (hopefully) find your career path. Less-than-stellar high school students- if your high school transcript isn't what you'd like it to be or you got denied acceptance at your school of choice, BCC is a great place to go to bulk up your resume. Upon graduation from BCC, you are GUARANTEED a spot at a Florida public four-year college, and your application at all schools no longer has to go through the 'first time in college' office, and the office for current students can be more forgiving in their acceptances. Tips for prospective students Don't buy your books at",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}