{
    "relation": [
        [
            "Date",
            "12 Jul 2002",
            "22 Feb 2007",
            "2 May 2011",
            "23 Sep 2011",
            "15 Nov 2011"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20110923"
        ]
    ],
    "pageTitle": "Patent US6623557 - Colorant for ink-jet printing ink, ink-jet printing ink, aqueous pigment ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6623557",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473582631,
    "recordOffset": 473534758,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{107793=(6) The amount of the gluing agent coating layer formed on the surface of the core Particles, the amount of the organic pigments adhered to the colorant for ink-let printing ink and the organic and inorganic composite particles, and the amount of the surfactant and/or polymeric dispersing agent coated on the surface of the colorant for ink-let printing ink, were respectively determined by measuring the carbon contents using “Horiba Metal, Carbon and Sulfur Analyzer EMIA-2200 Model” (manufactured by Horiba Seisakusho Co., Ltd.)., 34531=Further, in Japanese Patent Application Laid-Open (KOKAI) Nos. 11-323174(1999) and 2001-11339, there are described iron-based black composite particles comprising black iron oxide particles or black iron oxide hydroxide particles; a coating layer formed on the surface of the black iron oxide particles or black iron oxide hydroxide particles, which comprises organosilane compounds obtainable from alkoxysilanes, or polysiloxanes; and a carbon black coat formed on the surface of the coating layer. However, the technical spheres described in these prior arts are to fix carbon black onto the iron-based black particles, and are quite different from those techniques for obtaining a colorant having a high chroma. In addition, since the iron-based particles have a specific gravity as high as 5 to 5.5, it may be difficult to obtain an ink-jet printing ink having a sufficient dispersion stability when the iron-based particles are used as a colorant therefor., 107056=(4) The specific gravity of each of the core particles, organic pigments, colorant for ink-let printing ink, and organic and inorganic composite particles was measured using a “Multi-Volume Densitometer 1305-Model” (manufactured by Micro-Meritix Co., Ltd.)., 31412=Conventionally, there are known ink-jet printing inks using pigments (Japanese Patent Application Laid-Open (KOKAI) Nos. 9-227812(1997), 11-131001(1999) and 2000-53901); colorants prepared by coupling pigments with resins particles using a coupling agent (Japanese Patent Nos. 2903631 and 3097208); and colorants prepared by bonding dyes onto the surface of silica particles through a coupling agent (Japanese Patent No. 3105511)., 32169=That is, in Japanese Patent Application Laid-Open (KOKAI) Nos. 9-227812(1997) and 2000-53901, there is described an aqueous ink-jet recording liquid containing pigments and colloidal silica for the purpose of obtaining high-quality printed images. However, the organic pigments exhibit a poor dispersibility in an ink-jet printing ink composition, so that the resultant ink-jet printing ink fails to exhibit a good dispersion stability and a sufficient light resistance of printed images thereof. In addition, since a large amount of the colloidal silica not contributing to coloring is contained in the ink composition, it is difficult to sufficiently increase the pigment concentration thereof, thereby failing to obtain high-density printed images.}",
    "textBeforeTable": "Referenced by Example 30 3 19.1 Comparative Example 29 2 7.0 Comparative Example 28 2 1.7 Comparative Example 27 2 6.4 Comparative Example 26 2 6.4 Comparative Example 25 2 6.6 Comparative Example 24 2 6.7 Comparative 5 0.8 Example 52 5 1.9 Example 51 5 1.4 Example 50 5 1.8 Example 49 5 1.3 Example 48 5 1.0 Example",
    "textAfterTable": "17 Jun 2008 Ppg Industries Ohio, Inc. Color pigment nanotechnology US8349211 * 23 May 2008 8 Jan 2013 Lexmark International, Inc. Fluorescent additives for ink US20020069790 * 29 Aug 2001 13 Jun 2002 Kazuyuki Hayashi Composite particles, process for producing the same, and pigment, paint and resin composition using the same US20040235985 * 25 Mar 2004 25 Nov 2004 Toda Kogyo Corporation Transparent coloring composition and color filter * Cited by examiner Classifications U.S. Classification 106/499, 106/471, 106/447, 106/31.6, 106/465, 106/487, 106/491, 428/403 International Classification C09D11/00, C09D11/322, C09D11/328, B41M5/00, B41J2/01, C09C1/30, C09C1/40, C09B67/08, C09C1/36, C09C1/02, C09C3/12, C09B67/02, C09C3/00 Cooperative Classification C01P2004/61,",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}