{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "the experience was so great i probably would have paid university prices",
            "Gym, sports, school work depending on the degree",
            "Ive never eaten here",
            "there are no dorms.",
            "Go for Mechanical Engineering! you will have very close relationships with your teachers and they will change your view of school for the good.",
            "This is the happiest I have been attending school in my entire life. I dont believe I will ever find the experience Ive had at any other college. The teachers in my department are the best and will do anything for you to help out."
        ]
    ],
    "pageTitle": "Pitt Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pitt-Community-College/reviews?_escaped_fragment_=/show/36950",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896767203,
    "recordOffset": 896736447,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101718=© 2015, Cappex.com, LLC, 35140=I found that as a first time student for the Spring Semester of 2012, attending class is whether it is in person or on-line, the student gets out of it what he or she puts into it. If an individual is truly interested in learning, Pitt Community College is willing to assist with his or her education., 4414=Pitt Community College is a student friendly school, where the student is first in mind, its the home of the mighty bulldogs, founded in 1961 , their goals are : student &community access, student access, and program excellence., 538=we have a secured campus safety here 8am to 8:30 pm ad we have a no - smoking policy on campus}",
    "textBeforeTable": "04/16/2013 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 26 Rakim from Greenville, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Dorm Life here at Pitt we dont have dorm room.. Life as a bulldog can be hectic especially we you are taking 5 classes during one semester while working full time! Academic Rigor to transfer you must recieve C's or higher to transfer to a university , we have some of the best instructors and staff, who are willing to help their students to the best of their ability Tips for prospective students Plan Ahead , dont procrastinate about any matter whether its your classes, homework, financial aid, etc. keep your focus and pace yourself, just because you dont get it the first time, try ....try again with Gods help you will make it . keep in contact with your advisor, and instructors , make sure you are up to par with your GPA and credits for graduation.! In three sentences Pitt Community College is a student friendly school, where the student is first in mind, its the home of the mighty bulldogs, founded in 1961 , their goals are : student &community access, student access, and program excellence. Login to rate or flag the reviews Destiny from Greenville,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}