{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there are emergency poles all over in case an emergency emerges",
            "It is not as expensive as an university, but they do not give any less effort. The teachers are very dedicated to giving the students the best education as possible.",
            "there are many clubs and activities that students can participate in on campus.",
            "I am unsure of the food here. I have never eaten here, but I have heard that it is not to bad.",
            "I do not dorm here, so I could not give you an accurate rating on this topic.",
            "It's all about how much time you're willing to put in and how much you expect to get out of it.",
            "I suggest looking at RateMyProfessor.com while searching for a teacher. The website will help students to see how that teacher teaches. Some students prefer certain techniques so that website is a good source. It is also important to stay on top of the homework and class work. In college you do not always get homework, but that does not mean that you should go home and do nothing. It is important to read the book and sometimes teach yourself and ask the professor to cover things that you do not understand.",
            "Joliet Junior College professors are very technology literate. The teachers are dedicated to the students knowledge. Students are encouraged to be the best in their area of study."
        ]
    ],
    "pageTitle": "Joliet Junior College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Joliet-Junior-College/reviews?_escaped_fragment_=/show/47071",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912260659,
    "recordOffset": 912204553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{125123=I have always felt safe on campus, even when I would leave my night classes at about 9 or 9:30. I always saw security guards and campus police in squad cars patrolling., 285941=© 2015, Cappex.com, LLC, 100786=Have never seen/heard about any fights. (From the 2011-2012 Student Handbook): Main Campus-2010: 7 Aggravated Assault/Battery; 80 Theft; 1 Motor Vehicle Theft; 3 Theft from Motor Vehicle; 3 Drug Abuse/Violations; 4 Arrest: Drug Law Violations ZERO: murders, sex offenses, arson, robbery, burglary, liquor law violations, hate crimes, weapons violations, arrests: illegal weapons, arrests: liquor law violations. JJC is a really friendly environment and everybody is very welcoming., 84849=If you live in district, full time can be anywhere from $1500-$2300, much better then $10000-$20000 at a university., 212023=It is an awesome school for money because the classes are relatively low price so to get your general requirements done it is wonderful. It is better than going to a big school and paying thousands of dollars for what JJC offers at maybe two thousand, and that is a high price at our school. Average is about $1500 dollars a semester., 96675=The food is good, but it can be a little expensive. They offer many choices of food. You can consider sub sandwiches, the grill station, healthy foods, grab-n-go items, salad bar and vending. You can also choose smoothies, hot chocolate, coffee and many other drinks. The cafeteria is clean and new. It's a great spot to hang out with friends and to have lunch. You can also dine outside in our picnic area. The cafeteria stay open from 7 am - 7 pm Monday - Thursday. On Fridays it stays open from 7am - 2:30 pm., 95993=There are many fun and exciting activities to get involved in. A wide range of activities to attend are talent shows, dances, theatre productions, sporting events, daytime activities on the bridge and many more. The last week in April for Spring Fling week is not to miss. There many activities going on during that week such as free food, free earth day t-shirt giveaways and fun activities.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 67 Mary from Joliet, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students JJC offers something for almost everyone. It is particularly great for students who want to save a bit of money before heading off to four-year colleges. It is also great for adults who want to return back to school- there is a wide range of age groups at JJC, so adult learners would not feel out of place. JJC is also good for those that quit, or did not do well the last time they were in school. JJC's open admission policy makes this school a good choice for those looking to give school a second chance and turn their education around. Tips for prospective students I mentioned earlier that I did not learn much from some of my classes. I noticed that the classes from which I did not learn much were usually general education courses, that all students needed to take in order to fulfill their degree requirements. If you want to learn a lot from your general education courses, I would recommend taking the more unique ones that most students do not take. It seems like the more popular classes are made easier, so that more students can pass them. I would also recommend getting involved in things right away. I met a lot of my friends through theater at JJC. No matter what you join, you are likely to make friends, and it will make your",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}