{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I hang with my teammates when we have free time, but playing sports you normally don't have a lot of free time because you have practice. When your done with practice you be tired and have homework to do. So you mainly would just want to rest on your free day.",
            "Food is good my favorite day is fried chicken wednesdays. The cafe is stepping up more and more each year. Make sure you get your meal cards.",
            "dorms are fine, but I don't like staying in the dorms I prefer off campus. If you stay in the dorms it is best to room with somebody you know if you want the best enjoyment of the dorm. Also if you don't have a friend make sure you room with somebody who has a good personality.",
            "Shaw is good on academics and also have many degrees you can attempt to get. Shaw also have many places where you can go and get help from tutor's. Teacher's will also stay after and work with students if they need help.",
            "Make sure you stay focused and don't get caught up in partying all the time. Also if you need help don't be afraid to talk to your teachers, because you will fall behind if you don't stay on top of your studies.",
            "Shaw University is a wonderful HBCU and is very cultural. There is so much you can learn while attending Shaw University. Shaw also have a lot of stars that attended Shaw like Bill Cosby."
        ]
    ],
    "pageTitle": "Shaw University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Shaw-University/reviews?_escaped_fragment_=/show/62666",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897712079,
    "recordOffset": 897681249,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73435=There are three library facilities on the main campus at Shaw University. The James E. Cheek Learning Resources Center is the main campus library at Shaw University. It supports all educational programs for students enrolled at the university.The Curriculum Materials Center Library, built in 1997 and located on the 2nd floor of the Talbert O. Shaw Living Learning Center houses a collection of educational resources that provide curriculum and instructional experiences for elementary (K-12) education students and majors.The Wiggins Library (Divinity School) is housed on the first floor of Leonard Hall (the former Medical School Building) that was renovated in the 1990s. It measures 1,305 square feet and maintains a library collection of reference resources, an African-American reference collection, journals, magazines, newspapers, journals on microfiche and Master of Divinity theses. Students use reference materials for research conducted inside the library, 100452=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "06/12/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 14 out of 16 people found this review useful. 1 of 29 Erick from Charlotte, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp",
    "textAfterTable": "Did enjoy being here its honestly what you make it. me personally, didn't care much for my surroundings. Did learn a lot classes are a nice size and working without the professors are helpful. they have a tutoring center in case you need extra attention. Login to rate or flag the reviews E'Neysia from Charlotte, NC 08/19/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 29 Categories Comments Campus Safety There is always campus police walking around to keep everyone around in check. Bang for the buck This college may be a little bit costly but it is worth it. What to do for fun There is so much to do around the campus such as going walking around downtown Raleigh or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}