{
    "relation": [
        [
            "Payment method",
            "",
            "Cash on pickup",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Michael Jackson Ultimate Solo CD Collection DVD Rare | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/MICHAEL-JACKSON-ULTIMATE-SOLO-CD-COLLECTION-DVD-RARE-/260472169395",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 424980659,
    "recordOffset": 424929204,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{66373=PRODUCT INFORMATION FORMAT: FULL LENGTH COMPACT DISC CONDITION: BRAND NEW FACTORY SEALED JEWEL CASE: STANDARD CD CASE + COLLECTORS EDITION PACKAGE ORIGINAL RELEASE YEAR:  1979-2004 RECORD LABEL:  SONY MUSIC + MOTOWN RECORDS GENRE:  POP / R&B NO. OF DISCS:  13 CDs + DVD Up for sale is this collection of assorted Michael Jackson solo CDs. Featuring 13 CDs & 1 DVD in total, this awesome collection is essential listening for anyone who loves music. Each & every CD in this collection is 100% brand new and factory sealed.  Here is your chance to own a large bulk of the music MJ recorded from 1979-2004. Included in this pack is the very rare & hard-to-find MICHAEL JACKSON: THE ULTIMATE COLLECTION (4CD+DVD SET).  This set features tons of previously unreleased tracks, rarities & demos aswell as a 60 page booklet featuring rare & historic photos, memorabilia from MJ's personal archives, an extensive essay, timeline & discography. Don't miss out on this collection, on sale now for a strictly limited time. MICHAEL JACKSON IS, AND WILL ALWAYS BE.... THE KING OF POP ROCK & SOUL!!!! TRACKLIST MICHAEL JACKSON - THE MILLENIUM COLLECTION 01 Got to Be There 02 I Wanna Be Where You Are 03 Rockin' Robin 04 People Make the World Go Round 05 With a Child's Heart 06 Happy [from Lady Sings the Blues] 07 Ben [From \"Ben\"] 08 We're Almost There 09 Just a Little Bit of You 10 One Day in Your Life 11 Music and Me MICHAEL JACKSON - OFF THE WALL (SPECIAL EDITION) 01 Don't Stop 'Til You Get Enough 02 Rock With You 03 Workin' Day And Night 04 Get On The Floor 05 Off The Wall 06 Girlfriend 07 She's Out Of My Life 08 I Can't Help It 09 It's The Falling In Love 10 Burn This Disco Out 11 Quincy Jones Interview Part 1 12 Don't Stop 'Til You Get Enough (Intro) 13 Don't Stop 'Til You Get Enough (Original Demo Recording From 1978) 14 Quincy Jones Interview Part 2 15 Workin' Day And Night (Intro) 16 Workin' Day And Night (Original Demo Recording From 1978) 17 Quincy Jones Interview Part 3 18 Rod Tempterton Interview 19 Quincy Jones Interview Part 4 MICHAEL JACKSON - THRILLER (SPECIAL EDITION) 01 Wanna Be Startin' Somethin' 02 Baby Be Mine 03 The Girl Is Mine 04 Thriller 05 Beat It 06 Billie Jean 07 Human Nature 08 P.Y.T. (Pretty Young Thing) 09 The Lady In My Life 10 Quincy Jones Interview Part 1 11 Someone In The Dark 12 Quincy Jones Interview Part 2 13 Billie Jean (Home Demo From 1981) 14 Quincy Jones Interview Part 3 15 Rod Temperton Interview Part 1 16 Quincy Jones Interview Part 4 17 Voice Over Session From \"Thriller\" 18 Rod Temperton Interview Part 2 19 Quincy Jones Interview Part 5 20 Carousel 21 Quincy Jones Interview Part 6 MICHAEL JACKSON - BAD (SPECIAL EDITION) 01 Bad 02 The Way You Make Me Feel 03 Speed Demon 04 Liberian Girl 05 Just Good Friends (featuring Stevie Wonder) 06 Another Part Of Me 07 Man In The Mirror 08 I Just Can't Stop Loving You (featuring Siedah Garrett) 09 Dirty Diana 10 Smooth Criminal 11 Leave Me Alone 12 Quincy Jones Interview Part 1 13 Streetwalker 14 Quincy Jones Interview Part 2 (featuring Siedah Garrett) 15 Todo Mi Amor Eres Tu (I Just Can't Stop Loving You) (Spanish Version) 16 Quincy Jones Interview Part 3 17 Intro To \"Fly Away\" 18 Fly Away MICHAEL JACKSON - DANGEROUS (SPECIAL EDITION) 01 Jam featuring Heavy D) 02 Why You Wanna Trip On Me 03 In The Closet 04 She Drives Me Wild 05 Remember The Time 06 Can't Let Her Get Away 07 Heal The World 08 Black Or White 09 Who Is It 10 Give In To Me 11 Will You Be There 12 Keep The Faith 13 Gone Too Soon 14 Dangerous MICHAEL JACKSON - BLOOD ON THE DANCEFLOOR: HISTORY IN THE MIX 01 Blood on the Dance Floor 02 Morphine 03 Superfly Sister 04 Ghosts 05 Is It Scary 06 Scream Louder [Flyte Tyme Remix] 07 Money [Fire Island Radio Edit] 08 2 Bad [Refugee Camp Mix] 09 Stranger in Moscow [Tee's In-House Club Mix] 10 This Time Around [D.M. Radio Mix] 11 Earth Song [Hani's Club Experience] 12 You Are Not Alone [Classic Club Mix] 13 History [Tony Moran's History Lesson] MICHAEL JACKSON - INVINCIBLE 01 Unbreakable (featuring The Notorious BIG) 02 Heartbreaker 03 Invincible 04 Break Of Dawn 05 Heaven Can Wait 06 You Rock My World 07 Butterflies 08 Speechless 09 2000 Watts 10 You Are My Life 11 Privacy 12 Don't Walk Away 13 Cry 14 The Lost Children 15 Whatever Happens 16 Threatened MICHAEL JACKSON - GOLD (2 CD SET) Disc 1 01 Got to Be There 02 Maria (You Were the Only One) 03 Rockin' Robin 04 Ain't No Sunshine 05 I Wanna Be Where You Are 06 Girl Don't Take Your Love from Me 07 Ben 08 People Make the World Go Round 09 Shoo-Be-Doo-Be-Doo-Da-Day 10 We've Got a Good Thing Going 11 When I Come of Age 12 I Want You Back [Single Version] 13 Who's Lovin' You [Single Version] 14 Darling Dear [Single Version] 15 Never Can Say Goodbye [Single Version] 16 Maybe Tomorrow [Single Version] Disc 2 01 With a Child's Heart 02 Happy (Love Theme from Lady Sings the Blues) 03 Morning Glow 04 Music and Me 05 We're Almost There 06 Just a Little Bit of You 07 Dear Michael 08 I'll Come Home to You 09 If 'N I Was God 10 Who's Looking for a Lover 11 One Day in Your Life 12 You're My Best Friend, My Love 13 It's Too Late to Change the Time 14 Call on Me 15 Melodie 16 Farewell My Summer Love MICHAEL JACKSON - THE ULTIMATE COLLECTION (4 CD + DVD SET) Disc: 1 01. I Want You Back 02. ABC 03. I'll Be There 04. Got To Be There 05. I Wanna Be Where You Are 06. Ben 07. Dancing Machine- Single Version 08. Enjoy Yourself- The Jacksons 09. Ease On Down The Road 10. You Can't Win 11. Shake Your Body (Down To The Ground)- Single Edit 12. Shake Your Body (Down To The Ground)- Early Demo 13. Don't Stop 'Til You Get Enough 14. Rock With You 15. Off The Wall 16. She's Out Of My Life 17. Sunset Driver- Demo 18. Lovely One- The Jacksons 19. This Place Hotel- The Jacksons Disc: 2 01. Wanna Be Startin' Somethin' 02. The Girl Is Mine- Michael Jackson (With Paul Mccartney) 03. Thriller 04. Beat It 05. Billie Jean 06. P.Y.T. (Pretty Young Thing)- Demo Version 07. Someone In The Dark 08. State Of Shock- The Jacksons 09. Scared Of The Moon 10. We Are The World 11. We Are Here To Change The World Disc: 3 01. Bad 02. The Way You Make Me Feel 03. Man In The Mirror 04. I Just Can't Stop Loving You- Michael Jackson,Siedah Garrett 05. Dirty Diana 06. Smooth Criminal 07. Cheater 08. Dangerous- Early Version 09. Monkey Business 10. Jam 11. Remember The Time 12. Black Or White 13. Who Is It 14. Someone Put Your Hand Out Disc: 4 01. You Are Not Alone 02. Stranger In Moscow 03. Childhood (Theme From \"Free Willy 2\") 04. On The Line 05. Blood On The Dance Floor 06. Fall Again 07. In The Back 08. Unbreakable 09. You Rock My World with intro 10. Butterflies 11. Beautiful Girl 12. The Way You Love Me 13. We've Had Enough Disc: 5 LIVE IN BUCHAREST DVD 01. Jam 02. Wanna Be Startin' Somethin' 03. Human Nature 04. Smooth Criminal 05. I Just Can't Stop Loving You 06. She's Out Of My Life 07. I Want You Back 08. I'll Be There 09. Thriller 10. Billie Jean 11. Working Day And Night 12. Beat It 13. Will You Be There 14. Black Or White 15. Heal The World 16. Man In The Mirror  }",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at We are 100% committed to ensuring our customers are fully satisfied with their purchase. If you receive a product that is faulty, we will gladly replace the faulty item with a new copy once the faulty item has been returned to us for inspection. We will under no circumstance accept returns for items which are not found to be faulty.  Return policy details The buyer is responsible for return postage costs. Exchange 14 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions PAYMENT IS REQUIRED WITHIN 7 DAYS OF PURCHASE. ACCEPTED PAYMENT METHODS FOR AUSTRALIAN BUYERS INCLUDE: PAYPAL, MONEY ORDER OR BANK CHEQUE. NON-AUSTRALIAN BUYERS MAY PAY VIA PAYPAL ONLY. WE GLADLY COMBINE SHIPPING FOR MULTIPLE PURCHASES. PLEASE CONTACT US ONCE YOU HAVE COMPLETED SHOPPING AND WE WILL SEND A COMBINED INVOICE. PLEASE CONTACT US IF YOU HAVE ANY QUESTIONS ABOUT ANY OF OUR LISTINGS. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}