{
    "relation": [
        [
            "",
            "[1]",
            "[2]",
            "[3]",
            "[4]"
        ],
        [
            "Before 1990",
            "Electronic structure of light impurities in alpha-Fe and V Gong XG,Zeng Z,Zheng QQ JOURNAL OF PHYSICS-CONDENSED MATTER DOI: 1 (41):7577-7582 OCT 16 1989",
            "The electronic structure of the surface of the superconductor YBa2Cu3O7 Gong XG,Zheng QQ JOURNAL OF PHYSICS-CONDENSED MATTER DOI: 1 (3):593-598 JAN 23 1989",
            "A theoretical study of electronic structure for twin stacking faults in silicon Gong XG,Zheng QQ,Han RS SOLID STATE COMMUNICATIONS DOI: 62:65 1987",
            "Self-consistent cluster calculation of electronic structure and energy for hydrogen and carbon impurities in bcc iron Gong XG,Zeng Z,Zheng QQ STATISTICAL PHYSICS AND CONDENSED MATTER THEORY Xie XD DOI: (ed):73 World Scientific 1986"
        ],
        [
            "download",
            "PDF",
            "PDF",
            "PDF",
            "PDF"
        ]
    ],
    "pageTitle": "CONPUTATIONAL CONDENCED MATTER GROUP",
    "title": "",
    "url": "http://www.physics.fudan.edu.cn/xggong/publications.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 650901103,
    "recordOffset": 650881011,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "A more detailed list of our publications can be obtained here []﻿ PUBLICATIONS --> Submenu Submenu Submenu Menu Pellentesque habitant morbi tristique senectus et netus et malesuada. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae, ultricies ege. Aenean ultricies mi vitae est. Mauris placerat eleifend leo. Dummy text Pellentesque habitant morbi tristique senectus et netus et malesuada. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae, ultricies ege. Aenean ultricies mi vitae est. Mauris placerat eleifend leo. Dummy text Pellentesque habitant morbi tristique senectus et netus et malesuada. Pellentesque habitant morbi tristique senectus et netus et malesuada fames ac turpis egestas. Vestibulum tortor quam, feugiat vitae, ultricies ege. Aenean ultricies mi vitae est. Mauris placerat eleifend leo. Dummy text Pellentesque habitant",
    "textAfterTable": "Prediction of Silicon-Based Layered Structures for Optoelectronic Application Luo, Wei; Ma, Yanming; Gong, Xingao,Hongjun Xiang* JOURNAL OF THE AMERICAN CHEMICAL SOCIETY DOI: 10.1021/ja507147p PDF [2] Predicting New TiO2 Phases with Low Band Gaps by a Multiobjective Global Optimization Approach Chen, Hou-Zun; Zhang, Yue-Yu; Gong, Xingao; Xiang, Hongjun JOURNAL OF PHYSICAL CHEMISTRY C DOI: 10.1021/jp411437f PDF [3] Influence of Defects and Synthesis Conditions on the Photovoltaic Performance of Perovskite Semiconductor CsSnl(3) Xu, Peng; Chen, Shiyou; Xiang, Hong-Jun; Gong, Xin-Gao Gong; Wei Su-Huai CHEMISTRY OF MATERIALS DOI: 10.1021/cm503122j PDF [4] Design of I-2-II-IV-VI4 Semiconductors through Element Substitution: The Thermodynamic Stability Limit and Chemical Trend Wang, Congcong; Chen, Shiyou; Yang, Ji-Hui; Lang Li, Xiang Hong-Jun ,Gong Xin-Gao ;Walsh Aron; Wei Su-Huai CHEMISTRY OF MATERIALS DOI: 10.1021/cm500598x PDF [5] WO3 Nanoflakes for Enhanced Photoelectrochemical Conversion Li, WJ; Da, PM; Zhang, YY; Lin; X, Gong, XG; Zheng, GF ACS NANO DOI: 10.1021/nn5053684 PDF [6] Intrinsic insulating ferromagnetism in manganese oxide thin films Y. S. Hou, H. J. Xiang,* and X. G. Gong+ Phys. Rev. B DOI: 10.1103/PhysRevB.89.064415 PDF [7] Inverse design of materials by multi-objective differential evolution Yue-Yu Zhang, Weiguo Gao, Shiyou Chen, Hongjun Xiang, Xin-Gao Gong* Computational Materials Science DOI: 10.1016/j.commatsci.2014.10.054 PDF [8] Valley and band structure engineering of folded MoS2bilayers Tao",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}