{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Alot going on all the time. Last week there was a band playing during lunch on a Wednesday!",
            "The online classes and instructors are great for me being a stay at home mom",
            "Watch out for the geese.",
            "Low tuition",
            "I don't have time for fun right now",
            "Needs more selection",
            "Great student Atmosphere",
            "Get ready to study!",
            "Computer Labs allow you to print with no charge",
            "Rock Valley is a great school. Could use variety in food availability on campus. Clean Campus."
        ]
    ],
    "pageTitle": "Rock Valley College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Rock-Valley-College/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 900591475,
    "recordOffset": 900554430,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{166078=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/14/2009 Reviewer is A current student here. 2 out of 3 people found this review useful. 1 of 38 Deborah from Loves Park, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Bang for the buck As a community college, Rock Valley College definitely tops the list when it comes to a need for great learning at the right cost. Tuition is based on the credit hours for the course, and it is relatively cheap compared to other schools. You also gain access to the college's resources, including an extensive writing center to help achieve your paper based goals, and a tutoring center free to students where you can be tutored by students who have completed the class with a B or higher, or by instructors. Did enjoy being here Rock Valley College may not offer much in the way of activities, due to it's size, however, the campus itself is very nice, class sizes are generally below 30, and you meet a great deal of people from the community. I personally worked at the tutoring center on campus, and met a great deal of people through it, all of whom I have become great friends with. Did learn a lot Rock Valley College Provided an excellent learning and preparatory experience, by providing challenging courses with expectations of a four year school. I would definitely recommend this college for learning. Login to rate",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}