{
    "relation": [
        [
            "Patent application number",
            "20120241310",
            "20130228451"
        ],
        [
            "Description",
            "DEVICE AND METHOD FOR COATING A SUBSTRATE - An apparatus for coating a substrate has a vacuum chamber designed to receive the substrate and at least one sputtering target to be ablated during operation of the apparatus by particle bombardment. At least one window is arranged in the wall of the vacuum chamber. A device for determining the wear of the sputtering target, by optically measuring the distance between at least one predefinable point outside the vacuum chamber and at least one predefinable point on the surface of the sputtering target, and including an evaluation device correcting for any parallax offset and/or a geometric distortion.",
            "COATING SUBSTRATES WITH AN ALLOY BY MEANS OF CATHODE SPUTTERING - The invention relates to a target for coating a substrate with an alloy by means of cathode sputtering, said alloy having at least one first material and one second material as alloy components. The surface of the target has at least one first section made of the first material and one second section made of the second material. The two sections adjoin each other and form a common boundary line. The invention further relates to a device and a method for coating a substrate with an alloy by means of cathode sputtering using the target according to the invention."
        ],
        [
            "Published",
            "09-27-2012",
            "09-05-2013"
        ]
    ],
    "pageTitle": "Maass, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/maass-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435342455,
    "recordOffset": 435323959,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Wolfram Maass, Linsengericht DE 12-27-2012 METHOD AND DEVICE FOR RAPIDLY HEATING AND COOLING A SUBSTRATE AND IMMEDIATELY SUBSEQUENTLY COATING THE SAME UNDER VACUUM - The invention relates to a method for heating/cooling and coating a substrate in a vacuum chamber, comprising the following steps: (1) arranging the lower face of the substrate on a substrate holder, (2) lifting the substrate by a predefined distance relative to the substrate holder, and (3) heating the lifted substrate via its upper face by means of a heating device such as a radiant heating device, (4) coating the hot substrate, for example by moving it in or through a coating zone, (5) cooling the substrate by lowering it onto the chuck and (6) optionally further coating the cold substrate. The method according to the invention further enables process sequences to be executed, wherein various defined temperatures can be set on the substrate during each step, and optionally one or more coating processes can be executed immediately subsequently at said substrate temperature. Also included is the case, for example, that a substrate can be held at a higher temperature for a certain time immediately after a coating process (tempering). 20120328797 Published Description Patent application number Wolfram Maass, Linsengericht-Grossenhausen DE 05-07-2009 Material for use in contact with drinking water as well as having microbe-resistant properties - The invention relates to a material for use in contact with drinking water as well",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}