{
    "relation": [
        [
            "Round",
            "First Round",
            "Second Round",
            "Third Round"
        ],
        [
            "Opponent",
            "",
            "Sabine Lisicki",
            "Karolina Pliskova"
        ],
        [
            "W / L",
            "Bye",
            "Win",
            "Loss"
        ],
        [
            "Result",
            "",
            "6-0, 6-3",
            "2-6, 6-4, 4-6"
        ]
    ],
    "pageTitle": "Sports and Scores header",
    "title": "",
    "url": "http://weei.stats.com/tennis/players.asp?tour=WTA&id=248457",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 259230319,
    "recordOffset": 259187558,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{129713=Dale, Michael and Jerry Thornton talk about all things Patriots, including the challenges on the field and the drama off the field as 2015 training camp opens today in Foxborough., 50243=Sat, 08/15/2015 11:30AM-1:30PM, 51363=Listen to WEEI plus keep your eye on social media to find out ways to win Boston College Football tickets.  Season Tickets are now available for the 2015 season. BC has a..., 50500=Tue, 08/18/2015 5PM-7PM, 184614=Copyright © 2015 Entercom Boston, LLC All Rights Reserved.}",
    "textBeforeTable": "Birthplace: Belgrade, Yugoslavia Weight: 152 Handedness: Right Handed Born: 11/6/1987 Height: 6-0 Country: Serbia 23-12 3835 6 Record Points Rank Ana Ivanovic Select Other Player Abanda, Francoise Abaza, Jan Abduraimova, Nigina Adamczak, Monique Ahn, Kristie Aksu, Ayla Alawi, Jaklin Allertova, Denisa Allgurin, Ellen Al Nabhani, Fatma Alvarez Teran, Maria Fernanda Alves, Carolina M. Alves, Maria Fernanda Amanmuradova, Akgul Aoyama, Shuko Araujo, Sofia Arcangioli, Manon Arefyeva, Tetyana Arn, Greta Arruabarrena, Lara Arvidsson, Sofia Atik, Rita Auroux, Mailen Azarenka, Victoria Babos, Timea Bacsinszky, Timea Badosa Gibert, Paula Bains, Naiktha Baltacha, Elena Bara, Irina Maria Baranska, Agata Barbieri, Gioia Barrois, Kristina Barthel, Mona Bartoli, Marion Barty, Ashleigh Barzo, Lilla Beck, Annika Begu, Irina-Camelia Bellis, Catherine Beltrame, Severine Bencic, Belinda Bengson, Stephanie Benhadi, Ghita Bertens, Kiki Betancourt, Carolina",
    "textAfterTable": "Second Round Bethanie Mattek-Sands Loss 3-6, 4-6 AEGON Birmingham Classic Surface: Grass Date: Jun. 15 - Jun. 21 Seed: 2 Round Opponent W / L Result First Round   Bye   Second Round Michelle Larcher de Brito Loss 4-6, 6-3, 6-7 (6-8) Roland Garros Surface: Red Clay Date: May 24 - Jun. 7 Seed: 7 Round Opponent W / L Result First Round Yaroslava Shvedova Win 4-6, 6-2, 6-0 Second Round Misaki Doi Win 3-6, 6-3, 6-4 Third Round Donna Vekic Win 6-0, 6-3 Fourth Round Ekaterina",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}