{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Always present but not overbearing. They're always patrolling the campus.",
            "Fun, but not necessary for college life.",
            "There are lots of clubs and activities on campus, the only problem is to search for them. You should visit the Student Life office to find out more information as in registration dates, group meeting locations, etc.",
            "If you're outgoing, I suggest you join a sorority or a fraternity, and mingle with everyone there. If you're much more reserved but still want to meet people, I suggest joining clubs that share your interests or will help you further your career. They offer much of the perks of a Greek house without the burden of keeping a certain academic level.",
            "There's this huge cube on campus that everyone turns three times before midterms and finals for good luck. There is a story told by students that there were these three friends who did not study for finals and turned the cube three times for luck, so when they received their grade, they received an A. There's also the emblem of the university going inside the food court that no-one steps. There's a superstition that if you step on it, you will be retained at FIU for more years than what you should be in school for. If you step on it by accident, you have to go around the emblem backwards three or four times to reverse the curse. There's also a lake in the shape of a heart at FIU. Supposedly, couples who have their first kiss on a bridge crossing the lake will stay together forever.",
            "To get the best education possible, always check on the professors before taking the class. If possible, find prior students and ask them how the class was, was it difficult, was there any challenges or anything they didn't like about the class. Those answers will help you determine whether that professor is the right one for you. Same goes for college life, apply to all the fraternities",
            "There are lots of things to do for fun. At FIU there are many types of activities, such as involving yourself in doing community work at the local wildlife reserve we have on campus as well as sports at our gymnasium. Clubs and groups at FIU also offer activities to do, such as field trips, get togethers, BB's, parties, and more. Off campus, there are also clubs by the beaches as well as going to the beach and even going to the Florida Keys. Up north, we have Orlando which is home to Universal Studios as well as Disney and other parks.",
            "There is always something to eat at the food courtyard, whether it be brand names such as Subway or Einstein Bros., but FIU also has its own cafeteria where they have a multitude of selection in food. There's always something different and the prices always seem to be reasonable.",
            "Depending on what dorm you go to, there are many different types for all levels (freshmen, sophomores, juniors, seniors and graduate students). Some have kitchens while others do not and some are just too expensive; it'd be more cost effective to move into an apartment yourself and get roommates. I know some dorm buildings have parties and get togethers, which will impact you if you're either a party person or a reserved person. Be wary of dorms if you like peace and quiet!",
            "There are good and bad professors at FIU, like there are at many colleges. Always check their rating on ratemyprofessor.com and make sure you're picking a class with a professor who has a passion to teach; you'll be able to tell who loves what they do and who doesn't. It will affect your grade and learning experience at FIU.",
            "If you want the full college experience, I would recommend being a part of a sorority/fraternity as well as apply to any clubs and groups that may interest you. Also, living on campus would help in meeting new people, but it's not necessary since you can find many students are looking for roommates around campus. Be wary of parking due to a high volume of students attending, especially during the morning and afternoon hours. Register for classes as soon as you can since classes fill up quickly.",
            "Florida International University is a dynamic and fast-paced university in the heart of Miami. Different cultures mingling with each other help everyone learn and be tolerant of others. FIU students are full of spirit, friendly and prideful of their university, which can be seen at many types of events such as sports and special occasions."
        ]
    ],
    "pageTitle": "Florida International University (FIU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Florida-International-University/reviews?_escaped_fragment_=/show/86608",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893913219,
    "recordOffset": 893723101,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{829443=Maintain over a 3.0 GPA through the course of 6 years, high school and college. A proud member of National Society of High School Scholars. Top 30% of high school class at Hialeah-Miami Lakes Sr. High. Earned Dean's List honor during Spring 2011 at Miami-Dade College., 146057=Florida International University(FIU) has been a welcoming and encouraging environment ever since i started my studies in the summer of 2012. Being a recent high school graduate, I was afraid attending this college so fast, especially during summer would be too much to handle. I was wrong, the professors and student alumni really reach out and help the freshman, in order to fit in to a more comfortable and friendly zone., 99034=There are lots of places to go eat around campus but mainly in the Graham center. They are constantly adding more and more places to eat, currently they are building a Panda Express and a Taco Bell on campus. adding these franchises to the present collection of Burger King, Pollo Tropical, Cafe Bustelo, Alamazar, Chili's, Chic-fil-a, Moe's, Dunkin Donuts, And several other franchise restaurants. there is also a cafeteria place called Fresh Foods Company, this place is a buffet and at the beginning of the semester the food here is always good, and it has many options for food, salads, sandwiches, pizza, and a variety of other hot foods. There are currently 2 Starbucks on campus and a new one is being built within a new building scheduled to be completed later in 2014. There is a salad place called Salad Creations also, and they make really delicious salads but they're kinda pricey so normally I just stick to Chic-Fil-A., 823125=FIU is the 18th largest university in the United States. FIU also has the distinction of being the largest minority-majority university in America and will have an enrollment of more than 60,000 for the 2012-2013 school year. FIU is an awesome facility and an exciting place to learn., 315685=be ready to walk or maybe even run to your classes. some may be right next to each other, but others might be on the other end of the campus. i suggest 10/11 o'clock classes. that extra hour of sleep is like heaven., 814044=FIU offers many places to eat on campus between the two campuses. On the north campus, there are many places to dine at like Moe's Southwest Grill, Bistro Subs, Grille Works, etc. On the main campus, there are twenty plus places to dine at like Chick-fil-a, Burger King, Pollo Tropical, Moe's Southwest Grill, Chili's, etc. Also, there are places on campus where you can go to get a snack at 3 o'clock in the morning and they offer cookies that are super yummy and fresh out the oven at all times of the day., 222832=I found a lot of information about this school. I am planning on attending in 2013 to study Premed. I researched their different programs and this will be a perfect school to study Premed to become a Forensic Pathologist., 129092=Florida International University was not my first choice when I was applying for schools back in 2011, but FIU has changed my life. It is a commuter school, but through my involvements I have grown as a person and as a leader. I believe that FIU is an amazing school and it is highly underrated.}",
    "textBeforeTable": "07/22/2009 Reviewer is A current student here. 44 out of 48 people found this review useful. 1 person found this inaccurate. 1 of 433 Carl from Miramar, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Am learning a lot Florida International University is simply great. A lot of teachers care that you pass, just be sure you study a lot, do homework, and put in effort. In the end, you will truly be rewarded. Login to rate or flag the reviews Alfredo from Miami, FL 08/17/2009 Reviewer is A current student here. 28 out of 30 people found this review useful. 3 of 433 Categories Comments Great for these types of students FIU is a school for very independent capable personalities. what i mean is that teachers here do not care what you do they believe that the students should be responsible for what they do. it is a perfect school to teach you about your degree but also about what life is gonna bring. Tips for prospective students Look into what you are getting into before deciding to do anything. Taking classes with friends is wonderful because they push you to go to class and when its time",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}