{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Bang for the buck",
            "Dorm Life",
            "In three sentences"
        ],
        [
            "Comments",
            "none",
            "Even though they offer a wide range of grants, it can still be very costly",
            "Freshman dorms are mediocre.",
            "A good small school. The professors here are extremely nice, helpful and easy to connect with. Not much to do on campus though."
        ]
    ],
    "pageTitle": "University of Indianapolis (UIndy) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Indianapolis/reviews?_escaped_fragment_=/show/26408",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910739639,
    "recordOffset": 910679346,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11180=I learn something every time I go to class. Since I am going full time, I, like a lot of you I'm sure, feel like skipping your 8:00 am class to sleep a little extra. But everytime I think about skipping I make myself go. And everytime I do go I learn something that will benefit me on my final. The professors are great and will do anything they can to help you learn all you can., 213825=I enjoy the university it is a very pretty campus. There are many opportunities available at U of I. I am impressed with the nursing programs available and am looking forward to beginning my clinicals in August 2013., 49101=uindy is a great investment. they make it easy to get financial aid. the best thing is our student/faculty ratio. at 15:1 you have a teacher that can really care for you and actually be able to teach you. the quality of the education is one of the best in indiana., 280764=© 2015, Cappex.com, LLC, 52689=the university of indianapolis is one of the best universities to attend in indiana. uindy, as the students call it, is a close knit community with around 5000 undergraduate students. the faculty really cares about the students, and with a of 15:1 student/teacher ratio the faculty is always available for the students., 29932=There are not too many activities offered on campus because of the campus being called a suitcase campus where people leave on the weekends. Clubs offer numerous volunteer opportunities that are extremely fun, from walking dogs at the animal shelter to playing with kids. This 2012-2013 year there have been weekend activities sponsored by our Residence Hall Association that have kept me on campus many weekends., 32473=The food is extremely good most days, there are occasional times when the food is a big questionable. You can always count on the grilled chicken and salad bar! There are many vegetarian options. The only problem are the dining hours on weekends which are very limited, but there are fast food places nearby. The dining hours have been extended this 2012-2013 academic year and I have no complaints:)}",
    "textBeforeTable": "12/23/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 1 of 62 kimberly from Sellersburg, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot University of Indianapolis has challenged me academically but has given me the resources I need to succeed at a higher level. Login to rate or flag the reviews Amanda from Indianapolis, IN 12/27/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 62 Categories Comments Great for these types of students Nursing, Occupational Therapy, Physical Therapy, Education Someone looking for a truly remarkable experience during college but is also willing to do some work to earn one of the best educations around. Tips for prospective students Don't be afraid to get to know your professors. It's really alright if they know your name. Also get involved on campus; there are many different opportunities available for you to use. Bang for the buck It might cost a more expensive, but it is definitely worth it. The professors are always willing to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}