{
    "relation": [
        [
            "Release",
            "12.1(5)T",
            "12.2(28)SB",
            "12.2(33)SRE",
            "Cisco IOS XE Release 2.5"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.2(28)SB.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRE.",
            "This command was implemented on Cisco ASR 1000 series routers."
        ]
    ],
    "pageTitle": "Cisco IOS Broadband Access Aggregation and DSL Command Reference - management server password through sessions throttle [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/bbdsl/command/bba-cr-book/bba-m1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366885767,
    "recordOffset": 366798891,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{18695=NAS-Port-ID = eth 31/31/7:4096.2345 0/0/0/0/0/0, 19192=In this example, the subscriber interface type of the BRAS equipment is an Ethernet interface, the BRAS slot number is 31, the BRAS subslot number is 31, the BRAS port number is 7, the outer vlan-tag is 1234, and the inner vlan-tag is 2345. The string 0/0/0/0/0/0 is the default., 18599=In this example, the subscriber interface type of the BRAS equipment is an Ethernet interface, the BRAS slot number is 31, the BRAS subslot number is 31, the BRAS port number is 7, and the VLAN ID is 2345. The string 0/0/0/0/0/0 is the default., 19288=NAS-Port-ID = eth 31/31/7:1234.2345 0/0/0/0/0/0}",
    "TableContextTimeStampAfterTable": "{314004=The following example shows how to configure 90 PPPoE sessions as the per-physical threshold value on the Cisco ASR 1000 Series Router:, 315368=Configures the global threshold value of the PPPoE session on the Cisco ASR1000 Series Router., 268952=The 0x0104 AC-Cookie tag is used by the AC to help protect denial-of-service attacks. The AC may include this cookie tag in a PPoE Active Discovery Offer (PADO) packet. If a host receives this tag, it must be returned unmodified in the subsequent PPPoE Active Discovery Request (PADR.), 356885=Other vendors have their own unique vendor IDs, options, and associated VSAs. For more information about vendor IDs and VSAs, see RFC 2138, Remote Authentication Dial-In User Service (RADIUS)., 341895=(Optional) ATM network virtual channel identifier (VCI) for this PVC. The vci value ranges from 32 to 2047., 488266=This command was introduced on Cisco ASR 1000 Series Aggregation Service Routers., 310184=To configure the per-physical interface threshold value of the Cisco ASR 1000 Series Aggregation Services Routers, use the pppoe-sessions thresholdcommand in interface configuration mode. To disable the threshold value, use the no form of this command., 293621=The value for the remote-id-stringargumentcan contain spaces when enclosed with double quotation marks (for example, subscr mac 1111.2222.3333)., 254714=This command was implemented on Cisco ASR 1000 series routers., 498141=This command was introduced on the Cisco ASR 1000 Series Aggregation Service Routers., 249842=Maximum number of PPPoE sessions that will be permitted. The PPPoE sessions range depends on the device that you use. The range is 1 to 31992 on a Cisco 7200 series device., 298468=The following example shows how to match the subscr mac 1111.2222.3333 string by using a remote ID delay configured for PPPoE server:, 268707=The 0x0102 AC-Name tag indicates a unique string that identifies the AC unit from all other units. It can be a combination of trademark, model, serial ID information, and a UTF-8 rendition of the MAC address of the device., 66842=(Optional) The minimum echo size sent out on the (LCP) connection. The value can be any integer from 64 to 1500., 455041=Configures the per-physical interface threshold value of the ASR1000 router., 453636=The following example shows how to configure 1000 PPPoE sessions as the global threshold value on the CiscoASR 1000 router:, 449814=To configure the global threshold value of PPP over Ethernet (PPPoE) sessions on the Cisco ASR 1000 Series Aggregation Services Router, use the sessions threshold command in BBA group configuration mode. To disable the global threshold value, use the no form of this command., 516371=Ths command was introduced on the Cisco ASR 1000 Series Routers., 344648=This command was implemented on Cisco ASR 1000 series routers., 305122=This command was integrated. This command is supported on ASR 1000 series., 332969=The protocol pppovlan dot1q command enables an ATM PVC to support PPPoE over 802.1Q VLAN traffic that uses bridged RFC 1483 encapsulation.}",
    "textBeforeTable": "Syntax Description passwd [ encryption-type | cleartext-password ] password server management To specify the customer premise equipment (CPE) password that is used in the authentication phase, use the management server passwordcommand in TR-069 Agent configuration mode. management server password sessions throttle session retry limit sessions per-vlan throttle sessions pre-auth limit ignore sessions per-vlan limit sessions per-vc limit sessions per-mac limit sessions per-mac iwf limit sessions max limit service vpdn group sessions threshold service relay service profile service netflow timeout service name match service local service deny rx-speed request outstanding relay pppoe bba-group rbe nasip range pvc radius-server vsa send pvc-in-range provision code protocol pppovlan dot1q protocol pppoe (ATM VC) pppoe-sessions threshold pppoe service pppoe server remote-id delay pppoe server circuit-id delay pppoe pads disable-ac-info pppoe max-sessions pppoe limit per-vlan pppoe limit per-vc",
    "textAfterTable": "Command Modes TR-069 Agent configuration (config-cwmp) Command History Release Modification 12.4(20)T This command was introduced. Examples Thefollowing example shows how to specify the CPE password that is used in the authentication phase. In this example, the password is cisco and is not encrypted:  Device(config-cwmp)# management server password 0 cisco management server url To specify the HTTP or HTTPS URL to reach the auto-configuration server (ACS), use the management server urlcommand in TR-069 Agent configuration mode. management server url acs-url Syntax Description acs-url The HTTP/HTTPS URL to reach the ACS. This URL is used by the CPE to establish",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}