{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Non-traditional adult learners or full-time workers returning to college",
            "You can do whateve you like for fun.",
            "For classes that are on campus there are vendng machines",
            "There aren't any dorms on campus. This school is more for adult learnes.",
            "It is intensive",
            "Make a schedule to take your classes and try to keep on pace with your schedule for you coursework. Register early because classes fill up quicklly",
            "This school is excellent for non-tradtional students. It has a reat online learning program and is great for active-duty or adult learners.it is rigorous and intensive yet you can learn at your own pace."
        ]
    ],
    "pageTitle": "University of Maryland-University College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Maryland-University-College/reviews?_escaped_fragment_=/show/41460",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895331795,
    "recordOffset": 895247806,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{487409=This year each credit hour is $212, and I think it's absolutely worth every one! I've already completed 16 credit hours since September and aim to double that by the time the summer semester starts. The flexibility of the class scheduling and the approachability of the professors combined with fairly rigorous academic standards and expectations makes this well worth the price of tuition., 463292=Depending on what class you take, the workload can go from 2 questions to a 1500 word essay a week. It can get crazy in there., 526879=© 2015, Cappex.com, LLC, 26485=The classes are how you make them. The classes are eight weeks long so everything that is normally in a semester from August to December is crammed, so you really have to be focused. The professors are very eager to help. Because we are not in a classroom setting, our basic way of communication is thru weekly conferences. Make sure you reply to whatever topic it is for the week. When the professor responds, respond back to him or her. You will receive assistance from an adviser, that will tell you what path you should take with what ever major you have., 289524=i am currently enrolled in the online 1 year mba program which started fall 2011. i researched a lot of universities before deciding on this one and am pleased with my decision so far., 170489=There are three divisions: USA, Europe and Asia. Each once may have different classes and can only be taken one at a time but change of division easy. If taking online classes and military, nothing except the type of classes may change. May sure to apply for transfer credit evaluation within the first two semesters to compensate for any documents the school may need. In addition to the latter, UMUC is very flexible is awarding transfer credit!}",
    "textBeforeTable": "07/16/2011 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 136 Erica from Ellicott City, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Categories Comments Great for these types of students UNIVERSITY OF MARYLAND IS A GREAT SCHOOL FOR BUSINESS MAJORS. Tips for prospective students STAY ORGANIZED, AND ALWAYS COMMUNICATE WITH YOUR PROFESSOR AND ADVISOR ON ANY ISSUES / QUESIONS YOU MAY HAVE. Bang for the buck APPLY FOR SCHOLARSHIPS AND GRANTS TO HELP PAY FOR COLLEGE Am enjoying being here ALL MY CLASSES ARE ON-LINE, I LOVE THE FELXABILITY THIS GIVES YOU. I'M A SIGNAL MOTHER SO THIS ALLOWS ME TO WORK AND RAISE MY SON WHILE STILL WORKING TOWARDS MY DEGREE. Login to rate or flag the reviews Jason from Upper Marlboro, MD 12/02/2011 Reviewer is A past student here. 3 out of 3 people found this review useful. 3 of 136 Categories Comments Great for these types of students *Willing to learn to quite a bit *Scheduling that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}