{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "24-Hour security",
            "Beaches, Clubs, LA",
            "If you are looking for a quiet campus that offers a great view of the beach and city, MSMC is right for you.",
            "The Mount is a very private and beautiful college located in the hills of Los Angeles. The professors offer you one-on-one attention and really seek the well-being and success of their students."
        ]
    ],
    "pageTitle": "Mount St Mary's University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mount-St-Marys-College/reviews?_escaped_fragment_=/show/73306",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00307-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 922918271,
    "recordOffset": 922856529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{277613=This college closes really early. All cafetarias close at 8:00 pm which can be a bummer for some people. The food here is good if you like salty food. I think the grill and the sandwiches are the best--only because it is the least salty. The breakfast is quite amazing here (FYI)., 140642=Mount St. Mary's College is great for women who are interested in female empowerment. The students could be more active on campus, and that may change in Fall 2012 now that we have our new President. We are a liberal arts college, so expect to be well-rounded!, 310675=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/09/2009 Reviewer is A current student here. 19 out of 19 people found this review useful. 1 of 70 Lucia from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. Mount St Mary's University Reviews Mount St Mary's University › California › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Am learning a lot The teachers really get to know the students and there is a lot of individual, personalized attention given to the students. There is a lot of help provided to everyone either with the teacher, students or in the Learning Resource Center where there is tutoring most of the time for various subjects. Anyone can go anytime to study and it is great! Login to rate or flag the reviews Sayra from Whittier, CA 10/23/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 2 of 70 Categories Comments Great for these types of students Nursing Biology Majors Sociology Physical Therapy also serious students who will not fall behind. Tips for prospective students Make sure you give your all once you start. Nursing program is extremely competitive. It is a small school so make sure you are out of the high school mind set and a serious college student. Learn to say no before you start,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}