{
    "relation": [
        [
            "First Name",
            "Peter",
            "Terri"
        ],
        [
            "Last Name",
            "Muller",
            "Kokinda"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=1E440F97-90AB-4F5C-97DF-46868DED7AE3&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 233925784,
    "recordOffset": 233917582,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{32400=Regulatory: Implementation of ACA - Transitional Reinsurance fees assessed on corporations to balance the newly created Health Insurance Exchanges. Lobbied House and Senate members to repeal provision. Meaningful Use Stage 3 (HITECH Act) ONC/HHS - provided comments to Health IT Policy committees initial recommendations for implementation of Stage 3. Met with HHS/ONC Director Farzad Mostashari to discuss recommendations. CMS - telehealth reimbursement met with Chief of Staff for acting Director Marilyn Tavenner to discuss the need for reimbursement for telehealth for Medicare and Medicaid patients. Congressional: Met with House Commerce Committee members to recommend the deregulatory treatment by the FDA for communications equipment carrying medical mobile applications and Clinical Decision Support software. S. 596: Fostering Independence Through Technology Act of 2013 Senators Klobuchar and Thune to provide funding for telehealth pilots Discussed with House Veterans Affairs Committee the technology approaches to ensuring the smooth transfer for medical health records for military personnel transitioning from Military Health Service to Veterans Administration coverage., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 20973=H.R. 521, legislation which would create a newly authorized education technology program with one of the central aims to equip classrooms with hardware and software; Stepping Up to STEM Act H.R. 1089 and the Elementary Educator STEM Content Coach Act which seeks to establish an Office of STEM Education within the Department of Education to promote STEM efforts and ensure Americas competitiveness and future workforce., 15000=Immigration reform. Also lobbied on is S. 169, the Immigration Innovation Act, START UP 3.0 Act, and S. 310. Also lobbied on a bill that was introduced in the last Congress but has not yet been reintroduced in this Congress The IDEA Act, H.R. 2161. Uniting American Families Act S. 296 and H.R. 519 Lobbied House and Senate staff and members in support of legislation to permit gay and lesbian citizens to sponsor their foreign-born partners for immigration.}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  ZAKIYA Y JOHNSON  2026264392  zakiya.y.johnson@intel.com 5. Senate ID#  19536-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}