{
    "relation": [
        [
            "YEAR",
            "1985",
            "1985",
            "1985",
            "1985",
            "1985",
            "1985"
        ],
        [
            "PLAYER",
            "Parker",
            "Evans",
            "Winfield",
            "Cedeno",
            "Cowens",
            "Burroughs"
        ],
        [
            "G",
            "160",
            "159",
            "155",
            "111",
            "122",
            "86"
        ],
        [
            "HR",
            "34",
            "29",
            "26",
            "9",
            "14",
            "6"
        ],
        [
            "RBI",
            "125",
            "78",
            "114",
            "49",
            "69",
            "28"
        ],
        [
            "SB",
            "5",
            "7",
            "19",
            "14",
            "0",
            "0"
        ],
        [
            "AVG",
            ".312",
            ".263",
            ".275",
            ".291",
            ".265",
            ".257"
        ],
        [
            "Wins",
            "24",
            "22",
            "21",
            "10",
            "11",
            "5"
        ],
        [
            "Losses",
            "11",
            "13",
            "14",
            "6",
            "14",
            "5"
        ],
        [
            "Winning Percentage",
            ".697",
            ".632",
            ".606",
            ".615",
            ".458",
            ".530"
        ]
    ],
    "pageTitle": "An Open Letter to the Hall of Fame About Dwight Evans «",
    "title": "",
    "url": "http://grantland.com/features/an-open-letter-mlb-hall-fame-dwight-evans-rightful-place-cooperstown/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105152092,
    "recordOffset": 105117698,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{443=The first of these players to reach the majors and establish themselves were Cesar Cedeno and Jeff Burroughs, who came to the majors as teenagers in 1970. I’ve got a lot of charts here, but they’re very simple charts, and you’ll be able to follow along fine if you just read the numbers and keep your silly objections to yourself:, 39968=The year was 2008. Tom Cruise was a national punch line. Then came ‘Tropic Thunder’ and the cameo role of a lifetime., 1698=By luck, there were a bunch of very good right fielders born in 1951, the same year as Dwight Evans. Dave Winfield was born that year; he’s already in the Hall of Fame, and should be. Dave Parker was born that year; a lot of people think he’s a Hall of Fame candidate. Al Cowens was born that year; he wasn’t a Hall of Fame player, but he was a good player and he was second in the MVP voting in 1977; four MVP voters actually thought Cowens was better than Rod Carew, and Carew hit .388 and had 239 hits. Jeff Burroughs was born that year; he did win an MVP award, although he’s not a Hall of Fame player, either., 36626=In 2011, 12-year-old Garrett Phillips was killed in his upstate New York home. Years passed with no arrest, and now Nick Hillary, a former college soccer coach and an ex-boyfriend of Phillips’s mother, awaits trial on a murder charge. But Hillary and a vocal group of supporters say that he has been wrongfully accused., 1068=It is a very unusual thing to have five right fielders of that quality born in one year. To get another right fielder like that born before 1951 you have to go back to 1946 (Reggie Jackson), and to get another one like that after 1951 you have to go up to 1954 (Andre Dawson). But there are five good right fielders in this class, plus I’m going to include here Cesar Cedeno, who was a center fielder but who was also born in 1951 and who is also regarded as a Hall of Fame candidate, so that will give us six players as a working group to help us pin down Dwight Evans’ proper place in the baseball universe., 3678=I like to summarize all of the little tiny pieces of wins and pieces of losses into “shares” of a win and “shares” of a loss. A share of a win is a third of a win. The easiest way to explain Win Shares and Loss Shares is that they are like the pitcher’s won-lost record, only they apply to every player, not just pitchers. Dwight Evans in 1976, for example, had 16 Win Shares and 14 Loss Shares. That is very much like a pitcher with a won-lost record of 16-14., 34931=2015 NFL Preview}",
    "TableContextTimeStampAfterTable": "{43341=In 1981 four things happened in this group of players. First, in 1981 they turned 30 years old. Second, there was an ugly work stoppage, or, as I like to call it, a stork woppage, which scarred the season. Third, for whatever reason, Cowens, Burroughs, and Cedeno dropped a gear, and fell permanently behind the other three players (Parker, Evans, and Winfield)., 82682=Winfield missed the 1989 season with a back injury, leaving us only with a comparison between Evans and Parker. Although Parker drove in 97 runs that season, he was nowhere near the all-around player that Evans was:, 10562=Evans was just a solid player in those days, with won-lost contributions of 9-8, 16-11, and 15-8. This continued to be true for the next three years; Evans was a winning type of player, but he was well down the list from Parker, who won a couple of batting titles and an MVP award; Winfield, who began to emerge as a star; Cedeno, who slipped backward a little but continued to play well; and even Jeff Burroughs, who hit 41 homers for Atlanta in 1977 and hit over .300 in 1978:, 42184=If you are following these charts carefully enough, you may want to know why Evans ranks a little bit ahead of Parker in 1980, although Parker had more RBIs, a better batting average, and more stolen bases. The answer basically comes down to three words: “walks” and “outs made.” Evans drew 64 walks; Parker drew 25. If you think about it from the pitcher’s standpoint, 39 walks will lose several ballgames for you. That means that, from the batter’s standpoint, 39 walks will win several ballgames for you. That made Evans’ on-base percentage 30 points better than Parker’s, although Parker’s batting average was 30 points higher than Evans’, and on-base percentage is, of course, the more important stat., 67263=Despite a .238 batting average, Evans was still the second-best player in the group in 1983. His best years were still ahead of him. In 1984 Evans hit 32 homers, drove in 100+ runs, and led the American League in on-base percentage (.402) and runs scored (121):, 69964=As good as Evans was that year, Dave Winfield was even better, hitting .340. Still, Dwight Evans’ contribution to his team that year was equal to that of a pitcher winning 20 games — as it had been in 1981 and 1982, and as it would be for the rest of the decade., 84102=In 1990 Evans was less than an average player, less than a .500 player, for the first time in his career. These guys were 39 years old by then:, 2620=There is no doubt that Cedeno was a great young player in 1972 and 1973, and there would be no doubt that he would be a Hall of Famer if he had continued to play at that level. We credit Cedeno with a 23-7 won-lost record in 1972, about the same in 1973, and that certainly put him on a Hall of Fame glide path., 2947=In 1973 Dave Winfield and Dave Parker got to the major leagues, and Dwight Evans became a regular. Jeff Burroughs emerged as a star by hitting 30 home runs for Texas. In 1974 Al Cowens reached the majors, completing the group, and Jeff Burroughs won the American League MVP award, driving in 118 runs. By 1975 these were still young men — 24 years old — but all of them were established as major league regulars. In 1974 Burroughs and Cedeno were stars, the other guys were not, but in 1975 Dave Parker also stepped forward into the “star” class, and in 1975 he was at the head of the group, hitting .300 for Pittsburgh and driving in 100 runs:, 46788=Anyway, Dwight Evans was obviously the class of the group in 1981 — and in 1982:, 81071=In 1988 Winfield was the best of the group, but Evans had another big year, driving in 111 runs:, 79200=In 1986 Parker had some advantages, but Evans had offsetting advantages in things like walks and defense. In 1987 Evans had the advantages in the “big” stats — homers, RBI, and batting average — plus he had huge advantages in walks and fielding. Evans was obviously the best player in the group in 1987, and was fourth in the MVP voting that season:, 18333=Parker, Winfield, Cedeno, Cowens, and Burroughs all had 20-win seasons in those years; Evans did not. Parker, Winfield, Cedeno, and Cowens had 25-win seasons, although Cowens for whatever reason was not able to sustain that level of production. If we compare what the players had done through 1978, we can see that Parker had pulled ahead of Cedeno as the best player in the group at that time, Winfield was coming on strong, and the other players were not at the same level:, 70242=In 1985 Dave Parker had a big comeback year, leading the National League in RBI:, 56833=Winfield — and only Winfield — among these players had had four very good seasons, 1979-1982, and Winfield was challenging for the top spot among them. Cedeno had become a .500 player, Parker was less than a .500 player in ’81 and ’82, Burroughs had slipped to a part-time player, but Evans, with two MVP-candidate seasons, had stepped up to the .600+ class of players:, 87387=Parker and Evans retired after that season; Winfield carried on for several more seasons, and actually played extremely well in 1992. But, as we had compared the players through 1982, let us update those comparisons to the ends of their careers, in the order in which they retired. Jeff Burroughs:, 72762=Jeff Burroughs retired after the 1985 season, while Cowens and Cedeno drove in only six runs each in 1986 and both played their final major league games in early June. Evans, on the other hand, continued on strong:, 64471=After 1982 Cowens, Burroughs, and Cedeno were finished as championship-quality players, although Cedeno had a memorable hot streak with St. Louis at the end of 1985. Evans had a relatively poor season in 1983, dealing with some injuries — a poor season for him; he won a Gold Glove, hit 22 homers, and scored 74 runs despite missing more than a month:, 36894=Evans was a good player in the 1970s, but he was not yet a great player, which Parker and Winfield certainly were, particularly in 1979. In 1979 Parker and Winfield were two of the best players in baseball. In 1980 no one in the group had a great season, although Cedeno hit .300 with 48 stolen bases and Winfield was a 20-homer, 20-steals man, which meant something in those days, so those two were still very good players:, 75099=I wanted to spend a little more time with this season, the 1986 season, because I have Evans rated as the best player in the group although Winfield and Parker had higher batting averages and drove in more runs. Let’s look more carefully at those seasons. Evans and Winfield were almost dead even in doubles, triples, home runs, and batting average: 33-2-26 and .259 for Evans, 31-5-24 and .262 for Winfield. Can’t get much more even than that. Winfield grounded into almost twice as many double plays, 20 to 11. Evans drew 20 more walks and was hit by the pitch four more times, giving him a much higher on-base percentage (.376 to .349). Evans had one more extra base hit than Winfield, although Winfield had 36 more at-bats, giving Evans the higher slugging percentage, .476 to .462. With a higher on-base and higher slugging, obviously Evans had the higher OPS by a 42-point margin, .853 to .811., 77889=I don’t know how they calculate that, and, because defense is so hard to measure, I prefer to use more conservative measurements. The difference between an average team and a championship team, in a season, is only about 150 runs. Saying that the fielding difference between two right fielders is 25 runs is a little like saying that a 150-pound woman gave birth to a 25-pound baby. Ouch. I’m not saying it’s not possible; it’s just hard to believe. I have Evans as being only about eight runs better than Parker in the field, not because I don’t believe the 25-run difference is possible, but just because I just don’t think that we know for certain how large the difference was. Parker also had been an outstanding defensive outfielder earlier in his career. But I don’t think anyone questions that, by 1986, Dwight Evans was a lot better of an outfielder than was Parker., 131764=© 2015 ESPN Internet Ventures. All rights reserved. Interest-Based Ads, 85760=Evans went to Baltimore in 1991, where he posted a stunning .393 on-base percentage in his last major league season:, 77360=The biggest difference between Evans and Parker in 1986, though, was in defense. Parker played 117 more innings in the outfield, but made fewer plays than did Evans. Parker fielded .970; Evans fielded .983. Both players had strong arms, and each player threw out ten runners on the bases. Because of the difference between them in range, however, Baseball Reference estimates that Parker in 1986 was 17 runs worse in the outfield than an average right fielder, whereas Evans was eight runs better. That’s 25 runs., 46320=If you want to know why Parker ranks behind Cowens here, the basic answer is “defense.” Parker, putting on weight, had a horrific defensive season in 1981, with very little range and twice the normal number of errors in the outfield. Cowens hit even less than Parker did, but Cowens was a very good outfielder. Parker, the MVP of the 1979 All-Star game, actually recorded more outfield assists in the 1979 All-Star game (2) than in the 1981 season (1)., 78807=That was 1986. In 1987 Dave Parker had almost the same triple crown stats that Dwight Evans had in 1986. In 1986 Evans hit 26 homers, drove in 97 runs, and hit .259. In 1987 Parker hit 26 homers, drove in 97, and hit .253. In 1986 Parker had hit 31 homers, driven in 116 runs, and hit .273. In 1987 Evans’ numbers were like that but better — 34 homers, 123 RBI, a .305 average.}",
    "textBeforeTable": "The first of these players to reach the majors and establish themselves were Cesar Cedeno and Jeff Burroughs, who came to the majors as teenagers in 1970. I’ve got a lot of charts here, but they’re very simple charts, and you’ll be able to follow along fine if you just read the numbers and keep your silly objections to yourself: It is a very unusual thing to have five right fielders of that quality born in one year. To get another right fielder like that born before 1951 you have to go back to 1946 (Reggie Jackson), and to get another one like that after 1951 you have to go up to 1954 (Andre Dawson). But there are five good right fielders in this class, plus I’m going to include here Cesar Cedeno, who was a center fielder but who was also born in 1951 and who is also regarded as a Hall of Fame candidate, so that will give us six players as a working group to help us pin down Dwight Evans’ proper place in the baseball universe. By luck, there were a bunch of very good right fielders born in 1951, the same year as Dwight Evans. Dave Winfield was born that year; he’s already in the Hall of Fame, and should be. Dave Parker was born that year; a lot of people think he’s a Hall of Fame candidate. Al Cowens was born that year; he wasn’t a Hall",
    "textAfterTable": "1972 Burroughs 22 1 3 0 .185 0 4 .051 There is no doubt that Cedeno was a great young player in 1972 and 1973, and there would be no doubt that he would be a Hall of Famer if he had continued to play at that level. We credit Cedeno with a 23-7 won-lost record in 1972, about the same in 1973, and that certainly put him on a Hall of Fame glide path. In 1973 Dave Winfield and Dave Parker got to the major leagues, and Dwight Evans became a regular. Jeff Burroughs emerged as a star by hitting 30 home runs for Texas. In 1974 Al Cowens reached the majors, completing the group, and Jeff Burroughs won the American League MVP award, driving in 118 runs. By 1975 these were still young men — 24 years old — but all of them were established as major league regulars. In 1974 Burroughs and Cedeno were stars, the other guys were not, but in 1975 Dave Parker also stepped forward into the “star” class, and in 1975 he was at the head of the group, hitting .300 for Pittsburgh and driving in 100 runs: YEAR PLAYER G HR RBI SB AVG Wins Losses Winning Percentage 1973 Cedeno 139 25 70 56 .320 22 6 .790 1973 Burroughs 151 30 85 0 .279 18 11 .617",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}