{
    "relation": [
        [
            "Type:",
            "Small Business",
            "Interested in lead?",
            "No"
        ],
        [
            "Technical Areas:",
            "Provably Optimal Approaches to Cyber Agility and Cyber Detection",
            "Other Technical Areas:",
            "Software Development, Computer Science, Physics, Mathematics"
        ]
    ],
    "pageTitle": "Interested Vendors | U.S. Army Research Laboratory",
    "title": "",
    "url": "http://www.arl.army.mil/www/default.cfm?page=1659",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 305237822,
    "recordOffset": 305221859,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{52932=Last Update / Reviewed: March 1, 2013}",
    "textBeforeTable": "Agile Technology Concepts (www.agiletechnologyconcepts.com) Interested Vendors Company URL: Zip Code: --Select a State Alabama - AL Alaska - AK Arizona - AZ Arkansas - AR California - CA Colorado - CO Connecticut - CT Delaware - DE Florida - FL Georgia - GA Hawaii - HI Idaho - ID Illinois - IL Indiana - IN Iowa - IA Kansas - KS Kentucky - KY Louisiana - LA Maine - ME Maryland - MD Massachusetts - MA Michigan - MI Minnesota - MN Mississippi - MS Missouri - MO Montana - MT Nebraska - NE Nevada - NV New Hampshire - NH New Jersey - NJ New Mexico - NM New York - NY North Carolina - NC North Dakota - ND Ohio - OH Oklahoma - OK Oregon - OR Pennsylvania",
    "textAfterTable": "POC: Phone/Email: Address: Ish Morales 937-286-1188 atc@agiletechnologyconcepts.com 111 East Road Boonville, NY 13309 Alok Nigam (www.globalinfotek.com) Type: Technical Areas: WOSB Detection, Agility Interested in lead? Other Technical Areas: No --na-- POC: Phone/Email: Address: Global InfoTek, Inc. 703-652-1600 nigam@globalinfotek.com 1920 Association Drive Suite 200 Reston, VA 20191 Anjolen Inc (Http://www.anjolen.com) Type: Technical Areas: Small Business All Interested in lead? Other Technical Areas: Yes Classified research POC: Phone/Email: Address: Leonard J Popyack, Jr, PhD 315-525-2842 Len@anjolen.com 85 Taber Rd New Hartford, NY 13413 Barry McKinney, PhD (www.ainfosec.com) Type: Technical Areas: Small Business Agility, Risk, Detection, Psychosocial Effects Interested in lead? Other Technical Areas: Yes Research & Development, Penetration Testing, Vulnerability Assessment, Cyber Forensics, Trusted Computing, Virtualization POC: Phone/Email: Address: Barry McKinney, PhD 315-336-3306 x513 mckinneyb@ainfosec.com 153 Brooks Rd Rome, NY 13441 Corporate Risk Solutions (www.corprisk.net) Type: Technical Areas: Veteran Owned Small",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}