{
    "relation": [
        [
            "",
            "TDF-TDF",
            "ADV-TDF"
        ],
        [
            "Description",
            "TDF 300 mg plus placebo to match ADV (double-blind period), followed by TDF 300 mg (open-label period). Participants may have added FTC to their treatment regimen (as part of FTC 200 mg/TDF 300 mg FDC tablet) in the open-label period.",
            "ADV 10 mg plus placebo to match TDF (double-blind period), followed by TDF 300 mg (open-label period). Participants may have added FTC to their treatment regimen (as part of FTC 200 mg/TDF 300 mg FDC tablet) in the open-label period."
        ]
    ],
    "pageTitle": "A Study to Compare Tenofovir Disoproxil Fumarate Versus Adefovir Dipivoxil for the Treatment of HBeAg-Positive Chronic Hepatitis B - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00116805?sect=Xc015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00189-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869311451,
    "recordOffset": 869294782,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details There were 90 enrolling sites in 15 countries. The first participant was screened on 09 June 2005, and the last participant was randomized on 15 June 2006. The last participant observation for the primary endpoint analysis (Week 48) was 11 May 2007. The last participant observation for the Week 384 analysis was 22 October 2013. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: TDF Drug: ADV Drug: TDF placebo Drug: ADV placebo Drug: FTC/TDF Interventions: Chronic Hepatitis B Condition:",
    "textAfterTable": "Participant Flow for 8 periods Period 1:   Double-blind Period Through Week 48     TDF-TDF     ADV-TDF   STARTED     176     90   COMPLETED     165     85   NOT COMPLETED     11     5   Lost to Follow-up                 6                 2   Protocol Violation                 1                 1   Withdrew Consent                ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}