{
    "relation": [
        [
            "Tag",
            "%Cl(xpos,ypos,maxwidth,maxheight,[horizontal alignment],[vertical alignment])",
            "%Cd",
            "%C"
        ],
        [
            "Description",
            "Define the picture settings. More details. Horizontal alignment can be 'l', 'r', or 'c', for left, right and center. Vertical alignment can be 't', 'b', or 'c', for top, bottom and center.",
            "Display the album art bitmap. More details",
            "Use in a conditional to check if album art has been loaded"
        ]
    ],
    "pageTitle": "CustomWPS < Main < Wiki",
    "title": "",
    "url": "http://www.rockbox.org/wiki/CustomWPS?sortcol=0%3btable=9%3bup=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 687040111,
    "recordOffset": 687006880,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Viewport Draw Layer Draw the next param lines using a gradient. by default the gradient is over 1 line. %Vg(gradient,2) will use 2 lines to fully change from the start colour to the end colour gradient Draw the text coloured the value given in param. Functionally equivalent to using the %Vf() tag color draw the line inverted invert restore the default style clear Description Mode Mode is: set the viewport text style to 'mode' for the remainder of the viewport %Vs(mode[, param]) Description Tag Viewport Line Text Styles These need to be before any other tags after a %V() line or scrolling",
    "textAfterTable": "Draw a rectangle! (optionally with a gradient) Tag Description %dr(x,y,width,height[colour1[,colour2]]) Colour a rectangle at pixel (x,y), width/height can be - to fill the viewport. if both colours are left out the viewports foreground colour will be used if one colour is specified it will fill the rectangle that colour. if both colours are specified it will gradient fill the rectangle. Fonts Tag Description %Fl(fontid,filename,glyphs) fontid is the font identification number number that is used to reference the font in a viewport decleration. 0 and 1 are reserved so can't be used. filename is the font filename to load. glyphs is an optional specification of how many glyphs to reserve memory for. This should be large enough to prevent frequent glyph loading from disk. The default is 256 glyphs if not specified. fonts live in /.rockbox/fonts/ e.g. %Fl(2,12-Font.fnt,150) Status",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}