{
    "relation": [
        [
            "Date",
            "Mar 13, 1998",
            "Apr 9, 2001",
            "Dec 27, 2004",
            "Feb 9, 2009",
            "Jul 31, 2009",
            "Sep 22, 2009"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: EXXON CHEMICAL PATENTS, INC., TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ELLUL, MARIA D.;HAZELTON, DONALD R.;MEHTA, ASPY K.;AND OTHERS;REEL/FRAME:009043/0149;SIGNING DATES FROM 19980304 TO 19980306 Owner name: ADVANCED ELASTOMER SYSTEMS, L.P., OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:ELLUL, MARIA D.;HAZELTON, DONALD R.;MEHTA, ASPY K.;AND OTHERS;REEL/FRAME:009043/0149;SIGNING DATES FROM 19980304 TO 19980306",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20090731"
        ]
    ],
    "pageTitle": "Patent US6268438 - Thermoplastic elastomeric compositions - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6268438?dq=6,219,045",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484961995,
    "recordOffset": 484916833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{542272=SP-1045, (Schenectady International Inc.), 17740=This application is based on Provisional Application Ser. No. 60/033,463, filed Dec. 17, 1996., 18563=Historically, many of the elastomers of the type identified above, have been constructed of polymers made from a Ziegler-Natta catalyzed reaction. However, as described in U.S. Pat. No. 5,198,401, herein incorporated by reference, and International Application No. W097/11115, also herein incorporated by reference, the polymerization of olefins, diolefins and acetylenically unsaturated monomers to homopolymers and copolymers in the presence of an ionic metallocene catalyst is now producing unique materials. For example, the polypropylene polymers obtained via the metallocene catalysis process are generally at least substantially isotactic and often fully isotactic. As an additional example of a unique compound obtained via metallocene catalysis, low ethylene content EPR's are being produced. Specifically, the reactions are performed in the presence of a metallocene catalyst of the general formula}",
    "textBeforeTable": "Patent Citations Thus, it is apparent that there has been provided, in accordance with the invention, a thermoplastic elastomeric composition that fully satisfies the objects and advantages set forth above. While the invention has been described in conjunction while the invention has been described in conjunction with specific embodiments thereof, it is evident that many alternatives will be apparent to those skilled in the art in light of the foreign description. Accordingly, it is intended to embrace all such alternatives, modification and variations as fall within the spirit and broad scope of the appended claims. 4.93 588,145 119,103 119 84 3.15 0.7 51S07A 066-006 1.79 149,876  83,732 41.7 23.3 0.24 32 18897- 066-005 1.94 216,170 111,201 94.8 22 2.17 6.7 18897- 066-003",
    "textAfterTable": "Exxon Chemical Patents Inc. Supported polymerization catalyst US5198401 Jul 30, 1991 Mar 30, 1993 Exxon Chemical Patents Inc. Ionic metallocene catalyst compositions US5210139 * Feb 6, 1991 May 11, 1993 Exxon Chemical Patents Inc. Thermoplastic olefin alloys and method for producing the same US5278119 Apr 28, 1992 Jan 11, 1994 Exxon Chemical Patents Inc. Catalysts, method of preparing these catalysts, and polymerization processes wherein these catalysts are used US5290886 Apr 20, 1993 Mar 1, 1994 Advanced Elastomer Systems, L.P. Thermoplastic elastomers having improved low temperature properties US5304614 Oct 14, 1992 Apr 19, 1994 Hoechst Aktiengesellschaft Process for the preparation of an olefin polymer using metallocenes having specifically substituted indenyl ligands US5324800 Aug 30, 1991 Jun 28, 1994 Exxon Chemical Patents Inc. Process and catalyst for polyolefin density and molecular weight control US5347025 Sep 7, 1993 Sep 13, 1994 Tosoh Corporation Catalyst for polymerization of vinyl compound",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}