{
    "relation": [
        [
            "Parameter",
            "General types of ailments this species is used for treating",
            "Specific ailments for which the species is used",
            "Medicinal systems which use this plant",
            "Details of Medicinal use",
            "Parts of the plant used for treatment",
            "Names of some medicinal active compounds in this plant, if known.",
            "Details of the active chemical compounds found in this plant",
            "Is the molecular basis of the medicinal action known?",
            "Details of molecular basis of action",
            "Are the toxic effects of consumption of this plant known?",
            "Details of the toxic effects of the plant species",
            "Have there been validation/clinical studies related to this plant?",
            "Details of the clinical studies related to the plant species"
        ],
        [
            "Value(s)",
            "",
            "",
            "Ayurveda",
            "Cardamom is used as an adjuvant to carminative drugs. It is officially recognised in British and US pharmacopoeias and used as an aromatic stimulant, carminative and flavouring agent. It can be used to ease cigarette addiction. Eating a few seeds of cardamom can safely be recommended to initially minimise the number if cigarettes being smoked, and slowly the smoker may give up the chronic addiction to chain smoking",
            "Fruit, Seeds",
            "",
            "Most of the active compounds come from the volatile Cardamom oil, which varies from 6 to 10% of the mature seed weight.",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "References See complete references in the References section at the end",
            "",
            "",
            "Sasya Sampada",
            "Sasya Sampada",
            "Sasya Sampada",
            "",
            "Sasya Sampada",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Elettaria cardamomum - Biodiversity of India: A Wiki Resource for Indian Biodiversity",
    "title": "",
    "url": "http://www.biodiversityofindia.org/index.php?title=Elettaria_cardamomum",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 323615759,
    "recordOffset": 323593888,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{2543=It is said that cardamom grew in the gardens of King of Babylon in 720 BC. The ancient Egyptians chewed cardamom to whiten their teeth and simultaneously sweeten their breath. Indian Ayurvedic Medicine used the spice to ‘remove fat’ and as a cure for urinary and skin complaints. Recommended by Apicius, a famous Roman epicure, to counteract over indulgence., 64451=Sasya Sampada (Web): Sasya Sampada entry on Cardamom, Accessdate=2010-08-20, 64048=Flowers of India (Web): Flowers of India entry on Cardamom, Accessdate=2010-08-15, 63859=Wikipedia Cardamom (Web): Wikipedia Cardamom entry, Accessdate=2010-08-15, 64273=EoL (Web): Encyclopedia of Life entry, Accessdate=2010-08-15}",
    "textBeforeTable": "Images and Videos External Links Summary of NCBI molecular data Summary of PubMed articles Commercial importance and cultivation Cultural significance Medicinal Importance Maps Habitat and Geographical Spread Morphological features Binomial Classification Current Wikipedia entry Species identity and nomenclature [edit] Please note that the above slideshow is automatically created by searching Flickr and does not contain manually curated images. Hence, it is likely that some images may not be exactly of Elettaria cardamomum. Click on the tabs below to know more... Click here to see all Semantic Properties associated with this page Elettaria cardamomum is the spice Cardamom or \"Elaichi\" used for cooking in many parts of the world and in India. It is popularly used to spice up tea in India. Cardamom refers to several plants of the genera Elettaria and Amomum in the ginger family Zingiberaceae. Both genera are native to India, they are recognised by their small seed pod, triangular in cross-section and spindle-shaped, with a thin papery outer shell and small black seeds. Elettaria pods are light",
    "textAfterTable": "Angiosperm phylogeny. This image is copyrighted. Rights owned by Theodore C.H.Cole (Heidelberg) and Hartmut H. Hilger (Berlin) 2010. Please obtain copyright permissions before reuse. Click here for the PDF of the phylogeny Taxon Value Regnum (Kingdom) Plantae Division Magnoliophyta Class Liliopsida Order Zingiberales Family Zingiberaceae Genus Elettaria Source of data ' Other closely related species Species Division Common name Common Hindi name Aloe vera Aloe vera, Medicinal aloe, Burn plant Gheekumari घीकुमारी Acacia nilotica Arabic Gum, Black Piquant, Egyptian thorn, Prickly acacia बबूल Babool,कीकर Kikar Saraca indica Ashoka अशोक Ashok … further results",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}