{
    "relation": [
        [
            "Word or phrase (English)",
            "bracelet",
            "bracelet made from \"cloth\" (\"tela\") or \"fabric\" (\"tejido\")",
            "earrings",
            "necklace",
            "ring",
            "wristwatch"
        ],
        [
            "Word or phrase (Spanish)",
            "pulsera",
            "manilla",
            "aretes (Colombia); pendientes",
            "collar",
            "anillo",
            "reloj de pulsera"
        ],
        [
            "Type (English)",
            "jewelry",
            "jewelry",
            "jewelry",
            "jewelry",
            "jewelry",
            "jewelry"
        ],
        [
            "Type (Spanish)",
            "joyería",
            "joyería",
            "joyería",
            "joyería",
            "joyería",
            "joyería"
        ]
    ],
    "pageTitle": "Idioma Colombiano - Colombian Language - Amañado™ - Guía del Recorrido de Colombia",
    "title": "Jewelry vocabulary",
    "url": "http://www.amanado.com/idioma-colombiano/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 293014659,
    "recordOffset": 292959123,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{359587=Copyright © 2012, Amañado™. Todos los derechos reservados. All rights reserved.}",
    "textBeforeTable": "Enter word or phrase in the following field to filter the table information Following are some examples of common and helpful words and phrases about jewelry. Vocabulary (official and jargon) - jewelry bolsos bags bolso; cartera purse; handbag bolsos bags maletín briefcase, attaché case Type (Spanish)       Type (English) Word or phrase (Spanish) Word or phrase (English) Bags vocabulary Enter word or phrase in the following field to filter the table information Following are some examples of common and helpful words and phrases about bags. Vocabulary (official and jargon) - bags calzado footwear zapatos para deportes; zapatos de deporte training shoes; trainers; sneakers calzado footwear zapatos para deportes; zapatos de deporte training shoes; trainers; sneakers calzado footwear zapato de tenis tennis shoes calzado footwear tennis sports shoes; running shoes calzado footwear pantuflas; zapatillas slippers calzado footwear zapatos de talón abierto slingback shoes; slingbacks calzado footwear hormas (para conservar la forma de zapatos) shoetrees calzado footwear zapatos shoes calzado footwear sandalias sandals",
    "textAfterTable": "Vocabulary (official and jargon) - beauty Following are some examples of common and helpful words and phrases about beauty. Enter word or phrase in the following field to filter the table information Beauty vocabulary Word or phrase (English) Word or phrase (Spanish) Type (English) Type (Spanish)       comb peine personal hygiene higiene personal hair dryer secador personal hygiene higiene personal hairbrush cepillo para el cabello, cepillo para el pelo personal hygiene higiene personal nail clippers cortaúñas personal hygiene higiene personal to comb one's hair peinarse personal hygiene higiene personal hairtie chulo hair accessories accesorios de cabello thick hairpin ebilla hair accessories accesorios de cabello thin hairpin gancho hair accessories accesorios de cabello blush; referring to makeup rubor makeup maquillaje eyeliner delineador makeup maquillaje lipstick labial makeup maquillaje makeup maquillaje makeup maquillaje mascara; referring to makeup for eyelashes pestañina; tinte para las pestañas; máscara de pestañas makeup maquillaje Vocabulary (official and jargon) - Internet, computing and technology Following are some examples of common and helpful words and phrases about the Internet, computing and technology.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}