{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I don't too much know about greek life. but from watching them perform look interesting.",
            "Yes, it's great for anyone who's wlling to make a difference in life.",
            "Working with Chinese corner. It's tons of fun!",
            "There are plenty of things to do on the campus like going to the different events that are going on.",
            "Stay focus Do all homework and extra credit if giving pay attention in class be on time for class",
            "Jackson State is an excellent school. You taught a lot but and the teachers actually care. Being at Jackson State University you can never reach failing."
        ]
    ],
    "pageTitle": "Jackson State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Jackson-State-University/reviews?_escaped_fragment_=/show/15687",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903763767,
    "recordOffset": 903707541,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{111487=Food in the cafe won't be too different from your high school cafe. Although the days you won't want to miss are fried chicken Tuesdays, hotwing Thursdays, and spaghetti and fish Fridays! Also a burger king was recently put in place as the 2011-2012 academic year ended. In our union there is a chick fil-a, pizza hut, R.F.O.C. (great food, almost like soul food!). All these places I just named you are able to use your tiger bucks that come with your meal plan. Also there is a subway next to the union if you want to stay fit like the famous athletes!, 103491=The Plaza where everything happens. Listen to the bands march, Greek life, freshmen enjoy the plaza, 190475=Being that the University has placed strict rules regarding students safety (partially due to a large increase in the student population), majority of the rules are in place to protect us in general. To enter dorms, you have to swipe your ID card to unlock and gain access to your dormitory on campus. All visitors that you have are required to sign in with the front desk and are required to leave no later than 1:30 am. Else, you will risk losing visitation for the whole year. Although it is not what I was expecting, just like everyone else, I had to become used to the rules and it really isn't that bad., 121392=What I do for fun is hangout on the plaza with my friends, go to on campus events, and attend the hotspots every August at 1:00 pm to celebrate the start of the new school year., 264152=© 2015, Cappex.com, LLC, 218386=It depends on the professor and the department. Some are more strict than others. Some teachers feel that the grammar and structure of an essay is the most important part; others feel that as long as you get the general idea, it's all good. So far my classes have been a mix of requirements.}",
    "textBeforeTable": "07/29/2009 Reviewer is A current student here. 22 out of 23 people found this review useful. 1 of 70 Maia from MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Categories Comments Great for these types of students Every type of student...Feel free...We are here for you... Tips for prospective students Go to Class Get to Know your instructors Use all the campus resources there are many available There is help out there just waiting for YOU Bang for the buck It is definitely a bang for the buck, Not everything is free if it is your dream you do not mind, only remember in the end it pays off,you know where the money is going too and you see it. They provide you the materials to let you know where the monies are going. Am enjoying being here If you are not a party person, the campus is full of activities, and free. We have a movie theater, a bowling alley, a rec room with pool tables, swimming pools, student lounge, plenty TV rooms, and especially around the holidays if you are not able to go home for the holidays JSU hello is A Home Far Away From Home Am learning a lot This school is excellent, not only",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}