{
    "relation": [
        [
            "Version",
            "7.x-1.x-dev",
            "6.x-1.x-dev"
        ],
        [
            "Download",
            "tar.gz (15.04 KB) | zip (16.72 KB)",
            "tar.gz (15.36 KB) | zip (17.14 KB)"
        ],
        [
            "Date",
            "2014-Jan-07",
            "2013-Sep-30"
        ],
        [
            "Links",
            "Notes",
            "Notes"
        ]
    ],
    "pageTitle": "Module project | Drupal.org",
    "title": "",
    "url": "https://www.drupal.org/project/project_module?f[2]=im_vid_3%3A67",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911299183,
    "recordOffset": 911271467,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 04 Aug 2015 10:59:45 GMT",
    "textBeforeTable": "Recommended releases Downloads List of selected CKEditor features CKEditor documentation CKEditor SDK – CKEditor features explained with live examples CKEditor demo page Useful links CKEditor is the far superior successor of FCKeditor. The editor has been rebranded and completely rewritten. It is now much faster (the code has been optimized), loads faster (the number of files has been reduced, so the browser will perform less HTTP requests) and developers friendly. What is CKEditor? This module will allow Drupal to replace textarea fields with the CKEditor - a visual HTML editor, usually called a WYSIWYG editor. This HTML text editor brings many of the powerful WYSIWYG editing functions of known desktop editors like Word to the web. It's very fast and doesn't require any kind of installation on the client computer. October 16, 2009 at 1:50am wwalc on Posted by CKEditor - WYSIWYG HTML editor Categories: Actively maintained, Under active development, File Management, Media ⋅ Read more about",
    "textAfterTable": "Development releases Version Download Date Links 7.x-1.x-dev tar.gz (197.9 KB) | zip (254.9 KB) 2015-Apr-01 Notes 6.x-1.x-dev tar.gz (282.92 KB) | zip (382.15 KB) 2014-Nov-07 Notes View all releases Read more about CKEditor - WYSIWYG HTML editor ⋅ Categories: Actively maintained, Under active development, Administration, Content, Filters/Editors, JavaScript Utilities, Media, Third-party Integration Wysiwyg Posted by sun on October 7, 2007 at 10:24am",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}