{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2006-01-01T00:00:00",
            "2011-03-01T00:00:00",
            "2011-11-19T00:00:00"
        ],
        [
            "Description",
            "GPS and XYZ-Point Data Processing There was no metadata record provided along with this data set, therefore the process description is unknown. However, to provide some idea of plausible processing, the information provided below, was gleaned from the metadata record for a data set from this same project, for data collected in March of 2006. Transfer raw ALTM 1225 flight data (laser ranges with associated scan angle information and IMU data), airborne GPS data collected at 1 Hz using Ashtech receiver, and ground-based GPS data collected at 1 Hz using Ashtech Z-12 receivers to processing computer. Generate decimated lidar point file from above three data sets using Optech's Realm 2.27 software. This is a 9-column ASCII data set with the following format: time tag; first pulse Easting, Northing, HAE; last pulse Easting, Northing, HAE; first pulse intensity; and last pulse intensity. View decimated lidar point file to check data coverage (i.e. sufficient overlap of flight lines and point spacing). Compute base station coordinates using National Geodetic Survey's PAGES-NT software. Compute aircraft trajectories from each base station GPS dataset using National Geodetic Survey's KINPOS software. Solutions for base stations coordinates and aircraft trajectories are in the International Terrestrial Reference Frame of 2000 (ITRF2000). A final aircraft trajectory was computed from a weighted average of the trajectories from the two base stations. Epoch-by-epoch weighting for the individual trajectories was inversely proportional to the baseline length (distance from base station) and solution RMS. Transformed trajectory solution from ITRF2000 to North American Datum of 1983 (NAD83) using the National Geodetic Survey's Horizontal Time Dependent Positioning software (http://www.ngs.noaa.gov/TOOLS/Htdp/Htdp.html). Input NAD83 trajectories and aircraft inertial measurement unit data into Applanix's POSProc version 2.1.4 to compute an optimal 50Hz inertial navigation solution (INS) and smoothed best estimate of trajectory (SBET). Substitute the INS and SBET into Realm 2.27. Generate a set of initial lidar instrument calibration parameters (pitch, roll, scale, and elevation bias) for each lidar flight, then incrementally improve parameters by iteratively comparing a subset of the lidar output to the GPS kinematic ground control. Once the instrument calibration parameters are sufficiently accurate, create the complete lidar point file (9-column ASCII file) for the entire survey area in UTM Zone 11 with elevations being heights above the GRS-80 reference ellipsoid (HAE). The output format from REALM 2.27 was a 9-column ASCII file containing: the second in the GPS week, easting, northing and HAE of the first lidar return, the easting, northing and HAE of the last lidar return, and the laser backscatter intensity of the first and last returns. Using the GEOID99 model, heights above the GRS80 ellipsoid were converted to orthometric heights with respect to the North American Vertical Datum of 1988 (NAVD88). Parse the 9-column lidar point file into 3.75-minute quarter-quadrangle components. Convert UTM Easting and Northing to geodetic latitude and longitude with respect to the GRS80 ellipsoid. The conversion was computed using the TMGEOD and TCONPC fortran subroutines written by T. Vincenty (NGS). Each record contains 9 columns of data: time tag (seconds in the GPS week), first return Latitude,first return Longitude, first return NAVD88, last return Latitude, last return Longitude, last return NAVD88, first return intensity, and last return intensity. In some cases either the first or last return values may be missing (5 columns). Latitude and longitude are in decimal degrees with nine significant digits to retain the 0.01m resolution of the UTM coordinates. West longitude is negative and north latitude is positive. The UTM quarter-quad files were re-organized into latitude delineated files. UTM quarter-quads files that were delineated by the same upper and lower latitude bounds were concatenated. The lat-long files were named by the month-year of the survey (e.g. mar06) and the lower latitude bounding the quarter-quad.",
            "The NOAA Coastal Services Center (CSC) received the lidar files in ASCII format. The files contained lidar intensity and elevation measurements. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. Data converted from UTM coordinates to geograhic coordinates. 2. Data converted from NAVD88 heights to ellipsoid heights using GEOID03. 3. Data converted from dual return xyz format to xyz text format with return numbers to las format. 4. The LAS data were sorted by latitude and the headers were updated.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/200610_SCRIPPS_m567.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 614494235,
    "recordOffset": 614482232,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:200610_SCRIPPS_m567Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 North American Datum 1983 2007-01-19 1 October 2006 Scripps Institute of Oceanography (SIO) Lidar of Southern California Coastline: Long Beach to US/Mexico Border 2011-01-01 3 none Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 Bureau of Economic Geology, University of Texas at Austin originator 1 Bureau of Economic Geology, University of Texas at Austin Coastal Studies Group Member processor",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}