{
    "relation": [
        [
            "First Name",
            "Scott",
            "Kathryn"
        ],
        [
            "Last Name",
            "Aaronson",
            "Steckelberg"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=C5F43761-9589-4AA4-AE9E-124526EA7B7C&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 226932535,
    "recordOffset": 226921472,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{56629=H.R. 5325, the Energy and Water Development and Related Agencies Appropriations Act, 2013, (appropriations issues generally); H.R. 5326, the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2013, (appropriations issues generally); H.R. 5854, Military, Veterans Appropriations Act, (appropriations issues generally); H.R. 5856, the Department of Defense Appropriations Act, 2013, (appropriations issues generally); H.R. 5972, the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2013, (appropriations issues generally); H.R. 6020, the Financial Services and General Government Appropriations Act, 2013, (appropriations issues generally); S. 2322, the Transportation, Housing and Urban Development, and Related Agencies Appropriations Act, 2013, (appropriations issues generally); S. 2323, the Commerce, Justice, Science, and Related Agencies Appropriations Act, 2013, (appropriations issues generally); S. 2465, the Energy and Water Development and Related Agencies Appropriations Act, 2013, (appropriations issues generally); S. 3215, Military, Veterans Appropriations Act, (appropriations issues generally); S. 3295, the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2013, (appropriations issues generally); S. 3301, the Financial Services and General Government Appropriations Act, 2013, (appropriations issues generally); FY 2013 Interior/Environment Appropriations; H. Con. Res 112, FY 2013 Budget Resolution; H.J. RES. 117 (PL 112-175), the Continuing Appropriations Resolution, 2013, (appropriations issues generally)., 33565=H.R. 7, The American Energy & Infrastructure Jobs Act, (alternative fuel vehicles); H.R.1380, New Alternative Transportation to Give Americans Solutions Act of 2011, (alternative fuel vehicles); H.R. 1402, to authorize the Architect of the Capitol to establish battery recharging stations for privately owned vehicles in parking areas under the jurisdiction of the House of Representatives at no net cost to the Federal Government; H.R. 1685, Electric Drive Vehicle Deployment Act of 2011; H.R. 3374, Hybrid Truck Incentives Improvement Act; H.R. 4348, Surface Transportation Bill Extension and Conference Report, (electric vehicles, buy America provisions); H.R. 5187, IMPACT Act, (electric vehicle credits); H.R. 6083, the Federal Agriculture Reform and Risk Management Act of 2012, (LIHEAP, transportation); S.49, \"Railroad Antitrust Enforcement Act\"; S.158, \"STB Reauthorization\"; S. 739, a bill to authorize the Architect of the Capitol to establish battery recharging stations for privately owned vehicles in parking areas under the jurisdiction of the Senate at no net cost to the Federal Government; S.948, the Promoting Electric Vehicles Act of 2011 (vehicle electrification); S.1813, MAP-21 (Moving Ahead for Progress in the 21st Century) (electric vehicles); S.1863, New Alternative Transportation to Give Americans Solutions Act of 2011, (alternative fuel vehicles); S.1921, Reducing Energy Use Through Retrofitting Older Vehicles Act; S.2204, Repeal Big Oil Tax Subsidies Act, (electric vehicles)., 64212=H.R. 1325, American Manufacturing Efficiency and Retraining Investment Collaboration Achievement Works Act or AMERICA Works Act, (workforce credentialing); H.R. 4297, Workforce Investment Improvement Act of 2012, (workforce training); S.1243, American Manufacturing Efficiency and Retraining Investment Collaboration Achievement Works Act or AMERICA Works Act, (workforce credentialing); S. 3457, the Veterans Job Corps Act of 2012, (workforce training, credentials)., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 22136=H.R. 301, New Manhattan Project for Energy Independence to support RD&D to advance clean energy technologies; H.R. 909, A Roadmap for Americas Energy Future to address domestic energy policy, including renewable energy; H.R. 2781, to establish a high efficiency gas turbine RD&D program; H.R. 2782, to establish a wind energy research and development program; H.R. 2994, the Marine and Hydrokinetic Renewable Energy Promotion Act of 2011; H.R. 3389, the Consortia-Led Energy Advancement Networks Act (clean energy); H.R. 3574, to revise the formula for allocating funding to States under the Low-Income Home Energy Assistance Act of 1981; H.R. 3626, LIHEAP Protection Act; H.R. 3807, Guaranteed Energy Assistance Act of 2011; H.R. 4017, Smart Energy Act, (efficiency); H.R. 4026, Energy Assistance for American Families Act; H.R. 4230, HOMES Act, (efficiency); H.R. 4273, the Resolving Environmental and Grid Reliability Conflicts Act of 2012; H.R. 4850, the Enabling Energy Saving Innovations Act, (energy efficiency); H.R. 5325, Energy and Water Development and Related Agencies Appropriations Act, Fiscal Year 2012, (energy efficiency, electric transportation); H.R. 5967, the American Renewable Energy and Efficiency Act to establish a federal RES/EERS program; H.R. 6533, to establish minimum levels of assistance for certain States under the Low-Income Home Energy Assistance Program, (LIHEAP); H.J. RES. 117, the Continuing Appropriations Resolution, 2013, (LIHEAP); S. 4, Make America the Worlds Leader in Clean Energy Act to promote clean energy; S. 398,Implementation of National Consensus Appliance Agreements Act of 2011 (efficiency); S. 559, Securing Americas Future with Energy and Sustainable Technologies Act including renewable electricity and energy efficiency resource standards; S. 741, to amend PURPA to establish a renewable energy standard; S. 1000, Energy Savings and Industrial Competitiveness Act of 2011, (efficiency); S. 1321, the Practical Energy Plan Act of 2011; S. 1491, PURPAs Legislative Upgrade to State Authority (PURPA PLUS) Act; S. 1510, Clean Energy Financing Act of 2011; S. 1586, to establish a Clean Energy Technology Manufacturing and Export Assistance Program; S. 1961, LIHEAP Protection Act; S. 2146, the Clean Energy Standard Act of 2012; S. 2216, Rural Energy Savings Program Act, (energy efficiency); S. 2465, Energy and Water Development and Related Agencies Appropriations Act, Fiscal Year 2012, (energy efficiency, electric transportation); S. 3240, Agriculture Reform, Food, and Jobs Act of 2012, (LIHEAP, rural transportation); S. 3295, the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, Fiscal Year 2013, (LIHEAP); S. 3352, Expanding Industrial Energy and Water Efficiency Incentives Act of 2012, (combined heat and power); S. 3371, the Renewable Energy Environmental Research Act; Subcommittee Draft, the Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, Fiscal Year 2013, (LIHEAP); Transmission siting, permitting, management issues generally and pricing incentives; Utility Energy Services Contracts Guidance to Federal Agencies., 38378=H.R. 76, \"Cybersecurity Education Enhancement Act\"; H.R. 174, \"Homeland Security Cyber and Physical Infrastructure Protection Act\"; H.R. 668, \"SHIELD Act\"; H.R. 1136, \"Executive Cyberspace Coordination Act\"; H.R. 3523, Cyber Intelligence Sharing and Protection Act; S. 21, \"Cyber Security and American Cyber Competitiveness Act\"; S. 413, \"Cybersecurity and Internet Freedom Act\"; S. 847, Safe Chemicals Act of 2011, (reauthorization and reform of the Toxic Substances Control Act [TSCA]); S. 1342, Grid Cyber Security Act; S. 2105, the Cybersecurity Act of 2012; Chemical Security (CFATS) Regulatory Program (oversight issues)., 49501=H.R. 8, the Job Protection and Recession Prevention Act of 2012, (extension of current rate on dividends); H.R. 500, to amend the Internal Revenue Code of 1986 to increase the manufacturer limitation on the number of new qualified plug-in electric drive motor vehicles eligible for credit; H.R. 3768, to amend the Internal Revenue Code of 1986 to repeal the credit for plug-in electric drive vehicles; H.R. 4078, the Red Tape Reduction and Small Business Jobs Creation Act, (compilation of House Regulatory Reform bills, work on sue and settle); H.R. 4348, Surface Transportation Bill Extension and Conference Report, (pension smoothing provisions); H.R. 3091, the Tax Hike Prevention & Business Certainty Act, (dividend and capital gains tax rates); S. 232, a bill to amend the Internal Revenue Code of 1986 to increase the manufacturer limitation on the number of new qualified plug-in electric drive motor vehicles eligible for credit; S. 1285, Hybrid and Electric Trucks and Infrastructure Act (electric vehicles); S. 1647, a bill to repeal the sunset on the reduction of capital gains rates for individuals and on the taxation of dividends of individuals at capital gains rates; S. 1813, MAP-21 (Moving Ahead for Progress in the 21st Century) (tax issues); S. 2161, to amend the Internal Revenue Code of 1986 to extend and modify the credit for certain plug-in vehicles; S. 3412, the Middle Class Tax Cut Act, (extension of current rate on dividends); S. 3521, the Family and Business Tax Cut Certainty Act of 2012, (electric vehicle infrastructure credit, taxation, Internal Revenue Code)., 12248=H.R. 97, the Free Industry Act to provide that greenhouse gases are not subject to the Clean Air Act; H.R. 153, the Ensuring Affordable Energy Act to prohibit funding for EPA to implement greenhouse gas regulations; H.R. 199, the Protect Americas Energy and Manufacturing Jobs Act of 2011 to suspend for 2 years EPA regulation of greenhouse gas emissions from stationary sources under the Clean Air Act; H.R. 680, to prohibit U.S. contributions to the Intergovernmental Panel on Climate Change; H.R. 750, the Defending Americas Affordable Energy and Jobs Act to preempt actions related to greenhouse gases through regulations or common law; H.R. 872, Reducing Regulatory Burdens Act of 2011, (Clarify that a Clean Water Act permit is not required for products licensed under FIFRA); H.R. 910, the Energy Tax Prevention Act of 2011 to prohibit EPA greenhouse gas regulations under the Clean Air Act; H.R. 1023, the No More Excuses Energy Act of 2011, including provisions to prevent climate change or global warming regulations under the Clean Air Act; H.R. 1287, 3-D, Domestic Jobs, Domestic Energy, and Deficit Reduction Act of 2011, including provisions to prevent climate change or global warming regulations under the Clean Air Act; H.R. 1292, the Energy Production Freedom Act, to provide that greenhouse gases are not subject to the Clean Air Act; H.R. 1872, the Employment Protection Act to require EPA to consider employment and other economic impacts prior to regulations or other actions; H.R. 2250, the EPA Regulatory Relief Act of 2011 to provide additional time for EPA to issue industrial boiler MACT standards; H.R. 2401, the Transparency in Regulatory Analysis of Impacts on the Nation (TRAIN) Act of 2011, to require analyses of the cumulative and incremental impacts of certain rules and actions of the Environmental Protection Agency; H.R. 2891, Americas Energy Independence Act, to delay EPA Cross-State Air Pollution Rule; H.R. 3391, the Comprehensive National Mercury Monitoring Act; H.R. 3379, the Regional Haze Federalism Act, to provide States increased flexibility in implementing standards through State implementation plans; H.R. 3409, the Coal Miner Employment and Domestic Energy Infrastructure Act; H.R. 4255, the Accountability in Grants Act, to prohibit EPA grants under CAA sec. 103 outside the U.S.; H.R. 4304, the Defense of Environment and Property Act of 2012, defines the scope of federal jurisdiction under the Clean Water Act; H.R. 4387, to delay CSAPR compliance deadline for non-CAIR states; H.R. 4965, Preserve the Waters of the U.S. Act, (draft guidance); H.R. 6091, regional haze and other environmental provisions in FY 2013 Interior Appropriations legislation; H.R. 6172, to prohibit EPA from finalizing any GHG performance standards for EGUs until CCS is found to be technologically and economically feasible; H.Res. 672, resolution regarding federal climate policy; S. 15, to prohibit the regulation of carbon dioxide emissions in the U.S. until China, India, and Russia implement similar reductions; S. 77, the Pollution and Costs Reduction Act to amend the Clean Air Act to reduce pollution and lower costs for building owners; S. 228, the Defending Americas Affordable Energy and Jobs Act to preempt regulation of, action relating to, or consideration of greenhouse gases; S. 231, the EPA Stationary Source Regulations Suspension Act to suspend for 2 years EPA regulation of greenhouse gas emissions from stationary sources under the Clean Air Act; S. 482, the Energy Tax Prevention Act of 2011 to prohibit EPA greenhouse gas regulations under the Clean Air Act; S. 609, the Comprehensive Assessment of Regulations on the Economy (CARE) Act of 2011 to provide for the establishment of a committee to assess the effects of certain federal regulatory mandates related to energy and the environment; S. 706, the 3-D, Domestic Jobs, Domestic Energy, and Deficit Reduction Act of 2011, including provisions to prevent climate change or global warming regulations under the Clean Air Act; S. 1292, the Employment Protection Act to require EPA to consider employment and other economic impacts prior to regulations or other actions; S. 1392, the EPA Regulatory Relief Act of 2011 to delay Boiler MACT; S. 1393, the Maintaining Agency Direction on Financial Fraud Act to prohibit enforcement of SEC climate change interpretive guidance; S. 1538, the Regulatory Time-Out Act of 2011; S. 1720, the Jobs Through Growth Act, provisions related to EPA regulations; S. 1805, regarding the scope of EPA authority to reject all or part of a State implementation plan under the CAA; S. 1815, the Cross State Air Pollution Act, to codify and delay the implementation dates for a final EPA rule relating to interstate transport of air pollution; S. 1833, the Fair Compliance Act of 2011, to provide additional time for compliance with, and coordinating of, the compliance schedules for [the EPA Utility MACT and CSAPR rules]; S. 2122, the Defense of Environment and Property Act, (defines scope of federal jurisdiction under the Clean Water Act); S. 2245, Preserve the Waters of the U.S. Act, (draft guidance); S. 2300, to delay CSAPR compliance deadline for non-CAIR states; S. 2365, the Western Economic Security Today (WEST) Act, comprehensive energy/environmental regulatory reform, including provisions to prohibit EPA greenhouse gas regulations under the CAA; S. 3053, to require Senate confirmation of EPA Regional Administrators; S. 3240, Agriculture Reform, Food, and Jobs Act of 2012, (Clean Water Act-related amendments on Waters of the United States); S. J. Res. 37, disapproving EPA MATS rule; SA 2367 to H.R. 3240, Hagan-Crapo Amendment to Senate Farm Bill, (Clarify that a Clean Water Act permit is not required for products licensed under FIFRA); Environmental provisions in draft text of FY 2013 Interior, Environment and Related Agencies appropriations bill released by Senate Committee on Appropriations; Clean Water Act, Section 316(b) - cooling water intake structure rule-making; \"Waters of the U.S.\" draft guidance., 42333=H.R. 2273, Coal Residuals Reuse and Management Act, (regulates coal ash under existing municipal solid waste landfill regulations); H.R. 3862, Sunshine for Regulatory Decrees and Settlements Act, (introduce transparency and broaden participation in settlement of regulatory lawsuits); S. 1751, Coal Residuals Reuse and Management Act, (regulates coal ash under existing municipal solid waste landfill regulations); S. 3512, the Coal Ash Recycling and Oversight Act of 2012, (bill to establish minimum federal requirements for state coal ash regulatory programs)., 30902=H.R. 607, \"Broadband Spectrum for First Responders Act\"; H.R. 3606, Jumpstart Our Business Strength (JOBS) Act, (Public Safety Broadband Network); H.R. 3765, Temporary Payroll Tax Cut Continuation Act of 2011 (spectrum); S. 28, \"Public Safety Spectrum and Wireless Innovation Act\"; S. 911, \"Strengthening Public-Safety and Enhancing Communications Through Reform, Utilization, and Modernization Act (SPECTRUM Act); S. 1029, \"Electric Consumer Right to Know Act (eKNOW); S. 1222, \"Digital Accountability and Transparency Act (DATA)\"., 46093=H.R.2682, Business Risk Mitigation and Price Stabilization Act of 2011, (Over-the-Counter derivatives); H.R.3527, Protecting Main Street End User from Excessive Regulation Act, (Over-the-Counter derivatives).}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20004 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  KATHRYN STECKELBERG  2025085478  ksteckelberg@eei.org 5. Senate ID#  13131-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}