{
    "relation": [
        [
            "Patent application number",
            "20080198023",
            "20080288011",
            "20100081913",
            "20140317318",
            "20140317611"
        ],
        [
            "Description",
            "Method and Apparatus for Communication with Bystanders in the Event of a Catastrophic Personal Emergency - A system including a body worn audio communication device which can provide bystanders with verbal instructions in the event of a catastrophic personal health emergency. This is of particular use in situations that leave a patient unconscious, such as the onset of sudden cardiac arrest. This device is in communication with a system that provides it with an indication of personal health, which can be as basic as “ok” or “not ok”. This indication may be manually activated, or may include automated monitoring of one or more patient attributes coupled with automated determination of the patient's state of health.",
            "Method and Article for Storing an Automatic External Defibrillator for Use Without a Prescription - A method and article for storing an automatic external defibrillator for use without a prescription are described. The hermetically sealed electrode pads of the OTC AED are electrically coupled to the OTC AED base unit where they are constantly accessible to self-test circuitry inside the base unit for periodic, automatic self-test. In one embodiment the self-test is designed to determine whether the conductive gel of the electrode pads has dried out. In another embodiment self-test circuitry also tests the battery while the OTC AED is being stored prior to use.",
            "HANDHELD, REPOSITIONABLE ECG DETECTOR - An ECG monitoring device comprises an integral handheld device including a ECG electronic module and an electrode patch having a plurality of electrodes which contact a subject by conductive hydrogel. A release liner covers and protects the hydrogel prior to use and is removed to expose the hydrogel. A second release liner is removed to expose a pressure sensitive adhesive by means of which the device is attached to a subject. The first and second release liners may be parts of a single release liner layer. After use the electrode patch is disposable and the ECG electronic module is detached from the patch for reuse.",
            "DEVICE AND METHOD FOR UPDATING FIRMWARE OF A PERIPHERAL DEVICE - An electronic device executes a software application that includes instructions for updating firmware of a peripheral device and one or more firmware images. The electronic executes the firmware update instructions to initiate the firmware update of the peripheral device and transfers a firmware image from the software application to the peripheral device according to a response from the peripheral device. The software application sends information to the peripheral device for verifying the transferred firmware image and causes the peripheral device to use the transferred firmware image upon successful verification.",
            "PERIPHERAL DEVICE AND METHOD FOR UPDATING FIRMWARE THEREOF - A peripheral device for an electronic device includes a memory configured to store at least an active firmware image and another firmware image, and circuitry configured to execute instructions provided in the firmware image. The circuitry receives, from a software application of the electronic device, commands and a firmware image included in the software application. The circuitry verifies the received firmware image file and writes the portions to a memory block different from a memory block at which the active firmware image is located. A command from the software application causes the peripheral device to specify the newly written firmware image as an active firmware image and to execute the newly active firmware image."
        ],
        [
            "Published",
            "08-21-2008",
            "11-20-2008",
            "04-01-2010",
            "10-23-2014",
            "10-23-2014"
        ]
    ],
    "pageTitle": "Hansen, WA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hansen-wa-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 449891627,
    "recordOffset": 449865487,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kim J. Hansen, Renton, WA US //]]> BarDraw('3493268',['Patent applications by Kim Hansen, Renton, WA US'],[[1,1,1,1,1,2]],['2005','2006','2007','2008','2009','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3493268\" align=\"center\"></div> </div> <canvas id=\"bg3493268\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Kim Hansen, Renton, WA US</p> <div class=\"bar3493268\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>10-04-2012</td> <td><a href=\"/patents/app/20120254629\">Read and Write Optimization for Protected Area of Memory</a> - A system (and method) to update content of a secure area of a secure digital (SD) card is disclosed. The system performs a first authenticated key exchange to access the secure area of the secure digital memory. The system reads content from the secure area in response to successful performance of the first authenticated key exchange. The system modifies the content in a memory of a computer system. The system performs a second authenticated key exchange to access the secure area of the secure digital card in preparation to write to the secure area of the secure digital memory. The system then writes modified content to the secure area of the secure digital memory in response to successful performance of the second authenticated key exchange.</td> <td>20120254629</td> <tr> </tr> <td>04-26-2012</td> <td><a href=\"/patents/app/20120101396\">CONTINUOUS OUTPATINET ECG MONITORING SYSTEM</a> - An ECG monitoring system for ambulatory patients includes a small multi-electrode patch that adhesively attaches to the chest of a patient. A reusable battery-powered ECG monitor clips onto the patch and receives patient electrical signals from the electrodes of the patch. A processor continuously",
    "textAfterTable": "Patent applications by Kim J. Hansen, Renton, WA US Kris Edward Hansen, Anacortes, WA US Patent application number Description Published 20100133392 METHOD, SYSTEM AND APPARATUS FOR GUIDING AND SUPPORTING AN ELONGATED FLEXIBLE MEMBER - The present invention relates to a member for guiding and supporting elongated flexible members such as wires, cables and other flexible lines that can introduce services and utilities into a residential, commercial or similar building structures. The guiding and support members receive and support at least one of the elongated flexible members so that it can be pulled around a corner without being damaged. Additionally, the guiding and support members can be used when the elongated member is only being pulled in a straight run or to organize elongated members that have already been run. Sweeps, including roller sweeps and cradles, can be secured to the guiding and supporting members to maintain a predetermined radius in the flexible members and reduce the amount of friction on the flexible member as it is pulled. This reduction in friction results in a smoother pull of the flexible member and a reduction in the amount of force needed to pull the flexible member. 06-03-2010 Lisa",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}