{
    "relation": [
        [
            "Grade",
            "00",
            "03",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "13"
        ],
        [
            "Given for...",
            "completely unacceptable performance.",
            "very unsatisfactory performance.",
            "not satisfactory performance.",
            "acceptable performance. Passed!",
            "average performance.",
            "good performance.",
            "very good performance.",
            "excellent performance.",
            "excellent performance with honours.",
            "exceptionally excellent performance."
        ]
    ],
    "pageTitle": "Gradepoint average - Psychology Wiki",
    "title": "",
    "url": "http://psychology.wikia.com/wiki/Gradepoint_average?direction=prev&oldid=104712",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 201999123,
    "recordOffset": 201947440,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2066=The concept of grading students' work quantitatively was developed by a tutor named William Farish, and first implemented by the University of Cambridge in 1792. [1]}",
    "TableContextTimeStampAfterTable": "{37525=To compensate for this, most academic institutions require that candidates undergo a psychometric exam, which in Israel provides examinees with an overall score of 200-800, the average being 535 (according to the National Institute of Scoring and Evaluation's [1] report of 2005 results)., 135883=Theories: Standards-based education reform  • Outcomes-based education  • Developmentally Appropriate Practice  • Holism  • Constructivism (learning theory)  • Block scheduling  • Holistic grading  • NCEE  • Active learning  • Discovery learning  • Inquiry-based science  • Inventive spelling  • Open-space school  • Small schools movement Values: Excellence and equity  • Meaningful high school diploma  • High standards  • High expectations  • Continual improvement  • Accountability  • Closing the achievement gap Standards: Whole language • National Science Education Standards  • Standards-based mathematics  • National History Standards Federal: No Child Left Behind Act  • Goals 2000  • School-to-work transition Assessment: Criterion-referenced test  • Norm-referenced test  • Standards-based assessment State Assessment: AIMS  • CLAS  • WASL  • MCAS Diploma: Certificate of Initial Mastery  • High school graduation examination Traditional Education: Traditional education  • Traditional mathematics  • Direct instruction  • Phonics  • Decodable text  • Rote learning  • Grade (education)  • Lecture  • Tracking (education)  • Standard algorithms  • Correct answer, 64518=The average of grades given in Danish high schools in 2003 was 8.22., 64746=From the 2006-07 school year, a new scale will be introduced, made to be compatible with the ECTS-scale., 111652=Until 1994 relative grades on the scale 1, 2, 3, 4, 5 were used. The scale was intended to have a national average of 3 and a standard deviation of 1, where 5 was the highest grade., 117715=At university level, Latin expressions are used in some cases. The Latin grades for a passed final exam in law at the University of Zurich for example are \"summa cum laude\" (excellent), \"magna cum laude\" (very good), \"cum laude\" (good) and \"rite\" (sufficient). Promotionsordnung der Rechtswissenschaftlichen Fakultät (German). URL accessed on August 5, 2005., 78145=In former East Germany, a 5-point grading scale was used until July of 1991, where:, 111850=Up until 1962 yet another scale was used:, 118569=Ukraine has introduced some invention in grading system after 2002., 121154=Australian primary and secondary schools are currently migrating to a common reporting and assessment format. Education is the responsibility of the states in Australia. In 2005 the Federal Government introduced a universal common assessment and reporting standards legislation that all states had to adhere to. The grading system is now structured as follows, though the percentages are only an approximate guide:, 9542=An aggregate is calculated by adding a student's best six subjects - each higher grade subject is out of 400 but counts out of 300 (thus 100%+ is achievable), and each standard grade subject and second language is out of 300. An aggregate of over 1680 is an 'A' aggregate.}",
    "textBeforeTable": "The \"passing\" grade is usually 10; a common categorization follows: In Algeria, Belgium, Ecuador, France, Greece, Morocco, Portugal, Peru, Venezuela, Senegal, Mali, Iran, and Tunisia, a 20-point grading scale is used, in which 20 is the highest grade and 0 is the lowest. A score of 20 is considered perfect; accordingly, it is rarely if ever awarded in courses that are graded subjectively. 20-point grading scale Most nations have individual grading systems unique to their own schools. However, several international standards for grading have arisen recently. International grading systems [show] Contents The concept of grading students' work quantitatively was developed by a tutor named William Farish, and first implemented by the University of Cambridge in 1792. [1] In education, a grade (or mark) is a teacher's standardized evaluation of a student's work. In some countries, evaluations can be expressed quantifiably, and calculated into a numeric grade point average (GPA). A cumulative grade point average (CGPA) is the mean GPA from all semesters, whereas GPA may only",
    "textAfterTable": "ECTS also includes a standard grading scale[3]: Grade Percentile A 90–100 B 65–90 C 35-65 D 10–35 E 0–10 FX — F — The grade FX indicates that \"some more work required before the credit can be awarded.\" The grade F indicates \"considerable further work required.\"[3] European Baccalaureate This degree that is awarded by the European Schools. Pupils are graded on a analog scale of 0 to 10. Half marks may be awarded, and in computing the total average two decimals are shown : Grade Qualification 10 is the highest mark achievable (hardly awarded) 8.5 Very Good 7.5 Good 6 Sufficient <6 fail 0 worst grade (cheating, etc.) International Baccalaureate In the IB Diploma Programme, an internationally-practiced baccalaureate program for secondary school students, candidates are graded on a scale of 1 to 7: 7 is the highest mark achievable. 6 is",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}