{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ],
        [
            "Food Special",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--",
            "--"
        ]
    ],
    "pageTitle": "Gaslight Club: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/GaslightClub/GaslightClub.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366973867,
    "recordOffset": 366958234,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35219=Burton Browne, The Ace Of Clubs 1970 from Charles Lange., 32769=– Bill B. on Yelp (June 2, 2010), 34741=– excerpt from MODERN LIVING: Cash Under the Gaslight in Time (December 12, 1960), 32921=The first Gaslight Club opened on October 27, 1953 in Chicago's Gold Coast neighborhood, by Burton Browne—a Colonel Sanders look-alike that sincerely felt he was a mountain lion in a former life. The original Gaslight Club was in such high demand, that it had to move to a larger space at 13 E. Huron (now a high-rise) that also featured the bar from the infamous Everleigh Club. A second Chicago location was added at the Palmer House (closed in 1988)., 39028=– excerpt from David Hoekstra's article Chicago nightlife's hidden gem is out by O'Hare in the Sun-Times (March 14, 2010), 35380=In 1956, the New York Club opened in a plush old mansion and featured Elizabeth Taylor as a Gaslight Girl, while filming scenes there for Butterfield 8, for which she won and Academy Award. The Washington DC club opened in 1959 and then Paris in 1961. Gaslight Club O'Hare opened in 1973. After Burton Browne passed on, board member Robert Fredricks ran the clubs until 1984 when long-time Gaslight Club member Jim Roberts, Jr, took the reigns. At its height, the Gaslight Club boasted over 26,000 members, each with a gold-plated key. However, by the late 80s and early 90s, interest in members-only clubs significantly declined and both Gaslight and Playboy Clubs were closed with increasing frequency. Until a new Playboy Club opened up recently in Las Vegas, Gaslight Club O'Hare was the only one of its kind to survive., 33501=\"[Gaslight Club] was started by Burt Browne, 55, president of Burton Browne Advertising ($5,000,000 a year in billings, mostly in electronics accounts), who declares he is 'the only saloonkeeper in the country listed in Who's Who, the Social Register and Dun & Bradstreet.' In 1941, needing a place to entertain the 'advertising manager from Seattle after feeding him a steak and three martinis,' Browne converted a small office adjoining his agency into the Sundown Room, equipped it with a bar and attractive barmaid. Soon the Sundown Room became such a popular gathering place for Chicago hucksters that Browne could hardly get a drink in his own club. In 1953 Browne got 15 friends to invest $1,000 apiece in an expanded version of the Sundown, opened the Gaslight Club. He decorated it to resemble a fancy turn-of-the-century saloon in red velvet, covered the walls with paintings of nudes, supplied a ragtime piano player and free platters of cold cuts. The biggest attractions were beautiful waitresses in abbreviated versions of 1905 ball gowns. Mostly aspiring models and actresses, they earn up to $15,000 a year, are strictly supervised by Browne's pretty wife, Jean.\"}",
    "textBeforeTable": "\"Beauty, charm and talent make a winning combination\" O'Hare Hilton Hotel, Lobby Level O'Hare Airport 10000 Bessie Coleman Dr. (5400N, 10800W) Chicago, IL 60666 (773) 686-0200 Gaslight Club Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "Not to be confused with Gaslight on Racine, the Gaslight Club situated in the O'Hare Hilton is the last of the original 20s-era speakeasies that inspired the old Playboy Clubs. The waitstaff consists of lovely and charming can-can girls dressed in corsets, tassels and fishnet stockings. The Gaslight Club's extends beyond even that, attracting more of a transient business clientele with few regulars coming from the city or suburbs. Gaslight was open to key-holding members until 2001 and is now available to anyone wanting a cocktail, steak or seafood dinner, and live piano entertainment in a posh throwback setting. The O'Hare Hilton is situated across from Terminal Three, within the confines of O'Hare International Airport. Visitors either fly in, take the Blue Line \"L\" or park in the short-term lot. The Gaslight Club is located at the northwest end of the lobby, to the right of the front desk. Serbian owner Ranko (Ray) Dabizljevic leases the space from the Hilton and advertises the dress code as \"business attire,\" a rarity these days. To the left of the framed Gaslight sign promising \"Elegant Dining & Entertainment,\" you'll find the maitre' d stand below a white statue of a woman that looks like she's about to dive into water—perhaps your wallet instead... If you're dining, the hostess will lead you to your table down a narrow carpeted aisle with Victorian wallpaper and illuminated by Tiffany lamps. A small room",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}