{
    "relation": [
        [
            "Patent application number",
            "20090247780",
            "20100286349",
            "20110098497",
            "20130177488"
        ],
        [
            "Description",
            "METHOD OF PRODUCING NITRILE COMPOUNDS - The present invention relates to the manufacture of nitrile compounds from unsaturated organic compounds by reaction with hydrogen cyanide. It relates more particularly to the manufacture of nitrile compounds of use in the synthesis of adiponitrile, an important chemical intermediate in the manufacture of major chemical compounds, such as hexamethylenediamine and ε-caprolactam. The invention provides a process for the manufacture of organic compounds comprising at least one nitrile functional group by carrying out a hydrocyanation reaction between hydrogen cyanide and an organic compound comprising at least one ethylenic unsaturation. This reaction is carried out in the presence of a catalytic system comprising a metal element chosen from the group consisting of nickel, platinum and palladium and an organophosphorus ligand, the reaction medium additionally comprising an ionic liquid in the liquid state at least at the temperature at which the hydrocyanation reaction is carried out.",
            "NOVEL COMPLEXES AND METHOD FOR SYNTHESIS OF GROUP 4 ORGANOMETALLICS GRAFTED ON ANIONS OLEFIN OLIGOMERIZATION AND POLYMERIZATION METHOD - Novel group 4 organometallic compounds, supported on anions by means of at least one covalent metal-oxygen bond, are obtained by reaction of at least one borate or aluminium comprising at least one hydroxy group with at least one group 4 transition metal compound. These compounds are used in a catalytic composition implemented in an olefin oligomerization or polymerization method.",
            "NOVEL COMPLEXES AND METHOD FOR SYNTHESIS OF GROUP 6 ORGANOMETALLICS GRAFTED ON ANIONS, AND USE THEREOF IN AN OLEFIN METATHESIS METHOD - Novel group 6 organometallic compounds, supported on anions by means of at least one covalent metal-oxygen bond, are obtained by reaction of at least one borate or aluminate comprising at least one hydroxy group with at least one compound of a group 6 transition metal. These compounds are used in a catalytic composition utilized in an olefin metathesis method.",
            "PROCESS FOR SEPARATING ZIRCONIUM AND HAFNIUM TETRACHLORIDES FROM MIXTURES - A simple, inexpensive and non-corrosive industrial separation method making it possible to separate zirconium and hafnium tetrachlorides from mixtures thereof, a simple industrial method allowing the zirconium/hafnium separation, and a method making it possible to produce fractions enriched with zirconium and containing hafnium at a trace level are disclosed."
        ],
        [
            "Published",
            "10-01-2009",
            "11-11-2010",
            "04-28-2011",
            "07-11-2013"
        ]
    ],
    "pageTitle": "Chauvin, FR - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chauvin-fr-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444611356,
    "recordOffset": 444595701,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Yves Chauvin, Tours FR 10-25-2012 Computer-implemented method and system for interacting with a user - A computer-implemented method is disclosed for interacting with a user. The method includes receiving information from a user via a configuration tool, the information being related to a request made by the user to implement a user interface for a bilateral special service request (SSR); and using the received information, in conjunction with a passenger name record service framework (PSF), implementing a user-specific user interface to permit one or more passenger name record elements associated with an instance of the requested bilateral SSR to be included as an element of an instance of a passenger name record (PNR). Also disclosed is a system that is configured to perform the steps of the method with the use of at least one data processor. 20120272169 Published Description Patent application number Stéphane Chauvin, Valbonne FR 11-10-2011 COMPUTER NAVIGATION METHOD - A computer navigation method includes the steps of: 20110276910 Published Description Patent application number Stéphane Chauvin, Valbonne-France FR 05-05-2011 METHOD AND SYSTEM FOR ADAPTING A SESSION TIMEOUT PERIOD - A method for adapting a session timeout period of an application comprising one or more parts, each part of the application having a corresponding predetermined session timeout period for receiving an input from a user connected to a part of the application,",
    "textAfterTable": "Patent applications by Yves Chauvin, Tours FR Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}