{
    "relation": [
        [
            "Fireplace:",
            "Pool:",
            "Hot Tub:",
            "View:"
        ],
        [
            "Wood",
            "Yes",
            "Unit",
            "Mountain Views"
        ],
        [
            "TV in Master Bedroom:",
            "Washer/Dryer:",
            "High Speed Internet:",
            "Unit Code:"
        ],
        [
            "Yes",
            "Unit",
            "Yes",
            ""
        ]
    ],
    "pageTitle": "Starwood Luxury Estate in Aspen Colorado for Vacation Rental",
    "title": "",
    "url": "http://www.friasproperties.com/store/p2details506.php",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00232-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467611617,
    "recordOffset": 467595657,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Additional Details: Queen bed, steam shower 5th & 6th Guest Bedrooms: Bunk beds and two full beds, steam shower 4th Guest Bedroom: King bed, steam shower, flatscreen TV 3rd Guest Bedroom: King bed, gas fireplace, steam shower, Jacuzzi tub, flatscreen TV 2nd Guest Bedroom: King bed, deck, gas fireplace, steam shower, Jacuzzi tub, flatscreen TV 1st Guest Bedroom: King bed, deck, gas fireplace, steam shower, Jacuzzi tub, walk-in-closet, flatscreen TV Master Bedroom: Sub-Zero appliances, Viking stove, two ovens, walk-in pantry, warming drawer, wine cooler Kitchen: Will Burggraf or call 970-429-2415. For more information e-mail This home includes the finest in luxury, including an indoor pool and hot tub; personal gym; private outdoor tennis court; wine room; theater room; private office; formal dining for 12; elevator; air conditioning and radiant heat; Wi-Fi internet; and only 3.2 miles to town! This elegant estate is situated on a private 2.26-acre lot in the gated community of Starwood, with big, spectacular views and just minutes to downtown Aspen. This home is 13,500 square feet and can accommodate 16+ people. The ultimate in luxury! Private Homes Condo Complex:",
    "textAfterTable": "Property Location: Check-in Location: 730 East Durant Avenue Vacation Rentals Aspen Luxury Rentals Aspen Condominiums Galena Street Neighborhood Independence Square Silverglo Condominiums Homes Ritz | St. Regis | Hyatt | Innsbruck | Residences at the Little Nell Groups & Conferences Vacation Rental brochure Accommodation Ratings Rental Policies Interactive Property Map Win A Trip Custom Rentals Custom Luxury Rentals Custom Deluxe Rentals Custom Standard Rentals Specials & Packages Last-Minute Deals Luxury Brands Specials Condominium Specials Homes Specials Independence Square Specials Property Management Vacation Rental Property Management Property Management Services for Non-Rental Properties Association Services Owner's Corner Owner Forms Aspen Info Summer Activities Concierge Services Calendar of Events Aspen Club & Spa Airline Info Ground Transportation Photos Videos Dogs of Aspen Winter Activities Ski & Snowboard Rentals Lift Tickets Skiing Info Snow Report Weather",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}