{
    "relation": [
        [
            "Model",
            "250GT sedan (DBA-V36)",
            "250GT FOUR sedan (DBA-NV36)",
            "370GT coupe (DBA-CKV36)",
            "370GT sedan (DBA-KV36)",
            "370GT crossover (DBA-J50)",
            "370GT FOUR crossover (DBA-NJ50)"
        ],
        [
            "Years",
            "2010—",
            "2010—",
            "2010—",
            "2010—",
            "2010—",
            "2010—"
        ],
        [
            "Engine Type/code",
            "2,495 cc (2.495 L; 152.3 cu in) V6 (VQ25HR)",
            "2,495 cc (2.495 L; 152.3 cu in) V6 (VQ25HR)",
            "3,696 cc (3.696 L; 225.5 cu in) V6 (VQ37VHR)",
            "3,696 cc (3.696 L; 225.5 cu in) V6 (VQ37VHR)",
            "3,696 cc (3.696 L; 225.5 cu in) V6 (VQ37VHR)",
            "3,696 cc (3.696 L; 225.5 cu in) V6 (VQ37VHR)"
        ],
        [
            "Power, torque@rpm",
            "225 PS (165 kW; 222 hp)@6400, 263 N·m (194 lb·ft)@4800",
            "225 PS (165 kW; 222 hp)@6400, 263 N·m (194 lb·ft)@4800",
            "333 PS (245 kW; 328 hp)@7000, 363 N·m (268 lb·ft)@5200",
            "330 PS (243 kW; 325 hp)@7000, 361 N·m (266 lb·ft)@5200",
            "330 PS (243 kW; 325 hp)@7000, 361 N·m (266 lb·ft)@5200",
            "330 PS (243 kW; 325 hp)@7000, 361 N·m (266 lb·ft)@5200"
        ],
        [
            "Drive",
            "RWD",
            "AWD",
            "RWD",
            "RWD",
            "RWD",
            "AWD"
        ]
    ],
    "pageTitle": "Nissan Skyline - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Nissan_Skyline",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878542171,
    "recordOffset": 878464227,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{112047=To this day the FJ20-powered R30 Skyline remains a cult car both at home and overseas (there are still dedicated \"one make\" drag racing events for this model in Japan), and is credited with rejuvenating the Skyline brand in the early 1980s. It also paved the way for the eventual re-introduction of the legendary GT-R badge, markedly absent since the end of C110 Skyline production in 1973., 173094=The BCNR33 GT-R version also had the same RB26DETT engine that the BNR32 was equipped with, although torque had been improved, due to changes in the turbo compressor aerodynamics, turbo dump pipe, and intercooler. The turbo core changed from a sleeve bearing to a ball bearing, but the turbine itself remained ceramic, except on N1 turbos (steel turbine, sleeve bearing). From the R33 onward, all GT-Rs received Brembo brakes.[36] In 1995 the GT-R received an improved version of the RB26DETT, the ATTESA-ETS four-wheel-drive system, and Super HICAS 4-wheel steering., 237157=Sales of the Skyline Crossover began on July 13, 2009. Early models include the 370GT (Type P) and 370GT FOUR (Type P).[87][88][89], 49552=In 1966, Nissan and Prince merged and the S50 also appeared with Nissan Prince Skyline badging. This model lasted in production through 1967. In October 1966, the S50-2 was introduced. This light facelift included a new grille and taillights, as well as changes to the interior, and with the addition of an extraction vent on the C-pillar.[11] It was sold as Prince Skyline, Prince A150, PMC A150, or Nissan A150, depending on the market. All \"Prince\" dealership locations were added to the existing Nissan/Datsun Japanese dealerships, while retaining the Prince name to become Nissan Prince Store., 209525=For 2003 the design of the radiator grille, headlamp inner panels, and sills were altered. The interior and mirrors were altered, while the suspension and braking systems were also refined. The Skyline Coupe was introduced as a version of Infiniti G35 Sport Coupe for Japanese market. Also, the Skyline 350GT went on sale. It is a version of the Infiniti G35 sport sedan with a six-speed manual transmission for the Japanese market, only available with the 3.5 litre engine. The Skyline 350GT and Skyline 350GT Premium sedan went on sale on 2003-06-03.[54], 91710=In June 1980 the two-liter, fuel injected inline-four Z20E engine was added to the lineup, as was the 2.8 liter straight-six GT-Diesel with 91 PS (67 kW)., 191914=The vehicles went on sale on February 26, 2002.[40], 221304=The 250GT Type S was introduced for 2008 model year., 199575=The 11th-generation (V35) Nissan Skyline, introduced in June 2001, was based on Nissan's FM platform, shared with the Nissan 350Z. The Nissan Skyline used a front-midship engine (VQ35DE and others as below), rear-wheel-drive layout[44] (four-wheel drive was available for the sedan) to achieve a 52%/48% weight distribution. The V35 was the first Skyline made for export to the United States. There it was sold under the company's luxury brand, Infiniti as the Infiniti G35., 110394=Further changes were made in 1984, most notably the addition of an intercooler, revised compression ratios and turbocharger exhaust housing to the FJ20ET powered model, now known as the RS-Turbo C and increasing output to 205 PS (151 kW) of power at 6,400 rpm and 245 N·m (181 lb·ft) of torque at 4400 rpm. An automatic transmission option was also added at this time, and changes to the \"PLASMA Spark\" ignition system followed in early 1985 towards the end of R30 production., 46518=Externally, this generation was installed with rounded brake lights and integrated tail lights, with a centrally installed turn signal, similar in appearance to the Ford Galaxie of 1960. The significant appearance change from the previous generation seems to reflect a similar approach done by German company BMW in 1962, in deciding to build a small, affordable, performance coupe and sedan., 76396=The body styles were, once again, four-door sedan, two-door hardtop coupé, and five-door station wagon. The C110 was more fussy in its styling than its predecessor, particularly so in wagon form, where unusually for a wagon design, no windows were fitted between the C and D pillars. Its appearance seems to be influenced by the 1970–1975 Citroën SM. The C110 was the first version to return to the round rear tail and brake lights introduced in 1963 albeit with dual units from the previous generation, and the appearance has become a traditional Skyline feature. The styling also influenced a smaller, more affordable two-door coupe, called the Silvia, introduced in 1975. Nissan introduced its emission control technology, primarily consisting of fuel injection on trim packages ending with an \"E\", using the moniker Nissan NAPS also in 1975., 249811=The revised Skyline Crossover, covering 370GT (Type P) and 370GT FOUR (Type P), went on sale on October 25, 2012.[98], 257458=Japan models went on sale in 2014-07-22. Early models included 370GT, 370GT Type P, 370GT FOUR Type P, 370GT FOUR.[103], 86530=The succeeding C210/211 and GC210/211 of 1977 continued to split the Skyline range into basic and six-cylinder models, the latter with a longer wheelbase and front end. This line continued through 1981. A rare variant would be the wagon version, which had a unique styling treatment behind the rear doors, of a much smaller window than usual between the C and D pillars. The Skyline received an internal and external facelift in late 1978,[14] which led to a change of the model code from 210 to 211. This was also when the Skyline first appeared in several European export markets, such as Germany.[15], 168631=The R33 Skyline (Series 2) continued the concepts introduced in the R32. Driver and Passenger airbags became standard in 1996. As a result, pre-1996 models are barred from being imported into various countries for consumer road use as they do not meet the frontal impact standards. (However, in the U.S., there are Federal Laws regarding safety and emissions that require certain documents to be obtained, certain criteria to be met and adhered to, or 25 years to pass, before the sale of this vehicle becomes legal.[citation needed]) For the RB25DET engine the ignition system was also changed, with the ignition module no longer located on the cam covers and was instead replaced by smart ignition coils (Ignitor built into coil) and ECU. The RB25DET (turbo) was also given a Ceramic compressor wheel. Throughout the time the R33 was produced there were quite a number of different styled lights and bodykits fitted, the actual body/chassis underwent no changes. Among the cosmetic changes in the series 2 were, the headlights which tapered down more towards the grill and were fitted with improved reflectors, the grill (which was longer on the Series 1), the bonnet which had a re-shaped leading edge to fit the new lights and front bumper changing shape in the smallest amount to match the lower edge of the new headlights. Later models of the Series 2 also had the option of having an Active-LSD fitted. The R33 ceased production in February 1998 with the 40th Anniversary R33., 44718=In 1961 Fuji Precision Industries changed its name to Prince after the 1954 merger. Two years later, in September 1963, the S50 Skyline Deluxe series was launched.[8] Like its predecessor, it came in sedan and wagon bodystyles. This was the second generation car, and became one of the more desirable cars in Japan. It was powered by the G-1 engine,[5] a 70 PS (51 kW) version of the old GA-4. The S50 series were available with a three-speed column shift transmission, or a four-speed floor shift transmission from February 1965 (Deluxe only), either as a four-door sedan (S50) or a five-door wagon (W50). A two-speed automatic option was added to the Deluxe in June 1966. The lower priced and equipped Standard model was added in April 1964; aiming at taxi operators and others it also lacked bumper overriders, making it 11 cm shorter. Two main models of the S50 were built: the S50 (1963–1966) and the lightly facelifted S50-2 (1966–1967). These all used the same engine, with the later S57 receiving a more modern unit. In Japan its market position was refocused as a competitor to the Datsun Bluebird and the Toyota Corona., 33702=This model was powered by a slightly altered 1,484 cc (90.6 cu in) OHV engine known as the GA-4 of about 70 PS (51 kW) at 4,800 rpm and was produced through 1961. An 1,862 cc (113.6 cu in) engine was also available in the Skyline 1900 (BLSID-3/BLSIS-3), delivering 91 PS (67 kW) at 4,800 rpm. This version was introduced in May 1961 and continued in production until the introduction of the second generation Skyline in 1963 In 1962, this model was restyled as the S21D/S series., 130822=The ultimate version of the R31 was the RB20DET-R powered HR31 GTS-R Coupe of which 800 units were built to allow homologation for Group A Touring Car racing. Introduced in late 1987, it had a reworked version of the normal RB20DET with a much larger turbocharger on a tubular steel exhaust manifold, as well as a much larger front-mounted intercooler boosting power to a factory claimed 210 ps (154 kW), with racing versions making over 430 hp (321 kW) in Group A trim., 117001=The 340 bhp (254 kW; 345 PS) DR30 continued to be used by privateer racers in Australian touring car racing until 1989., 224065=The vehicles were unveiled in 2008 Tokyo Auto Salon,[64][65] followed by 2008 Nissan Customize Car Show.[66], 222721=The vehicle was unveiled in 2007 Tokyo Motor Show.[61], 193279=As part of the Type R34 GT-R final campaign, all Skyline GT-R customers received a GT-R official photo album (「歴代GT-Rオフィシャル写真集＜限定版＞」) before January 24, 2002.[40], 218860=The Skyline Sedan went on sale on November 11, 2006, with an update to the Skyline Coupe beginning in fall 2007. Early models included the 250GT, 250GT FOUR, and 350GT.[55][56], 210194=For 2004 both coupe and sedans were altered, with updated interiors and improved transmissions. The five-speed automatic transmission on the 350GT Premium now included synchro rev control, while the 6-speed manual transmission was made to vibrate less. For the sedan, the front grill/bumper, foot panel, head lamp, rear bumper, and rear combination lamps were changed. The front seats received active head rest, while the rear middle seat now have a three-point seat belt as standard. There were also some new wheels and a 19-inch option for the coupé. The Skyline's 2005 update again included changes to the head and rear lamps, front bumper, and side sill protectors. Also, 19-inch aluminium alloy wheel became standard for automatic transmission cars. A \"plasma cluster ion\" full air conditioner with left/right independent temperature settings, heated door mirrors, head lamp auto levelizer (compliant with new legislation) was made standard equipment., 181611=In May 1998, the EN34, HR34, ER34 and BNR34 marked the introduction of the more fuel-efficient and environmentally friendly RB25DET NEO engine. The RB20E engine was discontinued in the R34 base model (GT), and the RB20DE, after last being used in the R32 Skyline, was reintroduced in updated NEO guise. The R34 GT powered by the RB20DE NEO, coupled with a five-speed gearbox, became the most fuel-efficient straight-six Skyline to date (of any shape). \" The 4-speed automatic transmission available on some models in the previous two shapes were discontinued. In its place, Nissan produced a 4-speed Tiptronic transmission for all of the automatic versions (Except the base 2.0L, which has a standard 5-speed gearbox). Only the GT-T coupe variant was sold in New Zealand and Hong Kong from 1997 to 2000 respectively. They were the only two countries besides Japan that sold the R34 GT-T model Skylines new. All Japanese Nissan Prince Store locations that sold the Skyline were renamed Nissan Red Stage., 220065=Introduced in 2007 for the 2008 model year, it is a Japanese version of the Infiniti G37 coupe., 153612=When originally designed, the homologation rulebook mandated 16-inch wheels, so that's what the GT-R got. This limited the size of the brakes, and the Nissan four pots weren't really up to competition use. A later change in rules allowed 17-inch wheels, so in February 1993 the GT-R V-spec (for Victory) emerged wearing 17\" BBS mesh wheels(225/50/17) covering larger Brembo brakes. The clutch actuation changed from a push to a pull system, the car had the standard rear differential, the electronic rear differential did not show up until the R33 Vspec. A year later the V-Spec II appeared with a new sticker and wider tires (245/45 17).[32], 201530=The all-new Skyline was introduced at reorganized Nissan Japanese dealerships called Nissan Red Stage in conjunction with the reintroduced Nissan Fairlady Z, sold exclusively at Nissan Blue Stage Japanese dealerships. The vehicle went on sale on June 18, 2001. Early models included the 250GT, 250GTe, and 300GT. Early Skyline Driving Helper model includes 250GT. The Skyline 250GT FOUR sedan includes ATTESSA E-TS all wheel drive with 50:50 synchro mode, VQ25DD (NEO Di) engine, and a five-speed automatic transmission. It went on sale on September 26, 2001.[45] The Skyline 250GTm sedan went on sale on January 13, 2002, while the Skyline 350GT-8 sedan went on sale on February 19, 2002.[45], 103184=Notably, configurations of the R30 sold in Australia and New Zealand were missing the traditional hotplate tail lights, instead opting for more conventional styling. Export markets also received some larger (albeit less powerful) engines, in the form of 2.4 and a 2.8 liter inline-sixes of 120 PS (88 kW) or 139 PS (102 kW). The 2.8 was added in September 1982.[20], 203194=Beginning in 2002, the Skyline sedan was also sold in North America, where it was marketed as the Infiniti G35.[45][46], 64364=The following year, the GC10 2000GT received a 2.0 L (1998 cc) L20 I6 engine like the Nissan Cedric instead of a Prince G-7 engine. The chassis was already designed to receive a straight six, to avoid the S54 extension problem. 105 hp (78 kW) was available from this new engine, in 1970 Nissan production Skyline 2000GT Automatic, in October 1970 Nissan introduced 2 Door Coupe., 228994=As of December 18, 2006, sales of the Nissan Skyline sedan reached 6612 units.[68], 130034=29,305 R31 Skylines were also manufactured and sold in South Africa in 4-door sedan form between 1987 and 1992. These were the last Skylines seen in South Africa. Power came from either the RB30E 3.0 straight-6 motor, RB20E 2.0 straight-6 motor or the CA20S 4-cylinder powerplant., 66064=The first GT-R Skyline appeared in February 1969.[12] Called the PGC-10 (KPGC-10 for later coupé version) internally and Hakosuka (ハコスカ) by fans. Hako (ハコ) means Box in Japanese, and suka（スカ） is short for Skyline (スカイライン; Sukairain). It used the 2.0 L (1998 cc) S20 I6. This new DOHC engine (which was designed by the former Prince engineers) produced 160 hp (118 kW, 180 N m), and was similar to the GR8 engine used in the Prince R380 racing car., 236434=Introduced in 2009, the Skyline Crossover is based on the Infiniti EX37, for Japan market. The vehicle was unveiled at Nissan Galleries nationwide beginning on April 18, 2009,[83][84][85] and later with all seven body colour variants at Nissan Galleries.[86], 234620=Introduced in 2008 for the 2009 model year, the 370GT sedan is a Japanese version of the Infiniti G37 sedan. It replaced the 350GT sedan., 228799=As of November 28, 2006, sales of the Nissan Skyline sedan reached 4144 units.[67], 234002=The vehicles went on sale on December 2, 2008. Early Sedan models include the 250GT, 250GT FOUR, and 370GT. Early Coupe models include the 370GT.[82], 90239=The \"T\" designation on the L16T and L18T does not signify a turbocharger was included; it denotes that those engines came with twin carburetors. The L-series engines were all switched to the cross-flow Z-series in late 1978. The larger 2.4 litre inline-six was never offered in the domestic Japanese market; having been reserved for export. Export engines were rated in DIN horsepower, so while a Japanese-spec L24 promised 130 ponies, European market cars with the same engine only claimed 113 PS (83 kW). On the other hand, European buyers could also get the fuel injected L24E with 127 or 130 PS (93 or 96 kW) DIN, about on par with what the turbocharged GT-EX offered.[17][18] Originally marketed as the Datsun 240K-GT in Europe, the fuel injected version was sold as the Datsun Skyline in most markets where it was available. It has a claimed top speed of 186 km/h (116 mph).[15], 190789=The vehicle went on sale on May 8, 2001.[40], 103764=Various engine configurations were available, initially ranging from the top of the line 103 kW SOHC 6-cylinder turbo L20ET to the 4-cylinder Z18S and 6-cylinder LD28 diesel versions at the other end of the scale. The all-new 16-valve DOHC FJ20 engine debuted in late 1981, and was the first four-cylinder engine from any Japanese manufacturer to employ more than two valves per cylinder (see below). Some of the top spec models featured adjustable suspension dampers that could be adjusted while driving, this was another first for mass-produced JDM vehicles. Nissan Glorias and Laurels also used the L series engines, as well as some diesel (Laurel only) variants., 191479=The M·spec Nür and V·spec II Nür are limited (1000 units) versions of Nissan Skyline GT-R with Super Taikyu N1 spec engine, for Japanese market. It included 300 km/h speedometer, 3d grade name emblem, and addition body colour option (millennium jade (metallic))., 214094=Infiniti G352007-2008 Infiniti G37 2009-2014 Infinti Q40. 2014-, 192432=The production of Skyline GT-R type R34 ended in August 2002., 101740=The names were brought into line with the home Japanese and worldwide markets with the launch of the R30 series in August 1981, which was built on a C31 Laurel platform. Unlike preceding generations, four- and six-cylinder versions now shared a front end of the same length. The R30 was available as a two-door hardtop coupe, a four-door sedan, a five-door hatchback (available only in the R30 generation), or a four-door station wagon. In all, there were 26 variations of the R30 Skyline available., 76141=The C110 generation was produced from 1972 through 1977. For export in the 1970s, the C110 and GC110 Skyline was sold as the Datsun K-series, with models such as the Datsun 160K, 180K and Datsun 240K., 222888=The 50th Limited models, along with 250GT Type S, went on sale from November 27, 2007 until March 31, 2008.[62][63], 109272=Nissan sought to elevate the status of the DR30 Skyline as their new flagship model in light of this success, and it received a generous amount of changes to distinguish it from lesser Skyline models in August 1983. Interior equipment was significantly upgraded to now include electric windows, air conditioning and power steering as standard in the new RS-X model (for Extra) with an increased curb weight of around 1,235 kg (2,723 lb); gone were the days of the spartan, stripped-out race interior, although this could still be specified at time of purchase. But by far the most striking change to the RS was the new unique front end treatment, nicknamed Tekkamen (鉄仮面) or Iron Mask by fans for its distinctive look. The headlights were considerably slimmer, and instead of a conventional grille the bonnet now sloped down to two narrow slits above a facelifted front bumper and airdam.[21], 148806=The R32 GT-R was first produced in 1988 including prototype cars. The first six Nismo's were built in 1989. The other 554 NISMO GT-R's were all built in 1990 and were all Gunmetal Grey in color. The RB26DETT engine actually produced ~320 PS,[citation needed] but it was unstated due to the Japanese car makers' \"gentlemen's agreement\" not to exceed 280 PS (276 hp). The engine was designed for ~500 hp in racing trim,[27] and then muzzled by the exhaust, boost restriction, and ECU. The electronic boost control had a small physical restriction in the control lines. It was marked in yellow so the new owner could remove it and enjoy a safe factory boost increase.[28] After this increase the car would put out ~310 hp (~230 kW) and could do 0–100 km/h in 4.7 seconds and quarter mile in 12.8 seconds.[citation needed], 230329=As part of the Nissan Skyline's 50th anniversary, a Grand Touring Japan event took place starting on March 10, 2007.[72] Following the event, the Grand Touring ~ Legend&Future event was staged at Tokyo Midtown, showcasing 12 generations of the Nissan Skyline.[73][74][75][76] The event continued in Nissan Gallery at Ginza with a chance of winning a Skyline postcard.[77], 161781=The R33 Skyline was introduced in August 1993. Slightly heavier than the R32, it is available in coupe and sedan bodystyles. All models now used a 6-cylinder engine. Nissan took the unusual step of down-grading the GTS model to have only the RB20E, while the twin-cam of the R32 GTS was discontinued along with the 2.0 L turbo RB20DET., 107980=Although making about the same power as the L20ET-powered GT-ES models, the version of the Skyline initially known as the 2000RS was released on October 2, 1981 as more of a stripped-down lightweight racer, without as many luxury extras included (quoted curb weight was only 1,130 kg (2,490 lb)). These were equipped with the naturally aspirated 4-valve-per-cylinder DOHC FJ20E engine generating 110 kW (150 PS; 148 hp) of power at 6,000 rpm and 181 N·m (133 lb·ft) of torque at 4,800 rpm. The official Nissan chassis designation for all FJ20-powered models was DR30., 186299=The GT-R reappeared in 1999, with a revised chassis and other updates. The R34 turbos received a ball bearing core. The R34 N1 turbos had a metal exhaust wheel, and ball bearing center section. The turbo outlet pipes were changed from cast to formed metal outlets. The intercooler outlet side and rear turbo dump pipe had temperature probes fitted in the V-spec models. The biggest feature and most significant feature to the R34 GT-R that wasn't seen on any other model skyline was the display unit at the top of the dashboard. This display unit was very significant for the car at its time. This display showed many of the cars engine stats including boost pressure, oil temp, water temp and more. As a 1999 car this kind of technology was very rare and advanced at the time. The display was capable of showing the G-force that the car was under when driving and there was also a lap timer that could be started by a button that was located near the gear lever. There was a computer jack lead hidden underneath the left passenger side skirt that could be used to transfer driving data from the car to a laptop. This could only be done with a Japanese version of Windows and Japanese software, which today is very hard to come by. Other features such as the battery being located under the back seat of the car made more room available in the engine bay. The Nissan Skyline GT-R rivals are the Toyota Supra and the Mazda RX-7, 79690=The Nissan Skyline GT-R hardtop arrived in September 1972 but only lasted until March 1973, when Nissan ceased its production. The oil crisis saw many people preferring economy cars and high-performance sports cars were looked down upon. Nissan pulled out of Motor Racing, so there was no purpose to the GT-R. It was not officially exported anywhere, although Nissan contemplated exporting to Australia. Only 197 KPGC110 GT-Rs were ever sold in Japan,[13] through specialist Nissan Performance shops (before it was called NISMO). This was the last GT-R for 16 years until the BNR32 in 1989., 31254=The first Skyline was introduced in April 1957,[4] by the Prince Motor Company, and was marketed as a luxury car. It featured a 1.5 L (1,482 cc) GA-30 engine producing 44 kW (60 hp) at 4,400 rpm.[5] It used a de Dion tube rear suspension and was capable of 140 km/h (87 mph). The car weighed around 1,300 kg (2,900 lb). Skylines were produced as four-door sedans and five-door station wagons. Its appearance seems to be influenced[citation needed] by the contemporary Oldsmobile 88. Reflecting popular features found in North America, the Skyline used Dagmars on the front bumper., 7349=The Skyline was largely designed and engineered by Shinichiro Sakurai from inception, and he remained a chief influence of the car until his death in 2011., 10234=On April 11, 2010 a Guinness Book of Records event took place with 225 Skylines taking part in a parade lap at the ISTS at Silverstone UK which produced two world records: the most recorded Nissan Skylines at one meet at one time, and the Most Nissan Skylines on a track at the same time., 231934=As part of the Nissan Skyline Coupe launch, a series of 15 accessories under the SKYLINE collection label, including wallet, card case, key ring (leather, engine cover, and 370GT), intelligent key case, Zippo lighter, Skyline Coupe T-shirt (grey), SKYLINE COUPE pins (in vibrant red, brilliant silver, strafia blue, white pearl, super black, fountain blue, and lunar mare silver) went on sale at Nissan online shop beginning October 2007.[81], 206555=Japanese tuners mostly ignored the V35 Skyline, the 2006 Tsukuba Super Lap Battle had not a single V35 entrant.[50] Tuners such as Mines, Amuse, Hosaka, Garage Defend, M Speed, Nagisa, MCR, HKS, & Top Secret continued developing R32-R34 GT-Rs as time attack cars. Top Secret did tune a V35, but replaced the VQ35DE with a VK45DE V8 Twin Turbo.[51] Signal USA entered a V35 in Formula D, replacing the VQ35DE with an SR20DET.[52], 112460=The DR30 achieved success in Australian touring car racing during the mid-1980s. The factory backed Peter Jackson Nissan Team made its Group A debut in the opening round of the 1986 Australian Touring Car Championship, and over the 10 round series, lead driver George Fury would win four of the rounds and it was only unreliability in the first two rounds that cost Fury the title, finishing only 5 points behind the Volvo 240T of Robbie Francevic. Fury then went on to finish second to the BMW of Jim Richards in the 1986 Australian Endurance Championship, winning four of the six rounds, though failures to finish in the opening round at Amaroo Park in Sydney, as well as a DNF at the James Hardie 1000 at Bathurst cost him the title. Team driver Garry Scott would put the DR30 on pole for the James Hardie 1000 before going on to finish third with young charger Glenn Seton.[22] Despite missing out on the drivers title, Nissan would win the 1986 Australian Manufacturers' Championship from BMW. Fury finished off 1986 by finishing second to the V8 Holden Commodore of Allan Grice in the Group A support race for the Australian Grand Prix in Adelaide., 265843=Japan models were set to go on sale in February 2014. Early models include 350GT HYBRID, 350GT HYBRID Type P, 350GT HYBRID Type SP, 350GT FOUR HYBRID, 350GT FOUR HYBRID Type P, 350GT FOUR HYBRID Type SP.[104][105] 200GT-t, 200GT-t Type P, 200GT-t Type SP went on sale on June 5, 2014 through Nissan dealers.[106][107], 152010=The R32 GT-R dominated Japanese Touring Car Championship (JTCC), winning 29 races from 29 starts, taking the series title every year from 1989 to 1993.[31] It took 50 races from 50 starts from 1991 to 1997 (latterly R33) in the N1 Super Taikyu., 247932=Sedan version, covering the 250GT Type P, 250GT FOUR Type P, and 370GT Type SP, went on sale between December 19, 2011 and April 30, 2013 for ¥3,990,000, ¥4,221,000, and ¥4,515,000, respectively.[94], 220304=The Skyline Coupe went on sale on 2007-10-02. Early models include 370GT, 370GT Type P, 370GT Type S and 370GT Type SP.[57][58][59], 105531=During 1983 the Paul Newman Version R30 was released to commemorate the association between Nissan and the actor Paul Newman, who used to appear in promotional material, as well as race for the company during the late-1970s and early-1980s. The Newman Skyline was simply a top spec GT-ES turbo with signature embroidery and decals., 208907=It is a concept car demonstrating the FR L-class platform. It includes a 3.0L V6 direct-injection gasoline engine, CVT transmission, sedan body. The vehicle was unveiled in 1999 Tokyo Auto Show.[53], 108702=In February 1983 the DR30 range received a significant boost in performance with the introduction of the turbocharged FJ20ET engine in the 2000RS-Turbo. Front brakes were also significantly upgraded to cope with the power increase. Now with 140 kW (190 PS; 188 hp) of power at 6,400 rpm and 225 N·m (166 lb·ft) of torque at 4,800 rpm on tap, the FJ20ET enjoyed new-found prestige as the most powerful Japanese production engine of its era., 51560=Prince created a racing GT Skyline in May 1964. It was based on the S54 and used the G-7 engine from the Gloria S41, though the car needed a 200 mm (8 in) extension to the wheelbase (all forward of the cowl) to provide space in the engine bay for the inline six. When it entered the second Japanese Grand Prix[citation needed] they hoped to win the GT-II class. Competitive against the Porsche 904, the Skyline managed second through to sixth places.[citation needed], 60664=The C10 series of 1968, which began its development under Prince at the company's Ogikubo R&D centre in the suburbs of Tokyo, was marketed with a Nissan badge. By the time the C10 went on sale, the Prince nameplate had been completely phased out on cars and trucks. The dealer network selling the cars became the Prince channel of Nissan, and the marketing group stayed at the Prince headquarters in Mita instead of moving to Nissan's headquarters in Ginza. The C10 Skyline was launched with Prince's 1.5 L OHC G15 I4 like the S57. A 1.8 L G18 version was also available. A station wagon variant, known previously as the Prince Skyway, was offered with this generation. A hardtop coupé was introduced in October 1970., 142118=The R32 Skyline debuted in May 1989. It was available as either a 2-door coupe or 4-door hardtop sedan, all other bodystyles were dropped. The R32 featured several versions of the RB-series straight-6 engines, which had improved heads (the twelve port inlet was gone) and used the ECCS (Electronically Concentrated Control System) injection system. Also available was an 1,800 cc 4-cylinder GXi model. Most models had HICAS four-wheel steering, with the rear wheels being hydraulically linked to the front steering. The 2.5-litre GTS-25 became one of the first Japanese production cars to feature a 5-speed automatic transmission. The GTS-t came in standard and Type M configurations, with the Type M having larger five-stud 16-inch wheels, four piston front callipers and twin piston rears plus other minor differences. ABS was optional (except for the GT-R and GTS-4), mechanical LSD was standard on the GTR and viscous LSD was standard on all turbo models and optional on all but the GXi. Nissan also produced 100 Australian models of the R32. In addition, there was a 4WD version of the GTS-t Type M, called the GTS-4., 219371=On May 13, 2008, Nissan announced that a convertible variant of the Infiniti G37 (US Spec Skyline coupe) would be produced for the 2009 model year. The convertible is not available in Japan., 33474=The Skyline was updated with quadruple headlights for 1958, and was again facelifted in February 1960.[6], 104642=The R30 range was facelifted in August 1983 with various changes across the board; for example four-wheel disc brakes were now standard issue, instead of being optional for lower-spec models. Trim specifications were revised and the 4-cylinder Z18S engine was replaced with the newer CA18E. Features included upgraded interior trim, new front and rear bumpers, door-mounted wing mirrors (replacing the old 'hockey stick' fender mirrors), and smoked tail lights., 165279=A Nissan Laurel C34 based wagon was released in September 1996, called the Stagea. It is widely regarded as a compatriot of the Skyline, rather than the Laurel it was based on, owing to drivetrain configurations—Commonly AWD using ATTESA ET-S. A common modification on the Stagea is to fit it with an R34 skyline front, in effect making an R34-lookalike wagon. A manual transmission was only available on the RS-Four and RS-Four V models. There was also an Autech tuned Stagea, the 260RS; released with full GT-R running gear, including an RB26DETT engine and manual transmission, a unique body kit, 17\" BBS style alloys, and GT-R instrumentation.[35], 131423=Jim Richards and Mark Skaife drove a Gibson Motor Sport prepared Skyline GTS-R to win the 1989 Sandown 500 in Australia. Richards also used the GTS-R in 6 of the 8 races to win the 1990 Australian Touring Car Championship (he used the R32 GT-R in the final two rounds of the series). It was Nissan's first ever Australian Touring Car Championship series win after finishing second in 1983 and 1986 (George Fury), and again in 1987 (Glenn Seton)., 6477=The Nissan Skyline (Japanese: 日産・スカイライン Nissan Sukairain) is a line of compact cars, sports cars and compact executive cars originally produced by the Prince Motor Company starting in 1955, and then by Nissan after the two companies merged in 1966. After the merger, the Skyline and its larger counterpart, the Nissan Gloria, were sold in Japan at dealership sales channels called Nissan Prince Shop., 115417=Fury was joined in 1987 Australian Touring Car Championship by Glenn Seton. While Fury had a frustrating first half of the championship, Seton would battle it out with the BMW M3 of Richards for the title. The series came down to the last race at Sydney's Oran Park Raceway where Richards used the nimble M3 to defeat Seton and win his second ATCC in three years. With Fury finishing third in the championship, this saw Nissan sharing victory with BMW in the 1987 Australian Manufacturers' Championship.[23] The final competitive race for the Peter Jackson Nissan DR30's came in the Group A support race for the 1987 Australian Grand Prix in Adelaide where Fury again finished second behind the Ford Sierra RS500 of Dick Johnson., 68293=The C10 raced against many cars including the Toyota Corona 1600GT (RT55), Isuzu Bellett GTR, Mazda Familia (R100) & Capella (RX-2) – even Porsche. In late 1971 the new Mazda RX-3 became the GT-R's main rival. The GT-R managed a few more victories before the RX-3 ended the GT-R's winning streak., 204829=The V35 broke with previous Skyline tradition. There was no straight-six engine, no turbo, and no GT-R, a decision which extended to all later Skylines. The intention had been for the model to use a different name, a decision reversed by Renault/Nissan CEO Carlos Ghosn.[47] who choose to gear the V35 towards the luxury-sport market. Billing the 350Z as a pure sports car, Nissan put a slightly more powerful VQ35DE in the 350Z, and while the Skyline and the 350Z shared the same platform, the 350Z had additional bracing, under-body aero parts, and weighed 100 kg less.[2] Some fans refer to V35 as the \"New Generation Skyline\" due to drastic changes between the V35 series and its R34 predecessor. Nonetheless, as of 1 July 2001 (two weeks after launch), total domestic Japanese Skyline orders had reached 4200 units.[48][49], 67809=The GT-R began as a sedan, but a 2-door coupé version was debuted in October 1970 and introduced in March 1971. The cars were stripped of unnecessary equipment to be as light as possible for racing, and performed well at the track. The sedan racked up 33 victories in less than two years, and the coupé stretched this to 50 through 1972.[12], 248256=The Coupe version is a limited (55 units) edition of Skyline 370GT coupe, commemorating 55th anniversary of Nissan Skyline. Changes are the same as the 55th Limited Edition Skyline Sedan. Covering 370GT Type P and 370GT Type SP, the Coupe version went on sale between February 10, 2012 and April 30, 2013.[95], 245835=The revised Skyline Sedan and Coupe went on sale on January 6, 2010.[90], 219249=It was first available only as a 4-door sedan in Japan and was also sold in the USA as the 2007 Infiniti G35., 155267=As of August 2014, the R32 Skyline GT-R is eligible for US import under the NHTSA \"25 year\" rule, that allows vehicles that are 25 years old (to the month) or older to be imported. These vehicles, due to their age do not have to comply with federal emissions or with Federal motor vehicle safety standards.[34], 174211=A limited edition model was created in 1996, called the NISMO 400R, that produced 400 hp (298 kW) from a road-tuned version of Nissan's Le Mans engine.[37] A stronger six-speed Getrag gearbox was used., 152527=The R32 GT-R was introduced into the Australian Touring Car Championship in 1990 and promptly ended the reign of the previously all-conquering Ford Sierra Cosworth, winning Bathurst 1000 classic in 1991 and 1992. This success led to the Australian motoring press nicknaming the car Godzilla due to it being a \"monster from Japan\". As Australia was the first export market for the car the name quickly spread. Such was GT-R's dominance that it was a significant factor in the demise of Group A Touring Car racing, the formula being scrapped soon after. JTCC was similarly blighted by the R32 GT-R, and splintered soon after, leading to the switch to the Supertouring category and also indirectly to the GT500 category of today., 255318=Nissan Motor Co., Ltd. and Minami Kanto Regional Office, Japan Post Network Co., Ltd. announced the sales of original frame stamps titled History of Cars \"Nissan (Skyline)\" (5000 units) and History of Cars \"Nissan (Electric Vehicles)\" (1000 units). The designs of these original frame stamps are based on Nissan's successive Skylines and electric vehicles. The frame stamps went on sale from February 1 to August 31, 2010.[99][100], 248678=A customized version of Skyline Sedan (with high intensity LEDs and S-tune items, wide, low-center-of-gravity optional parts) was unveiled in 2012 Tokyo Auto Salon.[96][97], 229189=As of October 16, 2007, sales of the Nissan Skyline coupe reached 1562 units.[69], 7583=Skylines are available in either coupé, or sedan body styles, plus station wagon, crossover, convertible and pickup/sedan delivery body styles. The later models are most commonly known by their trademark round brake and tail lights (as of 1972). While not distributed in the United States until its importation as the Infiniti G, the Skyline's prominence in video games, movies and magazines resulted in many such cars being imported there from 1989 to late 2005 via Motorex.[1] The majority of Skyline models are rear-wheel drive, with four-wheel drive being available since the eighth-generation's debut., 63491=In 1971, the KGC10 2000 GT-X received a 2.0 L (1,998 cc) L20 straight-six engine instead of the Prince G-7 engine. The chassis was already designed to fit a straight six, to avoid the S54 extension problem. 120 PS (88 kW) was available from this new engine. In March 1972 expanded the lineup to include a four-door GT-X sedan., 255984=King Records published Nissan Skyline CM collection, featuring a compilation of Nissan Skyline commercials.[101] As part of 55th anniversary of Nissan Skyline, a draw of 500 Skyline meets Eizin Suzuki 2013 calendars were distributed in December 2012.[102], 246794=The revised Skyline Sedan and Crossover went on sale on November 15, 2010.[91], 55502=The S50 Skyline was updated to become the S57 in August 1967.[8] It used a new engine of Prince's (designed before the merger with Nissan), the OHC 1.5 L (1483 cc) G15. At 88 PS (65 kW), it was the most-powerful engine in the Japanese 1500 cc class., 127527=The R31 Skyline of 1986 was a natural evolution on the R30 shape, and also this one was loosely based on the Laurel platform (C32). The design was slightly larger and squarer than previous Skylines. It was available as a Sedan, Hardtop sedan, Coupe and station wagon. Affectionately known as the \"Seventhsu\" or simply \"7th Sukairain\" by owners, due to it being the 7th-generation Skyline.}",
    "lastModified": "Wed, 29 Jul 2015 22:32:16 GMT",
    "textBeforeTable": "Body styles[edit] For 2004 both coupe and sedans were altered, with updated interiors and improved transmissions. The five-speed automatic transmission on the 350GT Premium now included synchro rev control, while the 6-speed manual transmission was made to vibrate less. For the sedan, the front grill/bumper, foot panel, head lamp, rear bumper, and rear combination lamps were changed. The front seats received active head rest, while the rear middle seat now have a three-point seat belt as standard. There were also some new wheels and a 19-inch option for the coupé. The Skyline's 2005 update again included changes to the head and rear lamps, front bumper, and side sill protectors. Also, 19-inch aluminium alloy wheel became standard for automatic transmission cars. A \"plasma cluster ion\" full air conditioner with left/right independent temperature settings, heated door mirrors, head lamp auto levelizer (compliant with new legislation) was made standard equipment. For 2003 the design of the radiator grille, headlamp inner panels, and sills were altered. The interior and mirrors were altered, while the suspension and braking systems were also refined. The Skyline Coupe was introduced as a version of Infiniti G35 Sport Coupe for Japanese market. Also, the Skyline 350GT went on sale. It is a version of the Infiniti G35 sport sedan with a six-speed manual transmission for the Japanese market, only available with the 3.5 litre engine. The Skyline 350GT and Skyline 350GT Premium sedan went on",
    "textAfterTable": "350GT Premium 2003–06 2003–07 V36/CV36/J50[edit] V36, CV36, J50 Overview Also called Infiniti G352007-2008 Infiniti G37 2009-2014 Infinti Q40. 2014- Infinti Q60 coupe Production 2006–2014 Assembly Tochigi, Tochigi, Japan Designer Hideo Komuro (2004); Shinichiro Irie (2005, 2007) Body and chassis Body style 4-door sedan 2-door coupe 5-door crossover SUV Layout Front engine, rear-wheel drive / all-wheel drive Platform Nissan FM platform Related Infiniti FX Infiniti M Nissan 350Z Infiniti G37 Infiniti EX Nissan 370Z Powertrain Engine 2.5 L VQ25HR V6",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}