{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19"
        ],
        [
            "Car Number",
            "1H",
            "72",
            "10",
            "55",
            "1J",
            "0z",
            "6.",
            "50",
            "M1",
            "27",
            "88",
            "6",
            "32",
            "36",
            "13",
            "31D",
            "63",
            "44",
            "83"
        ],
        [
            "Name",
            "Brian Heeney",
            "Dan Loughan",
            "Bud Perry",
            "Larry Wallace",
            "Jason Parish",
            "Chris Ozanich",
            "Perry Davenport",
            "Leroy Ellis",
            "Bill Butler",
            "Nyle Weiler",
            "Richard LaPratt",
            "Matthew Schindewolf",
            "Wayne Haughton",
            "Tom Williams",
            "Ken Buchner",
            "Trei Deubel",
            "Tim Easey",
            "Gilbert Little",
            "Maynard Bigelow Jr"
        ],
        [
            "Behind Leader",
            "",
            "0.184",
            "0.848",
            "1.055",
            "2.717",
            "3.289",
            "3.550",
            "3.726",
            "3.772",
            "4.001",
            "4.575",
            "5.609",
            "6.750",
            "6.763",
            "7.314",
            "7.421",
            "8.102",
            "--14 Laps--",
            "--34 Laps--"
        ],
        [
            "Gap",
            "",
            "0.184",
            "0.664",
            "0.207",
            "1.662",
            "0.572",
            "0.261",
            "0.176",
            "0.046",
            "0.229",
            "0.574",
            "1.034",
            "1.141",
            "0.013",
            "0.551",
            "0.107",
            "0.681",
            "--14 Laps--",
            "--20 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway Recap Aug 25, 2006",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/archives/2006/recap0825.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 223128267,
    "recordOffset": 223111327,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1291=With 2006 season championships less than one week away, the point battles in many of the regular divisions at the Spartan Speedway, could come down to the final night of racing. On September 1st, we crown the 2006 champions in all divisions. The racing at Spartan on August 25th, proved that the fight was far from over, as competitors vied for the win, knowing that a championship could be in their future. Eighteen Andrews Chevrolet Super Late Models timed in for their 40-lap feature, with John Dunivon sitting on top of the speed chart. Bob Bauer and Chris Place brought the field down to the green, but Place outran Bauer to the line, to lead lap one. Place, Bauer, and Jeff Hackworth ran one, two, and three, while Evan Barrett and Jimmy Gallagher rounded out the top five, with just four laps in. Gallagher had Tom Fedewa and Darrell Howard Jr. running side by side, right on his rear bumper. Place began to put some real estate between Bauer and himself, while Hackworth went to work on Bauer, trying to find a way around him. Barrett, Gallagher, and Fedewa continued to work on each other for position, when caution flew on lap 13 as Howard got into the front stretch wall. Place was able to run away again on the restart, with Fedewa and Gallagher running side by side behind Barrett. Gallagher got into Jon McNett on lap 21, bringing out the caution, sending Gallagher to the rear of the field for the restart. Caution flew again on lap 25 as John Ledwidge slowed on the track. A crash, on the restart, involving Hackworth, Fedewa, McNett, Barrett, and Gallagher definitely had an impact on the point chase, as Doug Finley, current point leader (by one point), made it through unscathed. Fedewa got the nod, and was sent to the rear of the field as a result of the caution. On the restart, Place was the man to beat, but it looked as though no one had anything for him. Hackworth continued to work on Bauer, sticking a fender underneath him, but Bauer would shut the door. Barrett and Finley sat in fourth and fifth, watching the battle unfold ahead of them. At the stripe, it was Place, Bauer, Hackworth, Barrett, and Finley. Ledwidge and Hackworth scored heat wins. Twenty WMMQ Classic Rock 94.9 MI Modifieds took to the track on CARQUEST night. Bud Perry set fast time with a 13.617, and as a result, was buried deep in the field for the start. Matt Schindewolf jumped out front on the start and led through lap seven, with Brian Heeney and Jason Parish breathing down his neck. Heeney and Parish got around Schindewolf on lap eight, as Perry Davenport and Dan Loughan went to work on Schindewolf. Shindewolf and Loughan were battling, as Perry crept into the top five from his 11th start position. Perry had plenty of company, as Davenport, Chris Ozanich, and Larry Wallace all wanted a piece of the action. Perry made his way under Parish on lap 18, with Loughan on the outside, to make it three-wide on the front stretch. Loughan had the upper hand though, and set his sights on Heeney, as Perry filed in behind Loughan for third. Wallace and Parish were sitting fourth and fifth behind Perry, as a spin brought out a much needed caution on lap 29. On the restart, it was Heeney, Loughan, and Perry, able to break away from the pack, with Wallace jumping into the mix on lap 32. At the checker, it was Heeney, Loughan, Perry, Wallace, and Parish. Wayne Haughton, Trei Deubel, and Perry won their heats. The Performance Automotive NW Street Stocks has had an up and down season, as far as car counts go, with only fourteen competitors timing in for their 25-lap feature. Jeremy Lutz and Al Williams brought the field down to the green flag, as Nate Moon charged to the front to lead lap one, as Bubber Patrick and Damon Place were making their way up through the field. With Moon running away, Place took over second from Patrick, as Corey Davis and Dane Long moved into the top five. Caution for Ron Heeney, gave Place the chance he needed, and on the restart, Place dove under Moon, at the line, to take away the top spot. As Place drove away from the field, Long made his way around Moon on lap nine. Davis ducked under Moon on lap 13, got caught behind a slower car, tried to get around the slower car, and got into Moon on the outside. Both spun, with Davis going to the rear. Jack Koone Jr. had begun his march up through the field, with Heeney right on his rear bumper. Long began to reel in Place, ever so slightly, as Koone went to work on Moon for third. The leaders entered slower traffic, but Long couldn?t catch Place, and at the line, it was Place, Long, Moon, Koone, Heeney. Moon and Heeney tallied heat wins. George Wyers scored his first feature win of the season in the Holiday Powersports Pony Stock division. Wyers jumped into the lead at the drop of the green, and never looked back, leading all 20 laps. Scott Quall was able to keep Wyers in his sights, as Brent McCort, John Ward, and Jimmy Scavarda battled further back in the pack. Ward made his way around McCort on lap 15, as Scavarda challenged for position on lap 16. Scavarda and Ward duked it out over the third spot, with Scavarda taking the spot away on lap nineteen. Scavarda also overtook Quall to finish second on lap 20. At the completion, it was Wyers, Scavarda, Quall, Ward, and Wayne Beckner Jr. Brian Beckner, Bob Fletcher, and Wyers took heat wins. Twenty, Auto Value Bumper to Bumper Series MI Legends zipped around the track, as Levi Rouster, Rick Kilbourn, and daughter, Krissy Kilbourn each ran 10 quick laps to score heat wins. Frank Jiovani was the man on a mission, as he jumped out to the lead on lap one and outran Ryan Meldrum for all 25 laps, to capture a feature win. Please join us as the 2006 season winds down, with Season Championships on Friday, Sept. 1st, the Harvest 250 on Sunday, Sept. 3rd, and No Rules Fun Night on Sept. 8th (which include School Bus Figure 8?s.) Check out the Spartan Speedway website a www.spartanspeedway.com for more details on gate prices and times. We?ll see you at the races!}",
    "textBeforeTable": "Andrews Chevrolet Super Late Models Qualifying Results By: Michelle Sprague With 2006 season championships less than one week away, the point battles in many of the regular divisions at the Spartan Speedway, could come down to the final night of racing. On September 1st, we crown the 2006 champions in all divisions. The racing at Spartan on August 25th, proved that the fight was far from over, as competitors vied for the win, knowing that a championship could be in their future. Eighteen Andrews Chevrolet Super Late Models timed in for their 40-lap feature, with John Dunivon sitting on top of the speed chart. Bob Bauer and Chris Place brought the field down to the green, but Place outran Bauer to the line, to lead lap one. Place, Bauer, and Jeff Hackworth ran one, two, and three, while Evan Barrett and Jimmy Gallagher rounded out the top five, with just four laps in. Gallagher had Tom Fedewa and Darrell Howard Jr. running side by side, right on his rear bumper. Place began to put some real estate between Bauer and himself, while Hackworth went to work on Bauer, trying to find a way around him. Barrett, Gallagher, and Fedewa continued to work on each other for position, when caution flew on lap 13 as Howard got into the front stretch wall. Place was",
    "textAfterTable": "0.762 14.009 18 01 Pat Dent 13.965 0.911 14.029 WMMQ 94.9 MMA Modifieds Pos Car Number Name Best Time Behind Leader 2nd Best Time 1 10 Bud Perry 13.617 -.--- 13.643 2 55 Larry Wallace 13.702 0.085 13.762 3 50 Leroy Ellis 13.732 0.115 13.789 4 27 Nyle Weiler 13.755 0.138 13.858 5 72 Dan Loughan 13.769 0.152 13.835 6 0z Chris Ozanich 13.835 0.218 13.918 7",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}