{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Security presence on campus 24 hours. I feel safe as I travel back and forth on campus at any hour. Across the street from campus is private housing separate from campus but there is known to be police matters like robberies of delivery men in the harbors.",
            "A focal point on campus is Greek Life. I just went through the membership intake proccess for a sorority on campus.",
            "Business marketing club, Sororities & Fraternities, Chaplain, amongst so many more.",
            "Students looking for small campus atmosphere and a variety of course offerings and majors to choose from. My current roomate is a pharmacy major which seems to be a very intersting field of study which can lead to employment after greaduation",
            "There are many social events and local parties. Also I enjoy the Church service on campus ... they have a a great music ministry.",
            "I find great enjoyment in partiicipating in my sorority activites. This past semester I went through the membeship intake process. I have formed great friendships with many new people and become much more active in campus activities",
            "The food was good at times but I believe it was laced with laxatives as I always needed to use the bathroom immediately following my meal. We currently have a beautiful cafeteria with large widows looking out to the water and the food has improved. We have a salad bar which is ample with variety. They tend to serve soul food like fried chicken and waffles on Sundays.",
            "Dorm life is not the greatest. You will have a roomate and many of the rooms are small. The bathroom facilities leave a lot to be desired. We recently got washer and dryers in some of the dorms. When I was on campus I had to schlep all my laundry across campus. No personal automobiles allowed freshman and sophomore years.",
            "The academics are challenging especially when you first arrive. The required courses require a great deal of work reading and writing and some courses are more tests.",
            "I would strongly suggest you come prepared in your Freshman year to really focus and work hard on the required courses completion. The social life will always be there donn't over do it. I have seen too many students not make it after the first two semesters because they were partying too hard.",
            "Hampton is HBCU and is located on a small campus near the virginia coast. My experience has been positive as there are many activities to get involved in but you have to get out and seek participation. Sorority and Fraternity life is a focal point and I recently became a member of a sorority."
        ]
    ],
    "pageTitle": "Hampton University (Hampton) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Hampton-University/reviews?_escaped_fragment_=/show/11932",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903500399,
    "recordOffset": 903385305,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1882=I enjoy the campus life. We call it our home by the sea. The xampus is very pretty. It is also filled with excitement and activities. For example, our student center containts a bowling alley, movie theatre, pool room, fitness room and a dance room. Every Friday there ie a 12:00 to 2:00. There is a dj and other activities during that time. There are sometimes concerts and comedy shows to attend. Trey Songs performed at Ogden Hall last year. Marlyn Wayans also came to campus to talk to us about the Obama election., 244600=Hampton does not currently have all of the divine nine fraternities and sororities on campus. As of Spring 2012, Alpha Phi Alpha, Delta Sigma Theta, and Phi Beta Sigma are not present on campus. There are also band, music, and social fraternities on campus. Every Greek letter organization is given a week to promote their fraternity or sorority., 265756=The food and cafeteria was not bad just difficult to get used to. The cafe opened and closed at designated times. It forced you to change your eating habits but change is good. Hampton University is opening a new cafeteria in September, I am excited to eat there., 109406=I love my HIU! Nobody has school spirit like Hampton. Due to the school being so small students band together and support each other with free promo, flyers, and social networks, should've seen us cheer for our fellow Hamptonian Olympian this 2012 summer!!, 450132=Hampton University has Chick Fila, Subway, and a coffee shoppe. HU also has small dining areas on campus. Our newest dining facility opened in 2012 and offers a spectacular view of the bay. The cafeteria food is on the come up, but beware of the freshman 15, I have seen it happen!!, 59745=the cafeteria at hampton u is very popular, but not because the food is good. many students complain about how bad the food is, spoiled food, not enough options, and poor quality. although the cafeteria is known to have horrible food, the administration is well aware and started a building fund to build an new cafeteria. they have started building and the estimated year of completion will be the year of 2014. hopefully, from the looks of the building as of right now, it seems that the building may be done by 2013. we are all waiting!, 427139=When I began HU Online tuition was fair. To date it has increased by less than $1000 overall., 141555=The food is pretty good. Our new cafeteria just opened up in august of 2012 which was definitely a step up. We also have small fast food places around campus where you can eat from too. So we have a small variety., 267433=Hampton University will be your home by the sea. Prospective Students make sure you apply before November 1st to be eligible for scholarships. During high school, keep your grades high and always try to enhance your learning experience in every situation. Hampton University has taught me to have the competitive edge and to be the best I can be., 584399=© 2015, Cappex.com, LLC, 514010=The campus is near many Navy bases. A tradition at Hampton is our class names. Each class (freshman, sophomores, juniors and seniors) each have class name and it gets passed down form the senior class to the new incoming freshman. For example 2013-2014's senior class is titled Onyx 9 and the fresh.man class is Onyx 10, 518388=Campus police are always walking or driving around campus. There are also call boxes all over campus just in case you are in trouble or you just want a police officer to walk you back to your dorm. Also, no one gets on campus without showing ID and going through a sercurity gate. This a really safe campus, I feel fine walking somewhere at night. Also all of the dorm doors lock after 11:00 pm and require students to swipe their student ID to get in, however if the student does not live in the dorm, the door will not unlock with their student ID., 155837=1. Do your research- There are merit base scholarships for incoming freshmen ranging from partial to full rides based on SAT/ACT scores and your GPA. Applicants must apply to Hampton before Nov 1 to be considered for these scholarships. 2. Visit- Hampton is a beautiful campus. If you are considering attending, schedule a campus tour., 272386=there is a small gap in the greek life but the whole yard is supposed to be back on campus in Fall 2012, 199389=the student center is the place to be on wednesdays and fridays from noon to 2:00 pm. the students on campus know it as 12 to 2, there is always a dj spinning, fraternities and sororities strolling, and people just having a good time dancing to the music. if you want to lay back and relax with your significant other, spend time at the waterfront which is a beautiful view of the sea., 547941=Hampton has partnered with a great dining team, the Gourmet Services company that serves a variety of items and even spices things up by having themes depending on the holiday or event. We also have a cafeteria that opened its doors in 2012 and it has a grand waterfront view, with a view of downtown Hampton as well., 267963=Hampton University a diverse Historically Black University with endless opportunities. It became my home by the sea the minute I stepped foot on my beautiful campus. I am very please and honored to get my degree from this prestigious university in May 2013., 325451=There's a new cafe, so I'm not sure if anything has changed... but when I was there (2005-2009), the best things were the waffles and the sandwich bar., 549627=Hampton University is a rich part of Virginian history and culture. Hampton is historically Black and Native American. Founded in 1868, Hampton is the perfect mix of tradition, discipline, and endless opportunity.}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 64 out of 65 people found this review useful. 1 of 124 Asia from Winterville, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Did learn a lot Class sizes as far as the number of students is concerned are small. Which leaves plenty of room for a more interactive classroom experience as well as giving the student an opportunity for a one-on-one relationship with their teachers/professors. Students are treated as more than just a number in the grade book, teachers take pride in their work and make you (the student) their number 1 priority. Login to rate or flag the reviews Isaiah from Clementon, NJ 06/03/2009 Reviewer is A current student here. 18 out of 25 people found this review useful. 3 of 124 Categories Comments Tips for prospective students When you arrive, do not get distracted in the pleasures of being in college. Focus on your academics right away so you can be able to enjoy school. Login to rate or flag the reviews Nikkia from Lithonia, GA",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}