{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I couldnt feel safer.They're police cars every where you look!",
            "this school is great for all types of student.Theyhelp you get a g.e.d if needed and theres lots of support.",
            "the school has a weird looking oragami type bird figure out front. its truly unique.",
            "My advice would be to start everything early. get as much as you can done as soon as you possibly can. ex. student i.d,enrollment, financial aid etc...",
            "So far I really enjoy this school.I attented a 3day orientation and recieved alot of great information.This is truly the school for me."
        ]
    ],
    "pageTitle": "Los Angeles Trade Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Los-Angeles-Trade-Technical-College/reviews?_escaped_fragment_=/show/32872",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916885267,
    "recordOffset": 916850838,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{157380=© 2015, Cappex.com, LLC, 103789=the 2013 spring semester will be my first semester attending trade tech college}",
    "textBeforeTable": "08/07/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 42 Latrice from Los Angeles, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "What to do for fun The is nothing to do for fun but study Food and Dining Wonder cafe, they have good food. Everything is cooked my students in the culinary arts department. Also, after 4pm everything is half off, which is not bad. Dorm Life I do not live on campus Academic Rigor Excellent just make sure you used ratemyprofessor.com Tips for prospective students Do you research before attending. Make sure you have the time that is needed to become a student. Always see a counselor. In three sentences LATTC is a great school for those who are serious about obtaining an education. I have come a long way and I would recommend is college to all my family and friends. Login to rate or flag the reviews Natasha from Los Angeles, CA 08/16/2012 Reviewer is A current student here. 1 out of 1 people found this review useful.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}