{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "You will ALWAYS be able to spot campus security. Will the unnecessarily bother you? NOT AT ALL. They are cool and make the campus safer, they are constantly on patrol and when their services are needed they take their security job as serious as a police officer would.",
            "Every class will be associated with a club. Chemistry class you will be in chem club, for MEd lab tech students you are apart of MLT club ect.",
            "There is something for everyone. There are are shows, theaters, intramural sports and just the general social life amon the students on campus.",
            "Since there are no dorms there is no meal plan so food is out of pocket costs. But there are places to eat in the area.",
            "SUNY Orange doesn't not have a dorm just yet, but there has been some talk about getting some. If there are dorms in the near future it is DEFINITELY the ideal college life.",
            "The professors are SERIOUS about their jobs and they expect all students to give it their best shot.",
            "Going to SUNY Orange is great for those wanting to build your GPA to transfer and possibly even get scholarships to local and out of state four year colleges and universities. It is actually even smarter to do so if you aren't sure if what you chose is right for you. I suggest that prospective students really take a look into requirements for the BA degree then look into SUNY Orange to see what can get done for a lot cheaper.",
            "SUNY Orange is a school that is working to become recognized among the state as one of the top schools. The Health profession programs are outstanding and the instructors work to make sure each student is understanding course materials. It is a school I personally recommend to parents while on the job for their upcoming high school graduates as well as those in professional settings."
        ]
    ],
    "pageTitle": "Orange County Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Orange-County-Community-College/reviews?_escaped_fragment_=/show/109383",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913231471,
    "recordOffset": 913196918,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24945=Some tips for students that would like to apply here are aplly early to get a head start on forming your schedule before school starts in September. Always be prepared for class this shows the professor you want to learn. Try not to fail a course , if you feel like you will not pass drop the course before you earn a failing grade. Lastly, if your are having trouble grasping the material in the course there are tutors offered at the College., 46020=I will be a student as of August 27, 2012 and so far, they have helped me with my financial aid and they are friendly., 27758=This an excellent school where I got so much support and free tutoring. The teachers are personable and I learned so much. I graduated 2010., 122540=© 2015, Cappex.com, LLC, 52417=$2100 a semester for a full time student is far cheaper than any four year school and all credits passed with a C or above transfer within the Suny system., 1554=This is a two-year college that offers the same level of education as many four-year schools. The tuition for residents of Orange County, as of 2010, was approximately $2062. For non-residents, it was about $4124, but neither of these include books.}",
    "textBeforeTable": "10/15/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 31 Britney from Middletown, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Campus Safety Never had an instance where there was a threat Greek Life None whats so ever its a community college Great for these types of students Any type of student general ones who want to stay close to home or are being thifty when it comes to looking for the cheapest way to an education Bang for the buck Very cost-effective. Has a bridge program with many schools in the NY area What to do for fun Join clubs they tend to go on trips and do fundraisers Tips for prospective students Make sure to stay on top of your advisors about what classes you should take towards your major or you'll end up being there longer than expected In three sentences Overall good school very tough nursing program but molded towards engineering. Login to rate or flag the reviews Zachary from Middletown, NY 01/06/2012 Reviewer is A current student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}