{
    "relation": [
        [
            "Control(s)",
            "NS applies to “technology” for equipment controlled by 2A001, 2B001 to 2B009",
            "MT applies to “technology” for equipment controlled by 2B004, 2B009, 2B018, 2B104, 2B105, 2B109, 2B116, 2B117, or 2B119 to 2B122 for MT reasons",
            "NP applies to “technology” for equipment controlled by 2A225, 2A226, 2B001, 2B004, 2B006, 2B007, 2B009, 2B104, 2B109, 2B116, 2B201, 2B204, 2B206, 2B207, 2B209, 2B225 to 2B233 for NP reasons",
            "NP applies to “technology” for equipment controlled by 2A290 to 2A293, 2B290 for NP reasons",
            "CB applies to “technology” for equipment controlled by 2B350 to 2B352 and for valves controlled by 2A226 or 2A292 having the characteristics of those controlled by 2B350.g",
            "AT applies to entire entry"
        ],
        [
            "Country Chart (See Supp. No. 1 to part 738)",
            "NS Column 1.",
            "MT Column 1.",
            "NP Column 1.",
            "NP Column 2.",
            "CB Column 2.",
            "AT Column 1."
        ]
    ],
    "pageTitle": "eCFR — Code of Federal Regulations",
    "title": "",
    "url": "http://www.ecfr.gov/cgi-bin/retrieveECFR?gp=&n=15y2.1.3.4.45&r=PART&ty=HTML",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990609.0/warc/CC-MAIN-20150728002310-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433436319,
    "recordOffset": 433279811,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{678819=7. For the purpose of 2B, the measurement of axes shall be made according to test procedures in 5.3.2. of ISO 230-2:2014. Tests for axes longer than 2 meters shall be made over 2 m segments. Axes longer than 4 m require multiple tests (e.g., two tests for axes longer than 4 m and up to 8 m, three tests for axes longer than 8 m and up to 12 m), each over 2 m segments and distributed in equal intervals over the axis length. Test segments are equally spaced along the full axis length, with any excess length equally divided at the beginning, in between, and at the end of the test segments. The smallest “unidirectional positioning repeatability”-value of all test segments is to be reported., 1081233=LVS: $1500 for 3A611.a, .d through .h and .x; N/A for ECCN 3A611.c., 19908=Related Controls: (1) See also 0A979, 0A988, and 22 CFR 121.1 Categories I(a), III(b-d), and X(a). (2) See ECCN 0A617.y.1 and .y.2 for items formerly controlled by ECCN 0A018.a. (3) See ECCN 1A613.c for military helmets providing less than NIJ Type IV protection and ECCN 1A613.y.1 for conventional military steel helmets that, immediately prior to July 1, 2014, were classified under 0A018.d and 0A988. (4) See 22 CFR 121.1 Category X(a)(5) and (a)(6) for controls on other military helmets., 692902=2B003   “Numerically controlled” or “manual machine tools”, and “specially designed” “components”, “controls” and “accessories” therefor, “specially designed” for the “shaving”, “finishing”, “grinding or honing of hardened (Rc = 40 or more) ” “spur”, helical and double-helical gears with a pitch diameter exceeding 1,250 mm and a face width of 15% of pitch diameter or larger finished to a quality of AGMA 14 or better (equivalent to ISO 1328 class 3)., 460205=d.19. (C.A.S. #1313-82-2) Sodium sulfide;, 444667=Related Controls: (1) See also 1C107. (2) Graphite having a purity level of less than 5 parts per million “boron equivalent” as measured according to ASTM standard C-1233-98 and intended for use in a nuclear reactor is subject to the export licensing authority of the Nuclear Regulatory Commission (see 10 CFR part 110)., 592142=c.1.c.1. Zirconia (CAS 1314-23-4) with an average particle size equal to or less than 1 µm and no more than 10% of the particles larger than 5 µm; or, 678565=6. For the purpose of 2B, measurement uncertainty for the “unidirectional positioning repeatability” of machine tools, as defined in the International Standard ISO 230-2:2014, shall not be considered., 327508=b.2. Remaining in the “superconductive” state at a temperature of 4.2 K (−268.96 °C) when exposed to a magnetic field oriented in any direction perpendicular to the longitudinal axis of conductor and corresponding to a magnetic induction of 12 T with critical current density exceeding 1750 A/mm2 on overall cross-section of the conductor., 331878=3. ‘Viscosity index’ is determined using the method described in ASTM D-2270 or national equivalents;, 586087=Related Controls: (1) Also see ECCNs 1E101, 1E201, and 1E202. (2) See ECCN 1E608 for “technology” for items classified under ECCN 1B608 or 1C608 that, immediately prior to July 1, 2014, were classified under ECCN 1B018.a or 1C018.b through .m (note that ECCN 1E001 controls “development” and “production” “technology” for chlorine trifluoride controlled by ECCN 1C111.a.3.f—see ECCN 1E101 for controls on “use” “technology” for chlorine trifluoride). (3) See ECCN 1E002.g for control libraries (parametric technical databases) “specially designed” or modified to enable equipment to perform the functions of equipment controlled under ECCN 1A004.c (Nuclear, biological and chemical (NBC) detection systems) or ECCN 1A004.d (Equipment for detecting or identifying explosives residues). (4) “Technology” for lithium isotope separation (see related ECCN 1B233) and “technology” for items described in ECCN 1C012 are subject to the export licensing authority of the Department of Energy (see 10 CFR Part 810). (5) “Technology” for items described in ECCN 1A102 is “subject to the ITAR” (see 22 CFR Parts 120 through 130)., 16641=[78 FR 61903, Oct. 4, 2013, as amended at 79 FR 32627, June 5, 2014], 21618=c. Muzzle loading (black powder) firearms with a caliber less than 20 mm that were manufactured later than 1937 and that are not reproductions of firearms manufactured earlier than 1890;, 361199=No items currently are in this ECCN. (1) See ECCN 1C608.b. through .m for items that, immediately prior to July 1, 2014 were classified under 1C018.b through .m. (2) See ECCNs 1C011, 1C111, and 1C239 for additional controlled energetic materials, including chlorine trifluoride (ClF3), which is controlled under ECCN 1C111.a.3.f. (3) See ECCN 1A008 for shaped charges, detonating cord, and cutters and severing tools., 459128=d.1. (C.A.S. #1341-49-7) Ammonium hydrogen fluoride;, 12408=(b) ECCN cross-references for items subject to exclusive jurisdiction of another agency. (1) Prior to October 15, 2013, the CCL contained certain ECCNs that were only included as cross references to items subject to the export control regulations administered by the Nuclear Regulatory Commission., 560330=Related Controls: See ECCN 1D608 for “software” for items classified under ECCN 1B608 that, immediately prior to July 1, 2014, were classified under 1B018.a., 309900=b. Materials for absorbing frequencies exceeding 1.5 × 1014 Hz but less than 3.7 × 1014 Hz and not transparent to visible light;, 11072=Source: 61 FR 12937, Mar. 25, 1996, unless otherwise noted., 701403=LVS: $1000, 1002480=b.5. Electronically or magnetically tunable band-pass or band-stop filters, having more than 5 tunable resonators capable of tuning across a 1.5:1 frequency band (fmax/fmin) in less than 10 µs and having any of the following:, 332102=Twenty ml of the fluid under test is placed in a 46 ml type 317 stainless steel chamber containing one each of 12.5 mm (nominal) diameter balls of M-10 tool steel, 52100 steel and naval bronze (60% Cu, 39% Zn, 0.75% Sn);, 7927=e-CFR data is current as of July 31, 2015, 445055=Related Definitions: For the purpose of this entry, graphite with a purity level better than 5 parts per million boron equivalent is determined according to ASTM standard C1233-98. In applying ASTM standard C1233-98, the boron equivalence of the element carbon is not included in the boron equivalence calculation, since carbon is not considered an impurity., 387508=a.1. Containing 17.0-23.0 weight percent chromium and 4.5-7.0 weight percent nickel;, 12759=(2) ECCNs formerly listed on the CCL that, as of October 15, 2013 were subject to the export licensing authority of the Nuclear Regulatory Commission at 10 CFR part 110 are: 0A001, 0B001, 0B002, 0B003, 0B004, 0B005, 0B006, 0C001, 0C002, 0C004, 0C005, 0C006, 0C201 and 1C012., 1122409=LVS: $1500., 460034=d.16. (C.A.S. #1333-83-1) Sodium bifluoride;, 457016=b.12. (C.A.S. #1498-40-4) Ethyl phosphonous dichloride [Ethyl phosphinyl dichloride];, 629437=a. HMX (Cyclotetramethylenetetranitramine, octahydro-1,3,5,7-tetranitro-1,3,5,7-tetrazine, 1,3,5,7-tetranitro-1,3,5,7-tetraza-cyclooctane, octogen or octogene) (CAS 2691-41-0);, 977581=a.1.c. A fluence (integrated flux) of neutrons (1 MeV equivalent) of 5 × 1013 n/cm2 or higher on silicon, or its equivalent for other materials;, 846338=Technical Note: The bidirectional slide positioning repeatability (R) of an axis is the maximum value of the repeatability of positioning at any position along or around the axis determined using the procedure and under the conditions specified in part 2.11 of ISO 230/2: 1988., 215194=d.1. Soft body armor and protective garments manufactured to military standards or specifications, or to their equivalents, that provide ballistic protection equal to or less than NIJ level III (NIJ 0101.06, July 2008); or, 376938=d.5. Trimethylhydrazine (C.A.S. # 1741-01-1);, 240666=Related Controls: See ECCN 1B608.a, .b, and .x for items that, immediately prior to July 1, 2014, were classified under 1B018.a., 174287=a.4.b. [(2-chlorophenyl) methylene] propanedinitrile, (o-Chlorobenzylidenemalononitrile) (CS) (CAS 2698-41-1);, 457216=b.14. (C.A.S. #1066-50-8) Ethyl phosphonyl dichloride;, 472044=b.1. Reconstructed replication competent forms of the 1918 pandemic influenza virus containing any portion of the coding regions of all eight gene segments;, 34343=b.1.a. Manufactured or fitted with materials or “components” other than reactive or electromagnetic armor to provide ballistic protection to level III (National Institute of Justice standard 0108.01, September 1985) or better;, 504443=LVS: $1500, 632018=b. ADHTDN (4-amino-3,5-dihydrazino-1,2,4-triazole dinitramide) (CAS 1614-08-0);, 181417=b. Hard body armor plates that provide ballistic protection less than NIJ level III (NIJ 0101.06, July 2008) or national equivalents., 343956=2. The 'glass transition temperature (Tg)' for 1C008.a.2 thermosetting materials and 1C008.a.3 materials is determined using the 3-point bend method described in ASTM D 7028-07 or equivalent national standard. The test is to be performed using a dry test specimen which has attained a minimum of 90% degree of cure as specified by ASTM E 2160-04 or equivalent national standard, and was cured using the combination of standard- and post-cure processes that yield the highest Tg., 387693=a.3. A ferritic-austenitic microstructure (also referred to as a two-phase microstructure) of which at least 10 percent is austenite by volume (according to ASTM E-1181-87 or national equivalents), and, 676457=3. Axis nomenclature shall be in accordance with International Standard ISO 841:2001, Industrial automation systems and integration—Numerical control of machines—Coordinate system and motion nomenclature., 450667=e. Annual report requirement. The exporter is required to submit an annual written report for shipments of samples made under this Note 1. The report must be on company letterhead stationery (titled “Report of Sample Shipments of Chemical Precursors” at the top of the first page) and identify the chemical(s), Chemical Abstract Service Registry (C.A.S.) number(s), quantity(ies), the ultimate consignee's name and address, and the date of export for all sample shipments that were made during the previous calendar year. The report must be submitted no later than February 28 of the year following the calendar year in which the sample shipments were made, to: U.S. Department of Commerce, Bureau of Industry and Security, 14th Street and Pennsylvania Ave. NW., Room 2099B, Washington, DC 20230, Attn: “Report of Sample Shipments of Chemical Precursors.”, 307570=Items: a. Materials for absorbing frequencies exceeding 2×108 Hz but less than 3×1012 Hz., 215631=d.2. Hard body armor plates that provide ballistic protection equal to NIJ level III (NIJ 0101.06, July 2008) or national equivalents., 339765=f.1. Al2O3 (CAS 1344-28-1); or, 620103=b. “Technology” “required” for the “development” or “production” of nitrocellulose with nitrogen content over 12.6% and at rates greater than 2000 pounds per hour., 10376=Authority: 50 U.S.C. app. 2401 et seq.; 50 U.S.C. 1701 et seq.; 10 U.S.C. 7420; 10 U.S.C. 7430(e); 22 U.S.C. 287c, 22 U.S.C. 3201 et seq.; 22 U.S.C. 6004; 30 U.S.C. 185(s), 185(u); 42 U.S.C. 2139a; 42 U.S.C. 6212; 43 U.S.C. 1354; 15 U.S.C. 1824a; 50 U.S.C. app. 5; 22 U.S.C. 7201 et seq.; 22 U.S.C. 7210; E.O. 13026, 61 FR 58767, 3 CFR, 1996 Comp., p. 228; E.O. 13222, 66 FR 44025, 3 CFR, 2001 Comp., p. 783; Notice of August 7, 2014, 79 FR 46959 (August 11, 2014)., 457441=b.19. (C.A.S. #1619-34-7) 3-Quinuclidinol;, 628856=7. DATB (diaminotrinitrobenzene) (CAS 1630-08-6);, 79481=No items currently are in this ECCN. See ECCN 1A613.y.1 for conventional steel helmets that, immediately prior to July 1, 2014, were classified under 0A988., 348861=LVS: $1500, N/A for NP, 30313=LVS: $1500, 620281=c. “Technology” “required” for the “development” or “production” of nitrate esters (e.g., nitroglycerine) at rates greater than 2000 pounds per hour., 343597=Technical Notes: 1. The 'glass transition temperature (Tg)' for 1C008.a.2 thermoplastic materials and 1C008.a.4 materials is determined using the method described in ISO 11357-2 (1999) or national equivalents, 35178=b.2.b. Providing ballistic protection to level III (National Institute of Justice standard 0108.01, September 1985) or better., 459682=d.10. (C.A.S. #1314-80-3) Phosphorus pentasulfide;, 822762=j. Incinerators designed to destroy chemical warfare agents, chemical weapons precursors controlled by 1C350, or chemical munitions having “specially designed” waste supply systems, special handling facilities and an average combustion chamber temperature greater than 1000 °C in which all surfaces in the waste supply system that come into direct contact with the waste products are made from or lined with any of the following materials:, 179681=License Requirements Notes: 1. Soft body armor not manufactured to military standards or specifications must provide ballistic protection equal to or less than NIJ level III (NIJ 0101.06, July 2008) to be controlled under 1A005.a. 2. For purposes of 1A005.a, military standards and specifications include, at a minimum, specifications for fragmentation protection., 356563=Technical Note: The ‘Dynamic Mechanical Analysis glass transition temperature (DMA Tg)’ for materials controlled by 1C010.e is determined using the method described in ASTM D 7028-07, or equivalent national standard, on a dry test specimen. In the case of thermoset materials, degree of cure of a dry test specimen shall be a minimum of 90% as defined by ASTM E 2160 04 or equivalent national standard., 456472=b.5. (C.A.S. #2404-03-7) Diethyl-N,N-dimethylphosphoroamidate;, 32070=Note 1 to paragraph .a: For purposes of paragraph .a, “ground vehicles” include (i) tanks and armored vehicles manufactured prior to 1956 that have not been modified since 1955 and that do not contain a functional weapon or a weapon capable of becoming functional through repair; (ii) military railway trains except those that are armed or are “specially designed” to launch missiles; (iii) unarmored military recovery and other support vehicles; (iv) unarmored, unarmed vehicles with mounts or hard points for firearms of .50 caliber or less; and (v) trailers “specially designed” for use with other ground vehicles enumerated in USML Category VII or ECCN 0A606.a, and not separately enumerated or otherwise described in USML Category VII. For purposes of this note, the term “modified” does not include incorporation of safety features required by law, cosmetic changes (e.g., different paint or repositioning of bolt holes) or addition of “parts” or “components” available prior to 1956., 460396=d.22. (C.A.S. #2465-65-8) O,O-diethyl phosphorothioate;, 677156=5.b. Measure the linear axis repeatability (R↑,R↓) according to ISO 230-2:2014 and evaluate “unidirectional positioning repeatability” for each axis of each of the five machines;, 372486=a.1. Spherical or spheroidal aluminum powder (C.A.S. 7429-90-5) in particle size of less than 200 × 10−6 m (200 µm) and an aluminum content of 97% by weight or more, if at least 10 percent of the total weight is made up of particles of less than 63 µm, according to ISO 2591-1:1988 or national equivalents., 804324=b. Capable of a pressure ratio of 2:1 or greater; and, 13223=Note to paragraph (b): ECCNs 0D001 and 0E001 are “subject to the ITAR” (see 22 CFR parts 120 through 130). These ECCNs are retained on the CCL as cross references to the ITAR, although the former cross references to export licensing authority of the Nuclear Regulatory Commission (see 10 CFR part 110) for ECCN 0D001, and to the Department of Energy (see 10 CFR part 810) for 0E001 were removed from the Control(s) paragraph in the License Requirements section of these two ECCNs and added as a more general jurisdictional cross reference in a heading note added to these two ECCNs as of June 5, 2014.}",
    "textBeforeTable": "Reason for Control: NS, AT, UN License Requirements 0A018   Items on the Wassenaar Munitions List (see List of Items Controlled). 0A002   Power generating or propulsion equipment “specially designed” for use with space, marine or mobile “nuclear reactors”. (These items are “subject to the ITAR.” See 22 CFR parts 120 through 130.) A. “End Items,” “Equipment,” “Accessories,” “Attachments,” “Parts,” “Components,” and “Systems” Category 0—Nuclear Materials, Facilities, and Equipment [and Miscellaneous Items] Supplement No. 1 to Part 774—The Commerce Control List Back to Top §774.2   [Reserved] Back to Top [78 FR 61903, Oct. 4, 2013, as amended at 79 FR 32627, June 5, 2014] (2) Use of single quotes. The CCL also includes a convention regarding the use of single quotes. Single quotes on the CCL identify a term as a defined term in the context of a particular ECCN. This convention also applies to the use of single quotes within the Definition of Terms section under part 772. (1) Use of double quotes. If a term on the CCL uses double quotes it means there is a defined term in part 772. However, the absence of double quotes does not mean that a term used on the CCL is not defined in part 772. Because the CCL includes many terms that",
    "textAfterTable": "b. “Specially designed” components and parts for ammunition, except cartridge cases, powder bags, bullets, jackets, cores, shells, projectiles, boosters, fuses and components, primers, and other detonating devices and ammunition belting and linking machines (all of which are “subject to the ITAR.” (See 22 CFR parts 120 through 130); Note: 0A018.b does not apply to “components” “specially designed” for blank or dummy ammunition as follows: a. Ammunition crimped without a projectile (blank star); b. Dummy ammunition with a pierced powder chamber; c. Other blank and dummy ammunition, not incorporating components designed for live ammunition. c. Muzzle loading (black powder) firearms with a caliber less than 20 mm that were manufactured later than 1937 and that are not reproductions of firearms manufactured earlier than 1890; Note: 0A018.c does not control weapons used for hunting or sporting purposes that were not “specially designed” for military use and are not of the fully automatic type, but see ECCN 0A984 concerning shotguns. d. [Reserved] 0A521   Any commodity subject to the EAR that is not listed elsewhere in the CCL, but which is controlled for export because it provides at least a significant military or intelligence advantage to the United States or for foreign policy reasons. 0A521 commodities are subject to RS1 controls with no license exception eligibility other than License Exception GOV for U.S. Government personnel and agencies under §740.11(b)(2)(ii) of the EAR, or an item-specific license exception identified in Supplement No. 5",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}