{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus safety is superb with security guards on duty around the clock and available for rides or assistance in disturbances. There are also multiple phones stationed around campus that can be used if you feel you are in danger and need to call security or need a ride. The campus is always lit up especially since it is smaller and the security guards do routine checks of dorm rooms making sure students are locking their doors and if they aren't they receive a red note advising them to do so.",
            "Wartburg is notorious for their clubs. There are too many to count but I am a member of the Chemistry club, the Diversity and Inclusion Program, and am a member of the Wartburg Track and Field Program. For what ever interests you may have, Wartburg most likely has a club for it and if we don't, the college is more than happy to students starting new clubs as long as there are enough members.",
            "An unusual tradition at Wartburg is called Outfly. This is a day on campus where all students are woken up at 5 AM, told to come out to the bell in the middle of campus, and if enough students show up to the bell, classes are cancelled for the day. Since classes are cancelled, the teachers serve everyone breakfast at 6 and then there are a bunch of activities throughout the day offering the chance to win cool prizes.",
            "There are tons of groups on campus to get students involved and to meet people who have similar interests as yourself. Activities such as concerts, game nights, ventriloquists, etc are always being put on to entertain the student body. A bowling alley and movie theatre are also located in town near Wartburg College so quite a few students can be found visiting these two establishments on the weekend.",
            "There are four places to eat on campus allowing a variety of different foods but the main dining facility is called the Mensa. The meals are on a rotation in the Mensa so it gets old after awhile but the food is rather good. There are multiple stations in the Mensa like taco bar, salad bar, Chinese stand, home-cooked meals, the grill, and the vegetarian bar.",
            "The dorms are very hospitable, nice size, have decent storage space, and are equipped with two beds, desks, and dressers. Coed and Non-coed dorms are available depending on your preference and after your first year is complete you have the opportunity to apply for housing in any of the other non freshman dorms which allow anywhere from 4-8 people rooming together which means more living space. The dorms are also cleaned regularly such as the bathrooms and hallways so they are decently clean.",
            "Wartburg is a very prestigious college with some of the most rigorous courses in the nation such as Biology as I mentioned before. The small class sizes allow for a more one-on-one relationship with the professor and less distractions. Wartburg has high placement ratings for graduate school in various areas/majors and nearly all Wartburg students receive job opportunities right after graduation.",
            "Wartburg College is all about helping students out and making it easier on us. Professors and faculty are more than happy offering advice, answering questions, and helping with the overall college process. There is also an organization on Wartburg Campus called Pathways that assists in the college process such as what classes to take, helping you decide where your future is taking you, and developing a plan in how to get there.",
            "Wartburg College has a great atmosphere for it's students with lots of groups, clubs, and activities available to get students involved. This school has great academics as well especially if you are a Biology major since they have one of the toughest Biology programs in the nation. The one negative about Wartburg is the price of tuition to attend here."
        ]
    ],
    "pageTitle": "Wartburg College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wartburg-College/reviews?_escaped_fragment_=/show/2935",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00132-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914813123,
    "recordOffset": 914768140,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{146242=Outfly is an unusual campus tradition we have, but it's the best. The President and the Student Body President pick a day out of the fall semester where classes are cancelled for the day. There is a theme picked and at 6:30 in the morning, all the students gather outside near the victory bell to start it off. All day there is food, activities, and fun interaction to be had., 169119=Wartburg College has several nice teachers that love to help students. They also have a great athletic facility that amazes you every time you see. Wartburg college provides a May term that allows you to study abroad where ever you want., 22629=My friends and I plan to visit Wartburg in November. Hopefully we have a insightful trip., 1506=In January 2008, they completed a multimillion dollar project to build the Wartburg-Waverly Wellness Complex (also known as The W). While the facility is state-of-the-art, many of the students don't get to see the more impressive aspects of it (those are reserved for community members and athletes). Other than that, you are really getting what you pay for!, 193720=© 2015, Cappex.com, LLC, 82780=It's basically whatever you'd do in high school except there aren't parents to rein you in, just RAs. My friends and I like to get together to play video games, watch movies, play Catchphrase, or venture off campus to go out to eat or to a movie. Additionally , there are a lot of events on campus including comedians, singers, bands, and other cultural events. One such cultural event is the Culture Show that the international students put on every year showcasing their home countries. It's VERY impressive. They start practicing months in advance. Another fun show every year is the Drag Show that Alliance puts on. They get famous local drag queens and students to perform. It's definitely worth the few dollars you pay to get in! Entertainment ToKnight (ETK) brought Maroon 5 to campus a few years back for their annual Large Event, and last year we had Javier Colon came in April. ETK also sponsors a $1 Movie Knight (we're the Knights if you haven't guessed) the first Wednesday of every month at the local movie theater. It's a late show---usually starts at 11:30pm. That's one of my favorite things to do. I could go on and on about this. There's stuff to do. Trust me., 63408=Every fall term we have Outfly, a day of no classes! We don't find out that it's Outfly until 6:30 in the morning the day of, but it's a wonderful day. There are also several other traditions, especially within organizations, such as the band who has lots of unique traditions. Wartburg also has May Term. We finish second semester in April, and for the month of May we take 1 class. Many students take this opportunity to travel to a variety of different countries- England, France, Spain, China, Japan, Tanzania, and Costa Rica to name a few.}",
    "textBeforeTable": "08/30/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 44 Kyle from Waverly, IA Check out reviews left by other students or leave your own review. You could win a free scholarship. Wartburg College Reviews Wartburg College › Iowa › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Tips for prospective students 1) Don't let the sticker price scare you! 2) Get involved. . . there is so much to do and time flies! Make it worth while! 3) Actually do your homework. Some teachers will never notice if you don't, but classes will be so much more enjoyable (and your grade will like it too!). 4) Be yourself - college is a place to find people who love you for you! Bang for the buck The so-called sticker price of Wartburg is a scary one! But the scholarships and financial aid help out so much! In the end, Wartburg was much cheaper for me to go to than any public State schools; I have heard many of my friends say the same thing. I feel like I am learning so much more than I would have at a larger school, because I get so much one on one attention and help from my professors. Am enjoying being here I love the campus here! It is small, but not so small that I feel like I need to get away. Because of it's size, I get a lot more attention from my professors and have never felt lost in a sea of students. Even from my first visit here I saw how incredibly friendly",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}