{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Overall ok considering there are bars and clubs near by.",
            "Near by theater and shoppes",
            "Versatile atmosphere.",
            "For a community college I guess it is ok. I do not have the advantage of financial aid so I pay out of pocket. Its about 150 dollars per credit hour and each class is about 4 credit hours....so you tell me!",
            "The mall is a great place to go if you have an extended break.",
            "GREAT! Lots of restaurants surrounding the campus!",
            "No. This is a community college",
            "Variable",
            "Remain focused and do your best to make it to class everyday",
            "TCC is great from prerequisite courses. The teachers overall will help you through the classes.The Norfolk Campus has the better atmosphere in regards to restaurants and a near by mall."
        ]
    ],
    "pageTitle": "Tidewater Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tidewater-Community-College/reviews?_escaped_fragment_=/show/48540",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989043.35/warc/CC-MAIN-20150728002309-00037-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905256711,
    "recordOffset": 905168191,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{543327=© 2015, Cappex.com, LLC, 169572=Tidewater Community College is located in the heart of downtown with a variety of options for food. The Students Center just opened in the summer of 2011 and is a wonderful option for students who dont want to walk too far from campus to grab a bite to eat., 202317=Currently unavailable, but will be availalbe by March 2014., 127255=The Norfolk Campus Tidewater community college was the first campus to have a student center it open on May 23,2011 that is a place were students can hang out in between classes it has five floors . The first floor is open to the public which has two cafes on that floor . The other floors can only be access if you are a tcc student with an tcc id card which is provide by the school once you are enrolled into classess., 401654=TCC doesn't have a dorm because it is a community college. TCC offers day-care starting in the beginning of January or February. Also they offer employment for students that want to work part-time while they are in school., 130464=Hello prospective students i use to be open of you but then I was at the beach and I was thinking i do not just want a high school diploma because that will not get me very far in life. So on March 2,2011 i decide to enroll into school and that was the best thing i did so far in my life.}",
    "textBeforeTable": "10/23/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 137 D from Virginia Beach, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Bang for the buck The prices for this school are decent and I love the way financial aid works. Before you go to the bookstore you get a little slip of paper saying how much you have in your financial aid account & what all you can spend it on. I have been enrolled here a full year now and have not spent a penny on my school. Am enjoying being here I love the area that the Virginia Beach campus is is. It's easy to find & it's just ten miles from the ocean front! The only problem I have had is that one evening my car was broken into in the TCC parking lot, but nothing was stolen. Am learning a lot So far, all but two of my teachers that I have had were wonderful. If you are majoring in sociology or Microsoft Office I would research your teachers hard before signing up for your classes. Login to rate or flag the reviews Kristin from ASTORIA, NY 02/07/2013 Reviewer is A past student here.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}