{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "SUPER CHEAP! And if you're just transferring to NIU, they are very closley connected.",
            "Really unhealthy",
            "There are no dorms here! It's a community college, duh.",
            "Not very hard, most of the time it's like teachers make it as easy as possible for you to pass, especially the gen eds for kish.",
            "It's a small college, and people are pretty friendly, though most keep to themselves. I've found myself really liking my teachers, and a lot of them keep classes pretty informal.",
            "So far, I think Kishwaukee is a pretty good school, but as a transition. The education is too easy sometimes, and most of the teachers are okay, though they could be better. Always beware with community colleges, because it's really easy for people to get comfortable in them, which isn't good since this is supposed to be more of a transition step."
        ]
    ],
    "pageTitle": "Kishwaukee College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Kishwaukee-College/reviews?_escaped_fragment_=/show/23123",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988930.94/warc/CC-MAIN-20150728002308-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 904847559,
    "recordOffset": 904817790,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101907=© 2015, Cappex.com, LLC, 80254=only three buses come to the school drop off and pick up 6:30-9:30 1:00-3:30, 77466=Kishwaukee College has continuously exceeded my expectations throughout the entire time I have been enrolled. The staff and instructors have been helpful with every aspect of my college career. I am graduating in May and will miss this school very much!}",
    "textBeforeTable": "12/16/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 26 Brittany from Genoa, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "02/25/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 26 Categories Comments Great for these types of students Kish is great for students who want to stay close to home, actually learn something from people who actually want to teach, and want to save tremendous amounts of money. The campus itself is pretty enjoyable with lots of free activities and things in the main lobby most of the time. Tips for prospective students I encourage you to take classes that interest you in addition to just those that fill your required slots. You might not have another opportunity to take classes you like at this kind of price. Doing this also gives you a chance to become more well rounded and might even strengthen your resolve to be in a certain field or even change it dramatically. Bang for the buck It's simple: Kish is a community college. There's no dorm to pay for and its inherently cheaper because it is a community college. Tuition itself can be paid for by a few scholarships and it saved",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}