{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,133 topics 2,125,225 replies",
            "85,560 topics 1,153,936 replies",
            "1,071 topics 11,070 replies",
            "4,218 topics 64,761 replies",
            "5,996 topics 75,815 replies",
            "50,548 topics 466,245 replies",
            "22,767 topics 196,313 replies",
            "4,273 topics 60,486 replies",
            "1,127 topics 8,219 replies",
            "3,605 topics 115,527 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By UshaB A minute ago",
            "IV & EFLC Vehicles Thread By Scaglietti 4 minutes ago",
            "Why does this game receive... By Sayuri A day ago",
            "Whats your favourite radio... By Ivan1997GTA 16 hours ago",
            "Favorite Gang By Mr. Fahrenheit 11 hours ago",
            "Anyone really dislikes dual... By PhillBellic 29 minutes ago",
            "Reasons why Vice City is be... By UshaB 40 minutes ago",
            "How Did Miguel and Catalina... By GTA_The_Series 3 minutes ago",
            "What are the cops actually... By Cerium 2 hours ago",
            "Deadliest Grand Theft Auto... By Phoenix_Poop 20 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=02&f=251&t=414152",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.53/warc/CC-MAIN-20150728002308-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 105743983,
    "recordOffset": 105722829,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9497=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14170=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 16384=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47480=Google, MRMBF, fefenc, SuperHolySheep, Claude Liberty, Yahoo, Bing, GTA4LIFE9000, Radius95, Opzeker, GTAKid667, GTA_The_Series, gajrajgchouhan, Yus, UshaB, Tacts_21, aslieaa, BlackMilk, yopitstank, wangsparkinglot, Renlou, mrtommygunwhite, BlackHeartedGovernor, Mrgrandis_HKG, Ermacs, Majestic81, Kaa619, shadowkill98, misak, Randy93, Dexter_Raminus, RedDagger, Jeansowaty, Cha Boy Jesus, Zizy, dlflow84, Greasepalms, DSER_DemonICs, Chuck Finley, Viper5900, Onyxo599, PhillBellic, craigdyid, EF2000, Retired Mafia, itch, SneakyPenguin91, whywontyoulisten, Mr. Fahrenheit, Silent, sanctum613, wowsux133, Kampret, cremefraiche, Sky_Light12, unknown modder, JON22, beretta-gt88, elfoam, xink, D9fred95, Legomanarthur, Totoyeahwhat123, Legend2871, quadro09, TwisterVictor1, Matttheking2015, Google Mobile, Kajjy, toxluv, Krukan56, JenzXD, Zyo, Bender.ㅤ, ant1greeny, Arms Dealer, hitman774, MR BIZNIS, lolznc, Colbydogs, ira231, DonSpeedy, BiscuitTheCat59, mikestb123, Netman005, Heists, LeeK39, BeckermannDewitt, Devils Few MC, BisP, hanumana, SKARFACE, CriminaL277, Russell_Brand, wh1t31v3y, Edmachine, MrTay, Trash99, A3mode, Young_Blood, gamefriik200, Chloroform, PureBeast72, feedthefishy, Nickyvida, ED-E, HulioG, matinez, Kikato, Hello7734, Astoroth211, MarQs, ~TKP~, Axiom XIII, Braindawg, longhurstgb, Total Failure, Maddeford, Owl Man, CptAngel, ObjectedChief, Nacorpio, Scuba 21, Rebel, SchoolOfHardKnocks, //XP//, justoh, DJS, UptownRider, leftas, stef_92, crashoverride93, Khumaro, athande, m3tal z_DKI, Pikas_PK, Masketta Man, Vaniox9, ArmorKingHunter, GTAVNoob, Zolika1351, mikabango, Pavle, Richardbrown30, EL_Greco, ZEST, uNiverselEgacy, Goulais Redneck, DaWiesel, Linchpin636, Jinx., Equity, jerryinohio78, Thalyn, FacingGaming, A Siente, Epsilon_Program, IParadise CityI, lpgunit, blackindia, Boooster, ashank975, Smesi, Th3MaN1, SmilingjacK420, kuusko, SuperGTFan, Cool Username, Stoney0503, Zondar, Terra_S4, louth91, o_Marvelous, 4sinayousefi, Deadman1996, ClaudeSpeed1911, Rendy Specter(Riandy), WestsideOutlaw187, binitgames, Loves GTA, sebbellic01, Sentinel Driver, Twang., Andreaz1, Jax765, Madjoki, gtaguy95, March 10th, AlterBlitz, LukeyDukey1988, Shenmue18, TheComedianIsDead, Mottershead, arewenotmen, stretchx9, Gridl0k, rad19dym, GipsyDanger MK2, Deus Ex, missanthropy, smokingndriving, almico, Spectre2014, Bagus, Terroryaki, 102385=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12603=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 20710=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 18577=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 6 minutes ago By Owl Man The Paleto Bay Mayors Offic... 613,572 replies 15,212 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By BlackHeartedGovernor Ideas to improve/alter Play... 2,284,963 replies 113,458 topics This is a general discussion forum for Grand Theft",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,469 topics 416,641 replies dx8vb.dll could not be found By husham2003 3 hours ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}