{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,054 topics 2,122,888 replies",
            "85,544 topics 1,153,436 replies",
            "1,071 topics 11,067 replies",
            "4,218 topics 64,752 replies",
            "5,995 topics 75,801 replies",
            "50,533 topics 466,100 replies",
            "22,767 topics 196,265 replies",
            "4,269 topics 60,407 replies",
            "1,128 topics 8,213 replies",
            "3,595 topics 115,012 replies"
        ],
        [
            "Last Post Info",
            "\"Come Back when Your St... By Mr. Fahrenheit 4 minutes ago",
            "Niko's Wife 2015 By Mr. Fahrenheit 7 minutes ago",
            "The Ultimate 100% Save File... By Militia A day ago",
            "The Most Underrated GTA Ever By Melancholia 6 hours ago",
            "Luigi Goterelli By TheUnholy 20 hours ago",
            "Do you love or hate GTA SA... By Mr. Fahrenheit 10 minutes ago",
            "Preffered Platform for VC?... By slackman98 8 minutes ago",
            "Grand Theft Auto III Pre-Re... By inadequate An hour ago",
            "v 11.44, where is the radio? By Cerium 13 hours ago",
            "GTA V \"Beach Bum 2\"... By Mr. Fahrenheit 44 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=98&t=122839&p=1436598",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 102694771,
    "recordOffset": 102669410,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9243=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 16295=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004., 47006=Bing, Google, Jinx., CaptHayes, Phyxsius-, Yahoo, theicide, DaveGrimes96, _CP_, Nerfgoth, gta4_player, TheHammer, jrl51592, Qwats, Heisenberg_GR, gta-massy, RussianCommie, dice, M4k3, waters, BeckermannDewitt, ChrisV, AcidRunner, Mr. Fahrenheit, Rooster Mods, xoutlaww, CjLosSantos, beanzinapot, Peiva's Laahdin, Maikou, Fozzie_420, HaythamKenway, HipsterHillbilly, Beardsunite, SM Grunge, kidgrinch, Tycek, leftas, *-*Mini*-*, slackman98, 11john11, NightSpectre, Yoona, CrysisAverted, VercettiGuy, GR Choke, PSNSammy1, CarcerCityMadMan, Pfister Comet, Stig, stainesey, Pavle, toxluv, FR_Player-One, Gabriela_L, Renlou, Biira99, Turbocharger, TG_Stig, wh1t31v3y, hyaena, andym, shadowkill98, idonknowhow, Pete4000uk, Reywas1, monkb4skunk, Cyper, TheI3arracuda, DJ_Vejeejee, keroroxzz, Wolfpac4Life, catmandoza, S1N0D3UTSCHT3K, jollythecat, MrMateczko, Retired Mafia, TH_009, Zulxer, Lester-The-Molester, bigjpc777, Katabasis, Lonesoldier01, CReaper210, LV007, Delta8042, RookieCode, gfen, Lone Marine, NoaJM, Blankerz, kcchief1981, Loc14, hitman774, Sethenor, Pain_Killer, 7nvd, LordRaijin, Sky_Light12, chriscarr99, gtasadude, Chips237, B Dawg, lazy., Verlotsky, AaronMcG95, SonofUgly, Fonshway, Goatman72, TheIceWarrior, MilezDawg, Gummy , Latemodelchild, Ewok626, SmilingjacK420, Schleemil, Alexa, CBStian, U.N.K.N.O.W.N, emelen, Rt001, Niobium, missanthropy, ghilliesuit101, kulomet333, SaL_Leone, arewenotmen, Screwe45, Receptor, prestonchan, Bone34, pockings, BlackMilk, GTA_The_Series, Claude Liberty, GTAandStuff, GTAGuy1995, swooshboy, Clark., Astoroth211, __TheGovernor__, Midnight Special, CanOdope, slvrcobra, Xpert.K, minhto360, ImBurkalicious, PANiC ATTACK3R, Tilley, JamesRay0757, DaltonWilliams123, moostered, UshaB, saikolemon, SuperKingBender, DominusTaranis, Vexate, Google Mobile, Lubas, obajtektsw92, RevengeOfSpartacus, Epic., shepzki, keanan26, Anger Personified, kuusko, IgorX, Mastah, Fuzzknuckles, Vaymasters, Progeekzy, Fenton, fjj8, Abzinth, hornedturtle, Wolftickets, Automan, v1p3r_eddy, DrDuke, BenBRZ, blockgod94, Luddite, xXOsamaBinLamaXx, ashank975, SirBurka_, RafaeShe, xHaviiHx, Rafli, Terroryaki, Shaundi., BobyFrançais, XxFA2EKILLERxX, The Yokel, Maxim1991, Dante9231, Silnev, rozay, Shy, unemployedmothe, Hominin, ceaton88, SumSkittles, Extreme_Wrestler, nebraskathomas, ChrissyBoi87, MaverickF8, mattjeh, Lazz312, emiliumium, Jon3s, 18464=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 20613=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 101435=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 14081=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 12436=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); 20 minutes ago By Hellboy The Duping Crew 613,097 replies 15,169 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By TheHammer GTA V Throwback Pack 2,276,057 replies 113,035 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support Guides",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,429 topics 416,481 replies duke o' death car mod By LordRaijin 18 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}