{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "Forum FAQ & Help Topics This forum addresses Frequently Asked Questions regarding general use of the forum software.",
            "Studio Operations and Making Work Making, decorating and firing ceramic art. Moderated By: Preston Rice",
            "Clay and Glaze Chemistry Recipes, clay and glaze chemistry, glazing techniques. Moderated By: John Baymore",
            "Equipment Use and Repair Use and maintenance of kilns, wheels, pug mills, slab rollers, etc. Moderated by: Bruce Ciske",
            "Business, Marketing, and Accounting Marketing, selling, accounting, website development. Moderated By: Mea Rhee",
            "Educational Approaches and Resources Discussions for students and educators in the ceramic arts.",
            "Aesthetic Approaches and Philosophy Critical theory and commentary on contemporary ceramics",
            "Potters Council Operations and Benefits Moderated by Steven Branfman",
            "Ceramic Events of Interest Exhibitions, Sales, Workshops, and other ceramic-related events."
        ],
        [
            "Stats",
            "2 topics 0 replies",
            "3,277 topics 35,165 replies",
            "2,302 topics 19,445 replies",
            "189 topics 2,149 replies",
            "491 topics 6,094 replies",
            "338 topics 3,546 replies",
            "169 topics 2,610 replies",
            "380 topics 4,278 replies",
            "318 topics 531 replies"
        ],
        [
            "Last Post Info",
            "Our Most Frequently Asked Q... By Jennifer Harnetty 11 Mar 2014",
            "Diy Sieve By ronfire Today, 02:51 PM",
            "Do You Store Your Glazes Dr... By Celia UK Today, 02:06 PM",
            "Olympic Torchbearer Gas Kiln By sarahwarth@yahoo.com Today, 11:17 AM",
            "Freestanding Retail/studio... By karenk 29 Jul 2015",
            "Teenager In Adult Beginner... By Grype Today, 12:39 PM",
            "What To Do To Stimulate Cre... By Marcia Selsor Today, 01:27 PM",
            "Qotw: What Makes Something... By LeeU Yesterday, 09:20 PM",
            "Call For Entries: Delectabl... By ShelleyS 26 Jul 2015"
        ]
    ],
    "pageTitle": "Ceramic Arts Daily Community",
    "title": "",
    "url": "http://community.ceramicartsdaily.org/index/page__s__c714e0410f5737e1f6900fa541474303",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988311.72/warc/CC-MAIN-20150728002308-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 52790651,
    "recordOffset": 52777071,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{18322=sarahwarth@yahoo.com - Today, 11:17 AM, 40002=Never-I do the boulder City Neveda show on 1st weekend of Oct. TempeAZ in Dec.as well, 20175=DJA - Today, 05:16 AM, 21139=Bioman - Yesterday, 06:17 PM, 19258=flowerdry - Today, 10:32 AM, 22133=Meridianfrost - Yesterday, 05:49 PM}",
    "textBeforeTable": "Toggle Ceramic Arts Daily Forums Ceramic Arts Daily Forums You currently have javascript disabled. Several functions may not work. Please re-enable javascript to access full functionality. Javascript Disabled Detected More Gallery Members Forums Ceramic Arts Daily View New Content   Gallery Help Files Members Forums Search section:",
    "textAfterTable": "Recent Topics Olympic Torchbearer Gas Kiln sarahwarth@yahoo.com - Today, 11:17 AM Teenager In Adult Beginner Wheel Class. flowerdry - Today, 10:32 AM Wax Resist DJA - Today, 05:16 AM Can This Piece Be Salvaged? Bioman - Yesterday, 06:17 PM",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}