{
    "relation": [
        [
            "Cited Patent",
            "US1850734 *",
            "US2265931 *",
            "US2266312 *",
            "US2300946 *",
            "US2336052 *",
            "US2454778 *",
            "US2581596 *",
            "GB414344A *",
            "GB582359A *"
        ],
        [
            "Filing date",
            "Apr 23, 1930",
            "Jul 20, 1938",
            "May 31, 1940",
            "Aug 22, 1941",
            "Feb 10, 1941",
            "Jun 7, 1945",
            "Jan 26, 1946",
            "",
            ""
        ],
        [
            "Publication date",
            "Mar 22, 1932",
            "Dec 9, 1941",
            "Dec 16, 1941",
            "Nov 3, 1942",
            "Dec 7, 1943",
            "Nov 30, 1948",
            "Jan 8, 1952",
            "",
            ""
        ],
        [
            "Applicant",
            "Thorne Motor Corp",
            "Budd Edward G Mfg Co",
            "Gen Motors Corp",
            "Westinghouse Electric & Mfg Co",
            "Allis Chalmers Mfg Co",
            "Curry Herman H",
            "Chrysler Corp",
            "",
            ""
        ],
        [
            "Title",
            "Gas-electric apparatus",
            "Electric drive control",
            "Power plant output regulator",
            "Electric ship propulsion",
            "Dynamic braking",
            "Electrical control system",
            "Power transmission",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US3348623 - Automatic electric drive system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3348623?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00078-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481952738,
    "recordOffset": 481936783,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7442=1967 H. R. POTTER AUTOMATIC ELECTRIC DRIVE SYSTEM Filed Oct; 14, 1964 m MW 0 W MR D %WM6M M United States Patent 3,348,623 AUTOMATIC. ELECTRIC DRIVE SYSTEM Harold R. Potter, Walnut Heights Addition, Rte. 4, Bedford, Ind. 47421 Filed Oct. 14, 1964, Ser. No. 403,750 13 Claims. (Cl. 18065) ABSTRACT OF THE DISCLOSURE An engine-driven generator supplying power to a vehicle drive motor through manually operable direction control switch. An exciter circuit for the generator having a first resistance therein responsive to generator speed for changing the resistance in the exciter circuit, and a second variable resistance in the exciter circuit but responsive to motor speed to vary the resistance in the exciter circuit in accordance with motor speed changes. A manually-operable switch for shunting the generator exciter winding and providing an exciter circuit for the motor for engine braking and push-starting of the engine, when needed., 39305=References Cited UNITED STATES PATENTS Dilworth 290-17 LiWschitz 318-148 Anderson et a1. 2 318-158 X Curry 318-148 X Nirns 180-65 FOREIGN PATENTS 1934 Great Britain.}",
    "textBeforeTable": "Patent Citations MILTON L. SMITH, Examiner. BENJAMIN HERSH, Primary Examiner. Great Britain. References Cited UNITED STATES PATENTS Dilworth 290-17 LiWschitz 318-148 Anderson et a1. 2 318-158 X Curry 318-148 X Nirns 180-65 FOREIGN PATENTS 1934 Great Britain. current control means in said exciter circuit and responsive to currents in said eXciter circuit above a predetermined level to increase resistance in said exciter circuit until the current therein has again returned to said predetermined level, whereby excessive currents in said exciter circuit are avoided. 9 13. The combination set forth in claim 12 and further comprising: speed responsive actuator means coupled to said generator and to said vehicle drive motor and having output members connected to said variable resistance means and responsive to speed increases of said generator and to speed increases of said motor to decrease the resistance in said exciter circuit. an exciter circuit for said generator, said exciter circuit including said exciter means, said source of electrical energy, and a variable resistance means; power switching means connecting the power output means of said generator to the power input terminals of said motor; a vehicle drive motor having power input terminals thereon and having a power output shaft; an electrical generator having a rotor connected to and driven by said output shaft, said generator having exciter means therein and having load current power output means therein;",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3374849 * Sep 28, 1966 Mar 26, 1968 Lawrence E. Redman Electric vehicle US4307300 * Apr 25, 1980 Dec 22, 1981 Kabushiki Kaisha Komatsu Seisakusho Dump truck with safety circuit US4923025 * Oct 8, 1987 May 8, 1990 Ellers Clarence W Hybrid electric/ice vehicle drive system * Cited by examiner Classifications U.S. Classification 180/65.245, 318/148, 318/158, 180/65.265, 290/16 International Classification B60L11/08 Cooperative Classification B60L11/08, Y02T10/7077 European Classification B60L11/08 Rotate",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}