{
    "relation": [
        [
            "Cited Patent",
            "US3915887 *",
            "US3954662 *",
            "US4009095 *",
            "US4104035 *",
            "US4127383 *",
            "US4196092 *",
            "US4242098 *",
            "US4392865 *",
            "US4395266 *"
        ],
        [
            "Filing date",
            "9 Feb 1973",
            "2 Jan 1974",
            "15 Jan 1976",
            "11 Dec 1975",
            "10 Jun 1977",
            "17 Apr 1978",
            "3 Jul 1978",
            "16 Jan 1980",
            "19 May 1980"
        ],
        [
            "Publication date",
            "28 Oct 1975",
            "4 May 1976",
            "22 Feb 1977",
            "1 Aug 1978",
            "28 Nov 1978",
            "1 Apr 1980",
            "30 Dec 1980",
            "12 Jul 1983",
            "26 Jul 1983"
        ],
        [
            "Applicant",
            "Lion Fat Oil Co Ltd",
            "Monsanto Research Corporation",
            "Uop Inc.",
            "Texaco Inc.",
            "Graham-White Sales Corporation",
            "American Cyanamid Company",
            "Union Carbide Corporation",
            "Lanko, Inc.",
            "Internationale Octrooi Maatschappij \"Octropa\" B.V."
        ],
        [
            "Title",
            "Method of dispersing foams in liquid",
            "Aqueous foam compositions to suppress coal dust",
            "Mixed-phase fluid distribution for packed chambers",
            "Preparation of solid fuel-water slurries",
            "Foaming waste treatment composition and method for treating nitrogenous waste material therewith",
            "Conditioning agent for froth flotation of fine coal",
            "Transport of aqueous coal slurries",
            "Hydrocarbon-water fuels, emulsions, slurries and other particulate mixtures",
            "Stabilized water-in-mineral oil emulsion"
        ]
    ],
    "pageTitle": "Patent US4759267 - Energetic fluid product and its application to the supply of combustible ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US4759267",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00164-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479971951,
    "recordOffset": 479952587,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Furthermore, while the product has been described for the case of a coal water air mixture, it is quite obvious that different solid fuel could be employed with a liquid phase and a gas phase of another kind. It would be noted that, in general, the proportion of liquid phase needs to be as low as possible because the use of water reduces the energy yield and a liquid fuel is more costly. On the other hand, the gas phase is generally useful in the reaction and it would be possible, for example, to employ as the gas phase either a combustive gas or a fuel gas. The arrangements just described are given, of course, only by way of example and other devices could be employed, permitting a foam to be produced and solid particles to be incorporated therein. Due to this reduction of the loss of pressure, it is thus possible to transport on long distances a concentrated product directly utilizable in a reactor without necessiting any dewatering. In return, for a classical Coal-Water mixture containing 70% by weight of coal, the increasing of the loss of pressure by increasing the flow was important: For the same flow of 0,10 and 0,25 Kg/sec, the losses of pressure were, respectively 0,20 and 1,10 bar/m. While the product has been described for the case of a coal-water-air mixture, it is quite obvious that different solid fuel could",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 44/281, 516/11 International Classification C10L1/32, C10L10/18 Cooperative Classification C10L1/32, C10L1/326 European Classification C10L1/32, C10L1/32C Legal Events Date Code Event Description 2 Jul 1984 AS Assignment Owner name: CREUSOT-LOIRE 42 RUE D ANJOU, 75008 PARIS FRANCE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:WANG, ROBERT;ANTONINI, GERARD;FRANCOIS, OLIVIER;AND OTHERS;REEL/FRAME:004298/0813 Effective date: 19840502 14 Mar 1989 CC Certificate of correction 25 Feb 1992 REMI Maintenance fee reminder mailed 26 Jul 1992 LAPS Lapse for failure to pay maintenance fees 29 Sep 1992 FP Expired",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}