{
    "relation": [
        [
            "Citing Patent",
            "US7684940",
            "US7716012",
            "US7831694 *",
            "US8249756",
            "US8554387",
            "US20120033473 *"
        ],
        [
            "Filing date",
            "Mar 28, 2007",
            "Feb 13, 2008",
            "May 11, 2006",
            "Nov 23, 2009",
            "Mar 2, 2012",
            ""
        ],
        [
            "Publication date",
            "Mar 23, 2010",
            "May 11, 2010",
            "Nov 9, 2010",
            "Aug 21, 2012",
            "Oct 8, 2013",
            "Feb 9, 2012"
        ],
        [
            "Applicant",
            "Bickel Jon A",
            "Bickel Jon A",
            "Arvind Wadhawan",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Scharf Mesa P"
        ],
        [
            "Title",
            "Method and system to identify grounding concerns in an electric power system",
            "Method for process monitoring in a utility system",
            "Transfer of electrical data with auto-discovery of system configuration",
            "Method, device and system for responsive load management using frequency regulation credits",
            "Method, device and system for responsive load management using frequency regulation credits",
            "Systems and methods for electrical power grid monitoring using loosely synchronized phasors"
        ]
    ],
    "pageTitle": "Patent US7349815 - Automated integration of data in utility monitoring systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7349815?dq=6008737",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00317-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484825087,
    "recordOffset": 484786197,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While particular embodiments and applications of the present invention have been illustrated and described, it is to be understood that the invention is not limited to the precise construction and compositions disclosed herein and that various modifications, changes, and variations can be apparent from the foregoing descriptions without departing from the spirit and scope of the invention as defined in the appended claims. If the power system layout is not complete, the algorithm 600 sends a command to the monitoring devices to collect power data (612). The host computer running the algorithm 600 uploads the power data from monitoring devices (614) and determines the power system layout (616) in accordance with the present invention. This procedure is repeated until the power system layout is complete (618) at which point the algorithm ends. . The algorithm 600 starts by sending a command to the monitoring devices to collect frequency data (602). Data from the monitoring devices is uploaded to the host computer (604) and the data from all the monitoring devices is aligned (606) in accordance with the present invention. When all the data is aligned, the algorithm 600 determines whether the power system layout is complete (610). If so, the algorithm 600 ends, and the contextual data can be used in further software applications. FIG. 12 An automated IM algorithm 600 according to an embodiment of the present invention is illustrated",
    "textAfterTable": "US20040225649 Feb 9, 2004 Nov 11, 2004 Yeo Jeffrey W. Identifying energy drivers in an energy management system US20050050095 Aug 29, 2003 Mar 3, 2005 International Business Machines Corporation Method, system, and storage medium for providing a dynamic, multi-dimensional commodity modeling process WO2000040977A1 Dec 23, 1999 Jul 13, 2000 Berthiaume Guy H Revenue meter having precision time clock WO2000065480A2 Apr 21, 2000 Nov 2, 2000 Oracle Corp System and method for generating decision trees WO2005059572A1 Dec 16, 2004 Jun 30, 2005 Pulse Utilities Ltd A power line communication system and an intelligent meter * Cited by examiner Non-Patent Citations Reference 1 Article: Cross Correlation-Auto Correlation-2D Pattern Identification by Paul Bourke (Aug. 1996) 11 pages. 2 Article: GPS World-Pacify the Power GPS Harness for Large-Area Electrical Grid by Dennis Erickson and Carson Taylor (Apr. 1, 2005) 9 pages. 3",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}