{
    "relation": [
        [
            "Date",
            "Oct 24, 2000",
            "Feb 4, 2004",
            "May 15, 2006",
            "Apr 19, 2010",
            "Jul 3, 2014",
            "Nov 26, 2014",
            "Jan 13, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20141126"
        ]
    ],
    "pageTitle": "Patent US6485433 - Ear thermometer with rotatable and revolvable detector probe - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6485433?ie=ISO-8859-1&dq=5,838,906",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472877399,
    "recordOffset": 472860645,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Many changes and modifications in the above described embodiment of the invention can, of course, be carried out without departing from the scope of the present invention. Accordingly, to promote the progress in science and the useful arts, the invention is disclosed and is intended to be limited only by the scope of the appended claims. From the above description, it is to be understood that the present invention is characterized in that its detector probe is made revolvable about three dimensions with respect to the thermometer body, and is constructed to remain self-rotatable. The detector probe is thus able to adjust in its tilted angle so as to freely match different directional orientations of the merged inlet of a patient's external auditory canal. Hence, the detector probe can smoothly and securely plugged therein. Referring to FIG. 5, a housing 40 can be employed to entirely cover the front portion of the car thermometer of the present invention for protecting the detector probe 20. Furthermore, an accommodation space 41 usable for storing accessories of the thermometer is provided. Meanwhile a plurality of screw holed lags 24 are formed around the bottom edge of the arcuate neck portion 23 of the detector probe 20 for retaining, for example, a control circuit board 22 of an infrared ray inductor with screws, and/or preventing the detector probe 20 from loosening from the pivot journal 31 after assembly is completed.",
    "textAfterTable": "Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6612735 * May 30, 2002 Sep 2, 2003 Omron Corporation Infrared ray clinical thermometer US7108419 Apr 15, 2003 Sep 19, 2006 Sherwood Services Ag Thermal tympanic thermometer tip US7255475 * Oct 12, 2005 Aug 14, 2007 Welch Allyn, Inc. Thermometry probe calibration method US7434991 May 19, 2006 Oct 14, 2008 Covidien Ag Thermal tympanic thermometer US7556424 * May 19, 2006 Jul 7, 2009 Covidien Ag Tympanic thermometer prove cover cassette and holder US7651265 * Jun 12, 2007 Jan 26, 2010 Radiant Innovation Inc. Infrared clinical thermometer US7841767 Aug 8, 2008 Nov 30, 2010 Covidien Ag",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}