{
    "relation": [
        [
            "Citing Patent",
            "US7569052",
            "US8048069",
            "US8052677 *",
            "US8221407",
            "US8632532",
            "US8814856",
            "US8945114",
            "US9084611 *",
            "US20040215181 *",
            "US20040243122 *",
            "US20050059962 *",
            "US20130079645 *",
            "EP1945298A1 *",
            "WO2015073932A1 *"
        ],
        [
            "Filing date",
            "12 Sep 2003",
            "13 Apr 2007",
            "28 May 2004",
            "8 Jul 2009",
            "17 Jul 2012",
            "30 Apr 2007",
            "26 Apr 2007",
            "22 Sep 2012",
            "25 Apr 2003",
            "8 Jan 2004",
            "12 Sep 2003",
            "",
            "9 Nov 2006",
            "14 Nov 2014"
        ],
        [
            "Publication date",
            "4 Aug 2009",
            "1 Nov 2011",
            "8 Nov 2011",
            "17 Jul 2012",
            "21 Jan 2014",
            "26 Aug 2014",
            "3 Feb 2015",
            "21 Jul 2015",
            "28 Oct 2004",
            "2 Dec 2004",
            "17 Mar 2005",
            "28 Mar 2013",
            "23 Jul 2008",
            "21 May 2015"
        ],
        [
            "Applicant",
            "Boston Scientific Scimed, Inc.",
            "Medtronic, Inc.",
            "Coaptus Medical Corporation",
            "Boston Scientific Scimed, Inc.",
            "Boston Scientific Scimed, Inc.",
            "Medtronic, Inc.",
            "Medtronic, Inc.",
            "The George Washington University",
            "Medtronic, Inc.",
            "Coaptus Medical Corporation",
            "Scimed Life Systems, Inc.",
            "LuxCath, LLC",
            "Korea University Industrial & Academic Collaboration Foundation",
            "Clph, Llc"
        ],
        [
            "Title",
            "Ablation catheter with tissue protecting assembly",
            "User interface for ablation therapy",
            "Transseptal left atrial access and septal closure",
            "Catheter with tissue protecting assembly",
            "Catheter with tissue protecting assembly",
            "Extension and retraction mechanism for a hand-held device",
            "Fluid sensor for ablation therapy",
            "Systems and methods for visualizing ablated tissue",
            "Delivery of fluid during transurethral prostate treatment",
            "Transseptal closure of a patent foramen ovale and other cardiac defects",
            "Ablation catheter with tissue protecting assembly",
            "Systems and Methods for Visualizing Ablated Tissue",
            "Radio frequency ablation electrode for selected tissue removal",
            "Apparatus, systems, and methods for epicardial imaging and injection"
        ]
    ],
    "pageTitle": "Patent US20030028188 - Deflectable interstitial ablation device - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US20030028188",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 463817907,
    "recordOffset": 463791059,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0044] As shown and described, the present invention features an improved transurethral interstitial ablation apparatus and method for performing transurethral ablation While the invention has been particularly shown and described with reference to specific preferred embodiments, it should be understood by those skilled in the art that various changes in form and detail may be made therein without departing from the spirit and scope of the invention as defined by the appended claims. [0043] The deflectable interstitial ablation device 10 of the present invention does not require the use of an endoscope and therefore can be entirely disposable. The disposable device can attach to reusable eye piece and other equipment such as a light source, and a control and power source module. In an alternative embodiment, the imaging system 16 can be removed from the device 10 for subsequent reuse. [0042] In another embodiment, the deflectable interstitial ablation device 10 can include a temperature sensing system for measuring tissue temperature during the ablation procedure. In one detailed embodiment, the temperature sensing system can include a thermocouple disposed near the distal end of the electrode 14, such as by being fixed at the distal end of the insulation sheath 40 that is fixed to the electrode 14. In still another embodiment, the device 10 can include an impedance monitoring system in communication with the proximal end of the electrode",
    "textAfterTable": "US8945114 26 Apr 2007 3 Feb 2015 Medtronic, Inc. Fluid sensor for ablation therapy US9084611 * 22 Sep 2012 21 Jul 2015 The George Washington University Systems and methods for visualizing ablated tissue US20040215181 * 25 Apr 2003 28 Oct 2004 Medtronic, Inc. Delivery of fluid during transurethral prostate treatment US20040243122 * 8 Jan 2004 2 Dec 2004 Coaptus Medical Corporation Transseptal closure of a patent foramen ovale and other cardiac defects US20050059962 * 12 Sep 2003 17 Mar 2005 Scimed Life Systems, Inc. Ablation catheter with tissue protecting assembly US20130079645 * 28 Mar 2013 LuxCath, LLC Systems and Methods for Visualizing Ablated Tissue EP1945298A1 * 9 Nov 2006 23 Jul 2008 Korea University Industrial & Academic Collaboration Foundation Radio frequency ablation electrode for selected tissue removal WO2015073932A1",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}