{
    "relation": [
        [
            "Citing Patent",
            "US7019963 *",
            "US7256986",
            "US7258568 *",
            "US7345869 *",
            "US7414853 *",
            "US7542285 *",
            "US7808793 *",
            "US7826205",
            "US8104730 *",
            "US8456860 *",
            "US8934226",
            "US20120155050 *",
            "WO2007008516A2 *"
        ],
        [
            "Filing date",
            "Jul 6, 2004",
            "Jan 30, 2004",
            "Jun 16, 2006",
            "Jul 19, 2006",
            "Nov 28, 2005",
            "Feb 9, 2007",
            "Nov 30, 2005",
            "Dec 22, 2005",
            "Aug 25, 2008",
            "May 9, 2011",
            "Aug 10, 2012",
            "May 9, 2011",
            "Jul 5, 2006"
        ],
        [
            "Publication date",
            "Mar 28, 2006",
            "Aug 14, 2007",
            "Aug 21, 2007",
            "Mar 18, 2008",
            "Aug 19, 2008",
            "Jun 2, 2009",
            "Oct 5, 2010",
            "Nov 2, 2010",
            "Jan 31, 2012",
            "Jun 4, 2013",
            "Jan 13, 2015",
            "Jun 21, 2012",
            "Jan 18, 2007"
        ],
        [
            "Applicant",
            "Dell Products L.P.",
            "Dell Products L.P.",
            "Aten International Co., Ltd.",
            "Micro-Star Int'l Co., Ltd.",
            "Aten International Co., Ltd",
            "American Power Conversion Cooporation",
            "Fujitsu Component Limited",
            "Originatic Llc",
            "Lif J.K. Corporation",
            "Hong Fu Jin Precision Industry (Shenzhen) Co., Ltd.",
            "Originatic Llc",
            "Hon Hai Precision Industry Co., Ltd.",
            "Don A Hubbard"
        ],
        [
            "Title",
            "Rack mounted keyboard display assembly and storage guide",
            "Rack mounted keyboard and display assembly",
            "Sliding module positioning device",
            "Supporting frame structure",
            "Industrial operation console",
            "Storage rack management system and method",
            "Console device and rack-mount system",
            "Electronic device having a movable input assembly with multiple input sides",
            "Rail assembly for an industrial computer",
            "Electronic device having inner holder for functional module",
            "Mountable device having a pivotable input device support",
            "Electronic device having inner holder for functional module",
            "Flat-foldable computer deskpad"
        ]
    ],
    "pageTitle": "Patent US6807054 - Method and system for deploying a display and keyboard in a rack - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6807054?dq=7,682,496",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478700307,
    "recordOffset": 478684848,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24210=Hermanson, application Ser. No. 09/681,211 and filed on Feb. 23, 2001, which application has been allowed and will issue as U.S. Pat. No. 6,563,700 on May 13, 2003, and which application is incorporated herein in its entirety by this reference.}",
    "textBeforeTable": "Patent Citations It is thought that the method and apparatus of the present invention will be understood from the foregoing description and that it will be apparent that various changes may be made in the form, construct steps, and arrangement of the parts and steps thereof, without departing from the spirit and scope of the invention or sacrificing all of their material advantages. The form herein described is merely a preferred exemplary embodiment thereof. Throughout this description, reference is made to an industrial PC because it is believed that the beneficial aspects of the present invention would be most readily apparent when used in connection with industrial; however, it should be understood that the present invention is not intended to be limited to industrial PCs and should be hereby construed to include other non-industrial PCs as well. Display/keyboard rail system rear end 144 is disposed internal to first rack of industrial personal computers 102. Display/keyboard rail system front end 142 is adjacent to the aisle 106. When a technician desires to use the display 120, the display 120 can be pulled into the aisle 106. Display 120 can be pivoted about display trailing edge 124, so that display leading edge 122 moves upward. If the technician is viewing from below, the amount of pivoting is limited and the display leading edge 122 never is disposed vertical of display trailing edge 124. If the technician is viewing from above,",
    "textAfterTable": "US7258568 * Jun 16, 2006 Aug 21, 2007 Aten International Co., Ltd. Sliding module positioning device US7345869 * Jul 19, 2006 Mar 18, 2008 Micro-Star Int'l Co., Ltd. Supporting frame structure US7414853 * Nov 28, 2005 Aug 19, 2008 Aten International Co., Ltd Industrial operation console US7542285 * Feb 9, 2007 Jun 2, 2009 American Power Conversion Cooporation Storage rack management system and method US7808793 * Nov 30, 2005 Oct 5, 2010 Fujitsu Component Limited Console device and rack-mount system US7826205 Dec 22, 2005 Nov 2, 2010 Originatic Llc Electronic device having a movable input assembly with multiple input sides US8104730 * Aug 25, 2008 Jan 31, 2012 Lif J.K. Corporation Rail assembly for an industrial computer US8456860 * May 9, 2011 Jun",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}