{
    "relation": [
        [
            "Citing Patent",
            "US7305453 *",
            "US7315902 *",
            "US7353033 *",
            "US7539766 *",
            "US7636792 *",
            "US7827315 *",
            "US7975067 *",
            "US7996000 *",
            "US8112768",
            "US8200745 *",
            "US8595355 *",
            "US8806326 *",
            "US8874637",
            "US9058626",
            "US20040122979 *",
            "US20040205620 *",
            "US20090259714 *",
            "US20110126113 *"
        ],
        [
            "Filing date",
            "Feb 7, 2002",
            "Dec 19, 2002",
            "Jan 9, 2002",
            "Apr 16, 2007",
            "Jul 13, 2001",
            "Sep 7, 2007",
            "Jul 8, 2009",
            "Sep 29, 2006",
            "Oct 22, 2010",
            "Oct 14, 2008",
            "Sep 12, 2006",
            "Sep 25, 2000",
            "Aug 4, 2009",
            "Nov 13, 2013",
            "Dec 19, 2002",
            "Apr 10, 2002",
            "Oct 14, 2008",
            ""
        ],
        [
            "Publication date",
            "Dec 4, 2007",
            "Jan 1, 2008",
            "Apr 1, 2008",
            "May 26, 2009",
            "Dec 22, 2009",
            "Nov 2, 2010",
            "Jul 5, 2011",
            "Aug 9, 2011",
            "Feb 7, 2012",
            "Jun 12, 2012",
            "Nov 26, 2013",
            "Aug 12, 2014",
            "Oct 28, 2014",
            "Jun 16, 2015",
            "Jun 24, 2004",
            "Oct 14, 2004",
            "Oct 15, 2009",
            "May 26, 2011"
        ],
        [
            "Applicant",
            "Fujitsu Limited",
            "International Business Machines Corporation",
            "Lg Electronics Inc.",
            "Palm, Inc.",
            "Oracle International Corporation",
            "International Business Machines Corporation",
            "Symbol Technologies, Inc.",
            "Yahoo! Inc.",
            "Jonathan Wu",
            "Aol Inc.",
            "Internet Patents Corporation",
            "Nokia Inc.",
            "Mercury Kingdom Assets Limited",
            "Jpmorgan Chase Bank, N.A.",
            "International Business Machines Corporation",
            "Fujitsu Limited",
            "Richard Doerksen",
            "c/o Microsoft Corporation"
        ],
        [
            "Title",
            "Contents conversion method and server",
            "Compression and abbreviation for fixed length messaging",
            "Position-matched information service system and operating method thereof",
            "Supplying electronic content to networked appliances",
            "Methods and systems for dynamic and automatic content creation for mobile devices",
            "Compression and abbreviation for fixed length messaging",
            "Method and apparatus for implementing alerts on a browser running on a portable handheld device",
            "Managing page sizes for a mobile device using estimation of content customizer techniques",
            "Real-time web applications",
            "Handheld client framework system",
            "System and method for optimizing and processing electronic pages in multiple languages",
            "User preference based content linking",
            "Server-based browser system",
            "System and method for financial services device usage",
            "Compression and abbreviation for fixed length messaging",
            "Information distributing program, computer-readable recording medium recorded with information distributing program, information distributing apparatus and information distributing method",
            "Handheld client framework system",
            "Displaying content on multiple web pages"
        ]
    ],
    "pageTitle": "Patent US6950881 - System for converting wireless communications for a mobile device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6950881?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 491900575,
    "recordOffset": 491870479,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27644=This application claims priority to U.S. Patent App. No. 60/163,115, entitled Portal Configuration in Wireless Medium, to Moeller et al., filed Nov. 2, 1999; to U.S. patent application Ser. No. 09/513,554, entitled System and Automatic Data Retrieval on an Internet Protocol Network, to Ndili et al., filed on Feb. 25, 2000; and to U.S. Patent App. No. 60/204,502, entitled System for Providing Network Content to Wireless Devices, to Ndelie et al., filed May 16, 2000; all of which are incorporated by reference herein., 66115=It an embodiment, a user defined database may be coupled to the system 600 to enable conversion engine 550 to use user-defined parameters in accessing network sites. Additional description of this feature is described with U.S. patent application Ser. No. 09/513,554, entitled System and Automatic Data Retrieval on an Internet Protocol Network, to Ndili et al., filed on Feb. 25, 2000, which is incorporated by reference in this application.}",
    "textBeforeTable": "Patent Citations The foregoing description of various embodiments of the invention has been presented for purposes of illustration and description. It is not intended to limit the invention to the precise forms disclosed. Many modifications and equivalent arrangements will be apparent. F. CONCLUSION In step 496, the segment is signaled to mobile device 560. The segment may be signaled with a user-interactive feature (icon) to signal a request for a next segment. In step 498, a determination is made as to whether a next segment is the last segment for the network content. If in step 498, a next segment is a last segment, then the last segment is signaled to mobile device 550 in step 499 as the last segment. If there is another segment, then steps 496-499 are repeated. If the distance between the located space and the open tag is greater than the distance between the located space the close tag, then the located space is considered attached. A next space is then located on the break line. The next space may correspond to the space appearing to the right of the close tag. The spaces appearing on the page break line are checked in this manner until a free unattached space is located. Once the free unattached space is located, the segment is paginated. To ensure the free unattached space is between an open or closed bracket, the content",
    "textAfterTable": "WO1998000787A1 Jun 30, 1997 Jan 8, 1998 Datalink Systems Corp Electronic mail system for receiving and forwarding e-mail messages based on subscriber supplied criteria WO1999017504A1 Sep 9, 1998 Apr 8, 1999 Ericsson Ge Mobile Inc Messaging application having a plurality of interfacing capabilities WO2000039666A1 Dec 28, 1999 Jul 6, 2000 Spyglass Inc Converting content of markup data for wireless devices * Cited by examiner Non-Patent Citations Reference 1 \"WAP Architecture\", WAP Architecture version 3.0; Apr. 30, 1998; pp. 1-20. 2 * Comment on HDML Submission; www.w3.org/submission/1997/5/comment.html. 3 Eija Kaasinen et al, \"Two Approaches to Bringing Internet Services to WAP devices\", Computer Networks 33 (2000) pp. 231-246. 4 * Real-time content-based processing of multicast video, Zhou et al, IEEE 1998. 5 Timothy Bickmore et al., \"Web Page Filtering And Re-Authoring For",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}