{
    "relation": [
        [
            "Citing Patent",
            "US6038569 *",
            "US6374249 *",
            "US6766329 *",
            "US6978281 *",
            "US7028057",
            "US7152224 *",
            "US7475097 *",
            "US7478118 *",
            "US7496912 *",
            "US7519617",
            "US7634520 *",
            "US7640222",
            "US7665063 *",
            "US7683904 *",
            "US7711919",
            "US7836028",
            "US7941408 *",
            "US7975291 *",
            "US8015161 *",
            "US8032496 *",
            "US8073802",
            "US8250525",
            "US8577841 *",
            "US8624898",
            "US8886671",
            "US20040267795 *",
            "US20050091291 *",
            "US20050114409 *",
            "US20050120062 *",
            "US20050120064 *",
            "US20110302143 *",
            "US20130117230 *",
            "US20140040303 *"
        ],
        [
            "Filing date",
            "Feb 10, 1997",
            "Aug 11, 1999",
            "Jan 31, 2000",
            "Nov 21, 2000",
            "Jul 25, 2002",
            "Nov 21, 2000",
            "Nov 24, 2004",
            "Jun 29, 2006",
            "Feb 27, 2004",
            "Jul 16, 2004",
            "Oct 7, 2005",
            "Mar 3, 2006",
            "May 26, 2004",
            "Nov 5, 2004",
            "Aug 12, 2005",
            "Jul 25, 2002",
            "Sep 3, 2004",
            "Dec 3, 2007",
            "Sep 3, 2004",
            "Sep 3, 2004",
            "Nov 16, 2009",
            "Mar 2, 2007",
            "Dec 2, 2011",
            "Mar 9, 2009",
            "Aug 14, 2013",
            "Jul 16, 2004",
            "Nov 24, 2004",
            "Sep 3, 2004",
            "Sep 3, 2004",
            "Sep 3, 2004",
            "Jun 2, 2010",
            "Dec 2, 2011",
            "Oct 11, 2013"
        ],
        [
            "Publication date",
            "Mar 14, 2000",
            "Apr 16, 2002",
            "Jul 20, 2004",
            "Dec 20, 2005",
            "Apr 11, 2006",
            "Dec 19, 2006",
            "Jan 6, 2009",
            "Jan 13, 2009",
            "Feb 24, 2009",
            "Apr 14, 2009",
            "Dec 15, 2009",
            "Dec 29, 2009",
            "Feb 16, 2010",
            "Mar 23, 2010",
            "May 4, 2010",
            "Nov 16, 2010",
            "May 10, 2011",
            "Jul 5, 2011",
            "Sep 6, 2011",
            "Oct 4, 2011",
            "Dec 6, 2011",
            "Aug 21, 2012",
            "Nov 5, 2013",
            "Jan 7, 2014",
            "Nov 11, 2014",
            "Dec 30, 2004",
            "Apr 28, 2005",
            "May 26, 2005",
            "Jun 2, 2005",
            "Jun 2, 2005",
            "Dec 8, 2011",
            "May 9, 2013",
            "Feb 6, 2014"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "I2 Technologies Us, Inc.",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Oracle International Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Research In Motion Limited",
            "International Business Machines Corporation",
            "Microsoft Corporation",
            "Advent Software, Inc.",
            "Pegasystems Inc.",
            "Pegasystems, Inc.",
            "Pixar",
            "Pegasystems Inc.",
            "Oracle International Corporation",
            "Oracle International Corporation",
            "Fujitsu Limited",
            "Oracle International Corporation",
            "Oracle International Corporation",
            "Pegasystems, Inc.",
            "Pegasystems Inc.",
            "Sap Ag",
            "Pixar",
            "Advent Software, Inc.",
            "Nicholson Andrew L.",
            "Microsoft Corporation",
            "Oracle International Corporation",
            "Oracle International Corporation",
            "Oracle International Corporation",
            "Microsoft Corporation",
            "Sap Ag",
            "Le Ouyang"
        ],
        [
            "Title",
            "System for data structure loading with concurrent image copy",
            "Data structure and operations for time-varying variable in an enterprise model",
            "Dynamic personalized information organizer",
            "Versioned project data",
            "Versioned relational database system with an optimistic constraint model",
            "Versioned project associations",
            "Project-based configuration management method and apparatus",
            "Method and apparatus for synchronizing of databases connected by wireless interface",
            "Methods and arrangements for ordering changes in computing systems",
            "Dynamic personalized information organizer",
            "Audit trail tools for transaction systems",
            "Rules base systems and methods with circumstance translation",
            "Integration of declarative rule-based processing with procedural programming",
            "Manual component asset change isolation methods and apparatus",
            "Methods and apparatus for digital data processing with mutable inheritance",
            "Versioned database system with multi-parent versions",
            "System, structure, interface, and semantics for implementing row versions: accessing past versions of a data item",
            "Network node machine and information network system",
            "Method and mechanism for determining life intervals for a key in an index",
            "Method and mechanism for row versioning",
            "Rules base systems and methods with circumstance translation",
            "Proactive performance management for multi-user enterprise software systems",
            "Enablement of quasi time dependency in organizational hierarchies",
            "Typed dependency graphs",
            "Multi-tenant in-memory database (MUTED) system and method",
            "Dynamic personalized information organizer",
            "Project-based configuration management method and apparatus",
            "Method and mechanism for row versioning",
            "System, structure, interface, and semantics for implementing row versions: accessing past versions of a data item",
            "Method and mechanism for determining life intervals for a key in an index",
            "Multi-version concurrency with ordered timestamps",
            "Enablement of Quasi Time Dependency in Organizational Hierarchies",
            "Enablement of Quasi Time Dependency in Organizational Hierarchies"
        ]
    ],
    "pageTitle": "Patent US5890166 - Versioned-database management system in which tasks are associated with ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5890166?dq=6,970,917",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473119939,
    "recordOffset": 473047892,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{268938=FIG. 16 shows in flowchart form the details of the VDMS CHANGE subprocess. At 2601 a determination is made whether the part is at the working variant level. If the part is not at the working variant level then it is determined at 2602 whether the part has a version at a higher level. If the part does not have a version at a higher level then the part is created at the working variant level at 2603. If the part does have a version at a higher level then the part is drawn down to the working variant level at 2604. At 2605 the change is applied to the version at the working variant level. At 2606 it is determined whether the part at the working variant level is in the current promote group. If the part at the working variant level is not in the current promote group then the part is added at the working variant level to the current promote group at 2607. For each triggered change, if any, the VDMS CHANGE subprocess is called at 2608 to perform the triggered change to the other part. This is a recursive call., 23270=This application is a continuation of application Ser. No. 07/916,329, filed Jul. 16, 1992 in the name of the present inventors, now abandoned., 72253=As is the case for all variants, although the effective times of variants define an ordering of the variants, all variants are active. The 1991 variant can still be updated after the 1992 variant has been created., 269978=FIG. 17 shows in flowchart form the details of the VDMS PROMOTE subprocess. At 2701 the part is promoted. At 2702, a loop is entered, encompassing 2702 to 2706, for all promote groups. At 2703 it is determined whether the promote group contains the promoted part at the working variant level. If the promote group contains the promoted part at the working variant level then the part at the working variant level is removed from the promote group at 2704. If the promote group contains the promoted part at the working variant level then it is determined at 2705 whether the promote group contains the part at the promote target level (the next higher level). If the promote group does not contain the part at the promote target level then at 2706 the part is added at the promote target level to the promote group., 62594=variant time. The time range, stored as a start and end timestamp, when a variant is considered to be effective, as for example the 1991 variant for the FICA deduction part would have an effective time from Jan. 1, 1991 through Dec. 31, 1991. The start time is the time when the variant is effective for the user installation and the end time is the time when the variant ceases to be effective., 71542=The former describes a version of a particular processor as it will be configured in 1991 and the latter describes the same processor as it will be configured in 1992., 266947=FIG. 15 shows in flowchart form the process for grouping updates associated with a task according to the present invention. The main portion of the process start at 2501 by performing steps 2501 to 2507 for each user task. At 2502, the current promote group is set to the promote group that is associated with the user task. At 2503, the working variant to which the changes are to be applied is set. At 2504, a loop is entered, encompassing 2505 to 2507, for each tool to be used to accomplish the user task. The tool is invoked at 2505. At 2506, step 2507 is iterated for each part that is changed by the tool. 2507 itself invokes the VDMS CHANGE subprocess to perform the change to the part. At 2508, a loop is entered, encompassing 2509 to 2518, for each user task whose changes are to be promoted. At 2509, the promote group associated with the user task is determined. At 2510, the candidate set of parts to be promoted is initialized to all the parts in the determined promote group that are at the working variant level. It is indicated at 2511 that the determined promote group has been included. At 2512, a loop in entered, encompassing 2513 to 2517, until no more promote groups have been included. At 2513, a loop in entered, encompassing 2514 to 2517, for each candidate part in the set. At 2514, a loop in entered, encompassing 2515 to 2517, for each promote group that has not been included. At 2515 it is determined whether the part at the working variant level is in the promote group that has not been included. If the part at the working variant level is in the promote group then at 2516 the candidate set of parts is increased by all the parts at the working variant level that are in the promote group that has not been included. If the part at the working variant level is in the promote group then it is indicated at 2517 that the promote group has been included. At 2518, the VDMS PROMOTE subprocess is invoked for each part in the candidate set.}",
    "textBeforeTable": "Patent Citations Using the foregoing specification the invention may be implemented via standard programming and/or engineering techniques. The resulting program(s) may be stored on disk, diskettes. memory cards, ROM or any other memory device. For execution, the program(s) may be copied into the system memory (RAM) associated with the CPU. One skilled in the art of computer science will readily be able to combine the software created as described with appropriate general purpose or special purpose computer hardware to create a computer system embodying the invention. While the invention has been particularly described and illustrated with reference to a preferred embodiment, it will be understood by those skilled in the art that changes in the description or illustrations may be made with respect to form or detail without departing from the spirit and scope of the invention. 13.0 CONCLUSION PART3 at TEST PART2 at TEST PART1 at TEST Note that PART2 and PART3 are in the promote group only at the TEST level and hence are not included in the set of candidate parts. For each candidate part it is identified which other promote groups that are not already included (if any) contain the part at the USER level. No other promote groups are identified, therefore the set of candidate parts is complete. (22) The user promotes the set of candidate parts from the USER level to the TEST level, meaning that part PART1 is promoted. (23) As",
    "textAfterTable": "Microsoft Corporation Dynamic personalized information organizer US7634520 * Oct 7, 2005 Dec 15, 2009 Advent Software, Inc. Audit trail tools for transaction systems US7640222 Mar 3, 2006 Dec 29, 2009 Pegasystems Inc. Rules base systems and methods with circumstance translation US7665063 * May 26, 2004 Feb 16, 2010 Pegasystems, Inc. Integration of declarative rule-based processing with procedural programming US7683904 * Nov 5, 2004 Mar 23, 2010 Pixar Manual component asset change isolation methods and apparatus US7711919 Aug 12, 2005 May 4, 2010 Pegasystems Inc. Methods and apparatus for digital data processing with mutable inheritance US7836028 Jul 25, 2002 Nov 16, 2010 Oracle International Corporation Versioned database system with multi-parent versions US7941408 * Sep 3, 2004 May 10, 2011 Oracle International Corporation System, structure, interface, and semantics for implementing row versions: accessing past versions of a data item",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}