{
    "relation": [
        [
            "Citing Patent",
            "US6490013 *",
            "US6657686 *",
            "US6958791 *",
            "US7079214",
            "US7283192",
            "US8368848 *",
            "US20100039588 *",
            "USRE45283",
            "WO2012103663A1"
        ],
        [
            "Filing date",
            "24 May 2001",
            "29 Jun 2001",
            "6 Jun 2003",
            "17 May 2005",
            "20 Apr 2006",
            "2 Apr 2008",
            "2 Apr 2008",
            "16 Mar 2011",
            "30 Jan 2012"
        ],
        [
            "Publication date",
            "3 Dec 2002",
            "2 Dec 2003",
            "25 Oct 2005",
            "18 Jul 2006",
            "16 Oct 2007",
            "5 Feb 2013",
            "18 Feb 2010",
            "9 Dec 2014",
            "9 Aug 2012"
        ],
        [
            "Applicant",
            "Sanyo Electric Co., Ltd.",
            "Lg.Philips Lcd Co., Ltd.",
            "Sharp Kabushiki Kaisha",
            "Sharp Kabushiki Kaisha",
            "Sharp Kabushiki Kaisha",
            "Institut Telecom/Telecom Bretagne",
            "Institut Telecom/Telecom Bretagne",
            "Sharp Kabushiki Kaisha",
            "Universidad De Chile"
        ],
        [
            "Title",
            "Vertical alignment liquid crystal display having improved driving voltage control",
            "Ferroelectric liquid crystal display and fabricating method thereof",
            "Liquid crystal display",
            "Liquid crystal display",
            "Liquid crystal display",
            "Method for manufacturing a PSFLC-based and/or PSAFLC-based electrooptic cell and corresponding electrooptic cell, device and helmet",
            "Method for manufacturing a psflc-based and/or psaflc-based electrooptic cell and corresponding electrooptic cell, device and helmet",
            "Liquid crystal display",
            "In situ polymerisation process for obtaining an electro-optical apparatus, said polymer and electro-optical apparatus; and uses thereof"
        ]
    ],
    "pageTitle": "Patent US6215543 - Ferroelectric liquid crystal device comprising a polymer and exhibiting a ... - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6215543",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989790.89/warc/CC-MAIN-20150728002309-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477204091,
    "recordOffset": 477180859,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42357=SCE13+5% RLC1−approximately 0.1% Darocur 1173., 25485=Typical known materials (where materials are a mixture of compound having suitable liquid crystal characteristics) which do not allow such a minimum when included in a ferroelectric device include the commercially available materials known as SCE13 and ZLI-3654 (both supplied by Merck UK Ltd. Poole, Dorset). A device which does show such a minimum may be constructed according to PCT GB 88/01004 and utilising materials such as e.g. commercially available SCE8 (Merck UK Ltd). Other examples of prior art materials are exemplified by PCT/GB/86/00040, PCT/GB87/00441 and UK 2232416B., 42489=SCE8+1% RLC1+approximately 0.1% Darocur 1173., 41963=Examples of suitable photoinitiators include Darocurs and Igacurs available from Merck UK such as Darocur 1173 or 4265 and Igacur 651. There are various UV curables which are available, some examples are Electrolite corporation materials such as ELC 4481 available through Intertronics Ltd. Kidlington, Oxon., 43419=For the examples contained in FIGS. 2-7, all of those that were cured were flow filled, thermally cycled and cured in the SC phase under a UV lamp with no field applied. The initiator used was Darocur 1173 (approximately 0.1%)., 23266=Other addressing schemes are described in GB-2,146,473-A; GB-2,173,336-A; GB-2,173,337-A; GB-2,173,629-A; WO 89/05025: Harada et al 1985 S.I.D. Paper 8.4 pp 131-134; Lagerwall et al 1985 I.D.R.C. pp 213-221 and P Maltese et al in Proc 1988 I.D.R.C. p 90-101 Fast Addressing for Ferroelectric LC Display Panels., 20776=Ferroelectric smectic liquid crystal materials, which can be produced by mixing an achiral host and a chiral dopant, use the ferroelectric properties of the tilted chiral smectic C, F, G, H, I, J and K phases. The chiral smectic C phase is denoted SC* with the asterisk denoting chirality. The SC* phase is generally considered to be the most useful as it is the fastest switching. Ferroelectric smectic liquid crystal materials should ideally possess the following characteristics: low viscosity, controllable spontaneous polarisation (Ps) and an SC* phase that persists over a broad temperature range, which should include ambient temperature and exhibits chemical and photochemical stability. Materials which possess these characteristics offer the prospect of very fast switching liquid crystal containing devices. Some applications of ferroelectric liquid crystals are described by J. S. Patel and J. W. Goodby in Opt. Eng., 1987, 26, 273., 42620=SCE8+0.5% RLC1+approximately 0.1% Darocur 1173. Thermally aligned., 19247=This is a divisional of application Ser. No. 08/793,527, filed Feb. 27, 1997, now pending, the entire content of which is hereby incorporated by reference in this application.}",
    "textBeforeTable": "Patent Citations Examples were also tested wherein the materials were cured in the isotropic state after flow filling in the isotropic state. For the examples contained in FIGS. 2-7, all of those that were cured were flow filled, thermally cycled and cured in the SC phase under a UV lamp with no field applied. The initiator used was Darocur 1173 (approximately 0.1%). FIGS. 2-7 illustrate the appearance of liquid crystal cells viewed under a microscope before and after they had been subjected to mechanical shock. Typically cells were 1.5-2.0 μm thick for these experiments, though cells of any suitable thickness could have been used. For example 3, one cell was cured a/ in the presence of a d.c. field and another cell b/ was cured without the field. It was only for the cell cured without the presence of a field (3 b) that electro-optic switching studies for example tmin, Vmin studies could be carried out on. tmin against Vmin plots were run for example 3. SCE8+0.5% RLC1+approximately 0.1% Darocur 1173. Thermally aligned. EXAMPLE 3 SCE8+1% RLC1+approximately 0.1% Darocur 1173. EXAMPLE 2 SCE13+5% RLC1−approximately 0.1% Darocur 1173. EXAMPLE 1 Examples of suitable photoinitiators include Darocurs and Igacurs available from Merck UK such as Darocur 1173 or 4265 and Igacur 651. There are various UV curables which are available, some examples are Electrolite corporation materials such as ELC 4481 available through Intertronics Ltd.",
    "textAfterTable": "1 Applied Physics Letters, Feb. 7, 1994, USA., vol. 64, No. 6, ISSN 003-6951, pp. 718-720, XP 000422877 Kyehun Lee et al, \"Fast linear electro-optical switching properties of polymer-dispersed ferroelectric liquid crystals.\" 2 Ferroelectrics, 1993, UK, vol. 148, No. 1-4, ISSN 0015-0193, pp. 389-399, Lester G et al, \"Electro-optic behaviour of low molar mass FELC's doped with liquid cyrstal polymers\". 3 Informacije Midem, Mar. 1993, Slovenia, vol. 23, No. 1, ISSN 0352-9045, pp. 38-42, Pirs J et al, \"Ferroelectric liquid crystal-polymer gel displays\". Referenced by Citing Patent Filing date Publication date Applicant Title US6490013 * 24 May 2001 3 Dec 2002 Sanyo Electric Co., Ltd. Vertical alignment liquid crystal display having improved driving voltage control US6657686 * 29 Jun 2001 2 Dec 2003 Lg.Philips Lcd Co., Ltd. Ferroelectric liquid crystal display and fabricating method thereof US6958791 * 6 Jun 2003 25 Oct 2005",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}