{
    "relation": [
        [
            "",
            "Address",
            "1867 Yonge Street, Toronto, Ontario",
            "88 Wingold Avenue, Toronto, Ontario M6B 1P5"
        ],
        [
            "",
            "Amount of Space Square Feet",
            "12,768",
            "7,000"
        ],
        [
            "",
            "Use of Property",
            "Office space",
            "Office space"
        ]
    ],
    "pageTitle": "CC Filed by Filing Services Canada Inc. 403-717-3898",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Peace_Arch_Entertainment_Group_(PAE)/Filing/20-F/2007/F5433895",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 834773171,
    "recordOffset": 834653273,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{609487=February 25, 2005, 528823=The following table sets forth the compensation information for the Chief Executive Officer (\u0093CEO\u0094) and the next two (2) most highly compensated executive officers for services rendered in all capacities during the years ended August 31, 2006, 2005 and 2004.  , 462469=On February 7, 2006, the Company issued 1.5 million common share warrants to a firm of marketing and publicity consultants.  One million warrants vested immediately and 500,000 warrants vest at the end of the arrangement 12 months after the grant date, as a result, the Company recorded an expense of $469,000. Each warrant is convertible into one common share of the Company at an exercise price of US$0.54, exercisable to February 7, 2009. The fair value of each warrant was estimated on the date of grant using the Black-Scholes option pricing model with the following assumptions: an expected life of the warrants of 2-3 years, a risk free rate of interest of 4.0% and an expected volatility of between 94.38% and 102.6%., 139848=ANNUAL REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 268050=The Articles were modified to delete the rights, privileges and conditions attaching to each class of shares as provided in the Articles of Continuance dated September 1, 2004., 165723=2004, 840267=Incorporated by reference to our registration statement on Form 20-F for the year ended August 31, 2005, 425283=Revenues for fiscal 2006 were $21.3 million, up 98% from $10.7 million last year. Motion Picture and Television experienced increases of 2% and 46%, respectively. Home Entertainment revenues in 2006 represent seven months of revenues from the purchase, in the second quarter, of kaBOOM! Entertainment Inc.  , 389309=over 2004, 387047=2006, 216186=December 2006, 139381=REGISTRATION STATEMENT PURSUANT TO SECTION 12(b) OR (g) OF THE SECURITIES EXCHANGE ACT OF 1934, 619829=March 3, 2006, 595935=Oct 12, 2008, 591596=In 1997, the Company adopted a stock option plan (the Plan) which was approved by the Company\u0092s shareholders on January 28, 1998 pursuant to which the Company\u0092s Board of Directors may grant stock options to officers and key employees. On July 14, 1999, February 21, 2001, January 20, 2003, and February 2006, the Company\u0092s shareholders approved amendments to the Plan (the Amended Plan). In accordance with the Amended Plan, the number of shares issuable upon the exercise of options pursuant to the Amended Plan and any other Share Compensation Arrangements (as such term is defined in the Amended Plan) is 6,217,466 common shares of the Company. Stock options are granted with an exercise price in Canadian dollars equal to the stock\u0092s fair market value at the date of grant. All stock options have terms between one and three years and vest and become fully exercisable immediately or after up to 37 months. The Company intends to issue new shares for any stock options exercised., 835143=Agency Agreement dated June 7, 2006 between Westwind Partners Inc. and the Company, 495489=CEO of Peace Arch Entertainment Group Inc. since December 20, 2002; previously president of Greenlight Film and Television Inc. from 1997- December 20, 2002., 388973=over 2005, 763812=The New Withholding Regulations consolidate and modify the pre-2001 certification requirements and means by which a holder may claim exemption from U.S. federal income tax withholding and provide presumptions regarding the status of holders when payments to the holders cannot be reliably associated with appropriate documentation provided to the payor.  All holders should consult their tax advisors regarding the application of the New Withholding Regulations., 291231=In collaboration with its content partner Nelvana, during fiscal 2006 the Home Entertainment segment developed two unique branded product lines \u0096 \u0093Treehouse Presents,\u0094 and \u0093Teletoon Presents\u0094.  Peace Arch Home Entertainment has relationships with content providers such as Lionsgate (Maple Pictures), THINKFilm, Sesame Workshop, DIC Entertainment, Sony BMG, EMI Music, and more., 628474=On July 29, 2005, in connection with the private placement, the Company issued 4,347,827 Series II Preferred Share warrants.  Each warrant is convertible into one Series II Preference Share of the Company at a price of US$0.50 at any time up to July 29, 2007.  On December 30, 2005, 1,435,897 Series II Preference Share warrants were exercised at the subscription price of US $0.50 per share for total proceeds of US $717,948. On May 25, 2006, 726,032 Series II Preference Share warrants were exercised at a subscription price of US$0.50 per share for total proceeds of US$363,016.  On April 26, 2006, 500,000 Series II Preference Share warrants were exercised at a subscription price of US$0.50 per share for total proceeds of US$250,000.  On September 7, 2006, 500,000 Series II Preference Share warrants were exercised at a subscription price of US$0.50 per share for total proceeds of US$250,000., 703537=Year ending Aug 31, 2006, 476313=Film distribution rights commitment  At August 31, 2006 and 2005, the Company had commitments of $2,229,000 and $3,134,000, respectively, with respect to the acquisition of film distribution rights to 10 films, which will be delivered to the Company during the year ended August 31, 2007. These payments are required to be made at the date of delivery of the respective films which is expected to be no later than August 31, 2007., 788597=At the present time we have no derivative instruments outstanding.  The average exchange rate for fiscal 2006 was Cdn$0.8714 per US$1.00 (2005- Cdn$0.8114 per US$1.00).  , 540732=2004, 603550=As at August 31, 2006, the aggregate intrinsic value (difference between the market value and exercise price) for fully vested stock options was $548,000., 522291=Audit Committee:  The mandate of the Audit Committee is to review the Company\u0092s audited and interim financial statements and to report on such statements to the Board before the statements are approved by the Board.  To fulfill this responsibility, the Audit Committee meets with the Company\u0092s auditors to discuss the financial statements and any concerns raised by the auditors with respect to financial presentation or disclosure, and with respect to the Company\u0092s financial controls.  For the year ended August 31, 2006, the Audit Committee was composed exclusively of \u0093outside\u0094 directors, within the requirement of the TSX Guidelines.  , 771958=Interest rate risk primarily arises because we borrow funds to finance the production costs of our film and television programs, which are generally incurred in advance of contracted receipts and revenues from these programs. These loans usually bear interest at rates that change as market interest rates fluctuate. A rise in interest rates would cause an increase in the cost to produce our film and television programs and an adverse effect on our results of operations and financial condition.  At August 31, 2006 we had borrowings of $29,761,653 in United States and Canadian dollar currencies outstanding from financial institutions. The United States dollar loans of $16,903,918 bear interest at rates ranging from the financial institute\u0092s United States dollar base rate plus 1.5% to 30.0% per annum, while the $12,857,735 loans in Canadian dollars bear interest at rates ranging from a financial institute\u0092s prime lending rate minus 0.5% to plus 2.0%., 801585=The independent auditors of the Company are the firm PricewaterhouseCoopers LLP (\u0093PwC\u0094) who has served as our independent auditors since March 15, 2003.  Our shareholders have approved the appointment of PwC as our independent auditors for the fiscal year ending August 31, 2006., 314683=During 2006, the Company hired a Vice President of Public Relations.  Together with the President of the Company, the Vice President of Public Relations and an investor relations firm, based in Los Angeles, are working on exposing the Company to the business and entertainment trade press to have the Peace Arch name become more mainstream., 626016=July 27, 2007, 660360=As at August 31, 2006 and 2005, included in accounts receivable was $nil and $1,421,000 from a company owned by a member of senior management. This amount is a result of a sale of distribution rights to the related company prior to the individual becoming a member of senior management. The amount is secured by an irrevocable letter of credit., 364541=On December 21, 2006, the Company negotiated a settlement of an outstanding legal dispute with Viacom Inc., MTV Networks, and VH1 Music First et al. Viacom agreed to pay US$1.0 million as settlement to the Company\u0092s claim for damages in the original amount of US$2.7 million and consequential damages arising from the failure to honor a contract for the co-financing of the television series \u0093Big Sound\u0094. In addition, the Company entered into a distribution agreement with Viacom for the sale of certain U.S. broadcast rights for the television series \u0093Big Sound\u0094., 731178=In September 2006, the Company signed an offer to lease with Cushman & Lakefield LePage to lease space at 1867 Yonge Street, 7th Floor, and a portion of the 6th Floor, Toronto, Ontario for a term of 7 years commencing July 1, 2007., 538920=2005, 573017=This table describes the beneficial ownership of our Common Shares and our Preference Shares as of February 19, 2007 for all executive officers and directors individually and as a group.  This information does not reflect ownership of options or warrants., 295196=2006, 441075=Corporate overhead in fiscal 2005 was $1.6 million, up from $534,000 in 2004.  The increase was driven by the inclusion of a full year of operations of the Los Angeles office for fiscal 2005, and lower recovery of selling, general and administrative costs.  Included in 2005 was $257,000 of costs associated with the stock options granted to employees, none were granted in 2004., 270946=On January 23, 2006, the Company acquired 100% of the issues and outstanding shares of kaBOOM! Entertainment Inc. (kaBOOM), a home entertainment studio in Canada that distributes videocassettes, DVDs and ancillary merchandise to retailers and mass merchandisers in Canada, for a purchase price of approximately $7,983,000. The purchase price was paid by issuance of 1,033,058 common shares of the Company valued at $500,000, 50,000 options of the company valued at $17,000, and future cash consideration of $4,202,000 and direct costs of acquisition of $264,000. To finance the cash portion of the purchase price, the Company arranged a debt facility from a financial institution and for a portion of the cash and the balance was provided by letters of credit from the preference shareholders. kaBOOM! Entertainment Inc. was renamed to Peace Arch Home Entertainment Inc. on September 12, 2006., 604100=For the year ended August 31, 2006, there was no income tax benefit for total stock based compensation costs., 776391=2007, 742664=transactions may be subject to special and/or different rules not discussed below.  Statements of legal conclusion of U.S. tax considerations as to the material U.S. federal income tax consequences of the acquisition, ownership and disposition of the Common Shares by U.S. Holders do not purport to be a complete analysis or listing of all possible tax considerations.  The discussion of U.S. tax considerations is based upon the sections of the Internal Revenue Code of 1986, as amended including the American Job Creation Act 2004 (the \u00932004 Act\u0094) which was enacted October 22, 2004, Internal Revenue Service (\u0093IRS\u0094) rulings, published administrative positions of the IRS and court decisions that are applicable as of February 25, 2005, any or all of which could be materially and adversely changed, possibly on a retroactive basis, at any time.  This discussion does not consider the potential effects, both adverse and beneficial, of any recently proposed legislation which, if enacted, could be applied, possibly on a retroactive basis, at any time.  Statements of legal conclusions of Canadian tax considerations as to the material Canadian federal income tax consequences of the acquisition, ownership and disposition of the Common Shares by U.S. Holders do not purport to be a complete analysis or listing of all possible tax consequences.  The discussion of Canadian tax considerations is based upon the provisions of the Income Tax Act (Canada) (the \u0093Tax Act\u0092\u0092), the Convention between Canada and the U.S. of America with Respect to Taxes on Income and on Capital, as amended from time to time (the \u0093Convention\u0092\u0092), our understanding of published administrative practices of Canada Revenue Agency (formerly, Canada Customs and Revenue Agency) and judicial decisions, all of which are subject to change. The discussion does not take into account the tax laws of the various provinces or territories of Canada or the tax laws of the various state and local jurisdictions in the U.S., 662798= During the year ended August 31, 2006, the Company paid interest of $13,000 to a member of the Company\u0092s senior management in respect of an interim bridge loan provided for one of the Company\u0092s productions.  The interest is reflected as a cost of that production in investment in film and television programming., 665652=The financial statements as required under Item 18 are attached hereto and found immediately following the text of this Annual Report.  The report of PricewaterhouseCoopers LLP, Chartered Accountants for each of the years in the three-year period ended August 31, 2006 and the consolidated balance sheet data as of August 31, 2005 and 2006 is included herein immediately preceding the financial statements.  , 683242=Year ending Aug 31, 2002, 456379=On December 30, 2005, 1,435,897 Series II Preference Share warrants were exercised at a price of US$0.50 per share for total proceeds of US$717,948., 294682=Year Ended August 31,, 159306=The Company has revised its previously issued August 31, 2006 and 2005 US GAAP financial information furnished on form 6-K filed on November 30, 2006 to retrospectively reflect a change in accounting policy relating to share purchase warrants with an exercise price denominated in a currency other than the Company\u0092s functional currency. These are now reflected as a derivative liability.  Please refer to note 32 of the financial statements in ITEM 18., 498908=Currently CFO of Webtech Wireless Inc. Previously CFO of Peace Arch Entertainment from January 2003-September 2003; President & CEO from December 2001-January 2003; CFO from 1996-March 2001., 728327=On March 31, 2005, Fremantle converted its $8,793,000 note plus interest for 2,931,125 shares of the Company\u0092s stock. On March 30, 2006, Comerica converted its US$1,075,000 loan for 215,000 shares of the Company\u0092s common stock set aside for the settlement of the Comerica debt. The transaction is further described in Item 4 herein and the agreements are incorporated by reference in Item 19., 627395=June 7, 2006, 286931=During fiscal 2006, the Company delivered 10 feature films and had 9 other features in production at year-end. The films delivered during fiscal 2006 were: The Veteran, Heartstoppers, Warriors of Terra, 5ive Girls, The Last Sect, UKM: Ultimate Killing Machine, Troubled Waters, Living Death, Dead Mary and Delirious. The films acquired or in production at the end of fiscal 2006 were: Chapter 27, Watching the Detectives, Guantanamero, In Tranzit, The Mad, Bottom Feeder, Harm\u0092s Way, Stillborn and Never Forget., 440567=Segment earnings (loss) from operations before the undernoted were $599,000 for the year, 52.5% lower than 2004., 754670=For any taxable year of Peace Arch, if at least 75% of our gross income is \u0093passive income\u0094, as defined in the Code, or if at least 50% of our assets, by average fair market value, or, prior to fiscal year 1998, possibly by adjusted tax basis, are assets that produce or are held for the production of passive income, we will be a passive foreign investment company (\u0093PFIC\u0094).  If we are a PFIC for any taxable year during which a U.S. Holder holds any Common Shares, the U.S. Holder will be subject to special U.S. federal income tax rules, set forth in Sections 1291 to 1298 of the Code, with respect to all of such U.S. Holder\u0092s Common Shares.  If we were treated as a PFIC at any time during a U.S. Holder\u0092s holding period for Common Shares, such U.S. Holder generally would be subject to additional tax as well as interest charges with respect to the deferral of tax for the period during which such Common Shares were held.  Any, 431209=Segment earnings were $876,000 for the year.  The Company acquired kaBOOM in January 2006 as part of the Company\u0092s strategy to diversify operations by selling directly to video and DVD retailers., 277901=Pursuant to a Release and Reconstitution Agreement with Comerica Bank (\u0093Comerica\u0094), the terms of a loan guarantee of US$1,075,000 were restructured to restrict repayment of the loan to the ultimate sales proceeds of certain specific exploitation rights and, subject to priority interests, including repayment to Fremantle, to certain assets. The Company also issued a Conversion Right Certificate (the Comerica conversion instrument) to Comerica wherein it was agreed that if any amount of the loan remained outstanding as of December 31, 2005, Comerica would, for a period of 90 days, have the right to convert such unpaid amount to common shares in the capital of the Company at a deemed price of $5.00 per share. Pursuant to the terms of the Comerica conversion instrument, the Company reserved a sufficient number of shares that could be issued in settlement of the US$1,075,000 obligation.  On March 30, 2006 Comerica converted its US$1,075,000 loan for 215,000 common shares in the Company.  During fiscal 2006, the Company recognized a loss of $15,000 on the settlement of its obligation which represents the extinguishment of the Company\u0092s distribution liability to Comerica. Since the Company had issued a right to receive a variable amount of shares in settlement of their obligations, the Company reflected the amounts as a liability., 648548=As at August 31, 2006, the shareholders\u0092 list for our shares showed 255 registered common shareholders and 31,308,665 Common Shares outstanding.  , 140921=SHELL COMPANY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 792015=Our articles of amendment were filed on Form 6K on July 28, 2005 and incorporated by reference to our Form 20F for the year ended August 31, 2005 as exhibit 1.10., 689547=Year ending Aug 31, 2005, 284651=The Company has a track record of delivering critically acclaimed productions to both film and television distributors. In 2006, the Company\u0092s film Delirious was awarded three prizes in the elite competition section of the 54th San Sebastian International Film Festival. In 2005, the Company\u0092s television motion picture, Our Fathers, was nominated for two Emmy awards, and the Directors Guild of Canada nominated the Company\u0092s feature, The Good Shepherd, for two awards. In addition, the Company won six Leo Awards for programming excellence for its projects Love it or Lose it! and Prisoners of Age. The success of these projects enhances the demand for Peace Arch\u0092s existing and future productions and increases the Company\u0092s visibility, enhancing the long-term marketability and value of its library of film and television programming both domestically and internationally., 476907=Guarantee of sales performance  At August 31, 2005, the Company provided a guarantee of the sales performance of its subsidiary Peace Arch Films Limited (PAF) of US$2,500,000 to assist with a third party producer\u0092s financing for a production for which PAF has acquired worldwide distribution rights.  The Company has been advised that the related financing obligation was fully satisfied prior to August 31, 2006., 295684=2004, 269613=The Company\u0092s agent for service in the United States is National Registered Agents Inc., 1090 Vermont Avenue, NW, suite 910, Washington, D.C. 20005., 470122=The proliferation of cable and satellite television channels and expanding demand for television programs on DVD have created significant new niche markets for much of the Company\u0092s past, present and future television programming.  The acquisition of kaBOOM! Entertainment Inc. in fiscal 2006 serves as a vehicle for the Company to exploit these new revenues., 665092=Our financial statements are stated in Canadian Dollars (CDN$) and are prepared in accordance with Canadian Generally Accepted Accounting Principles (GAAP) in Canada, the application of which, in our case, conforms in all material respects for the periods presented with United States GAAP except as explained in note 32 of our fiscal 2006 consolidated financial statements included under Item 18 herein., 290005=During fiscal 2006, the Company acquired 100% of kaBOOM! Entertainment Inc. (\u0093kaBOOM!\u0094), one of Canada\u0092s leading independent home entertainment studios. kaBOOM! Entertainment Inc. was renamed Peace Arch Home Entertainment Inc. and continues to conduct business under the kaBOOM! label for its children\u0092s products and under the Peace Arch Entertainment for all others products.  This strategic acquisition emphasizes the Company\u0092s focus on building its distribution business., 496369=January 20, 2003, 366237=In September 2006, the CICA released new Handbook Section 1506, \u0093Accounting Changes\u0094 (Section 1506), effective for annual and interim periods beginning on or after January 1, 2007. This section replaces the former section 1506 which establishes criteria for changing accounting policies, together with the accounting treatment and disclosure of changes in accounting policies and estimates, and correction of errors.  The Company has determined that Section 1506 will not have any impact to the consolidated results of operations or financial position., 434623=In fiscal 2006, $1.1 million of interest on indebtedness relating to production of film and television programming was capitalized. In fiscal 2005, $0.7 million of interest on indebtedness relating to production of film and television programming was capitalized. Interest component may vary each year depending on the dollar value of production during the year and the timing of production commencement and delivery during the year., 729198=On January 23, 2006, the Company acquired 100% of the issued and outstanding shares of kaBOOM! Entertainment Inc. (kaBOOM!), a home entertainment studio in Canada that distributes videocassettes, DVDs and ancillary merchandise to retailers and mass merchandisers in Canada. The cost of the purchase was $7,983,000 consisting of 1,033,058 common shares of the Company valued at $500,000, 50,000 options of the Company valued at $17,000, cash consideration of $3,000,000 paid at the time of closing, future cash consideration of $4,202,000 and direct costs of acquisition of $264,000., 536943=2006, 590918=The complete list of options outstanding to our directors and members of our administration and management is set out below under \u0093Stock Options Outstanding as at August 31, 2006\u0094., 282276=Pursuant to the original arrangements with PAPDC, the Company was obligated to carry out management services for PAPDC. This obligation continued until June 25, 2004. During the year ended August 31, 2006, the Company recovered costs against the payable to Fremantle of $nil and $145,000 and $427,000 for the years ended August 31, 2005 and 2004, respectively.  , 431805=The Corporate results represent the incremental cost of corporate overhead in excess of the amount allocated to the other operating divisions.  Corporate overhead in fiscal 2006 was $3.5 million, up from $1.5 million in 2005.  The increase is a result of additional support required for organic growth and the acquisition of kaBOOM!.  Stock-based compensation and warrant costs increased to $1.4 million in fiscal 2006 from $257,000 last year.  This increase reflects the Company\u0092s higher expense for the costs related to warrant issues and stock options granted to employees during the year., 730626=On June 7, 2006, the Company granted, as partial compensation to retain Westwind Partners Inc., an investment banker as its financial advisor in connection with the private placement described in note 18(a)(vi) of the financial statements, a warrant to purchase up to 269,000 common shares at an exercise price of $1.21 per share, exercisable to June 7, 2010 as described in note 20., 659149=During the year ended August 31, 2006 and 2005, the Company paid $190,000 and $185,000, respectively, to a company controlled by a shareholder, director and officer of the Company for executive services rendered. These expenditures are reflected in the company\u0092s selling, general and administrative expenses., 830934=Agreement to Purchase Peace Arch Project Development and Subsidiaries \u0096 May 26, 2005(4), 208404=2005, 759954=We would be treated as a \u0093foreign investment company\u0094 as defined in Section 1246 of the Code if 50% or more of the combined voting power or total value of the Company\u0092s outstanding shares are held, directly or indirectly, by citizens or residents of the United States, United States domestic partnerships or corporations, or estates or trusts other than foreign estates or trusts (as defined by the Code Section 7701(a)(31)), and the Company is found to be engaged primarily in the business of investing, reinvesting or trading in securities, commodities or any interest therein.  It we are assessed as being a foreign investment company, then this could cause all or part of any gain realized by a U.S. Holder selling or exchanging shares to be treated as ordinary income rather than capital gain.  The 2004 Act repeals the foreign investment company rules.  This repeal is effective after 2004., 513039=Richard Watson was appointed as a director on January 20, 2003.  Mr. Watson has practiced corporate commercial law in Toronto for over 25 years.  During that time, he has been legal counsel for a wide variety of Canadian public and private companies.  Mr. Watson has over 20 years of business and advisory experience in the Canadian film industry, working with writers, directors and production companies and has had significant involvement with the financing of Canadian feature films., 352268=1867 Yonge Street, Toronto, Ontario  , 659771=During the year ended August 31, 2006 and 2005, the Company paid $nil and $32,000, respectively, to a shareholder, director and officer of the Company for legal services rendered. These expenditures are reflected in the Company\u0092s selling, general and administrative expenses, 330792=Refundable Income Tax Credit \u0096 Province of Ontario     Under the terms of the current film and television provincial tax credit system under the Income Tax Act (Ontario), the Province of Ontario offers refundable tax credit incentives for Ontario film productions.  The incentives as at August 31, 2006 are as follows:, 457368=On April 24, 2006, 500,000 Series II Preference Share warrants were exercised at a price of US$0.50 per share for total proceeds of US$250,000., 559525=The following chart shows the number of persons employed by the Company by activity and by geography as at August 31, 2006:, 816594=Special Resolution of Vidatron Enterprises Ltd., filed May 1, 1990, canceling previous Articles of Vidatron Enterprises Ltd. and substituting new Articles of Vidatron Enterprises Ltd. (1), 140431=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 794535=As required by Rule 13a-15 under the Exchange Act, the Company\u0092s management with the participation of the Chief Executive Officer and Chief Financial Officer evaluated the effectiveness of the Company\u0092s disclosure controls and procedures .  Based upon that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that the Company\u0092s disclosure controls and procedures were effective as of August 31, 2006, which is the end of the Company\u0092s most recently completed fiscal year.  , 622397=Nov.14, 2006, 140025=For the fiscal year ended August 31, 2006, 436203=FISCAL 2005 COMPARED TO FISCAL 2004, 273992=On December 21, 2006, the Company acquired 100% of the issued and outstanding shares of Castle Hill Productions Inc. and Dream LLC, which holds the rights to a library of films for a purchase price of US$9,000,000. The purchase consideration is US$8,000,000 cash and US$1,000,000 in issuance of Company shares.   The total amount of Common Shares issued was 1,120,419 and the fair value per Common Share was US$0.89, determined by the 10 day weighted average prior to closing.  , 594192=in Fiscal 2006, 217404=August, 287862=The Company\u0092s Television segment derives revenues by licensing television films, documentaries and other programming produced or acquired by the Company to broadcasters, cable and satellite television providers and home entertainment distributors domestically and abroad. In fiscal 2006, the Company expanded its television division beyond its traditional lifestyle and documentary niche to include made-for-television movies and mini-series. During, 605572=STOCK OPTIONS OUTSTANDING AS AT FEBRUARY 19, 2007, 456878=On March 30, 2006, Comerica Bank of California agreed to convert its US$1,075,000 loan for 215,000 shares of the Company\u0092s common shares., 165312=2005  , 601270=May 15, 2009, 449228=As at August 31, 2006, the Company had cash or cash equivalents available of $1.2 million compared to $1.4 million in 2005 and had drawn $1.8 million on its $2.5 million bank credit facility., 454647=Production Loans  The Company enters into various loan financing arrangements for the purpose of commencing a production of a film project or the acquisition of film distribution rights. Such loans are usually specific to each film but may be secured by the receivables of several films. The Company expects $26.9 million of the loans to be repaid in 2007, and $2.8 million to be repaid in 2008. The Company has production loans outstanding at August 31, 2006 of $29.8 million compared to $16.0 million in 2005.  Of the loans outstanding, $16.9 million is denominated in United States dollars. See note 8 to financial statements for terms and interest rates., 672980=On November 1, 2006, the Company entered into a binding letter agreement with CSC Global Technologies Inc. (\u0093CSC\u0094). Pursuant to the agreement, a new company will be created, whereby 51% of the common shares will be owned by the Company and 49% owned by CSC.  The agreement will require the Company to provide financing toward the start up of the business venture.  The amount of this obligation has not yet been determined., 362477=On November 1, 2006, the Company entered into a binding letter agreement with CSC Global Technologies Inc. (\u0093CSC\u0094). Pursuant to the agreement, a new company will be created, whereby 51% of the common shares will be owned by the Company and 49% owned by CSC.  The agreement will require the Company to provide financing toward the start up of the business venture.  The amount of this obligation has not yet been determined., 735639=withholding taxes at a rate prescribed by the Income Tax Act (Canada) and modified by the provisions of the Canada-United States Income Tax Convention, 1980 (see commentary section entitled \u0093Taxation\u0094 below)., 515273=Nelson S. Thall was appointed as a Director on January 20, 2003 and has an extensive communications consulting career, including serving as a director of McLuhan Institute, Stan Lee Media Inc. and a former   board member of Torstar Corp. and Imark Corp.  Mr. Thall also has served in the North American   entertainment industry as an independent producer, a manager of talent and an advisor to such companies as   Stan Lee Media Inc.  Mr. Thall is a well-known media critic and social commentator in North America.  He   studied media science under Marshall McLuhan at the Center of Culture and Technology in Toronto., 281272=Subsequent to the reorganization, on August 1, 2003, the Company sold all of its shares in PAPDC.  The Company determined that PAPDC was a Variable Interest Entity under the rules governing Accounting Guideline-15 (see discussion on Variable Interest Entities on page 31)., 143767=The number of outstanding shares of each class of stock of PEACE ARCH ENTERTAINMENT GROUP INC. as of August 31, 2006 was:      31,308,665 Common Shares, without par value, 4,347,827 Series I Preference Shares, without par value and 2,661,929 Series II Preference   Shares, without par value., 621332=May 15, 2009, 262275=Peace Arch was incorporated on October 22, 1986, as a British Columbia corporation under the name Vidatron Enterprises Ltd. On July 14, 1999, we changed our name to Peace Arch Entertainment Group Inc., 443151=At August 31, 2005, the Company had accumulated losses for tax purposes of $6.5 million which are available for carry forward to future years.  The benefits of the tax loss carry-forwards have not been reflected in the financial statements., 684967=Year ending Aug 31, 2003, 461950=During the year, the Company recorded dividends of $308,000 compared to $22,000 in 2005 in respect of the Series I Preference Shares and the Series II Preference Shares., 265280=On August 24, 2005 under the Business Corporations Act (Ontario), by special resolution, the following occurred:, 863381=Lease Agreement between 1867 Yonge Street Inc. and the Company dated December 5, 2006 regarding 1867 Yonge Street, Toronto, Ontario, 775306=Expected to mature before August 31, 457862=In connection with the kaBOOM! acquisition on January 23, 2006 certain preferred shareholders provided letters of credit in return for a fee that was eligible to be settled in cash or common shares. The fee was classified as equity as it was most likely to be settled by a fixed number of shares and valued at $108,000. On April 24, 2006, the Company issued 245,291 common shares to settle the fees., 450911=During the year, cash flow used from investing activities was $7.4 million, compared with $51,000 used in 2005 and $71,000 used in 2004. The increase in 2006 was due to the acquisition of 100% of the issued and outstanding shares of kaBOOM! Entertainment Inc., the net cash requirement of the transaction was $7.2 million., 439944=Television revenues for the year were $1.5 million, down 48.3% from 2004. The decrease is due to lower sales from the television library in fiscal 2005 compared to fiscal 2004., 363290=On December 21, 2006, the Company acquired 100% of the issued and outstanding shares of Castle Hill Productions Inc. and Dream LLC, which holds the rights to a library of films for a purchase price of US$9,000,000. The purchase consideration is US$8,000,000 cash and US$1,000,000 in issuance of Company shares.   The total amount of common shares issued was 1,120,419 and the fair value per common share was US$0.89, determined by calculating the 10 day weighted average prior to closing.  , 788036=Based on our net US dollar liability exposure at August 31, 2006 and 2005 and holding that exposure constant each 1% decrease in the US dollar exchange rate to Canadian dollars would result in an approximate $68,000 increase (2005 \u0096 $39,000 increase) to our income and each 1% increase in the US dollar exchange rate would result in an approximate $68,000 decrease (2005 - $39,000 decrease) to our income., 691176=Year ending Aug 31, 2006, 511987=Gary Howsam was appointed as a director on January 20, 2003 and our Chief Executive Officer effective December 20, 2002.  Mr. Howsam\u0092s primary responsibilities is the operation of the Company, which includes   all strategic planning, operations management and budgeting, corporate finance, recruitment, training and   management of   all employees.  Mr. Howsam has more than 20 years of executive level experience in the   Canadian motion picture industry.  From 1997 to 2003 Mr. Howsam was President of Greenlight Film and   Television Inc.,   which develops, finances, produces and distributes feature films.  , 517935=Drew Craig was appointed as a director and Chairman of the Board on July 29, 2005 and is a member of the Compensation Committee.  Mr. Craig has been involved in the media and telecommunications industry for   over 25 years.   He started his career at Craig Media a family broadcast company founded by his grandfather.   Initially working in the area of television programming and production Mr. Craig assumed various   management roles eventually becoming President and CEO of Craig Media until it was sold in December   2004. Under his leadership the company grew dramatically from a single small television station to a group of   stations that had a 60% reach of Canada. With the launch of four major market independent television channels   Craig Media became the countries largest privately held television company. Mr. Craig also launched three   national specialty cable channels MTV, MTV2 and TV Land under a joint venture arrangement with Viacom.   Currently Mr. Craig is principal of Craig Wireless Systems a company operating and deploying wireless   broadband networks in Canada, the USA and Europe using WiMax technology. , 216748=October, 829927=Lease Agreement \u0096 1710 Columbia Street, Vancouver, British Columbia (3), 622953=WARRANTS OUTSTANDING AS AT FEBRUARY 19, 2007, 795202=There were no changes in internal control over financial reporting during the fiscal year ended August 31, 2006 that have materially affected, or are reasonably likely to materially affect, the Company\u0092s internal control over financial reporting.    , 475137=Loan guarantees  Certain film productions delivered during prior years were pursuant to co-production agreements with an independent producer (the co-producer) in another country. The production loans are arranged jointly by the co-producers to cover their individual funding of the respective film production. Each co-producer is responsible for the payment of its respective portion of the loans out of receipts from the respective co-producer\u0092s exploitation of the production. In the event of default by the co-producer, the Company is liable for any unpaid balance of the co-producer\u0092s share of the loan. At August 31, 2006 and 2005, the total amount of such unpaid loans was approximately $223,000 and $343,000, respectively. In the event of such a default, the Company has full recourse to all the copyright, exploitation and other rights attributed to the co-producer pursuant to the co-production agreement. No accrual has been made as the Company believes the likelihood of payment is remote., 228835=We cannot assure you we will be able to operate profitably. In three of our last five years we have reported losses.  We would have recognized losses in the last five fiscal years absent gains on settlement of obligations.  As of August 31, 2006 we had an accumulated deficit of $8,683,000.  If we continue to have losses in the future, we may not be able to generate positive cash flows sufficient to finance continuing activities. Our inability to meet those needs could have a material adverse effect on our business, results of operations and financial condition.  , 242317=The Company has 4,347,807 Series I and 2,661,929 Series II Preference Shares outstanding as of August 31, 2006 and the Company has the ability to issue additional Preference Shares.  The Preference Shares shall be entitled to priority over the Common Shares and over any other shares of the Company ranking junior to the Preference Shares with respect to the payment of dividends and in the distribution of assets in the event of the liquidation, dissolution or winding-up of the Company, whether voluntary or involuntary, or any other distribution of the assets of the Company among its shareholders for the purpose of winding up its affairs.  , 235637=Section 404 of the Sarbanes-Oxley Act 2002 and related regulations presently requires that for the year ended December 15, 2008, we will be required to perform an evaluation of our internal controls over financial reporting and have our auditors attest to such evaluations on an annual basis.  We have been and still are evaluating our internal control systems to allow our management to report on, and our auditors to attest to our internal control over financial reporting. As a result, we have incurred additional expenses in fiscal 2006 and a diversion of our management\u0092s time.  , 519555=John Flock is currently our President and the President of Peace Arch LA, Inc., based in Los Angeles, California.  Mr. Flock has served in as President of Peace Arch LA, Inc since September 2004 and President of Peace Arch Entertainment Group Inc. since February 2, 2005.  He is responsible for focusing on the development and production of feature films as well as the licensing and distribution of the Company\u0092s films in the United States. Mr. Flock received a degree from Columbia University and a law degree from NYU School of Law. He began his career in the film industry as an attorney specializing in independent production, financing and distribution, with a particular emphasis on international co-production and co-financing arrangements. Mr. Flock has produced or executive produced a dozen feature films, including:\u0094Clockwatchers\u0094 (BMG), \u0093Storyville\u0094 (Fox), \u0093Fortress\u0094 (Dimension) and \u0093Fortress 2 \u0096 Reentry\u0094 (TriStar).  Mr. Flock has spent the last decade developing, writing and producing nearly a dozen motion pictures.  Prior to 2004 he was senior production and financing advisor to Cinefinance llc, one of the industry\u0092s leading completion guarantors. , 746692=The following discussion is based upon the sections of the Internal Revenue Code of 1986, as amended (the \u0093Code\u0094), Treasury Regulations, published Internal Revenue Service (\u0093IRS\u0094) rulings, published administrative positions of the IRS and court decisions that are currently applicable, any or all of which could be materially and adversely changed, possibly on a retroactive basis, at any time and which are subject to differing interpretations.  This discussion does not consider the potential effects, both adverse and beneficial, of any proposed legislation which, if enacted, could be applied, possibly on a retroactive basis, at any time., 362034=Subsequent to the year ended August 31, 2006 the following significant transactions occurred:, 523605=Compensation Committee:  The Compensation Committee for the year ended August 31, 2006, was composed of Nelson Thall, Juliet Jones and Drew Craig.  It is the responsibility of the Compensation Committee to administer the compensation policies related to our executive management.  They met four times in the last fiscal year.    , 819403=Form of Special Resolutions Amending the Memorandum and Articles of Peace Arch Entertainment Group Inc. adopted February 11, 2004 to be filed with British Columbia Registrar of Companies.(4), 655253=On December 2, 2004, in a private disposition, CPC Communications Inc. sold 1,500,000 Common Shares for total proceeds of $1,350,000., 841020=Incorporated by reference to our registration statement on Form 20-F for the year ended August 31, 2003., 626287=February 7, 2006, 360015=During the year ended August 31, 2006, the following significant transactions occurred:, 361490=On June 7, 2006, the Company completed a private placement of 7.5 million common shares for gross proceeds of $9,075,000. The proceeds were used to repay a term loan of $3,447,000, to settle letters of credit amounting to $4,202,000 in connection with the kaBOOM acquisition and to provide working capital., 625185=July 29, 2005, 443553=During the year ended August 31, 2004, the Company recorded a reversal of future income taxes valuation of $989,500. These future income taxes arose from the forgiveness of production loans in the amount of $2.7 million from a related party.  The loan forgiveness has been recorded as contributed surplus net of the income tax impact of $989,500., 350795=As of August 31, 2006, we leased the following properties:, 630997=On June 7, 2006, in connection with a private placement, we issued 269,000 broker warrants to Westwind Capital Inc. for their services acting as lead agent in Canada for the private placement.  Each warrant is exercisable for one common share in the capital of Peace Arch at any time 48 months from the closing date of the private placement at an exercise price of Cdn$1.21., 802395=The following table provides information about the fees billed to the Company for professional services rendered by PricewaterhouseCoopers LLP during 2006 and 2005:, 240805=Our current shareholders hold a substantial number of shares.  We filed a registration statement which was declared effective on November 2, 2006 on Form F-3 to register an aggregate of 36,061,540 shares of common shares on behalf, 602340=August 31, 2009, 657354=On June 7, 2006, Todd Wagner received 3,000,000 Common Shares pursuant to a private placement of 7.5 million of the Company\u0092s Common Shares., 449811=During the year, $17.9 million was used by operating activities, compared to $5.8 million used by operating activities in fiscal 2005 and $3.2 million generated from operations in 2004.  The increase of cash flows used from operations for the year ended August 31, 2006 was due primarily to the increase in investment in film and television programming., 215810=January, 458611=On April 28, 2006, the Company issued 178,620 common shares for the settlement of $97,000 of dividends payable to certain preferred shareholders. The value of the shares issued to settle the liability was $123,000 and therefore the Company recorded a loss on settlement of the dividends of $26,000., 793160=As required by rule 13a-15 under the Securities Exchange Act of 1934, as amended ( the \u0093Exchange Act\u0094 ), the Company carried out an evaluation of the effectiveness of the design and operation of its disclosure controls and procedures as of August 31, 2006, being the date of the Company\u0092s most recently completed fiscal year., 555239=Ended 31st August., 833485=Lease Agreement dated November 21, 2006 between the Company and Trizec regarding 4640 Admiralty Way, Marina del Rey, California, 627121=February 6, 2009, 694250=Year ending Aug 31, 2005, 280492=During the year ended August 31, 2004, the Company voluntarily issued 3,489,814 common shares to PAPDC in consideration for PAPDC agreeing to assume the obligation to issue the common shares of the Company to Fremantle and Comerica collectively known as the (\u0093Lenders\u0094) should the Lenders eventually opt to call upon those shares in settlement of the PAPDC obligations. The Company voluntarily issued common shares, in escrow, to PAPDC to settle the Lenders\u0092 obligations. Following the issuance of shares in settlement of their obligations there remained 343,689 common shares held in escrow. On September 1, 2006, the Company returned 121,000 of these shares to treasury., 837172=Certification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002., 227419=At August 31, 2006, the total of our shareholders\u0092 equity was $21,760,000 (US$19,687,000), thereby complying with the AMEX listing standard of maintaining equity greater than US$4,000,000. There is no guarantee that we will be able to continue reporting profitability and that our shareholders\u0092 equity will not decrease again below the AMEX threshold amount. If we incur losses and the losses are significant enough that our shareholders\u0092 equity value declines, 354297=1710 Columbia Street, 2nd Floor, Vancouver, British Columbia V5Y 3C6  , 628222=June 6, 2010, 620047=August 31, 2009, 338304=The following is a list of our principal subsidiaries as at August 31, 2006, the jurisdiction of incorporation of each subsidiary and the percentage of voting securities beneficially owned by us or over which we exercise control or direction:, 334070=Canadian Television Fund (\u0093CTF\u0094)   The Canadian Television Fund was created in 1996 to support the production and broadcast of high quality, distinctively Canadian television programs. The CTF is a public-private partnership, financed by contributions from the Government of Canada, the Canadian cable and direct to home satellite industries and Telefilm Canada., 239814=Our revenue is generated in part due to production activities in numerous countries.  We have several primary customers who purchase distribution rights to the filmed product we sell.  We also have several large customers through which we distribute our home entertainment product.  In the year ended August 31, 2006, one customer represented approximately 25% of total revenues, a second customer represented approximately 9% of total revenues and a third customer represented approximately 5% of total revenues and two customers collectively represented approximately 8% of total revenues.   , 521710=During fiscal 2006 we had four committees, three of which were constituted with a majority of independent directors, as follows:, 327527=Refundable Income Tax Credit \u0096 Province of British Columbia    Under the terms of the current film and television provincial tax credit system under the Income Tax Act (British Columbia), the Province of British Columbia offers refundable tax credit incentives for British Columbia film productions.  The incentives as at August 31, 2006 are as follows:, 516785=Mara Di Pasquale was appointed as our Chief Financial Officer on September 29, 2003 and as a director on   February 11, 2004.  She was also the Chief Operating Officer from September 29, 2003 until August 31, 2006.    She has an extensive career, including acting as Vice President of Finance \u0096 Entertainment for Gullane   Entertainment PLC, Chief Financial Officer and Chief Operating Officer for Catalyst Entertainment Inc. as   well as Senior Vice President of Finance for Lions Gate Films Inc.  Ms. Di Pasquale is a Chartered Accountant   and studied at McGill University in Montreal where she received her Graduate Diploma in Public Accountancy   and at Carleton University in Ottawa where she received an Honours Bachelor of Commerce degree., 776633=2008, 264672=The Company applied for and was accepted to continue under the Business Corporations Act (Ontario), \u0093OBCA\u0094. The Company became an Ontario corporation on September 1, 2004. Under the articles of continuance (the \u0093Articles\u0094) the Company\u0092s authorized share capital was changed to an unlimited amount of common shares with no par value and an unlimited amount of preference shares with no par value., 381385=Revenue  Revenue is a measurement defined by Canadian and U.S. GAAP.  Revenue is the inflow of cash, receivables or other consideration arising from the sale of product and services and is net of items such as trade or volume discounts and certain excise and sales taxes. Peace Arch\u0092s revenue streams for the years ended August 31, 2006 and 2005 were derived primarily from its three business segments: Motion Picture 44% and 86%, Television 11% and 14% and Home Entertainment 45% and 0%, respectively., 288705=fiscal 2006, the Company delivered 10 episodes of lifestyle programming, 2 documentaries and 1 made-for-television movie.  At year-end, the Company had 1 mini-series, 2 television series and 3 made-for-television movies in production.  The television episodes delivered were for the series Love it or Lose It! (Series II), Makeover Wish, and Uber Guide, the documentaries delivered were Fantasy Lands Asia, and Fantasy Lands 2006,  and the made-for-television movie delivered during the year was The Stranger Game.  The movies for television acquired or in production at fiscal year end were Luna: The Way Home, Passions Web and Nightmare.  The mini-series in production is The Tudors.  The two television series in production were Air Dogs and Last 10 Pounds., 832426=Share Purchase Agreement November 1, 2005(4), 450326=The use of cash flows from operating activities of $5.8 million in fiscal 2005 compared to the increase in cashflows of $3.2 million in 2004 is attributable to a use of working capital in 2005., 144926=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports) and (2) has been subject to such filing requirements for the past 90 days.  Yes _X_  No ___, 162374=The following table sets forth selected financial data regarding our consolidated operating results and financial position.  The data has been derived from our consolidated financial statements, which have been prepared in accordance with accounting principles generally accepted in Canada (\u0093Canadian GAAP\u0094).  For reconciliation to accounting principles generally accepted in the United States (\u0093U.S. GAAP\u0094), see note 32 to the Consolidated Financial Statements as at August 31, 2006 and 2005 and for the years ended August 31, 2006, 2005 and 2004.  The financial data as at August 31, 2003 and 2002 and for the years ended August 31, 2003 and 2002 have been derived from our audited financial statements not included in this Annual Report on Form 20-F (the \u0093Annual Report\u0094 or \u0093Form F-20\u0094).  The following selected financial data is qualified in its entirety by, and should be read in conjunction with, the consolidated financial statements and notes hereto included in \u0093Item 18 \u0096 Financial Statements\u0094 in this Annual Report.  The selected financial data is expressed in Canadian dollars., 869213=Certification of Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002., 461262=During the year ended August 31, 2006, the Company issued 441,333 common shares for gross proceeds of   $255,000 in connection with employee stock options that had been exercised.  A balance of $118,000   representing a portion of the value associated with stock options was transferred from contributed surplus., 632947=The table below summarizes the ownership of our Common and Preference Shares and as a percentage of each class of securities as of February 19, 2007, for each person known to us who beneficially owns more than 5% of the aggregate., 727577=On August 24, 2005 our shareholders approved certain amendments to be made to the Articles of the Corporation and the Articles of Amendment are incorporated by reference in Item 19 as exhibit 1.10., 478058=As of August 31, 2006, the Company has entered into various contracts which result in future cash flow commitments related to production loans, operating leases, obligations to issue shares and revenue guarantee obligations. The following table details the cash flow commitments over the next five years and thereafter related to these obligations., 732002=On November 1, 2006, the Company entered into a binding letter agreement with CSC Global Technologies Inc. (\u0093CSC\u0094). Pursuant to the Agreement, a new company will be created, where 51% of the common shares will be owned by the Company and 49% owned by CSC.  The agreement will require the Company to provide financing toward the start up of the business venture.  The amount of this obligation has not yet been determined., 629550=On February 7, 2006, 1,500,000 common share purchase warrants were issued to Trilogy Capital Partners Inc. (Trilogy) for the development and implementation of a proactive marketing program.  The warrant entitles the holder to purchase from Peace Arch at any time prior to February 6, 2009, one share of the common stock of Peace Arch at an exercise price of US$0.54 per share.  The warrants shall vest and become exercisable as follows (a) 1,000,000 warrants vested on February 7, 2006; and (b) 500,000 warrants vest on February 8, 2007 provided that Trilogy\u0092s engagement pursuant to the Letter of Engagement dated February 7, 2006 shall not have been terminated other than termination by Trilogy as a result of breach by the Company.  On November 17, 2006, 200,000 Common Share warrants were exercised at a price of US$0.54 per share for proceeds of US$108,000.  On January 23, 2007, 225,000 Common Share warrants were exercised at a price of US$0.54 per share for proceeds of US$121,500.  On January 26, 2007, 15,000 Common Share warrants were exercised at a price of US$0.54 per share for proceeds of US$8,100.  On January 29, 2007 5,000 Common Share warrants were exercised at a price of US$0.54 per share for proceeds of US$2,700., 868618=Certification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002., 820967=Special Resolution Amending the Articles of Continuance adopted September 1, 2004(2), 505093=Currently CFO of Peace Arch Entertainment Group Inc. and CFO and COO of Peace Arch Entertainment Inc. from 2003-2006. Former VP, Finance-Entertainment of Gullane Entertainment PLC and former CFO & COO of Catalyst Entertainment Inc. from 2000-  2003. Prior to 2003 she was Sr. VP. Finance for Lions Gate Film Inc. and predecessor companies.., 818842=Special Resolutions Amending the Memorandum and Articles of Vidatron Entertainment Group Inc. adopted July 14, 1999. (1), 843842=Date:  March 15, 2007, 452727=proceeds were used to repay the term loan of $3.5 million, and to settle letters of credit provided by a financial institution and certain of the preferred shareholders of $4.2 million in connection with the kaBOOM! acquisition and to provide working capital. The increase in production loans and proceeds from the private placement account for the majority of the increase in cash flow from financing activities in 2006., 166141=2002, 436472=Revenues for fiscal 2005 were $10.7 million, down 49.5% from the prior year.  Both Motion Picture and Television revenues decreased reflecting the lower number of projects produced as well as lower sales from the television library., 164906=2006, 614662=October 12, 2005, 332319=Eligible labor expenditures are limited to 60% of the total production costs, net of government assistance.  The credit is calculated on the basis of each individual production and is available only to a qualified corporation having a permanent establishment in Ontario and carrying on an eligible film or television production business through a permanent establishment in Canada.  In order to access the basic credit, persons domiciled in Ontario must also control the corporation.  In addition, in order to access the basic credit, the producer of the eligible production must be an Ontario resident for tax purposes. In fiscal 2006 and 2005, the Company was eligible for refundable income tax credits under the Ontario program amounting to $nil and $309,000, respectively., 669434=During the years ended August 31, 2006, 2005 and 2004, the Company recorded dividends of $308,000, $22,000 and $nil, respectively, in respect of the Series I Preference Shares and the Series II Preference Shares determined as 10% of the outstanding Series I and Series II Preference Shares\u0092 face value of US$3,330,965 (2005 \u0096 US$2,000,000)., 558768=As of August 31, 2006 we had approximately 53 full-time permanent employees.  We also hire additional personnel on a project-by-project basis in connection with the production of our film and television programming.  On average, we may employ, on a temporary basis, 50 people for a motion picture project and 15 for a television program.  We believe that our employee and labor relations are good.  None of our permanent employees are members of unions.  We had 30 full-time employees at August 31, 2005 and 25 full-time employees at August 31, 2004., 525288=Greenlight Committee:  The Green-Light Committee for the year ended August 31, 2006, was composed of John Flock , Richard Watson and Jeff Sagansky (Mr. Sagansky is an advisor to the board).   The Green-Light Committee is responsible for reviewing all projects, ensuring that they are fully funded and ultimately giving authority for them to proceed into production.  The Green-Light Committee meets intermittently as needed., 292024=Since 2003, Peace Arch has built a library of 28 feature films, 60+ television episodes and 6 documentaries and with the acquisition of Dream LLC and Castle Hill Productions Inc., the Company acquired a library of approximately 500 feature films. Prior to 2003, the Company had an additional 200+ hours of filmed entertainment., 499808=February 22, 2001, 437409=Earnings (loss) from operations before the undernoted was $(1.9) million compared to $(925,000) in 2004.  Earnings (loss) from operations excludes interest and other gains or losses not attributable to operations. The Television segment reported earnings of $599,000, a decrease of 52.5% from prior year.  Motion Picture segment incurred a loss of $(878,000) after incurring a loss of $(1.7) million the prior year., 504169=February 10, 2005, 360511=On January 23, 2006, the Company acquired 100% of the issued and outstanding shares of kaBOOM! Entertainment Inc. (kaBOOM!), a home entertainment studio in Canada that distributes videocassettes, DVDs and ancillary merchandise to retailers and mass merchandisers in Canada. The cost of the purchase was $7,983,000 consisting of 1,033,058 common shares of the Company valued at $500,000, 50,000 options of the Company valued at $17,000, cash consideration of $3,000,000 paid at the time of closing, future cash consideration of $4,202,000 and direct costs of acquisition of $264,000., 797519=The Company\u0092s Board of Directors has determined that Juliet Jones qualifies as an \u0093audit committee financial expert\u0094 as defined by the rules of the Securities and Exchange Commission (\u0093SEC\u0094).   Juliet Jones, a Certified General Accountant, has been on the Board of Directors since February 22, 2001.  Previously Ms. Jones served in various roles for Peace Arch Entertainment Group Inc. including Chief Financial Officer.  Ms. Jones previously served as a member of the Board of the Vancouver Chapter of Certified General Accountants and served as the chair of the professional development committee.  She has 20+ years of accounting experience, 15 years of which were in senior financial roles with public companies. Ms. Jones has 15 years of experience in the film and television industry.  She has a solid understanding of generally accepted accounting principles and accounting issues specific to the film and television industry, providing her with the ability to assess the application of such accounting principles to accruals, estimates and reserves.  Ms. Jones has prepared and supervised the preparation of financial statements with comparable complexity to the issuer\u0092s financial statements, and as past Chief Financial Officer of the issuer until June 20, 2003, has prepared previous financial statements for the issuer.  Ms. Jones also has hands on experience with managing internal controls and is active in following new accounting pronouncements with respect to the management and compliance with internal control requirements.  Ms. Jones continues to stay current on new accounting and securities developments.  , 312556=Early in 2003, Peace Arch established an international marketing and sales division in London, England, through which the Company now manages licensing of the Company\u0092s motion pictures. The Company also markets and distributes titles directly to existing pay and free television, home video and other markets. Peace Arch\u0092s international distribution capability enables it to enhance revenue and margins through:, 832912=Lease Agreement between 1867 Yonge Street Inc. and the Company dated December 5, 2006 regarding 1867 Yonge Street, Toronto, Ontario, 516305=Robert Essery was appointed as a Director on February 10, 2005 and is currently President of the REO group of companies in which capacity he has served since 1992., 387660=2005, 758735=We would be treated as a \u0093foreign personal holding company\u0094 if at any time during a taxable year more than 50% of the total combined voting power or the total value of the Company\u0092s outstanding shares is owned directly or indirectly by five or fewer individuals who are citizens or residents of the United States and 60% or more of the Company\u0092s gross income for such year (reduced to 50% in subsequent years) was derived from certain passive sources.  In that event, U.S. Holders that hold shares would be required to include in gross income for such year their allocable portion of such passive income to the extent the Company does not actually distribute such income.  The 2004 Act repeals the foreign personal holding company rules.  This repeal is effective after 2004., 208890=2003, 425014=FISCAL 2006 COMPARED TO FISCAL 2005, 281981=On May 26, 2005, the Company re-acquired 100% of PAPDC shares for a nominal amount, which had no effect on the carrying amount of any assets or liabilities., 609709=February 25, 2008, 215907= 2007, 864008=Lease Agreement dated November 21, 2006 between the Company and Trizec regarding 4640 Admiralty Way, Marina del Rey, California, 295441=2005, 490549=As of August 31, 2006, the Board of Directors of Peace Arch consisted of seven directors.  The directors have served in their respective capacities since their election or appointment on the date stated in the table and will serve until the next Annual General Meeting or until a successor is elected or appointed, unless the office is vacated in accordance with our Articles.  The executive officers are appointed by the directors and serve until the earlier of their resignation or removal with or without cause by the directors.  As an Ontario corporation, we are required by Ontario corporate laws to include on our board of directors a majority of persons ordinarily resident in Canada.   All of our directors and executive officers are Canadians. With the exception of Juliet Jones who resides in British Columbia, all of our directors and executive officers reside in the Province of Ontario.  Each of the directors has held the principal occupations listed below for the preceding five years except where otherwise noted., 506143=February 11, 2004, 648881=The table below summarizes each class of securities held in the U.S. as at August 31, 2006:, 471736=Variable Interest Entities   Effective December 1, 2004, the Company adopted Accounting Guideline 15 (\u0093AcG-15\u0094) - Consolidation of Variable Interest Entities issued by the Canadian Institute of Chartered Accountants 9 (\u0093CICA\u0094). AcG-15 provides criteria for the identification of VIEs and further criteria for determining what entity, if any, should consolidate them. AcG 15 defines a VIE as an entity that either does not have sufficient equity at risk to finance its activities without subordinated financial support or wherein the equity investors lack the characteristic of a controlling financial interest. VIEs are subject to consolidation by a company if that company is deemed the primary beneficiary of the VIE. The primary beneficiary is the party that is either exposed to a majority of the expected losses from the VIE\u0092s activities or is entitled to receive a majority of the VIEs residual returns or both., 837713=Certification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002., 622614=Nov. 14, 2009, 818301=Special Resolution Amending the Memorandum and Articles of the Company adopted February 16, 1999 (1), 330078=Eligible labor expenditures are limited to 48% of the total production costs, net of government assistance. The credit is calculated on the basis of each individual production and is available only to a qualified corporation having a permanent establishment in British Columbia and carrying on an eligible film or television production business through a permanent establishment in Canada. In fiscal 2006 and 2005, the Company was eligible for refundable income tax credits under the British Columbia program amounting to $274,000 and $408,000, respectively., 189483=2006, 442467=Interest expense for the year was $953,000 up from $220,000 in 2004 due to an interest expense recorded on the Film Financing Obligation.  The interest expense was offset by interest revenue of the same amount recorded with respect to the Restricted Term Deposit., 667551=The Company\u0092s subsidiary Peace Arch Motion Pictures Inc. (formerly GFT Entertainment Inc.) was named   as one of several defendants in an action that commenced in June 2004 by Comerica Bank California. The   Company believes that this claim is without merit because, among other things, the alleged events on which   the claim is based occurred years prior to the formation of Peace Arch Motion Pictures Inc. The Company   does not expect the outcome of this proceeding to have a material adverse effect on the Company\u0092s financial   position, results of operations, or liquidity., 326548=Refundable Income Tax Credit \u0096 Federal    Film and television productions undertaken by qualified Canadian corporations are eligible for a refundable tax credit under the Canadian Income Tax Act. The tax credit equates to 25% of the lesser of qualified labour expenditures and 50% of eligible costs of production of a given project. The credit is calculated on the basis of each individual production and is available to taxable Canadian corporations whose activities are primarily Canadian film or video production carried on through a permanent establishment in Canada which is Canadian-controlled as determined under the Investment Canada Act.  In fiscal 2006 and 2005, the Company was eligible for federal refundable income tax credits amounting to $235,000 and $389,000, respectively., 739294=Specific investment thresholds apply to investors of the United States.  The investment threshold for a direct acquisition of control has been established at Cdn$5 million for 2006 and no review is required for an indirect acquisition of control.  Each year the direct acquisition investment threshold is adjusted for inflation., 459260=On May 25, 2006, 726,032 Series II Preference Share warrants were exercised at a price of US$0.50 per share for proceeds of US$363,016., 732590=On December 21, 2006, the Company negotiated a settlement of an outstanding legal dispute with Viacom Inc., MTV Networks, and VH1 Music First et al. Viacom agreed to pay US$1.0 million as settlement to the Company\u0092s claim for damages in the original amount of US$2.7 million and consequential damages arising from the failure to honor a contract for the co-financing of the television series Big Sound. In addition, the Company entered into a distribution agreement with Viacom for the sale of certain U.S. broadcast rights for the television series Big Sound., 840643=Incorporated by reference to our registration statement on Form 20-F for the year ended August 31, 2004., 208161=2006, 656132=On March 31, 2005, Fremantle Media converted a note payable of US$8,793,375 for 2,931,125 Common Shares of the Company., 208646=2004, 761835=Under U.S. treasury regulations that are generally effective with respect to payments made after December 31, 2000 (the \u0093new withholding Regulations\u0094), the proceeds of a sale of Common Shares through a U.S. or U.S. related broker may be subject to U.S. information reporting and may be subject to the 28%  U.S. backup withholding requirements.  Unconnected U.S. Shareholders generally can avoid the imposition of U.S. non-resident withholding tax by reporting their taxpayer identification number on an Internal Revenue Service Form W-9.  Non-U.S. shareholders generally can avoid the, 686692=Year ending Aug 31, 2004, 262599=On February 11, 2004 under the Company Act (British Columbia), by special resolution, the following occurred:, 838254=Certification of Chief Executive Officer and Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002., 508003=July 29, 2005, 165926=2003, 144542=If this report is an annual or transition report, indicate by check mark if the registrant is not required to file reports pursuant to Section 13 or 15(d) of the Securities Exchange Act of 1934.  Yes___   No_X_, 276196=Under the terms of a Debt Repayment Agreement with Fremantle Enterprises Ltd. (\u0093Fremantle\u0094), a former trade creditor who had previously agreed to exchange Fremantle\u0092s trade payable balance for a term loan issued a Conversion Right Certificate (the Fremantle conversion instrument).  It was agreed that if any amount of the Fremantle debt, including unpaid interest, remained outstanding as of December 31, 2004, Fremantle would, for a period of 90 days, have the right to convert such unpaid amount to common shares in the capital of the Company at the lesser of either (a) $5.00 per share or (b) the average trading close price of the shares for the 30 days prior to December 31, 2004, provided that in no event would the conversion price be less than $3.00 per share.  Pursuant to the terms of the Fremantle conversion instrument, 2,527,000 common shares, which represent the number of shares that could be issued for the principal amount of debt of $7,580,000, were reserved for issuance.  During the year ending August 31, 2005, Fremantle converted its $8,793,000 note plus interest for 2,931,125 shares of the Company\u0092s common shares.  During fiscal 2005, the Company recognized a gain on settlement of its obligation of $1,105,000 representing the difference between the carrying amount of the obligation and the fair value of the Company\u0092s common shares issued on the conversion date, and a gain on settlement of liability of $1,455,000 representing the extinguishment of the Company\u0092s distribution liability to Fremantle., 614883=October 12, 2008, 226365=On February 10, 2004, we had received notice from AMEX indicating that we were in breach of AMEX\u0092s continued listing standards of maintaining a shareholders\u0092 equity value greater than US$2,000,000 and sustaining losses in two of our three most recent fiscal years; and in breach of maintaining a shareholders\u0092 equity value greater than US$4,000,000 and sustaining losses from continuing operations and/or net losses in three out of our four most recent fiscal years, all as set forth in Section 1003(a)(i) and Section 1003 (a)(ii), respectively, of the AMEX Company Guide.  , 459754=On June 7, 2006, the Company granted, as partial compensation to retain an investment banker as its financial advisor in connection with the private placement described in note 18(a)(vi) of the financial statements, a warrant to purchase up to 269,000 common shares at an exercise price of $1.21 per share, exercisable to June 7, 2010 as described in note 20 of the financial statements. The fair value of $272,000,, 733306=On December 21, 2006, the Company completed the acquisition of independent film companies Castle Hill Productions Inc. (\u0093CHP\u0094) and Dream LLC (\u0093Dream\u0094), for a purchase price of US$9 million.   The acquisition was financed through US$8 million cash and US$1 million issuance of Company shares.  The Dream/CHP library of approximately 500 titles represents one of the largest independent film libraries in the world, containing both classic and contemporary motion Pictures. This strategic transaction supports Peace Arch\u0092s goal of revenue growth through U.S. and worldwide distribution, and brings to the Company a proven U.S. distribution and licensing operation with an experienced executive team., 464997=On July 29, 2005, in connection with a private placement, the Company issued 4,347,825 Series II Preference Share warrants. Each Preference Share warrant is convertible into one Series II Preference Share of the Company at a price of US$0.50 at any time up to July 29, 2009.  The allocation of the proceeds from the issuance of the Units to the warrants was $693,000., 666601=On October 2, 2001, the Company initiated an action against Viacom, Inc., MTV Networks, and VH1 Music First et al in British Columbia Supreme Court for damages in the amount of US$2,750,000 and consequential damages arising from the Defendants\u0092 failure to honour a contract for the co-financing of the television series Big Sound.  On December 21, 2006 the parties met with an arbitrator and negotiated a settlement of the Company\u0092s claim against Viacom, whereas Viacom agreed to pay US$1,000,000.  In addition, the Company entered into a distribution agreement with Viacom for the sale of certain U.S. broadcast rights for the television series Big Sound., 251727=The film and television programming produced by us generally employ actors, writers and directors who are members of the Screen Actors Guild, Writers Guild of America and Directors Guild of America, respectively, pursuant to industry-wide collective bargaining agreements. The collective bargaining agreement with the Writers Guild of America was successfully renegotiated and became effective as of November 1, 2004 for a term of three years. The collective bargaining agreements with the Screen Actors Guild and Directors Guild of America were each successfully renegotiated and became effective as of July 1, 2005 for a term of three years. Many productions also employ members of a number of other unions, including, without limitation, the International Alliance of Theatrical and Stage Employees, the Teamsters and the Alliance of Canadian Cinema, Television and Radio Artists. A strike by one or more of the unions that provide personnel essential to the production of motion pictures or television programs could delay or halt our ongoing production activities. Such a halt or delay, depending on the length of time, could cause a delay or interruption in our release of new motion pictures and television programs, which could have a material adverse effect on our business, results of operations or financial condition., 366928=In September 2006, the Emerging Issues Committee issued EIC-163 \u0093Determining the Variability to be Considered in Applying AcG-15\u0094, effective for the first interim or annual reporting period beginning on or after January 1, 2007. EIC-163 defines that the variability to be considered in applying AcG-15 is to be based on analysis of the design of the entity and prescribes the steps to be undertaken in such an analysis.  The Company has not yet determined the impact of adopting EIC-163 on its consolidated results of operations or financial position., 369282=Variable Interest Entities   Effective December 1, 2004, the Company adopted Accounting Guideline 15 (\u0093AcG-15\u0094) - Consolidation of Variable Interest Entities issued by the Canadian Institute of Chartered Accountants 9 \u0093CICA\u0094). AcG-15 provides criteria for the identification of VIEs and further criteria for determining what entity, if any, should consolidate them. AcG 15 defines a VIE as an entity that either does not have sufficient equity at risk to finance its activities without subordinated financial support or wherein the equity investors lack the characteristic of a controlling financial interest. VIEs are subject to consolidation by a company if that company is deemed the primary beneficiary of the VIE. The primary beneficiary is the party that is either exposed to a majority of the expected losses from the VIE\u0092s activities or is entitled to receive a majority of the VIEs residual returns or both., 731591=In October 2006, a subsidiary entered into a lease agreement with Marina Airport Building Ltd., a California limited partnership to lease space at 4640 Admiralty Way, Suite 710, Marina Del Rey, California for a term of 5 years commencing November 1, 2006., 209134=2002, 384393=The following table presents summary financial information for Peace Arch\u0092s operating business segments and a reconciliation of earnings (loss) from operations before the undernoted to net earnings (loss) for the year for each of the listed years ended August 31:, 217120=September 2006, 273172=On November 1, 2006, the Company entered into a binding letter agreement with CSC Global Technologies Inc. (\u0093CSC\u0094). Pursuant to the agreement, a new company will be created, where 51% of the common shares will be owned by the Company and 49% owned by CSC.  The agreement will require the Company to provide financing toward the start up of the business venture.  The amount of this obligation has not yet been determined., 429057=Television revenues for the year were $2.3 million, up 46.4% over last year. This increase is due to higher sales from the television library and the recognition of a television movie entitled \u0093The Stranger Game\u0094 in fiscal 2006 compared to fiscal 2005., 749352=tax credit that may be available to a U.S. taxpayer based upon the segregation of foreign source income into separate categories, or \u0093baskets\u0094, of income.  For purposes of applying the foreign tax credit limitation, dividends are generally included in the passive income basket or the financial services income basket if received by a financial services entity.  The amount of credit that may be claimed with respect to the basket of income to which the dividend is allocated, and to which the foreign taxes are attributable, generally may not exceed the same proportion of the U.S. tax on worldwide taxable income, before applying the foreign tax credit as the U.S. holder\u0092s foreign source taxable income allocable to such basket bears to such U.S. holder\u0092s entire taxable income.  The foreign tax credit is disallowed for dividends on stock unless a minimum holding period requirement is satisfied and additional limitations may restrict the ability of some individuals to claim the foreign tax credit.  The 2004 Act amends the foreign tax credit provisions.  These amendments include reducing the limitations on certain classifications of income.  These amendments are effective for tax years beginning after 2006.  Accordingly, investors should consult their own tax advisors with respect to the potential consequences to them of the foreign tax credit limitations.  Dividends paid by us generally will constitute \u0093portfolio income\u0092\u0092 for purposes of the limitation on the use of passive activity losses by investors and \u0093investment income\u0092\u0092 for purposes of the limitation on investors\u0092 investment interest expense.  Dividends paid by us will not be eligible for the \u0093dividends received deduction\u0094 generally allowed with respect to dividends paid by U.S. corporations under Section 243 of the Code, but may be eligible for the dividends received deduction which may be claimed by 10% corporate shareholders under Section 245 of the Code., 463556=During fiscal 2001, the Company granted, as partial compensation to retain an investment banker as its financial advisor, a warrant to purchase up to 100,000 Class B Shares at an exercise price of US$2.72 per share, exercisable to April 16, 2006. As the warrants were granted at an exercise price equal to the market value of Company\u0092s shares on the date of grant, no compensation expense was recorded.  During the year, the warrants were not exercised and have since expired., 523147=As of August 31, 2006, our Audit Committee consisted of Juliet Jones, Robert Essery and Nelson Thall.  Each of these individuals is \u0093independent\u0094 and \u0093financially literate\u0094, as those terms are defined in relevant Canadian securities legislation.  They met seven times in the last fiscal year., 713459=July -06, 274664=The cash component of the transaction was financed by (i) a corporate facility with Canadian Imperial Bank of Commerce for US$2,700,000 secured by the acquisition\u0092s accounts receivables; (ii) two increased loan facilities with Imperial Capital Bank totalling US$4,600,000, secured by Peace Arch\u0092s accounts receivables; (iii) working capital of the Company in the amount of US$700,000.  The acquisition will be accounted for under the purchase method and the results of operations will be included in the consolidated financial statements from the acquisition date in the Company\u0092s second quarter results of fiscal 2007.    , 453330=In 2005, cash from financing activities was provided from the proceeds of the issuance of Series I Preference Shares and warrants of $2.3 million, and net additions of production loans of $3.4 million. Cash used in financing activities in fiscal 2004 of $2.6 million was primarily due to the net repayment of production loans., 817752=Certificate of Change of Name and Special Resolution of The Vidatron Group Inc., filed February 5, 1997. (1), 451626=In fiscal 2006, cash flows from financing activities was $25.1 million compared to $5.8 million in fiscal 2005 and cash used for financing activities of $2.6 million in fiscal 2004. The Company issued $31.9 million and repaid $18.3 million of production loans in 2006. These production loans represent various loan financing arrangements for the purpose of commencing the production of a film project or the acquisition of film distribution rights. During 2006, the Company generated cash flows of $8.6 million from financing activities through the issuance of common shares. On June 7, 2006, the Company completed a private placement of 7.5 million common shares for net proceeds of $8.4 million.  The, 207644=Fiscal Year Ended August 31, 661039= On June 16, 2006, the Company entered into an agreement with a company controlled by a director of the Company and a member of the Company\u0092s senior management to loan the Company $2,740,000. The loan bears interest at the rate of 18% per annum and is secured by the Company\u0092s unencumbered entitlement to tax credit receivables due on films that it has produced and by guarantees provided by certain unrelated production companies from whom the Company has acquired distribution rights in return for the payment of a distribution advance. The unrelated production companies\u0092 guarantees are limited to each production company\u0092s unencumbered entitlement to its tax credits receivables. The loan is due on December 1, 2007. During the year, the Company incurred interest of $99,000, which is included in interest expense in the statement of earnings., 673687=On December 21, 2006, the Company acquired 100% of the issued and outstanding shares of Castle Hill Productions Inc. and Dream LLC, which holds the rights to a library of films for a purchase price of US$9,000,000. The purchase consideration is US$8,000,000 cash and US$1,000,000 in issuance of Company shares.   The total amount of Common Shares issued was 1,120,419 and the fair value per Common Share was US$0.89, determined as at the 10 day weighted average prior to closing.  , 572315=The significant increase in the number of employees from 2005 to 2006 is due to the acquisition of kaBOOM! Entertainment Inc., which occurred on January 23, 2006., 727260=On February 11, 2004 our shareholders approved the reorganization of our share capital and the continuance of the Company as further described in Item 14 herein., 424128=Home Entertainment represents seven months from January 23, 2006., 220861=Exchange rates are based upon the noon buying rate in New York City for cable transfers in foreign currencies as certified for customs purposes by the Federal Reserve Bank of New York.  The noon rate of exchange on February 19, 2007 as reported by the United States Federal Reserve Bank of New York for the conversion of Canadian dollars into United States dollars was $0.8592 (US$1.00 = Cdn$1.1639).  Unless otherwise indicated, in this Annual Report all references are to Canadian Dollars., 165520=2005, 503327=President of the REO group of companies since 1992., 513857=Juliet Jones has been on the Board of Directors since February 22, 2001 and is a member of our Audit, Corporate Governance and Compensation Committee.  Ms. Jones is currently the Chief Financial Officer of   Webtech Wireless Inc., a TSX Venture listed company.  Previously Ms. Jones served in various roles for Peace   Arch Entertainment Group Inc. including Chief Financial Officer from 1996 to March 2001 and again from   January 2003 to September 2003.  Ms. Jones previously served as a member of the Board of the Vancouver   Chapter of Certified General Accountants and served as the chair of the professional development committee., 662224= As at August 31, 2006, included in production loans was $50,000 due to a director of the Company in respect of a loan for the purpose of interim financing of a certain production. The loan is due on demand and is interest free.  , 205742=On July 22, 2005, the shareholders authorized the reduction of the Company\u0092s stated capital for the Common Shares in the amount of $29,707,000 CDN which was applied to reduce the Company\u0092s accumulated deficit., 216467=November 2006, 388271=2004, 524180=Executive/Corporate Governance Committee:  The Executive/Corporate Governance Committee for the year ended August 31, 2006, was composed of Juliet Jones, Richard Watson and Robert Essery who are responsible for reviewing our adherence to the corporate governance policies of the securities regulatory authorities.  They make recommendations with respect to the composition of the board of directors.  As well, the Executive/Corporate Governance Committee, working independently of management, reviews strategic proposals including potential mergers, acquisitions and financing scenarios.  In addition, the Executive/Corporate Governance Committee has been authorized to develop a process for assessing the effectiveness of the Board as a whole and of committees of the Board, and for assessing the contribution of individual directors.  The Executive/Corporate Governance Committee meets intermittently as needed., 302408=Over the past three years, an average of approximately 36% of Peace Arch\u0092s revenue was generated outside of North America. We expect that recent additions to Peace Arch\u0092s sales force will generate revenue growth in all geographical markets.  The revenues generated in Europe and other markets increased in 2006 due to having a larger supply of programming available to European buyers than in fiscal 2005.  The increase in Canadian revenues in fiscal 2006 was due primarily to the addition of seven months of revenues from the newly acquired Home Entertainment business segment of the Company., 675081=Our Common Shares trade on The Toronto Stock Exchange (\u0093TSX\u0094) and The American Stock Exchange (\u0093AMEX\u0094) under the symbol PAE.   Our shares commenced trading on the TSX in November 1997 under the symbol \u0093VE\u0094.  Effective July 19, 1999, our Class A Multiple Voting Shares and Class B Subordinate Voting Shares began trading on the TSX, at which time our Common Shares were delisted. Our Class B Subordinate Voting Shares began trading on AMEX on July 28, 1999.  Our new Common Shares began trading on TSX and AMEX on March 16, 2004 at which time our Class A Multiple Voting Shares and Class B Subordinate Voting Shares were delisted., 557644=During the most recently completed financial year ended August 31, 2006 the directors of the Company were entitled to a yearly retainer of $5,000, which the Company paid in full.  As well, directors were entitled to $500 for each directors\u0092 or Committee Meeting attended in person and $300 for each directors\u0092 or Committee Meeting attended by conference call.  Chairpersons of any directors\u0092 or Committee Meeting were entitled to twice that of a non-chair member.  The directors also receive 75,000 stock options upon their election to the Board., 621115=May 15, 2006, 272261=On June 7, 2006, the Company completed a private placement of 7.5 million common shares for gross proceeds of $9,075,000 (net proceeds of $8,370,000). The proceeds were used to   repay a term loan of $3,447,000, to settle letters of credit amounting to $4,202,000 in   connection with the kaBOOM acquisition and to provide working capital.  An additional 269,000 Common Share Purchase Warrants were issued to Westwind Partners Inc. as partial payment for acting as agent on the Canadian portion of the transaction., 865828=Agency Agreement dated June 7, 2006 between Westwind Partners Inc. and the Company, 507169=Media and Telecommunications Investor, CEO of Craig Media (2000-2005), 656647=On July 29, 2005, in connection with a private placement, Drew Craig (1,847,652), Jeff Sagansky (1,195,652), Kerry McCluggage (1,195,652) and Assetone Investments Inc. (108,695) received Series I Preference Shares.  Each Series I Preference Share has a Series II Preference Share purchase warrant attached., 817222=Certificate and Special Resolution Vidatron Enterprises Ltd., filed February 13, 1992 (1), 263041=Our Articles of Memorandum were amended such that the share capital was reorganized, eliminating the distinction between Class A Multiple Voting Shares without par value and Class B Subordinate Voting Shares without par value and designating such shares as Common Shares without par value each having one vote. Each class A Multiple Voting Share was exchanged for one new common share and one Class B Subordinate Voting Share was exchanged for one new common share. The reorganization was implemented to simplify the Company\u0092s share capital. Our common shares began trading on the TSX and AMEX on March 16, 2004 under the trading symbol PAE., 740194=The discussions summarize the material tax considerations relevant to an investment in Common Shares by individuals and corporations who, for income tax purposes, are resident in the U.S. for purposes of the Convention (as hereinafter defined) and are not resident in Canada, who hold Common Shares as a capital asset, and who do not use or hold the Common Shares in carrying on a business through a permanent establishment in Canada or in connection with a fixed base in Canada (collectively, \u0093U.S. Holders\u0094).  The discussion of U.S. tax considerations is addressed only to U.S. Holders whose \u0093functional currency\u0094 within the meaning of section 985 of the Internal Revenue Code of 1986, as amended (the \u0093Code\u0092\u0092), is the U.S. dollar, and to U.S. citizens who are not residents in the U.S. for purposes of the Convention, but who otherwise meet the definition of U.S. Holders. Furthermore, the discussion of U.S. tax considerations does not address the tax treatment of U.S. Holders that own, or are deemed for U.S. federal income tax purposes to own, 10% or more of the total combined voting power of all classes of voting stock of Peace Arch.  This discussion does not cover any state, local or foreign tax consequences.  The discussion of Canadian tax considerations does not address the tax treatment of a trust, company, organization or other arrangement that is a resident of the U.S. and that is generally exempt from U.S. tax., 729904=On February 7, 2006, the Company engaged Trilogy Capital Partners, Inc. to develop and implement a marketing program for the Company.  One of the components of the agreement was the issuance of 1.5 million Common Share warrants to Trilogy.  1 million warrants vested immediately and 500,000 warrants vest at the end of the arrangement 12 months after the grant date, as a result, the Company recorded an expense of $469,000. Each warrant is convertible into one common share of the Company at an exercise price of US$0.54, exercisable to February 7, 2009., 868023=Certification of Chief Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002., 430505=Home Entertainment revenues of $9.6 million in fiscal 2006 represent seven months of revenues recognized from the acquisition kaBOOM! Entertainment Inc. in the second quarter of 2006., 718318=October -06}",
    "textBeforeTable": "The table below shows the breakdown of revenues by segments during our past three fiscal years: The Company reports its results of operations in three reportable segments, Motion Picture, Television, and Home Entertainment representing its principal business activities. The Motion Picture segment focuses its activities on the acquisition and worldwide exploitation of motion picture content; and has recently produced two full length feature films \u0093Delirious\u0094 and \u0093Chapter 27\u0094. The Television segment focuses its activities on the acquisition, production and worldwide exploitation of television content.  The Home Entertainment segment focuses its activities on marketing and licensing videos, DVDs and ancillary merchandise to most of the major retail outlets in Canada. REVENUE STREAMS Since 2003, Peace Arch has built a library of 28 feature films, 60+ television episodes and 6 documentaries and with the acquisition of Dream LLC and Castle Hill Productions Inc., the Company acquired a library of approximately 500 feature films. Prior to 2003, the Company had an additional 200+ hours of filmed entertainment. Existing Library In collaboration with its content partner Nelvana, during fiscal 2006 the Home Entertainment segment developed two unique branded product",
    "textAfterTable": "        Revenues by Segment       Motion Picture 9.4 9.2 18.3 Television 2.3 1.5 2.9 Home Entertainment 9.6",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}