{
    "relation": [
        [
            "Patent application number",
            "20090128148",
            "20110148410",
            "20120025822",
            "20120262171",
            "20140035576",
            "20140125335"
        ],
        [
            "Description",
            "NMR tomography method based on NBSEM with 2D spatial encoding by two mutually rotated multipole gradient fields - A nuclear magnetic resonance (NMR) imaging method",
            "Method for data acquisition acceleration in magnetic resonance imaging (MRI) using receiver coil arrays and non-linear phase distributions - A method for accelerating data acquisition in MRI with N-dimensional spatial encoding has a first method step in which a transverse magnetization within an imaged object volume is prepared having a non-linear phase distribution. Primary spatial encoding is thereby effected through application of switched magnetic fields. Two or more RF receivers are used to simultaneously record MR signals originating from the imaged object volume, wherein, for each RF receiver, an N-dimensional data matrix is recorded which is undersampled by a factor R",
            "Method of MR (=magnetic resonance) with spatial encoding to generate an image of spectroscopic data - A method of MR with spatial encoding to generate an image or spectroscopic data of an object of investigation inside an MR apparatus comprises the steps of (a) selecting a volume of interest within the object of investigation, (b) applying an RF pulse to generate a transverse magnetization within the object of investigation, (c) preparing a nonlinear phase distribution within the object of investigation by application of spatially encoding magnetic fields (SEMs), the SEMs comprising of a nonlinear gradient field or a combination of linear and nonlinear gradient fields, (d) effecting primary spatial encoding through application of SEMs, and (e) recording MR signals originating from the object of investigation. Step (c) or (d) thereby comprises applying a sequence of at least two SEMs, at least one of which contains a nonlinear field gradient and at least two of the SEMs having different field geometries. The sequence of SEMs is applied at a point in time from and including the excitation of the object of interest in step (b) up to and including the recording of the MR signals in step (e), to thereby introduce a temporal shift of the signals arising from spatially different locations within the selected volume of interest, that is to thereby introduce a shift of local spatial frequency components. A sampling window for recording of the respective MR signals is set and signals originating from the volume of interest are recorded in step (e) and undesired signals originating from outside the volume of interest are suppressed.",
            "Method of magnetic resonance imaging for the selection and recording of curved slices - A method of MR imaging applies a magnetic field B",
            "Method and apparatus for accelerating magnetic resonance imaging - A method of MRI entails recording and storing MR signals from an object to produce an old set of data. A further measurement of the object is then initiated at a later time to record new MR data, whereby k-space is undersampled in the further measurement. The old data are corrected for changes in the new position of the object, for changes in the sensitivity and exact spatial positioning of the receiver coils as well as for changes in the actual field shimming. The old and new data are then combined to create a new, high resolution image of the object.",
            "Method for magnetic resonance imaging - A method of MRI for reduction of motion artifacts in 3D MR data acquisition with multiple segments comprises: the complete acquisition being divided into two parts: basic acquisition and complementary acquisition. Basic acquisition is performed at the beginning. Complementary acquisition is performed after the basic acquisition is finished. View Reordering is prepared for basic acquisition and complementary acquisition separately. Motion monitoring is performed regularly during the data acquisition. Whenever motion is detected, data acquisition stops. Image reconstruction is performed when motion occurs in the phase of complementary acquisition. The final reconstructed image is free of motion artifacts."
        ],
        [
            "Published",
            "05-21-2009",
            "06-23-2011",
            "02-02-2012",
            "10-18-2012",
            "02-06-2014",
            "05-08-2014"
        ]
    ],
    "pageTitle": "Hennig, DE - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hennig-de-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436116815,
    "recordOffset": 436094276,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Juergen Hennig, Freiburg DE 09-11-2014 EXCHANGEABLE SADDLE BACKPANEL - The invention relates to a saddle for horseback riding which has on the distal side of its cantle or on the rear end face thereof a one- or multipiece backpanel reversibly releasably attached by one or a plurality of fastening means; to a one- or multipiece backpanel including one or more fastening means for reversibly releasable connection; and a set comprising a saddle and a backpanel therefor, the said provided with complementary fastening means for reversibly releasable connection. 20140250842 Published Description Patent application number Jochen Hennig, Muhlenberge/haage DE 12-29-2011 YAW BEARING SYSTEM - A wind energy system is provided, with the wind energy system having a tower; a machine nacelle; a lower yaw bearing; and an upper yaw bearing; the lower yaw bearing and the upper yaw bearing being arranged to pivotably connect the machine nacelle to the tower of the wind energy system. Further, a yaw bearing system for use in a wind energy system and a method for operating a wind energy system are provided. 20110316286 01-28-2010 EXPANDABLE LINE SUPPORT FOR WIND TURBINE - A wind turbine, includes a tower; a blade for rotating on the tower; a rotor shaft, connected to the blade, having an axial hole; a line, arranged in the hole, for carrying a signal; and a support for spacing the line from the rotor shaft inside the",
    "textAfterTable": "Patent applications by Juergen Hennig, Freiburg DE Jürgen Hennig, Freiburg DE Patent application number Description Published 20110080169 Method for position dependent change in the magnetization in an object in a magnetic resonance experiment - A method for position dependent change in the magnetization in an object, according to a requirement in a magnetic resonance measurement, wherein radio-frequency pulses are irradiated in conjunction with supplementary magnetic fields that vary in space and over time and are superposed on the static and homogeneous basic field of a magnetic resonance measurement apparatus along a z-direction, is characterized in that non-linear supplementary magnetic fields are used, whose spatial gradient of the z-component is not constant at least at one instant of the irradiation, and that the radio-frequency pulses to be irradiated are calculated in advance, wherein progressions over time of the field strengths of the supplementary magnetic fields in the region of the object that are calculated and/or measured position-dependently are included in this calculation. This enables change in the magnetization with an at least locally spatially higher resolution and/or shorter irradiation duration of the RF pulses and supplementary magnetic fields than is feasible with linear supplementary magnetic fields produced by conventional gradient systems. In",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}