{
    "relation": [
        [
            "Thread",
            "Article ID: 923126 Error message when you try to install an additional operating system on a computer that is running Windows Vista: \"A disk read error has occurred. Press CTRL+ALT+DEL to restart.\"",
            "Article ID: 929678 Error message when you try to capture a source volume by using ImageX.exe in Windows Vista: \"The system cannot find the file specified.\"",
            "Article ID: 933595 Error message when you try to install a hotfix on a Windows Vista-based computer in a domain: \"Installer encountered an error: 0x8007177f. This machine is disabled for file encryption\"",
            "Article ID: 936970 Error message when you work in a Terminal Services session and save a document in a 2007 Office program to a redirected drive: \"There has been a network or file permission error\"",
            "Article ID: 941298 Error message when you try to access a WebDav shared file from a Windows Vista-based computer: \"System error 1397 has occurred. Mutual Authentication failed\""
        ],
        [
            "Thread Starter",
            "KBArticles",
            "KBArticles",
            "KBArticles",
            "KBArticles",
            "KBArticles"
        ],
        [
            "Forum",
            "English",
            "English",
            "English",
            "English",
            "English"
        ],
        [
            "Replies",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Last Post",
            "10-22-2007 20:00",
            "10-22-2007 20:00",
            "10-22-2007 20:00",
            "10-22-2007 20:00",
            "10-22-2007 20:00"
        ]
    ],
    "pageTitle": "Error Message \"File System Error (65535) - Microsoft Windows Vista Community Forums - Vistaheads",
    "title": "",
    "url": "http://www.vistaheads.com/forums/microsoft-public-windows-vista-general/150184-error-message-file-system-error-65535-a.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 52,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 822996603,
    "recordOffset": 822973086,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Similar Threads Off Refbacks are On Pingbacks are On Trackbacks are Off HTML code is On [IMG] code is On Smilies are On vB code is may not edit your posts You may not post attachments You may not post replies You may not post new threads You Posting Rules Switch to Threaded Mode",
    "textAfterTable": "All times are GMT +1. The time now is 19:22. -- English (US) -- Français -- German-du -- Simplified Chinese Privacy Policy - Contact Us - Microsoft Windows Vista Community Forums - Vistaheads - Archive - Top Vistaheads.com is part of the Heads Network. See also XPHeads.com , Win7Heads.com and Win8Heads.com.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}