{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Forum",
            "GTA V PC, Gameplay, Guides & Strategies, Help & Support This forum is dedicated to discussion about the latest installment in the series, Grand Theft Auto V.",
            "GTA IV PC, Gameplay, Episodes from Liberty City, Multiplayer, Guides & Strategies, Help & Support This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008.",
            "GTA Chinatown Wars This forum is dedicated to GTA: Chinatown Wars - the tenth game in the series, and the first to be developed for Nintendo DS.",
            "GTA Vice City Stories This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006.",
            "GTA Liberty City Stories This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005.",
            "GTA San Andreas Gameplay, Mission Help, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.",
            "GTA Vice City Gameplay, Guides & Strategies, Help & Support, PC Modding This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002.",
            "GTA III Gameplay, Guides & Strategies, Help & Support, PC Modding This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001.",
            "Top Down Games GTA Advance, GTA 2, GTA This section is dedicated to the 2D Grand Theft Auto titles, including the original, GTA 2, and GTA Advance.",
            "GTA Series GTA Concepts General chat related to the series. This section can also be used to post concept threads for new GTAs."
        ],
        [
            "Stats",
            "85,100 topics 2,124,311 replies",
            "85,554 topics 1,153,758 replies",
            "1,071 topics 11,069 replies",
            "4,218 topics 64,758 replies",
            "5,996 topics 75,810 replies",
            "50,541 topics 466,176 replies",
            "22,766 topics 196,291 replies",
            "4,270 topics 60,441 replies",
            "1,127 topics 8,213 replies",
            "3,599 topics 115,325 replies"
        ],
        [
            "Last Post Info",
            "How big LS really is next t... By Midnight Hitman A minute ago",
            "Did anyone had problem with... By Masketta Man 4 minutes ago",
            "The Ultimate 100% Save File... By Militia 2 days ago",
            "Whats your favourite radio... By thedriver111 2 hours ago",
            "Whats your favorite/hated r... By Kristian. A day ago",
            "Favorite gym fighting style? By inadequate 52 minutes ago",
            "Beta Vice City By xNCx 2 hours ago",
            "Grand Theft Auto III Pre-Re... By RWWPL 8 hours ago",
            "Anybody has a 100 % savegame? By Cerium A day ago",
            "Deadliest Grand Theft Auto... By Phoenix_Poop 3 minutes ago"
        ]
    ],
    "pageTitle": "GTAForums",
    "title": "",
    "url": "http://gtaforums.com/index.php?act=Post&CODE=06&f=55&t=464025&p=1060223188",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00201-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 103263183,
    "recordOffset": 103238596,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9392=This section is dedicated to Grand Theft Auto IV - the ninth title in the series, released in 2008., 14306=This forum is dedicated to GTA: Liberty City Stories - the first 3D portable Grand Theft Auto title, released in 2005., 18740=This forum is dedicated to GTA: Vice City - the fourth title in the series, released in 2002., 47605=Yahoo, Google, alex1369, D9fred95, gpcguy1, flcon02, Bing, MenuET, Rented, del__cielo, BUZZARDBUTCHER, Jlogano22, Midnight Hitman, Lebowski_RS, Maxandmov, LFC484, DzxProx, Laguezmer, Phoenix_Poop, nLytin, dewtech_2008, Cico555, Jon3s, Pavle, Officer Garza, Supernutz40, Jinx., XJpostman, Flesh-n-Bone, __TheGovernor__, SKARFACE, KlIIUMlNATl, svanderman, Jestic, Max Payne, Marv08, TexasRocks, joel15cat, BoomBapPoet, whywontyoulisten, Tylerhasswagz, maus05, CptWuTang, GTAKid667, Ritu85, vortexHD, Slam_Jones, silentkiller44, kassiano7, starblind94, GodHatesKittens, -RONIN-, Nachoman, malcolmfunktion, yojc, RayBanNeonColors420, gamefriik200, RiseAgainBH, TheTigOlBitties, Slash3r9, _MK_, Feawyn, Pettyium117, AcidRunner, TheJasonGallant, TheMcSame, dice, Farque2, CrossPT, Rafli, camo_boy67, bronysplatter, GTAVNoob, Khumaro, Masketta Man, Heists, Google Mobile, lol232, EarlyLifeFailure, ItsThatGuy!, MatthewGTHughes, Loucodanoia12345, Code Haruna, CarlitoDorito, highwayking, BeckermannDewitt, bixlas13, epoxi, ThirteenAG, I Love Anna Kournikova, SuperGTFan, xDatxJunkyx, tkc.snail, xTOMMYTROJANx, vnctmrn, ghoraaa, Andreaz1, Cornphlake, paperbagdude, RussianCommie, ContrLv2, kleoboy, joe_alker, VideoGameJames, ZeroSafe5615, Braindawg, deadx23, Crackhead_Ben, Mastah, MitchMaljers, r0eladn, Captain Sensib1e, Vadim M., ATastyCookie, Ry595, JaegerPilot1, gtaguy95, Rebel, toxluv, lolznc, Clark., 11john11, BXHITMAN01, Fozzie_420, NotAHipster, MrSaucyZ, Pegassi Autobot, Halal Cyborg, s2n vaniish, X12-1992, Deus Ex, Los Santos citizen, SolidUSP, GipsyDanger MK2, Svip, pg1313, frodzet, LtFlash, Argonaut, GunsNroses61, Eram, CaptianBackwoods, Rangerlump, Doc302, Schleemil, Ezekeil2Ofive17, Officer Ronson, grunsker, Funkadory, SirBurka_, Pr0Pr3da70rBG, Imb44tu, Gamer Rachel, Vassago1988, Pyro_Indigo, RedDagger, TheUnbalanced, thehambone, Fetti Debartolo, Pentalarc, marshallbslayer, treez, Tony_Florence, xBagram, Black_MiD, Drunkmoons, OysterBarron, Above Omnipotence, ClaudX, SuperHolySheep, CMCSAVAGE, MrRyanMcCall, Miku_Design, Malcot, DragonSpade, IDredMan, MisterEd, mkjah222, A-Lonely-Dragon, uknoimhigh, K-ROSE, adra12, CountySheriff, XBOXmightyproducer1, xTobyyyyyy, poddy2009, CataniaTiger, StuTheDude, Zodape, NBAKingzFan10, Nick1020, Avenged Sevenfold, kevdawgisms, Geralt of Rivia, InYeezusWeTrust, ethandavo, Claptrap NL, GB981, Fuzzknuckles, monkb4skunk, Wolftickets, Sigurd, ashbashbluesfan, universetwisters, iamcornholio, Xpert.K, JuZ 75, silenthunterdgm, Bitter Destructo, JohnSantina, Tomern11, Mona Sax, Rusty Balls, uncaged, Molster, //XP//, ballen205, Bluntnation94, Icantthinkofonew, Muskidinho04, Neddo, little_idiot, Cognoscenti, gizz01, Dave_TE, Daemian, JSnipe135i, -Jacking-, WhiteRex, Th3MaN1, Irviding, VercettiGuy, unicornace, Bone34, MrAbbeel, reaper0322, FrikkenZz, johnson., MagellanFall, SpeedyE3, WestsideResider, feckyerlife, sheepy111, DJS, Hunter241, _CP_, Bootels, hotline.n.w.refn, arewenotmen, Grootstrength, SilentSeasons, Cass12, FlexPiTo, Strepherd, DaTwista, LackDiscipline, Cerberus178, Smooth Longsack, TheFoxRiverFugitive, Abysmal, Lil Kenzo, JackhammahNZ, L00NEY, GooD-NTS, hyperar, ManInBlack, Tounsi4life69, Andreas, ClippedWings, Bangha, ela089, statistic, Quarthon, Lord_Daquan, Cameron Star, Juan 16, CMGreger, Reyks, drewphilly, Electrogypsy, meta187, oCrapaCreeper, Sneakerhead., Holmls, dragoon371, Deadman1996, TreFacTor, mx5rm85, Tylomon, Beez, Zonnex, Misunderstood, TJGM, Oddtester, Dukestboy, gtuned, RobCharles1981, transambill, brownbmxar, Nerfgoth, M4k3, PoeticWhisper, WhosYu, HumanRacehorse, MythAlex, WhiteLikePaste, VikDarkbomb, BlackZmith10, Pharaoh19, Kixa, Phnx., Smale45, darktytanus, PursuitForceS, fac316, The Yokel, 127622=© 2001-2015 GTANet.com | Cookies and Privacy Policy | Copyright Statement, 12738=This forum is dedicated to GTA: Vice City Stories - a prequel to GTA: Vice City, released in 2006., 20864=This section is dedicated to Grand Theft Auto III - the first 3D title in the series, released in 2001., 16612=This forum is dedicated to GTA: San Andreas - the fifth title in the series, released in 2004.}",
    "textBeforeTable": "Toggle Grand Theft Auto Grand Theft Auto (adsbygoogle = window.adsbygoogle || []).push({}); A minute ago By Jinx. Facade Corporation 613,252 replies 15,195 topics Social lounge for multiplayer crews & forum gangs. Recruitment Crews & Gangs A minute ago By flcon02 Looking for some people to... 2,281,777 replies 113,347 topics This is a general discussion forum for Grand Theft Auto Online. Help & Support",
    "textAfterTable": "Toggle GTA Mods GTA Mods   Forum Stats Last Post Info GTA Modding GTA V, GTA IV, GTA III, VC & SA, Tutorials, Art Support General discussion and support. 48,462 topics 416,601 replies Requests/Finds (Mods you... By WhiteRex 12 minutes ago Mod Showroom Scripts & Plugins, Maps, Total Conversions, Vehicles,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}