{
    "relation": [
        [
            "Company",
            "Market Cap:",
            "Employees:",
            "Qtrly Rev Growth (yoy):",
            "Revenue:",
            "Gross Margin:",
            "EBITDA:",
            "Operating Margin:",
            "Net Income:",
            "EPS:",
            "P/E:",
            "PEG (5 yr expected):",
            "P/S:",
            "P/B:"
        ],
        [
            "BCRH",
            "152.16M",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "N/A",
            "-1.40M",
            "-0.61",
            "N/A",
            "N/A",
            "N/A",
            "0.87"
        ],
        [
            "PRE",
            "5.35B",
            "1,112",
            "0.25",
            "5.54B",
            "0.24",
            "860.51M",
            "0.15",
            "597.01M",
            "10.58",
            "9.78",
            "2.95",
            "0.95",
            "0.80"
        ],
        [
            "RNR",
            "4.07B",
            "285",
            "0.19",
            "1.38B",
            "0.78",
            "908.65M",
            "0.62",
            "653.73M",
            "14.88",
            "6.56",
            "1.24",
            "2.93",
            "1.21"
        ],
        [
            "VR",
            "3.52B",
            "571",
            "0.12",
            "2.16B",
            "0.46",
            "663.05M",
            "0.31",
            "513.45M",
            "4.94",
            "7.63",
            "0.52",
            "1.61",
            "0.96"
        ]
    ],
    "pageTitle": "Blue Capital Reinsurance: 3 Different Insiders Have Purchased Shares During The Last 30 Days - Blue Capital Reinsurance Holdings Ltd. (NYSE:BCRH) | Seeking Alpha",
    "title": "",
    "url": "http://seekingalpha.com/article/2120683-blue-capital-reinsurance-3-different-insiders-have-purchased-shares-during-the-last-30-days?source=nasdaq",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 211619451,
    "recordOffset": 211594929,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2881=Blue Capital Reinsurance reported the full-year 2013 (from June 24 to December 31) financial results on February 5 with the following highlights:, 2571=There have been 2,522,000 shares purchased, and there have been 51,000 shares sold by insiders since November 2013. Blue Capital Reinsurance had its IPO in November 2013.}",
    "lastModified": "Sun, 02 Aug 2015 04:18:56 GMT",
    "textBeforeTable": "Blue Capital Reinsurance's competitors include PartnerRe Ltd. (NYSE:PRE), RenaissanceRe Holdings (NYSE:RNR), and Validus Holdings (NYSE:VR). Here is a table comparing these companies. Competition The three insiders purchased their shares after these results. $19.80 per share Book value $0 Debt $173.8 million Cash $0.7 million Net loss Blue Capital Reinsurance reported the full-year 2013 (from June 24 to December 31) financial results on February 5 with the following highlights: Financials There have been 2,522,000 shares purchased, and there have been 51,000 shares sold by insiders since November 2013. Blue Capital Reinsurance had its IPO in November 2013. 51,000 2,500,000 November 2013 0 0 December 2013 0 0 January 2014 0 0 February 2014 0 22,000 March 2014 Insider selling / shares Insider buying / shares Month Here is a table of Blue Capital Reinsurance's insider activity by calendar month. Insider buying by calendar month There have been 22,000 shares purchased by insiders during the last 30 days. from 0 to 14,500 14,500 shares 14,500 March 12-13 CEO William Pollett from 0 to 5,000 5,000 shares 5,000 March 27 Director Christopher Harris from",
    "textAfterTable": "Blue Capital Reinsurance has the second-lowest P/B ratio among these four companies. Here is a table of these competitors' insider activities this year. Company Insider buying / shares Insider selling / shares PRE 0 0 RNR 0 46,257 VR 0 32,859 Only Blue Capital Reinsurance has seen intensive insider buying during the last 30 days. Conclusion There have been three different insiders buying Blue Capital Reinsurance, and there have not been any insiders selling Blue Capital Reinsurance during the last 30 days. All three of these insiders increased their holdings by more than 10%. (click to enlarge) (Source: Investor presentation) The three insiders purchased their shares at prices ranging from $16.91 to $17.30. I believe Blue Capital Reinsurance could be a good pick below $17.30 based on the intensive insider buying. (click to enlarge) (Source: Investor presentation) Disclosure: I have no positions in any stocks mentioned, but may initiate a long position in BCRH over the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Source: Blue Capital Reinsurance: 3 Different Insiders Have Purchased Shares During The Last 30 Days",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}