{
    "relation": [
        [
            "S",
            "",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "M",
            "",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "T",
            "",
            "4",
            "11",
            "18",
            "25",
            ""
        ],
        [
            "W",
            "",
            "5",
            "12",
            "19",
            "26",
            ""
        ],
        [
            "T",
            "",
            "6",
            "13",
            "20",
            "27",
            ""
        ],
        [
            "F",
            "",
            "7",
            "14",
            "21",
            "28",
            ""
        ],
        [
            "S",
            "1",
            "8",
            "15",
            "22",
            "29",
            ""
        ]
    ],
    "pageTitle": "DC Statehood: A Primer | Washington Peace Center",
    "title": "",
    "url": "http://washingtonpeacecenter.net/dcstatehoodprimer",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 254945076,
    "recordOffset": 254928682,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2519=Historically, DC’s systematic disenfranchisement comes out of a legacy of racism and segregation. As a predominantly African-American city, the establishment was unwilling to grant DC residents full citizenship even years after the civil rights act of 1963., 3651=In facing these challenges, DC has moved to gain more autonomy over the years. In 1960 residents gained a voice in presidential elections. In 1973 the Home Rule Act was passed, which allowed DC residents to elect their own mayor and city council. However, all legislation that the city council passes must be approved by congress. Lacking the self-determination that is central to the democratic process, here are a few examples of legislation congress refused to allow the DC government to implement:}",
    "TableContextTimeStampAfterTable": "{21499=1525 Newton St NW Washington, DC 20010 202-234-2000 info@washingtonpeacecenter.org washingtonpeacecenter.org, 21662=All content on this site © 2014 by each individual author. All Rights Reserved. Website by CEDC}",
    "lastModified": "Sun, 02 Aug 2015 04:14:29 GMT",
    "textBeforeTable": "» « Saturday, August 1 Events As a show of solidarity, and since you’re going to speak with your elected representative anyway, please take a second to bring up the issue of DC Statehood. For these reasons, both historic and current, local Washingtonians ask that visitors to learn the reality of DC’s status as an unrepresented district. When utilizing the resources of organizers and activists in DC, also realize that Statehood is a constant fight, and one that requires the support of allies to win. DC’s lack of federal representation is marred in a history of racism and bigotry. Historically, DC’s systematic disenfranchisement comes out of a legacy of racism and segregation. As a predominantly African-American city, the establishment was unwilling to grant DC residents full citizenship even years after the civil rights act of 1963. A city-wide ban on handguns Funding abortions for low-income women using city tax revenue",
    "textAfterTable": "EXTRA SHOWS It’s What We Do: A Play About the Occupation 08/02/2015 - 2:00pm A.C.T.O.R (A Continuing Talk on Race) - Judge Not: A Photo Exhibition and Open Discussion on the Perception of Black Men 08/02/2015 - 5:00pm to 7:00pm Thanking John Kerry for Iran Deal- at his house! 08/03/2015 - 6:00pm More dates Get our weekly activist alert... First Name:* Last Name:* Email:* Zip:* Optional Member Code",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}