{
    "relation": [
        [
            "Year",
            "2002",
            "",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "2013"
        ],
        [
            "Team",
            "GCL Expos",
            "",
            "Augusta GreenJackets",
            "San Jose Giants",
            "Richmond Flying Squirrels",
            "San Jose Giants",
            "San Jose Giants",
            "San Jose Giants"
        ],
        [
            "League",
            "Gulf Coast League",
            "",
            "South Atlantic League",
            "California League",
            "Eastern League",
            "California League",
            "California League",
            "California League"
        ],
        [
            "Record",
            "28-32",
            "",
            "88-50",
            "93-47",
            "68-73",
            "90-50",
            "75-65",
            "83-57"
        ],
        [
            "Finish",
            "8th (t)",
            "",
            "1st",
            "1st",
            "9th",
            "1st",
            "2nd",
            "1st"
        ],
        [
            "Organization",
            "Montreal Expos",
            "",
            "San Francisco Giants",
            "San Francisco Giants",
            "San Francisco Giants",
            "San Francisco Giants",
            "San Francisco Giants",
            "San Francisco Giants"
        ],
        [
            "Playoffs",
            "",
            "",
            "League Champs",
            "League Champs",
            "",
            "Lost in 2nd round",
            "Lost in 1st round",
            "Lost League Finals"
        ]
    ],
    "pageTitle": "Andy Skeels - BR Bullpen",
    "title": "",
    "url": "http://www.baseball-reference.com/bullpen/Andy_Skeels",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 308631095,
    "recordOffset": 308615136,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8687=Skeels managed the New Zealand national team in the 2013 World Baseball Classic Qualifiers, leading them to the championship game against Taiwan; one of his players was his brother David Skeels. Another brother, Mark Skeels, also played pro ball., 7013=Catcher Andy Skeels was selected by the San Diego Padres in the seventh round of the 1987 amateur draft and played in the minors from 1987 to 2001, briefly reaching AAA. He was the first-ever New Zealand born player to be drafted by a Major League organization., 7592=Skeels was a coach for the Savannah Sand Gnats (2000, 2002-2004), Brevard County Manatees (2004-2005) and Augusta GreenJackets (2006-2007). He managed the GCL Expos in 2002 and managed Augusta to the South Atlantic League title in 2008. Over the past half dozen years (2008-2013), as a manager in the San Francisco Giants organization, he won more games and had a higher winning percentage than any manager in the minor leagues. He was hitting coach for the Fresno Grizzlies in 2014 and Sacramento River Cats in 2015.}",
    "textBeforeTable": "[edit] Year-By-Year Minor League Managerial Record Skeels managed the New Zealand national team in the 2013 World Baseball Classic Qualifiers, leading them to the championship game against Taiwan; one of his players was his brother David Skeels. Another brother, Mark Skeels, also played pro ball. Skeels was a coach for the Savannah Sand Gnats (2000, 2002-2004), Brevard County Manatees (2004-2005) and Augusta GreenJackets (2006-2007). He managed the GCL Expos in 2002 and managed Augusta to the South Atlantic League title in 2008. Over the past half dozen years (2008-2013), as a manager in the San Francisco Giants organization, he won more games and had a higher winning percentage than any manager in the minor leagues. He was hitting coach for the Fresno Grizzlies in 2014 and Sacramento River Cats in 2015. Catcher Andy Skeels was selected by the San Diego Padres in the seventh round of the 1987 amateur draft and played in the minors from 1987 to 2001, briefly reaching AAA. He was the first-ever New Zealand born player to be",
    "textAfterTable": "[edit] Related Sites Augusta Greenjackets profile Retrieved from \" http://www.baseball-reference.com/bpv/index.php?title=Andy_Skeels&oldid=1700244020\" Categories: Minor League Players Minor League Managers Minor League Coaches National Team Managers Baseball Families Births in 1965 Views Page Discussion Edit History Personal tools Log in / create account Navigation Main Page Main BR page Community portal What's Happening Recent changes Random page Help Upload wizard Search",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}