{
    "relation": [
        [
            "Browser",
            "Chrome 21",
            "Safari 6.0",
            "Opera 12",
            "Firefox 14.0.1",
            "Maxthon 1.0.3"
        ],
        [
            "HTML5 Vector",
            "15.59",
            "34.53",
            "25.22",
            "2.86",
            "15.57"
        ],
        [
            "HTML5 Bitmap",
            "45.92",
            "55.05",
            "55.98",
            "13.65",
            "56.08"
        ],
        [
            "HTML5 Text",
            "18.33",
            "20.39",
            "20.17",
            "19.29",
            "17.14"
        ],
        [
            "V8",
            "7301",
            "4575",
            "2323",
            "3827",
            "5799"
        ],
        [
            "SunSpider",
            "332.1",
            "353.7",
            "393.3",
            "338.8",
            "390.8"
        ],
        [
            "Acid3",
            "100",
            "100",
            "100",
            "97",
            "100"
        ],
        [
            "HTML5 Compliance",
            "437/13 bonus",
            "391/11 bonus",
            "400/9 bonus",
            "345/9 bonus",
            "385/9 bonus"
        ]
    ],
    "pageTitle": "Chrome 21 is a browser built more for speed than style | Macworld",
    "title": "",
    "url": "http://www.macworld.com/article/1168363/chrome_21_is_a_browser_built_more_for_speed_than_style.html",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 562351223,
    "recordOffset": 562319263,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3214=Indeed, most of Chrome’s notable additions have been made under the hood. The browser fully supports Lion’s Full Screen mode—which coexists somewhat awkwardly with Chrome’s own, functionally identical Presentation Mode. Also, despite Google’s stated intention last year to ditch H.264 video support in favor of its own WebM codec, Chrome still appears to play both types of HTML5 video.}",
    "TableContextTimeStampAfterTable": "{44446=© 1998-2015, IDG Consumer & SMB}",
    "lastModified": "Sun, 02 Aug 2015 04:39:51 GMT",
    "textBeforeTable": "Benchmarks: Chrome 21 In regular use, Chrome felt generally fast, responsive, and fun to use, on par with its latest competitors. However, when it came to actual HTML horsepower, Chrome fell surprisingly short. Its score in an HTML5 vector graphics test beat Firefox’s handily, but still totaled less than half Safari’s mark. It ran about 19 percent slower than the leading scores in HTML5 bitmap graphics, and placed fourth after Safari, Opera, and Firefox in HTML5 text handling—albeit by a narrower gap. And Chrome downright embarrassed the competition in HTML5Test.com’s check of standards compliance. Its score of 431 (plus 13 bonus points) out of 500 exceeded its nearest rival, Opera 12, by 41 points, with the rest of the pack trailing considerably farther behind. In Google’s own V8 JavaScript benchmark suite, Chrome’s score beat that of every other browser by at least 25 percent. Even in the SunSpider JavaScript benchmark, Chrome edged out Firefox for the fastest time, trouncing the others by even wider margins. For HTML5 standards compliance and raw JavaScript performance, no Mac browser beats Chrome. In tests on a 2GHz aluminum MacBook with 2GB of RAM, Chrome smoked the latest versions of Safari, Firefox, Opera ( ), and Maxthon ( ) (essentially a Chrome clone) in both categories. Hot rod browser Top Tier: Chrome posts",
    "textAfterTable": "Best results in bold. Reference browsers are in italics. HTML5 Vector, Bitmap, and Text test results are in frames per second; higher is better. The V8 Benchmark Suite test results are scores; higher is better. The SunSpider JavaScript results are in milliseconds; shorter times are better. The Acid3 result is a score out of 100. HTML5 Compliance is a score out of 500. Bottom line If you like to browse without frivolous bells and whistles, or need first-rate JavaScript performance, Chrome is the browser for you. What it lacks in surface refinements, it more than makes up for in raw power. [Nathan Alderman is a writer, editor, and occasional Top Gear viewer in Alexandria, Va.]",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}