{
    "relation": [
        [
            "Disability Type",
            "No Disability",
            "Any Disability",
            "Visual",
            "Hearing",
            "Ambulatory",
            "Cognitive",
            "Self-Care",
            "Independent Living"
        ],
        [
            "Percent",
            "83.5",
            "90.0",
            "89.9",
            "89.7",
            "92.1",
            "90.7",
            "94.1",
            "93.5"
        ],
        [
            "MOE",
            "0.34",
            "0.87",
            "2.21",
            "2.07",
            "1.06",
            "1.35",
            "1.59",
            "1.20"
        ],
        [
            "Number",
            "8,723,700",
            "938,100",
            "145,400",
            "167,300",
            "517,400",
            "363,600",
            "178,500",
            "345,000"
        ],
        [
            "MOE",
            "64,740",
            "27,840",
            "11,190",
            "12,000",
            "20,910",
            "17,600",
            "12,390",
            "17,150"
        ],
        [
            "Base Pop.",
            "10,445,000",
            "1,042,400",
            "161,700",
            "186,600",
            "561,900",
            "401,100",
            "189,600",
            "368,900"
        ],
        [
            "Sample Size",
            "97,334",
            "10,154",
            "1,495",
            "1,926",
            "5,400",
            "3,831",
            "1,845",
            "3,639"
        ]
    ],
    "pageTitle": "Disability and Employment Status Report for New York, 2009",
    "title": "",
    "url": "http://digitalcommons.ilr.cornell.edu/cgi/viewcontent.cgi?filename=0&article=1287&context=edicollect&type=additional",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 23,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988962.66/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 66309683,
    "recordOffset": 66279801,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2959=Gender: In 2009, 11.7 percent of females of all ages and 10.4 percent of males of all ages in NY reported a disability., 2643=Race: In NY in 2009, the prevalence of disability for working-age people (ages 21 to 64) was:, 2808=Hispanic/Latino: In 2009, the prevalence of disability among persons of all ages of Hispanic or Latino origin in NY was 10.7 percent., 3946=Age: In 2009, the prevalence of disability in NY was:, 504=Health Insurance Coverage: In 2009 in NY, 90.0 percent of working-age people with disabilities had health insurance., 4139=These statistics indicate the social and economic status of non-institutionalized people with disabilities in New York, using data from the 2009 American Community Survey (ACS)., 705=Veterans Service-Connected Disability: In 2009, the percentage of working-age civilian veterans with a VA determined Service-Connected Disability was 14.2 percent in NY., 282=This summary lists percentages by state of non-institutionalized working-age (ages 21 to 64) people with disabilities using data from the 2009 American Community Survey (ACS). The US disability prevalence rate for this population was 10.4%, 2076=Looking for Work: In NY in 2009, the percentage actively looking for work among people with disabilities who were not working was 9.1 percent., 2228=Employment: In 2009, the employment rate of working-age people (ages 21 to 64) with disabilities in NY was 33.9 percent., 1257=Supplemental Security Income: In 2009, the percentage of working-age people with disabilities receiving SSI payments in NY was 23.3 percent., 5903=Puerto Rico: A Puerto Rico Disability Status Report, based on the parallel 2009 Puerto Rico Community Survey (PRCS), is available again this year in English as well as Spanish. However, please note that the Puerto Rico sample is not included in any U.S. population estimates included in these reports., 3452=Disability Type: In 2009, the prevalence of the six disability types among persons of all ages in NY was:, 5570=Group Quarters: In 2006, the ACS began surveying the group quarters population. We include the non-institutionalized group quarters population, but due to small state level sample sizes exclude the institutionalized group quarters population (see glossary) in the Disability Status Reports., 1902=Full-Time/Full-Year Employment: In NY in 2009, the percentage of working-age people with disabilities working full-time/full-year was 21.5 percent., 1084=Educational Attainment: In 2009, the percentage of working-age people with disabilities in NY:, 1387=Poverty: In NY in 2009, the poverty rate of working-age people with disabilities was 27.9 percent., 9338=Finally, the 2009 Disability Status Report estimates should not be compared to estimates from any reports based on ACS data collected prior to 2008. In 2008, the US Census Bureau made a number of significant changes to the ACS. These changes included an entirely new set of disability questions as described on the following page. For a summary of all changes to the ACS 2008 survey see the following Census Bureau document:, 8611=Erickson, W. Lee, C., & von Schrader, S. (2011). 2009 Disability Status Report: New York. Ithaca, NY: Cornell University Employment and Disability Institute (EDI)., 9976=The estimates in the 2009 Disability Status Reports are based on American Community Survey (ACS) data — a US Census Bureau survey that has replaced the Decennial Census long form. See the ACS User Guide on www.disabilitystatistics.org for additional information on the ACS., 1552=Annual Household Income: In NY in 2009, the median annual income of households with working-age people with disabilities was $38,800., 1723=Annual Earnings: In 2009, the median annual earnings of working-age people with disabilities working full-time/full-year in NY was $40,000.}",
    "TableContextTimeStampAfterTable": "{100909=This section examines the health insurance coverage of non-institutionalized working-age people (ages 21 to 64) with disabilities in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 67250=This section examines the median annual earnings of non-institutionalized working-age people (ages 21 to 64) with disabilities who work full-time/full-year in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 15303=This section addresses the prevalence of disability among non-institutionalized people of all ages in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 25205=This section focuses on the prevalence of disability among non-institutionalized people ages 16 to 20 in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 19115=This section focuses on the prevalence of disability among non-institutionalized children ages 4 and under in New York, using data from the 2009 American Community Survey (ACS). Only the two sensory disability questions were asked of this population. For definitions of terms, see Glossary., 54703=This section examines the employment rates of non-institutionalized working-age people (ages 21 to 64) with disabilities in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 36793=Prevalence of disability among non-institutionalized people ages 75 and older in New York in 2009, 51480=This section presents the disability prevalence rate among non-institutionalized working-age people (ages 21 to 64) by race category in NY, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 58757=This section focuses on the percentage of non-institutionalized working-age people (ages 21 to 64) with disabilities in New York who are not working but actively looking for work, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 96377=This section presents the percentage of non-institutionalized working-age (ages 21 to 64) civilian veterans reporting a service-connected disability rating in New York. The 2008 American Community Survey (ACS) asks if the veteran has a service-connected disability, and if so, what their rating is (0-100%). A \"service-connected\" disability is one that has been determined by the Department of Veterans Affairs (VA) as being a result of disease or injury incurred or aggravated during military service. Note that a veteran can receive disability compensation for a wide range of conditions, and a veteran with a service-connected disability may not report having one of the six ACS functional or activity limitation disabilities. For definitions of terms, see Glossary., 6185=This summary lists employment rates by state of non-institutionalized working-age (ages 21 to 64) people with disabilities using data from the 2009 American Community Survey (ACS). The employment rate in the US for this population was 36.0% for people with disabilities and 76.8% for people without disabilities., 115575=A person is considered employed full-time/full-year if he or she worked 35 hours or more per week (full-time) and 50 or more weeks per year (full-year). The reference period is defined as the year preceding the date the questionnaire was completed. Note: this does not signify whether a person is eligible for fringe benefits. The question and response categories regarding weeks worked per year was changed in 2008., 75028=This section examines the poverty rates† of non-institutionalized working-age people (ages 21 to 64) with disabilities in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 92255=This section presents the percentage of non-institutionalized working-age people (ages 21 to 64) with disabilities with a Bachelor's degree or more in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 122881=The poverty measure is computed based upon the standards defined in Directive 14 from the Office of Management and Budget. These standards use poverty thresholds created in 1982 and index these thresholds to 2008 dollars using poverty factors based upon the Consumer Price Index. They use the family as the income sharing unit and family income is the sum of total income from each family member living in the household. The poverty threshold depends upon the size of the family; the age of the householder; and the number of related children under the age of 18., 71102=This section illustrates the median annual income† of households that include any working-age people (ages 21 to 64) with disabilities in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 105127=This section examines the type of health insurance coverage for non-institutionalized working-age people (ages 21 to 64) with disabilities in New York, using data from the 2009 American Community Survey (ACS). Note that people can report more than one type of insurance coverage. For definitions of terms, see Glossary., 87848=This section examines the percentage of non-institutionalized working-age people (ages 21 to 64) with disabilities with only some college or an Associate's degree in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 113651=Our definition is based on the responses to the question: \"What is the highest degree or level of school this person has completed? If currently enrolled, mark the previous grade or highest degree received.\" Our category \"high school diploma/equivalent\" includes those marking the ACS option \"Regular high school diploma — GED or alternative credential.\" Our category \"Some college/Associate's degree\" includes those marking the ACS options: some college credit, but less than 1 year of college credit; one or more years of college credit but no degree, or \"Associate's degree (for example: AA, AS).\" Our category \"a Bachelor's or more\" includes those marking the ACS options: \"Bachelor's degree (for example: BA, BS)\"; \"Master's degree (for example: MA, MS, MEng, MEd, MSW, MBA)\"; \"Professional degree (for example: MD, DDS, DVM, LLB, JD)\"; or \"Doctorate degree (for example: PhD, EdD).\" Note in 2008 changes were made to some of the response categories and the layout of this question., 32383=This section explores the prevalence of disability among non-institutionalized people ages 65 to 74 in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 39671=This section examines the prevalence of disability among people by gender and age group in New York, using data from the 2009 American Community Survey (ACS)*. For definitions of terms, see Glossary., 116068=A GQ is a place where people live or stay that is normally owned or managed by an entity or organization providing housing and/or services for the residents. These services may include custodial or medical care as well as other types of assistance, and residency is commonly restricted to those receiving these services. People living in group quarters are usually not related to each other. Group quarters include such places as college residence halls, residential treatment centers, skilled nursing facilities, group homes, military barracks, correctional facilities, and workers' dormitories. See the definitions of institutional GQs and non-institutional GQs for more information. In addition, a description of the types of group quarters included in the 2008 ACS is located on the U.S. Census Bureau's Web site at www.census.gov/acs/www/Downloads/ 2008_ACS_GQ_Definitions.pdf., 79305=This section focuses on the percentage of non-institutionalized working-age people (ages 21 to 64) with disabilities who receive Supplemental Security Income (SSI) payments in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary. Please note that these results will differ from official Social Security Administration reports for several reasons. For additional information, please email DisabilityStatistics@cornell.edu., 45528=This section examines the prevalence of disability among people by Hispanic/Latino origin and age group in New York, using data from the 2009 American Community Survey (ACS)*. For definitions of terms, see Glossary., 63024=This section presents the percentage of non-institutionalized working-age people (ages 21 to 64) with disabilities working full-time/full-year in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 51790=In 2009, among working-age people in NY:, 83467=This section explores the percentage of non-institutionalized working-age people (ages 21 to 64) with disabilities with only a high school diploma or equivalent in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 21717=This section focuses on the prevalence of disability among non-institutionalized children ages 5 to 15 in New York, using data from the 2009 American Community Survey (ACS)*. For definitions of terms, see Glossary., 35948=This section focuses on the prevalence of disability among non-institutionalized people ages 75 and older in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary., 28764=This section focuses on the prevalence of disability among non-institutionalized working-age people (ages 21 to 64) in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary.}",
    "textBeforeTable": "Prevalence of disability among non-institutionalized people of all ages in New York in 2009* In NY in 2009, among the six types of disabilities identified in the ACS, the highest prevalence rate was for \"Ambulatory Disability,\" 6.6 percent. The lowest prevalence rate was for \"Visual Disability,\" 1.9 percent. In other words, in 2009, 2,135,800 of the 19,292,800 individuals of all ages in NY reported one or more disabilities. In 2009, the overall percentage (prevalence rate) of people with a disability of all ages in NY was 11.1 percent. Quick Statistics This section addresses the prevalence of disability among non-institutionalized people of all ages in New York, using data from the 2009 American Community Survey (ACS). For definitions of terms, see Glossary. Introduction 11.1% Prevalence: All Ages All Ages Prevalence Back to top 82.5 50.3 Wyoming 78.5 35.6 Missouri 81.6 40.3 Wisconsin 74.9 28.7 Mississippi 74.2 28.0 West Virginia 82.0 44.3 Minnesota 76.7 39.1 Washington 71.7 30.4 Michigan 80.0 39.6 Virginia 79.8 34.8 Massachusetts 83.6 44.2 Vermont 81.0 44.0 Maryland 77.9 43.3 Utah 81.0 33.8 Maine 77.1 39.8 Texas 76.3 35.0 Louisiana",
    "textAfterTable": "Prevalence: Ages 4 and under 0.9% Introduction This section focuses on the prevalence of disability among non-institutionalized children ages 4 and under in New York, using data from the 2009 American Community Survey (ACS). Only the two sensory disability questions were asked of this population. For definitions of terms, see Glossary. Quick Statistics In 2009, the overall percentage (prevalence rate) of children with a visual and/or hearing disability ages 0 to 4 in NY was 0.9 percent. In other words, in 2009, 10,400 of the 1,217,300 children ages 0 to 4 in NY reported one or more disabilities. In NY in 2009, 0.5 reported a visual disability In NY in 2009, 0.6 reported a hearing disability Prevalence of disability among non-institutionalized people ages 4 and under in New York in 2009 Disability Type Percent MOE Number MOE Base Population Sample Size Any Disability 0.9 3.29 10,400 2,340 1,217,300 10,172 Visual 0.5 3.29 6,400 1,840 1,217,300 10,172 Hearing 0.6 3.29 6,900 1,900 1,217,300 10,172 Back to top Prevalence Ages 5 to 15 years Prevalence: Ages 5 to 15 years 4.7% Introduction This section focuses on the prevalence of disability among non-institutionalized children ages 5 to 15 in New",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}