{
    "relation": [
        [
            "Citing Patent",
            "US6169987 *",
            "US6366919",
            "US6384842 *",
            "US6393425 *",
            "US6473762 *",
            "US6477486 *",
            "US6577325 *",
            "US6597773",
            "US6785540 *",
            "US6796506",
            "US6952705",
            "US7043539 *",
            "US7143100",
            "US7290182 *",
            "US7318015 *",
            "US7350715",
            "US7454549 *",
            "US7519682 *",
            "US7686229",
            "US7806333",
            "US7937515",
            "US8010571",
            "US8044804",
            "US8205027",
            "US8271639 *",
            "US8499067 *",
            "US8798964 *",
            "US20020070971 *",
            "US20040073854 *",
            "US20040088145 *",
            "US20040178269 *",
            "US20040178270 *",
            "US20040267879 *",
            "US20050075937 *",
            "US20050102668 *",
            "US20060178864 *",
            "US20110191454 *",
            "WO2003046771A1 *"
        ],
        [
            "Filing date",
            "Mar 25, 1997",
            "May 30, 2001",
            "May 13, 1999",
            "May 5, 1999",
            "Oct 31, 2000",
            "Sep 10, 1998",
            "Dec 10, 1999",
            "Jan 11, 2001",
            "Nov 30, 1999",
            "Mar 10, 2003",
            "Nov 27, 2001",
            "Mar 29, 2002",
            "Jun 12, 2002",
            "May 8, 2003",
            "Jun 12, 2002",
            "Mar 10, 2003",
            "Nov 13, 2006",
            "Jun 27, 2003",
            "Mar 27, 2006",
            "Oct 18, 2006",
            "Nov 18, 2008",
            "May 27, 2005",
            "Jun 1, 2007",
            "May 2, 2011",
            "Feb 2, 2010",
            "Aug 7, 2012",
            "Nov 6, 2002",
            "Oct 10, 2001",
            "May 8, 2003",
            "Nov 6, 2002",
            "Mar 10, 2003",
            "Mar 10, 2003",
            "Jun 27, 2003",
            "Oct 3, 2003",
            "Sep 20, 2004",
            "Feb 8, 2005",
            "",
            "Nov 26, 2002"
        ],
        [
            "Publication date",
            "Jan 2, 2001",
            "Apr 2, 2002",
            "May 7, 2002",
            "May 21, 2002",
            "Oct 29, 2002",
            "Nov 5, 2002",
            "Jun 10, 2003",
            "Jul 22, 2003",
            "Aug 31, 2004",
            "Sep 28, 2004",
            "Oct 4, 2005",
            "May 9, 2006",
            "Nov 28, 2006",
            "Oct 30, 2007",
            "Jan 8, 2008",
            "Apr 1, 2008",
            "Nov 18, 2008",
            "Apr 14, 2009",
            "Mar 30, 2010",
            "Oct 5, 2010",
            "May 3, 2011",
            "Aug 30, 2011",
            "Oct 25, 2011",
            "Jun 19, 2012",
            "Sep 18, 2012",
            "Jul 30, 2013",
            "Aug 5, 2014",
            "Jun 13, 2002",
            "Apr 15, 2004",
            "May 6, 2004",
            "Sep 16, 2004",
            "Sep 16, 2004",
            "Dec 30, 2004",
            "Apr 7, 2005",
            "May 12, 2005",
            "Aug 10, 2006",
            "Aug 4, 2011",
            "Jun 5, 2003"
        ],
        [
            "Applicant",
            "Mci Communications Corporation",
            "Lexent Inc.",
            "Lsi Logic Corporation",
            "Microsoft Corporation",
            "Mci Communications Corporation",
            "Dell Usa, L.P.",
            "Sony Corporation",
            "Lexent Inc.",
            "Agilent Technologies, Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Mci, Inc.",
            "Terraspring, Inc.",
            "Mci, Llc",
            "Siemens Ag",
            "Verizon Business Global Llc",
            "Hewlett-Packard Development Company, L.P.",
            "Micron Technology, Inc.",
            "Microsoft Corp.",
            "Hewlett-Packard Development Company, L.P.",
            "Hewlett-Packard Development Company, L.P.",
            "Round Rock Research, Llc",
            "Verizon Business Global Llc",
            "Hewlett-Packard Development Company, L. P.",
            "Round Rock Research, Llc",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Hewlett-Packard Development Company, L. P.",
            "Terrence A. Brown",
            "Siemens Ag",
            "Rosenthal Richard Edwin",
            "Pradhan Salil V.",
            "Pradhan Salil V.",
            "Smith Marc A.",
            "Bresniker Kirk Michael",
            "Siemens Aktiengesellschaft",
            "Madhavi Khanijo",
            "International Business Machines Corporation",
            "Worldcom Inc"
        ],
        [
            "Title",
            "System and method to automate equipment placement at remote sites",
            "System for managing telecommunication sites",
            "User interface to provide a physical view of movable physical entities",
            "Diagramming real-world models based on the integration of a database, such as models of a computer network",
            "System and method to automatic equipment placement at remote sites",
            "Automatic location determination of devices under test",
            "Recording medium library apparatus and method for operating the same",
            "System for managing telecommunications infrastructure",
            "Monitoring system and method implementing test configuration logic",
            "Tracking electronic devices",
            "Method, system and program product that utilize a hierarchical conceptual framework to model an environment containing a collection of items",
            "Generating a description of a configuration for a virtual network system",
            "Method, system and program product for viewing and manipulating graphical objects representing hierarchically arranged elements of a modeled environment",
            "Software tool for monitoring faults in an automation device",
            "Method, system and program product for generating scenarios utilizing graphical objects representing hierarchically arranged elements of a modeled environment",
            "Tracking electronic devices",
            "Systems and methods for performing a hot input function",
            "Wireless programmable user interaction system with machine-readable tags for physical objects",
            "RFID reader device having closely packed antennas",
            "Tracking RFID tags with overlapping antennas",
            "Systems and methods for performing a hot input function",
            "Method, system and program product that utilize a hierarchical conceptual framework to model an environment containing a collection of items",
            "Localizing a tag using variable signal range",
            "Systems and methods for performing a hot input function",
            "Discovering physical server location by correlating external and internal server information",
            "Discovering physical server location by correlating external and internal server information",
            "Methods and apparatus for designing the racking and wiring configurations for pieces of hardware",
            "System and methods for tracking central office equipment and inventory records",
            "Software tool for monitoring faults in an automation device",
            "Methods and apparatus for designing the racking and wiring configurations for pieces of hardware",
            "Tracking electronic devices",
            "Tracking electronic devices",
            "Wireless programmable user interaction system with machine-readable tags for physical objects",
            "Rack equipment management information coordination system and method",
            "Method and device for representing the dependencies of components of a technical installation",
            "Automated system and method for configuring a rack assembly",
            "Discovering physical server location by correlating external and internal server information",
            "A hierarchical conceptual framework used to model an environment containing a collection of items"
        ]
    ],
    "pageTitle": "Patent US5991759 - Method and system for defining equipment in a telecommunication network down ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5991759?ie=ISO-8859-1&dq=6,108,703",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990900.28/warc/CC-MAIN-20150728002310-00118-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 466450767,
    "recordOffset": 466410933,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{119923=In this example, pick list tables comprise a list of valid values that are used to fill-in particular data fields. A pick list table, such as the pick list table 1008, is used to assist in the data entry process. Typically, a pick list table is associated with one or more data fields. For example, the pick list table 1008 is associated with a data field \"STATE-CD\" within the table 1004 (as depiced by the dotted line 1005). Preferably, pick list tables are used during data entry to provide users with a drop-down list box, or the like, comprising textual representations of pre-defined values that can be specified for the row or rows, associated with the pick list table., 127037=The configured rack item table 1025 (FIG. 10K) represents individual rack positions that are used to hold shelves, for each rack defined in the configured rack table 1022. In a preferred embodiment, configured shelves that are installed in particular rack positions are defined by the configured shelves table 1026. Accordingly, each entry in the configured shelves table 1026 can correspond with a single entry in the configured rack item table 1025. Note however, that entries within the configured shelves table 1026 can be associated with multiple entries in the configured rack item table 1025. This would be the case for example, if the same configured shelf is used in multiple rack positions in a single rack, or used in multiple racks., 121330=Referring now to FIG. 10D, table 1009 is a pick list table associated with the site table 1004 for providing valid values for the data field used to store site types. Table 1010 represents structures or buildings within sites. Typically, each site (represented by a single entry or row in the site table 1004), comprises multiple buildings that are each represented by a single entry in the building table 1010. Therefore, typically the building table 1010 comprises multiple rows for each row in the site table 1004., 113284=Accordingly, once a user is satisfied with the replacement manufacturer specific rack, the rack is selected in step 1208 and control passes to step 1210. In step 1210 the user specifies particular values for attributes associated with the placement footprints. Specifically, placement data attributes that are stored in the placement library 130 are specified in step 1210. Such attributes include planned and actual dates for installation, activation, decommission and removal of components. Preferably, such dates can be specified for each of the components that comprise the footprint, including the rack, each shelf, and each module that comprises each shelf. In a preferred embodiment, expandable and collapsible cascaded lists are used to assist the user, as described above., 44185=U.S. patent application Ser. No. 08/823,558; Filing Date: Mar. 25, 1997 entitled \"Method for Organizing a Relational Database Used for Storing Data Related to the Configuration and Placement of Equipment in Field Sites\", filed concurrently herewith., 114782=The process begins with step 1302. In step 1302, the user selects the function to update footprint placement information. In step 1304, the user selects a particular footprint. This is typically accomplished by presenting a series of textual pick lists each representing a level of the site hierarchy according to the site hierarchy repository 124. Accordingly, the user selects a particular zone, planning unit, row and footprint. Next in step 1306, user updates values for placement data attributes. Such attributes include planned and actual dates for installation, activation, decommission and removal of components. Preferably, such dates can be specified for each of the components that comprise the footprint, including the rack, each shelf, and each module that comprises each shelf. In a preferred embodiment, expandable and collapsible cascaded lists are used to assist the user, as described above. Next, in step 1308, the footprint data is saved in the placement library 130, and the process ends as indicated by step 1310., 132958=FIG. 10M comprises user security tables 1037-1043, that form the user security 132 portion of the database 108. These tables 1037-1043 are preferably used to control database access and the access to specific functions within SiteVu based on user identification. In the preferred embodiment the tables 1037-1043 describe which functions are allowed to be performed by which users. For example, in one embodiment, only users with a transmission rating are permitted to place transmission equipment in remote sites. Accordingly, such control may be implemented with the use of the user security tables 1037-1043 shown in FIG. 10M. The power tables 138 portion of the database 108, comprises the tables 1044-1052 shown in FIG. 10N are used for power planing as described below., 107372=In step 1108, the user selects a rack from the list presented in step 1104. In a preferred embodiment, details of each eligible replacement rack list item is available to assist the user in selecting a particular replacement rack. For example, the user can view configuration information such as details pertaining to the configured shelves that comprise the configured rack. Further, details pertaining to the modules that are specified for each configured shelf can also be presented. Preferably such information is presented in the form of a expandable and collapsible cascading list. For example, a plus button is displayed next to each rack item in the list. Accordingly, in the event that a user wishes to view detailed information about a particular rack configuration, the plus button is selected., 125134=For example, the shelf table 1020 represents additional information particular to shelf components. In this example, information such as the quantity of wire, coaxial and fiber connectors are stored in the shelf table 1020. The card table 1021 represents additional information particular to cards or module components. In this example, information such as actual and nominal electrical and power input and output requirements are stored in the shelf table 1020., 125616=Likewise, the rack table 1022 represents additional information particular to racks, such as the dimensions of the rack header and rack footer areas. In addition, the HVAC rack table 1023 represents additional information about HVAC (heating, ventilation and air conditioning) racks. In this example, such additional information includes quantities for air flow, BTUs per hour, air flow capacity and coolant specifications., 126513=As shown by the interconnecting lines, both the configured racks and the configured shelves table 1022 and 1026, respectively, are related to the product catalog table 1019. Specifically, as previously stated, configured racks and configured shelves are comprised of components (i.e. modules, shelves and racks), from the product catalog 1019, that have been interrelated. In a preferred embodiment, the interrelationships for configured racks and shelves are defined with the use of a rackface tool 112., 43747=U.S. patent application Ser. No. 08/823,555; Filing Date: Mar. 25, 1997 entitled \"Web Based System and Method to Automate Storage of Power Supply Data and Calculation of Battery Reserves\", filed concurrently herewith., 129201=Preferably, specific data fields within the placement data for racks table 1061 are used for planning purposes. Such data fields are used to define specific time-related events such as planned and actual installation, activation, decommission and removal dates. This allows site planners to view data related to the configuration and placement of equipment in remote sites on a time dependent basis. Moreover, a preferred embodiment of the present invention such information is provided at the rack, shelf and module level., 129744=As described above, the placement data for rack tables 1061 provides such time dependant data for field equipment at the rack level. Similarly, the placement data for shelves table 1063, provides such time dependant data for field equipment at the shelf level. Likewise, the placement data for modules table 1024 provides such time dependant data for field equipment at the module level., 117503=Typically, data fields in a relational database 108, are conceptualized as columns in a database table. Likewise, the data entries that are stored therein are conceptualized as rows in a database table. Thus, the term row is used herein to describe a single data entry within a database table. Accordingly, the term row and the term entry are synonymous. For example, a single row (or entry) in the site database table 1004, represents data describing the details of a single remote site. A complete description of the remote site comprises specific values for each of the data fields associated with the database table 1004. However, it is generally not necessary to provide values for every data field associated with a database table. This choice generally depends on each specific implementation of the present invention, which will typically define data fields as being either required or optional., 43284=U.S. patent application Ser. No. 08/823,557; Filing Date: Mar. 25, 1997 entitled \"System and Method for Recording, Maintaining and Viewing Configuration and Placement of Equipment in Field Sites\", filed concurrently herewith., 106008=A process that can be used to replace generic footprints with manufacturer specific footprints, according to a preferred embodiment of the present invention is depicted in FIG. 11. The process begins with step 1102. In step 1102, a user selects a function to replace a generic footprint. Next, in step 1004, the user selects a particular footprint to replace. This is typically accomplished by presenting a series of textual pick lists each representing a level of the site hierarchy according to the site hierarchy repository 124. Accordingly, the user selects a particular zone, planning unit, row and footprint. Next in step 1106, an eligible replacement rack configuration list is presented to the user., 114085=Note that if global was specified in step 1202, the user has the option to apply the placement specific data to all of the footprints that are being replaced. Next, in step 1212, the footprint data is saved in the placement library 130, and the process ends as indicated by step 1214., 124017=The table 1017 represents rows within planning units. Typically, the row table 1017 comprises multiple entries for each entry in the planning unit table 1015. The table 1018 represents row segments within rows. Typically, the row segment table 1018 comprises multiple entries for each entry in the row table 1017. As will be shown below, configured racks are placed within row segments., 112245=The eligible rack configuration list is preferably a list of configured racks from the configuration library 128 that is filtered based on pre-defined criteria. For example, in a preferred embodiment, only racks that are of the same class and sub-class as the rack being replaced are presented. Further, because of physical space constraints, only racks that are of the same or smaller dimensions as rack being replaced are included in the list. Other criteria that may be appropriate for each specific implementation of the present invention is also used to filter the list presented in step 1206., 122602=The table 1013 represents zones within floors represented by the floor table 1011. Typically, the zone table 1012 comprises multiple entries for each entry in the floor table 1011 . The table 1014 represents zone points for the zones represented by the zone table 1013. This information is used in a system included in the preferred embodiment of the present invention for rendering graphical representations of zones. In one embodiment, each row in the zone point table 1014 contains x-y coordinates for a portion of a polygon that is used to graphically represent the associated zone. Typically, the zone point table 1014 comprises multiple entries for each entry in the zone table 1013., 128448=A particular novel and advantageous feature of a preferred embodiment of the present invention is illustrated by the use of the placement library 130. Specifically, the placement library 130 comprises the placement data for racks table 1061 (FIG. 10G), the placement data for cards table 1024 (FIG. 10H) and the placement data for shelves table 1063 (FIG. 10H)1063. The placement data for racks table 1061 is used to place configured racks from the configured racks table 1062 in particular row segments within the row segment table 1018. In this example, one or more racks can be placed in a particular row segment. This feature is preferably implemented by creating a footprint using a placement tool as previously described above., 123311=Referring now to FIG. 10E, the table 1015 represents planning units within zones represented by the zone table 1013. Typically, the planning unit table 1015 comprises multiple entries for each entry in the zone table 1013. The table 1016 represents points for planning unit table 1015. This information is typically used for rendering graphical representations of planning units. In one embodiment, each row in the planning unit point table 1016 contains x-y coordinates for a portion of a polygon that is used to graphically represent the associated planning unit. Typically, the planning unit point table 1016 comprises multiple entries for each entry in the planning unit table 1015., 126059=The tables in FIGS. 10G, 10H, 10J, and 10K represent portions of the database 108 referred to herein as the configuration library 128, and portions of the database used to store footprint information as described above. Specifically, the portion of the database referred to herein as the configuration library 128 is primarily represented by the configured racks table 1062 (FIG. 10J) and the configured shelves table 1026 (FIG. 10K)., 116839=In this example, the names for each data field are descriptive of the type of data they represent. For example, the first three data fields in the site table 1004 are named \"SITE-- ID\",SITE-- CD and SITE-- TYP-- CD\", respectively. These three data fields hold information related to a site identification number, a site code and a site-type code, for each site stored in the site table 1004. As such, for the most part, by reading the descriptive names of the data fields illustrated in FIGS. 10C-10N, their function and purpose would be apparent to those skilled in the relevant arts., 43539=U.S. patent application Ser. No. 08/823,561; Filing Date: Mar. 25, 1997 entitled \"System and Method to Automate Equipment Placement at Remote Sites\", filed concurrently herewith., 118938=As stated, interconnecting database tables shown in FIGS. 10C-10N represent relationships among the tables in the database 108. For example, a line 1003 is shown connecting the site table 1004 to the plant table 1006. In this example the plant table 1002 represents power plants that are installed in each site. The circle at the end of the line 1003 represents a one to many relationship between the rows in the site table 1004 and the rows in the plant table 1006. Accordingly, each entry in the site table 1004 may be associated with more than one entry in the plant table 1006. In other words, each site may have more than one plant installed therein., 121867=The table 1011 represents floors within structures represented by table 1010. Typically, the floor table 1011 comprises multiple entries for each entry in the structure table 1010. The table 1012 represents floor points for the floors represented by the floor table 1010. This information is used in a system included in the preferred embodiment of the present invention for rendering graphical representations of floors, as described above. In one embodiment, each entry in the floor point table 1012 contains x-y coordinates for a portion of a polygon that is used to graphically represent the associated floor. Typically, the floor point table 1012 comprises multiple rows for each entry in the floor table 1011., 68554=In this example the relational database 108 is coupled with a database server 106. In a system included in the preferred embodiment, the relational database is implemented using an Oracle relational database, supplied by Oracle Corporation. In addition, the database server 106 is a DEC Alpha 2100, manufactured by Digital Equipment Corporation. Further, Microsoft Windows�, manufactured by Microsoft Corporation can be used as the operating system for the computer systems 104 used to execute the SiteVu and the CADD programs. Finally, in a system included in the preferred embodiment, the CADD program used is Microstation CADD, manufactured by Bentley Systems, Inc., 130677=FIG. 10I comprises additional pick list tables from the pick list 134 portion of the database 108. Specifically, the vendor information pick list table 1028 comprises valid values used to describe pre-defined manufactures. In this example, the vender information pick list table 1028 is associated with the product catalog table 1019, the configuration racks table 1022 and the configuration shelves table 1026. Similarly, the class pick list table 1030 is used to store pre-defined values used to describe equipment classes. In this example, the class pick list table 1030 is associated with the zone table 1013, the configuration shelves table 1022 and configuration racks table 1026. Likewise, the sub-class pick list table 1029 comprises pre-defined valid values used to describe equipment sub-classes. In this example, the sub-class pick list table 1029 is associated with the product catalog 1019, the configuration shelves table 1022 and configuration racks table 1026. In addition, in this example, the pick list tables 1028, 1029 and 1030 are associated with the connection tables as described below with reference to FIG. 10L., 111208=The process begins with step 1202. In step 1202, the user selects the function to replace a specific footprint. In addition, the user also specifies either a \"global\" or \"swap\" replacement. If a global replacement is specified, the process replaces all footprints within the database 108, that have the same associated configured rack as the footprint that is being replaced., 108962=Accordingly, once a user is satisfied with the replacement manufacturer specific rack, the rack is selected in step 1108. Control then passes to step 1110. In step 1110 the user specifies particular values for attributes are associated with the placement of footprints. Specifically, placement data attributes that are stored in the placement library 130 are specified in step 1110. Such attributes include planned and actual dates for installation, activation, decommission and removal of the placed components. Preferably, such dates can be specified for each of the components that comprise the footprint, including the rack itself, each shelf, and each module that comprises each shelf. In a preferred embodiment, expandable and collapsible cascaded lists are used to assist the user in completing such attributes, as described above., 131833=FIG. 10L comprises the connection portion 136 of the database 108. Specifically, the connection tables 1031-1035 are used to logically or physically connect one database entity with another database entity, without providing the details of the connection. For example, the connection 136 portion of the database 108 can be used to provide a logical connection between a power plant site hierarchy level and a particular footprint that draws power therefrom. In another example, the connection 136 portion of the database 108 can be used to provide a physical connection between a main power distribution bay and a particular footprint. The connection tables 1031-1035 are used in a system included in the preferred embodiment to define rules for connecting objects within the database 108 to one another. For example, the connection rules table 1032 defines what types of objects can be connected together. Similarly, the connection rules sub-class table 1036 defines what sub-classes of equipment can be connected together. The connection table 1034 is used to define what objects are connected together., 127801=The configured shelves item table 1027 (FIG. 10K) represents individual shelf positions that are used to hold modules for each shelf defined in the configured shelves table 1026. In a preferred embodiment, modules that are installed in particular shelf positions are defined by the product catalog table 1019. Accordingly, each entry in the product catalog table 1019 can correspond with an entry in the configured shelf item table 1027. It should be noted however, that in a preferred embodiment, each entry within the product catalog 1019 is typically associated with multiple entries in the configured shelf item table 1027., 119613=The tables 1006 and 1008 represents pick list tables for specific data fields within the site table 1004. Specifically, the pick list tables 1006 are associated with data fields used to define a responsible department and a geographical state for a particular site listed in the table 1004., 124423=Referring now to FIG. 10F, the tables 1019-1023 is a portion of the database 108 referred to herein as the product catalog 126. Specifically, table 1019 represents components, such as modules, shelves and racks, as previously described. Data fields within the product catalog table 1019, preferably comprises detailed information about each component stored therein, such as a part number, a classification, and physical dimensions of the component. In a system included in the preferred embodiment, information common to all types of components is stored in the product catalog table 1019, and information specific to pre-defined component types are stored in the database tables 1020-1023., 111623=If a swap replacement is specified, the process only replaces a single footprint as described below. After the user specifies either the global or swap option, control passes to step 1204. In step 1204, the user selects a particular footprint to replace. This is typically accomplished by presenting a series of textual pick lists each representing a level of the site hierarchy according to the site hierarchy repository 124. Accordingly, the user selects a particular zone, planning unit, row and footprint. Next in step 1206, an eligible replacement rack configuration list is presented to the user., 116427=Referring now to FIG. 10C, the table 1004 represents remote sites in a portion of the database 108, referred to above as the site hierarchy repository. Each box, such as the box 1004, represents a specific database table. Accordingly, each database table comprises the names of specific data fields that are defined for each table according to a preferred embodiment of the present invention., 110165=Next, in step 112, the footprint data is saved in the placement library 130. The process ends with step 1114., 112863=In step 1208, the user selects a rack from the list presented in step 1204. In a preferred embodiment, details of each eligible replacement rack list item is available so that the user can select a specific replacement rack. For example, the user can view configuration information such as details pertaining to the configured shelves and modules that comprise the configured rack, as described above., 43994=U.S. patent application Ser. No. 08/823,762; Filing Date: Mar. 25, 1997 entitled \"Enhanced System and Method for Report Generation\", filed concurrently herewith., 106735=The eligible replacement rack configuration list is preferably a list of configured racks from the configuration library 128, which is filtered based on pre-defined criteria. For example, in a preferred embodiment, only racks that are of the same class and sub-class as the generic rack being replaced are presented. Further, because of physical space constraints, only racks that are of the same or smaller dimensions as the generic rack are included in the list. Other criteria that may be appropriate for each specific implementation of the present invention is also used to filter the list presented in step 1106.}",
    "textBeforeTable": "Patent Citations While various embodiments of the present invention have been described above, it should be understood that they have been presented by way of example only, and not limitation. Thus, the breadth and scope of the present invention should not be limited by any of the above-described exemplary embodiments, but should be defined only in accordance with the following claims and their equivalents. In yet another embodiment, the invention is implemented using a combination of both hardware and software. In another embodiment, the invention is implemented primarily in hardware using, for example, hardware components such as application specific integrated circuits (ASICs). Implementation of the hardware state machine so as to perform the functions described herein will be apparent to persons skilled in the relevant art(s). In an embodiment where the invention is implemented using software, the software may be stored in a computer program product and loaded into computer system 901 using removable storage drive 912, hard drive 910 or communications interface 924. The control logic (software), when executed by the processor 904, causes the processor 904 to perform the functions of the invention as described herein. Computer programs (also called computer control logic) are stored in main memory and/or secondary memory 908. Computer programs can also be received via communications interface 924. Such computer programs, when executed, enable the computer system 901 to perform the features of the present invention as discussed herein. In particular, the",
    "textAfterTable": "US7937515 Nov 18, 2008 May 3, 2011 Round Rock Research, Llc Systems and methods for performing a hot input function US8010571 May 27, 2005 Aug 30, 2011 Verizon Business Global Llc Method, system and program product that utilize a hierarchical conceptual framework to model an environment containing a collection of items US8044804 Jun 1, 2007 Oct 25, 2011 Hewlett-Packard Development Company, L. P. Localizing a tag using variable signal range US8205027 May 2, 2011 Jun 19, 2012 Round Rock Research, Llc Systems and methods for performing a hot input function US8271639 * Feb 2, 2010 Sep 18, 2012 International Business Machines Corporation Discovering physical server location by correlating external and internal server information US8499067 * Aug 7, 2012 Jul 30, 2013 International Business Machines Corporation Discovering physical server location by correlating external and internal server information US8798964 * Nov 6, 2002 Aug 5, 2014 Hewlett-Packard Development Company, L. P.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}