{
    "relation": [
        [
            "Cited Patent",
            "US1167471 *",
            "US2137727 *",
            "US2139398 *",
            "US2217994 *",
            "US3004836 *",
            "CA544113A *"
        ],
        [
            "Filing date",
            "Aug 17, 1914",
            "Mar 27, 1937",
            "Aug 11, 1936",
            "Nov 18, 1938",
            "Aug 13, 1958",
            ""
        ],
        [
            "Publication date",
            "Jan 11, 1916",
            "Nov 22, 1938",
            "Dec 6, 1938",
            "Oct 15, 1940",
            "Oct 17, 1961",
            "Jul 30, 1957"
        ],
        [
            "Applicant",
            "Midvale Steel Company",
            "Edward F Quirke",
            "Allen Samuel W",
            "Andersonstolz Corp",
            "Nalco Chemical Co",
            "Robert Graham"
        ],
        [
            "Title",
            "Process of modifying the ash resulting from the combustion of powdered fuel.",
            "Materials for treatment of hydrocarbons",
            "Fuel, and compositions of matter for treating solid carbonaceous fuel",
            "Fuel briquette and method of making same",
            "Reduction of slag formation in coalfired furnaces, boilers and the like",
            "Combustion of residual fuels"
        ]
    ],
    "pageTitle": "Patent US3630696 - Combustion adjuvant - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US3630696?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474950607,
    "recordOffset": 474930456,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8964=[54] COMBUSTION ADJUVAN'I 12 Claims, No Drawings [52] U.S. Cl ..44/4, 44/51, 44/76 [51] Int. Cl C1019/00, C101 1/32 [50] Field of Search 44/4-6, 16, 41, 51,68 V, 76, 9149=1 [56] References Cited UNITED STATES PATENTS 1,167,471 1/1916 Barba 44/4 2,139,398 12/1938 Allen 44/6 Primary Examiner-Daniel E. Wyman Assistant ExaminerC. F. Dees Attorney-Fidelman, Wolffe & Leitner ABSTRACT: An adjuvant for hydrocarbon fuels is provided comprising a calcium based montmorillonite clay, a phosphate, and a source of boron oxide. A preferred formulation comprises 85 weight percent calcium bentonite, 10 weight percent anhydrous trisodium phosphate, and 5 weight percent sodium borate. The adjuvant is combined with the hydrocarbon fuel or with combustion air in an amount of about 0.1 to 2.0 weight percent, based on the weight of the hydrocarbon fuel. Combustion efficiency is substantially improved and oxidation is substantially more complete, so that combustion products are produced in less noxious forms. In addition, the nature of slag or other deposits upon surfaces in a furnace or combustion chamber are substantially altered, so that corrosive conditions do not occur and the deposition of slag is prevented or materially reduced, and the ash is produced in a soft, friable form. 1, 8593=United States Patent [72] Inventors Maclin R. Mllner Clearwater; Frederick B. Johnston, Tampa, both of Fla. [21] Appl. No. 869,866 [22] Filed Oct. 27, 1969 [45] Patented Dec. 28, 1971 [73] Assignee Trimex Corporation Clearwater, Fla. Continuation-impart of application Ser. No. 852,867, Aug. 25, 1969. This application Oct. 27, 1969, Ser. No. 869,866, 10285=COMBUSTION ADJUVANT This application is a continuation-in-part of applicant's copending application, Ser. No. 852,867, filed Aug. 25, 1969.}",
    "textBeforeTable": "Patent Citations 12. The method of promoting combustion efficiency of hydrocarbon fuels comprising burning said fuel in a combustion zone in combination with about 0.1 to 10 pounds per day of the adjuvant of claim 5 per 1,000 square feet of exposed surface area of said cgmgust ion zone. 11. The method of promoting combustion efficiency of hydrocarbon fuels comprising burning said fuel in a combustion zone in combination with about 0.1 to 10 pounds per day of the adjuvant of claim 1 per 1,000 square feet of exposed surface area of said combustion zone. 10. The method of promoting combustion efficiency of hydrocarbon fuels comprising burning said fuel in a combustion zone in combination with about 0.1 to 2.0 weight percent of the adjuvant of claim 5, base on the weight of the fuel. 9. The method of promoting combustion efficiency of hydrocarbon fuels comprising burning said fuel in a combustion zone in combination with about 0.1 to 2.0 weight percent of the adjuvant of claim 1, base on the weight of the fuel. 8. The fuel of claim 3, wherein said combustible hydrocarbon is coal. 7. The fuel of claim 3, wherein said combustible hydrocarbon is a liquid petroleum oil. 6. A fuel having improved combustion properties comprising a combustible hydrocarbon and about l weight percent of the adjuvant of claim 2.",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3765848 * Jan 22, 1971 Oct 16, 1973 G Brent Motor fuel composition US4159683 * Mar 13, 1978 Jul 3, 1979 American Colloid Company Method for reducing the formation of slag and soot formed from the combustion of carbonaceous waste material US4481010 * Sep 22, 1983 Nov 6, 1984 Hercules Chemical Company, Inc. Non-corrosive creosote and soot removing composition US4505716 * Feb 15, 1984 Mar 19, 1985 Itt Corporation Combustible coal/water mixture for fuels and methods of preparing same US4602918 * Oct 17, 1984 Jul 29, 1986 The United States Of America As Represented By The United States Department Of Energy Stabilizing coal-water mixtures with portland cement US6615751 Jul 14, 2000 Sep 9, 2003",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}