{
    "relation": [
        [
            "Date",
            "Oct 25, 1999",
            "Sep 27, 2005",
            "Sep 22, 2009",
            "Nov 29, 2013",
            "Apr 23, 2014",
            "Jun 10, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "",
            "",
            "Effective date: 20140423"
        ]
    ],
    "pageTitle": "Patent US6376840 - Selectable lens array - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6376840?dq=ascentive",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986148.56/warc/CC-MAIN-20150728002306-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477362822,
    "recordOffset": 477346864,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention has been described with reference to the preferred embodiments thereof, it will be appreciated that numerous variations, modifications, and alternate embodiments are possible, and accordingly, all such variations, modifications, and alternate embodiments are to be regarded as being within the spirit and scope of the invention. Another manner by which the detection pattern may be changed by selectively actuating or indexing the lenses of the optical component is shown in FIG. 4. In this embodiment, optical component 30 is located in opposing tracks 90 and 92. This arrangement also provides for selective linear indexing by allowing optical component 30 to slide within the tracks until the desired lens, with the proper detection pattern, is properly positioned. Lens array or optical component 30 is rotatable about post 24 by turning component 30. Although component 30 may be actuated about post 24, tabs 50-52 and the respective projections 53-55 are spaced so as to coact with corresponding apertures 80 and 82. The spacing is such that the tabs urge the projections upwardly until there is coaction between two of the three projections with the apertures. The coaction results in and indicates that one of the plurality of lenses is properly aligned with opening 70. This allows the optical component or lens to be selectively actuated or indexed by a user to change the infrared detection pattern of the PIR to the optimal pattern for the",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 * Howard et al. \"Lens adjustment apparatus for use with lens array for fine adjustment of coverage pattern of a passive infrared sensor in detection system\", Pub-No CA 2315846 A1, Feb. 11, 2001, Copyright 2001 Derwent Information LTD. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6943687 Mar 7, 2003 Sep 13, 2005 Eml Technologies Llc PIR motion detector for a decorative lantern US7438438 Jul 3, 2006 Oct 21, 2008 Eml Technologies Llc Decorative lighting fixture with adjustable range motion detector US7488941 Jul 3, 2006 Feb 10, 2009 Eml Technologies Llc Decorative lighting fixture with hidden motion detector US7750804 Feb 27, 2007 Jul 6, 2010 Heathco Llc Multiple sensor lighting system",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}