{
    "relation": [
        [
            "Category",
            "Program Structure",
            "Duration (months)",
            "Avg. Work Experience (years)",
            "Avg. GMAT",
            "Program Cost (in-state)"
        ],
        [
            "Full-Time Program",
            "Cohort: Daytime/Evening",
            "16",
            "5.5",
            "672",
            "$30,000"
        ],
        [
            "Executive Programs",
            "Cohort: Weekend & Hybrid",
            "21",
            "Min: 8-10",
            "n/a",
            "$78,000 – $85,000"
        ],
        [
            "Professional MBA Flex",
            "Self-paced: Evening",
            "Up to 72",
            "6",
            "550-700",
            "$42,000*"
        ],
        [
            "Professional MBA Evening Cohort",
            "Cohort: Evening",
            "24",
            "5",
            "550-700",
            "$39,000"
        ],
        [
            "Professional MBA Online",
            "Self-paced: Online",
            "Up to 72",
            "7",
            "550-700",
            "$46,000*"
        ]
    ],
    "pageTitle": "The UT Dallas MBA Program | Naveen Jindal School of Management",
    "title": "",
    "url": "http://jindal.utdallas.edu/mba-programs/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 128722543,
    "recordOffset": 128706321,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Master of Business Administration Degree Options The UT Dallas MBA Program showQuotation(); function showQuotation(){document.write(Quotation[whichQuotation]);} var whichQuotation=Math.round(Math.random()*(Q-1)); var Q = Quotation.length; Quotation[11] = ' PMBA Class of 2010 \"Certain life situations sometimes prevent us from being able to attend courses in the traditional classroom setting. The online MBA program has given me the opportunity to further advance my education while providing the convenience of not having to leave my home.\"'; Quotation[10] = 'Paul Wang MBA, MS Class of 2012 \"The atmosphere in the PMBA program is one for highly motivated students. Nearly all my classes required group projects; UTD does a great job of getting students to work as teams. The format of the PMBA allows you to build your own dream team of classmates and progress through the program with them.\"'; Quotation[9] = 'James M. Sims PMBA Class of 2005 \"I was working for a national company in its corporate HR offices. The VP of HR at the time told me that if I wanted to have a seat at the executive table, that’s fine, but I better know what to do with it once there. I knew I needed further education to be of any value once I found my seat. The only option that",
    "textAfterTable": "* Two classes per semester Executive Education offers specially tailored programs for executives including the Executive MBA, the Global Leadership Executive MBA, the Executive MBA for Physicians and an Executive MBA with a concentration in Project Management. Connect with the Director MBA Program Contacts Degree Plan Joint MS/MBA Program Transfer Credits How exciting that you are considering earning your MBA. This journey was rewarding in itself and pivotal in my career development. It took me beyond the point of questioning my ability to allowing me to feel accomplished and confident. At UT Dallas, your MBA experience is tailored to your unique interests and career objectives. Networking, career development, alumni and faculty engagement opportunities are strategically integrated throughout our programs. We are confident you will quickly understand why the MBA program from UT Dallas is much more than a degree. I encourage you to take a few minutes, get to know us and find your place within the company of smart people. Lisa Shatz Assistant Dean, MBA Programs lisa.shatz@utdallas.edu (972) 883-5055 Joanna Fowler Associate Director, MBA Programs Email (972)-883-5055",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}