{
    "relation": [
        [
            "Builder",
            "Brooks Locomotive Works",
            "Cooke (Danforth-Cooke) Locomotive & Machine Works",
            "Dickson Manufacturing Company",
            "Manchester (Amoskeag) Locomotive Works",
            "Montreal Locomotive Works",
            "Pittsburgh Locomotive & Car Works",
            "Rhode Island Locomotive Works",
            "Richmond Locomotive Works",
            "Rogers Locomotive Works",
            "Schenectady Locomotive Works"
        ],
        [
            "Location",
            "Dunkirk, NY",
            "Paterson, NJ",
            "Scranton, PA",
            "Manchester, NH",
            "Montreal, QB",
            "Pittsburgh, PA",
            "Providence, RI",
            "Richmond, VA",
            "Paterson, NJ",
            "Schenectady, NY"
        ],
        [
            "Years in Production",
            "1869 -",
            "1852 - 1926",
            "1862 - 1909",
            "1849 - 1913",
            "1900 - today",
            "1867 - 1919",
            "1866 - 1907",
            "1886 - 1927",
            "1837 - 1913",
            "- 1968"
        ],
        [
            "Year of Merger",
            "1901",
            "1901",
            "1901",
            "1901",
            "1902",
            "1901",
            "1901",
            "1901",
            "1905",
            "1901"
        ],
        [
            "Locomotives Built",
            "4200",
            "3000",
            "1400",
            "1800",
            "",
            "2700",
            "3400",
            "4500",
            "6300",
            ""
        ]
    ],
    "pageTitle": "Steam Locomotive Builders",
    "title": "",
    "url": "http://www.steamlocomotive.com/builders/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00284-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 737932911,
    "recordOffset": 737903651,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{369=During World War II, ALCO produced army tanks (7,362 of them), tank destroyers, shells, bombs, gun carriages, gun mounts and 4,488 locomotives. Employment increased three fold to over 15,000 people by 1945., 2369=American Locomotive Company (ALCO) was formed in 1901 when seven smaller locomotive builders merged with the Schenectady Locomotive Works (Schenectady, NY) in order to compete against the largest locomotive builder of the day, the Baldwin Locomotive Works. The seven locomotive builders were:}",
    "TableContextTimeStampAfterTable": "{14323=The Baldwin Locomotive Works was founded in 1831 by Matthias Baldwin. The original plant was on Broad street in Philadelphia, PA where the company did business for 71 years until it moved in 1912 to a new plant in Eddystone. Various partnerships during this period resulted in a number of name changes. It was known as Baldwin, Vail & Hufty (1839-1842); Baldwin & Whitney (1842-1845); M. W. Baldwin (1846-1853); and M. W. Baldwin & Co. (1854-1866). After Baldwin's death in 1866 the firm was known as M. Baird & Co. (1867-1873); Burnham, Parry, Williams & Co. (1873-1890); Burnham, Williams & Co. (1891-1909); it was finally incorporated as the Baldwin Locomotive Works in 1909. Westinghouse Corporation bought Baldwin in 1948. In 1950 the Lima-Hamilton Corporation and Baldwin merged. In 1956 the last of some 70,541 locomotives was produced. An aerial view of the Baldwin plant is shown on the right. Today, F. W. Hake's Trucking Co. occupies this land., 22719=In the late 1960s and 1970s, Baldwin-Lima-Hamilton was making construction cranes (the kind on crawler tracks or rubber tires). Sometime in the 1970s, Clark equipment bought BLH and continued to use the site to make their biggest (220 ton capacity) crawler cranes in Lima. A very large (Billion Electron Volt) X-ray machine was installed in a free-standing building to test the cast base frames for cracks. In 1980 Clark pulled out of Lima. The X-ray facility was sold to a private company that does some hull testing for the tank plant (M1 Abrams was Chrysler, then General Dynamics, not sure who runs the place for the Army now) just a few miles up the road. If you look around when you're driving, you will still see cranes with BLH, LIMA, CLARK or some combination on the counterweight where bridges are being re-built. In fact, there's one on a job site on I-75 just south of OH 725 exit with BLH LIMA on the back., 7215=In 1955 the company became known as ALCO Products, Inc and in 1964 it was bought by the Worthington Corp., 17039=In the late 1940's it was very clear that the steam locomotive days were over and each of the big three steam locomotive builders were far behind EMD with diesel designs and customers. Lima merged with engine builder Hamilton in an effort to get a foot hold in the diesel market but made little progress. In desperation Lima-Hamilton merged with Baldwin in 1950 to become the Baldwin-Lima-Hamilton Corporation. However, by 1956 BLH ceased production of common carrier size locomotives., 7378=Over all of its time (prior to merger and after), ALCO produced about 75,000 locomotives with more than 63% of them built in Schenectady, NY. In fact, all of the locomotive manufacturing (except in Canada) was consolidated in Schenectady by 1931 and continued until 1968., 21797=The Lima Machine Works was established in 1869 and produced agricultural and sawmill equipment. In the 1870s a Michigan logger, Ephraim Shay, developed a geared locomotive for use on wood-railed logging tramways. In 1878 Lima Machine Works built a locomotive to Shay's design. In 1891 the company reorganized and became the Lima Locomotive & Machine Company. The company began building locomotives for Class 1 railroads in 1911: 23 0-6-0 switchers for the Southern and Mobile & Ohio. In 1912 the company again reorganized into the Lima Locomotive Corporation. In 1916 it was bought by Joel Coffin and became the Lima Locomotive Works. In 1947 Lima Locomotive Works merged with General Machinery Corporation of Hamilton, OH to form Lima-Hamilton Corporation. In 1951 it was merged with Baldwin Locomotive Works to form the Baldwin-Lima-Hamilton Corporation., 18038=Most of the records of Baldwin were destroyed in 1954. What survived has found its way to the DeGolyer Library (Baldwin Records) at the Southern Methodist University in Dallas, TX. [Details] A few drawings are located at the Pennsylvania State Archives in Harrisburg, PA. The Builders Photos are located at the Railroad Museum of Pennsylvania in Strasburg, PA., 9808=Most of the general files, technical manuals and ALCO designs are located in the Special Collections Research Center at Syracuse University. The Builder's Photos and many of the Erecting Cards (photographs of the drawings) and Painting Diagrams are in the possession of the Mohawk & Hudson Chapter of the NRHS. This group of volunteers is known as the \"ALCO Historic Photos Project\" and is preserving over 32,000 ALCO negatives., 25199=Lima Locomotive Works is most famous for developing the Super Power 2-8-4 design. Around 1920, the railroads and locomotive builders were trying various techniques to increase the speed of freight trains. Some approaches used high-pressure boilers, three-cylinders, water-tube fireboxes, or all three (Baldwin 60,000). William Woodard of Lima Locomotive Works experimented in increasing the grate area to greatly increase the steaming ability of the locomotive. A locomotive with a 100 sq. ft. grate area (very large for a locomotive of that day) was constructed. The firebox was so large that it required a four-wheel trailing truck to support it. The 2-8-4 wheel arrangement was born. This demonstrator locomotive also had a booster on the rear axle of the trailing truck. It was designated number \"1\", class A-1 and was so successful from the start that a number of railroad lines soon placed orders for more of this type. Lima Locomotive Work became famous for developing this design., 26255=The old Lima Shay shop and the heavy erection sheds were demolished during the spring of 1998. They had been left to rot for 20 years before they were taken down. Today the Lima Locomotive Works location is just a pile of rubble. [Google View] The Lima Locomotive Works records including builder's drawings are stored at two places. Most of them are stored on the Second Floor of the Big Four Building at the California State Railroad Museum Library in Sacramento, CA.}",
    "textBeforeTable": "During World War II, ALCO produced army tanks (7,362 of them), tank destroyers, shells, bombs, gun carriages, gun mounts and 4,488 locomotives. Employment increased three fold to over 15,000 people by 1945. In 1906 ALCO entered into the automobile business and exited after only seven years because it proved to be unprofitable. Richmond Locomotive Works Rhode Island Locomotive Works Pittsburgh Locomotive & Car Works Manchester Locomotive Works Dickson Manufacturing Company Cooke Locomotive & Machine Works Brooks Locomotive Works American Locomotive Company (ALCO) was formed in 1901 when seven smaller locomotive builders merged with the Schenectady Locomotive Works (Schenectady, NY) in order to compete against the largest locomotive builder of the day, the Baldwin Locomotive Works. The seven locomotive builders were:",
    "textAfterTable": "NOTE: Some sources state that Richmond only built 1000 locomotives starting at CN 1600 and then included gaps in their numbering scheme. In 1955 the company became known as ALCO Products, Inc and in 1964 it was bought by the Worthington Corp. Over all of its time (prior to merger and after), ALCO produced about 75,000 locomotives with more than 63% of them built in Schenectady, NY. In fact, all of the locomotive manufacturing (except in Canada) was consolidated in Schenectady by 1931 and continued until 1968. ALCO has had a lot of firsts throughout its history including: The first steam locomotive produced by Rogers Locomotive Works was the wood burning \"Sandusky\" built by Rogers in 1837 First commercially successful diesel electric locomotive (Central Railroad of New Jersey) First diesel-electric passenger locomotive in the USA (NYC) First streamlined locomotive produced in America (CM&StP - \"Hiawatha\") ALCO acquired exclusive rights to Sir Nigel Gresley's \"conjugated lever\" invention which was used on 3-cylinder steam locomotives. ALCO became much more successful at building",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}