{
    "relation": [
        [
            "Company",
            "B2Gold Corp (BTO-T)",
            "Nevsun Resources Ltd (NSU-T)",
            "Avalon Rare Metals Inc (AVL-T)",
            "Sabina Gold & Silver Corp (SBB-T)",
            "Quest Rare Minerals Ltd (QRM-V)",
            "Volta Resources Inc (VTR-T)",
            "Wesdome Gold Mines Ltd (WDO-T)",
            "Strategic Metals Ltd (SMD-V)",
            "Torex Gold Resources Inc (TXG-T)",
            "Orko Silver Corp (OK-V)"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Value",
            "$71,666,497",
            "$13,398,672",
            "$13,365,081",
            "$6,565,161",
            "$6,294,339",
            "$5,431,480",
            "$3,737,433",
            "$3,237,483",
            "$3,096,908",
            "$2,996,137"
        ],
        [
            "High",
            "$3.540",
            "$6.250",
            "$6.840",
            "$6.240",
            "$6.790",
            "$1.970",
            "$2.610",
            "$3.620",
            "$1.920",
            "$3.000"
        ],
        [
            "Low",
            "$3.230",
            "$5.690",
            "$6.100",
            "$5.840",
            "$5.700",
            "$1.570",
            "$2.300",
            "$3.080",
            "$1.690",
            "$2.730"
        ],
        [
            "Close",
            "$3.310",
            "$6.130",
            "$6.350",
            "$6.030",
            "$5.850",
            "$1.800",
            "$2.550",
            "$3.600",
            "$1.840",
            "$2.990"
        ],
        [
            "Chg",
            "$0.050",
            "$0.290",
            "($0.350)",
            "$0.130",
            "($0.810)",
            "$0.170",
            "$0.150",
            "$0.450",
            "$0.100",
            "$0.200"
        ],
        [
            "Status",
            "BF TP Buy $0.30-$0.49",
            "BF Spec Cycle Hold 100%",
            "Good Absolute Spec Value Buy",
            "BF TP Buy $0.30-$0.49",
            "Good Relative Spec Value Buy",
            "BF MP Buy $0.10-$0.19",
            "Good Relative Spec Value Buy",
            "BF MP Buy $0.10-$0.19",
            "BF Spec Cycle Hold 100%",
            "BF TP Buy $0.30-$0.49"
        ]
    ],
    "pageTitle": "Kaiser Research Online - Bottom-Fish Action - Kaiser Research Summary for July 3-9, 2011 - Fri Jul 31, 2015",
    "title": "Top 10 Bottom-Fish Value Traders",
    "url": "http://www.kaiserbottomfish.com/s/Bottom-FishAction.asp?ReportID=466841&_Title=Kaiser-Research-Summary-for-July-3-9-2011",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 18,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 539882459,
    "recordOffset": 539795978,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{404723=But rather than blame the shorts for propagating this seabed fantasy, perhaps we should turn our suspicions to Chinese authorities who are now mulling a WTO Ruling that China's export restrictions on certain raw materials such as rare earths in the name of \"preventing pollution\" violate global trade rules by giving Chinese manufacturers an unfair edge (see Chinese Curbs on Raw-Material Exports Break Rules by Bloomberg). The WTO ruling mentions rare earths only once in a footnote; it deals with export duties and quotas involving zinc, manganese, bauxite, fluorspar, coking coal, silicon metal and carbide, and magnesium, some of which it has been in the past accused of dumping onto the market. China does not have overwhelming supply monopolies in most of these cases, and it is difficult for the average person to see this as little more than nitpicking by a few self-serving lobbyists. However, the ruling has been given press coverage because structurally it maps to rare earth duties and quotas where thanks to China's virtual supply monopoly it is easy to understand how the WTO complaints might be valid. The Chinese are unlikely to be impressed and will probably bog this down in legal appeals that will eventually be moot when non-Chinese rare earth supply comes on stream. I tend to sympathize with the Chinese on this issue because I am not a big fan of cost dumpers who shroud themselves in the cloak of free market rhetoric. The WTO is asking China to share the pain arising from the curtailment of dirty mining and processing operations whose pain Chinese workers and their environment have suffered for decades while the rest of the world reaped the benefits of cheap raw materials. With regard to the seabed rare earth story, perhaps Chinese hackers manipulated media organizations into giving this technical article far more airplay than it deserved in an effort to undermine the WTO ruling by creating the spin that the Pacific Ocean is full of rare earths that are so much more readily extractable than all those land based deposits, and that China's efforts to shield its manufacturers is just for a wee little time before the world is inundated by seabed supply from international waters. Kidding aside, the rapid ascent of rare earth oxide prices is starting to worry China; deputy secretary Zhang Anwen of the Chinese Society of Rare Earths expressed concern that hoarding is exaggerating the effect of China's industry consolidation, and that downstream consumers in China, such as half the NdFeB producers in Ningbo of Zhejuang province, are being forced to suspend operations (Metal-Pages - July 5, 2011). China itself is developing a supply problem. The media detour into Jules Verne fiction is probably the last gasp of the shorts before end-users get serious about securing practical solutions., 421346=Avalon states that it has discounted the $46.33/kg value of its \"mixed oxide\" basket by 38% from what the basket price would be for separated oxides. That implies a price of $74.73/kg, which is 41% of what Avalon's basket would be worth at today's domestic oxide prices ($184/kg) and 14% of the current FOB basket price of $322/kg which is fairly conservative, though the 3 year averages for domestic and FOB are $26.51/kg and $50.91/kg respectively. If we treat the discount as the cost of separating the mixed oxides, the separation cost works out to $28.40/kg or $28,400 per tonne REO, which seems rather high. If I apply the 2015 price forecast (at the behest of RPA Avalon used the price forecasts made by CIBC World Markets in its Rare Earth Industry Overview dated March 6, 2011 except for holmium, erbium, and lutetium for which it used the initial PFS assumptions) to the distribution of Avalon's probable reserve, which has 26% heavy rare earths rather than the 21% in the indicated resource, the separated oxide basket price works out to $67.86/kg, which implies a separation cost of $21.53/kg which seems a little more reasonable., 375975=Much of the improvement in household net worth has been achieved through stock market gains. The value of equities directly owned by US households have gained 75% from $5 trillion in Q1 of 2009 to nearly $9 trillion at the end of Q1 of 2011. But equities are a fragile confidence game which any manner of catastrophes can disrupt, be it at a macroeconomic level or at the company specific level. Furthermore, the value of stocks can change simply because the price changes, with only limited inflow of capital. The stock market rebound could vanish in a heartbeat, especially if high frequency traders unleash their algorithms when there is an unprecedented development, such as the sudden inability of the government of the world's biggest economy to pay its bills. Who owns those $9 trillion in equities? I doubt much of it is held by the 80% of US households who have less than $150,000 in annual income., 375635=With the exception of Q2 2010 when the European PIIGS were quaking and shaking, household net worth has improved every quarter since Q2 of 2009, though we may be in for a negative surprise when we see the Q2 2011 numbers., 379635=Two rounds of quantitative easing have done wonders for the value of pension fund holdings, which is almost back to the $13.6 trillion level that prevailed in Q4 of 2007 after plunging below $10 trillion in Q1 of 2009 when Obama had to kiss rather than kick Wall Street ass to keep the entire financial system from collapsing. The value of retirement account and pension plan holdings will suffer from a market decline. Who controls the bulk of this retirement capital? One suspects it is the top 8% households whom the Tea Party is working overtime to shield from higher taxes and social security deductions that might keep the Medicare and Social Security needs of the remaining 80% of households funded., 382607=Can I be blamed for suspecting the Tea Party to be a trojan horse whose goal is quite the opposite of making sure that I stay in the top 8% of households? Come on you Republican politicians, wake up and stop trying to undermine the wealth of the minority who still have a positive net worth. Don't get sucked into the apocalyptic mindset of those who already have nothing and want to make sure the rest of us end up in the same boat. I'd rather pay some extra tax than have to waste my assets fending off a bunch of pissed off Greeks who have spent far too much time in a dank wooden horse., 371019=Kaiser Research Summary for Week of July 3-9, 2011, 392623=First Point Minerals Corp announced on July 4, 2011 that Cliffs Natural Resources Inc has reported to it that the metallurgical testwork conducted on a 1,011 kg composite sample from the Decar nickel project in central British Columbia resulted in a concentrate consisting of 52% iron, 2.6% nickel and 2.2% chromite. The remainder is magnesium silicate with no elements deleterious to the production of stainless steel. This was accomplished through a two stage grinding and magnetic separation process. The first stage involved grinding to P80 600 microns followed by magnetic separation, with the magnetic fraction subjected to another grind to P80 25 microns followed by magnetic separation again. Testing indicates that concentrate grades as high as 4% nickel are achievable through further gravity processing with only minor nickel loss. Optimization test work continues, and it appears that enough concentrate was generated to enable Cliffs to send samples to steel mills for evaluation. The nickel recovery was 80% of the nickel-iron alloy (awaruite) grade og 0.14%, which in turn was 64% of the total nickel grade of 0.22%. Nickel occurs in the Decar mineralization only as awaruite, which is the extraction target of Cliffs' flowsheet, and within the silicate lattice of other minerals from which the nickel is not commercially recoverable. No sulphides of any form are present, including the nickel sulphide pentlandite; other juniors attempting to jump onto First Point's nickel-iron alloy bandwagon have not yet demonstrated the absence of sulphides from their prospects nor clearly established what percentage of the total nickel content is attributable to awaruite. The work was done at SGS Lakefield and at Cliffs' Michigan metallurgical facility under the direction of Cliffs mineral processing engineer Kevin Bacon and under the the supervision of Dr Gordon Bacon, an independent metallurgical consultant. Although no cost figures have been reported, Peter Bradshaw's willingness to declare that \"this nickel-iron concentrate is very likely to be an attractive alternative to lateritic nickel ores for the production of nickel pig iron, as it is more consistent in grade and much lower in water content\", suggests that internally they see a cost structure below the $9-$10/lb price threshold required by China for imported Philippine and Indonesia laterite ore. Decar appears to have received a greenlight from Cliffs which is now conducting a 4,000 m drill program that should wrap in early August, leaving plenty of time for Cliffs to mount an expanded infill drilling program that can carry on until October. This next milestone is needed to set the stock on fire, but we will likely have to wait a month to find out if Cliffs is willing to expand the 2011 program. More importantly, First Point's efforts to track down and secure similar well located projects elsewhere in the world receive a boost from today's announcement, and the positive words by Clifford Smith during the recent Cliffs Analyst and Investor Day will put this story on an expanded market radar. The suggestion that Decar style nickel concentrates could be a cheaper inout than laterite ores for the production of nickel pig iron will be of interest to the Chinese. Spec Value hunters should now be fully on board, and bottom-fishers should be holding 100% of their positions as First Point bucks the summer doldrums or whatever headwinds Washington's ideological theatrics might stir up., 377657=The households earning less than $150,000 likely own much of the $8 trillion parked in deposits that earn less than 2%. Wealthier households don't like to keep more than $250,000 in a bank because that is the maximum the FDIC will pay out if the bank collapses. Wealthy households are also more likely to understand that America's financial institutions are still capitalized with lots of stinky paper, which is why they own bonds, treasuries, stocks, and mutual funds to which they have segregated title if not held in a margin account or a cash account with a debt balance. Deposits peaked in Q1 of 2009 during the height of financial anxiety, but the withdrawal trend stopped at $7.8 trillion in Q2 of 2010. Since then total deposits have risen each quarter and now stand almost at the Q1 2009 crisis level. This is real money and it is not going to evaporate if a technical default causes a market meltdown which will disproportionately harm higher net worth households. This is money not being spent, and thus creating demand, because the owners dread a dysfunctional future, which, ironically, is why China has a huge savings rate. The embedded expectation is not that China will become like America, but rather that America will become like China, with the difference that instead of a Communist elite, America will be run by a \"meritocratic\" elite whose power dynamics will resemble those of pre-capitalist feudalism. The minions who support the Tea Party are not that keen on serfdom, which is why behind the \"don't tread on me\" tee-shirts lurks a theocratic manuscript which would subordinate secular power of the \"might is right\" form to a divine power managed, as always, by a priesthood endowed with special wisdom. It is not clear that the top 8% income earning households will be able to control this priesthood., 410572=Lynas Corp has attracted a new shareholder whose identity may not help it quell protests about its LAMP facility. On July 4 Mitsubishi UFJ Financial Group Inc filed a notice that on June 30 it became a \"substantial shareholder\", even though Lynas was halted that day to allow a response to the IAEA report on the rare earth processing facility in Kuantan, Malaysia. This report was requested by the Malaysian government in response to growing criticism about risks associated with the LAMP facility, criticisms that appear to be fueled by bad memories about the toxic waste left behind by Mitsubishi Chemical in 1992 when it processed tin mining slags for rare earths. It thus seems quite spooky that Mitsubishi should crop up as a 9.99% \"shareholder\" just as Lynas is welcoming the IAEA's recommendations and dismissing NYT reporter Keith Bradsher's article about construction problems as much ado about nothing. But these are perceptions for conspiracy theorists. Mitsubishi Financial and Mitsubishi Chemical are separate divisions of the Mitsubishi conglomerate. Furthermore, it appears that the only reason Mitsubishi had to file an initial substantial shareholder report is that it has more than 20% voting power over Morgan Stanley which owns 165,368,239 shares. The timing smells of compliance officers plodding through data and mechanically filing paperwork without any thought to political context. It is not even clear if Morgan Stanley owns these shares on a proprietary basis or through funds that it manages on behalf of clients. Morgan Stanley and rival JP Morgan have been the principal backers of Lynas since 2009, and their goal would ultimately be to unload their Lynas paper by tendering it to a direct takeover bid, not be the proxy for indirect control by a Japanese conglomerate. Mitsubishi Financial owns only 4,753,828 shares directly, though it did appear to buy 3,942,336 shares during the last week of May within a price range of AUD $2.22-$2.31, managing to get close to the market top. Lynas traded 135.7 million shares on May 31 amid news that Sojitz and JOGMEC had come through with a $250 million loan. But the Mitsubishi name does keep cropping up in a rare earth context. On July 21, 2009 Mitsubishi Corp, the general trading company of the conglomerate, entered a deal with Neo Material Technologies Inc to fund test work on recovering rare earths from the tailings at the Pitinga Mine in Brazil in exchange for 20% offtake rights. Neo Material is now overdue on reporting the outcome of its studies, so it does seem curious that another Mitsubishi entity materializes as a stakeholder in a rare earth junior that does appear to have near term supply queued up. But it does simply look a lot like bad timing and coincidence, bad timing in the sense that protestors are trying to link Lynas to past Mitsubishi sins, and news that Mitsubishi's tentacles appear to have ensnared Lynas is not going to calm the opposition. This development should also not be construed as bullish in the sense that an \"end-user\" has stepped into the open market to establish an equity beachhead for what might eventually be a takeover bid. Yes, we desperately need this to happen to put some fear into the shorts, but this I do not believe achieves this goal., 380465=And finally, take a look at the above horrid chart depicting the $7.4 trillion in homeowner net equity that has evaporated since the $13.5 trillion peak in Q1 of 2006. Home equity has been the primary retirement savings vehicle for Americans thanks to the relentless increase in home prices. Unfortunately Wall Street could not resist goosing the process between 2005 and 2007 as it peddled securitized sub-prime mortgages fraudulently stamped as low risk investments they stuffed into every possible account. Real estate net equity recovered modestly from Q2 of 2009 to Q2 of 2010, but since then it has been downhill as the foreclosure machine churned onwards and banks, still sitting on illiquid securitized mortgage paper not yet marked to reality, extended credit only to borrowers who did not need it. As of Q1 of 2011 household real estate net equity was down 55% from the peak and at $6.1 trillion is even lower than the bottom achieved in Q1 of 2009., 375314=When you look at the household net worth charts above and below it appears that the wealth destruction that took place during 2007-2009 has almost been reversed and is trending in the right direction., 392495=Spec Value Hunter Comment - July 4, 2011: Cliffs delivers positive metallurgical results for Decar to First Point, 427254=I believe the market is wrong on all these scenarios, and because Avalon is the most advanced rare earth junior outside of Molycorp and Lynas with large scale supply potential that includes a meaningful amount of heavy rare earths, I do believe Avalon will attract the capital needed to develop Nechalacho. A retreat in domestic and FOB prices to levels reflecting an $85-$90/kg basket price range is plausible, given that the heavy rare earths are 26% of the projected output. At those prices Nechalacho would have an after-tax NPV of about $2 billion, representing a price target just under $20 for Avalon. On April 6, 2011, when the stock was trading at $8.34, I converted my open Good Absolute Spec Value Buy to a Fair Relative Spec Value Hold which reflected my uncertainty over how to value Nechalacho. I suggested that Avalon would largely trade in sympathy with the overall rare earth sector trend, which has been downwards until the past couple weeks. The updated PFS is helpful in providing a better basis to evaluate the Nechalacho project, and I am considerably more comfortable in setting a $15-$20 price target by the end of 2012 on the assumption that the bankable feasibility study will confirm the PFS assumptions. Effective July 8, 2011 I am converting Avalon back to a Good Absolute Spec Value Buy at $6.30 with the expectation that Avalon will outperform the overall rare earth sector during the next 12 months as end-users act to secure their long term rare earth supply., 389215=Bottom-Fish Action Report for July 3, 2011 to July 9, 2011, 372572=As the manufacturing jobs chart above shows, the US manufacturing sector has been in decline since the Reagan-Thatcher revolution of 1980 kicked off a 30 year trend of deindustrialization as capital shifted productive capacity into lower cost jurisdictions, a trend that accelerated during the last decade as China blossomed through its tantalizing offer of cheap and abundant labor, minimal health and safety standards, absent or unenforced emission standards, no medical benefits, and the lack of a social welfare net. China was willing to be the world's cost dumping ground as it struggled during the past couple decades to emerge from Mao Zedong's communist legacy, but it has been so successful it is now the world's second largest economy and its citizens are pressuring for change., 399120=Index Member Comment - July 5, 2011: Seabed rare earth mining fantasy gets remarkable press coverage, 414078=Much more significant is the July 7 announcement that the German giant Siemens has signed a letter of intent with Lynas to form a 55:45 joint venture to create the \"mine to magnet\" segment of Siemens' supply chain for the production of energy-efficient drive applications and wind-turbine generators. The terms of the deal were not disclosed, though it appears that Lynas' contribution will be the supply of neodymium-praseodymium metal for magnet production. Japanese end-users have already tentatively reached out to Lynas and Molycorp for \"security of supply\" relationships; now the Europeans are starting to bite the bullet and seek out relationships with rare earth supply contenders. The Siemens deal is interesting because the magnet production is a joint venture, not just an offtake rights for financing deal. I interpret Siemen's attention as a bullish sign that the end-users are not going to spend the supply crisis sitting on a pot hoping that speculative capital will deliver the goods while they shit on the prospect of this happening by \"threatening\" substitution, recycling and seabed mining as alternatives to putting non-Chinese rare earth mines into production. And it is high time that they proceed beyond denial and anger to adapting to the new reality. China is currently digesting the WTO ruling handed down on July 5, and an early indication of what China thinks about it showed up on July 7 when Metal-Pages posted new rare earth oxide prices. Nothing interesting on the domestic price side, but in the case of the heavies dysprosium, terbium and europium, whose FOB prices had ended up lower than domestic prices in recent weeks, these underwent huge jumps. FOB lanthanum, cerium and yttrium prices also increased after being stagnant for more than a month while domestic prices crept higher. Take a peek at our Rare Earth Resource Center to see what a Chinese \"FU2\" response might start to look like., 401806=The authors indicate that the seabed mud appears to have recovery characteristics similar to the ionic clay deposits that lend themselves to simple acid leaching, and they seem eager to promote the idea that deep sea rare earth muds could solve the world's supply problem. They give 2 examples of how much one sq km of seabed mud could yield. At Site 76 in the eastern South Pacific where the grade is 0.118% TREE and the dry bulk specific gravity of the mud is 0.66, a 10 m thick bed would contain 9,110 tonnes of TREO (note the math using TREE is 7,788 tonnes - we do not know the individual REE distribution needed to generate the Japanese TREO number). At Site 1222 in the central North Pacific where the grade is 0.064% TREE, the density 0.477, and the mud bed 70 metres thick, the contained TREO is 25,000 tonnes TREO (21,370 t TREE). They go on to suggest that based on the distribution of rare earth enriched muds the seabed resource could exceed the 110 million tonnes of TREO estimated as the land based resource, which the media seized upon during the American July 4 holiday as if this were a miraculous solution to the rare earth supply problem. In response Gareth Hatch of Technology Metals Research wondered in a critique: Is Someone Manipulating the Story about Rare Earths under the Ocean? The media has since toned down its sensationalistic message that the world's rare earth supply problem has been solved and by innuendo that the prices of rare earth companies are due for a collapse. I first read about the Nature article on the industry web site Metal-Pages and did not give it much further thought because it appeared obvious that it was only of academic interest to geoscientists. But after receiving a surprising number of somewhat worried email inquiries from KRO members it dawned on me that the mainstream media was giving the story a spin that the seabed muds had positive economic implications. How stupid are news editors, or were they caught off guard on a sleepy holiday weekend by the voices of rare earth bears whispering that this was blockbuster news? As far as the desire of the Japanese scientists to spin their \"discovery\" as a solution to Japan's rare earth supply problem, this fits in with the denial stage of the grief cycle (the article was submitted for publication in January 2011) where the Japanese seem determined to first investigate all the non-solutions such as recycling, substitution and exotic extraction scenarios before biting the bullet and bankrolling a few big deposits such as Strange Lake and Nechalacho so that the problem is nothing but a historical footnote five years from now. I guess we have to exhaust all possibilities first, with only moon mining left to be checked out., 422618=In order to see the after-tax net present value sensitivity of Avalon's mining plan for the Nechalacho Basal Zone I have adapted Avalon's discounted cash flow model to include the separation stage. On October 21, 2010 Avalon announced that an SNC-Lavalin scoping study pegged the capital cost for a 25,000 tpa separation facility at $346 million with a 35% error margin. Assuming Avalon's projected recoveries hold up, the proposed underground mine will average 8,243 tonnes of REO annually over the 20 year mine life implied by the probable mineral reserve of 14,539,167 tonnes of 1.53% TREO. Avalon thus does not need such a large facility, though it is conceivable that it might seek to ramp up production down the road. (The indicated resource for the Basal Zone stands at 57,486,089 tonnes of 1.56% TREO of which 21% are the heavy rare earths; the heavy percentage jumps to 26% in the probable reserve which reflects mining plan optimization to tap the HREO enrichment at the base of the Basal Zone.) So I have assumed a separation facility with capacity in the 10,000-15,000 tpa range with a capital cost of $200 million. Avalon did not disclose the operating cost, presumably to keep the competition from applying similar numbers to their DCF models, but the latest news release allows us to reverse calculate the separation cost. For my DCF model I have assumed a separation cost of $20/kg of REO or $20,000 per tonne. This is less than $21.53-$28.40 per kg implied by Avalon's discounting, but Avalon's discounting likely includes amortization of the facility's capital cost, which I am including in my model as a capital cost. I have not used Avalon's optimized production schedule whereby it mines higher grade material during the first couple years and have instead \"mined\" the same amount each year with full production achieved in the first year. I have applied an effective 26.5% tax rate and assumed no taxes until payback, US/CAD currency parity, a $269/t operating cost plus a $20/kg separation cost which works out to $231 per tonne of ore mined, and a $1,102,000,000 capital cost that includes $200 million for a separation facility. Fully diluted is 103,550,965 shares. My model, which includes ytterbium and thulium output, produces 8,415 tonnes of REO annually. I have used the new probable reserve grades for zirconium, niobium and tantalum as well as Avalon''s 2015 forecast prices while keeping the original recovery rates. The chart above depicts the rare earth production profile for Nechalacho while the chart below shows how the after-tax NPV per fully diluted share varies at different basket prices using a 10% discount rate. (Note that a higher basket price is not the same as a higher price for a metal such as gold or copper; the basket price is controlled by each project's recoverable REO distribution as well as the prices for each REO.), 371466=Both the general and resource sector markets enjoyed a rebound last week until the Department of Labor shocked everybody with a dismal non-farm payroll report that only 18,000 net jobs were added during June while the unemployment rate inched up from 9.1% to 9.2%. Manufacturing, which has been the bright spot since the start of 2010, added only 6,000 jobs after losing 2,000 jobs in May. For now the blame is placed on supply chain disruptions created by the Fukushima tsunami that forced American production runs to be suspended or slowed down because a critical component had been outsourced to a factory in Japan. This interpretation predicts a rebound during Q4 of 2011 as the Japanese production machine gets back into gear, though this assumes that Japan will solve a looming electricity crisis. Fortunately ongoing bad news about supply chains will reinforce the reversal in US manufacturing that is underway and whose continuation is critical to the revival of the US economy., 399235=Molycorp Inc and other rare earth companies suffered on July 5, 2011 after Nature Geoscience published an article on July 3 entitled \"Deep-sea mud in the Pacific Ocean as a potential resource for rare-earth elements\" which received an astonishing amount of global press coverage. A group of Japanese scientists spent considerable effort documenting the rare earth content of seabed mud at 78 sites in the Pacific Ocean at depths of 3,500 to 6,000 metres. Although rare earths are ubiquitous within seabed mud - remember the common refrain that \"rare earths are not rare at all\" - two regions, the central North Pacific surrounding the Hawaiian Islands, and the eastern South Pacific, have elevated TREE grades approaching those of southern China's ion adsorption clay deposits which are 0.2% or less. The Hawaiian muds had grades of 0.04%-0.1% while the southern Pacific muds were richer at 0.1%-0.22%. The article points out that the HREE content at about 20% is higher than the ionic clay deposits, which seems to be incorrect until one realizes that they are excluding yttrium from the heavy rare earths. The rare earth content is apparently achieved through the interplay of mid-ocean ridge hydrothermal plumes (smokers) with rare earths dissolved in sea water. The iron-oxyhydroxide particles spewed out by the smokers scavenge the rare earth from the seawater as they precipitate and settle to the bottom. The highest grades occur far from the spreading centers in areas where there is little dilution from other sediments and where they have been accumulating since the Cretaceous (144 million years to the present). Unfortunately these locations are 4,000-5,000 m deep where no commercial mining has ever taken place, and will never take place for rare earths at the observed grades unless rare earth prices increase tenfold from current levels. And should that in fact happen without demand destruction, it would be simpler and more cost effective to mine the substantial low grade resources available on land. (For example, consider the rhyolite dome at Round Top Mountain which runs 0.05% TREO with a significant percentage of heavy rare earths.), 410470=Index Member Comment - July 7, 2011: Lynas attracts attention of Mitsubishi and Siemens, 425612=My DCF analysis indicates that Nechalacho is sub-economic if we apply a basket price representing three year average domestic prices, a $4.24 price target if we use the 3 year average for FOB prices, and an $11.66 price if we use the CIBC based 2015 forecast from which Avalon discounted its $46.33/kg base case basket price for a mixed oxide product. Clearly if we return to three year average domestic or FOB prices Nechalacho does not look very good. Avalon's own after-tax NPV of $1.27 billion works out to a target of $12.26 per share, which is very close to the $1.2 billion NPV I get using the CIBC 2015 forecast basket price of $67.86 per kg. This gives me confidence that my adaptation of the model to include a separation facility is plausible, which is important with regard to seeing what happens to the NPV when we run the model at spot domestic and FOB prices. The result is staggering: at the domestic spot basket price of $184.29/kg the after-tax NPV is $6.4 billion or $61.62 per share, which is close to the $5.59 billion number Avalon generated using \"current\" REO prices, and at the FOB spot basket price of $321.81/kg the after-tax NPV is $12.5 billion or $120.35 per share. At Avalon's $6.35 stock price the market is either 1) rejecting Avalon's cost assumptions, 2) rejecting Avalon's recovery flow-sheet, 3) assuming it will take forever to permit the project, or, 4) expecting rare earth oxide prices to plunge back to historical levels by the time Nechalacho comes on stream in 2016 or beyond., 419277=Spec Value Hunter Comment - July 8, 2011: Avalon updates Nechalacho prefeasibility study, 377000=What about credit instruments such as bonds and treasuries, which these days yield 3% or less thanks to the Federal Reserve's low interest rate policy? Households own about $4.1 trillion in bonds and T-Bills, similar to what they owned during H1 of 2008 before the market crashed. If there is a debt ceiling related default, yields on these instruments will soar, meaning that the principal value of the longer duration securities will decline. I doubt very much that households earning less than 80% are loaded up on bonds and T-Bills., 419380=Avalon Rare Metals Inc has published an update of last year's prefeasibility study which incorporates a new resource estimate, ramps up quickly to 2,000 tpd, and applies higher rare earth oxide prices to achieve an after-tax internal rate of return of 34% and net present value of $1.27 billion using a 10% discount rate. Don Bubar even briefly casts off his conservative mantle to declare that the after-tax IRR and NPV zoom to 102% and $5.59 billion if FOB rare earth oxide prices as of June 17, 2011 (Metal-Pages) are used, though he warns that as new supply comes on stream current prices will come down. REO prices have increased further since June 17 when the Nechalacho Basal Zone FOB basket price stood at $153.83; as of July 7, 2011 the basket price is $184/kg for domestic and $322/kg FOB (see table at end of comment for price breakdown). The updated PFS uses a basket price of $46.33/kg compared to $21.94/kg when the initial PFS was published on June 21, 2010 just before China slashed the export quotas and FOB spot prices soared. Since the start of 2011 domestic prices overall have also soared, and the more expensive heavy rare earths such as europium, dysprosium, and terbium which languished in both domestic and FOB terms during H2 of 2010 have soared. In fact, on July 7 their FOB prices, which on July 5 were lower than domestic prices despite a 25% export duty, jumped dramatically. The updated PFS still does not include a separation facility which Avalon plans to include in its bankable feasibility study expected in late 2012. However, Avalon has indirectly given us what it internally expects its separation costs to be, having discounted separated REO revenues \"to account for the cost of revenues\".}",
    "textBeforeTable": "Good Absolute Spec Value Buy at $6.35 261% 568 $0 Good Absolute Spec Value Buy @ $6.35 $6.35 7/8/2011 Avalon Rare Metals Inc New Status Gain Net Stock Net Cash Action Recommendation Price Date Company Bottom-Fish Recommendations made from July 3, 2011 to July 9, 2011 New Bottom-Fish Low New Bottom-Fish High New 2 Year Low New 2 Year High Updated this Week Recently Closed Out Below Bottom-Fish Range Within Bottom-Fish Range Above Bottom-Fish Range The Case Schiller Home Price Index is showing a double dip decline, with the 20 city index recently reaching a new low. The households who earn less than $150,000 likely do not have much equity left in their homes, and understand that their home value will not see higher prices for a long time. They also understand that the real estate market is back to the concept of \"location-location-location\" as a price driver, which feature their homes are unlikely to",
    "textAfterTable": "Lynas Corporation Ltd (LYC-ASX: $1.84) Profile Search Web Tree Forum SEDAR Quote Index Member Comment - July 7, 2011: Lynas attracts attention of Mitsubishi and Siemens Lynas Corp has attracted a new shareholder whose identity may not help it quell protests about its LAMP facility. On July 4 Mitsubishi UFJ Financial Group Inc filed a notice that on June 30 it became a \"substantial shareholder\", even though Lynas was halted that day to allow a response to the IAEA report on the rare earth processing facility in Kuantan, Malaysia. This report was requested by the Malaysian government in response to growing criticism about risks associated with the LAMP facility, criticisms that appear to be fueled by bad memories about the toxic waste left behind by Mitsubishi Chemical in 1992 when it processed tin mining slags for rare earths. It thus seems quite spooky that Mitsubishi should crop",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}