{
    "relation": [
        [
            "Competition",
            "Matches",
            "Runs scored",
            "Batting average",
            "100s/50s",
            "Top score",
            "Balls bowled",
            "Wickets",
            "Bowling average",
            "5 wickets in innings",
            "10 wickets in match",
            "Best bowling",
            "Catches/stumpings"
        ],
        [
            "Test",
            "40",
            "236",
            "6.05",
            "0/0",
            "29",
            "8,480",
            "128",
            "37.09",
            "5",
            "2",
            "9/57",
            "7/–"
        ],
        [
            "ODI",
            "10",
            "9",
            "3.00",
            "0/0",
            "4",
            "526",
            "16",
            "25.25",
            "0",
            "n/a",
            "3/40",
            "1/–"
        ],
        [
            "FC",
            "304",
            "1,985",
            "7.84",
            "0/2",
            "51",
            "53,284",
            "1,054",
            "30.33",
            "46",
            "9",
            "9/57",
            "45/–"
        ],
        [
            "LA",
            "185",
            "313",
            "5.21",
            "0/0",
            "42",
            "8,982",
            "249",
            "27.61",
            "2",
            "n/a",
            "7/35",
            "21/–"
        ]
    ],
    "pageTitle": "Devon Malcolm - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Devon_Malcolm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 875386479,
    "recordOffset": 875366855,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7862=Devon Eugene Malcolm (born 22 February 1963)[1] is a former English cricketer., 10291=Malcolm's chance to play for England came when several members of the then current Test team announced their intention to take part in a rebel tour to South Africa during the 1989 Ashes series, thereby disqualifying themselves from selection for the rest of the series.[1] He was lucky to make his first international appearance in the Fifth Test of against an Australian cricket team already 3–0 up in the series, and his first day in international cricket ended wicketless. But then, so did all his team-mates, for this was the occasion on which Mark Taylor and Geoff Marsh batted together unbeaten throughout the first day. On the second day of the match, Malcolm finally managed his first scalp at this level, and it was that of Steve Waugh for a duck – although it made little difference to the outcome, and Australia crushed England by an innings. Malcolm scored 14 runs in his two innings at the bottom of the order, including a four and a six, which perhaps raised false hopes as to his batting ability. He also scored his top Test score of 29 off only 18 balls in a later series against Australia, which included three fours and two successive sixes off Shane Warne.[3] Other \"high\" Malcolm scores included 18 against the West Indies despite being hit by several short deliveries, and 15 not out against India in a last wicket stand with Eddie Hemmings including a powerfully struck six., 13106=On 20 August 1994, playing for England against South Africa at The Oval, Malcolm was hit on the helmet by a bouncer while batting against Fanie de Villiers. He was incensed by this, exclaiming to the South African slip cordon the now famous words \"You guys are history\",[4] and hit back with his greatest spell of international bowling, ripping through the South African batting order to finish with figures of 9–57, at the time the sixth-best innings analysis in the history of Test cricket. His performance was subsequently ranked 91st in Channel 4's 100 Greatest Sporting Moments in 2002. It was also the best bowling analysis, in Test cricket, by an English fast bowler in the 20th century. Malcolm was named as one of the five Wisden Cricketers of the Year in 1995., 8112=Malcolm was one of England's few genuinely fast bowlers of the 1990s. Born in Kingston, Jamaica, he settled in England, making his first-class debut for Derbyshire in 1984, and qualifying to play for England in 1987. He played in 40 Test matches for his adopted country, but took part in just ten One Day Internationals. On his day he was one of the fastest bowlers in world cricket, but his playing style was also notable for his short-sightedness and poor catching, his powerful throwing arm, his perceived profligacy with the ball and his undoubted ineptitude with the bat., 15510=Malcolm's eight-year England career came to a close in the final Test of the 1997 Ashes series at The Oval. His international career thus ended as it had begun – in a losing Ashes side – albeit this time on the winning team in the match itself. It was an undistinguished goodbye; Malcolm took just one wicket in the 14 overs he was allowed (with the third ball of Australia's second innings, trapping Matthew Elliott leg before), and was out without scoring in both innings. Although he took over 100 wickets for his country, his final Test bowling average – over 37, as against under 30 for Derbyshire – told its own story., 16291=He remained a highly effective bowler in county cricket, however, and in 1998 Malcolm moved to play for Northamptonshire. Two years later moved again, this time to Leicestershire, for whom he played his final first-class match in 2003. In his final season Malcolm claimed over 60 wickets and achieved one 10-wicket haul.[6] He passed 1,000 first-class wickets with Leicestershire.[7], 12758=On the West Indies tour in 1989/90, Malcolm excelled as England won the First Test, took ten wickets in the Second Test and, with nineteen scalps in four Tests, returned as England's leading wicket-taking bowler of the trip.[1]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Career statistics Leicestershire 2001–2003 Northamptonshire 1998–2000 Derbyshire 1984–1997 Team Years Domestic team information 16 February 1994 v West Indies Last ODI 25 May 1990 v New Zealand ODI debut (cap 107) 23 August 1997 v Australia Last Test 10 August 1989 v Australia Test debut (cap 539) England National side International information Right arm fast Bowling style Right-handed Batting style 6 ft 2 in (1.88 m) Height (1963-02-22) 22 February 1963 (age 52) Kingston, Jamaica Born Devon Eugene Malcolm Full name Personal information Devon Malcolm searchnavigation , Jump to:",
    "textAfterTable": "Source: Cricinfo, 11 November 2009 Devon Eugene Malcolm (born 22 February 1963)[1] is a former English cricketer. Malcolm was one of England's few genuinely fast bowlers of the 1990s. Born in Kingston, Jamaica, he settled in England, making his first-class debut for Derbyshire in 1984, and qualifying to play for England in 1987. He played in 40 Test matches for his adopted country, but took part in just ten One Day Internationals. On his day he was one of the fastest bowlers in world cricket, but his playing style was also notable for his short-sightedness and poor catching, his powerful throwing arm, his perceived profligacy with the ball and his undoubted ineptitude with the bat. His under-average ability as a batsman seemed however to add to his popularity,[2] and he was often given a big cheer when he went out to bat, more often than not at number eleven, a position for which he was often in competition with Phil Tufnell. He hit some huge sixes for both England and Derbyshire and was a particular favourite of commentator Brian Johnston. As the cricket writer, Colin Bateman, noted, \"Malcolm, incredibly wholehearted with an easy charm off the field, became a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}