{
    "relation": [
        [
            "Parameter a",
            "PM10 (µg/m3)",
            "PM2.5 (µg/m3)",
            "SO2 (ppb)",
            "NO2 (ppb)",
            "CO (ppm)",
            "O3 (ppb)",
            "Temperature (°C)",
            "Humidity (%)",
            "Total deaths per day",
            "Respiratory deaths",
            "Cardiovascular disease death"
        ],
        [
            "Min",
            "15.33",
            "8.25",
            "1.12",
            "3.73",
            "0.15",
            "5.31",
            "9.35",
            "47.92",
            "2",
            "0",
            "0"
        ],
        [
            "25%",
            "36.26",
            "19.79",
            "3.07",
            "20.66",
            "0.53",
            "18.28",
            "19.67",
            "66.95",
            "11",
            "1",
            "2"
        ],
        [
            "50%",
            "48.01",
            "27.75",
            "4.05",
            "24.53",
            "0.66",
            "24.38",
            "24.32",
            "73.21",
            "14",
            "1",
            "4"
        ],
        [
            "75%",
            "62.28",
            "37.02",
            "5.35",
            "29.55",
            "0.82",
            "30.42",
            "28.27",
            "79.28",
            "17",
            "2",
            "5"
        ],
        [
            "Max",
            "205.35",
            "117.72",
            "11.14",
            "55.51",
            "1.73",
            "70.89",
            "32.78",
            "94.19",
            "32",
            "7",
            "11"
        ],
        [
            "Mean",
            "52.07",
            "30.65",
            "4.32",
            "25.37",
            "0.70",
            "24.83",
            "23.74",
            "73.02",
            "14.29",
            "1.51",
            "3.93"
        ]
    ],
    "pageTitle": "1. Introduction",
    "title": "",
    "url": "http://www.mdpi.com/1660-4601/11/5/5081/xml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00273-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 575491787,
    "recordOffset": 575469195,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7296=Total daily deaths were obtained within the Taipei city from the Department of Health (DOH), which is in charge of the death registration system, for the period from 2006 through 2008 (daily mortality data from DOH were not available nationwide after the year of 2009). For each death, detailed demographic information, including gender, date of death, date of birth, cause of death, place of death, and residential district were recorded. Deaths due to accidents (ICD-9 codes 800–999) and deaths occurring outside of the city were excluded from the analysis. The deaths were divided into the following two groups according to the International Classification of Diseases, 9th revision (ICD-9): (1) diseases of the respiratory system (ICD-9 codes 460–519); and (2) diseases of cardiovascular systems (ICD-9 codes 390–459)., 15992=This study was undertaken to determine whether there was an association between PM2.5 levels and daily mortality in Taipei, Taiwan, the largest metropolitan city with a subtropical climate. Daily mortality, air pollution, and weather data for Taipei were obtained for the period from 2006–2008. The relative risk of daily mortality was estimated using a time-stratified case-crossover approach, controlling for weather variables, day of the week, seasonality, and long-term time trends. For the single pollutant model, PM2.5 showed association with total mortality both on warm (>23 °C) and cool days (<23 °C). There is no indication of an association between PM2.5 and risk of death due to respiratory diseases both on warm and cool days. PM2.5 had effects on the risk of death from cardiovascular diseases only on cool days. In the two-pollutant models, PM2.5 remained effects on the risk of mortality for all cause and cardiovascular disease after the inclusion of SO2 and O3 both on warm and cool days. This study provides evidence that short-term exposure to PM2.5 increased the risk of death for all cause and cardiovascular disease., 7772=This study examined daily mortality in relation to PM2.5 levels in Taipei for the 3-year period from 2006 through 2008. Taipei is the largest metropolitan city in Taiwan with a population of approximately 2.64 million located in northern Taiwan. The major air pollution source is automobile exhaust emission. Taipei has a subtropical climate, with an annual average temperature of 23 °C., 6361=Six air quality monitoring stations were established in Taipei City by the Taiwanese Environmental Protection Administration (EPA), a central governmental agency in 1994. The monitoring stations were fully automated and routinely monitored five “criteria” pollutants including sulfur dioxide (SO2, by ultraviolet fluorescence); particulate matter (PM10, by β-ray absorption); nitrogen dioxide (NO2, by ultraviolet fluorescence), carbon monoxide (CO, by nondispersive infrared photometry), and ozone (O3, by ultraviolet photometry) levels. However, PM2.5 was not regularly monitored, and PM2.5 concentrations in Taiwan have only been measured continuously since 2006. PM2.5 was measured using tapered element oscillating microbalance method samplers. The availability of the monitoring network for PM2.5 provided an opportunity to investigate the impact of PM2.5 on daily mortality. For each day, hourly air pollution data were obtained for all of the monitoring stations. After calculating the hourly mean of each pollutant from the 6 stations, the 24-h average levels of these pollutants were computed. Daily information on mean temperature and mean humidity was provided by the Taipei Observatory of the Central Weather Bureau., 21220=Table 1 shows the demographic characteristics of the study population for all deaths, and respiratory and cardiovascular deaths. The distribution of air pollution, meteorologic measurements, and daily number of deaths in Taipei during the period from 2006 to 2008 are shown in Table 2. An average of 14 persons died of nonaccidental causes each day in the city over the study period. Median PM2.5 during study period was 27.75 µg/m3 (IQR:19.79–37.02), which is far higher than the USEPA National Ambient Air Quality Standard (NAAQS) of 15/m3 for annual PM2.5.}",
    "TableContextTimeStampAfterTable": "{30700=This study is based in part on data from the National Insurance Research Database provided by the Bureau of National Health Insurance, Department of Health and managed by National Health Research Institutes. The interpretation and conclusions contained herein do not represent those of Bureau of National Health Insurance, Department of Health or National Health Research Institutes. This study was supported by National Health Research Institutes (EO-101-PP-08) and National Science Council, Taiwan (NSC-102-2314-B-037-065-MY2)., 2948=Mortality counts, weather, and air pollutant concentrations in Taipei, Taiwan, 2006–2008., 11632=Adjusted odds ratios (AORs) and 95% confidence intervals (CIs) for daily mortality for each interquartile range increase of PM2.5 in Taipei, Taiwan, 2006–2008, stratified by temperature.}",
    "lastModified": "Wed, 13 May 2015 20:51:52 GMT",
    "textBeforeTable": "Mortality counts, weather, and air pollutant concentrations in Taipei, Taiwan, 2006–2008. Table 2 ijerph-11-05081-t002_Table 2 shows the effect estimates of PM2.5 on daily mortality in single-pollutant models and two-pollutant models. For the single pollutant model (without adjustment for other pollutants), PM2.5 showed association with total mortality both on warm and cool days, with an IQR increase associated with a 7% (95% CI = 3%–11%) and 6% (95% CI = 3%–10%) rise in number of total deaths, respectively. There is no indication of an association between PM2.5 and total number of death due to respiratory diseases both on warm and cool days. PM2.5 had effects on the risk of death from cardiovascular diseases only on cool days (7% increase for each IQR range change; 95% CI = 1%–15%). Table 4 . There was a certain degree of correlation among the pollutants, especially between PM2.5 and PM10 (r = 0.91), NO2 and CO (r = 0.88), and between SO2 and both PM10 (r = 0.63) and PM2.5 (r = 0.61). Table 3 The Pearson’s correlation coefficients among the air pollutants are presented in 76.0 ± 13.9 80.6 ± 12.5 74.5 ± 15.4 Age 1,768 (41.0%) 534 (32.2%) 6,617 (42.2%) Female 2,539 (59.0%) 1,122 (67.8%) 9,045 (57.8%)",
    "textAfterTable": "Note: Abbreviation: Min, minimum value; Max, maximum value; a 24-h average. ijerph-11-05081-t003_Table 3 Table 3 Correlation coefficients among air pollutants. Variable PM10 PM2.5 SO2 NO2 CO O3 PM10 1.00 0.91 0.63 0.47 0.45 0.40 PM2.5 - 1.00 0.61 0.52 0.51 0.36 SO2 - - 1.00 0.49 0.45 0.13 NO2 - - - 1.00 0.88 −0.03 CO - - - - 1.00 −0.19 O3 - - - - - 1.00 ijerph-11-05081-t004_Table 4 Table 4 Adjusted odds ratios (AORs) and 95% confidence intervals (CIs) for daily mortality for each interquartile range increase of PM2.5 in Taipei, Taiwan, 2006–2008, stratified by temperature. Total Deaths",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}