{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9"
        ],
        [
            "Team",
            "YORKSHIRE",
            "Warwickshire",
            "Middlesex",
            "Durham",
            "Nottinghamshire",
            "Somerset",
            "Worcestershire",
            "Sussex",
            "Hampshire"
        ],
        [
            "Played",
            "10",
            "11",
            "11",
            "10",
            "11",
            "11",
            "11",
            "11",
            "10"
        ],
        [
            "Won",
            "7",
            "5",
            "4",
            "6",
            "3",
            "3",
            "2",
            "3",
            "1"
        ],
        [
            "Lost",
            "0",
            "2",
            "1",
            "4",
            "4",
            "5",
            "7",
            "6",
            "5"
        ],
        [
            "Drawn",
            "3",
            "4",
            "6",
            "0",
            "4",
            "3",
            "2",
            "2",
            "4"
        ],
        [
            "Batting",
            "34",
            "24",
            "27",
            "16",
            "29",
            "26",
            "32",
            "17",
            "15"
        ],
        [
            "Bowling",
            "28",
            "31",
            "30",
            "28",
            "30",
            "31",
            "33",
            "29",
            "25"
        ],
        [
            "Deducted",
            "0.0",
            "0.0",
            "0.00",
            "0.0",
            "0.0",
            "0.0",
            "0.0",
            "0.0",
            "0.0"
        ],
        [
            "Points",
            "189.0",
            "155.0",
            "151.0",
            "140.0",
            "127.0",
            "120.0",
            "107.0",
            "104.0",
            "76.0"
        ]
    ],
    "pageTitle": "A Day in the Life of... - News - Yorkshire County Cricket Club",
    "title": "",
    "url": "http://yorkshireccc.com/news/view/2383/a-day-in-the-life-of-",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00197-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 839645163,
    "recordOffset": 839625375,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{11562=Friday 11 September 2015 - Royal London One-Day Interna... Buy Tickets, 23396=With 142 days to Headingley staging the Investec Test Match later between England and Sri Lanka commencing on Friday June 20, this week we are looking at what it takes to stage a major match at our famous old venue., 14733=Thursday 30 July 2015 - Royal London One-Day Cup, 14026=Monday 27 July 2015 - Royal London One-Day Cup, 16360=Wednesday 29 July 2015 - Royal London One-Day Cup, 10846=Wednesday 5 August 2015 - Royal London One Day Cup Buy Tickets, 32609=My fondest Test Match memory would probably have to be my first as Head Groundsman at Headingley in 1996. The first pitch I prepared as Head Groundsman and to see the players out on it was special and a real highlight. It was England against Pakistan and there were some great players. Michael Atherton was Captain and Pakistan had Wasim Akram, Waqar Younis… Ijaz Ahmed got 141 before Cork bowled him, caught by Russell. I remember it well!, 31440=Well my golden rule really is don’t ever forget your end of season renovations. I think there’s a tendency for the lower leagues to say, that’s it, the season’s over, leave it now until March and go off and do their own things now that the season’s done with and all the renovations to the pitch and outfield is left to one person. But that’s really the worst thing you can do, the end of season renovations have to be carried out properly and not be rushed, it’ll be much easier and you’ll prepare much better pitches for the start of the season if you look after your pitch and give it some TLC at the end of the season., 10444=Monday 3 August 2015 - Royal London One Day Cup Buy Tickets, 11975=Friday 11 September 2015 - Hospitality Buy Tickets, 3345=Thursday 30 July 2015, 11158=Tuesday 18 August 2015 - Royal London One Day Cup Buy Tickets, 25784=The gap between the off season and season is getting shorter and shorter as the seasons continue to grow, often teams are wanting outdoor nets as early as mid-march so they have to be ready and considering the season doesn’t end until the end of September that only gives the field a five month recovery period and preparation period. So actually, winter isn’t as quiet as it used to be, now it’s every bit as important as summer.}",
    "textBeforeTable": "LV= County Championship Division One View all Surrey win by 6 runs Yorkshire 1st XI vs Surrey Wednesday 29 July 2015 - Royal London One-Day Cup Yorkshire win by 133 runs Yorkshire 1st XI vs Worcestershire Thursday 30 July 2015 - Royal London One-Day Cup Results Yorkshire 1st XI 10:30 Worcestershire Thursday 30 July 2015 - Royal London One-Day Cup Yorkshire 1st XI 14:00 Derbyshire Falcons Monday 27 July 2015 - Royal London One-Day Cup Fixtures Other Women's Academy Juniors 2nd XI 1st XI",
    "textAfterTable": "View all Hosp & Events Shop Club Commercial Supporters YCCC TV History Internationals Sponsors & Partners Contact News A Day in the Life of... — 31 January 2014 Head Groundsman Andy Fogarty With 142 days to Headingley staging the Investec Test Match later between England and Sri Lanka commencing on Friday June 20, this week we are looking at what it takes to stage a major match at our famous old venue. In the fourth of our series of interviews, we caught up with Head Groundsman Andy Fogarty. Having spent 14 years with Old Trafford before migrating to over to the White Rose, Andy’s 18 years at the helm of the Headingley square and outfield are illustrious. His experience is second to none and his memories of a",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}