{
    "relation": [
        [
            "Date Issued",
            "9-15",
            "9-15",
            "9-15",
            "9-16",
            "9-16",
            "9-16",
            "9-16",
            "9-16",
            "9-16",
            "9-16",
            "9-17",
            "9-17",
            "9-17",
            "9-17",
            "9-17",
            "9-17",
            "9-17",
            "9-17",
            "9-17",
            "9-18",
            "9-18",
            "9-18",
            "9-18",
            "9-18",
            "9-18",
            "9-19",
            "9-19",
            "9-19",
            "9-19",
            "9-19",
            "9-19",
            "9-19",
            "9-19"
        ],
        [
            "Type of Case(1)",
            "EX",
            "EX",
            "EX",
            "EX",
            "OPP",
            "OPP",
            "EX",
            "EX",
            "EX EX",
            "EX",
            "CANC",
            "EX",
            "EX",
            "EX",
            "OPP (SJ)",
            "EX",
            "EX",
            "EX",
            "OPP",
            "EX",
            "EX (R)",
            "EX",
            "OPP",
            "EX",
            "EX",
            "EX",
            "EX",
            "EX EX EX",
            "EX",
            "EX",
            "OPP",
            "EX",
            "EX"
        ],
        [
            "Proceeding or Appn. No.",
            "78630084",
            "78691831",
            "78941662",
            "78897006",
            "91171229",
            "91166249",
            "76304439",
            "78387061",
            "77052352 77052356",
            "78927844",
            "92045327",
            "77100572",
            "78719955",
            "77111272",
            "91178614",
            "77107926",
            "78827035",
            "76632117",
            "91172517",
            "78922977",
            "76356484",
            "79031781",
            "91159665",
            "78775079",
            "78714647",
            "78905279",
            "78485818",
            "78841512 78841539 78841557",
            "78967315",
            "78745688",
            "91160397",
            "77264037",
            "78868409"
        ],
        [
            "Party or Parties",
            "Antillas Shoe Corporation",
            "Innovative Technologies Corporation of America, Inc.",
            "RKS Guitars, LLC",
            "Plasticos y Tecnologia, S.A. de C.V.",
            "World Triathlon Corp. v. Team Ironmen, Inc.",
            "Kajane McManus v. Steven G. Lisa, Ltd.",
            "Atronic International GmbH",
            "Western Family Foods, Inc.",
            "Fulltone Musical Products Inc.",
            "Quebec Inc.",
            "International Flora Technologies, Ltd. V. Desert Whale Jojoba Company, Inc.",
            "Crescent City Restaurant, Inc.",
            "The Sheraton LLC",
            "SBH, Inc.",
            "Fifth Third Bancorp v. Hopkins",
            "Maslyukov",
            "American Community Mutual Insurance Company",
            "Hayward Baker Inc.",
            "Olin Corporation v. S.A.T. Arms Technology",
            "Justin Botos and Matthew J. Botos",
            "Schuler Pressen GmbH & Co. KG",
            "Akzo Nobel Coatings International B.V.",
            "Sonafi, S.A. v. Randy Judd",
            "The Great Books Foundation",
            "TreeRadar, Inc.",
            "Gene Simmons Comics Group",
            "Pelco Products, Inc.",
            "True Value Company",
            "S.A. Establecimientos Vitivinicolas Escorihuela",
            "Western Family Foods, Inc.",
            "Exel Oyj v. Edmont P. D’Ascoli, Trustee of the Edmont P. D’Ascoli Revocable Living Trust Dated May 24, 1996; Seal Trademarks PTY Ltd. V. Exel Oyj",
            "Exponential Interactive, Inc.",
            "Electric Visual Evolution, LLC"
        ],
        [
            "Issue",
            "2(d)",
            "2(d)",
            "2(d)",
            "2(d)",
            "2(d)",
            "2(d)",
            "2(d)",
            "2(e)(1)",
            "2(d)",
            "2(e)(1); whether applicant’s specimen of use is acceptable",
            "genericness",
            "2(d)",
            "2(e)(1)",
            "2(e)(1); whether applicant’s specimen is acceptable",
            "whether applicant made bona fide use of his mark in commerce as of the filing date of his application",
            "2(e)(4)",
            "2(d); 2(e)(1)",
            "genericness [whether applicant’s mark is registrable on the Supplemental Register]",
            "2(d); dilution",
            "2(d)",
            "2(e)(1)",
            "2(d)",
            "2(d)",
            "2(e)(1); whether applicant’s mark has acquired distinctiveness under Section 2(f)",
            "2(e)(1)",
            "2(e)(4)",
            "2(e)(5) [functional matter]; whether applicant’s configuration, if not functional, has acquired distinctiveness under Section 2(f)",
            "2(e)(1)",
            "2(d); requirement to submit a specimen of use and a copy of applicant’s foreign registration",
            "2(e)(1)",
            "2(d); counterclaim to cancel on the following grounds: 2(e)(1); lack of distinctive-ness; whether opposer’s registration is void because of an invalid transfer of ownership of the intent-to-use application from which the registration issued",
            "2(e)(1)",
            "2(e)(1)"
        ],
        [
            "TTAB Decision",
            "Refusal Affirmed",
            "Refusal Reversed",
            "Refusal Affirmed",
            "Refusal Affirmed",
            "Opposition Sustained",
            "Opposition Dismissed",
            "Refusal Affirmed as to all 4 cited registra-tions",
            "Refusal Affirmed in all classes",
            "Refusal Affirmed in both cases as to all 3 cited registra-tions",
            "Refusal Affirmed on both grounds",
            "Petition to Cancel Granted",
            "Refusal Affirmed",
            "Refusal Affirmed in both classes",
            "Refusal Affirmed (but only on the 2(e)(1) ground for refusal)",
            "Opposition Sustained [Opposer’s motion for summary judgment granted]",
            "Refusal Affirmed",
            "Refusal Affirmed on both grounds",
            "Refusal Affirmed",
            "Opposition Sustained as to Class 13 (on 2(d) grounds only) and Dismissed as to Class 28 [Note: Registra-tion of applicant’s mark in Classes 9 and 38 was not opposed.]",
            "Refusal Affirmed in all 3 classes",
            "Request for Reconsideration Denied (Refusal Affirmed in all five classes)",
            "Refusal Affirmed in both classes",
            "Opposition Sustained",
            "Refusal Affirmed on both grounds",
            "Refusal Affirmed in both classes",
            "Refusal Affirmed",
            "Refusal Affirmed (but only on the grounds of lack of acquired distinctiveness under Section 2(f))",
            "Refusal Reversed in all 3 cases",
            "Refusal Affirmed on both grounds",
            "Refusal Affirmed",
            "Opposition Dismissed; Counter-claim to Cancel Dismissed",
            "Refusal Affirmed",
            "Refusal Affirmed"
        ],
        [
            "Opposer's or Petitioner's Mark and Goods or Services",
            "",
            "",
            "",
            "",
            "\"IRON GIRL\" [entertainment services, namely, arranging and conducting athletic competitions]; and a number of other marks incorporating the word \"IRON,\" for a range of goods and services related to those services recited above",
            "\"PATNTIT\" [intellectual property law services]",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "\"DOUBLE X\" [ammunition]; \"SUPER-X [firearms, namely, shotguns]; \"SUPER-X\" [shot shells, rifle and pistol cartridges]; \"XX\" [ammunition]; and other marks incorporating the letter \"X\" for the same or similar goods",
            "",
            "",
            "",
            "\"XOCO\" [chocolate]",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "\"EXEL\" [ski poles, ski pole straps, ski pole handles, ski pole grips, and ski pole tips]",
            "",
            ""
        ],
        [
            "Applicant's or Respondent's Mark and Goods or Services",
            "\"!SO WHAT!!\" [footwear and shoes for men, women, and children]",
            "\"HAIR OF THE DOG\" [clothing, namely, shirts, t-shirts, pants, shorts, headwear, hats, socks, sleepwear and dresses]",
            "\"GIG-STAND\" (in stylized lettering) [electric and electric bass guitar stands]",
            "\"BUBBLE FUN BRUSH\" [tooth brushes]",
            "\"IRON MEN LOS ANGELES\" (and design) [entertainment services, namely, participation in paintball competitions; and training in the field of competitive paintball]",
            "\"PATENT IT!\" [legal services]",
            "\"FIESTA FRUITS\" [gaming equipment, namely, gaming machines featuring slot machine type games via video display; electronic slot machines to be sold exclusively by a sales branch agency in the U.S. directly to casino operators]",
            "\"CARB VALUE\" [a large number of food items in Classes 29, 30 and 32]",
            "\"GT-350\" and \"GT-500\" [both marks for: electronic effects pedals and stomp boxes for use with musical instruments and parts therefor and instructional manuals, sold as a unit]",
            "\"ACOUSTIK\" [rubber flooring, namely, subflooring and flooring underlayments]",
            "\"OIL FREE JOJOBA\" [skin and body soaps, essential oils for personal use, cosmetics, and hair lotions, all containing one or more chemically modified jojoba extracts]",
            "\"CRESCENT CITY STEAKS SINCE 1934\" (and design) [catering; restaurant and bar services]",
            "\"THE LUXURY COLLECTION\" [in Class 36: real estate brokerage, real estate equity sharing, namely, managing and arranging for ownership of real estate, condominiums, apartments; real estate investment, real estate management, real estate time sharing and leasing of real estate and real property, including condominiums and apartments; in Class 37: real estate development services]",
            "\"SECURITIES INSURANCE\" [investment advice]",
            "\"5TH3RD\" [musical instruments]",
            "\"HAIG\" [whisky]",
            "\"PAY AS YOU GO\" [insurance underwriting in the field of health care plans and life insurance plans and insurance administration in the field of health care plans and life insurance plans]",
            "\"FOUNDATION SERVICES\" [geotechnical construction services, namely, foundation rehabilitation, drilled foundations, earth retention/underpinning, injection services for expansive soils, namely, the injection of products into soil for limiting heave due to expansive clays, strengthening railroad subgrades, pavements and landfills and stabilizing slopes, site improvement, soil/slope stabilization, settlement control, excavation support, liquefaction mitigation and groundwater control, namely, through chemical grouting and jet grouting service]",
            "\"X\" (and design) [in Class 13: firearms, air weapons, namely, air guns, starter pistols, signal guns, signal pistols; bullets and ammunition; accessories for the above stated goods, namely, rifle case, rifle covers, cartridge pouches, rifle sling straps, and cases for cartridges; in Class 28: toys, namely, toy pistols, rifles, and machine guns; toy handguns; toy firearms; toy bullets and ammunition; toy firearms for use with stand alone video game machines with electronic targets; spare/replacement parts for the above goods]",
            "\"EVIL EYE CLOTHING\" [in Class 18: all purpose sport bags; all-purpose carrying bags; backpacks; beach bags; book bags; luggage; tote bags; in Class 25: caps; jackets; panties; pants; shirts; shorts; t-shirts; undergarments; and other items; in Class 35: mail order services featuring clothing, etc.; on-line retail store services featuring clothing, etc.; retail stores featuring clothing, etc.]",
            "\"COMPACT CROSSBAR\" [in Class 7: machines for metal working, namely, mechanical and hydraulic presses, and other goods; in Class 35: data processing services, business management and consultation services; in Class 37: installation, assembly, repair and maintenance of machines for metal working, etc.; in Class 40: metal working to order and/or specification of others, etc.; in Class 42: design of machines for metal working, and other services]",
            "\"FLEXXPRESS\" [in Class 2: industrial coatings, paints, primers and inks to be used on plastic substrates; in Class 7: industrial machines for transfer printing; membranes, in the nature of silicones, for industrial machines for transfer printing]",
            "\"XOCOLATE\" [confections, namely, candies, chocolate and chocolate truffles]",
            "\"SHARED INQUIRY\" [educational services, namely, providing classes, seminars and courses of instruction in the field of reading and literature using a proprietary method of learning]",
            "\"TREERADAR\" [in Class 9: radar imaging systems for non-invasive assessment of tree and root health, comprised of radars, image processors, software, mobile mounts, carriages, printed instructions and carrying cases, all sold together as a unit; in Class 42: scientific and technological services, namely, measuring, imaging, and analyzing sub-surface tree viability and decay and internal structure of trees and root masses, and quantitative analysis of tree health and structural integrity]",
            "\"SIMMONS COMICS GROUP\" [comic books]",
            "configuration of applicant’s goods [brackets made of metal for attaching traffic signals to mast arms]",
            "3 applications to register the mark \"MASTER PLUMBER\": [sump pumps; water pumps for spas, baths, whirlpools, swimming pools, aquariums; food waste and garbage disposals; and other goods]; [laundry sinks and faucets; kitchen sinks; plumbing fittings; and a variety of related goods]; [dryer vents; plastic hoses for plumbing use; and other goods]",
            "\"DON MIGUEL GASCON\" (and design) [wine]",
            "\"POOCH WRAPS\" [dog food and pet treats]",
            "\"XCEL\" [in class 18: duffel bags; beach bags; backpacks; in Class 28: diving bags]",
            "\"DYNAMIC ADS\" [advertising and marketing services, promoting the goods and services of others through placement, targeting, and distribution of advertising via the Internet and other means of communication]",
            "\"ELECTRIC\" [watches and watch bands]"
        ],
        [
            "Mark and Goods Cited by Examining Attorney",
            "\"SO WHAT!\" (in stylized format) [clothing, namely, shirts, t-shirts, caps, socks, hats]",
            "\"LES CHEVEUX DU CHIEN\" [custom manufacture of clothing, personal accessories in the nature of jewelry, stoles, scarves, linens, and home décor items]",
            "\"GIG STAND\" [music stands]",
            "\"FUNBRUSH\" [toothbrushes]",
            "",
            "",
            "2 registrations for the mark \"FIESTA\" [casino services, providing facilities for non-gaming video arcade games, providing amusement centers and arcades, and entertainment services in the nature of arranging, conducting, and providing facilities for special events] and [casino services] and 2 registrations for the mark \"FIESTA\" (and design) [casino services, providing facilities for non-gaming video arcade games, providing amusement centers and arcades, and entertainment services in the nature of arranging, conducting, and providing facilities for special events] and [entertainment services, namely, providing a website featuring information on entertainment, namely, casinos and gaming]",
            "",
            "3 cited registrations, all owned by the same entity: \"GT\" (in design format) and \"GT ELECTRONICS\" [both marks for: microphones; amplifiers; and a number of other goods] and \"GT\" (in design format) [microphones]",
            "",
            "",
            "\"CRESCENT CITY\" [restaurant services]",
            "",
            "",
            "",
            "",
            "\"PAY-AS-YOU-GO\" [insurance brokerage services, insurance claims administration and claim processing services, and insurance consultation services]",
            "",
            "",
            "\"EVIL EYES\" (and design) [clothing, namely, adults, teens, and children’s t-shirts, shorts, pants, hats, caps, underwear, jackets, dress shirts and bandanas]",
            "",
            "\"FLEXPRESS\" [high speed flexographic printing machines with variable repeat lengths for printing photographic quality images on continuous webs used for packaging consumer goods]",
            "",
            "",
            "",
            "",
            "",
            "",
            "\"HACIENDA DE DON MIGUEL\" [wines]",
            "",
            "",
            "",
            ""
        ],
        [
            "Citable as Precedent of TTAB",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No"
        ]
    ],
    "pageTitle": "Patent and Trademark Office Notices",
    "title": "",
    "url": "http://www.uspto.gov/web/offices/com/sol/og/2008/week43/TOC.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 77,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 800717179,
    "recordOffset": 800653899,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{185699=SUMMARY OF FINAL DECISIONS ISSUED BY THE TRADEMARK TRIAL AND APPEAL BOARD September 15-19, 2008  , 255452=U.S. Patent and Trademark Office Information Products Division MDW - 4C18 P.O. Box 1450 Alexandria, VA 22313-1450 (571) 272-5600 or email at IPD@uspto.gov}",
    "lastModified": "Wed, 17 Dec 2008 15:18:43 GMT",
    "textBeforeTable": "SUMMARY OF FINAL DECISIONS ISSUED BY THE TRADEMARK TRIAL AND APPEAL BOARD September 15-19, 2008       Summary of Final Decisions Issued by the Trademark Trial and Appeal Board        Print This Notice 1335 OG 206  US PATENT AND TRADEMARK OFFICE  Top of Notices October 21, 2008              7,262,435 7,353,202 7,391,861 7,258,984 7,352,242 7,391,805 7,258,763 7,352,094 7,391,772 7,253,150 7,351,812 7,391,560 7,252,154 7,351,791 7,391,498 RE. 39,834 7,251,832 7,351,717 7,391,437 PP. 18,825 7,250,202 7,351,404 7,391,335 PP. 18,788 7,248,518 7,351,146 7,391,329 D. 572,408 7,247,209 7,350,600 7,390,826 D. 571,625 7,246,922 7,350,475 7,390,246 D. 571,199 7,246,664 7,350,289 7,390,172 D. 571,017 7,246,098 7,350,159 7,389,918 D. 570,573 7,245,442 7,349,073 7,389,868 D. 569,431 7,245,138 7,348,967 7,389,723 D. 568,932 7,244,228 7,348,937 7,389,413 D. 567,853 7,242,053 7,348,336 7,389,369 D. 559,909 7,242,000 7,348,143 7,389,364 D. 559,452 7,241,070 7,347,877 7,388,931 D. 559,311 7,238,962 7,347,814 7,388,721 D. 537,217 7,238,498 7,347,627 7,388,687 D. 495,439 7,236,997 7,346,775 7,388,608 D. 492,482 7,236,759 7,346,216 7,388,493 D. 492,480 7,235,640 7,345,865 7,388,299 D. 492,479 7,234,980 7,345,776 7,388,294 7,415,630 7,233,985 7,345,482 7,388,290 7,413,004 7,231,644 7,344,646 7,388,265 7,412,930 7,231,346 7,343,335 7,388,251 7,412,644 7,230,494 7,343,305 7,387,959 7,412,405 7,230,126 7,343,080 7,387,902 7,412,283 7,229,842 7,342,094 7,387,866 7,411,864 7,229,065 7,341,834 7,387,246 7,411,742 7,222,357 7,341,541 7,386,981 7,411,610 7,221,698",
    "textAfterTable": "(1) EX=Ex Parte Appeal; OPP=Opposition; CANC=Cancellation; CU=Concurrent Use; (SJ)=Summary Judgment; (MD)=Motion to Dismiss; (MR)=Motion to Reopen; (R)=Request for Reconsideration (2) *=Opinion Writer; (D)=Dissenting Panel Member  Top of Notices October 21, 2008 US PATENT AND TRADEMARK OFFICE Print Appendix 1335 OG  Mailing and Hand Carry Addresses for Mail to the United States Patent and Trademark Office  MAILING AND HAND CARRY ADDRESSES FOR MAIL TO THE UNITED STATES PATENT AND TRADEMARK OFFICE MAIL TO BE DIRECTED TO THE COMMISSIONER FOR PATENTS For most correspondence (e.g., new patent applications) no mail stop is required because the processing of the correspondence is routine. If NO mail stop is included on the list below, no mail stop is required for the correspondence. See the listing under \"Special Mail Stops Applicable To Both Patent And Trademark Mail\" for additional mail stops for patent-related correspondence. Only the specified type of document should be placed in an envelope addressed to one of these special mail stops. If any documents other than the specified type identified for each special mail stop are addressed to that mail stop, they will be significantly delayed in reaching the appropriate area",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}