{
    "relation": [
        [
            "",
            "GTK+",
            "Qt/Qt Extended",
            "Middleware",
            "Java",
            "Python",
            "Mono"
        ],
        [
            "Om 2008.12",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??"
        ],
        [
            "Om 2008.9",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??"
        ],
        [
            "Om 2008.8",
            "yes",
            "yes",
            "qtopia-x11",
            "Jalimo",
            "yes",
            "yes (1)"
        ],
        [
            "2007.2",
            "yes",
            "no",
            "gsmd/neod",
            "Jalimo",
            "yes",
            "yes (1)"
        ],
        [
            "FSO",
            "yes",
            "yes ?",
            "FSO",
            "Jalimo",
            "yes",
            "??"
        ],
        [
            "SHR",
            "yes",
            "yes ?",
            "FSO",
            "Jalimo",
            "yes",
            "no"
        ],
        [
            "FDOM",
            "yes",
            "yes",
            "qtopia-x11",
            "yes",
            "yes",
            "??"
        ],
        [
            "Qt Extended",
            "no",
            "yes",
            "Qt Extended",
            "??",
            "yes",
            "??"
        ],
        [
            "Debian",
            "yes",
            "yes",
            "FSO",
            "CacaoVM, JamVM",
            "yes",
            "yes (1)"
        ],
        [
            "Gentoo",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??"
        ],
        [
            "Android",
            "??",
            "??",
            "??",
            "??",
            "??",
            "??"
        ]
    ],
    "pageTitle": "Distributions/de - Openmoko",
    "title": "",
    "url": "http://wiki.openmoko.org/index.php?title=Distributions/de&diff=62293&oldid=62292",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 263427775,
    "recordOffset": 263394897,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24794=Das Om 2008.9 Update is das erste Point-Release nach dem ursprünglichen OM 2008.8 Release. Openmoko empfiehlt alle vorhandenen Installationen des Om 2008.8 auf diese Version zu updaten. Wir sind weiterhin weit vom angepeilten Qualitätsziel entfernt, jedoch enthält diese Version grundlegende stabilitätserweiternde Verbesserungen am Betriebssystem und einen neuen Splash-Screen. Es wurden keine Anwendungen hinzugefügt oder entfernt. Nutzer mit den Anforderungen grundlegenden Anforderungen an ein Telefon empfinden es als so nutzbar wie ein alltägliches Smartphone., 25663=Om 2008.8 wurde am 8. August 2008 veröffentlicht und ersetzt die Om 2007.2. Zuvor war ihr Codename ASU (April/August Software Update). Dies ist nach wie vor der Name ihrer Branch im Version Control System. Diese Distribution integriert das Qtopia Paket, mit einer Menge neuer Openmoko Anwendungen welche auf den Enlightenment Foundation Bibliotheken basieren. Da Qtopia ein ausgereifteres Projekt als die GNOME Mobile Plattform ist, arbeiten die Mobiltelefon Anwendungen (dialer, contacts, calculator, calendar) besser als in der 2007.2. Das in 2008.8 verwendete Qtopia Projekt wurde portiert um, im Gegensatz zum standard Qtopia, welches den Framebuffer nutzt, unter X11 zu arbeiten. Dies erlaubt nicht-Qt Anwendungen sich sicher den Schirm mit Qt Anwendungen zu teilen. Es handelt sich hierbei um ein .0 Release, viele ungelöste Probleme verbleiben auf den unteren Schichten (kernel power management, sound, wifi drivers...)., 29631=SHR ist eine von der Community vorangetriebene Distribution. Mometan gibt es einen EFL dialer, Nachrichten und Kontakt Anwendungen welche in C geschrieben wurden. Bis zum 9. November 2008 gibt es kein 'stable Release' dieser Distribution, da das SHR Team nicht der Ansicht ist, sie sei gut genug. Images sind hier zu finden: SHR buildhost., 37829=Status: Aktiv, Fragen: #neo1973-germany, 28013=FSO ist eine Abkürzung für FreeSmartphone.Org. Openmoko arbeitet an einem Stabilen services back-end. Das Hauptaugenmerk liegt auf stabilen highlevel services die man in jeder beliebigen Sprache oder mit jedem UI das dbus unterstützt nutzen kann. Das Framwork wird in nachfolgenden Openmoko Distributionen genutzt werden. FSO ist reine Middle-Ware, aber wenn man einen Bootloader&Kernel darunter und Telephonie Anwendungen darüber platziert, erhält man eine funktionierende Distribution. Diese werden als FSO-image Meilensteine zur Verfügung gestellt. Openmoko Framework Image milestone IV wurde am 11. November 2008 released und 'Homework' genannt. Es wird berichtet, dass obwohl das FSO Projekt noch in den Kinderschuhen steckt, der phone Server bereits stabiler ist als sonst irgendwo. Der Kernel darunter ist ein Linux 2.6.24 Kernel mit separiert Modulen. Die Telephonie Anwendung darüber ist Zhone. Sie ist ein Python basierter dialer/homescreen, welcher als Grundlage um die FSO Funktionen zu testen entworfen wurde. Auch wenn Zhone gut aussieht, ist code path coverage wichtiger als Benutzerfreundlichkeit., 26957=Om 2007.2 ist das Basis-System, das auf dem FreeRunner installiert ist, wenn es die Fabrik verlässt. Das Interface was völlig auf die Bedienung über Finger ausgelegt, auf 285ppi angepasst und sehr orange. Es nutzte das GTK+ Paket, welches Teil der GNOME Mobile Plattform ist. Diese Distribution wird inzwischen als veraltet betrachtet und nicht weiter von Openmoko Inc. oder OpenedHand bearbeitet und gewartet. Es gibt Bemühungen der Community (Hackable:1) die GTK basierten Telephonie Anwendungen auf die künftige Middle-Ware von FSOzu portieren., 17318=Openmoko Distributionen wurden entwickelt um auf verschiedenen Mobilen Geräten zu arbeiten, allen voran den Openmoko Inc.'s Neo 1973 und Neo FreeRunner Mobiltelefonen. Es sind GNU/Linux Distributionen -- komplette Betriebssysteme mit mit Anwendungen, die mehr oder weniger für Endbenutzer geeignet sind. Sie können jede dieser Distributionen auf ihrem Smartphone installieren, oder sogar ein Multiboot System einrichten mit zwei installierten Distributionen.}",
    "textBeforeTable": "Toolkits / Runtimes yes  ?? yes (1) yes yes yes  ? yes yes (1)  ??  ?? Media Player  ?? yes (1) yes yes  ?  ? yes (1) yes (1)  ??  ?? XMPP Client yes  ?? yes (1) yes yes  ?  ?  ? yes  ??  ?? Mail Client yes  ?? yes (1) yes yes yes  ? yes (1) yes (1)  ??  ?? Web Browser yes  ?? yes (1) yes yes yes yes yes yes  ??  ?? Dialer yes  ?? yes (1) yes yes yes yes yes yes  ??  ?? Phonebook  ??  ?? yes (1) yes yes",
    "textAfterTable": "Images Latest and stable combinations for Neo FreeRunner gta02 OM FDOM Qt Extended Android current bootloader U-Boot from OM daily version gta02v5_and_up U-Boot from OM daily version gta02v5_and_up U-Boot from OM daily version gta02v5_and_up future bootloader Qi from Andy latest qi-andy.udfu Qi from Andy latest qi-andy.udfu Qi from Andy latest qi-andy.udfu splash U-Boot from OM releases or OM daily latest splash.gz U-Boot from OM releases or OM daily latest splash.gz U-Boot from OM releases or OM daily latest splash.gz kernel Linux from",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}