{
    "relation": [
        [
            "",
            "Week",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13"
        ],
        [
            "",
            "Ohio State",
            "x",
            "Wisconsin",
            "Iowa",
            "Illinois",
            "Northwestern",
            "Nebraska",
            "Indiana",
            "Penn St.",
            "Purdue",
            "Michigan"
        ],
        [
            "",
            "Northwestern",
            "x",
            "Michigan",
            "MSU",
            "Iowa",
            "Ohio State",
            "Indiana",
            "Penn St.",
            "Purdue",
            "Nebraska",
            "Illinois"
        ],
        [
            "",
            "Nebraska",
            "Iowa",
            "Illinois",
            "Minnesota",
            "MSU",
            "Penn St.",
            "Ohio State",
            "Purdue",
            "Indiana",
            "Northwestern",
            "x"
        ],
        [
            "",
            "Indiana",
            "MSU",
            "Iowa",
            "Wisconsin",
            "Minnesota",
            "x",
            "Northwestern",
            "Ohio State",
            "Nebraska",
            "Penn St.",
            "Purdue"
        ],
        [
            "",
            "Penn St.",
            "Minnesota",
            "x",
            "Michigan",
            "Wisconsin",
            "Nebraska",
            "Purdue",
            "Northwestern",
            "Ohio State",
            "Indiana",
            "MSU"
        ],
        [
            "",
            "Purdue",
            "Wisconsin",
            "Minnesota",
            "Illinois",
            "Michigan",
            "x",
            "Penn St.",
            "Nebraska",
            "Northwestern",
            "Ohio State",
            "Indiana"
        ]
    ],
    "pageTitle": "Diaries | mgoblog",
    "title": "",
    "url": "http://mgoblog.com/blog?page=469%2C8%2C9%2C0%2C0%2C1%2C1%2C2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 18,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 156376899,
    "recordOffset": 156337109,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{134778=The way I have the schedules worked out, the full conference schedules end up varying year by year, but ultimately the variance is within one level: The hardest a schedule ever gets is 3.00 (for Northwestern in 2015-16, and Iowa and Minnesota in 2017-18), and the easiest it ever gets is 4.00 (for Nebraska in 2018-19, Wisconsin in 2017-18, and Penn State in 2011-12)., 134020=The X games are the opposite divisional games that switch off, so that in 2011 and 2012, we don't play our X4 and X5, in 2013-14 we don't play X1 and X2, in 2015-16 we skip X3 and X4, in 2017-18 it's X5 and X1, and in 2019-20 it's X2 and X3., 87045=If you look at 25 years it comes out to 1074-704-22 (0.597) for the East and 963-812-23 (0.536) for the West., 134281=This way you will face every opponent at least six times in a decade, and never go more than two seasons without seeing a conference rival. For divisional rivals, it also establishes set weeks each season that you will face a certain team, which I think gives the schedule a bit more traditionalist feel if, e.g., Michigan and Michigan State always meet the first weekend of November, or the Little Brown Jug game is always played the week before Thanksgiving., 101291=JACK: I visited up there today (yesterday, June 14th), and they offered me. I have somewhere around 20 or 25, something like that. }",
    "lastModified": "Tue, 04 Aug 2015 23:09:57 GMT",
    "textBeforeTable": "So splitting those up we get: Tier 1: Michigan, Ohio State Tier 2: Nebraska, Penn State Tier 3: Wisconsin, Iowa Tier 4: Purdue, Mich St. Tier 5: Minnesota, Illinois Tier 6: Northwestern, Indiana First, I split the entire conference up into six Competitive Balance tiers. These tiers will serve as a value for calculating the expected difficulty of playing any of these teams over a 10-year span. They were assigned tier levels by recent and historical success, and duh -- if you want to dispute duh you are welcome to do so. The tiers as follows: I broke my conferences up exactly how Delany described, starting by listing competitive balance on a tier level, then protecting rivalries, then geography. Before shouting, wait to see the protected rivalries in the ninth game. How It Was Made The Pac11Ten currently plays nine conference games. They are a separate case entirely, but it's well to point out that, despite what it may say in the record books, USC went to a lot of BCS championship games playing nine conference opponents. The extra losses probably cost them some bowl eligibility at the bottom, which fans won't mourn an erstwhile 6-6 team that finishes 5-7 but the conference certainly will. The downside is it necessarily decreases the number of wins in the conference overall -- 12 games",
    "textAfterTable": "Illinois Michigan Wisconsin Iowa Div 4 Minnesota Illinois Michigan Wisconsin Iowa Mich St. Div 5 Illinois Michigan Wisconsin Iowa Mich St. Minnesota Rival Ohio State Purdue Nebraska Indiana Penn State Northwestern   Woody Division:   Ohio State Nebraska Penn State Purdue Northwestern Indiana Div 1 Nebraska Penn State Purdue Northwestern Indiana Ohio State Div 2 Penn State Purdue Northwestern Indiana Ohio State Nebraska Div 3 Purdue Northwestern Indiana Ohio State Nebraska Penn State Div 4 Northwestern Indiana Ohio State Nebraska Penn State Purdue Div 5 Indiana Ohio State Nebraska Penn State Purdue Northwestern Rival",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}