{
    "relation": [
        [
            "Catheter Size",
            "3 Fr",
            "4 Fr",
            "5 Fr",
            "4 Fr",
            "5 Fr",
            "6 Fr",
            "6 Fr"
        ],
        [
            "Lumens",
            "Single",
            "Single",
            "Single",
            "Dual",
            "Dual",
            "Dual",
            "Triple"
        ],
        [
            "Lumen Gauge Size",
            "20 Ga.",
            "18 Ga.",
            "17 Ga.",
            "21 Ga./19 Ga.",
            "18 Ga./18 Ga.",
            "18 Ga./18 Ga.",
            "20 Ga./20 Ga./ 17 Ga."
        ],
        [
            "Average Gravity Flow Rate",
            "183 ml/hr",
            "798 ml/hr",
            "1,448 ml/hr",
            "112/275 ml/hr",
            "515/515 ml/hr",
            "762/762 ml/hr",
            "184/184/950 ml/hr"
        ],
        [
            "Priming Volumes",
            "0.42 ml",
            "0.62 ml",
            "0.75 ml",
            "0.38/0.48 ml",
            "0.55/0.55 ml",
            "0.69/0.69 ml",
            "0.43/0.43/0.73 ml"
        ],
        [
            "Lumen Size I.D.",
            "0.024 in.",
            "0.034 in.",
            "0.042 in.",
            "0.024/0.032 in.",
            "0.034/0.034 in.",
            "0.037/0.037 in.",
            ".023/.022/.022 in."
        ]
    ],
    "pageTitle": "Poly RadPICC® Catheters | I.R. PICCs | Bard Access Systems",
    "title": "",
    "url": "http://www.bardaccess.com/ir-radpicc-poly.php?section=Overview",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00308-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 309750424,
    "recordOffset": 309742222,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{4287=© 2015 C. R. Bard, Inc. All rights reserved.}",
    "textBeforeTable": "Specifications Please consult product labels, IFU, and package inserts for any indications, contraindications, hazards, warnings, cautions, and instructions for use. Gold tungsten tip guidewires Features highly radiopaque tip with an optimized transition and excellent kink resistance Guidewire options Nitinol and standard stainless steel are offered with a highly radiopaque gold tungsten tip Kink-resistant hub Enhances catheter strength Offers RadSTIC® Microintroducer 10 cm PTFE microintroducer offers excellent peelability and a smoother transition from dilator to sheath Two placement options 70 cm and 135 cm guidewire lengths support modified Seldinger technique (MST) and over-the-wire placement procedures Marked guidewire Easy to read depth markings allow PICC to be trimmed to appropriate length High durometer extension legs Offer improved durability and greater resistance to alcohol Longer extension legs Promote easy application of occlusive dressing Reverse taper hub Gently plugs the insertion site and provides excellent kink resistance Highly radiopaque catheter Blend of barium and polyurethane provides high radiopacity while maintaining catheter strength Polyurethane body Provides strength, versatility and high flow rates in a small French size catheter Poly RadPICC® catheters combine the strength and versatility of polyurethane with high flow rates and small French sizes. A kink-resistant hub enhances catheter strength",
    "textAfterTable": "Resources Please refer below to the Instructions for Use (IFUs) for any indications, contraindications, hazards, warnings, and cautions. Instructions For Use (IFU) Reverse Taper Information Brochure Patient Guide PICC Care and Maintenance Guide PICC Insertion Checklist top Home About Us Contact Us Careers CR Bard Legal Notice Trademarks Site Map RSS © 2015 C. R. Bard, Inc. All rights reserved. 1413326879",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}