{
    "relation": [
        [
            "Days in the nursery",
            "Pre-weaning",
            "7",
            "14",
            "21",
            "28",
            "35",
            "42",
            "Post-weaning",
            "49",
            "56"
        ],
        [
            "Total DMI, lb/d",
            "A",
            "1.27",
            "1.52",
            "1.81",
            "2.21",
            "2.43",
            "3.77",
            "",
            "4.76",
            "5.43"
        ],
        [
            "Starter intake, lb/d",
            "A",
            "0.05",
            "0.30",
            "0.58",
            "0.98",
            "1.50",
            "2.84",
            "",
            "4.76",
            "5.43"
        ],
        [
            "Water intake, lb/d",
            "A",
            "2.11",
            "2.31",
            "3.15",
            "3.87",
            "5.34",
            "9.53",
            "",
            "16.00",
            "18.50"
        ],
        [
            "Total DMI, lb/d",
            "B",
            "1.55",
            "1.67",
            "1.92",
            "2.23",
            "2.33",
            "3.81",
            "",
            "4.68",
            "5.47"
        ],
        [
            "Starer intake, lb/d",
            "B",
            "0.05",
            "0.17",
            "0,40",
            "0.71",
            "1.19",
            "2.67",
            "",
            "4.68",
            "5.47"
        ],
        [
            "Water intake, lb/d",
            "B",
            "2.84",
            "2.82",
            "3.48",
            "4.07",
            "5.65",
            "10.08",
            "",
            "16.68",
            "19.32"
        ]
    ],
    "pageTitle": "Water intake by dairy calves during the summer months | Dairy Herd Management",
    "title": "",
    "url": "http://www.dairyherd.com/dairy-news/Water-intake-by-dairy-calves-during-the-summer-months-264574821.html?source=related",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 390564923,
    "recordOffset": 390547598,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{2232=More recently, SROC revisited this work by offering restricted or free choice water in the pre-weaning period during the summer months (Manthey et al., 2011). Calves on the restricted treatment were offered no water for 35 days then 5 pounds daily from day 36 to weaning at 42 days. Both groups were fed water free choice after weaning. Calves were individually fed a 20:20 milk replacer (12.5% solids) twice daily for 35 days and once daily from day 36 to weaning at 42 days. A 18% texturized calf starter was offered free choice from days 1 to 56. Figure 1 depicts study results. Water intake and dry matter intake (DMI) increased in both groups from day 35. Contrary to the previous work, there were no differences in DMI and calf performance pre- and post-weaning. There were no differences in scouring days and health costs., 1384=Preliminary information from recent SROC study from April to July (Strayer, 2014) evaluated water and DMI when calves were fed a 24:20 milk replacer at 0.62 pounds in 4.25 pounds water (A) or 1.56 pounds in 5.3 pounds water (B) twice daily for 35 days and once daily from day 36 to weaning at 42 days. Both milk replacers were fed with 14.7% solids. A 18% texturized calf starter was offered free choice from days 1 to 56. Table 1 summarizes calf performance. Water intake increased as DMI increased, especially from day 35 onward. Calves fed higher milk replacer levels had lower starter intakes. Calves gained well and had good frame growth. Number of scouring days were lower than in previous summer studies., 175=Table 1. Daily feed DM and water intake by calves fed a 24:20 milk replacer at 1.25 (A) or 1.5 lb/d (B) at 14.7% solids with a 18% texturized calf starter.}",
    "lastModified": "Fri, 31 Jul 2015 11:12:34 GMT",
    "textBeforeTable": "Table 1. Daily feed DM and water intake by calves fed a 24:20 milk replacer at 1.25 (A) or 1.5 lb/d (B) at 14.7% solids with a 18% texturized calf starter. Managing calves during the summer requires attention to a number of factors. Water availability is important for calf health and does impact feed intake and growth, especially when milk feeding is reduced or the calves are weaned. Take home message Preliminary information from recent SROC study from April to July (Strayer, 2014) evaluated water and DMI when calves were fed a 24:20 milk replacer at 0.62 pounds in 4.25 pounds water (A) or 1.56 pounds in 5.3 pounds water (B) twice daily for 35 days and once daily from day 36 to weaning at 42 days. Both milk replacers were fed with 14.7% solids. A 18% texturized calf starter was offered free choice from days 1 to 56. Table 1 summarizes calf performance. Water intake increased as DMI increased, especially from day 35 onward. Calves fed higher milk replacer levels had lower starter intakes. Calves gained well and had good frame growth. Number of scouring days were lower than in previous summer studies. More recently, SROC revisited this work by offering restricted or free choice water in the pre-weaning period during the summer months (Manthey et al., 2011). Calves on the restricted treatment were offered no water for 35 days then 5 pounds daily from day 36 to weaning at 42 days.",
    "textAfterTable": "Related Articles USDEC: Down cycles of global dairy markets teach persistence May-June MPP-Dairy margin is $7.995/cwt. Access to China key factor in maintaining meat export growth About the Author: Hugh Chester-Jones, Professor Southern Research & Outreach Center, University of Minnesota",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}