{
    "relation": [
        [
            "",
            "CUDA Cores",
            "Core (MHz)",
            "Perf. (TFLOP)",
            "Memory",
            "Memory Rate",
            "Memory Width",
            "Architecture",
            "Process Node",
            "DirectX Version"
        ],
        [
            "GTX 980M",
            "1536",
            "1038",
            "3.189",
            "Up to 4GB",
            "2500 MHz",
            "256-bit",
            "Maxwell",
            "28nm",
            "12.0"
        ],
        [
            "GTX 970M",
            "1280",
            "924",
            "2.365",
            "Up to 3GB",
            "2500 MHz",
            "192-bit",
            "Maxwell",
            "28nm",
            "12.0"
        ],
        [
            "GTX 980 (Desktop)",
            "2048",
            "1126",
            "4.612",
            "4GB",
            "7.0 (GT/s)",
            "256-bit",
            "Maxwell",
            "28nm",
            "12.0"
        ],
        [
            "GTX 970 (Desktop)",
            "1664",
            "1050",
            "3.494",
            "4GB",
            "7.0 (GT/s)",
            "256-bit",
            "Maxwell",
            "28nm",
            "12.0"
        ],
        [
            "GTX 880M (Laptop)",
            "1536",
            "954",
            "2.930",
            "4GB/8GB",
            "2500 MHz",
            "256-bit",
            "Kepler",
            "28nm",
            "11.0"
        ]
    ],
    "pageTitle": "Reviews | PC Perspective",
    "title": "",
    "url": "http://www.pcper.com/reviews?page=9&pcper_ajax_tabs_block_tab=0&args=",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987171.38/warc/CC-MAIN-20150728002307-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 647452651,
    "recordOffset": 647409750,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{52295=For VXGI, DSR, and MFAA, please see Ryan's discussion for the desktop Maxwell launch. Information about these features is basically identical to what was given in September., 20224=•    80Plus Platinum certified super high efficiency •    Ultra tight voltage regulation •    Fully Modular Cable design with flat ribbon-style cables •    Seasonic DC Connector Panel with integrated VRMs •    DC to DC Converter design •    Hybrid Silent Fan Control (3 modes of operation: Fanless, Silent and Cooling) •    High-quality Sanyo Denki San Ace dual ball bearing fan with PWM •    Ultra-tight voltage regulation (+2% and -0% +12V rail) •    Dual copper conduction bars on PCB for improved efficiency and performance •    Supports multi-GPU technologies •    Conductive polymer aluminum solid capacitors •    High reliability 105°C Japanese made electrolytic capacitors •    ErP Lot 6 2013 compliant and Intel Haswell processor ready •    High current Gold plated terminals with Easy Swap connectors •    Active PFC (0.99 PF typical) with Universal AC input •    7-Year manufacturer's warranty worldwide, 2894=The X99 Classified motherboard is EVGA's premier product offering for their Intel X99 chipset motherboard line. The board supports the Intel LGA2011-3 based processors along with DDR4 memory in a quad channel configuration. The X99 Classified board is a synthesis product for EVGA with all of the innovations from previous boards integrated for a superior offering. A premium product like this comes at a premium price point with an MSRP of $399.99., 27496=Our performance preview today will look at the water block itself, installation, performance and temperature control. Keep in mind that this is a very early prototype, the first one to make its way to US shores. There will definitely be some changes and updates (in both the hardware and the software support for overclocking) before final release in mid to late October. Should you consider this ~$150 Hydro Copper water block for your GTX 980?, 46755=In what can most definitely be called the best surprise of the fall game release schedule, the open-world action game set in the Lord of the Rings world, Middle-earth: Shadow of Mordor has been receiving impressive reviews from gamers and the media. (GiantBomb.com has a great look at it if you are new to the title.) What also might be a surprise to some is that the PC version of the game can be quite demanding on even the latest PC hardware, pulling in frame rates only in the low-60s at 2560x1440 with its top quality presets.}",
    "TableContextTimeStampAfterTable": "{46963=EVGA was founded in 1999 with headquarters in Brea, California. They continue to specialize in producing NVIDIA based graphics adapters and Intel based motherboards and keep expanding their PC power supply product line, which now includes seventeen models ranging from the high-end SuperNOVA 1600 G2 to the budget minded EVGA 430W power supply., 5386=Here they come - the G-Sync monitors are finally arriving at our doors! A little over a month ago we got to review the ASUS ROG Swift PG278Q, a 2560x1440 144 Hz monitor that was the first retail-ready display to bring NVIDIA's variable refresh technology to consumers. It was a great first option with a high refresh rate along with support for ULMB (ultra low motion blur) technology, giving users a shot at either option., 48521=EVGA SuperNOVA 1200 P2 PSU Key Features:, 47897=Here is what EVGA has to say about the new SuperNOVA P2 Gold PSUs: “Introducing the EVGA SuperNOVA 1200 P2 power supply. This power supply raises the bar with 1200W of continuous power delivery and 92% (115 VAC) / 94% (220~240 VAC) efficiency. A fully modular design reduces case clutter and 100% Japanese Capacitors ensure that only the absolute best components are used. What does that mean? The best stability, reliability, overclockability and unparalleled control. The EVGA SuperNOVA 1200 P2 is the ultimate tool to eliminate all system bottlenecks and achieve unrivaled performance.\", 20704=You might have seen what looks like similar issues before, but after much research and testing, I can say with some confidence that this is a completely different and unique issue. The old X25-M bug was the result of random writes to the drive over time, but the above result is from a drive that only ever saw a single large file write to a clean drive. The above drive was the very same 500GB 840 EVO sample used in our prior review. It did just fine in that review, and at afterwards I needed a quick temporary place to put a HDD image file and just happened to grab that EVO. The file was written to the drive in December of 2013, and if it wasn't already apparent from the above HDTach pass, it was 442GB in size. This brings on some questions:, 48599=•    10-Year Warranty and unparalleled EVGA Customer Support •    80PLUS Platinum certified, with up to 92~94% efficiency under typical loads •    Tight voltage regulation (2%), stable power with low AC ripple and noise •    Highest quality Japanese brand capacitors ensure long-term reliability •    Fully modular cables to reduce clutter and improve airflow •    Quiet dual-ball bearing fan for exceptional reliability and quiet operation •    ECO Intelligent Thermal Control allows silent, fan-less operation at low power •    NVIDIA SLI and AMD Crossfire Ready •    Intel 4th Generation CPU Ready (Haswell, C6/C7 idle modes) •    Compliance with ErP Lot 6 2013 Requirement •    Active Power Factor correction (0.99) with Universal AC input •    Heavy-duty Protections: OVP, UVP, OCP, OPP, and SCP •    MSRP for the 1000 P2 PSU : $219.99 USD (181.99 after mail-in rebate, Amazon.com) •    MSRP for the 1200 P2 PSU : $269.99 USD ($225.99 after mail-in rebate, Amazon.com), 5952=Today we are taking a look at our second G-Sync monitor that will hit streets sometime in mid-October with an identical $799 price point. The Acer XB280HK is a 28-in 4K monitor with a maximum refresh rate of 60 Hz and of course, support for NVIDIA G-Sync., 41178=ECS hosted a press event in the third week of August to unveil its new product lineup and corporate direction. The press event, named \"Live, Liva, Lead, L337\", lays out the important aspects of the \"new ECS\" and its intended market direction. They introduced the LIVA mini computer with integrated 32GB and 64GB integrated SSDs, their Z97-based product line-up, and the North America LIVA design contest., 47784=In this review we will be taking a detailed look at the EVGA SuperNOVA 1200 P2 power supply., 6386=The Acer XB280HK, first announced at Computex in June, is the first 4K monitor on the market to be announced with support for variable refresh. It isn't that far behind the first low-cost 4K monitors to hit the market, period: the ASUS PB287Q and the Samsung U28D590D both shipped in May of 2014 with very similar feature sets, minus G-Sync. I discussed much of the general usability benefits (and issues) that arose when using a consumer 4K panel with Windows 8.1 in those reviews, so you'll want to be sure you read up on that in addition to the discussion of 4K + G-Sync we'll have today., 49881=Please continue reading our review of the EVGA SuperNOVA 1200 P2 Platinum PSU!!!, 46228=EVGA continues to raise the bar with the introduction of two new power supplies in their popular SuperNOVA line, the 1000 P2 and 1200 P2. Both new power supplies are 80Plus Platinum certified and feature all modular cables, high-quality Japanese brand capacitors, a single high-power +12V rail, and a 140mm dual ball bearing cooling fan (with the ability to operate in silent, fan-less mode at low power levels). The 1000 P2 and 1200 P2 are also backed by a 10-year warranty (with registration). And last but not least, many PC PSU enthusiasts will be happy to know the new 1000 P2 and 1200 P2 are being supplied by Super Flower; the same OEM that EVGA has been using for many of their higher output, premium PSUs!}",
    "lastModified": "Thu, 30 Jul 2015 10:24:39 GMT",
    "textBeforeTable": "The full specifications are: First, the parts. Two products have been announced: The GeForce GTX 980M and the GeForce GTX 970M. Both are based on the 28nm Maxwell architecture. In terms of shading performance, the GTX 980M has a theoretical maximum of 3.189 TFLOPs, and the GTX 970M is calculated at 2.365 TFLOPs (at base clock). On the desktop, this is very close to the GeForce GTX 770 and the GeForce GTX 760 Ti, respectively. This metric is most useful when you're compute bandwidth-bound, at high resolution with complex shaders. If there is one message that I get from NVIDIA's GeForce GTX 900M-series announcement, it is that laptop gaming is a first-class citizen in their product stack. Before even mentioning the products, the company provided relative performance differences between high-end desktops and laptops. Most of the rest of the slide deck is showing feature-parity with the desktop GTX 900-series, and a discussion about battery life. gaming laptop geforce, GTX 970M, GTX 980M, maxwell, nvidia, Tagged: NVIDIA Manufacturer: Mobile Systems, Graphics Cards, Subject: October 7, 2014 Date: Scott Michaud Author: NVIDIA Announces GTX Maxwell",
    "textAfterTable": "As for the features, it should be familiar for those paying attention to both desktop 900-series and the laptop 800M-series product launches. From desktop Maxwell, the 900M-series is getting VXGI, Dynamic Super Resolution, and Multi-Frame Sampled AA (MFAA). From the latest generation of Kepler laptops, the new GPUs are getting an updated BatteryBoost technology. From the rest of the GeForce ecosystem, they will also get GeForce Experience, ShadowPlay, and so forth. For VXGI, DSR, and MFAA, please see Ryan's discussion for the desktop Maxwell launch. Information about these features is basically identical to what was given in September. BatteryBoost, on the other hand, is a bit different. NVIDIA claims that the biggest change is just raw performance and efficiency, giving you more headroom to throttle. Perhaps more interesting though, is that GeForce Experience will allow separate one-click optimizations for both plugged-in and battery use cases. The power efficiency demonstrated with the Maxwell GPU in Ryan's original GeForce GTX 980 and GTX 970 review is even more beneficial for the notebook market where thermal designs are physically constrained. Longer battery life, as well as thinner and lighter gaming notebooks, will see tremendous advantages using a GPU that can run at near peak performance on the maximum power output of an integrated battery. In NVIDIA's presentation, they mention that while notebooks on AC power can use as much as 230",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}