{
    "relation": [
        [
            "S",
            "",
            "5",
            "12",
            "19",
            "26"
        ],
        [
            "M",
            "",
            "6",
            "13",
            "20",
            "27"
        ],
        [
            "T",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "W",
            "1",
            "8",
            "15",
            "22",
            "29"
        ],
        [
            "T",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "F",
            "3",
            "10",
            "17",
            "24",
            "31"
        ],
        [
            "S",
            "4",
            "11",
            "18",
            "25",
            ""
        ]
    ],
    "pageTitle": "West Seattle Herald / White Center News",
    "title": "",
    "url": "http://www.westseattleherald.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988065.26/warc/CC-MAIN-20150728002308-00174-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 834344927,
    "recordOffset": 834328829,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4601=These awards are part of the Small and Simple Projects Fund, one of three funds offered by Seattle Department of Neighborhoods. It provides cash awards of up to $25,000 in matching funds to community organizations committed to fostering and building a better community. The 2015 June awards range from $4,000 to $25,000, and the organizations pledge to match the City’s $467,562 investment with $600,132 of locally raised money, donated materials and volunteer labor., 10398=US Navy Blue Angels technicians will offer a free hour-long presentation and audience Q&A on Friday, July 31 as South Seattle College. The roughly hour long event starts at 8:30am., 2380=The annual Seattle Chinese Garden Kite Festival returns Aug. 1 from 2pm to 6pm.}",
    "lastModified": "Fri, 31 Jul 2015 09:19:18 +0000",
    "textBeforeTable": "»   July «   Events More › Bring your own or buy one at the festival for a fun afternoon with family or friends. Activities for all ages include kite flying demonstrations, displays, kite painting for children, entertainment in the courtyard, and refreshment booth. The annual Seattle Chinese Garden Kite Festival returns Aug. 1 from 2pm to 6pm. Jul 26, 2015 Seattle Chinese Garden Kite Festival will put on a display Aug. 1 Sandy Marvinney News More › These awards are part of the Small",
    "textAfterTable": "Most Read Articles Burien man sought by U.S. Marshalls for shooting on Ambaum Genuine entertainment at ArtsWest Theatre’s After Hours with Mathew Wright Duwamish Tribe denied federal recognition It's West Seattle Garden Tour day July 19 Signs in Lincoln and Schmitz Park ask that you preserve the forest floor Chicken Coop & Urban Farm",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}