{
    "relation": [
        [
            "Date",
            "Dec 10, 2009",
            "Feb 3, 2010",
            "May 4, 2012",
            "Nov 26, 2012",
            "Jun 23, 2014",
            "Aug 22, 2014",
            "Aug 27, 2014",
            "Oct 23, 2014",
            "Nov 6, 2014",
            "Dec 9, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: PHIBRO-TECH, INC., NEW JERSEY Free format text: RELEASE OF SECURITY INTEREST IN PATENTS;ASSIGNOR:WELLS FARGO FOOTHILL, INC.;REEL/FRAME:023627/0807 Effective date: 20091006",
            "Owner name: OSMOSE, INC,NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:PHIBROTECH, INC.;PHIBROWOOD, LLC;REEL/FRAME:023937/0585 Effective date: 20091006 Owner name: OSMOSE, INC, NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:PHIBROTECH, INC.;PHIBROWOOD, LLC;REEL/FRAME:023937/0585 Effective date: 20091006",
            "Owner name: CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH, AS COLLAT Free format text: INTELLECTUAL PROPERTY SECURITY AGREEMENT;ASSIGNOR:OSMOSE, INC. (FORMERLY OSMOSE WOOD PRESERVING, INC.);REEL/FRAME:028158/0611 Effective date: 20120504",
            "Owner name: CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH, AS COLLAT Free format text: INTELLECTUAL PROPERTY SECURITY AGREEMENT;ASSIGNOR:OSMOSE, INC.;REEL/FRAME:029351/0791 Effective date: 20121126",
            "Owner name: PHIBRO-TECH, INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:RICHARDSON, H. WAYNE;HODGE, ROBERT L.;REEL/FRAME:033217/0227 Effective date: 20041201",
            "Owner name: WELLS FARGO BANK, NATIONAL ASSOCIATION, NEW YORK Free format text: PATENT, TRADEMARK AND COPYRIGHT SECURITY AGREEMENT;ASSIGNORS:KOPPERS INC.;KOPPERS HOLDINGS INC.;KOPPERS DELAWARE, INC.;AND OTHERS;REEL/FRAME:033591/0020 Effective date: 20140815",
            "Owner name: OSMOSE, INC., NEW YORK Free format text: RELEASE OF SECURITY INTERST IN INTELLECTUAL PROPERTY;ASSIGNOR:CREDIT SUISSE AG, CAYMAN ISLANDS BRANCH, AS COLLATERAL AGENT;REEL/FRAME:033645/0778 Effective date: 20140815 Owner name: OSMOSE, INC. (FORMERLY OSMOSE WOOD PRESERVING, INC Free format text: RELEASE OF SECURITY INTEREST IN INTELLECTUAL PROPERTY;ASSIGNOR:CREDIT SUISSE AG, CAYMAND ISLANDS BRANCH, AS COLLATERAL AGENT;REEL/FRAME:033645/0796 Effective date: 20140815",
            "Owner name: KOPPERS PERFORMANCE CHEMICALS INC, PENNSYLVANIA Free format text: CHANGE OF NAME;ASSIGNOR:OSMOSE, INC.;REEL/FRAME:034036/0363 Effective date: 20140915",
            "Owner name: PHIBROWOOD, LLC, NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PHIBRO-TECH, INC.;REEL/FRAME:034119/0675 Effective date: 20081023",
            "Owner name: KOPPERS PERFORMANCE CHEMICALS INC., PENNSYLVANIA Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE REMOVE PATENT NUMBER 8221797 PREVIOUSLY RECORDED AT REEL: 034036 FRAME: 0363. ASSIGNOR(S) HEREBY CONFIRMS THE CHANGE OF NAME;ASSIGNOR:OSMOSE, INC.;REEL/FRAME:034563/0407 Effective date: 20140915"
        ]
    ],
    "pageTitle": "Patent US8158208 - Method of preserving wood by injecting particulate wood preservative slurry - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8158208?dq=%E2%80%9Cconfiguration+using+structure+and+rules+to+provide+a+user+interface.%E2%80%9D",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 13,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462407631,
    "recordOffset": 462324880,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{102302=Additionally or alternatively, the surface active agent may include, but is not limited to, alkyl grafted PVP copolymers commercially available as GANEX™ and/or the AGRIMER™ AL or WP series, PVP-vinyl acetate copolymers commercially available as the AGRIMER™ VA series, lignin sulfonate commercially available as REAX 85A (e.g., with a molecular weight of about 10,000), tristyryl phenyl ethoxylated phosphoric acid/salt commercially available as SOPROPHOR™ 3D33, GEROPON™ SS 075, calcium dodecylbenzene sulfonate commercially available as NINATE™ 401 A, IGEPAL™ CO 630, other oligomeric/polymeric sulfonated surfactants such as Polyfon H (molecular weight ˜4300, sulfonation index ˜0.7, salt content ˜4%), Polyfon T (molecular weight ˜2900, sulfonation index ˜2.0, salt content ˜8.6%), Polyfon O (molecular weight ˜2400, sulfonation index ˜1.2, salt content ˜5%), Polyfon F (molecular weight ˜2900, sulfonation index ˜3.3, salt content ˜12.7%), Reax 88B (molecular weight ˜3100, sulfonation index ˜2.9, salt content ˜8.6%), Reax 100 M (molecular weight ˜2000, sulfonation index ˜3.4, salt content ˜6.5%), and Reax 825 E (molecular weight ˜3700, sulfonation index ˜3.4, salt content ˜5.4%), and the like., 81329=Copper hydroxide is not particularly stable. Hydroxides can be changed to oxides by for example in a quick and exothermic reaction by exposure of the copper hydroxide particles to aqueous solution of glucose. Copper hydroxide may react with air, sugars, or other compounds to partially or completely form copper oxide. The conditions for conversion are highly favored during kiln-drying treated wood, which contains gluconuuronic acids, which are sugar-like molecules, and heat and a dehydrating condition. However, as taught by U.S. Pat. No. 3,231,464, the disclosure of which is incorporated herein by reference thereto, the presence of magnesium or magnesium and zinc can help stabilize cupric hydroxide from converting to copper oxide via the loss of a water molecule. The preferred copper hydroxide particles used in this invention are stabilized. U.S. Pat. No. 3,231,464 teaches stabilizing the copper hydroxide with added magnesium zinc, or both, at a Cu:Mg and/or Cu:Zn weight ratio of 8:1. Copper hydroxide prepared in a manner so as to contain significant magnesium and/or zinc hydroxides are more stable and resistant to degradation to copper oxides. The preferred copper hydroxide particles comprise between 50% and 90 copper hydroxide, with the remainder comprising zinc hydroxide, magnesium hydroxide, or both., 204213=In contrast, five samples of particulate copper salts made following standard procedures known in the art were milled according to the method of this invention. The first two samples were copper hydroxide—one with an initial particle size d50 of <0.2 microns (the material of comparative example A), and the second with an initial d50 of 2.5 microns. A basic copper carbonate (BCC) salt was prepared and it had an initial d50 of 3.4 microns. A tribasic copper sulfate salt was prepared and this material has a d50 of 6.2 micron. Finally, a copper oxychloride (COc) sample was prepared and this material has an initial d50 of 3.3 microns. Selected surface active agents were added to each slurry, and the initial slurries were each in turn loaded into a ball mill having 0.5 mm zirconium silicate (density 3.8 grams/cm3) at about 50% of mill volume, and milled at about 2600 rpm for about a half an hour. The particle size distribution of the milled material was then determined. The particle size distribution data is shown in Table 1. It can be seen that even with the relatively modest zirconium silicate milling media, injectable compositions were obtained in about 30 minutes milling time or less., 109608=Wet milling can be done in a sand grinder charged with for example partially stabilized zirconia beads with diameter 0.5 mm; alternately wet milling in a rotary sand grinder with partially stabilized zirconia beads with diameter 0.5 mm and with stirring at for example 1000 rpm; or by use of a wet-ball mill, an attritor (e.g., manufactured by Mitsui Mining Ltd.), a perl mill (e.g., manufactured by Ashizawa Ltd.), or the like. Modifications of the above processes are within the skill of one of ordinary skill in the art, and such modifications will not be described here., 23160=The primary preserved wood product has historically been southern pine lumber treated with chromated copper arsenate (CCA). Most of this treated lumber was used for decks, fencing and landscape timbers. There has recently been raised concerns about the safety and health effects of CCA as a wood preservative, primarily relating to the arsenic content but also to the chromium content. In 2003/2004, due in part to regulatory guidelines and to concerns about safety, there has been a substantial cessation of use of CCA-treated products. A new generation of copper containing wood preservatives use a form of copper that is soluble. Known preservatives include copper alkanolamine complexes, copper polyaspartic acid complex, alkaline copper quaternary, copper azole, copper boron azole, copper bis(dimethyldithiocarbamate), ammoniacal copper citrate, copper citrate, and the copper ethanolamine carbonate. In practice the principal criteria for commercial acceptance, assuming treatment efficacy, is cost. Of the many copper-amine compositions listed above, only the copper ethanolamine carbonate and ammoniacal copper are in widespread use. There are several problems with these new copper-amine-containing preservatives., 30333=A fifth embodiment of this invention is an effective, long-lasting, environmentally responsible, non-staining/coloring, inexpensive, non-corrosion-inducing, injectable, substantially insoluble solid organic biocide-containing particulate preservative treatment for wood and wood products that is substantially free of hazardous material. A sixth embodiment of this invention is an effective, long-lasting, inexpensive, non-corrosion-inducing, sub-micron-sized, substantially insoluble solid organic biocide-containing particulate for use in non-fouling paints and coatings, and for use in foliar applications. As used herein, the term “organic biocide” also includes organometallic biocides. By “substantially insoluble” (or “sparingly soluble” as the term relates to organic biocides), we mean the organic biocide has a solubility in water of less than about 0.1%, and most preferably less than about 0.01%, for example in an amount of between about 0.005 ppm and about 1000 ppm, alternatively between about 0.1 ppm and about 100 ppm or between about 0.01 ppm and about 200 ppm., 20940=This is a Continuation Application of U.S. application Ser. No. 10/961,206, filed Oct. 12, 2004, now abandoned, which claims the benefit of U.S. Provisional Application No. 60/571,535, filed May 17, 2004, and U.S. Provisional Application No. 60/616,646, filed Oct. 8, 2004, all of which are herein incorporated by reference in their entireties., 157405=In one embodiment the slurry comprises between 50 and 800 ppm of one or more scale precipitation inhibitors, particularly organophosphonates. Alternately or additionally the slurry may contain between about 50 and about 2000 ppm of one or more chelators. Both of these additives are meant to inhibit precipitation of salts such as calcium carbonate and the like, where the source of calcium may be from the water used to make up the slurry. The preferred inhibitors are hydroxyethylidene diphosphonic acid (HEDP), diethylenetriamine-pentamethylenephosphonic acid (DTPMP), and/or 2-phosphonobutane-1,2,4-tricarboxylic acid (PBTC). If the preservative is in a slurry concentrate, the slurry should comprise between 10 mmoles and 100 mmoles/L of HEDP, or between 30 mmoles and 170 mmoles/L of PBTC or DTPMP. Mixtures of inhibitors are preferred, as concentrates may have more inhibitor than can readily be solubilized therein. If the preservative is in a solid form, the preservative should comprise between about 0.1 to about 1 mole HEDP per kg of particulates, or between about 0.17 to about 2 mole PBTC and/or DTPMP per kg of particulates., 92799=A first aspect of the invention is a method of preparing a submicron biocide product comprising the steps of: 1) providing the solid biocide in particle form to a ball mill, providing a liquid to a mill, and providing a milling media to the mill, wherein the milling media comprises at least 5%, preferably at least 10%, more preferably at least 25% by weight of the milling media having a particle diameter between 0.1 to 0.8 mm, preferably between 0.3 and 0.7 mm, and having a density equal to or greater than 3.8 g/cm3, preferably equal to or greater than 5.5 g/cm3; and 2) milling the material for a time sufficient to obtain a product having a mean volume particle diameter d50 of about 1 micron or smaller. The mill speed is advantageously fast, for example from 1000 rpm to about 4000 rpm, and the milling time is preferably between 10 minutes and 240 minutes., 156581=It may be advantageous to add basic alkali phosphate, basic alkali borate, or the monoacid forms thereof, or any combinations thereof, to the liquid carrier to increase the pH and provide some buffering capacity. The slurry is beneficially buffered, by for example adding phosphate at 5 ppm to 500 ppm. The higher concentrations of phosphates may be beneficial if the particulates do not have any coatings formed thereon, as the soluble phosphate ions will discourage dissolution of the copper salts from the particulates into the liquid carrier. Soluble borates can be added in an amount from about 5 ppm to about 2000 ppm in the slurry, where less than 5 ppm has little effect and more than 2000 ppm is cost-prohibitive. Borates have both a biocidal activity and a fire-retardant activity., 201497=For the higher density 0.5 mm zirconia milling media, a composition with a d50 less than 1 micron and a d95 less than 1 micron was obtainable in 90 minutes, and a composition with a d50 less than 0.3 microns and a d95 less than 0.4 microns was obtainable in 6 hours. The product obtained after 90 minutes of milling represents an increase in number of particles per unit of mass by a factor of more than about 30 over the standard products, but the product obtained after 90 minutes of milling represents an increase in number of particles per unit of mass by a factor of more than about 1000 over the standard products. The higher surface areas associated with the smaller particles should give rise to a product with enhanced bioactivity due to an increase in reservoir activity (ability to deliver chlorothalonil to the infection court)., 87559=The milling media, also called grinding media or milling beads, is central to this invention. The selection of milling media is expressly not a routine optimization. The use of this media allows an average particle size and a narrow particle size distribution that had previously not been obtainable in the art, nor did the results in the prior art allow one to predict the unexpected results we obtained. A major contribution of this invention is a method of preparing a particulate biocide product having a d50 equal to or less than about 1 micron, comprising the steps of: 1) providing the solid inorganic or organic biocide, and a liquid comprising a surface active agent, to a mill; providing a milling media comprising an effective amount of milling beads having a diameter between 0.1 mm and 0.8 mm, preferably between about 0.2 mm and about 0.7 mm, more preferably between about 0.3 mm and about 0.6 mm, wherein these milling beads have a density greater than about 3 grams/cm3, preferably equal to or greater than 3.5 grams/cm3, more preferably equal to or greater than 3.8 grams/cm3, most preferably equal to or greater than 5.5 grams/cm3, for example a zirconia bead having a density of about 6 grams/cm3; and 2) wet milling the material at high speed, for example between 300 and 6000 rpm, more preferably between 1000 and 4000 rpm, for example between about 2000 and 3600 rpm, where milling speed is provided for a laboratory scale ball mill, for a time sufficient to obtain a product having a mean volume particle diameter of about 1 micron or smaller, for example between about 5 minutes and 300 minutes, preferably from about 10 minutes to about 240 minutes, and most preferably from about 15 minutes to about 60 minutes. As little as 5% by volume of the milling media need be within the preferred specifications for milling some materials, but better results are obtained if greater than 10% by weight, preferably greater than 25% by weight, for example between 40% and 100% by weight of the milling material is within the preferred specifications. For milling material outside the preferred specifications, advantageously this material has a density greater than 3 grams/cm3 and a diameter less than 4 mm, for example 1 or 2 mm zirconia or zirconium silicate milling beads., 104405=Other examples of commercially available surface active agents include Atlox 4991 and 4913 surfactants (Uniqema), Morwet D425 surfactant (Witco), Pluronic P105 surfactant (BASF), Iconol TDA-6 surfactant (BASF), Kraftsperse 25M surfactant (Westvaco), Nipol 2782 surfactant (Stepan), Soprophor FL surfactant (Rhone-Poulenc), Empicol LX 28 surfactant (Albright & Wilson), Pluronic F108 (BASF).}",
    "textBeforeTable": "Patent Citations particulates 1.17:1  1.4:1 3% TEB and copper oxychloride I particulates 0.88:1 0.96:1 3% TEB and tribasic copper sulfate H with phosphate coating particulates modified 0.88:1  1.0:1 5% TEB and copper hydroxide G and Mg particulates 0.19:1  0.2:1 3% TEB and copper hydroxide with Zn F 0.63:1 0.77:1 basic copper carbonate particulates E sodium bicarbonate buffer particulates with 0.46:1 0.54:1 3% TEB and basic copper carbonate D (comparative) 3.85:1  5.2:1 3% TEB and copper MEA carbonate C particulates 0.51:1 0.67:1 3% TEB and basic copper carbonate A to",
    "textAfterTable": "US4339617 Mar 9, 1981 Jul 13, 1982 Uop Inc. Hydration of olefins in the presence of a corrosion inhibitor US4404169 Nov 18, 1982 Sep 13, 1983 Norddeutsche Affinerie Ag Process for producing cupric hydroxide US4456486 Sep 22, 1982 Jun 26, 1984 Merck Patent Gesellschaft Mit Beschrankter Haftung Yellow nacreous pigments having calcined CR oxide and phosphate layer for improved light-fastness, process and use US4507152 Dec 2, 1983 Mar 26, 1985 Mooney Chemicals, Inc. Fungicidal and insecticidal compositions for treating wood US4539047 Apr 12, 1984 Sep 3, 1985 Desoto, Inc. Clear coatings to protect wood from discoloring and greying on exterior exposure US4596694 Jan 18, 1985 Jun 24, 1986 Kelsey-Hayes Company Method for hot consolidating materials US4597730 Jan 16, 1985 Jul 1, 1986 Kelsey-Hayes Company Assembly for hot consolidating materials US4622248 May 22, 1985 Nov 11, 1986 Osmose Wood Preserving Co. Of America, Inc. Preservative composition for wood",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}