{
    "relation": [
        [
            "Cited Patent",
            "US3359462 *",
            "US3758830 *",
            "US3801949 *",
            "US3881181 *",
            "US3975951 *",
            "US3992940 *",
            "US4011745 *",
            "US4071838 *",
            "US4074566 *",
            "US4129848 *",
            "US4134095 *",
            "US4182937 *",
            "US4229979 *",
            "US4244225 *",
            "US4293373 *",
            "US4305298 *",
            "US4332000 *",
            "US4343768 *",
            "US4471647 *",
            "GB814147A *"
        ],
        [
            "Filing date",
            "Aug 2, 1965",
            "Apr 10, 1972",
            "Mar 8, 1973",
            "Feb 22, 1973",
            "Mar 20, 1975",
            "Nov 2, 1973",
            "Nov 7, 1975",
            "Feb 9, 1976",
            "Oct 26, 1976",
            "Jul 5, 1977",
            "Dec 5, 1977",
            "Sep 21, 1978",
            "May 29, 1979",
            "Jun 8, 1979",
            "Feb 26, 1980",
            "Jun 8, 1979",
            "Oct 3, 1980",
            "Jul 23, 1980",
            "Mar 22, 1982",
            ""
        ],
        [
            "Publication date",
            "Dec 19, 1967",
            "Sep 11, 1973",
            "Apr 2, 1974",
            "Apr 29, 1975",
            "Aug 24, 1976",
            "Nov 23, 1976",
            "Mar 15, 1977",
            "Jan 31, 1978",
            "Feb 21, 1978",
            "Dec 12, 1978",
            "Jan 9, 1979",
            "Jan 8, 1980",
            "Oct 28, 1980",
            "Jan 13, 1981",
            "Oct 6, 1981",
            "Dec 15, 1981",
            "May 25, 1982",
            "Aug 10, 1982",
            "Sep 18, 1984",
            ""
        ],
        [
            "Applicant",
            "Telefunken Patent",
            "Hewlett Packard Co",
            "Rca Corp",
            "Rca Corp",
            "Nippon Soken, Inc.",
            "Chrysler Corporation",
            "Massachusetts Institute Of Technology",
            "Diax Corporation",
            "Nippon Soken, Inc.",
            "Raytheon Company",
            "The Bendix Corporation",
            "International Standard Electric Corp.",
            "International Standard Electric Corporation",
            "Itt Industries, Inc.",
            "International Standard Electric Corporation",
            "Itt Industries, Inc.",
            "International Business Machines Corporation",
            "Ricoh Co., Ltd.",
            "Board Of Regents Of Stanford University",
            ""
        ],
        [
            "Title",
            "Electrical circuit device",
            "Transducer formed in peripherally supported thin semiconductor web",
            "Thermal detector and method of making the same",
            "Semiconductor temperature sensor",
            "Intake-air amount detecting system for an internal combustion engine",
            "Solid state fluid flow sensor",
            "Semiconductor sensors",
            "Solid state force transducer and method of making same",
            "Intake air amount detecting device for an internal combustion engine",
            "Platinum film resistor device",
            "Fast response temperature sensor",
            "Mechanically biased semiconductor strain sensitive microphone",
            "Transducer and method of making the same",
            "Mechanical resonator arrangements",
            "Method of making transducer",
            "Mechanical resonator arrangements",
            "Capacitive pressure transducer",
            "Gas detector",
            "Gas chromatography system and detector and method",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US4651564 - Semiconductor device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4651564?dq=6,563,928",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00087-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483727707,
    "recordOffset": 483679827,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{84549=A standard temperature sensor in the industry has an electrical impedance of 100 ohms. However, for the purpose of the present invention, such a low sensor resistance is less desirable than the higher 600 to 1000 ohm preferred sensor element resistance at 25 degrees centigrade obtained with the approximately 0.08 micron thickness in the preferred embodiments of the present invention. For example, in processing, it is desirable to obtain a match between the upstream and downstream sensor elements to a precision of about 0.1 percent. This match is easier to determine using the higher preferred sensor resistance values. Moreover, the higher preferred sensor element resistance reduces the unfavorable effect of differences in lead resistance associated with lead configuration on the silicon sensor chip. Further, a smaller current through the higher preferred sensor resistance is required to obtain convenient and precise changes in voltage for small changes in air flow. In addition, small sensor currents avoid substantial self heating of the sensor resistor elements. This is not a severe effect, although self heating modifies the temperature field of the heater resistance element and tends to reduce the temperature sensitivity to air flow in the preferred embodiments. In addition, higher sensor element currents magnify the undesirable effects of any residual no-flow mismatch between sensor resistance elements., 36232=With air flow present, upstream resistor sensor 22 will be cooled by the transportation of heat away from sensor 22 toward heater resistor grid 26, whereas downstream sensor 24 will be heated by transportation of heat toward the sensor from heat resistor grid 26. Consequently, a resistance difference between sensor resistances 22 and 24 will be present with a corresponding difference in voltage drop which is a measure of the air flow. Typical unamplified voltage differences can be as high as 0.1 volt at a 1500 feet per minute flow velocity., 27743=Malin et al (K. Malin and A. Schmitt, \"Mass Flow Meter\", IBM Technical Disclosure Bulletin, Vol. 21, No. 8, January, 1979) disclose a large silicon strip with a diffused central heater resistor element centrally located between upstream and downstream diffused sensor resistor elements. This prior art is an analog of the commercially available hot tube mass flow meter. The upstream sensor element is cooled by air stream transport while the downstream element is heated, and the resulting sensor resistor temperature difference results in a voltage difference across the sensor elements which is a measure of air mass flow., 86375=As has been indicated, for many contemplated applications, the preferred elements in the present invention are the preferred permalloy resistive elements previously described. When laminated within a silicon nitride member such as 32 or 34, the permalloy element is protected from oxidation by air and can be used as a heating element to temperatures in excess of 400 degrees Centigrade. Such a permalloy element has a resistance versus temperature characteristic similar to that of bulk platinum, both permalloy and platinum having a thermal coefficient of resistance (TCR) of about 4000 parts per million at zero degrees Centigrade. However, permalloy has been found superior to platinum for structures in accordance with the present invention. Although platinum is a commonly used material for temperature sensitive resistors, permalloy has the advantage of a resistivity of about twice that of platinum. Further, in thin films, permalloy achieves maximum TCR in the thickness range of about 800 to 1600 angstroms, whereas platinum films must be at least 3500 angstroms thick (permalloy achieves its maximum TCR at a thickness of about 1600 angstroms, but 800 angstroms has been selected as a preferred thickness since resistivity is doubled and the TCR is only slightly less than at 1600 angstroms). Consequently, using a permalloy element 800 angstroms in thickness, the same resistance requires only one-eighth the surface area that would be required for platinum, thus increasing the thermal efficiency of the heating and sensing elements, reducing required surface area, and lowering unit costs., 60656=In the embodiment of FIG. 13, sensors 22C, 24C and heater 26C are each located on an individual member bridging the depression. In this embodiment, the edges of heater 26C are located 0.002 inch (50 microns) from the proximal edges of sensors 22C and 24C; that is, edge 78C of heater 26C is located 0.002 inch (50 microns) from near edge 76C of sensor 22C, and heater 86C is located 0.002 inch (50 microns) from near edge 84C of sensor 24C. Each element 22C, 24C and 26C in this embodiment has an impedance of 1000 ohms and is approximately 135 microns wide and 150 microns long. Each of the three bridges in this embodiment is approximately 0.006 inch wide by 0.012 inch long. Permalloy patches 90C were added to strengthen the members and to make the heat conducting properties at both ends of the bridge substantially identical in view of leads 92C., 71050=The total resistance of the resistive grid element in embodiments such as those in FIGS. 16 and 17 is typically within the range of approximately 500 ohms to approximately 2000 at approximately 25 degrees Centigrade. The resistance of the resistance sections at each end of the total resistance are typically within approximately 20 percent to approximately 40 percent of the total resistance of the resistive element. As with other typical parameters provided in this application, these parameters are illustrative only and are not intended to be limiting., 22798=This application is a continuation of application Ser. No. 431,851, filed Sept. 30, 1982, now abandoned., 49598=A second advantage of the present invention is a more linear dependence of the temperature differential between sensors 22 and 24 over a broad flow range. In the prior art, this temperature difference between sensors as a function of air flow is proportional to the square root of air flow velocity. With this dependence, known as a parabolic response, the change of sensor temperature difference for a given change in air velocity, v, varies as 1/2 (v to the 1/2), and the resulting incremental response to air flow becomes substantially smaller at higher air flow velocities of interest. The resulting incremental response is, consequently, more susceptible to errors caused by noise fluctuations or drifts in associated electronic circuits. The more linear air flow response of the present sensor and the large unamplified signal voltage obtainable over the flow range of interest, for example, from zero to 2000 feet per minute or higher, substantially reduces possible drift errors at high flow velocities. A typical air flow velocity response for the present sensor is shown in FIG. 8, which also compares the performance of the present sensor with that of Huijsing et al., 69780=The entire resistive grid element 26F may be self heated to a temperature of about 200 degrees Centigrade above ambient by connecting leads 102 and 104 to circuitry such as illustrated in FIG. 4. At such a temperature, the total resistance of element 26F would be approximately 2500 ohms. Air flow is typically directed laterally across member 32F, thus cooling the upstream side more than the downstream side. With no air flow, and assuming that the tapped sections are identical, their differential voltage is zero. With air flow, the tapped sections experience a temperature differential which will cause a temperature resistance differential and hence a voltage differential which is the measurable output of the device corresponding to the air flow velocity., 80994=For the embodiments shown, typical dimensions of members such as 32 or 34 are 0.005 inch-0.007 inch wide, 0.010-0.020 inch long, and 0.8-1.2 microns thick. Typical permalloy elements such as elements 22, 24, 26, and 38 have a thickness of approximately 800 angstroms (typically in the range of approximately 800 angstroms to approximately 1600 angstroms) with a preferred composition of 80 percent nickel and 20 percent iron and a resistance value within the range of approximately 200 ohms to at approximately 2000 ohms at room temperature, e.g., at approximately 20-25 degrees Centigrade (at permalloy element temperatures up to approximately 400 degrees Centigrade, resistance values increase by a factor of up to approximately three). Line widths within permalloy grids may be approximately 5 microns with a 5 micron spacing. Depressions such as 30 typically have a 0.005 inch (125 micron) spacing between members such as 32 and 34 and the semiconductor body such as 20, but the spacing can easily vary in the range of approximately 0.001 inch to approximately 0.010 inch. A typical thickness of a semiconductor body or substrate such as 20 is 0.008 inch. (The dimensions provided are illustrative only and are not to be taken as limitations.), 70563=The embodiment shown in FIG. 17 is substantially identical to that in FIG. 16 except that in the embodiment of FIG. 17 the grid lines of resistive grid 26G are oriented perpendicular to the center line of member 32G, and air flow is typically oriented parallel to the center line of member 32G. In the embodiment of FIG. 17, the total resistance is 1420 ohms with the resistance sections tapped by taps 98G and 100G being 420 ohms at each end of the total resistance., 45388=The relatively large sum of average delta T1 and average delta T2, for example, about 50 degrees Centigrade for a flow of about 1700 feet per minute, relative to the very low temperature differences of prior art flow sensors is due to the thermal insulation of heater and sensor elements 22, 24 and 26 from silicon chip 20 obtained by use of the very thin silicon nitride within members 32 and 34 which have very small thermal conductance along them and by accurately defined air space 30 that effectively surrounds heater resistor 26 and sensor resistors 22 and 24 with air. The accurate definition of surrounding air space 30 including lateral and depth dimensions of depression 30 beneath heater 26 and sensor elements 22 and 24 is accomplished by precision etching techniques explained below. The accurate definition of the surrounding air space makes a uniform degree of thermal isolation possible from chip to chip which in turn makes possible a uniform chip to chip air flow response., 25690=Huijsing et al (J. H. Huijsing, J. P. Schuddemat, and W. Verhoef, \"Monolithic Integrated Direction-Sensitive Flow Sensor\", IEEE Transactions on Electron Devices, Vol. ED-29, No. 1, pp. 133-136, January, 1982) disclose a flow sensor comprising a silicon chip with an identical diffused transistor temperature sensing element embedded near each upstream and downstream edge of the chip and a centrally located diffused transistor heater element to raise the chip to as much as 45 degree Centigrade above the air stream temperature. The upstream sensing element is cooled slightly more than the downstream sensing element under air flow conditions, and the temperature difference between the two sensor element transistors results in an electrical current difference between them, which when converted to a voltage difference is a measure of the air flow. The sensor elements must be located on opposite sides of the chip to achieve an appreciable temperature difference between them, and even so, in the air flow range up to 1000 feet per minute, the temperature differences are small, ranging from 0 to under 0.2 degrees Centigrade., 65102=In the embodiment of FIG. 14, two members 32D and 34D, interconnected by an interconnect 94, are bridged over the depression with half of each element (heater 26D and sensors 22D and 24D) being located on each member and being series connected. The permalloy grid patterns 22D, 24D and 26D, patches 90D and 90DD, and leads 92D have 180 degree rotational symmetry to assure a thermal balance of sensor elements 22D and 24D. Patches 90D are included to add strength along the center line of the members, patches 90DD also adding strength along the center line of the members and providing symmetrical heat conduction properties. In this embodiment, air flow is typically oriented along the length of the members, in contrast to the previously discussed embodiments in which air flow is typically oriented laterally to the members. Sensing elements 22D and 24D are relatively narrow, each half sensor being 75 microns in width and 135 microns in length. The distance between the edges of heater 26D and the near edges of sensors 22D and 24D is 0.001 inch (25 microns). Having half elements 22D, 24D and 26D on each member helps assure coplanarity. In the embodiment of FIG. 14, each member has a width of 0.006 inch and a length of 0.019 inch. The resistance of heater 26D is 1300 ohms, and the resistance of each sensor 22D and 24D is 1050 ohms. The sensor of this embodiment responds less to flow in contrast to the previously discussed embodiments because relatively little air flows beneath the members, and because the sensors are closer to the walls of the depression in the semiconductor body and, therefore, are more tightly coupled thermally to the semiconductor body., 83451=A heater resistance element having a 600 to 1000 ohm preferred resistance at 25 degrees Centrigrade provides the desired power dissipation to achieve the preferred operating temperature at a convenient voltage of a few volts and a convenient current of, for example, 2 to 3 milliamperes. Element failure by electromigration is also a factor in choosing a typical impedance in the 600 to 1000 ohm range for permalloy heater elements used in the preferred embodiment. Electromigration is a temperature-dependent failure mechanism within a conductor caused by mass flow when current densities exceed a critical limit, on the order of 10 million amperes per square centimeter at 25 degrees Centigrade in permalloy. In the preferred embodiment, in which the heater resistance is typically 600 to 1000 ohms, resistance line widths are 5 microns, and resistance element thickness is 0.08 microns, the current density is substantially less, approximately 0.6 million amperes per square centimeter. At these current levels, electromigration has not been found to be a detrimental factor., 26851=Van Putten et al (A. F. P. Van Putten and S. Middlehoek, \"Integrated Silicon Anomometer\", Electronics Letters, Vol. 10, No. 21 [October, 1974], pp. 425-426) disclose a silicon chip with an identical diffused resistor element embedded on each of four opposite sides of a chip. All resistor elements are self heated, thus raising the chip and its support substantially above the ambient air stream temperature. The resistors are operated in an electrical double bridge circuit. Under zero air flow, all elements are at the same temperature, and the double bridge is electrically balanced. Under air flow conditions, the upstream and downstream elements which are normal to the flow are cooled more than the side elements which are parallel to the flow. This temperature difference unbalances the electrical double bridge to give a measure of the air flow velocity., 28398=Rahnamai et al (H. Rahnamai and J. N. Zemel, \"Pyroelectric Anomometers\", paper presented at the 1980 International Electron Devices Society of IEEE, Washington, D.C., Dec. 8-10, 1980, pp. 680-684) disclose a thin slab of single-crystal, polished, and crystallographically-oriented lithium tantalate, having a length of 8 mm, a width of 4 mm and a minimum thickness of 0.06 mm, a deposited thin film of metal covering the entire back side of the slab, a front side centrally-located deposited thin film heater resistor element, and an upstream and downstream deposited thin film electrode located equally some distance from the heater element and equally spaced from it. As described in the literature, this slab is supported at its edges on a large modified screw head to provide an essential air flow channel below the slab. The upstream and downstream electrodes act as separate identical capacitor plates, the capacitors having as their other plate the back side electrode and, together with the back and side electrode, function as identical upstream and downstream temperature sensing capacitor elements. In operation, an a.c. voltage of low frequency, for example: 2 to 10 Hz, is applied to the heater element causing a periodic heating of that element above the ambient air stream temperature. The sensor elements are correspondingly periodically heated by thermal conduction, to a large extent through the pyroelectric lithium tantalate slab, and under zero flow conditions, each sensor element develops an identical periodic pyroelectric voltage caused by the temperature-dependent electrical polarization of the pyroelectric slab. The voltage difference between sensor elements is then zero at zero air flow. Under flow conditions, the upstream sensing element cools more than the downstream sensing element as stated in the literature, and the resulting sensor element temperature difference causes a voltage difference that is a measure of the flow., 62383=As discussed earlier, it is desirable to maximize the sum of the average delta T1 over one sensor and the average delta T2 over the other sensor (FIG. 7). Ideally, this would be best accomplished by using very narrow sensing resistance elements which would have very low resistances. However, practical circuit considerations typically require sensing resistance element values of at least 100 ohms, and preferably in the 700 to 1000 ohm range. Combining this requirement with practical limitations on the length of the thin film member structures and the limitations on current density and the associated resistor element film thickness as discussed subsequently, it is found that sensor grid element widths should typically be at least 75 microns wide to achieve the preferred resistance values. Therefore the typically preferred sensor grid element embodiment is not narrow but has a substantial width., 68394=As shown in the Figure, resistive element grid 26F occupies substantially the entire central area of member 32F. The grid lines of electrical resistive grid 26F are oriented parallel to the length of the member 32F. The total resistance of element 26F is 1510 ohms; as shown, taps 98 and 100 enable measurement across resistance sections of 330 ohms at each end of the total resistance. Member 32F, which supports element 26F above a depression such as 30, is approximately 0.006 inch wide and 0.016 inch long in the embodiment illustrated. Permalloy areas 106 and 108 are electrically isolated and are used to reinforce member 32F.}",
    "textBeforeTable": "Patent Citations The present invention is to be limited only in accordance with the scope of the appended claims, since persons skilled in the art may devise other embodiments still within the limits of the claims. For example, the present invention is not limited to having a permalloy resistive element, since any suitable heater or sensing element would suffice. Alternate examples of elements include a pyroelectric material such as a zinc oxide monocrystalline film, a thin film thermocouple junction, a thermistor film of semiconducting material, or a metallic film other than permalloy with a favorable temperature coefficient of resistance (TCR). Note also that, while \"air\" is sometimes mentioned as the medium in which flow is being monitored, the present sensors are applicable to many other gaseous substances in addition. Therefore, for the purposes of the present application, \"air\" is defined to include gaseous substances in general. Accordingly, using preferred embodiments of the present invention, permalloy forms both a temperature sensor and heater/radiation source in combination with the microstructure disclosed. Use of silicon nitride as a supporting and passivating material permits etching times that are needed to achieve the desired structure. In addition, orientation of the members, as previously described, provides undercutting in a minimum amount of time and achieves the desired structure without artificial etch stops. In addition, the use of deep anisotropic etching to control depression depth to the 0.001 to 0.010 inch range achieves greater thermal",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 \"Integral Type Si Flow Sensor With Heat Insulation Structures\" Toyota Central Research Lab. 2 Bassous, E. et al., \"Ink Jet Printing Nozzle Arrays Etched in Silicon\" IBM Thomas J. Watson Research Center, Yorktown, N.Y., vol. 31, No. 2, Jul. 1977. 3 Bassous, E. et al., \"The Fabrication of High Precision Nozzles by the Anisotropic Etching of (100) Silicon\" IBM Thomas J. Watson Research Center, Yorktown, N.Y. , pp. 1321-1327. 4 * Bassous, E. et al., Ink Jet Printing Nozzle Arrays Etched in Silicon IBM Thomas J. Watson Research Center, Yorktown, N.Y., vol. 31, No. 2, Jul. 1977. 5 * Bassous, E. et al., The Fabrication of High Precision Nozzles by the Anisotropic Etching of (100) Silicon IBM Thomas J. Watson Research Center, Yorktown, N.Y. , pp. 1321 1327. 6 Bassous, Ernest, \"Fabrication of Novel Three-Dimensional Microstructures by the Anisotropic Etching of (100) and (110) Silicon,\" IEEE Transactions on Electron Devices, Vo. Ed.",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}