{
    "relation": [
        [
            "Date",
            "6 Oct 2005",
            "24 Jun 2009",
            "6 Sep 2013",
            "24 Jan 2014",
            "18 Mar 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: MAGNA INTERNATIONAL OF AMERICA, INC., MICHIGAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:WILSON, PHILLIP S.;REEL/FRAME:016859/0021 Effective date: 19991217",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20140124"
        ]
    ],
    "pageTitle": "Patent US6988305 - Method and apparatus for blow molding large reinforced plastic parts - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6988305?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 468693911,
    "recordOffset": 468662073,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33369=The invention in this patent was made with Governmental support under Cooperative Agreement No. 70NANB7H3028 awarded to the Dow Chemical Company and Decoma International of America, Inc. (formerly Magna International of America, Inc.), project ID 1997-02-0047B, project name “NANOCOMPOSITES—NEW LOW COST/HIGH STRENGTH MATERIALS FOR AUTOMOTIVE PARTS,” awarded Sep. 30, 1997 by the United States Department of Commerce, National Institute of Standards and Technology, Advanced Technology Program. The Government has certain rights in this invention., 33949=This application is the National Phase of International Application No. PCT/US99/29991, filed Dec. 17, 1999, published as WO 00/37239, which claims priority from U.S. Provisional Patent Application Ser. No. 60/113,064, filed Dec. 21, 1998, the contents of all of which are incorporated herein by reference., 50343=Additional specific preferred methods, for the purposes of the present invention, for forming a polymer composite having dispersed therein exfoliated layered particles are disclosed in U.S. Pat. Nos. 5,717,000, 5,747,560, 5,698,624, and WO 93/11190, each of which is hereby incorporated by reference. For additional background, the following are also incorporated by reference: U.S. Pat. Nos. 4,739,007 and 5,652,284.}",
    "textBeforeTable": "Patent Citations Although certain embodiments of the invention have been described and illustrated herein, it will be readily apparent to those of ordinary skill in the art that a number of modifications and substitutions can be made to the blow molding system disclosed and described herein without departing from the true spirit and scope of the invention. In this case of molding large parts with a modulus of elasticity greater than 1,000,000 PSI, it may be desirable to use engineering resins instead of polyolefins. Such engineering resins may include polycarbonate (PC), acrylonitrile butadiene styrene (ABS), a PC/ABS blend, polyethylene terephthalates (PET), polybutylene terephthalates (PBT), polyphenylene oxide (PPO), or the like. Generally, these materials in an unreinforced state have a modulus of elasticity of about 300,000 PSI–350,000 PSI. At these higher loadings of nanoparticles (8–15% by volume), impact resistance will be decreased, but to a much lower extent than the addition of the conventional 25–40% by volume of glass fibers. Use of the plastic melt 20 as described above enables the blow molding apparatus disclosed herein to manufacture large parts that can be provided with impact resistance characteristics that were not previously attainable. For example, the blow molding system of the present invention is able to manufacture large parts having a modulus of elasticity of greater than 1,000,000 PSI by use of the plastic melt reinforced with loadings of 8–15% by volume of nanoparticles, with at",
    "textAfterTable": "US5000333 * 20 Feb 1986 19 Mar 1991 Alfa Romeo Auto S.P.A. Container for the windshield washing liquid of a car US5164440 * 13 Jul 1989 17 Nov 1992 Ube Industries, Ltd. High rigidity and impact resistance resin composition US5239406 18 Jul 1991 24 Aug 1993 Donnelly Corporation Near-infrared reflecting, ultraviolet protected, safety protected, electrochromic vehicular glazing US5309634 * 28 Apr 1992 10 May 1994 Prince Corporation Method of assembling electrical circuit to vehicle panel US5385776 * 16 Nov 1992 31 Jan 1995 Alliedsignal Inc. Nanocomposites of gamma phase polymers containing inorganic particulate material US5500179 * 1 Feb 1994 19 Mar 1996 Sumitomo Wiring Systems, Ltd. Method of manufacturing harness part for automobile US5527581 * 16 Sep 1994 18 Jun 1996 Idemitsu Petrochemical Co., Ltd. Car interior member and molding method of the same",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}