{
    "relation": [
        [
            "Date",
            "Jul 26, 2007",
            "Jul 28, 2008",
            "May 21, 2009",
            "Aug 11, 2011",
            "Feb 7, 2012",
            "May 28, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: GAMBRO BCT, INC., COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:LANGLEY, ROBERT W.;TAYLOR, LINDA A.;TAGA, TIMOTHY MICHAEL;REEL/FRAME:019614/0434;SIGNING DATES FROM 20070718 TO 20070719 Owner name: GAMBRO BCT, INC., COLORADO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:LANGLEY, ROBERT W.;TAYLOR, LINDA A.;TAGA, TIMOTHY MICHAEL;SIGNING DATES FROM 20070718 TO 20070719;REEL/FRAME:019614/0434",
            "Owner name: CARIDIANBCT, INC.,COLORADO Free format text: CHANGE OF NAME;ASSIGNOR:GAMBRO BCT, INC.;REEL/FRAME:021301/0012 Effective date: 20080714 Owner name: CARIDIANBCT, INC., COLORADO Free format text: CHANGE OF NAME;ASSIGNOR:GAMBRO BCT, INC.;REEL/FRAME:021301/0012 Effective date: 20080714",
            "Owner name: CITICORP TRUSTREE COMPANY LIMITED,UNITED KINGDOM Free format text: IP SECURITY AGREEMENT SUPPLEMENT;ASSIGNOR:CARIDIANBCT, INC.;REEL/FRAME:022714/0543 Effective date: 20090131",
            "Owner name: CARIDIANBCT, INC., COLORADO Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:CITICORP TRUSTEE COMPANY LIMITED, AS SECURITY AGENT;REEL/FRAME:026737/0476 Effective date: 20110727",
            "Owner name: TERUMO BCT, INC., COLORADO Free format text: CHANGE OF NAME;ASSIGNOR:CARIDIANBCT, INC.;REEL/FRAME:027668/0072 Effective date: 20120106",
            "Year of fee payment: 4"
        ]
    ],
    "pageTitle": "Patent US7857744 - Blood processing apparatus with flared cell capture chamber and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7857744?dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00022-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477347851,
    "recordOffset": 477319817,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{64517=The resulting separated or collected blood product is placed in the first source 38 although the blood product could also come directly from a separation system through a line (not shown). The first source 38 is coupled to the first line 28 through line 17. In addition, the second source 42 containing the diluting, sedimentation or elutriation fluid is coupled to the line 28 through the line 37. The centrifuge rotor 12 is rotated about the axis of rotation A—A, at approximately 2400 rpm, although other speeds can be used. The blood product is pumped from source 38 through pump loop 43 and loaded into the fluid chamber 18 at a flow rate selected to give the desired packing of the loaded product for the selected centrifuge speed. The pump associated with loop 43 is stopped to stop flow of blood product from source 38. Flow of diluting, sedimentation or elutriation fluid is then started using pump loop 44 and the action of its associated pump to rinse line 28 and/or wash the loaded blood product. The diluting, sedimentation fluid or elutriation fluid passes through line 28 and Y connector 34, and inlet line 32 into the inlet 22 of chamber 18., 34600=The flared elutriation chamber described herein may be used with various blood-separation apparatus, such as the apparatus described in U.S. Pat. No. 5,722,926, issued Mar. 3, 1998; U.S. Pat. No. 5,951,877, issued Sep. 14, 1999; U.S. Pat. No. 6,053,856, issued Apr. 25, 2000; U.S. Pat. No. 6,334,842, issued Jan. 1, 2002; U.S. patent application Ser. No. 10/884,877 filed Jul. 1, 2004; U.S. Pat. No. 7,201,848. The entire disclosure of each of these U.S. patents and patent applications is incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations It will be apparent to those skilled in the art that various modifications and variations can be made to the structure and methodology of the present invention without departing from the scope or spirit of the invention. Rather, the invention is intended to cover modifications and variations provided they come within the scope of the following claims and their equivalents. Although the inventive device and method have been described in terns of removing white blood cells and collecting platelets, this description is not to be construed as a limitation on the scope of the invention. The invention may be used to separate any of the particle components of blood from one another or the invention could be used in fields other than blood separation. For example, the fluidized bed may be formed from red blood cells to prevent flow of white blood cells through the fluid chamber 18, so long as the red blood cells do not clump excessively. Alternatively, the liquid for carrying the particles may be saline or another substitute for plasma. In addition, the invention may be practiced to remove white blood cells or other components from a bone marrow harvest collection or an umbilical cord cell collection harvested following birth. In another aspect, the invention can be practiced to collect T cells, stem cells, or tumor cells. Further, one could practice the invention by filtering or separating particles from fluids",
    "textAfterTable": "Heraeus Christ Gmbh Centrifuge rotor for washing blood cells - has two formed components between which films are mounted DE2701976A1 Jan 19, 1977 Jul 20, 1978 Heraeus Christ Gmbh Counter-flow type blood washing centrifuge - uses compressible receptacle of centrally and rotationally symmetrical shape DE3700122A1 Jan 3, 1987 Jul 14, 1988 Manfred Lutz Chamber for separating a particle mixture according to the countercurrent centrifugation method DE3734170A1 Oct 9, 1987 Apr 20, 1989 Npbi Bv Process for preparing cellulose fibres and a filter containing these EP0406485A1 Jul 3, 1989 Jan 9, 1991 NPBI Nederlands Produktielaboratorium voor Bloedtransfusieapparatuur en Infusievloeistoffen B.V. A method for the removal of leukocytes from a leukocyte-containing suspension and filter unit for use with the method EP0408462A2 Jul 13, 1990 Jan 16, 1991 Terumo Kabushiki Kaisha Filter material for seizure of leukocytes and method for production thereof WO1996033203A1 Apr 21, 1995 Oct 24, 1996 Univ South Florida Immunopotentiating inosine monophosphate 5'-nucleotidase resistant derivatives and uses thereof * Cited by examiner",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}