{
    "relation": [
        [
            "Command",
            "show dsip nodes",
            "show dsip ports",
            "show dsip queue",
            "show dsip tracing",
            "show dsip transport",
            "show dsip version"
        ],
        [
            "Description",
            "Displays information about the processors running the DSIP.",
            "Displays information about local and remote ports",
            "Displays the number of messages in the retransmit queue waiting for acknowledgment.",
            "Displays DSIP tracing buffer information.",
            "Displays information about the DSIP transport statistics for the control/data and IPC packets and registered addresses.",
            "Displays DSIP version information."
        ]
    ],
    "pageTitle": "Cisco IOS Interface and Hardware Component Command Reference - show controllers serial through show hw-module slot proc cpu [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/interface/command/ir-cr-book/ir-s3.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366985383,
    "recordOffset": 366833278,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{342735=0x00:04 FF 40 03 0B 41 01 00 C0 46 03 20 00 0E 74 01, 342462=PCB Serial Number :JAB9801ABCD, 935429=Counter for the number of frames that exceed the maximum valid packet length of 1518 bytes., 361379=The following is a sample output from the show diag subslot command for a 2-Port 10/100/1000 Gigabit Ethernet SPA located in the top subslot (0) of the MSC that is installed in slot 4 on a Cisco 7304 router:, 313609=This command was implemented for AIC and WIC cards on the Cisco 2600 series routers and the Cisco 3600 series routers., 509281=(Optional--Cisco ASR 1000 Series Routers) Displays the event log for the specified hardware slots, where:, 195360=Degraded minute (DM) is a minute in which the estimated error rate exceeds 1E-6 but does not exceed 1E-3. For more information, refer to RFC 1406, Definitions of Managed Objects for DS1 and E1 Interface Types ., 342811=0x10:42 41 30 80 00 00 00 00 02 02 C1 8B 4A 41 42 39, 110187=For E1-no-CRC signals, a second with 2048 Line Code Violations or more., 55349=This command was introduced on Cisco 12000 series Internet routers., 650876=Number of times watchdog receive timer expired. It happens when receiving a packet with length greater than 2048., 110268=For D4 signals, a count of 1-second intervals with Framing Errors, or an Out-of-Frame defect, or 1544 Line Code Violations., 926541=If you do not specify a port or port range for the showhub command, the command displays all ports (for example, ports 1 through 16 on a Cisco 2507 router) by default. Therefore, the showhub, showhubethernet0, and showhubethernet0116 commands produce the same result., 271339=The showcontrollerwanphycommand has been introduced on the Cisco ASR 1000 Series Router in Cisco IOS XE Release 3.3.0S. This command is used to display:, 317607=This command was implemented for the NME-AON-K9= enhanced network module on the following platforms: Cisco 2811, Cisco 2821, Cisco 2851, Cisco 3725, and Cisco 3745 routers., 476206=If a test is configured to run periodically, the interval will be displayed in the Test Interval field of the command output in the format ddd hh:mm:ss.ms, indicating days, hours, minutes, seconds, and milliseconds. For example, the test interval of a test that will run every 15 minutes will be displayed as 000 00:15:00.00. The test interval of a test that will run every 14 days will be displayed as 014 00:00:00.00., 643712=Time at which the counters that measure cumulative statistics (such as number of bytes transmitted and received) shown in this report were last reset to zero. Note that variables that might affect routing (for example, load and reliability) are not cleared when the counters are cleared. *** indicates the elapsed time is too large to be displayed. 0:00:00 indicates the counters were cleared more than 231ms (and less than 232ms) ago., 370559=The following is a sample output from the show diag subslot detailscommand for the 1-Port OC-192c/STM-64c POS/RPR XFP SPA in subslot 1 of the SIP located in chassis slot 1 on a Cisco 12000 series Internet router:, 935037=Counter for the number of frames of valid length (64 to 1518 bytes) that have been detected on the port with an FCS error and a framing error., 314030=This command was implemented for the AIM-VPN/EPII and AIM-VPN/HPII cards on the Cisco 2691, Cisco 3660, Cisco 3725, and Cisco 3745 routers., 311555=This command was implemented on the Cisco 1750 router., 647635=Number of packets that are discarded because they exceed the medium’s maximum packet size. For example, any Ethernet packet that is greater than 1518 bytes is considered a giant., 941521=Enables and configures a port on an Ethernet hub of a Cisco 2505 or Cisco 2507 router., 841593=When LACP 1:1 redundancy is configured, the showetherchanneldetail command also displays fast-switchover status information., 337861=C2611 2E Mainboard Port adapter, 2 ports, 146728=This command was integrated into Cisco IOS Release 12.2(11)YT and implemented on the following platforms: Cisco 2650XM, Cisco 2651XM, Cisco 2691, Cisco 3660 series, Cisco 3725, and Cisco 3745 routers., 517137=The following example shows the results of all events for the predefined TestErrorCounterMonitor test on route processor 0 on a Cisco ASR 1000 Aggregation Services Router:, 431891=The following is a sample output from the show diag command for a Cisco ASR 1000 Series Router., 365538=The following is a sample output from the show diag subslot command for the 1-Port OC-192c/STM-64c POS/RPR XFP SPA in subslot 1 of the SIP located in chassis slot 1 on a Cisco 12000 series Internet router:, 316422=This command was integrated into Cisco IOS Release 12.0(31)S and the subslotslotsubslotkeyword and arguments were added to support SIPs and SPAs on the Cisco 12000 series Internet router., 11519=For E1-nonCRC signals, this is a second with 2048 or more Line Code Violations., 335052=The following is a sample output from the show diag command for a Cisco 2611 router with the NM-AIC-64 installed., 187143=The number of unavailable seconds (UAS) is calculated by counting the number of seconds for which the interface is unavailable. For more information, refer to RFC 1407, DS3 MIB Variables ., 585617=The config register on the primary supervisor engine (and on the secondary supervisor engine if present) must be one of the following values: 0x2 , 0x102, or 0x2102., 329979=The following is a sample output from the show diag command on a Cisco 12000 series Internet router:, 317119=This command was implemented for the HWIC-1ADSL and HWIC-1ADSLI interface cards on the following platforms: Cisco 1800 (modular) series, Cisco 2800 series, and Cisco 3800 series routers., 342887=0x20:38 30 31 41 42 43 44 03 00 81 00 00 00 00 04 00, 829073=Cisco 2600 Series, Cisco 3600 Series, and Cisco 3700 Series Routers, 921258=To display information about the hub (repeater) on an Ethernet interface of a Cisco 2505 or Cisco 2507 router, use the showhub command in user EXEC or privileged EXEC mode., 373566=The following is a sample output from the show diag command for a SIP located in chassis slot 2 on a Cisco 12000 series Internet router:, 513811=On the Cisco ASR 1000 Series Aggregation Services Routers, if no optional keywords are entered, the event log for all supported slots is displayed., 310476=This command was implemented on the Cisco 12000 series Internet router., 270929=This command was introduced on the Cisco ASR 1000 Series Routers., 375413=The following is a sample output from the show diag command for a Cisco 2811 router with HWIC-1ADSL installed in slot 1 and HWIC-1ADSLI installed in slot 2. Each HWIC has a daughtercard as part of its assembly. The command results below give the output from the HWIC followed by the output from its daughtercard., 923464=(Optional) Port number on the hub. On the Cisco 2505 router, port numbers range from 1 to 8. On the Cisco 2507 router, port numbers range from 1 to 16. If a second port number follows, this port number indicates the beginning of a port range., 824645=This command was modified to support switchport creation on Cisco 2600 series, Cisco 3600 series, and Cisco 3700 series routers.}",
    "textBeforeTable": "Syntax Description [ slot/subslot/port/t1-number ] serial controllers show Channelized T3 Shared Port Adapters [ slot/subslot/port ] serial controllers show T3/E3 Shared Port Adapters and 2-Port and 4-Port Channelized T3 SPA in Unchannelized Mode [ slot/port-adapter/port ] serial controllers show Cisco 7000 Series Routers with the RSP7000 and RSP7000CI and Cisco 7500 Series Routers [ slot/port ] serial controllers show Standard Syntax To display serial controller statistics, use the showcontrollersserialcommand in privileged EXEC mode. show controllers serial show hw-module slot proc cpu show hw-module slot logging show hw-module slot fpd show hw-module slot align show hw-module slot (6500) show hw-module all fpd show hub show hspw-aps-icrm show gtp show fm inband-counters show fm features show fabric show etherchannel load-balancing show etherchannel show esmc show errdisable recovery show errdisable detect show eobc show dtp interface show dsip version show dsip transport",
    "textAfterTable": "Command Modes Privileged EXEC Command History Release Modification 10.0 This command was introduced. 11.1CA This command was modified to include support for the PA-E3 and PA-T3 port adapters. 12.2S This command was integrated into Cisco IOS Release 12.2S. 12.2(25)S3 This command was integrated into Cisco IOS Release 12.2(25)S3. 12.2(18)SXE This command was integrated into Cisco IOS Release 12.2(18)SXE and introduced a new output for interfaces on the serial SPAs on the Cisco 7600 series routers and Catalyst 6500 series switches. 12.0(31)S This command was integrated into Cisco IOS Release 12.0(31)S.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}