{
    "relation": [
        [
            "Player Name",
            "",
            "Ammon Barker",
            "Keelan Ewaliko",
            "Rashaan Falemalu",
            "Trayvon Henderson",
            "Barry Higdon",
            "Tigi Hill",
            "Marcus Kemp",
            "Matthew Kolomatangi",
            "David Manoa",
            "Drake Miller",
            "Terrance Polk",
            "Ualesi Sale",
            "Diocemy St. Juste",
            "Jamie Tago",
            "Kennedy Tulimasealii",
            "Elijah Tupai",
            "John Wa'a",
            "Darzil Washington",
            "Aofaga Wily",
            "Aaron Zwahlen",
            "Keith Kirkwood"
        ],
        [
            "Position",
            "",
            "WR",
            "ATH",
            "LB",
            "DB",
            "DB",
            "DB",
            "WR",
            "OL",
            "DL",
            "LB",
            "WR",
            "DL",
            "RB",
            "LB",
            "DL",
            "OL",
            "OL",
            "LB",
            "RB",
            "QB",
            "WR"
        ],
        [
            "Height",
            "",
            "6-4",
            "5-11",
            "6-1",
            "6-1",
            "6-3",
            "6-2",
            "6-4",
            "6-6",
            "6-3",
            "6-1",
            "5-11",
            "6-1",
            "5-9",
            "6-2",
            "6-3",
            "6-4",
            "6-4",
            "6-2",
            "5-11",
            "6-3",
            "6-5"
        ],
        [
            "Weight",
            "",
            "200",
            "185",
            "210",
            "195",
            "180",
            "215",
            "185",
            "230",
            "220",
            "215",
            "180",
            "245",
            "190",
            "210",
            "285",
            "255",
            "285",
            "240",
            "210",
            "185",
            "200"
        ],
        [
            "Class",
            "",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "So.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Jr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "Fr.",
            "So.",
            "Fr.",
            "Fr.",
            "Fr."
        ],
        [
            "Hometown/Last School",
            "",
            "Salt Lake City, UT / Alta HS",
            "Wailuku, Maui / Baldwin HS",
            "Hau'ula, O'ahu / Kahuku HS",
            "Sacramento, CA / Grant Union HS",
            "Ft. Lauderdale, FL / Chaminade-Madonna Prep",
            "La'ie, O'ahu / Mesa CC",
            "Layton, UT/Layton HS",
            "East Palo Alto, CA / Woodside HS",
            "San Mateo, CA/Aragon HS",
            "Bingham, UT / Bingham HS",
            "Pittsburg, LA / Los Medanos JC",
            "Honolulu, O'ahu / 'Aiea HS",
            "Santaluces, FL / Santaluces HS",
            "Pago Pago, American Samoa / Samoana HS",
            "Wai'anae, O'ahu / Wai‘anae HS",
            "Salt Lake City, UT / Cottonwood HS",
            "Kahuku, O'ahu / Kahuku HS",
            "New Orleans, LA / Eastern Arizona JC",
            "La'ie, O'ahu / Kahuku HS",
            "Modesto, CA / Downey HS",
            "Neptune, NJ / Neptune HS"
        ],
        [
            "Highlights",
            "",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View",
            "View"
        ]
    ],
    "pageTitle": "UH football signs 21 on National Signing Day | Sports - Home",
    "title": "",
    "url": "http://m.kitv.com/sports/UH-football-signs-21-on-National-Signing-Day/18442176",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00226-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 150125615,
    "recordOffset": 150101908,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17845=Not included in this list are five mid-year transfers, who signed in December., 17080=University of Hawaii head football coach Norm Chow announced the Warrior's 2013 signing class Wednesday at a press conference at the Stan Sheriff Center., 21563=UH also signed a pair of JUCO transfers who are expected to make immediate impacts -- defensive back Tigi Hill, a Kahuku High graduate who signed with UH in 2011 and spent the past two years at Mesa Community College and linebacker Darzil Washington, who initally signed with Texas A&M out of high school, and comes to UH by way of Eastern Arizona College., 51786=Beijing is set to become the first city to have hosted both the Summer and Winter Olympics after it was chosen to stage the 2022 Winter Games., 34410=Copyright 2013 by KITV All rights reserved. This material may not be published, broadcast, rewritten or redistributed., 24620=2013 Signing Class, 51948=International Olympic President Thomas Bach confirmed Beijing, which hosted the Summer Games in 2008, had be...}",
    "textBeforeTable": "2013 Signing Class \"We need to temper our enthusiasm and reserve judgment on this class until 2-3 years from now,\" Chow said. \"That's when these players should be making an impact on your program. We're especially pleased with the commitment these young men made to want to become Warriors. Last year's and this year's class coupled with the next few classes and we should really have ingredients of a strong program.\" Linebacker Drake Miller earned all-state honors after recording 105 tackles at Bingham High in Utah while defensive lineman David Manoa of Aragon High, has ties to the island as his father Sam played at Kahuku. The Warriors' pipeline to American Samoa continued with the signing of linebacker Jamie Tago of Samoana High, rated the fourth-best recruit out of the country. With the loss of all-everything cornerback Mike Edwards, the Warriors went out and signed defensive backs Trayvon Henderson of Grant High in Sacramento, Calif. and Barry Higdon of Chaminade-Madonna Prep in Florida.  Henderson was a two-way player at Grant who received numerous postseason honors while Higdon picked UH over Cincinnati. Four wide receivers signed with UH -- Ammon Barker of Alt High in Utah picked the Warriors over UCLA; Marcus Kemp of Layton High in Utah was one of the top recruits in the state; Terrance Polk of Los Medanos JC in California, who ranked second in the state in touchdowns and sixth in receiving yards, and Keith Kirkwood of Neptune High in New Jersey is",
    "textAfterTable": "Copyright 2013 by KITV All rights reserved. This material may not be published, broadcast, rewritten or redistributed. Comments The views expressed are not those of this site, this station or its affiliated companies. By posting your comments you agree to accept our terms of use. Please enable JavaScript to view the comments powered by Disqus. blog comments powered by Disqus Most Popular Stories Guillermo expected to be hurricane by Friday Big Island fisherman reels in catch of a lifetime Fake rentals on the rise across state City considers purchase of Iwilei building for low-income rentals, Housing First",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}