{
    "relation": [
        [
            "M",
            "",
            "4",
            "11",
            "18",
            "25"
        ],
        [
            "T",
            "",
            "5",
            "12",
            "19",
            "26"
        ],
        [
            "W",
            "",
            "6",
            "13",
            "20",
            "27"
        ],
        [
            "T",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "F",
            "1",
            "8",
            "15",
            "22",
            ""
        ],
        [
            "S",
            "2",
            "9",
            "16",
            "23",
            ""
        ],
        [
            "S",
            "3",
            "10",
            "17",
            "24",
            ""
        ]
    ],
    "pageTitle": "Hands on History | Australian War Memorial",
    "title": "",
    "url": "https://www.awm.gov.au/events/hands-history-1/?calendar=2013-02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00256-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893994103,
    "recordOffset": 893985901,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9839=Australia in the Great War from December 2014, 9976=Reality in flames: modern Australian art & the Second World War until 6 July 2016, 9707=Afghanistan: the Australian story from 7 August 2013}",
    "lastModified": "Sat, 01 Aug 2015 00:43:35 GMT",
    "textBeforeTable": "February Suitable for kids of all ages and their families Our exciting Hands on History programs answer these and many more questions. You will have the opportunity to try on uniforms, handle real items and hear the incredible stories of Australian men and women in war. What jobs do servicement and women do? What do they wear? What do they eat? Orientation Gallery 11 am and 2pm Hands on History There are no upcoming dates for this event. Hands on History Talks and speeches Venue Hire Guided Tours Maps of the Memorial Access Conferences The Last Post Ceremony What's on Exhibitions",
    "textAfterTable": "Exhibitions Afghanistan: the Australian story from 7 August 2013 Australia in the Great War from December 2014 Reality in flames: modern Australian art & the Second World War until 6 July 2016 Cafés Poppy's café 8.30am-4.30pm daily Poppy's menu (PDF, 150Kb) The Landing Place located in Anzac Hall 10:30am–4.30pm daily Map Museum Visitor information Research Centre Events Exhibitions | On tour Conservation Blog Media Jobs Research Family history Information sheets Roll of Honour Official Histories Australian military units Encyclopedia Glossary Publications Participate Friends of the Memorial Battlefield tours Facebook Twitter Flickr Flickr Commons YouTube Instagram About Copyright Disclaimer Privacy Statement Contact  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}