{
    "relation": [
        [
            "Scholarship Name",
            "Edwin J. & Dorothy M. Hartman Scholarship",
            "Robert & Kathleen Lindgren Scholarship",
            "Wisconsin Family Business Forum (WFBF) Scholarship",
            "Dr. Dwight M. Edmonds Scholarship",
            "College of Business Alumni Association Scholarship",
            "Mr. & Mrs. Allen D. Guentzel Scholarship",
            "4imprint Scholarship",
            "Kell Scholarship",
            "Shirley Tipler Schultz Scholarship",
            "Linda & Jeffrey Bartelt Scholarship",
            "Grant Thornton Accounting Scholarship",
            "Kenneth D. Krueger Scholarship",
            "Harry Ostendorf Accounting Scholarship",
            "Schenck Accounting Scholarship",
            "Tax Executives Institute of NE Wisconsin",
            "Wipfli Accounting Scholarship",
            "Baker Tilly Accounting Scholarship",
            "Baker Tilly Accounting Scholarship for Women",
            "Adela Pfieffer Iversen Scholarship",
            "SECURA Insurance Scholarship",
            "Arnold Peterson Chalberg & Charlene Barr Chalberg Scholarship",
            "Helen M. Deniger Scholarship",
            "Guyette Family Scholarship",
            "Lothar I. Iversen Scholarship",
            "JJ Keller IS/Comp Sci Scholarship",
            "College of Business Supply Chain & Operations Management Scholarship in honor of Dr. D. Brent Bandy"
        ],
        [
            "Majors",
            "Open to all Majors",
            "Open to all Majors",
            "Open to all Majors",
            "All Business Majors",
            "All Business Majors",
            "All Business Majors",
            "All Business Majors",
            "All Business Majors",
            "All Business Majors",
            "All Business Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting Majors",
            "Accounting and/or Finance Majors",
            "Insurance Minors",
            "Finance Majors",
            "Finance Majors",
            "Finance Majors",
            "Finance Majors",
            "IS/Comp Sci Majors",
            "Supply Chain Mgmt Majors"
        ],
        [
            "Minimum GPA",
            "2.5",
            "2.5",
            "3.0",
            "2.5",
            "2.5",
            "2.5",
            "3.0",
            "",
            "3.0",
            "2.5",
            "3.0",
            "3.0",
            "3.5",
            "3.0",
            "2.5",
            "3.5",
            "3.0",
            "3.0",
            "2.5",
            "3.0",
            "2.5",
            "2.5",
            "2.5",
            "2.5",
            "3.0",
            "3.3"
        ],
        [
            "Value",
            "500",
            "500",
            "1000 or 2 @ 500",
            "500",
            "1000",
            "1000",
            "500",
            "1000",
            "300",
            "500",
            "500",
            "1000",
            "1000",
            "2 @ 500",
            "1,000",
            "2 @ 1,000",
            "1 @ 750",
            "1 @ 750",
            "500",
            "2 @ $1,000",
            "1000",
            "500",
            "500",
            "300",
            "1000",
            "750"
        ],
        [
            "Description",
            "Female student who has an interest in small business and/or family business, has a commendable scholastic record and is active in extra-curricular activities (excluding athletics) or work. Must be enrolled for the upcoming Fall semester",
            "This scholarship is named after two individuals who supported and encouraged the education of all those in their lives. The scholarship honors a student who has financial need, has a commendable scholastic record and is active in extra-curricular activities (excluding athletics) or work. Must be enrolled for the upcoming Fall semester",
            "Student must be a full-time student and show an interest or connection to a family business. Student must be recommended by a member or sponsor of WFBF and have shown leadership or involvement in extracurricular activities (excluding athletics). Student must be enrolled for the upcoming Fall semester. The recipient is expected to attend at least one WFBF event during the year. See http://wfbf.uwosh.edu/Assets/scholarship.php for application. Deadline: February 13, 2015",
            "Applicants must be full-time undergraduate students admitted to the College of Business. Preference will be given to accounting majors. Applicants must possess high academic and leadership standards. Applicants must show financial need by submitting the financial aid form currently used by UW Oshkosh to determine allocation of federal and state grants and loans. Must be enrolled for the upcoming Fall semester.",
            "Student must be accepted “in good standing” into the College of Business as a junior and able to take upper-level courses. Student must be involved in extracurricular activities (excluding athletics). Student must have attributes important for business success. Must be enrolled for the upcoming Fall semester.",
            "Applicants must be full-time undergraduate students at the UW Oshkosh. Applicants must be accepted for admission to the College of Business(pursuing any business major). Applicants must demonstrate financial need. Applicants must be involved in community service projects, charitable organizations and/or extracurricular activities. Applicants must complete a personal statement describing their personal, educational and professional goals. Previous recipients may not reapply. Must be enrolled for the upcoming full academic year. If the award recipent’s situation changes (i.e. student graduates early), then the recipient will only be awarded 1/2 the intended award.",
            "Applicants must be a full-time undergraduate student at UW Oshkosh. Applicant must have completed a minimum of 75 credits and be admitted to the College of Business at the time application and must also be enrolled for the upcoming fall semester to be eligible.",
            "The student must be in good standing at the College of Business (junior or above, not in their graduation semester). The student must be involved in extracurricular activities (excluding athletics). Must be enrolled for the upcoming Fall semester",
            "Applicant must be full-time undergraduate students at the University of Wisconsin Oshkosh. Applicants must be sophomores (30-59 credits) with an intended business major at the time of application. The scholarship will be awarded to the student with the most need who meets the above criteria. Must be enrolled for the upcoming Fall semester.",
            "Applicant must be enrolled full-time, have completed a minimum of 75 credits and be admitted to the College of Business at the time of application and must also be enrolled for the upcoming academic year to be eligible. Applicants must also show an interest in entrepreneurship, small business and/or family business, have a commendable scholastic record and be active in extracurricular activities (excluding athletics). The student must also show evidence of entrepreneurial activities (declared emphasis, extracurricular activities, employment at a small business) to be considered.",
            "Be a full-time accounting major who has completed Intermediate Accounting or Cost Management. Student must possess outstanding qualities of character, scholastic ability and leadership. Must be enrolled for the upcoming Fall semester.",
            "Be a full-time accounting major who has completed Intermediate Accounting or Cost Management. Have shown a high level of achievement through academic and extra-curricular activities (excluding athletics). Must be enrolled for the upcoming Fall semester.",
            "Be an accounting major in their junior or senior year who has completed both Intermediate Accounting AND Cost Management; plan to use the scholarship for expenses related to their fourth or fifth year (defined as beyond the 90th credit); be active in organizations (have participated in one or more organizations (other than athletics) for two of the preceding three semesters at the university), show leadership in those organizations (by holding an office or showing evidence of active involvement in a committee of that organization) and show evidence of need (such as a statement indicating the extent to which the applicant has financed their own education). Must be enrolled for the upcoming Fall semester",
            "Be a full-time accounting major who has completed Intermediate Accounting or Cost Management. Student must possess outstanding qualities of character, scholastic ability and leadership. Must be enrolled for the upcoming Fall semester.",
            "Be an accounting major who has completed Intermediate Accounting or Cost Management and have an interest in Taxation although not required. Student must also show a high level of achievement through academic and extra-curricular activities (excluding athletics). Must be enrolled for the upcoming Fall semester.",
            "Be an accounting major who has completed Intermediate Accounting or Cost Management. Have shown a high level of achievement through academic and extra-curricular activities (excluding athletics). Must be enrolled for the upcoming Fall semester.",
            "Be a full-time (12+ credits) student majoring in accounting at the junior level having completed Intermediate Accounting I. Students must possess outstanding qualities of character, scholastic ability and leadership. Student must be enrolled for the upcoming Fall semester.",
            "Be a full-time (12+ credits) FEMALE student majoring in accounting at the junior level having completed Intermediate Accounting I. Students must possess outstanding qualities of character, scholastic ability and leadership. Student must be enrolled for the upcoming Fall semester.",
            "Student must be a female Finance or Accounting major. A student must be of senior status as of Fall 2014. Must be enrolled for the upcoming Fall semester.",
            "Applicants must be enrolled for the upcoming Fall semester as a full-time student declared as an Insurance Minor. The ideal recipient(s) will have demonstrated leadership skills in student organizations/extracurricular activities (excluding athletics) and core values in alignment with those emphasized in SECURA’s core principles. Additionally, the recipient’s primary residence should be in one of the following WI counties: Brown, Calumet, De Pere, Fond du Lac, Outagamie, Waupaca, Waushara, or Winnebago. Applicants must complete a statement explaining WHY they’re applying for the scholarship and WHY they’re interested in the insurance industry and attach BOTH to the application.",
            "Applicant must be full-time junior level student majoring in Finance with at least one semester remaining after the semester applying and be in good standing. Applicants must possess outstanding qualities of character, scholastic ability and leadership. Preference will be given to students who provide strong evidence of community service, outside of University related activities. Must be enrolled for the upcoming Fall semester.",
            "Applicant must be full-time junior level student majoring in Finance with at least one semester remaining after the semester applying and be in good standing. Applicants must possess outstanding qualities of character, scholastic ability and leadership. Preference will be given to students who provide strong evidence of community service, outside of University related activities. Must be enrolled for the upcoming Fall semester.",
            "Applicant must be full-time junior level student majoring in Finance with at least one semester remaining after the semester applying and be in good standing. Preference will be given to students with an interest in investments. Students must possess outstanding qualities of character, scholastic ability and leadership. Preference will be given to students who provide strong evidence of community service, outside of University related activities.",
            "Student must be a Finance major or a member of Sigma Pi Fraternity. Student must have junior or senior status at the time of application. Student must have shown a high level of achievement through academic and extracurricular activities (excluding athletics). Must be enrolled for the upcoming Fall semester.",
            "Student must be Junior status and have completed IS 201 OR CS 221 with a B or better AND be enrolled or completed IS 318 OR CS 262. Student must have demonstrated a commitment to the IS/IT field outside of the classroom (club leadership, internship or other outside activities). Student must provide a statement about why they have chosen the IS/CS (information technology field) as a career. No proof of financial need is required.",
            "Applicant must be a full-time student of at least junior status at UW Oshkosh College of Business majoring in Supply Chain Mgmt and be enrolled for the following fall term. Applicant must have shown a high level of academic success and be involved in extra-curricular activities (non-athletic) and must show evidence of financial need. An award report from the Financial Aid Office is encouraged."
        ]
    ],
    "pageTitle": "Scholarships — University of Wisconsin Oshkosh College of Business",
    "title": "",
    "url": "http://www.uwosh.edu/cob/about/centers/business-success-center/undergraduate/scholarships/scholarships",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 820995359,
    "recordOffset": 820971833,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17066=Student must be a female Finance or Accounting major. A student must be of senior status as of Fall 2014. Must be enrolled for the upcoming Fall semester., 4812=Student must be a full-time student and show an interest or connection to a family business.  Student must be recommended by a member or sponsor of WFBF and have shown leadership or involvement in extracurricular activities (excluding athletics).  Student must be enrolled for the upcoming Fall semester.  The recipient is expected to attend at least one WFBF event during the year. See http://wfbf.uwosh.edu/Assets/scholarship.php for application. Deadline: February 13, 2015, 4678=1000}",
    "textBeforeTable": "All scholarship recipients are expected to attend the Undergraduate Honors and Awards Banquet so that they may meet with their scholarship donor(s).  Recipients who choose NOT to attend will lose their scholarship. Spring Semester Student must be accepted “in good standing” into the College of Business as a junior and able to take upper-level courses and have a minimum 2.5 combined GPA.   Student must be involved in extracurricular activities (excluding athletics).   Student must have attributes important for business success. $1000                  College of Business Alumni Association Scholarship All Business Majors Applicant must be accepted as an incoming freshman at UW Oshkosh, have a cumulative GPA of 2.75 or higher, and have declared themselves as a pre-business major.  This scholarship will be renewable for a maximum of two-years if the following requirements are met: Scholarship recipients must participate in the normal business sequence of classes that include MATH 204-Finite Math for Business, MATH 206-Applied Calculus for Business, BUSINESS 198-Intro to Business, and ECON 204-Principles of Macroeconomics.  Scholarship recipients must maintain at least a GPA of 2.75 and be in good standing with the College of Business and UW Oshkosh to qualify for the 2nd year pay-out.  Applicants must possess outstanding qualities of character, scholastic ability and servant leadership.  Preference will be given to students who provide strong evidence of community service, outside of University related activities.",
    "textAfterTable": "    Navigation Home About Undergraduate Academic Programs Advising Admission to the College Professional Development Honors & Scholarships Beta Gamma Sigma Student Ambassadors Program Business Scholars Program",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}