{
    "relation": [
        [
            "S",
            "",
            "4",
            "11",
            "18",
            "25"
        ],
        [
            "M",
            "",
            "5",
            "12",
            "19",
            "26"
        ],
        [
            "T",
            "",
            "6",
            "13",
            "20",
            "27"
        ],
        [
            "W",
            "",
            "7",
            "14",
            "21",
            "28"
        ],
        [
            "T",
            "1",
            "8",
            "15",
            "22",
            "29"
        ],
        [
            "F",
            "2",
            "9",
            "16",
            "23",
            "30"
        ],
        [
            "S",
            "3",
            "10",
            "17",
            "24",
            ""
        ]
    ],
    "pageTitle": "River splits at Southwest | Pearl River Community College",
    "title": "",
    "url": "http://prcc.edu/?q=news/river-splits-southwest-2&mini=2012-11",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 191241464,
    "recordOffset": 191225070,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12647=SUMMIT Pearl River Lady Wildcats split with Southwest Mississippi in an MACJC South Division softball doubleheader here Tuesday, falling 2-1 in the first game of the twin bill before rebounding with a 3-1 victory in the nightcap. PRCC, which swept SMCC 11-2 and 12-0 (five innings) in a previous match up played March 29 in Poplarville, is now 16-15 overall and 8-6 in division play; while the host Lady Bears are 6-22 and 4-14. In the first game, Pearl River went up 1-0 in the top of the first. That narrow edge remained intact until the bottom of the third when Southwest tied it up before scoring the game-winning run in the sixth. Starter Rachel Smith picked up the win in going the distance, giving up six hits, striking out eight, and hitting one batter. Reliever Neely McCrary (3-5) of Petal High got the loss after taking over the mound in the fifth. She gave up a hit and walked a batter, while starter Brittany LeBlanc out of North Vermillion High in Lafayette, La., went four frames, giving up four hits, striking out one, and hitting a batter. Shannon Brown of Petal High and Whitney Waits of Oak Grove High paced The River six-hit effort with two singles each, while Heather Hester of Hancock County High and ETrareo Warren of Meridian High both had base hits The Lady Bears finished with five hits, led by Tipheri Grimes home run. Grace Bravada, Camden Graham, Victoria Price, and Mandy Szigeti all singled. SMCC played error free, while PRCC committed one defensive miscue in the game. In the nightcap, things were scoreless for the first two innings, but Pearl River went up 3-0 with a pair of runs in the top of the third and a solo run in the fourth. Southwest scored its only run of the game in the fifth. Starter McCrary (4-5) got the win in her three innings on the mound, giving up three hits, walking one and hitting a batter; while Hester relieved in the fourth. She gave up three hits, struck out five, walked one, and hit a batter. Smith got the loss, giving up five hits, striking out six, and walking six. The Lady Wildcats finished with five hits, led by Hester home run, while Brown, Janessa Dedeaux of Poplarville High, Alyssa Graeter of Poplarville High, and Waits all had base hits. Anissia Franklin led the Lady Bears six-hit attack with three singles, while Aseye Attipoe, Brooke Szigeti, and Mandy Szigeti all had base hits. Again, Southwest played error free, while Pearl River committed two. PRCC returns to South Division action Thursday when Miss. Gulf Coast plays host with a 3 p.m. make-up doubleheader in Perkinston, which was originally scheduled for March 21, but was rained out. The Lady Wildcats then host MGCCC Saturday in a 12 noon division twin bill in Poplarville., 17313=Copyright © 2012-2013 by Pearl River Community College. All rights reserved. PRCC, 101 Highway 11 North, Poplarville, Mississippi 39470. (601) 403-1000.}",
    "lastModified": "Fri, 31 Jul 2015 23:45:27 +0000",
    "textBeforeTable": "  » «   November Press Release Archive River splits at Southwest Community Athletics Current Students Future Students Academics About Us Home Main menu",
    "textAfterTable": "April 11, 2012 - 1:36pm -- braswell SUMMIT Pearl River Lady Wildcats split with Southwest Mississippi in an MACJC South Division softball doubleheader here Tuesday, falling 2-1 in the first game of the twin bill before rebounding with a 3-1 victory in the nightcap. PRCC, which swept SMCC 11-2 and 12-0 (five innings) in a previous match up played March 29 in Poplarville, is now 16-15 overall and 8-6 in division play; while the host Lady Bears are 6-22 and 4-14. In the first game, Pearl River went up 1-0 in the top of the first. That narrow edge remained intact until the bottom of the third when Southwest tied it up before scoring the game-winning run in the sixth. Starter Rachel Smith picked up the win in going the distance, giving up six hits, striking out eight, and hitting one batter. Reliever Neely McCrary (3-5) of Petal High got the loss after taking over the mound in",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}