{
    "relation": [
        [
            "Most runs",
            "Year",
            "2014",
            "2013",
            "2012",
            "2011",
            "2010"
        ],
        [
            "",
            "Player",
            "Adam Lyth",
            "Moeen Ali",
            "Nick Compton",
            "James Taylor",
            "Adam Lyth"
        ],
        [
            "",
            "Mat",
            "17",
            "17",
            "14",
            "17",
            "16"
        ],
        [
            "",
            "Inns",
            "24",
            "29",
            "21",
            "32",
            "29"
        ],
        [
            "",
            "NO",
            "1",
            "5",
            "6",
            "3",
            "0"
        ],
        [
            "",
            "Runs",
            "1,619",
            "1,420",
            "1,494",
            "1,602",
            "1,509"
        ],
        [
            "",
            "Ave",
            "70.39",
            "59.16",
            "99.6",
            "55.24",
            "52.03"
        ],
        [
            "",
            "100",
            "7",
            "4",
            "5",
            "3",
            "3"
        ],
        [
            "",
            "50",
            "6",
            "8",
            "7",
            "10",
            "9"
        ],
        [
            "",
            "Notes",
            "No England place",
            "Test debut June 2014",
            "Test debut Nov 2012",
            "Test debut Aug 2012",
            "No England place"
        ]
    ],
    "pageTitle": "Rob Minto | Sport, data, ideas and miscellany | Page 2",
    "title": "",
    "url": "http://www.minto.net/page/2/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00074-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 591128543,
    "recordOffset": 591096354,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42805=Update (May 15): Adam Lyth has now been called into the England Test squad and will probably make his debut against New Zealand., 66206=For starters, the England-France match equalled the highest total number of tries in a 6N match (12) and was the second highest points total with 90. The only match that surpasses it in points (and equals it in tries) is the England-Italy match from 2001, but that was an 81-23 thrashing, mid-tournament., 67597=In those years, the outcome of the tournament was also in the balance on the final weekend. Wales won in 2005, securing the Grand Slam, although France had racked up seven tries against Italy to keep their title hopes alive. In 2007, France scored a last-minute try to take the title over Ireland by just 4 points. And in 2014, Ireland’s narrow 2-point victory over France (again with last-minute drama) gave them the title on points difference over England., 66989=In total, 27 tries were scored on the last day of the 2015 6N. That’s 44 per cent of the tries scored in the whole competition. Compare that to 2012, when just four tries were scored on the last day., 72770=In the Double-winning 2009/10 campaign, when we were the country’s outstanding attacking team, we were awarded 12 league penalties., 5417=FOOTBALL You might hate Sepp Blatter, but he understands the world better than you, you irrelevant Westerner. Meanwhile, Qatar’s World Cup death rate is now over 60 per match, and Brazil’s 2014 legacy is already a mess., 67204=The only other years that come close are 2005, 2007 and 2014, which also saw 20 or more tries on the last day (also all above 30 per cent of the total tries)., 73896=Two other teams have also been awarded 12 penalties in one campaign. Can you guess which teams they are? Have a go. Other league winners? Nope. In fact, it was Liverpool, in 2013-14 when they finished second; and Crystal Palace, in 2004-05, finishing in 18th place!, 75186=Put another way: only four times in the sixteen years of data have the team winning the league also been awarded the most penalties (Arsenal 2001-02, Manchester United 2002-03, 2007-08 and Chelsea 2009-10). Penalties are not some divine right of the best team. History shows that a team can be given a lot of penalties and still finish low down the league. Just ask Palace. Or Sunderland (6 penalties, 14th place last year). Or Blackpool (8 penalties, 19th place in 2010-11). Or West Ham (9 penalties, 17th place in 2009-10)., 81192=Peter Moores: ‘We’ll have to have a look at the data.’ That one sentence should stand as lasting indictment of England cricket in 2015., 81344=— Oliver Brown (@oliverbrown_tel) March 9, 2015, 108511=© 2015 Rob Minto, 73601=Chelsea did indeed get 12 penalties in 2009-10. But this is an outlier – in fact, for all the penalties data I could get from the 1998-99 season onwards, it is the highest number given to one team in a single season., 81838=— Piers Morgan (@piersmorgan) March 9, 2015, 61521=But since 2005, there have been none below the 17 second mark. As the chart below of the rolling 10-year average shows, since 1999 the times are getting slower. (I’ve used the 10-year average to smooth out what is otherwise a very bumpy chart, and show the trend. The average also mitigates the impact of the bad-weather years.), 61152=For many years, as boat technology improved and crews trained harder and smarter, and the rowers became international pros, the winning time came down. From the 1950s to 2000, typical times went from around 20 minutes to 17. The course record was set in 1998, at 16:19 by Cambridge. From 1996 to 2005, 5 of the 10 winning times were sub-17 seconds., 48750=(In 2011 Marcus Trescothick was the leading run scorer and had the highest average in county cricket, but had retired from the England team. In 2010 the most runs were scored by Mark Ramprakash – again, retired from the England team.)}",
    "textBeforeTable": "But if you look at the players who have scored the highest total runs in a county season, or had the highest average over a season (excluding overseas players and retired England players), there is a better chance of picked for the Test side. Adam Lyth would seem to have a better claim for a Test place then KP. All of the above players have hit 250-plus in county cricket. None have been picked for England’s senior Test side. Alex Gidman Alex Lees James Hildreth Andrew Gale Adam Lyth If it was, then here are a list of people who would have been picked for England in the last 5 years: This is nothing to do with that book (the one that trashed the ECB, former and current coaches and captains). It is quite simply that one innings isn’t enough. KP has been misguided and is confused, and here’s why. “All I can do is score runs, that’s it. “I’ve got runs, I’ve got a county and I do believe I’m good enough to play for England. “All I’ve been asked to do by the chairman-elect is to get a county and get runs,” said Pietersen. He thinks so. He said afterwards: When a player hits 300-plus for their county, it’s hard not to take notice. But should Kevin Pietersen’s massive innings for Surrey get him back in the team? —– Update (May 15): Adam Lyth has now",
    "textAfterTable": "  Most runs Year Player Mat Inns NO Runs Ave 100 50 Notes 2014 Adam Lyth 17 24 1 1,619 70.39 7 6 No England place 2013 Moeen Ali 17 29 5 1,420 59.16 4 8 Test debut June 2014 2012 Nick Compton 14 21 6 1,494 99.6 5 7 Test debut Nov 2012 2011 James Taylor 17 32 3 1,602 55.24 3 10 Test debut Aug 2012 2010 Adam Lyth 16 29 0 1,509 52.03 3 9 No England place (In 2011 Marcus Trescothick was the leading run scorer and had the highest average in county cricket, but had retired from the England team. In 2010 the most runs were scored by Mark Ramprakash – again, retired from the England team.) Highest innings in season Year Player Runs Team Match Date Notes 2014 Alex Gidman 264 Gloucs 09-Sep-14 No England place 2013 Alex Lees 275* Yorkshire 17-Jul-13 No England place 2012 James Hildreth 268 Somerset 31-Mar-12 No England place 2011 Michael Carberry 300* Hampshire 02-Aug-11 Test debut Mar 2010 (1 test), recalled Nov 2013, more than 2 years later 2010 James Taylor 206* Leics 29-May-10 Test debut Aug 2012 (after 2011 season, see above) The selectors have been very clear in their methods – they reward",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}