{
    "relation": [
        [
            "Summer 2015",
            "CFRM 520 (2) Energy Markets Analytics and Derivatives *A Term Only*",
            "CFRM 561 (4) Advanced Trading Systems",
            "",
            "",
            ""
        ],
        [
            "September 2015",
            "CFRM 540 (2) Investment Science I",
            "CFRM 463 (1 NC) R Programming for Quantitative Finance",
            "",
            "",
            ""
        ],
        [
            "Autumn 2015",
            "CFRM 541 (4) Investment Science II",
            "CFRM 544 (4) Options & Derivatives",
            "CFRM 510 (4) Financial Data Access with SQL, VBA, Excel",
            "CFRM 547 (4) Credit Risk Management",
            "CFRM 555 (4) Optimization Methods in Finance"
        ],
        [
            "Winter 2016",
            "CFRM 542 (4) Financial Data Modeling/Analysis with R",
            "CFRM 558 (4) Fixed Income Analytics & Portfolio Management",
            "CFRM 557 (4) Finance Software & Systems Integration with C++",
            "CFRM 559 (4) Stochastic Calculus for Derivatives",
            "AMATH 582 (5) Computational Methods for Data Analysis"
        ],
        [
            "Spring 2016",
            "CFRM 543 (4) Portfolio Optimization & Asset Management",
            "CFRM 546 (4) Financial Risk Management II",
            "CFRM 548 (4) Monte Carlo Methods in Finance",
            "CFRM 551 (4) Foundations of Electronic Trading",
            "AMATH 583 (5) High Performance Scientific Computing"
        ]
    ],
    "pageTitle": "Introduction to MS-CFRM | Computational Finance & Risk Management",
    "title": "",
    "url": "http://depts.washington.edu/compfin/node/2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 66477820,
    "recordOffset": 66461852,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30129=As of March 30, 2014, the 2012-13 classroom cohort employment results are as follows:, 25624=As of April 2015, the 2013-14 classroom cohort employment results are as follows:, 33515=As of April 2013, the 2011-12 classroom cohort employment results are as follows:, 7406=Below are the courses scheduled to be offered during the 2015 - 2016 academic year.}",
    "lastModified": "Sat, 01 Aug 2015 00:41:36 GMT",
    "textBeforeTable": "Schedule is subject to change. Below are the courses scheduled to be offered during the 2015 - 2016 academic year.     Course Schedule 2015-2016   The MS-CFRM is a MS degree program offered by the Department of Applied Mathematics (AMATH) within the College of Arts and Sciences. It is offered with 3 options: a 42 credit General program option, a 54 credit Risk Management option with extended internship, and a 54 credit Computing option with extended internship. As with other MS and PhD degrees at the University of Washington, the MS-CFRM degree is awarded by the University of Washington Graduate School.  Separate study options in computing and risk management as critical focal points in today’s markets Integration of theory, methods, and computation Classical volatility and mean-variance methods of risk analysis and portfolio optimization, modern fat tails and tail risk methods of risk management, and portfolio optimization Extensive instruction in use of the open source R-programming environment and rapid growth of cutting edge R finance packages Rigorous mathematical and statistical foundations of quantitative finance What the program covers   For students and current professionals with strong mathematical and quantitative skills, the MS-CFRM degree program provides exciting new opportunities for advancement in a new or current career pathway in the numerous fields in finance. The Master of Science in Computational Finance and Risk Management (MS-CFRM) addresses the",
    "textAfterTable": "*(#) indicates the number of credits. *NC = no credit applied towards the MS-CFRM degree. *Courses in bold are required for the MS-CFRM effective autumn 2014; other courses shown may be taken as electives. *CFRM 463 and CFRM 510 exemptions require Professor Yollin approval. Campus Full-time CFRM offers a full-time Masters degree on the University of Washington-Seattle campus. Full-time students will be able to finish the basic general degree in 18 months on average, which includes a summer internship. All campus-based students attend courses on a full-time basis; local online students can attend courses in person with faculty permission. Classroom students who pursue a special emphasis focus in either the Computing option or the Risk Management option and who are also engaged in a 12 month internship or half-time work can expect to complete the degree in two academic years. The platforms used in the classroom include the Canvas Learning Management System (LMS), the Sonic Foundry’s MediaSite system for class capture, and Adobe Connect Meeting for interactive classroom meetings and TA discussions. If you are considering visiting the University of Washington campus before applying or enrolling please visit us at Lewis Hall as well as stop by the UW Information & Visitors Center.   Online Part-Time",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}