{
    "relation": [
        [
            "Citing Patent",
            "US5778389 *",
            "US5956719 *",
            "US6625622 *",
            "US6694339 *",
            "US6711578 *",
            "US6751795 *",
            "US6879996",
            "US7519963 *",
            "US7668901",
            "US7716312",
            "US8554888",
            "US20040068523 *",
            "USRE42465 *",
            "EP1892921A2 *",
            "WO2004034283A2 *"
        ],
        [
            "Filing date",
            "May 23, 1996",
            "Mar 13, 1997",
            "Aug 23, 1999",
            "Nov 22, 2000",
            "Jan 17, 2001",
            "Dec 16, 1999",
            "Sep 13, 2000",
            "Dec 21, 2006",
            "Apr 15, 2002",
            "Nov 13, 2002",
            "Apr 26, 2011",
            "Oct 7, 2002",
            "Mar 23, 2006",
            "Oct 26, 2001",
            "Oct 3, 2003"
        ],
        [
            "Publication date",
            "Jul 7, 1998",
            "Sep 21, 1999",
            "Sep 23, 2003",
            "Feb 17, 2004",
            "Mar 23, 2004",
            "Jun 15, 2004",
            "Apr 12, 2005",
            "Apr 14, 2009",
            "Feb 23, 2010",
            "May 11, 2010",
            "Oct 8, 2013",
            "Apr 8, 2004",
            "Jun 14, 2011",
            "Feb 27, 2008",
            "Apr 22, 2004"
        ],
        [
            "Applicant",
            "Electronic Data Systems Corporation",
            "Fujitsu Limited",
            "Eisenworld, Inc.",
            "Sony Corporation",
            "Palmsource, Inc.",
            "Nec Corporation",
            "Edward W. Laves",
            "Symantec Corporation",
            "Avid Technology, Inc.",
            "Avid Technology, Inc.",
            "Sony Corporation",
            "Keith Robert Olan",
            "Access Co., Ltd.",
            "Intel Corporation (a Delaware Corporation)",
            "William R Henshall"
        ],
        [
            "Title",
            "Method and system for synchronizing computer file directories",
            "Synchronization method applied to databases in network management system",
            "Apparatus and method for transfering information between platforms",
            "File management device and method thereof, and audio visual data recording/reproducing device and method thereof",
            "Rule-based, n-way, synchronization of multiple copies of a database",
            "System and method for software installation",
            "Method and apparatus for displaying personal digital assistant synchronization data using primary and subordinate data fields",
            "Layered computing systems and methods with location exclusions",
            "Methods and system using a local proxy server to process media data for local area users",
            "Method and system for transferring large data files over parallel connections",
            "Content management system for searching for and transmitting content",
            "Method and system for full asynchronous master-to-master file synchronization",
            "Rule-based, n-way, synchronization of multiple copies of a database",
            "Method and sytem for managing distributed content and related metadata",
            "Method and system for full asynchronous master-to-master file synchronization"
        ]
    ],
    "pageTitle": "Patent US5680609 - Method and apparatus for synchronizing file deletions in computer systems - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5680609?dq=5251294",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988650.6/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474958799,
    "recordOffset": 474937367,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Thus a method and apparatus for synchronizing file deletions across similarly configured file-systems in multiple computer systems is described. Although the present invention has been described herein with reference to a specific preferred embodiment, many modifications and variations therein will readily occur to those skilled in the art. Accordingly, all such variations and modifications are included within the intended scope of the present invention as defined by the following claims. In an environment where only two computers are to be synchronized to each other, it is possible to simplify this so that only a single copy of the database is kept on one of the computers. 1-2, 3-4, 5-6 ends round 3 Int (N+1)/2! sync rounds are required for a ring and {Int log2(N -1)!-1} is the best case for a topology with computers synchronizing in pairs shown in the illustration above. 1-2, 3-4, 5-6 ends round 2 1-2, 3-4, 5-6 ends round 1 In an alternate embodiment, the present invention may be utilized in a multiple computer setting which requires additional synchronization be done in a general N-way case. Assuming 6 computers in a ring arrangement with 1 tied to 2 tied 3, etc., and 6 tied back to 1. If a synchronization session is held between 1-2- 3-4 and 5-6, with 3 shown in boldface and underlined to indicate it is the most recent file, the progress of synchronization by round robin is as",
    "textAfterTable": "Referenced by Citing Patent Filing date Publication date Applicant Title US5778389 * May 23, 1996 Jul 7, 1998 Electronic Data Systems Corporation Method and system for synchronizing computer file directories US5956719 * Mar 13, 1997 Sep 21, 1999 Fujitsu Limited Synchronization method applied to databases in network management system US6625622 * Aug 23, 1999 Sep 23, 2003 Eisenworld, Inc. Apparatus and method for transfering information between platforms US6694339 * Nov 22, 2000 Feb 17, 2004 Sony Corporation File management device and method thereof, and audio visual data recording/reproducing device and method thereof US6711578 * Jan 17, 2001 Mar 23, 2004 Palmsource, Inc. Rule-based, n-way, synchronization of multiple copies of a database US6751795 * Dec 16, 1999 Jun 15, 2004 Nec Corporation System and method for software installation",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}