{
    "relation": [
        [
            "Cited Patent",
            "US4754321 *",
            "US4878756 *",
            "US4945406 *",
            "US5038216 *",
            "US5216493 *",
            "US5548331 *",
            "US5772299 *",
            "US20020044147 *"
        ],
        [
            "Filing date",
            "Oct 7, 1986",
            "Aug 8, 1988",
            "Nov 7, 1988",
            "Apr 20, 1989",
            "Feb 19, 1992",
            "Aug 23, 1993",
            "Nov 21, 1995",
            "Sep 4, 2001"
        ],
        [
            "Publication date",
            "Jun 28, 1988",
            "Nov 7, 1989",
            "Jul 31, 1990",
            "Aug 6, 1991",
            "Jun 1, 1993",
            "Aug 20, 1996",
            "Jun 30, 1998",
            "Apr 18, 2002"
        ],
        [
            "Applicant",
            "Zenith Electronics Corporation",
            "Honeywell Inc.",
            "Eastman Kodak Company",
            "Eastman Kodak Company",
            "Eastman Kodak Company",
            "Canon Kabushiki Kaisha",
            "Lg Electronics Inc.",
            "Martin Russel A."
        ],
        [
            "Title",
            "Integratable color correction circuit",
            "Method and apparatus for sensing color",
            "Apparatus and accompanying methods for achieving automatic color balancing in a film to video transfer system",
            "Automatic brightness algorithm in a slide to video transfer unit",
            "Multipoint digital automatic white balance for a video system",
            "Clamping circuit",
            "Optical apparatus for liquid crystal display projector",
            "Bi-directional data transfer using two pair of differential lines as a single additional differential pair"
        ]
    ],
    "pageTitle": "Patent US20040104923 - Color correction circuit and image display apparatus including the same - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20040104923?dq=%22peter+l+basel%22+%22lsi+logic%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989142.82/warc/CC-MAIN-20150728002309-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 472791663,
    "recordOffset": 472771899,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations [0104] The scope and spirit of the present invention are indicated by the appended claims, rather than by the foregoing description. [0103] Selection of the reference chromaticity points R0, G0, and B0 in this manner causes only positive values to be set to the offsets to be added to the G signal and the B signal, in order to make the chromaticity point of the color R approach to the position of the reference chromaticity point R0 in response to the R signal having a certain tone value. Even when the tone values of the original G signal and B signal are equal to 0, the offsets can be added to the G signal and the B signal to make the chromaticity point of the color R approach to the position of the reference chromaticity point R0. This arrangement also ensures such approach with regard to the chromaticity points of the other colors G and B. [0102] A triangle is specified by each combination of selected R, G, and B chromaticity points as three vertexes. Such triangles are formed regard to all the possible combinations of the R, G, and B chromaticity points. The triangle located at an inner-most position (a solid triangle in the example of FIG. 9) is then extracted among all the triangles. The R, G, and B chromaticity points as the three vertexes of",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US7446779 Mar 1, 2004 Nov 4, 2008 Canon Kabushiki Kaisha Color signal correction apparatus, color signal correction method and image display apparatus US8692841 * Dec 9, 2011 Apr 8, 2014 Samsung Display Co., Ltd. Methods for modifying color data and display systems implementing the methods US20040189657 * Mar 1, 2004 Sep 30, 2004 Canon Kabushiki Kaisha Color signal correction apparatus, color signal correction method and image display apparatus US20120169780 * Jul 5, 2012 Samsung Electronics Co., Ltd. Method of compensating data, data compensating apparatus for performing the method and display apparatus having the compensating apparatus US20130147824 * Jun 13, 2013 Anthony Botzas Methods for modifying color data and display systems implementing the methods CN101976540A *",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}