{
    "relation": [
        [
            "Date",
            "Oct 2, 2000",
            "Dec 11, 2001",
            "Aug 21, 2003",
            "Nov 19, 2007",
            "Nov 26, 2007",
            "Jul 6, 2009",
            "Sep 23, 2011"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "",
            "Owner name: TAMIRAS PER PTE. LTD., LLC,DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:GENESIS MICROCHIP INC.;REEL/FRAME:022915/0929 Effective date: 20090313",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6738884 - Method and apparatus for processing data with semaphores - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6738884?dq=7,346,545",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 12,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00113-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484608871,
    "recordOffset": 484579148,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23275=This application claims the benefit of U.S. application Ser. No. 60/170,668 filed Dec. 14, 1999 entitled “Multi-Component Decoding” and U.S. application Ser. No. 60/170,607 filed Dec. 14, 1999 entitled “Method of Processing Data,” which are both hereby incorporated by reference.}",
    "textBeforeTable": "Patent Citations It is thought that the apparatuses and methods of the embodiments of the present invention and many of its attendant advantages will be understood from this specification and it will be apparent that various changes may be made in the form, construction and arrangement of the parts thereof without departing from the spirit and scope of the invention or sacrificing all of its material advantages, the form herein before described being merely exemplary embodiments thereof. For related subject matter concerning this invention, reference is made to U.S. patent applications Ser. No. 09/672,517 entitled “Method and Apparatus for Performing Distributed Processing of Program Code” and Ser. No. 09/671,932 entitled “Method and Apparatus for Multi-Part Processing of Program Code by a Single Processor” and 09/678,857 entitled “Multi-Component Processor, which are hereby incorporated by reference. It is also noted that many of the structures and acts recited herein can be recited as means for performing a function or steps for performing a function, respectively. Therefore, it should be understood that such language is entitled to cover all such structures or acts disclosed within this specification and their equivalents. In addition to embodiments where the invention is accomplished by hardware, it is also noted that these embodiments can be accomplished through the use of an article of manufacture comprised of a computer usable medium having a computer readable program code embodied therein, which causes the enablement of the functions and/or",
    "textAfterTable": "US5148533 * Jan 5, 1989 Sep 15, 1992 Bull Hn Information Systems Inc. Apparatus and method for data group coherency in a tightly coupled data processing system with plural execution and data cache units US5276847 * Jul 9, 1992 Jan 4, 1994 Intel Corporation Method for locking and unlocking a computer address US5335325 Mar 26, 1990 Aug 2, 1994 Kendall Square Research Corporation High-speed packet switching apparatus and method US5465361 Dec 13, 1993 Nov 7, 1995 The Regents Of The University Of California Microcode linker/loader that generates microcode sequences for MRI sequencer by modifying previously generated microcode sequences US5479638 Mar 26, 1993 Dec 26, 1995 Cirrus Logic, Inc. Flash memory mass storage architecture incorporation wear leveling technique US5491827 Jan 14, 1994 Feb 13, 1996 Bull Hn Information Systems Inc. Secure application card for sharing application data and procedures among a plurality of microprocessors US5499348 Jun 27, 1994 Mar 12, 1996 Matsushita Electric Industrial",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}