{
    "relation": [
        [
            "Citing Patent",
            "US6962213 *",
            "US7699104",
            "US7856906 *",
            "US7931083",
            "US8925653 *",
            "US20040245019 *",
            "US20120217011 *",
            "EP2203624A2 *",
            "WO2011025590A1 *",
            "WO2011025591A1 *",
            "WO2014105400A2 *",
            "WO2015015222A1 *"
        ],
        [
            "Filing date",
            "Feb 19, 2004",
            "May 23, 2007",
            "May 31, 2007",
            "Apr 7, 2010",
            "Feb 28, 2011",
            "Feb 19, 2004",
            "Feb 28, 2011",
            "Oct 1, 2008",
            "Jul 9, 2010",
            "Jul 9, 2010",
            "Dec 9, 2013",
            "Aug 1, 2014"
        ],
        [
            "Publication date",
            "Nov 8, 2005",
            "Apr 20, 2010",
            "Dec 28, 2010",
            "Apr 26, 2011",
            "Jan 6, 2015",
            "Dec 9, 2004",
            "Aug 30, 2012",
            "Jul 7, 2010",
            "Mar 3, 2011",
            "Mar 3, 2011",
            "Jul 3, 2014",
            "Feb 5, 2015"
        ],
        [
            "Applicant",
            "Hartwick Patrick W",
            "Maoz Betzer Tsilevich",
            "Honeywell International Inc.",
            "Ex-Tar Technologies Inc.",
            "TD Tools, Inc.",
            "Hartwick Patrick W.",
            "Dotson Thomas L",
            "Raymond C. Davis",
            "Exxonmobil Upstream Research Company",
            "Exxonmobil Upstream Research Company",
            "Ge Oil & Gas Esp, Inc.",
            "Orbital Power Ltd"
        ],
        [
            "Title",
            "Sleeve piston fluid motor",
            "Integrated system and method for steam-assisted gravity drainage (SAGD)-heavy oil production using low quality fuel and low quality water",
            "Gear assemlby including a wear component for use with metal housings",
            "Integrated system and method for steam-assisted gravity drainage (SAGD)-heavy oil production to produce super-heated steam without liquid waste discharge",
            "Apparatus and method for high pressure abrasive fluid injection",
            "Sleeve piston fluid motor",
            "Apparatus and method for high pressure abrasive fluid injection",
            "Oil well pump apparatus",
            "Dense slurry production methods and systems",
            "Artificial lift modeling methods and systems",
            "Artificial lift method for low pressure sagd wells",
            "A rotary engine"
        ]
    ],
    "pageTitle": "Patent US20030044299 - Fluid displacement apparatus and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20030044299?ie=ISO-8859-1&dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469296583,
    "recordOffset": 469255501,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{47131=[0005] Pumping the production oil or slurry from the lower horizontal bore presents a number of challenges. An artificial lift, or pumping, system must be able to operate even when the “liquid” to be pumped is rather abrasive. For example, some design criteria are based on slurries that may contain typically 3% by weight, and for short periods as much as 30% by weight, of abrasives, such as sand The pumping technology must be capable of handling a high volume of formation solids in the presence of high gas oil ratios (GOR). The system may well be called upon to handle slugs of hydrocarbon gas and steam created by flashing of water into vapour. On occasion the system may run dry for periods of time. As such, it is desirable that the system be capable of processing gases, and of running “dry”. It is also desirable that a pump, and associated tubing, be able to operate to a depth of 1000 M below well-head, or more, with an allowance of 100 psi as the minimum flow-line input pressure. It is also desirable that the equipment be able to operate in chemically aggressive conditions where pH is +/−10., 62253=[0020] Some of the tube passages must be formed in a manner to contain significant pressure. For an actual operating differential pressure in the range of 0-2000 p.s.i. it may be desirable to use pipe that can accommodate pressures up to, for example, 8,000 p.s.i. seamless steel pipe can be obtained that is satisfactory for this purpose. Electrical resistance welded pipe (ERW) that is suitable for this purpose can also be obtained. The steel pipe can then be roll formed to the desired cross-sectional shape.}",
    "textBeforeTable": "Referenced by [0149] Various embodiments of the invention have now been described in detail. Since changes in and or additions to the above-described best mode may be made without departing from the nature, spirit or scope of the invention, the invention is not to be limited to those details, but only by the appended claims. [0148] In FIG. 12, the hydraulic diameter of the tubes is less than the quotient obtained by dividing the perimeter of the particular tube by π. Similarly the cross-sectional area of at least two of the tubes is less than the square of the perimeter divided by 4π. [0147] P=Perimeter of the passage. [0146] A=Cross sectional area of the passage; and [0145] Where: Dh=4A/P [0144] In the side-by-side embodiment of FIG. 12, none of the cross-sectional areas of any of the individual tube sections overlaps the area of any other, as would be otherwise be the case in a nested pipe arrangement. Further, it is a matter of mathematical calculation that the centroid of the cross-sectional area of any of the tube sections of the preferred embodiment of FIG. 12, lies outside the cross-sectional area of any of the other tubes that are in side-by-side relationship. The hydraulic diameter, Dh of a passageway is given by the formula: [0143] The",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 418/206.9, 418/206.7, 418/152, 418/1, 418/132 International Classification F04C2/18, F04C2/08, F04C13/00, E21B43/12 Cooperative Classification F04C13/008, F04C2/082, E21B43/129, F04C2/18 European Classification F04C13/00E, E21B43/12B12, F04C2/08B, F04C2/18 Rotate Original Image",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}