{
    "relation": [
        [
            "Cited Patent",
            "US3611061 *",
            "US3802069 *",
            "US3821847 *",
            "US4209355 *",
            "US4234666 *",
            "US4385202 *",
            "US4394530 *",
            "US4410927 *",
            "US4449165 *",
            "US4472876 *",
            "US4474292 *",
            "US4510017 *",
            "US4514750 *",
            "US4524238 *",
            "US4607276 *",
            "US4656499 *",
            "US4684975 *",
            "US4701363 *",
            "US4704187 *",
            "US4721993 *",
            "US4735678 *",
            "US4736236 *",
            "US4736882 *",
            "US4742024 *"
        ],
        [
            "Filing date",
            "Jul 7, 1971",
            "May 4, 1972",
            "Jan 26, 1972",
            "Jul 26, 1978",
            "Jul 26, 1978",
            "Sep 25, 1980",
            "Sep 19, 1977",
            "Jun 21, 1982",
            "Mar 1, 1982",
            "Aug 13, 1981",
            "May 7, 1981",
            "Feb 9, 1984",
            "Jan 11, 1982",
            "Dec 29, 1982",
            "Mar 8, 1984",
            "Dec 24, 1984",
            "Dec 16, 1985",
            "Jan 27, 1986",
            "Jun 17, 1986",
            "Jan 31, 1986",
            "Apr 13, 1987",
            "Jul 25, 1986",
            "Jul 22, 1986",
            "Jul 23, 1987"
        ],
        [
            "Publication date",
            "Oct 5, 1971",
            "Apr 9, 1974",
            "Jul 2, 1974",
            "Jun 24, 1980",
            "Nov 18, 1980",
            "May 24, 1983",
            "Jul 19, 1983",
            "Oct 18, 1983",
            "May 15, 1984",
            "Sep 25, 1984",
            "Oct 2, 1984",
            "Apr 9, 1985",
            "Apr 30, 1985",
            "Jun 18, 1985",
            "Aug 19, 1986",
            "Apr 7, 1987",
            "Aug 4, 1987",
            "Oct 20, 1987",
            "Nov 3, 1987",
            "Jan 26, 1988",
            "Apr 5, 1988",
            "Apr 5, 1988",
            "Apr 12, 1988",
            "May 3, 1988"
        ],
        [
            "Applicant",
            "Motorola Inc",
            "Gte Sylvania Inc",
            "Philips Corp",
            "National Semiconductor Corporation",
            "Western Electric Company, Inc.",
            "Texas Instruments Incorporated",
            "Kaufman Lance R",
            "Olin Corporation",
            "Kaufman Lance R",
            "Minnesota Mining And Manufacturing Company",
            "Gao Gesellschaft Fur Automation Und Organisation Mbh",
            "Mesa Technology",
            "Texas Instruments Incorporated",
            "Olin Corporation",
            "Olin Corporation",
            "Olin Corporation",
            "National Semiconductor Corporation",
            "Olin Corporation",
            "Mitsui High-Tec Inc.",
            "Olin Corporation",
            "Olin Corporation",
            "Olin Corporation",
            "Olin Corporation",
            "Fujitsu Limited"
        ],
        [
            "Title",
            "Multiple lead integrated circuit device and frame member for the fabrication thereof",
            "Fabricating packages for use in integrated circuits",
            "Method of providing a pattern of conductors on an insulating flexible foil of a synthetic material",
            "Manufacture of bumped composite tape for automatic gang bonding of semiconductor devices",
            "Carrier tapes for semiconductor devices",
            "Electronic circuit interconnection system",
            "Power switching device having improved heat dissipation means",
            "Casing for an electrical component having improved strength and heat transfer characteristics",
            "Compact circuit package having an improved lead frame connector",
            "Area-bonding tape",
            "Carrier element for an IC-chip",
            "Testable tape for bonding leads to semiconductor die and process for manufacturing same",
            "Integrated circuit package having interconnected leads adjacent the package ends",
            "Semiconductor packages",
            "Tape packages",
            "Hermetically sealed semiconductor casing",
            "Molded semiconductor package having improved heat dissipation",
            "Process for manufacturing bumped tape for tape automated bonding and the product produced thereby",
            "Method of forming a lead frame",
            "Interconnect tape for use in tape automated bonding",
            "Forming a circuit pattern in a metallic tape by electrical discharge machining",
            "Tape bonding material and structure for electronic circuit fabrication",
            "Thermode design for tab and method of use",
            "Semiconductor device and method of producing semiconductor device"
        ]
    ],
    "pageTitle": "Patent US4849857 - Heat dissipating interconnect tape for use in tape automated bonding - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4849857?dq=6101531",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 490347819,
    "recordOffset": 490317609,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{24005=One way to address the increased circuit density is the use of TAB instead of conventional wire bonding. TAB permits closer spacing of interconnect bonding pads on a semiconductor die than would be achievable by wire bonding. A general review of TAB technology is set forth in an article entitled \"TAB Technology Tackles High Density Interconnections\" by Tom Dixon, which appeared in the December, 1984, volume of Electronic Packaging & Production, at pages 34-39., 29688=Heat is removed from the active face of the semiconductor die by convection through air. To improve heat dissipation by convection, forced air has been used as have gases other then air. For example, the article entitled, \"Microelectronic Packaging\" by Albert J. Blodgett, Jr., in the July, 1983, volume of Scientific American, at Pages 86-96 shows the use of helium which has a higher convective heat transfer coefficient than air., 26775=The second area in which electronic packages require adaptation is thermal dissipation. A general review of the thermal dissipation requirements for electronic packaging may be found in the articles entitled \"Future Packages' Heat Transfer Will Affect PCB Designs\", by Ernel R. Winkler, which appeared in the April, 1985, volume of Electronic Packaging & Production at pages 104-109, and \"Advanced Packaging For VLSI\", by Charles J. Bartlett, which appeared in the June, 1986, volume of Solid State Technology, at pages 119-123.}",
    "textBeforeTable": "Patent Citations It is apparent that there has been provided in accordance with this invention, an improved interconnect tape for use in tape automated bonding which fully satisfies the objects, means, and advantages set forth hereinbefore. While the invention has been described in combination with specific embodiments thereof, it is evident that many alternatives, modifications, and variations will be apparent to those skilled in the art in light of the foregoing description. Accordingly, it is intended to embrace all such alternatives, modifications, and variations as fall within the spirit and broad scope of the appended claims. The patents and publications set forth in this specification are intended to be incorporated by reference herein. It is apparent that in accordance with this invention, it is possible to configure a tape interconnect with a thermal dissipation pad in contact with the heat generating top face of an electronic device, thereby greatly improving the heat dissipating characteristics of a package assembled from the interconnect tape. While the examples and embodiments shown hereinabove illustrate an electronic device with bumped electrical contacts, it is recognized that bumped inner leads and smooth electrical contacts on a semiconductor die may be used. This application hereby incorporates such a design. FIG. 13 shows in cross-section a configuration of the bumped inner leads 12\" and smooth bonding site 27'. Generally the bumped inner lead is plated with a precious metal and the smooth bonding site is coated",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 \"Advanced Packaging for VLSI\" by Charles J. Bartlett, Solid State Technology, Jun. 1986, pp. 119-123. 2 \"Future Packages' Heat Transfer Will Affect PCB Designs\" by Ernel R. Winkler, Electronic Packaging & Production, Apr. 1985, pp. 104-109. 3 \"Microelectronic Packaging\" by Albert J. Blodgett, Jr., Scientific America, Jul. 1983, pp. 86-96. 4 \"TAB Technology Tackles High Density Interconnections\" by Tom Dixon, Electronic Packaging & Production, Dec. 1984, pp. 34-39. 5 * Advanced Packaging for VLSI by Charles J. Bartlett, Solid State Technology, Jun. 1986, pp. 119 123. 6 * Future Packages Heat Transfer Will Affect PCB Designs by Ernel R. Winkler, Electronic Packaging & Production, Apr. 1985, pp. 104 109. 7 * Microelectronic Packaging by Albert J. Blodgett, Jr., Scientific America, Jul. 1983, pp. 86 96. 8 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}