{
    "relation": [
        [
            "Date",
            "Feb 17, 2000",
            "Sep 5, 2001",
            "Apr 30, 2002",
            "Jan 20, 2004",
            "Nov 24, 2004",
            "Nov 27, 2008",
            "Apr 6, 2009",
            "Aug 21, 2012",
            "Sep 11, 2012",
            "Nov 28, 2012",
            "Feb 27, 2014",
            "May 21, 2014",
            "May 28, 2014",
            "Nov 12, 2014",
            "Nov 23, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: WELLS FARGO FOOTHILL, LLC, AS AGENT,CALIFORNIA Free format text: PATENT SECURITY AGREEMENT;ASSIGNOR:POWERWAVE TECHNOLOGIES, INC.;REEL/FRAME:022507/0027 Effective date: 20090403",
            "Owner name: POWERWAVE TECHNOLOGIES, INC., CALIFORNIA Free format text: RELEASE BY SECURED PARTY;ASSIGNOR:WELLS FARGO CAPITAL FINANCE, LLC, FKA WELLS FARGO FOOTHILL, LLC;REEL/FRAME:028819/0014 Effective date: 20120820",
            "Owner name: P-WAVE HOLDINGS, LLC, CALIFORNIA Free format text: SECURITY AGREEMENT;ASSIGNOR:POWERWAVE TECHNOLOGIES, INC.;REEL/FRAME:028939/0381 Effective date: 20120911",
            "Year of fee payment: 12",
            "Owner name: POWERWAVE TECHNOLOGIES S.A.R.L., LUXEMBOURG Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:P-WAVE HOLDINGS, LLC;REEL/FRAME:032366/0432 Effective date: 20140220",
            "Owner name: P-WAVE HOLDINGS, LLC, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:POWERWAVE TECHNOLOGIES, INC.;REEL/FRAME:032982/0752 Effective date: 20130522",
            "Owner name: P-WAVE HOLDINGS, LLC, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:POWERWAVE TECHNOLOGIES, INC.;REEL/FRAME:033036/0246 Effective date: 20130522",
            "Owner name: INTEL CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:POWERWAVE TECHNOLOGIES S.A.R.L.;REEL/FRAME:034216/0001 Effective date: 20140827",
            "Owner name: POWERWAVE TECHNOLOGIES S.A.R.L., LUXEMBOURG Free format text: CORRECTIVE ASSIGNMENT TO CORRECT THE LIST OF PATENTS ASSIGNED TO REMOVE US PATENT NO. 6617817 PREVIOUSLY RECORDED ON REEL 032366 FRAME 0432. ASSIGNOR(S) HEREBY CONFIRMS THE ASSIGNMENT OF RIGHTS IN THE REMAINING ITEMS TO THE NAMED ASSIGNEE;ASSIGNOR:P-WAVE HOLDINGS, LLC;REEL/FRAME:034429/0889 Effective date: 20140220"
        ]
    ],
    "pageTitle": "Patent US6243038 - System and method providing amplification of narrow band signals with multi ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6243038?dq=6978253",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479902767,
    "recordOffset": 479874963,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{54319=LPAs in the form of multi-channel amplifiers (MCA) such as model NTGS 86A8 available from Powerwave Technologies, Inc., 2026 McGaw Avenue, Irvine, Calif. 92614, provide linear power amplification through the use of digital signal processing (DSP) and the presence of a communicated CDMA signal as the basis of optimizing the MCA parameters. Accordingly, amplifiers 321-336 of FIG. 3 might consist of these MCAs where radios 340 communicate a CDMA signal. However, where radios 340 do not communicate a broadband signal, such as in an AMPS only BTS, utilizing the aforementioned MCAs as amplifiers 321-336 would not provide the desired results., 42856=According to the present invention, use may be made of amplifiers having substantially less circuitry, and therefore expense, in order to provide signals having a desired magnitude. For example, multi-channel amplifiers (MCA) such as model NTGS 86A8, available from Powerwave Technologies, Inc., 2026 McGaw Avenue, Irvine, Calif. 92614, which provide linear power amplification through the use of digital signal processing (DSP) and the presence of a communicated CDMA signal as the basis of optimizing the MCA parameters.}",
    "textBeforeTable": "Patent Citations Although the present invention and its advantages have been described in detail, it should be understood that various changes, substitutions and alterations can be made herein without departing from the spirit and scope of the invention as defined by the appended claims. Similarly, combiners associated with each antenna beam signal or sector signal to combine the generated signal therewith may be used without the above described amplifier matrix assembly. For example, where the advantages of non-switched redundancy and amplification distributed across an amplifier bank are not desired, the generated signal may be combined with each antenna beam signal prior to its amplification by an amplifier disposed in its signal path in order to provide the proper signal for internal adjustment of the amplifier. Of course, such an arrangement does not provide the advantage of substantial isolation of the injected signal at the output of the amplifier circuitry as discussed above. Instead, this arrangement may rely on the injected signal being out of the band of interest and/or filtering/attenuation techniques as described above where it is desired that the injected signal not be present in the signal of interest as communicated. Moreover, multiple ones of the aforementioned combiners may be utilized to provide the generated signal to multiple ones of the inputs where desired. For example, where a particular matrix provides only components of the generated signal, which are not suitable for desired operation of the amplifiers,",
    "textAfterTable": "EP2069871A2 * Jul 24, 2007 Jun 17, 2009 Motorola, Inc. Method and apparatus for improving sector-to-sector isolation in a fourier transform matrix system WO2003017472A1 * Aug 12, 2002 Feb 27, 2003 Harris Corp Broadband amplifier system having improved linearity and minimum loss WO2004093241A2 * Apr 8, 2004 Oct 28, 2004 Chen Jiangnan Jason Apparatus and method for driving a sectored antenna WO2011051146A1 * Oct 20, 2010 May 5, 2011 Thales Multi-port amplification device that self-compensates in the presence of traffic * Cited by examiner Classifications U.S. Classification 342/373, 330/124.00R International Classification H01Q3/28, H01Q3/26 Cooperative Classification H01Q3/26, H01Q3/28 European Classification H01Q3/26, H01Q3/28 Legal",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}