{
    "relation": [
        [
            "Date",
            "Apr 4, 1997",
            "Aug 17, 1998",
            "Jan 22, 2002",
            "May 10, 2004",
            "Mar 8, 2006",
            "Aug 22, 2007",
            "Jul 16, 2008",
            "Jan 6, 2009",
            "May 3, 2012"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: TUMBLEWEED SOFTWARE CORPORATION, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SMITH, JEFFREY C.;BANDINI, JEAN-CHRISTOPHE;REEL/FRAME:008633/0391 Effective date: 19970403",
            "Owner name: SILICON VALLEY BANK, CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:TUMBLEWEED SOFTWARE CORPORATION;REEL/FRAME:009414/0766 Effective date: 19980722",
            "",
            "Year of fee payment: 4",
            "Owner name: TUMBLEWEED SOFTWARE CORPORATION, CALIFORNIA Free format text: RELEASE;ASSIGNOR:SILICON VALLEY BANK;REEL/FRAME:017636/0829 Effective date: 20060221",
            "Owner name: TUMBLEWEED COMMUNICATIONS CORP., CALIFORNIA Free format text: CHANGE OF NAME;ASSIGNOR:TUMBLEWEED SOFTWARE CORPORATION;REEL/FRAME:019733/0390 Effective date: 19990730",
            "Year of fee payment: 8",
            "Owner name: AXWAY INC., ARIZONA Free format text: MERGER;ASSIGNOR:TUMBLEWEED COMMUNICATIONS CORP.;REEL/FRAME:022062/0244 Effective date: 20081230",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6192407 - Private, trackable URLs for directed document delivery - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6192407?ie=ISO-8859-1&dq=5,915,131",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00072-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477967543,
    "recordOffset": 477910191,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23268=C. Baudoin, Interenterprise Electronic Mail Hub, U.S. Pat. No. 5,406,557 (Apr. 11, 1995) discloses an interenterprise communications center, which has a computer hub comprising a common core and a plurality of input and output modules. The input modules connect to a first end user, and convert a message sent by the first end user into a universal format. The hub core queues the message and forwards it to the output module for conversion into the format of the destination user. While the disclosed hub discloses techniques to relay simple e-mail messages, it is designed to convert the e-mail message formats, thus losing the integrity of the original text-based file., 19949=This patent application is a continuation-in-part of U.S. patent application Ser. No. 08/738,966, filed Oct. 24, 1996, now U.S. Pat. No. 5,790,790.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described in detail with reference to a particular preferred embodiment, persons possessing ordinary skill in the art to which this invention pertains will appreciate that various modifications and enhancements may be made without departing from the spirit and scope of the claims that follow. Although the electronic document delivery system and its methods of use are described herein in connection with use in the Internet, the invention may be applied to any of a wide variety of networks, including internets, intranets, LANs and WANs, or any combination thereof, as desired. As well, the invention may be applied to a wide variety of computer platforms, communication protocols, portable document formats, or any combination thereof, as desired. Once information has been logged in a data base running on the server which records transaction information, this data can be accessed by the recipient and can even be dynamically transmitted back to the recipient. For example, a given publisher (sender) asks the server's data base for all documents which have been delivered to a specific recipient. The publisher asks the server to generate a report of the status of a given document sent to ten people. The server reports back, for example, that the document has been sent to all ten people at a specific time, but only three of the people have actually retrieved the document. Each document retrieval may include the specific",
    "textAfterTable": "US5418908 * Oct 15, 1992 May 23, 1995 International Business Machines Corporation System for automatically establishing a link between an electronic mail item and a remotely stored reference through a place mark inserted into the item US5424724 * Mar 27, 1991 Jun 13, 1995 International Business Machines Corporation Method and apparatus for enhanced electronic mail distribution US5479411 * Mar 10, 1993 Dec 26, 1995 At&T Corp. Multi-media integrated message arrangement US5483466 * Nov 15, 1993 Jan 9, 1996 Hitachi, Ltd. Client/server system and mail reception/display control method US5495610 * Jul 13, 1995 Feb 27, 1996 Seer Technologies, Inc. Software distribution system to build and distribute a software release US5513126 * Oct 4, 1993 Apr 30, 1996 Xerox Corporation Network having selectively accessible recipient prioritized communication channel profiles US5513323 * Jun 14, 1991 Apr 30, 1996",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}