{
    "relation": [
        [
            "N",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Year",
            "1997",
            "2001",
            "2005",
            "2009"
        ],
        [
            "Country",
            "Norway and Sweden",
            "Germany",
            "England",
            "Finland"
        ],
        [
            "Logo",
            "Logo [B]",
            "-",
            "Logo [B]",
            "Logo [B]"
        ]
    ],
    "pageTitle": "LOGOs & MASCOTs",
    "title": "",
    "url": "http://www.aldaver.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 276543451,
    "recordOffset": 276500970,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Libya was asked and agreed to withdraw from the vote to decide the 2010 World Cup host nation after refusing to allow Israel to play there in the event of it winning the right to organise the tournament.}",
    "TableContextTimeStampAfterTable": "{76324=(2) Lahti has given up the idea of Olympic Winter Games 2006., 86784=(2) The Norwegian government on 12th November 2004 refused to back the bid saying it was too costly and too soon after the 1994 Lillehammer Games. Tromsoe organizers intend to continue their bid, hoping a pro-Olympics government or parliamentary majority can take office in national elections in 2005., 81937=(5) The Executive Board of the International Olympic Committee (IOC) on 5th February 2002 approved the list of the eight NOCs/cities that have submitted their application to host the XXI Olympic Winter Games in 2010., 52912=(2) Rome pulled out of the bidding in February 2012 after the Italian government declined to provide financial guarantees at a time of economic austerity., 106247=The World Cup (The Trophy, T; 1930-70: Jules Rimet Cup) (return to the top of the page), 49183=(3) The IOC Executive Board trimmed the preliminary field of 7 applicant cities to a short list of four official candidates on 4th June 2008., 82197=(6) The Executive Board of the International Olympic Committee (IOC) on 28th August 2002 accepted the four cities as Candidate Cities to host the XXI Olympic Winter Games in 2010 from a total of eight Applicant Cities., 44311=(7) The IOC Executive Board trimmed the preliminary field of 9 applicant cities to a short list of five official candidates on 18th May 2004., 43891=(5) The German National Olympic Committee on 12th April 2003 at the extraordinary meeting chose Leipzig as Germany's candidate for the 2012 Olympic Games., 173472=The best soccer mascot - 1984 France. Peno, a rooster. The worst soccer mascot - 2002 South Korea and Japan. Futuristic computer animated creatures., 87129=(3) The Swedish government on 28th June 2005 said it would not accept the financial risk of guaranteeing the 2014 Winter Olympics bid., 43133=(2) The U.S. Olympic Committee on 27th August 2002 selected New York and San Francisco as the U.S. finalists to host the 2012 Summer Olympics, while Houston and Washington, D.C., were eliminated as contenders., 76429=(3) The Austrian Olympic committee on 2nd December 1997 chose Klagenfurt, capital of the Carinthia region (joint bid with Italy and Slovenia), to become the country's candidate to host the 2006 Olympic Winter Games., 118201=(3) On 8th May 2004 Tunisia has withdrawn its bid for the 2010 World Cup after its plan to co-host with Libya was rejected., 87307=(4) The Executive Board of the International Olympic Committee (IOC) on 22nd June 2006 accepted the three cities as Candidate Cities to host the XXII Olympic Winter Games in 2014 from a total of seven Applicant Cities., 35296=(4) The IOC Executive Board trimmed the preliminary field of 10 applicant cities to a short list of five official candidates on 28th August 2000., 81517=(3) The Korea Olympic Council on 9th January 2002 voted 43-24 to choose Kangwon as the country's main candidate to bid for the 2010 Olympic Winter Games., 44089=(6) The Brazilian Olympic committee on 7th July 2003 selected Rio de Janeiro over Sao Paulo as Brazil's candidate for the 2012 Olympic Games with vote 23-10, with one abstention., 81306=(2) The Swiss Olympic Committee on 5th September 2001 voted 145-121 to support Bern rather than Davos as the country's candidate to host the 2010 Olympic Winter Games., 82459=(7) The city of Bern on 27th September 2002 has decided to withdraw its bid after the population of the Canton of Bern refused the granting of two credits totalling 22.5 million Swiss francs, for the organisation of the Games., 209968=75000 hits (including images) from 4th April 1996 to 4th February 2000., 49007=(2) The U.S. Olympic Committee on 14th April 2007 selected Chicago over Los Angeles as American candidate for the 2016 Olympic Games., 81714=(4) The General Assembly of the Spanish Olympic Commitee on 23rd January 2002 voted 156-81 to choose Jaca as the country's main candidate to bid for the 2010 Olympic Winter Games., 157910=(2) On 18th April 2007, Poland and Ukraine have been chosen by the UEFA Executive Committee in Cardiff to jointly host the final round of the UEFA European Football Championship in 2012. Poland and Ukraine won in the first round of voting with 8 of the 12 votes while 4 went to Italy and none to Croatia and Hungary., 43672=(4) The Spanish Olympic Committee on 21st January 2003 has selected Madrid over Seville as Spain's candidate to host the 2012 Summer Olympics with final vote 157-103., 14245=\"The jaguar was selected because of its association with a geographical area where the Mayan culture thrived. In the ruins of \"Chichen Itza\", there is a stone figure known as the 'Red Jaguar'. It is made of limestone painted in red with inlaid turquoise disks and is known as the 'Mayan Jaguar'.\" ( Cute little creatures: mascots lend a smile to the Games. Paula Welch, Olympic Review, September-October, 1988, No. 250-251, p. 437.), 34760=(2) The U.S. Olympic Committee voted against bidding for the 2008 Olympics on 13th May 1997. Eight cities (Baltimore, Cincinnati, Houston, New Orleans, New York, San Francisco, Seattle and Washington) signed before as potential bidders., 173212=The best olympic mascot - 1980 Moscow. Misha the Bear Cub. The worst olympic mascot - 1992 Barcelona. Cobi. & 1998 Nagano. The Snowlets., 43386=(3) The 123-member United States Olympic Committee (USOC) Board of Directors on 2nd November 2002 selected New York as the U.S. 2012 Olympic Games Candidate City. New York won with 132 of 223 possible weighted votes beating out San Francisco., 35040=(3) Executives of the Japanese Olympic committee and national sports federations on 13th August 1997 by 29-17 in a secret ballot chose Osaka to become the country's candidate to host the 2008 Summer Olympic Games., 96406=The International Paralympic Committee (IPC) Logo (from 2003), Logo, L (1991-2003), 170503=The Asian Football Confederation (AFC) Logo (from 2001), Logo (1954-2001) Mascot of the AFC - Soccasaurus (until 2001), 139532=The FIFA U-17 World Cup (The Trophy, T) (return to the top of the page) 1985-1989 - The FIFA/JVC Under-16 World Championship 1991-2005 - The FIFA/JVC Under-17 World Championship}",
    "lastModified": "Tue, 09 Sep 2014 22:33:58 GMT",
    "textBeforeTable": "The Winter Paralympic Games (return to the top of the page) - - Tokyo. Japan. 2020 XVI - - Rio de Janeiro. Brazil. 2016 XV Mascot - Mandeville, a creature fashioned from a droplet of steel used to build the Olympic stadium [D] Named inspired by the Buckinghamshire town of Stoke Mandeville, where the Paralympics were founded. Logo [B] London. Great Britain. 2012 XIV Mascot - Fu Niu Lele, the cow [A] Logo [B] Beijing. PR of China. 2008 XIII M, M, M, M, M Mascot - Proteas, the sea-horse (hippocampus) [B]; Logo [A] Athens. Greece. 2004 XII Mascot - Lizzie, the frill-necked lizard [B]; M, M (EB) Logo [B] Sydney. Australia. 2000 XI Mascot - Blaze, a phoenix, a mythical bird [B] (",
    "textAfterTable": "Innsbruck. Austria. Logo [B] (EB) - V 1992 Tignes-Albertville. France. Logo [B] (EB) - VI 1994 Lillehammer. Norway. Logo [C] (EB) - VII 1998 Nagano. Japan. Logo [B] (EB) Mascot - Parabbit, a rabbit [B] VIII 2002 Salt Lake City. USA. Logo [B] Mascot - Otto the Otter [B] M IX 2006 Turin. Italy. Logo [B] (EB) Logo (1st) Mascot - Aster, a Snowflake [B] X 2010 Vancouver. Canada. Logo [B] - \"Man Becomes Mountain\" Mascot - Sumi, an animal spirit [B] XI 2014 Sochi. Russia. Logo [B] Mascots: M - the Ray of Light",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}