{
    "relation": [
        [
            "Products",
            "5\" x 7\" Collage",
            "8\" x 8\" Square Collage",
            "16\" x 20\" Collage"
        ],
        [
            "E-Surface Color Paper",
            "✔",
            "✔",
            "✔"
        ],
        [
            "Kodak Metallic",
            "✔",
            "✔",
            "✔"
        ]
    ],
    "pageTitle": "Partner - MpixPro Lab",
    "title": "",
    "url": "http://www.zenfolio.com/z/company/partners/mpixpro",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 848525935,
    "recordOffset": 848487801,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12163=Mpix uses photo imaging equipment with the minimum required image resolution of 100 pixels per inch (ppi). For the best results, however, make sure your images are large enough to print at 250ppi or higher. For example, to print an 8\" x 10\" print, the minimum image size required would be 800 x 1000 pixels. However, for best results, it is recommended that the image size be 2000 x 2500 pixels., 3917=MpixPro is a division of Miller's Professional Imaging. Miller's was founded in 1939, and is the largest professional photography lab in the United States. The company has production facilities in Pittsburg, Kansas, and Columbia, Missouri.}",
    "TableContextTimeStampAfterTable": "{571776=© 2015 Zenfolio, Inc. | Terms of Use | Privacy Policy | Zenfolio is a part of the Art.com family}",
    "textBeforeTable": "Luxe Frames Beaded Mahogany Frame Beaded Walnut Frame Black Curved Frame Black Flat Frame Black Metal Frame Black Rounded Frame Blonde Maple Frame Bronze Ornate Frame Espresso Walnut Frame Gold Accent Frame Gold Ornate Frame Pewter Ribbed Frame Silver Curved Frame Silver Metal Frame Silver Ornate Frame White Flat Frame Show pricing for: To view frame pricing please select one of the frames below. With no mat, mounting is required and glass is optional With mat, glass is required and mounting option is not available plus the width of the frame 12\" x 14\" print that is framed and has a mat will end up being 8\" x 10\" Adding mat to a framed print increases the width and height by 4\", for example, an Black and White Mats come in 2\" width and are optional Choose from no glass, regular glass and non-glare glass All Print sizes up to 20\" x 30\" can be framed Choose from our large selection of frame styles and have your print custom-framed",
    "textAfterTable": "Products Classic Canvas Pearl Canvas 8\" x 10\" Canvas Gallery Wrap ✔ ✔ 10\" x 10\" Canvas Gallery Wrap ✔ ✔ 5\" x 30\" Canvas Gallery Wrap ✔ ✔ 11\" x 14\" Canvas Gallery Wrap ✔ ✔ 10\" x 20\" Canvas Gallery Wrap ✔ ✔ 16\" x 16\" Canvas Gallery Wrap ✔ ✔ 10\" x 30\" Canvas Gallery Wrap ✔ ✔ 16\" x 20\" Canvas Gallery Wrap ✔ ✔ 16\" x 24\" Canvas Gallery Wrap ✔ ✔ 20\" x 20\" Canvas Gallery Wrap ✔ ✔ 20\" x 24\" Canvas Gallery Wrap ✔ ✔ 20\" x 30\" Canvas Gallery Wrap ✔ ✔ 24\" x 30\" Canvas Gallery Wrap ✔ ✔ 24\" x 36\" Canvas Gallery Wrap ✔ ✔ 2.5\" Canvas Gallery Wraps Gallery wraps make an impressive presentation in any setting. Images are printed on premier art canvas and wrapped around a 2.5\" thick wooden stretcher frame. Gallery wraps arrive as a finished product ready to hang.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}