{
    "relation": [
        [
            "Box",
            "17 (sol)",
            "17 (sol)"
        ],
        [
            "Reel",
            "5844",
            "5844"
        ],
        [
            "",
            "Billboard Scrapbook 7 (see also Box 14), 1935-1939",
            "Billboard Scrapbook 8, 1936-1937"
        ]
    ],
    "pageTitle": "Detailed description of the Douglas Leigh papers, 1903-1999, bulk, 1924-1999 | Archives of American Art, Smithsonian Institution",
    "title": "",
    "url": "http://www.aaa.si.edu/collections/douglas-leigh-papers-6306/more",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 277704243,
    "recordOffset": 277684188,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10072=Dubbed \"The Man Who Lit Up New York\" in his New York Times obituary, he was responsible for festooning Broadway with miles of spectacular electrical and animated signs, such as a steaming coffeepot, a winking penguin on a cake of ice for Kool cigarettes, and the giant Camel sign that puffed smoke rings from a Times Square sign from 1941 and 1967. These effects led to creating animated billboards, an innovation called the Leigh-EPOK animated, billboards matrix display, or EPOK. Leigh developed numerous dirigible advertising projects involving both painted logos and networks of lights over the surface of the dirigible. These sequentially-timed lights caused dramatic animated effects against the night sky., 1760=The collection was processed by Jean Fitzgerald in August 2003., 8453=The collection measures 17.8 linear feet and dates from 1903 to 1999 (bulk 1924-1992) and documents the career of advertising designer and executive Douglas Leigh. Found are 83 volumes of publicity scrapbooks that contain mostly photographs, clippings, printed materials, and scattered letters, drawings, and blueprints. Also included are professional correspondence; photographs of project installations, aerial advertising, and entertainers; plaques and awards received by Leigh; and printed material, which includes clippings, press kits, advertising materials, designs and original sketches for projects by Leigh. The material reflects Leigh's continuously imaginative use of a wide range of innovative media in promoting his clients' products., 786=Douglas Leigh Papers, 1903-1999. Archives of American Art, Smithsonian Institution., 1936=The Douglas Leigh papers were donated to the Archives of American Art by Leigh's widow, Elsie M. Leigh, in 2000., 9335=Leigh was also a pioneer in the illumination of city skylines and buildings and thought of lighting up Manhattan's skyscrapers, beginning with the Empire State Building, in 1976 and continuing with the lighting and gilding of the Con Edison Building, the Helmsley Building, and the Crown Building. This idea was adopted by many other cities, including Cincinnati, Atlanta, Orlando, Miami, New Orleans, and Baltimore with Leigh traveling there to supervise the final installation. Leigh was also involved with numerous urban improvement and renewal projects., 8763=Leigh's career continued into the 1990's, and he died in 1999., 10630=Douglas Leigh was born in Anniston, Alabama, in 1907. After graduating from the University of Florida in 1928, he began his career as a salesman for the General Outdoor Advertising Company of Atlanta, Georgia. He moved to New York City in 1930 and developed his ideas for animated and illuminated advertising signs primarily in the vicinity of Times Square. He established his own advertising company, Douglas Leigh, Inc., in 1933 and created the popular Camel Cigarette billboard that featured a man's face exhaling smoke rings over Broadway.}",
    "TableContextTimeStampAfterTable": "{47198=Billboard Scrapbook 25 includes photographs of Broadway performers Joan McCracken, June Havoc, Bambi Linn, and the De Marcos; Wilson Whiskey Billboard Scrapbook 27 includes a photograph of Joan Crawford., 17268=The sixteen general scrapbooks found here contain clippings, miscellaneous printed material, letters, interview transcripts, artwork, and photographs documenting the development of miscellaneous projects by Douglas Leigh and his company. General Scrapbook 1 contains a cartoon of Douglas Leigh by Stookie Allen. General Scrapbook 13 contains a metal pin reading \"Honorary Tydol Pilot/ Feb 1947.\", 9327=Photographs are of Douglas Leigh, his boyhood home, family members, and business colleagues. Photographs of Leigh and business colleagues ca. 1939 include a photo of Mickey Rooney. An album contains photographs of office parties at Douglas Leigh, Inc., 106301=Copyright (c) 2015 Archives of American Art   |   Smithsonian Institution   |   Privacy   |   Terms of Use   |   Contact Us       }",
    "textBeforeTable": "Military records document Leigh's service in the U.S. Navy during World War II. Biographical material includes certificates of membership in naval and real estate organizations, and award plaques and certificates. Records are arranged chronologically. (Box 1, 12; 7 folders) Biographical Material, 1943-1988 Series 1: Detailed Description and Container Inventory Return to top Douglas Leigh Papers, 1903-1999. Archives of American Art, Smithsonian Institution. How to Cite this Collection The collection has been filmed on microfilm reels 5840-5848, and is available through interlibrary loan. Available Formats The Douglas Leigh papers are owned by the Archives of American Art, Smithsonian Institution. Literary rights as possessed by the donor have been dedicated to public use for research, study, and scholarship. The collection is subject to all copyright laws. Ownership & Literary Rights The collection is open for research. Patrons must use microfilm copy. Original scrapbooks are closed to researchers because of their fragile condition. Restrictions on Use How to Use the Collection The collection was processed by Jean Fitzgerald in August 2003. How the Collection was Processed The Douglas Leigh papers were donated to the Archives of American Art by Leigh's widow, Elsie M. Leigh, in 2000. Provenance Transcripts Sketches Signs and signboards Scrapbooks Photographs Light in architecture Interviews Designers--New York (State)--New York Blueprints Awards Airships Advertising Seven-Up Company. R.J. Reynolds",
    "textAfterTable": "1 5840 Award Certificates and Plaques (see also Box 12), 1958-1981 1 5840 Bank of New York Medal, 1982 1 5840 Greenville High School Hall of Fame Plaque, 1988 Box Reel 12 (sol) 5840 Oversize Membership Certificate, 1945 12 (sol) 5840 Oversize Award Certificate, 1968 Series 2: Correspondence, 1924-1999, n.d. (Box 1; 16 folders) The chronologically-arranged correspondence consists of business letters that do not directly relate to a specific project. Box Reel 1 5840 Correspondence, n.d. 1 5840 Correspondence, 1924 1 5840 Correspondence, 1940-1946 1 5840 Correspondence, 1947-1949 1 5840 Correspondence, 1950-1951 1 5840 Correspondence, 1954-1955 1 5840 Correspondence, 1956 1 5840 Correspondence, 1958 1 5840 Correspondence, 1959",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}