{
    "relation": [
        [
            "First Name",
            "Joel",
            "Damon"
        ],
        [
            "Last Name",
            "Brandenberger",
            "Wells"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=2D84C55E-B143-4417-AAED-A274E69600A0&filingTypeID=66",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220104026,
    "recordOffset": 220095824,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12259=FY 2011 Budget FY 2012 Agriculture Appropriations Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 965) Proposed GIPSA Rule Phosphorus Standard Revision Docket No. FDA-2010-N-0620 -5/24/11 - The National Antimicrobial Resistance Monitoring System Strategic Plan 2011-2015, 21162=Volumetric Ethanol Excise Tax Credit (VEETC) and Import Tariff Amendments-Amdt #'s 476 and 411 to S. 782 Ethanol Subsidy Repeal Act (H.R. 2307) EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15 Percent EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program, 35976=FY 2012 Agriculture Appropriations USDA/FDA User Fees Market Access Program/Foreign Market Development Program Avian Influenza Program Animal Disease Traceability Program FY 2012 Interior Appropriations Bill- Sullivan E15 amendment, 38904=Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 EPA Feed Mill Rule: EPA - HQ-OAR-2008-0080; FRL-9095-2 House Agriculture Committee Hearing-Chesapeake Bay, 26917=No Bill or Docket # - Implementation of the Supreme Court \"Donning and Doffing\" Decision Docket- OSHA 2009-0044 - \"Occupational Illness & Injury Reporting Proposed GIPSA Rule Docket No. FMCSA-2010-0167- 5/9/11- Proposed Rule Requiring Electronic On-Board Recorders Docket No. OSHA-2009-0044 - 6/14/11- Occupational Injury and Illness Recording and Reporting Requirements, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 18204=OAR-2004-0237 - Animal Feed Operations Consent Agreement and Final Order Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 Greenhouse Gas Emissions Reporting Rule (EPA-HQ-OAR-2008-0508) EPA TMDL for the Chesapeake Bay, 24244=Docket No. 04-026N - \"Salmonella Verification Sample Results Reporting: Agency Policy and Use in Public Protection\" FSIS Performance Standards for Salmonella and Campylobacter Docket No. FNS-2007-0038 - 4/13/11- Nutrition Standards in the National School Lunch and School Breakfast Programs Docket No. FSIS-2005-0044 7/11/11- Not applying the Mark of Inspection Pendign Certain Test Results Docket No. FSIS-2010-0035 - 7/6/11 - Update of the 2003 Interagency Quantitative Assessment of the Relative Risk to Public Health From Foodborne Listeria Monocytogenes Among Selected Categories of Ready to Eat Foods, 41809=EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15% EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program Volumetric Ethanol Excise Tax Credit (VEETC) and Import Tariff Amendments (Amdt #'s 476 and 411 to S.782) Ethanol Subsidies Repeal Act (H.R. 2307), 15238=Animal Drug Use & Availability Animal Disease Traceability System Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 965) Docket No. FDA-2010-N-0620 - 5/24/11 - The National Antimicrobial Resistance Monitoring System Strategic Plan 2011-2015}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JOEL BRANDENBERGER  2028980100  jbrandenberger@turkeyfed.org 5. Senate ID#  28732-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}