{
    "relation": [
        [
            "",
            "見えないかべの 向こう側に",
            "待っている君がいたんだ",
            "もうすぐに 届くから",
            "I believe ひとつの世界へ"
        ],
        [
            "",
            "Mienai kabe no mukou gawa ni",
            "matteiru kimi ga itanda",
            "Mou sugu ni todoku kara",
            "I believe hitotsu no sekai he"
        ],
        [
            "",
            "On the other side of the invisible wall",
            "you're waiting for me",
            "I’ll arrive soon,",
            "I believe - to the one world,"
        ]
    ],
    "pageTitle": "Share the World! - The One Piece Wiki - Manga, Anime, Pirates, Marines, Treasure, Devil Fruits, and more",
    "title": "",
    "url": "http://onepiece.wikia.com/wiki/Share_the_World!",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00130-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 179420343,
    "recordOffset": 179385485,
    "tableOrientation": "VERTICAL",
    "lastModified": "Mon, 03 Aug 2015 03:10:20 GMT",
    "textBeforeTable": "English Translation Japanese Rōmaji Japanese Kanji LyricsEdit Ace and Luffy separated. Brook's portrait. Franky's portrait. Robin's portrait.",
    "textAfterTable": "Oh we share the music Oh we share the music come on let’s go baby baby Come on, let’s go baby baby Come on, let’s go baby baby oh we share the one dream Oh we share the one dream Oh we share the one dream come on let’s go everybody Come on, let’s go everybody Come on, let’s go everybody oh we share the good times Oh we share the good times Oh we share the good times come on let’s go baby baby Come on, let’s go baby baby Come on, let’s go baby baby oh we share the one world Oh we share the one world Oh we share the one world 暗闇　迷い込み Kurayami mayoikomi The confusing puzzles 手探りで謎解き tesaguri de nazotoki that are contained in the darkness, 行き先　見えずに Yukisaki miezu ni Halting our view 立ち止まる時 tachidomaru toki on our destination umm you and me yes 気持ち Umm you and me yes kimochi (Umm) You and me, yes, feels 分かち合う世界に wakachiau sekai ni the excitement this world brings 導き　i feel the beat Michibiki I",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}