{
    "relation": [
        [
            "Location",
            "Hanoi, Vietnam",
            "Ho Chi Minh City, Vietnam"
        ],
        [
            "Event Date",
            "April 17-18, 2015, 2015",
            "April 18-20, 2015, 2015"
        ],
        [
            "Name of Event",
            "Tôi yêu Vietnam Tour Spring 2015, Linden Boarding Schools Tours",
            "Tôi yêu Vietnam Tour Spring 2015, Linden Boarding Schools Tours"
        ]
    ],
    "pageTitle": "Jadwal Pameran Pendidikan Internasional",
    "title": "",
    "url": "http://studyusa.com/id/a/630/jadwal-pameran-pendidikan-internasional",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00157-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 225906699,
    "recordOffset": 225878638,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{116054=© 2015 Study in the USA. All Rights Reserved, 86374=AS katakan iya kepada IELTS Unduh panduan IELTS untuk belajar di AS Unduh Daftar IELTS 2013 AS yang Diakui disini.}",
    "textBeforeTable": "Southeast Asia Jadwal Pameran Pendidikan Internasional 2015 Sekilas tentang pameran: Pameran pendidikan memberikan kesempatan kepada Anda untuk berbicara langsung dengan perwakilan-perwakilan universitas A.S., program bahasa dan sekolah musim panas. Anda dapat mengunjungi setiap stan perguruan tinggi, berbicara dengan para pengajar atau yang bekerja disana, dan mengambil brosur dan formulir pendaftaran. Updated: April 21, 2015 Jadwal Pameran Pendidikan Internasional 繁體中文 Tiếng Việt 简体中文 Türkçe 한국어 Русский ภาษาไทย 日本語 Bahasa Indonesia العربيـة Français Português Español English Jadwal Pameran Pendidikan Internasional Informasi Informasi Beranda",
    "textAfterTable": "Hanoi, Vietnam October 7, 2015 Capstone, StudyUSA Higher Education Fairs Haiphong, Vietnam October 9, 2015 Capstone, StudyUSA Higher Education Fairs Location Event Date Name of Event HCMC, Vietnam October 27, 2015 Capstone International Boarding & Day School Fairs Hanoi, Vietnam October 29, 2015 Capstone International Boarding & Day School Fairs Fairs at a Glance   Fairs in Asia US Higher Education Fairs IIE American Education Fairs AIEF American Education Expo Oh!Study EducationUSA Fairs AMINEF a2 International Education Fairs a2 American Education Expo in Asia ISN StudyUSA Higher Education Fairs Capstone Vietnam Linden Boarding School Tours Linden   Fairs in Latin America Salão do Estudante BMI Expo-Estudiante BMI American Education Expo in Latin America ISN Linden Boarding School Tours Linden   Fairs in Europe",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}