{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are some activities that happens around school. Sometimes, there are exhibits, outdoor sales and even music.",
            "For students who plan on attending Mesa College, meet with your counselors before you start your first semester here if you need guidance. They'll be happy to help you reach your goals.",
            "Mesa College is a great school. It's very clean. Students seem to be independent, if not, very focused in their academics."
        ]
    ],
    "pageTitle": "San Diego Mesa College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/San-Diego-Mesa-College/reviews?_escaped_fragment_=/show/104244",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898691407,
    "recordOffset": 898631381,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{335957=© 2015, Cappex.com, LLC, 10239=As far as community colleges in the greater San Diego area go, San Diego Mesa College is by far one of the better ones to attend. The range from the choice of classes to quality of professors, Mesa has much more to offer than any of the other San Diego District Community Colleges (which include Miramar, Mesa, and City). I would know, I've attended all three. Mesa even supersedes the other districts such as Grossmont and Southwestern. Even through the budget cuts and all the financial decreases in the past year, Mesa seems to be upholding their standards of actually giving a decent education, as best as it gets for community that is., 4974=Its community college, if you do not want to spend the high cost of what a 4 year college and private colleges make you pay stick with a community college. Mesa is a part of the San Diego Community Colleges (City and Miramar are the other two). At the time of this post $26 per credit for local CA residents is a great deal to get your GE done and go for an AA and then transfer to a 4 year.}",
    "textBeforeTable": "12/29/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 83 Amy from San Diego, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Am enjoying being here I love Mesa college!!! I have taken both on-campus and on-line courses; both are wonderful. I can honestly say I have learned a great deal in the short time I have attended Mesa college. Am learning a lot The professors here at Mesa are amazing!!! The professors and students alike are very helpful here. Academics are a major aspect of this college. If you want to go to a college where the students are friendly, the professors strict but helpful, many clubs and groups to choose from Mesa is it. Plus the weather is magnificent all year long!. Login to rate or flag the reviews Nick from San Diego, CA 12/24/2009 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 83 Categories Comments Great for these types of students Just about anyone who wants to work towards an AA or get their General Education done and transfer",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}