{
    "relation": [
        [
            "Stage",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7"
        ],
        [
            "Oven",
            "120o F",
            "130o F",
            "140o F",
            "150o F",
            "160o F",
            "170o F",
            "Off"
        ],
        [
            "Smoke*",
            "Off",
            "On",
            "On",
            "On",
            "On",
            "Off",
            "Off"
        ],
        [
            "Shower**",
            "Off",
            "Off",
            "Off",
            "Off",
            "Off",
            "Off",
            "ON"
        ],
        [
            "Time",
            "30 Minutes",
            "30 Minutes",
            "30 Minutes",
            "30 Minutes",
            "15 Minutes",
            "Until Internal Temp of 160o F",
            "20 Minutes"
        ]
    ],
    "pageTitle": "Sausage Recipes, Jerky Recipes, Snack Stick Recipes, & More For Home Sausage Making",
    "title": "",
    "url": "http://www.waltonsinc.com/t-recipes.aspx",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 818292047,
    "recordOffset": 818268001,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{99068=Are you looking for Parts Breakdowns & Manuals? Visit our Parts Breakdown & Manuals section to view what we have made available online. We also carry a large selection of parts not listed on our website. To order other parts, call (800) 835-2832 or visit our Parts Price Request Form.}",
    "textBeforeTable": "Lay seasoned strips on smoke screens and place in smokehouse. Cooking Instructions: Drag meat slices through seasoning, completely covering all sides. After covering slices with seasoning, put in a bag and add water until covered and hold in the cooler for 12 hours. Or, for a re-structured jerky, mix cure into seasoning and then into meat. Grind meat once through a 1/8\" plate and extrude using the All-Around Jerky Maker on your grinder or stuffer. Process: Mix the jerky seasoning and the sure cure together. Mix: 1-bag Excalibur Jerky Seasoning (for 25 lbs. of meat) 1-bag (1 oz.) Sure Cure (cure package is included with all jerky seasonings) Additives: 25 lbs. meat, sliced against the grain, 1/8\" to 1/4\" thick Meat Block: Jerky (Whole Muscle Or Restructured) Download PDF Dry Rub Bacon Kielbasa",
    "textAfterTable": "Off Off 1 Hour 2 140 o F On Off 1 Hours 3 155 o F On Off 2 Hours 4 175 o F On Off Until Internal Meat Temp reaches 160 o F. 5 Off Off ON 10 Minutes *Do not use smoke if cooking in a household oven or dehydrator. **To shower, simply spray with water for 10 minutes, or place product in an ice bath. ++To increase humidity for a better looking final product, place a small pan of water in the bottom of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}