{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There has never been a moment where I have felt unsafe on campus, and JMU students are known for being honest, especially regarding not taking personal belongings left to mark a table at a dining hall.",
            "the kissing rock",
            "When the weather is good, check out the arboretum or go on a hike at nearby Shenandoah National Park. On campus there are many clubs, organizations, and intramural sports that constantly have events going on. Not to mention, UREC is a great place to get fit or just play a game of racquetball and TDU is awesome for hanging out. Whatever it is, JMU has it.",
            "The food at JMU is spectacular, there are so many choices and options for every dietary need.",
            "Getting used to a dorm is challenging at first, but FROG week at JMU helps hallmates to get to know each other better and become friends. Also, the dorms are kept relatively clean and you have a vast choice as to where on campus you would like to live",
            "JMU is not an Ivy, but it certainly is challenging in an academic light. However, the teachers welcome the opportunity to help students, and they do not give you more than you can handle.",
            "-explore the campus, if you feel at home then this is the place for you -if you do decide on JMU, get involved! College is what you make of it -If out of state, explore the scholarship options that JMU and other sites offer",
            "JMU is a lively campus with a lot of chances to become involved and to find your niche. I'm only a freshman here, but it took a matter of days before I realized how much I, and everyone else at JMU wanted to be here. Finally the campus and surrounding area are beautiful and the food is delicious!"
        ]
    ],
    "pageTitle": "James Madison University (JMU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/James-Madison-University/reviews?_escaped_fragment_=/show/81158",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902390107,
    "recordOffset": 902262213,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{132597=Not really unusual, but: Springfest... only every 3 years though, after the 2010 Springfest riots, JMU police shut it down pretty quickly. Game days or days of remembrance: Purple out- all the students wear their JMU purples to support., 167608=At the University of James Madison, founded in 1908, I, Joshua Roach am being transformed and molded by the renewing of my mind every semester I enroll for courses at the mighty Madison. Focusing on Law, while majoring in Justice Studies, my american tools are sharpened in the class rooms of my minor, Political Science. Focusing on eighteenth century philosopher's such as Socrates, Thoreau, Aristotle, and Tolstoy. I try to model their efforts to society by volunteering in the elementary and middle schools, mentoring and tutoring high school students, public speaking for peace, planning and participating in vigils for the memory of 9/11, and participating in the James Madison University, Moot Court., 410805=Speaking of best value, with the current state of the economy, it is pertinent that schools offer an education at an affordable price. JMU placed at No. 19 nationally in The Kiplinger 100, a listing of best values in public colleges â?? schools that deliver a stellar education at an affordable price â?? published in the February 2011 issue of Kiplinger's Personal Finance magazine., 357618=1787 is a week long freshman year orientation where most schools have orientation for only a couple of days. FROG week is the best week ever!, 16654=Football games are full of traditions! Every time there is a touchdown the entire student section throws purple and gold streamers! It makes for a really cool effect. Also, our freshman orientation is probably one of the most amazing experiences every student has here. It's called 1787 and each freshman is assigned to a group that lives in their dorm and they go around and go to presentation and do fun activities. It's a really good way for everyone to make friends and really get to know the campus., 689852=© 2015, Cappex.com, LLC, 396766=The first week of the fall semester for freshman is a blast. It's called 1787 week and you learn so much. It's also the place where you meet many people who will be your friends for the year. There are tons of fun activities to do and things to see on top of the important matters. Football games are always fun to attend, but perhaps one of the best places to be is on the quad. It's a gorgeous environment, surrounded by the old bluestone buildings (well, they're actually gray but they are called bluestone). In December, there is a special Christmas tree lighting ceremony which is absolutely fabulous., 412099=Living freshman year in a dorm was my favorite year. I met a lot of people and everything on campus was easily accessible. My building didn't have air conditioning but it was tolerable for the year except when moving in during August., 446234=During August 1787 orientation week, get to know your First Year Orientation Guides and use them for help and answers about the campus. Make sure you stay on top of classes and go to the library to study! It is a great place to stay focused and get work done early.}",
    "textBeforeTable": "12/14/2009 Reviewer is A current student here. 48 out of 50 people found this review useful. 4 people found this inaccurate. 1 of 154 Gina from Vienna, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. James Madison University Reviews James Madison University › Virginia › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students Students who want to enjoy their next four years. If you know what major you want or don't then that's fine, you have quite a while to decide and quite a few majors to choose from. There is diversity also. The only problem is that JMU does suffer from a bit of grade inflation, so if you're looking to end up being a lawyer or something who stands out from the rest, you may want to look into another college. You may still want to come here, but you'd have to engage yourselves in quite a variety of extracurricular activities I should assume, which JMU has a lot of. Tips for prospective students I thought location meant nothing. It does. I thought party life meant nothing. It does. One sounds good; one doesn't. The atmosphere and location around JMU make for a great life around JMU. You will enjoy it here. The problem is, is that there is a pretty big party life here, and if that is not for you then I'd still recommend coming here, providing you have the power to say no. Bang for the buck Normal priced but it offers everything. And hey, if not, there are plenty of job opportunities around. Some job fairs come to the college as well",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}