{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Wooo!",
            "Go shopping around town, work out in the gym located on campus, get coffee.",
            "Delicious cafe located in building.",
            "No dorms!",
            "Challenging but yet easy.",
            "Always be at least 15 minutes early to classes. Sit in the front. Walk fast.",
            "Kalamazoo Valley Community College is a convenient school with many choices to help you decide where you want to go in life. There are many classes so if one is full you still have a chance to get it. Also, there are awesome resources that help you along the way."
        ]
    ],
    "pageTitle": "Kalamazoo Valley Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Kalamazoo-Valley-Community-College/reviews?_escaped_fragment_=/show/91170",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893861319,
    "recordOffset": 893828206,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{139401=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/06/2011 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 32 Jacob from Kalamazoo, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Categories Comments Campus Safety There are red emergency phones throughout the hallways and KVCC boasts a great policy academy. Last year, the school added their own police and lighted blue safety phones throughout the parking lots. Greek Life Phi Theta Kappa is the honors society for two-year colleges. KVCC is a proud participant. Clubs and Activities Kalamazoo Valley Community College has a great sports program and has several different mens and womens teams. The school has recently adopted several club teams and intramural leagues as well. Great for these types of students People who can't afford or aren't ready for a traditional four-year university. Share any unusual traditions or locations on campus My favorite place on the main campus is the Library. It's a beautiful room situated in the back corner of the school overlooking a woodsy nature preserve. Bang for the buck I received a great education at a discount price. Many KVCC courses transfer to larger schools like WMU, GVSU and even UofM. What to do for fun Wild Bull downtown is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}