{
    "relation": [
        [
            "Patent application number",
            "20090087914",
            "20090133512",
            "20090169432"
        ],
        [
            "Description",
            "AUTOMATIC ANALYZING APPARATUS AND QUALITY CONTROL METHOD FOR ANALYSIS SUPPORTING LIQUID IN THE SAME - An automatic analyzing apparatus can properly determine a quality of an analysis supporting liquid, after being supplied to the automatic analyzing apparatus, which supports an analysis performed in the automatic analyzing apparatus and can properly maintain an accuracy of the analysis. The analysis supporting liquid which supports an analysis of a specimen is dispensed into a reaction vessel by using a specimen dispensing unit which dispenses the specimen, a reagent dispensing unit which dispenses a reagent, a cleaning unit which cleans the reaction vessel, or a diluted solution dispensing unit which dispenses a diluted solution. An optical measurement is performed with respect to a liquid including the dispensed analysis supporting liquid in the reaction vessel. Analysis data of the analysis supporting liquid is generated by using the measured result. The quality of the analysis supporting liquid is determined by comparing the generated analysis data with reference data.",
            "AUTOMATIC ANALYZER AND METHOD FOR DETERMINING ABNORMALITY IN DISPENSING OF DISPENSING SYSTEM - An automatic analyzer is for analyzing a reaction liquid in which a specimen and a reagent have been reacted. The automatic analyzer includes a dispensing system, a detector, and a determiner. The dispensing system includes a dispensing nozzle by which the specimen and the reagent are dispensed; and a dispensing pipe connected to the dispensing nozzle and filled with a cleaning liquid. The dispensing nozzle is cleaned with the cleaning liquid discharged from the dispensing nozzle. The detector detects a discharge amount of the cleaning liquid discharged from the dispensing nozzle. The determiner determines whether the detected discharge amount of the cleaning liquid is over a predetermined value which is less than a pre-set discharge amount of the cleaning liquid. The determiner determines that the dispensing is abnormal if the detected discharge amount is equal to or less than the predetermined value.",
            "AUTOMATIC ANALYZER AND DISPENSING METHOD THEREOF - Provided are an automatic analyzer which moves a dispensing apparatus having a dispensing probe, or a vessel by a driving mechanism to dispense plural liquids into the vessel via the dispensing probe, and measures and analyzes optical characteristic of a reaction liquid in which each of the dispensed liquids is reacted, and a dispensing method thereof. The automatic analyzer includes a drive controlling unit which controls the driving mechanism so that the liquid surface of the liquid and a distal end of the dispensing probe are moved relatively to each other in a vertical direction, and, when the liquids including precipitated substance are to be dispensed, the dispensing probe sucks in the liquids from plural different positions along the vertical direction."
        ],
        [
            "Published",
            "04-02-2009",
            "05-28-2009",
            "07-02-2009"
        ]
    ],
    "pageTitle": "Akihisa - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/akihisa-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437170415,
    "recordOffset": 437137204,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Akihisa Kuroda, Mishima-Shi JP 01-05-2012 ANALYZER AND METHOD FOR WASHING DISPENSER PROBE - The analyzer ( 20120003731 03-04-2010 NOZZLE CLEANING METHOD, NOZZLE CLEANING DEVICE, AND AUTOMATIC ANALYZER - A nozzle cleaning method includes cleaning an outer wall of a dispenser nozzle after liquid is sucked and before the liquid is discharged and cleaning at least an inner wall of the dispenser nozzle after the liquid is discharged. 20100051060 Published Description Patent application number Akihisa Kuroda, Shizuoka JP 01-27-2011 METHOD OF CLEANING NOZZLE AND DEVICE FOR CLEANING NOZZLE - The present invention provides a nozzle cleaning method and a nozzle cleaning device which allow to surely perform cleaning of a dispensing nozzle and which allow reduction in cleaning time. For this purpose, a nozzle cleaning method for cleaning a dispensing nozzle ( 20110017238 Published Description Patent application number Akihisa Kuroda, Sunto-Gun JP 08-01-2013 PROCESSING METHOD - Disclosed is a processing method which can achieve a high processing rate, and is capable of making a surface smooth, In order to achieve this an SiC substrate is arranged in a potassium hydroxide solution containing hydrogen peroxide, and ultraviolent radiation is irradiated on the surface of the SiC substrate. An SiO2 layer is formed on the surface of the SiC substrate due to the irradiation of ultraviolet radiation, and this SiO2 layer is chemically removed",
    "textAfterTable": "Akihisa Matsumoto, Tottori JP Patent application number Description Published 20090078455 LIGHT EMITTING MODULE AND METHOD FOR MANUFACTURING THE SAME - Provided are: a light emitting module which has an improved heat-dissipating property and whose reflectance reduction is prevented. The light emitting module mainly includes: a metal substrate; a conductive pattern formed on the upper surface of the metal substrate; and a light emitting element disposed on the upper surface of the metal substrate and electrically connected to the conductive pattern. Furthermore, in the light emitting module, an insulating layer is removed in a region where the conductive pattern is not formed, but is left unremoved in a region right below (or covered with) the conductive pattern. In other words, in the region where the conductive pattern is not formed, the upper surface of the metal substrate is not covered with the conductive pattern, and a metal material constituting the metal substrate is exposed. 03-26-2009 Patent applications by Akihisa Matsumoto, Tottori JP Akihisa Matsumoto, Tottori City JP Patent application number Description Published 20090154176 ELECTRONIC COMPONENT AND METHOD FOR MANUFACTURING SAME - In an electronic component ( 06-18-2009 20090314534",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}