{
    "relation": [
        [
            "Parameter",
            "Gathering cut-off",
            "Trusted cut-off",
            "Noise cut-off"
        ],
        [
            "Sequence",
            "22.0",
            "22.0",
            "21.9"
        ],
        [
            "Domain",
            "22.0",
            "22.0",
            "21.9"
        ]
    ],
    "pageTitle": "Pfam: Family: Frizzled (PF01534)",
    "title": "",
    "url": "http://pfam.xfam.org/family/Frizzled?tab=alignBlock",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.88/warc/CC-MAIN-20150728002308-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 192642231,
    "recordOffset": 192601931,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130236=Rehn M, Pihlajaniemi T, Hofmann K, Bucher P; , Trends Biochem Sci 1998;23:415-417.: The frizzled motif: in how many different protein families does it occur?. PUBMED:9852758 EPMC:9852758, 129827=Chen Y, Struhl G; , Development 1998;125:4943-4948.: In vivo evidence that Patched and Smoothened constitute distinct binding and transducing components of a Hedgehog receptor complex. PUBMED:9811578 EPMC:9811578}",
    "lastModified": "Sat, 01 Aug 2015 20:18:24 GMT",
    "textBeforeTable": "Model details: search method: hmmsearch -Z 80369284 -E 1000 --cpu 4 HMM pfamseq build method: hmmbuild -o /dev/null HMM SEED HMM build commands: HMM information 52.12 % Average coverage of the sequence by the domain: 37 % Average identity of full alignment: 270.90 aa Average length of the domain: 1538 Number in full: 106 Number in seed: Bateman A Author: Family Type: none Previous IDs: Pfam-B_949 (release 4.0) Seed source: Curation This section shows the detailed information about the Pfam family. You can see the definitions of many of the terms in this section in the glossary and a fuller explanation of the scoring system that we use in the scores section",
    "textAfterTable": "Model length: 317 Family (HMM) version: 13 Download: download the raw HMM for this family Species distribution Sunburst Tree Sunburst controls Show Weight segments by... number of sequences number of species Change the size of the sunburst Small Large Colour assignments Archea Eukaryota Bacteria Other sequences Viruses Unclassified Viroids",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}