{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "they have security walking they have alarms for emergencies, they have cameras.",
            "they have all kind of clubs religious ,activities and educational",
            "JSRCC great for quick program or associate degree. it doesn't have all majors so it limited.",
            "JSRCC provide students with all their need. hopefully they would provide more majors.",
            "JSRCC have events, movie nights, and trips",
            "They have good food but not my favorites. they provide hot and cold beverages they provide snacks and food",
            "i don't know about dorms never lived in one. i know they have building, but i don't know their life style",
            "professors communicate with students and they provide all the material needed. the academic that provided is reasonable and fair.",
            "student who their majors isn't provided at JSRCC should take the credits that are transferable to that college that they are graduating at",
            "JSRCC class capacity is great, it help students to be more connected with the professors. They have great programs. and Advisers try to help as much as they can. it has many campuses which give more options to many students"
        ]
    ],
    "pageTitle": "J Sargeant Reynolds Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/J-Sargeant-Reynolds-Community-College/reviews?_escaped_fragment_=/show/122631",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896041599,
    "recordOffset": 895996068,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{178423=© 2015, Cappex.com, LLC, 54192=I graduated in 2008 with my RN. This school was great. Now going back to school for my BSN and taking prerequisites here for another BSN program., 168600=J Sargeant Reynolds' tuition rates are good compared to other colleges in my opinion. For in state tuition, I have seen similar and nearby colleges coming in at over 400 dollars. J Sargeant Reynolds tuition is less than 147 dollars currently (January 2015).}",
    "textBeforeTable": "10/24/2010 Reviewer is A current student here. 1 out of 1 people found this review useful. 1 of 39 Quinton from Mechanicsville, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Bang for the buck There's no doubt what so ever that this school deserves every dollar per credit hour! The cheapest four year university in the area is VCU, which at approx. $7,000 a year for only tuition, is triple what you'd pay at J. Sargeant Reynolds. People may assume J. Sargeant Reynolds has to have such low rates solely because it is a community college and its not like they're actually teaching the students, anyway. To which, I would reply to that completely incorrect statement, not only are we being taught for wonderful rates, but we are being taught for wonderful rates by professors who also teach at other four year universities and graduate schools in the area (such as VCU and the University of Richmond). Am enjoying being here Because J Sargeant Reynolds is a community college, the people that make up the student body are just that: the community. Richmond, VA is a colorful city and J Sarg is the proof! Personally, it made for a very easy transition since I came from a very diverse high school campus. However, many people come directly from the local high schools with their friends. Though that aspect may be intimidating for people not originally from the area and/or the older students, the familiarity and security provided by the already formed groups could be considered",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}