{
    "relation": [
        [
            "Patent application number",
            "20110001693",
            "20110142421",
            "20130198777",
            "20140149789"
        ],
        [
            "Description",
            "BACKLIGHT UNIT FOR LIQUID CRYSTAL DISPLAY DEVICE - There is provided a backlight unit for an LCD device. The backlight unit, disposed under a liquid crystal panel and emitting light to a liquid crystal panel, includes a lightguide plate, a light emitting diode (LED) array disposed at an edge of the lightguide plate and including a plurality of LED blocks each including at least one LED emitting white light, and a controller controlling a current signal applied to each of the plurality of LED blocks to regulate the luminance of each LED block. Accordingly, the backlight unit can be provided, which is capable of contributing to manufacturing thinner and larger products and realizing effective local dimming by using an LED disposed at an edge of the lightguide plate.",
            "APPARATUS AND METHOD FOR MANAGING POWER OF DIGITAL BROADCASTING RECEIVER - An apparatus and a method for managing power of a digital broadcasting receiver are provided. The apparatus includes a user setting unit for requesting power setting of the digital broadcasting receiver according to data input through a user interface, a pattern recognition unit for recognizing a use pattern through data input according to use of the digital broadcasting receiver, and for requesting power setting of the digital broadcasting receiver according to the recognized use pattern, and a power setting unit for setting the power of the digital broadcasting receiver by a request of the user setting unit and the pattern recognition unit.",
            "REPRODUCTION APPARATUS AND CONTROLLING METHOD USING THE SAME - A method for controlling a reproduction apparatus is provided. The method for controlling a reproduction apparatus includes receiving contents including video data and audio data, transmitting a request for transmission of external audio data regarding the contents to an external server, and outputting the external audio data along with the video data in accordance with a user command for transmitting the external audio data.",
            "DISPLAY APPARATUS AND SOFTWARE RECOVERY METHOD - Provided are an image processing apparatus and a software recovery method. The image processing apparatus, which is driven by software, includes: a storage which stores reference software; and a software recoverer which recovers current software with the reference software according to a predetermined command signal. Accordingly, recovering software, even in circumstances where a broadcasting signal may not be received, is provided."
        ],
        [
            "Published",
            "01-06-2011",
            "06-16-2011",
            "08-01-2013",
            "05-29-2014"
        ]
    ],
    "pageTitle": "Hyung-Suk - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hyung-suk-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00006-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 434050215,
    "recordOffset": 434031000,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hyung-Suk Kim, Suwon-Si KR 02-05-2015 OPERATING METHOD OF NONVOLATILE MEMORY DEVICE AND OPERATING METHOD OF MEMORY CONTROLLER CONTROLLING THE NONVOLATILE MEMORY DEVICE - An operating method of a memory controller controlling a nonvolatile memory device including a plurality of pages includes receiving a read request and a logical address from an additional device; determining a program state of an upper unselected word line of a selected word line corresponding to the received logical address; and transmitting a physical address corresponding to the logical address, state information, and a read command to the nonvolatile memory device according to a result of the determination in response to the read request, wherein the state information indicates a level of a first unselect read voltage the nonvolatile memory device is to apply to the upper unselected word line. 20150036431 11-06-2014 SWITCH APPARATUS FOR VEHICLE - A switch apparatus may include a switch body to which a connector of an electronic unit is connected and in which a relay board is provided, a conductive coupling section provided at a lower end of the switch body to be coupled to a vehicle body, and a conductive ground member having a base provided at a lower portion in an internal space of the switch body to be coupled to an upper end of the coupling section, and a clamping bar extending upwards from one side of the base to be coupled to a ground terminal provided at a lower end",
    "textAfterTable": "Patent applications by Hyung-Suk Kim, Suwon-Si KR Hyung-Suk Lee, Seongnam-Si KR Patent application number Description Published 20090009599 Intelligent surveillance system and method of controlling the same - An intelligent surveillance system and a method of controlling the same. The intelligent surveillance system and method monitor a specific surveillance region. When detecting a specific object in the surveillance region during surveillance, the intelligent surveillance system and method determine the risk of the detected object and automatically changes a tracking object based on the determined result. The intelligent surveillance system includes a surveillance unit installed in a specific region for monitoring at least a portion of the specific region as a surveillance region and detecting a plurality of moving objects in the surveillance region, a control unit for determining the risk of each of the moving objects detected by the surveillance unit and selecting at least one of the moving objects as tracking objects on the basis of the risk, and a tracking unit for tracking the tracking object. 01-08-2009 Hyung-Suk Lee, Suwon-Si KR Patent application number Description Published 20130244396 FIELD EFFECT TRANSISTORS HAVING AN EPITAXIAL LAYER ON A FIN AND METHODS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}