{
    "relation": [
        [
            "Date",
            "02:16p",
            "02:16p",
            "02:16p",
            "02:16p",
            "02:16p",
            "02:16p",
            "02:15p",
            "02:15p",
            "02:15p",
            "02:15p"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "GRAMERCY PROPERTY : Announces Acquisition of a $26.1 Million Distribution Facility in Philadelphia, PA",
            "BRUNSWICK : Mercury Marine to release new Flo-Torq propeller hub system",
            "BRUNSWICK : Quicksilver Powersports Lubricants Partners With Andy Lally for Tudor and Nationwide Races",
            "New Construction Disappoints in Second Quarter",
            "IDI : SHAREHOLDER ALERT: Levi & Korsinsky, LLP Notifies Shareholders of IDI, Inc. of Pendency of Class Action Lawsuit and a Lead Plaintiff Deadline of September 21, 2015 -- IDI",
            "Harper Government Invests in Improvements to the Rural Municipality of Macdonald's Community Infrastructure",
            "REGENCY CENTERS : Announces Enhancement of Gateway Shopping Center in Bustling Philadelphia Market",
            "GRAMMER : Vorläufige Zahlen für das erste Halbjahr 2015 veröffentlicht (DGAP Adhoc)",
            "GRAMMER : Preliminary figures for the first half 2015 published (DGAP Adhoc)",
            "WEC ENERGY : Trillium CNG : Inks Deal With Niagara Frontier Transportation Authority"
        ]
    ],
    "pageTitle": "Destatis - Statistisches Bundesamt Deutschland : German economy withstands the European economic crisis in 2012",
    "title": "",
    "url": "http://www.4-traders.com/news/Destatis-Statistisches-Bundesamt-Deutschland--German-economy-withstands-the-European-economic-cri--15825607/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 263052035,
    "recordOffset": 263023295,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60829=WIESBADEN- The German economy continued to grow on an annual average in 2012. The price-adjusted gross domestic product (GDP) increased by 0.7% compared with the previous year. This is the result of the first, provisional calculations of the Federal Statistical Office (Destatis). In the previous two years, GDP growth had been much larger (4.2% in 2010 and 3.0% in 2011), but that was due to a catching-up process following the worldwide economic crisis of 2009. \"In 2012 the German economy proved to be resistant in a difficult economic environment and withstood the European recession\", said Roderich Egeler, President of the Federal Statistical Office at a press conference on the gross domestic product of 2012 in Wiesbadentoday. In the second half of the year, however, the economic activity in Germany slowed down considerably., 65276=On the use side of the gross domestic product, foreign trade proved to be very robust, considering the difficult external environment. In 2012, in price-adjusted terms, German exports of goods and services were up a total 4.1% on a year earlier. At the same time, imports rose by just 2.3%. The balance of exports and imports contributed 1.1 percentage points to GDP growth in 2012 and, consequently, was once again the main driving force for economic growth in Germany. , 67205=The government budgets continued their consolidation in 2012. According to provisional calculations, general government - comprising the central, state and local government as well as social security funds - recorded a net lending of 2.2 billion euros at the end of the year. Compared with the previous year, the central government considerably reduced its deficit again, whereas local government and especially the social security funds achieved a large surplus, as they did in 2011. When measured as a percentage of the gross domestic product at current prices, this is a 0.1% surplus ratio of general government. For the first time since 2007, general government showed a balanced budget for 2012. , 66707=The number of persons in employment reached a record level for the sixth consecutive year in 2012 (41.6 million). Labour productivity (price-adjusted gross domestic product per person in employment) was down 0.3% in 2012. When measured per hour worked by persons in employment, however, labour productivity increased by 0.4% because the increase in the number of total hours worked by persons in employment was smaller than the increase in the gross domestic product., 63386=In calendar-adjusted terms, the GDP growth rate was higher at 0.9% because, in 2012, the number of working days was by three days smaller than in 2011. One reason is that the Christmas holidays fell on working days., 65788=Domestic demand developed in different directions. Final consumption expenditure of households (+0.8%) and of government (+1.0%) increased, whereas capital formation did not contribute positively to GDP growth for the first time since the economic crisis of 2009. Instead, it decreased in part markedly. Gross fixed capital formation in construction fell by 1.1% and gross fixed capital formation in machinery and equipment by as much as 4.4%. , 68568=On 14 February 2013, the Federal Statistical Office will publish first national accounting results for the fourth quarter of 2012 and the revised results for the year 2012 (only GDP); on 22 February 2013, the detailed results will be released. , 66268=A characteristic feature of the production of the gross domestic product in 2012 is that the economy was divided into two parts. In the service branches, price-adjusted gross value added rose, in part considerably, on 2011. However, both industry, excluding construction (-0.8%) and construction (-1.7%) went negative. Total price-adjusted gross value added of all economic sectors rose 0.7%, as did the GDP., 68848=The results published in August 2012 for the years 1991 to 2011 have not been revised, as is always the case at this time of the year., 60701=General government achieves net lending for the first time since 2007, 67947=More detailed national accounts data for 2012 are contained in the statement delivered by President Roderich Egelerat the press conference today and in the accompanying material on the \"Bruttoinlandsprodukt 2012 für Deutschland\", all of which is available at www.destatis.de (in German only). }",
    "textBeforeTable": "Latest news }); googletag.display('div-gpt-ad-1378917786139-0'); googletag.enableServices(); googletag.pubads().setTargeting('StayOn', 'NO'); googletag.pubads().setTargeting('Content', 'news'); googletag.pubads().enableSingleRequest(); googletag.defineSlot('/4093671/4T_NewsUnder', [[600, 250], [605, 180]], 'div-gpt-ad-1378917786139-0').addService(googletag.pubads()); googletag.cmd.push(function() { fjs.parentNode.insertBefore(js, fjs); js.src = \"//connect.facebook.net/en_US/all.js#xfbml=1\"; js = d.createElement(s); js.id = id; if (d.getElementById(id)) return; var js, fjs = d.getElementsByTagName(s)[0];",
    "textAfterTable": "Latest news Advertisement Hot News   ARCH COAL : Announces Receipt of Requisite Consent for 2020 Exchange Offer and Extension of Private Debt Exchange Offers ACCESSO TECHNOLOGY : *numis raises accesso technology price target to 910 (730) pence - 'buy'",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}