{
    "relation": [
        [
            "Weapon",
            "AT-14 (9M163 Missile)",
            "AT-14 (9M163G Missile)"
        ],
        [
            "Reload",
            "6",
            "6"
        ],
        [
            "Round",
            "HEAT-T",
            "Thermobaric"
        ],
        [
            "Min Range",
            "100",
            "100"
        ],
        [
            "Max Range",
            "5500",
            "5500"
        ],
        [
            "Damage",
            "C30 B55",
            "C92 B54"
        ],
        [
            "Pen",
            "165C/206C",
            "88C"
        ],
        [
            "Difficulty",
            "ESY",
            "ESY"
        ]
    ],
    "pageTitle": "Russian ATGMs",
    "title": "",
    "url": "http://www.pmulcahy.com/atgm/russian_atgm.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00089-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 642980815,
    "recordOffset": 642968473,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{107368=Twilight 2000 Notes: The first use of the AT-15 was in August of 1997 in the Ukraine, but it was not often seen during the Twilight War., 69350=Merc 2000 Notes: Production of this missile was dropped within 4 months of its introduction in favor of the AT-16., 117566=(Launcher) NA; (9M127 Missile) $2703, (9M227 Missile) $2716, (9M227M1 Missile) $14580, (9M227M2 Missile) $4983, (9M127F Missile) $1652, (9M127G Missile) $3304, (9M227F Missile) $17570, (9M227G1 Missile) $35140, (9M227G2 Missile) $19139, 69160=Twilight 2000 Notes: Special operations variants of the Ka-60 and Ka-115 are also capable of using the AT-9. About 10% of the MT-LB AT-6 ATGM vehicles were also able to use the AT-9., 5223=2700, 114905=Twilight 2000 Notes: The MiG-35, MiG-37, and Su-40 are also able to use the AT-16. Though it was not designed for firing from ground vehicles, some of the MT-LB AT-6 ATGM carriers were reportedly modified late in the war to use the Scallion., 77140=AT-9 (9A2220 Missile), 102584=1250, 30686=(9P135 Launcher) $1900, (9P135M Launcher) $2900, (9P135M3 Launcher) $3900, (9S451M2 Launcher) $4125; (9M111 Missile) $417, (9M111-2 Missile) $391 kg, (9M111M Missile) $, 117375=(9M127 Series Missiles) 2000; (9M227 Series Missiles) 2175, 88970=1700, 133359=2400, 98437=1500, 46023=1900, 68454=Notes: This is known to the Russians as the 9M120 Ataka. The AT-9 is an upgraded AT-6, with a better guidance system that is more resistant to jamming, a somewhat faster speed of 2000 meters per phase, and a longer range and more effective warhead. Most use of the AT-9 is from helicopters, particularly the Mi-24, Mi-28, Mi-38, and Mi-40 series, the Helix series, and the Ka-50s. The AT-9 has sufficient speed and guidance capability that it can be used against helicopters and slower aircraft. The AT-9 is one of the rarer Russian ATGM, despite having not been introduced until 1990; the Russians developed a heavier and more advanced version of the AT-6/AT-9 series, the AT-16, soon thereafter., 26969=Notes: This man-portable replaced the AT-3 Sagger in most Russian units as well as those of most First World and Second World Soviet and Russian client states. It is a large improvement in terms of guidance over the Sagger, and many comparisons have been made between the AT-4 and the Milan with regards to form factor and method of guidance. Though the AT-4’s tripod/sight unit are less bulky, they are heavier than that of the Milan; the AT-4 also lacks the toughness of the Milan’s electronics and is quite easy to put out of commission by a stray bump or being dropped in the wrong way. Most AT-4’s are sold with a clip-on night vision system; this is IR in the case of export systems, but usually thermal vision for Russian systems. A handicap of both of these night vision systems is that neither has the range of the 9M111-2 or 9M111M missiles that can be fired from it (2000 meters of range for the NOD, 2500 meters of range for the missiles mentioned). A later thermal imaging unit increases the observation range of the viewer to 3600 meters. Despite these shortcomings, the AT-4 has proliferated widely throughout the world. Note that the updated 9P135M-series firing units may also fire AT-5 Spandrel missiles., 130231=Twilight/Merc 2000 Notes: When the Russians decided to use a 135mm main gun on the T-95 and Black Eagle tanks, most of the gun’s designers felt the gun-fired ATGM was not necessary anymore, considering the variety of ammunition they developed for the gun, the gun’s range advantage over the 125mm gun, and the superior fire control system on those tanks. However, the Army felt that new technology would also allow for a more effective missile that could be fired through the main gun, and also allow the T-95 and Black Eagle to do some things that other tanks could not. To this end, the 9M133 Rosomaha (Wolverine) was developed, known to the West by the NATO reporting name AT-17 Satchel. Like other gun-fired Russian ATGMs, the Satchel comes in a variety of warheads, including some normally found only in the West, to allow it to accomplish antivehicle, antipersonnel, antibunker, and antihelicopter attacks at extended range. With a speed of 2400 meters per phase, the missile is swift and deadly., 11808=2500, 133496=(Launcher) NA; (9M133 Missile) $2539, (9M133F1 Missile) $2596, (9M133F2 Missile) $2368, (9M133G Missile) $3157, (9M133M1 Missile) $3613, (9M233 Missile) $2708, (9M233M1 Missile) $2891, (9M233M2 Missile) $3554, 71684=(Launcher) NA; (9M120 Missile) $670, (9M120F Missile) $1095, (9M220 Missile) $1004, (9A220 Missile) $512, 114014=Notes: Known as the 9M127 Vikhr to the Russians, the Scallion was introduced shortly after the AT-9 Spiral-2, and is a greatly-improved version of that missile and the AT-6 Spiral. It is a fast, powerful missile that is used not only from the latest Russian attack helicopters, but also from aircraft such as the SU-25 and SU-39 Frogfoot, and the various versions of the Flanker. Several versions of the Scallion are available for the Twilight War, including a few experimental models that are rather rare. The Scallion has the speed and maneuverability to take down helicopters and slow-flying aircraft; the 9M227F is particularly useful for this, as it can be used as a conventional heat-seeking air-to-air missile in addition to being able to attack ground targets. Speed of the 9M127 series is 2000 meters per phase, while the speed of the 9M227 series is 2175 meters per phase., 102721=(Launcher) $7290; (9M163 Missile) $957, (9M163G Missile) $1056, 82017=(Launcher) NA; (9M116/9M117 Missiles) $1432; (9M116M1/9M117M1 Missiles) $2148, 46160=(Launcher) Vehicle Mount; (9M114 Missile) $606, (9M114M1 Missile) $999, (9M114G1 Missile) $1092, 81824=(9M116/9M117 Missiles) 1850; (9M116M1/9M117M1 Missiles) 1500, 39112=1000, 100188=Notes: This weapon was intended to replace the AT-5 Spandrel ATGM, but as it was not introduced until 1994, it has not yet fully supplanted that system. It is a laser-guided system, and all the operator must do is to keep the crosshairs on target to ensure a hit. A thermal sight is added for night use., 89107=(Launcher) NA; (9M119 Svir/Reflecks Missiles) $1464; (9M119M1 Reflecks-M Missile) $2166, 33298=2000, 36753=Twilight 2000 Notes: Though the AT-5 was massively deployed, generations of missiles as early as AT-1 continued to be used by Mobilization-Only units and by Third World countries such as North Korea and Afghanistan., 78291=Notes: This is a laser-guided ATGM fired from the gun barrel of a tank or IFV using a 100mm or 115mm gun and equipped with certain special equipment. There are seven versions of the Stabber, consisting four basic versions and three improved versions. The basic versions are the 9M117 Bastion (fired by a specially-equipped version of the T-55 tank known as the T-55 AM2), the 9M117 Kastet (fired by versions of the MT-12 field gun equipped with a laser guidance module), the 9M117 Basnya (fired by BMP-3 IFV’s), and the 9M116 Sheksna (fired by a specially-modified T-62 tank known as the T-62M). The improved versions are the 9M117M1 Kan (fired by the MT-12 field gun, as above), the 9M117M1 Arkan (fired by the BMP-3), and the 9M116M1 Sheksna (fired by the T-62M). The difference between the basic and improved versions is the tandem warhead used by the improved models to allow a better result against ERA. The basic rounds are all virtually identical (except for the caliber difference between the 9M117 and 9M116), but are different enough that they cannot be interchanged; a Kastet cannot be fired from a BMP-3, an MT-12 cannot fire a Bastion, etc. The same is true for the improved missiles. The speed of the 9M116 and 9M117 missiles is 1850 meters per phase, while the heavier 9M116M and 9M117M fly at 1500 meters per phase.}",
    "lastModified": "Mon, 31 May 2004 09:55:23 GMT",
    "textBeforeTable": "(Ground Mount) $2000; (Missile) $302 268 Wire MCLOS 140mm (Ground Mount) 22.5 kg; (9K12 Missile) 22.25 kg AT-1 Snapper (2K15 Shmel) Prices Missile Speed Guidance Missile Caliber Weights Weapon AT-1 Snapper Notes: The Soviet’s first attempt at an ATGM, the Snapper is now considered an antique. Nevertheless, the Snapper can still be found in mobilization-only units and Third World nations like North Korea. The AT-1 can be used from a ground mount or from makeshift vehicle mounts; some of the original mountings include quadruple mounts on BRDM and UAZ-469 vehicles. The AT-1 is a very slow missile; on a smooth road, some vehicles may actually be able to outrun it.",
    "textAfterTable": "Prices AT-2 Swatter-A (3K11 Fleyta) (Launcher) 29.4 kg; (3M11 missile) 26.5 kg 132mm Radio MCLOS 750 (Launcher) $2064; (3M11 Missile) $398 AT-2 Swatter-B (3K11M Fleyta) (Launcher) 29.4 kg; (9M17M/9M17P Missiles) 26.5 kg 132mm IR SACLOS 750 (Launcher) $2840; (9M17M Missile) $477, (9M17P Missile) $482 Weapon Reload Round Min Range Max Range Damage",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}