{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "ehh, you may want to watch your back, especially at night, you could be mugged",
            "stay out of teh sun",
            "Cape fear has a lot of different clubs and activities",
            "average",
            "The beach, why else come to wilmington",
            "Centered downtown there are a lot of good resturants",
            "There are no dorms",
            "Challenging yet worth it",
            "study hard",
            "Cape Fear is functional, and the staff is friendly and helpful. The teachers are very helpful, knowledgeable and articulate about the subjects they teach. The school is continuously expanding and growing"
        ]
    ],
    "pageTitle": "Cape Fear Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Cape-Fear-Community-College/reviews?_escaped_fragment_=/show/35197",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905865547,
    "recordOffset": 905829403,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{143060=© 2015, Cappex.com, LLC, 3934=North Campus cafeteria 3 stars. downtown 2 stars lunch has gone down spring 2012 semester. the atmosphere is why i gave 4 stars. if, you attend downtown you can eat outside in the courtyard. north campus has a nice cafeteria, or you can eat outside on any bench.}",
    "textBeforeTable": "05/17/2011 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 36 Angel from Wilmington, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Dorm Life community colleges do not have dorms. Academic Rigor I work full time. 2 classes a semester is all i can handle. you have to allow enough time to study. Tips for prospective students Time management is key! In three sentences I have really enjoyed the variety of courses offered: evening, hybrid, or on-line courses. The staff is phenomenal, especially at the North Campus. Opportunity has knocked on the door for students that want to extend their associate in business degree through NC Wesleyan at CFCC North Campus! Login to rate or flag the reviews Jasmine from Riegelwood, NC 04/18/2012 Reviewer is A current student here. 1 out of 1 people found this review useful. 3 of 36 Categories Comments Campus Safety 4 1/2-Campus security as well as the local police station being nearby",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}