{
    "relation": [
        [
            "Model:",
            "Engine type:",
            "Cylinder #:",
            "Cubic Centimeters (CC):",
            "Max. Horse Power (HP):",
            "Dry weight (lbs.)",
            "Reduction drive ratio:",
            "Fuel tank (U.S. Gallons):",
            "Flying time (hrs.):",
            "Max. pilot weight (lbs.):",
            "Propeller blades #:",
            "Propeller diameter",
            "Static thrust (lbs.):",
            "Electric starter:"
        ],
        [
            "Race Light",
            "Vittorazi Fly 100 Evo",
            "1",
            "100",
            "18",
            "49",
            "1:3",
            "4.3",
            "6",
            "200",
            "2 blade wooden",
            "48\"",
            "120",
            "easy-over-the-shoulder MANUAL starter with GEAR DRIVE CENTRIFUGAL CLUTCH"
        ],
        [
            "Race Deluxe",
            "Vittorazi Fly 100 Evo",
            "1",
            "100",
            "18",
            "55",
            "1:3",
            "4.3",
            "6",
            "200",
            "2 blade wooden",
            "48\"",
            "120",
            "ELECTRIC starter and easy-over-the-shoulder MANUAL starter with GEAR DRIVE CENTRIFUGAL CLUTCH"
        ]
    ],
    "pageTitle": "PlanetPPG Fly Products",
    "title": "",
    "url": "http://www.planetppg.com/Fly_Products.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00108-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 647146256,
    "recordOffset": 647130291,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9822=Well known Italian manufacturer Ciscomotors (Snap 100) brings for 2010 a powerful and reliable engine to compete with other powerful engines in the +25 HP range. The only proven, centrifugal clutch that really works on powerful engines. No manufacturer has achieved this feature in the past with engines above the 25 HP but Cisco motors did it. Compact, well built engine to suit heavy weight pilots or tandem, 19612=Polini Racing Motori, famous Italian manufacturer of racing engines, enters the Powered Paragliding market in 2010 with the Polini Thor 100. This engine features advanced technical solutions. It was projected to achieve the best weight-power ratio but, at the same time, to optimize the thermal and moving parts functions. The cooling system was studied with great care and Polini opted for the forced air. The transmission group includes the clutch in oil bath with maximum stability., 19947=All new for 2010., 11300=2010 FLY Products Hornet with Cisco motors C-Max series of engines was developed to suit pilots looking for power in a unit that offers different starter options:}",
    "TableContextTimeStampAfterTable": "{8791=These improvements are available as an upgrade kit for all previous versions of the Gold (2001-2003 models)., 9383=The same power plant used since 2001 has won innumerable awards (Sun’n Fun fly-in best Powered Paraglider at show, Parastars PPG Convention thrust contest, Albuquerque fly-in thrust contest, PPG National Convention thrust contest, etc). There is no power plant like the Simonini Mini 2 Plus (G24) in the way that FLY Products put it together (exclusive exhaust system and Bing 84 bowl carburetor) that compares in performance, reliability and thrust to others, 23699=Fly Products Race: The 2006 version of the FLY Products Power Race paramotor is the perfect balance between weight, power and portability., 8914=New redesigned chromed tune pipe exhaust + maze silencer + carburetor intake silencer. Great for noise level reduction and very reliable. Easy installation. Available for 2001-2005 FLY Products Power Gold versions and is $775, 37343=BEST SELLER IN 2008., 64688=Fly Products Kompress Magic: Paramotor suitable for pilot weight from 130 lbs. to 200 lbs - The new 2007 FLY Products Kompress Magic is the ideal light weight paramotor for the pilot looking for a powerful, reliable and portable unit, 66018=JPX Italia, manufacturer of the well known Corsair Black Devil engine (one of the most popular engines in the paramotoring market today) has worked extensively for the last two years developing a light weight engine. The result is the Corsair Black Magic. FLY Products is the first paramotor manufacturer to introduce the new 2007 Corsair Black Magic in their fine line of Powered Paragliders., 8478=FLY Products achieved a significant reduction in noise level on the 2004 Gold model by installing a different chromed tune pipe exhaust with an extra muffler (silencer) and a carburetor intake silencer.}",
    "lastModified": "Tue, 26 Apr 2011 04:46:35 GMT",
    "textBeforeTable": "Top Fly Products Race: The 2006 version of the FLY Products Power Race paramotor is the perfect balance between weight, power and portability. Paramotor suitable for pilot weight from 130 lbs. to 200 lbs. Vittorazi Fly 100 Evo engine of 18 HP 100 cc. Available in two versions: Race Light (manual starter with gear drive centrifugal clutch) and Race Deluxe (manual and electric starter with gear drive centrifugal clutch – extra $250), intake carburetor silencer, chromed tune pipe exhaust with an extra muffler (silencer), wooden propeller, fully dismountable frame (2 pieces) and cage (6 pieces) for easy and compact transportation inside a FLY Products hard suitcase. Price does not include the hard suitcase ($480).   It is the ideal paramotor for the light to medium weight PPG pilot (recommended for pilots up to 200 lbs.). The Vittorazi Fly 100 Evo is the most reliable and powerful 100 cc. engine of the market today. Bullet-proof gear drive centrifugal clutch and its fully dismountable cage and main frame (same as Kompress) make things easy when transporting the unit inside a hard suitcase (optional) to places outside your local flying field The engine is cooled by a turbine fitted between the cylinder and head. The gear drive consists of oil lubricated gears, with high speed bearings and oil guards in",
    "textAfterTable": "Top Fly Products Max: Paramotor suitable for pilot weight from 130 lbs. to 440 lbs. BEST SELLER IN 2008. FLY Products did it again! The Max combines the perfect ratio power with reliability and portability that a PPG pilot demands in a paramotor. Attractive new colors combined with excellence in workmanship. This is what the Max is about. Two sizes available ... 100 and 130         The same reliable powerplant as on the FLY Products Gold unit; Simonini Mini 2 Plus (G24) engine of 28 HP 200 cc. Electric starter, power ignition, Bing 84 carburetor, intake carburetor silencer, chromed tune pipe Exhaust with an extra muffler (silencer) Quality wood propeller and fully portable 6 piece dismountable cage 2 piece dismountable frame for easy transportation     Price includes: Simonini Mini 2 Plus (G24) engine of 28 HP 200 cc’s, electric starter, Bing 84 bowl carburetor, Righetti intake carburetor silencer, chromed tune pipe exhaust with an extra muffler (silencer), deluxe throttle with low fuel warning light, start/stop switch and",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}