{
    "relation": [
        [
            "Region",
            "Western",
            "South",
            "Central Anatolia",
            "Northern",
            "East-South-east"
        ],
        [
            "Civil",
            "14.5",
            "5.3",
            "8.5",
            "5.0",
            "7.1"
        ],
        [
            "Civil and religious",
            "83.3",
            "89.6",
            "88.4",
            "92.9",
            "74.1"
        ],
        [
            "Religious",
            "1.5",
            "4.3",
            "2.7",
            "1.6",
            "18.0"
        ],
        [
            "Other",
            "0.1",
            "0.2",
            "0.1",
            "0.1",
            "0.3"
        ],
        [
            "Unknown",
            "0.6",
            "0.6",
            "0.3",
            "0.4",
            "0.5"
        ]
    ],
    "pageTitle": "Refworld | UN Committee on the Elimination of Discrimination against Women: State Party Report, Turkey",
    "title": "",
    "url": "http://www.refworld.org/cgi-bin/texis/vtx/rwmain?page=publisher&publisher=CEDAW&type=&coi=TUR&docid=3ae6ae1a4&skip=0",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00023-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 678505807,
    "recordOffset": 678453770,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{112869=(a)The Social Security Organization Law No. 506 was enacted on 17 July 1964 and became effective when published in the Official Gazette dated 1 March 1965;, 14108=(d)For the first time in Turkey, a Women's Library and Information Centre Foundation was established in April 1990.The main objective of the Library is to collect in one place all publications and documents on the problems of women, such as: research material, books, statistical data, laws, newspaper clippings, letters, diaries, memoirs, conference papers, posters, photographs, films, videos, regulations and pamphlets of women's associations, etc.Further objectives are to collect the works of female Turkish authors since the Ottoman period, transcribe such Arabic works into modern Turkish, collect and preserve contemporary documents for the benefit of future generations.In addition, the Centre aims to organize conferences, seminars, concerts, exhibitions and special subject days by female authors and artists;, 45219=(ii)Ankara Alt9nda\u0097 Women's Information Centre and Women's Shelter Established October 1991 Application:210 Women's shelter established 2 May 1993., 44116=(iii)Bursa Women's Guest House Established January 1992 Resident women:8, 113047=(b)The Civil Servants Law No. 657 was enacted on 14 July 1966 and became effective when published in Official Gazette No. 12,056 of 23 July 1966;, 43917=(i)Ankara Women's Guest House Established October 1990 Application:97 Resident women:73, 95421=(a)The ILO Convention No. 45 concerning the Employment of Women on Underground Work in Mines of All Kinds was ratified by Law No. 3,229 of 1 June 1937 and was effective when published in Official Gazette No. 3,638 of 23 June 1937;, 44518=(ii)¤zmir Bornova Municipality Women's Information Centre Established November 1990 Resident women:195, 7527=(c)Although there were no clauses in Turkish laws against women being assigned to duties in the local administrations, traditions and practices did bring such a restriction, but this was abolished.In 1991, for the first time, a woman was assigned as Governor, which is the highest position within the local administration.By 1992, three women who had passed the qualification examinations to become district governors were appointed as district governor candidates., 45092=(i)¤stanbul Mor Gat9 Women's Shelter-Women's Solidarity Centre Established November 1990 Application:262, 7177=(b)Article 159 of the Turkish Civil Code, which required a woman to have the permission of her husband in order to work, was cancelled by the Constitutional Court in 1990.The decision of annulment was effective when it was published in Official Gazette No. 21,272 of 2 July 1992, along with the justifications for the decision;, 14944=(e)The \"Lead Woman\" project of the metropolitan municipality of Ankara, in cooperation with the United States-based organization, the Centre for Development of Population Activities (CEDPA), was initiated in the Mamak-Bo\u0097aziHi district in 1991.This project on family planning is to be expanded to cover the whole of Ankara.The \"Lead Woman\" project is considered by the municipality as a part of health services and was introduced by 20 women selected from among those living in the district with the support of the Home and Family Clinic established in the area.The \"Lead Women\", following their orientation, through the families in their district, started a social service programme supported by the clinic on creating awareness for population planning and applied services.Project activities are still under way on mother and child care, family planning, nutrition and the need for economic independence matters., 113215=(c)The Social Security Law No. 1,479, covering tradesmen and craftsmen and other self-employed, was enacted on 2 September 1971 and made effective when published in Official Gazette No. 13,956 of 14 September 1971., 10342=(a)The Women's Studies Centre is an interdisciplinary unit established in 1990 within the Istanbul University with the objectives of:, 44643=(iii)Nazilli Municipality Women's Information Centre Established April 1990 Resident women:data not available, 95938=(c)The ILO Convention No. 111 concerning Discrimination in Respect of Employment and Occupation as ratified by Law No. 811 of 13 December 1966 and became effective when published in Official Gazette No. 12,484 of 22 December 1966;, 44204=(iv)Antalya Women's Guest House Established October 1992 Application:36 Resident women:32;, 6557=(a)The provision in article 438 of the Turkish Penal Code, stating that where acts of abduction and rape were committed against women making a profession of prostitution, the sentences indicated in the relevant provisions of the law might be reduced by one third, was amended. This clause was found to be controversial with contemporary thought, the spirit of fundamental rights and freedoms, articles 10 and 12 of the Constitution and the clauses of the Convention on the Elimination of All Forms of Discrimination against Women and thus was cancelled by article 28 of Law No. 3,679 of 21 November 1990;, 44020=(ii)¤zmir Women's Guest House Established October 1990 Resident women:195, 11094=(b)The Women's Employment Research Centre, was established in 1990 as a unit within Marmara University.The main objectives of the Centre are:tackling the unemployment problems of the female labour force in Turkey, analysing and studying the problems confronted by working women, creating awareness in the public on these problems, promoting the subject with the help of various publications, seminars and conferences, presenting suggestions, carrying out training programmes and developing pilot applications.In this direction, the following targets were established:, 12503=(c)The Women's Studies Centre was established as an affiliated body to the University of Ankara under the regulation published in Official Gazette No. 21,490 of 8 February 1993.The objectives of the Centre were defined as conducting research in every field related to the problems of women on a national and international basis and also organizing related training programmes.The activities of the Centre are as follows:, 44768=(iv)Kayseri Municipality Women's Information Centre Established March 1992 Resident women:15, 95674=(b)ILO Convention No. 100 concerning Equal Remuneration for Men and Women Workers for Work of Equal Value was ratified by Law No. 810 of 13 December 1966 and became effective when published in Official Gazette No. 12,484 of 22 December 1966;, 44351=(i)¤stanbul ÔiÕli Municipality Women's Shelters Established September 1990 Application:600 Resident women:190 Resident children:175, 96191=(d)ILO Convention No. 122 concerning Employment Policy was ratified by Law No. 2,027 of 9 November 1976 and became effective when published in Official Gazette No. 15,769 of 20 November 1976.}",
    "textBeforeTable": "Table 1 90.The percentages of female members elected to the Turkish Parliament from 1935 to 1991 are presented in the following table. 89.Another important factor that limits women in Turkey from claiming their political rights is the inadequacy of their education. 88.Women in Turkey are not adequately aware of their political rights and they do not claim such rights which they are entitled to by law in sufficient numbers. 87.In other words, the traditional role and place of women in society is not compatible with a position in politics, thus not permitting them to attain such positions to the extent that they well deserve. 86.Additionally, the political arena in Turkey is as tough as it is in many other countries.Consequently, there is an inevitable factor called the \"time conflict\" often encountered by women in their participation in political activities on one hand and their domestic responsibilities on the other hand, plus the inevitable time allocated to vocations.All of these factors prevent women from entering the strong and time-consuming field of politics. 85.In Turkey, women are not represented adequately in Parliament because they do not consider politics as one of their basic functions or fields of interest. 84.In fact, the above-mentioned percentage was the highest for female deputies in the Republic of Turkey.After 1946, however, there was a rather sharp decline in the percentage.This decline is an outcome of the fading away of the \"symbolization of democracy\" role played by women as a",
    "textAfterTable": "1961-1965 450 3 0.7 1965-1969 450 8 1.8 1969-1973 450 5 1.1 1973-1977 450 6 1.3 1977-1980 450 4 0.9 1983-1987 399 12 3.0 1987-1991 449 6 1.3 1991- 450 8 1.8   91.As shown in table 1, in the general elections of 1987, six female members were elected to the Turkish Parliament.In the same year, the percentage of female members in the total number was 1.3 per cent.During this period, one female member of parliament served as the Minister of Labour and Social Security. 92.An extensive campaign was launched prior to the general elections of 1991, so as to ensure a larger representation of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}