{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is right near a local zoo, so there are many nature trials available to walk on.",
            "You can walk the nature trails.",
            "Madison's bakery is available Monday through Thursday their food is a bit expensive but tastes good.",
            "There are no dorms currently.",
            "I'm going for nursing the classes available and the flexibility is great.",
            "Work as hard as you posibly can.",
            "The Campus is small and friendly. Classes are average sized. Very clean and organized."
        ]
    ],
    "pageTitle": "Atlantic Cape Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Atlantic-Cape-Community-College/reviews?_escaped_fragment_=/show/45746",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906657555,
    "recordOffset": 906625082,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72212=Cape May Court House branch has little to no food/dining, aside from a few vending machines and the occasional pizza., 87504=Every year we celebrate breast cancer awareness the month of october not unusual though. No unusual as a college we are pretty much usual!, 123557=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "09/30/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 30 Kathryn from Egg Harbor Township, NJ Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Categories Comments Great for these types of students ACCC is great for students that aren't quite sure what they want to study, as well as for those looking to save some money on their education. Tips for prospective students Make sure that any transcript requests are send a very long time beforehand. I have had problems recieving paperwork on time, and have heard similar stories from other students. Bang for the buck Tuition prices vary depending on the amount of classes a student takes, but is still very inexpensive. The campus classes are very reasonably priced, but the bookstore is not. I found the class materials to be very overpriced, especially since rental textbooks are generally so cheap. Did enjoy being here While ACCC was a good school, I truly wanted to attend a four year university. Despite my plans to transfer, I enjoyed my classes and time on campus. Did learn a lot Despite the negative image alot of students have regarding community college, I learned a lot of new things from my time attending Atlantic Cape. Login to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}