{
    "relation": [
        [
            "Part #",
            "MAP80-1012 POWER ONE",
            "dsPIC30F2020",
            "TC500A",
            "dsPIC33FJ64GS608",
            "LZSA-1000-3"
        ],
        [
            "Distributor",
            "Allied Electronics, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "RS Electronics"
        ],
        [
            "Manufacturer",
            "POWER-ONE INC",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "Microchip Technology, Inc.",
            "TDK Lambda"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "SWITCHING POWER SUPPLIES, SINGLE OUTPUT, 80 WATTS",
            "dsPIC30F SMPS & Digital Power Conversion 16-bit Digital Signal Controller. These devices offer features supporting common, multi-loop digital switch-mode power supplies (SMPS) and other digital power-conversion applications such as: • AC to DC Converters • DC to DC Converters &bull...",
            "and requires both positive and negative power supplies.The TC500A is identical to the TC500, except it has improved linearity allowing it to operate to a maximum resolution of 17 bits.The TC510 adds an onboard negative power supply converter for single supply operation.The TC514 adds both a negative...",
            "dsPIC33FJXXGSXXX SMPS & Digital Power Conversion 16-bit Digital Signal Controller. These devices offer features supporting common, multi-loop digital switch-mode power supplies (SMPS) and other digital power-conversion applications such as: • AC to DC Converters • DC to DC...",
            "AC/DC Switching Power Supplies, 500-1500W, 85-265VAC Input, 12-24V Single Output; Enclosed; Voltage: 24; Power (W): 1000; Current: 42; Dimensions (Inches W x H x D): 5.62 x 4.75 x 10.5; Warranty: 5 Years."
        ]
    ],
    "pageTitle": "Single Output Power Supplies | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/single_output_power_supplies",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462999503,
    "recordOffset": 462969291,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{114745=Description: definable power-on state VXI plug&play drivers The Keysight Agilent HP 6673A Programmable Power Supply is part of the 667x series of 2000 Watt, single output, power supplies, with an internal GPIB interface and SCPI programming. The Keysight Agilent HP 6673A Programmable Power Supply provides many, 87332=Description: LPS170-M series medically-approved AC-DC power supplies are available with a nominal main output of 5 V, 12 V, 15 V or 24 V, adjustable over a wide 2:1 ratio. Auxiliary 12 V and 5 V standby outputs are also provided. Main output remote sense and single-wire current sharing are supported as standard, 104602=Description: Single & Dual Outputs 4:1 Input Range Operating Temperature 40 °C to +100 °C 1500 VDC Isolation Optional 3000 VDC Version Fully Regulated Output No Minimum Load Required MTBF 2.8 MHrs 3 Year Warranty, 65751=Description: -to-battery transfer and integrated charging system serves as an extended run UPS, a standalone power source or an automotive inverter suitable for rugged RV applications. Supplies up to 1250 watts of continuous 120V AC power from any 12V DC battery or automotive DC source. OverPower TM inverter output, 78532=Description: • 30 Watts • 4:1 Input Range • High Power Density • Single, Dual and Triple Outputs • High Efficiency - Up to 91% • 3 Year Warranty}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "More >> Conduct Research Top Lambda: New DIN Rail Power Supplies Offer Sophistication and Value DIN rail mount power supplies are quickly showing a surprising degree of sophistication. Until recently, these products were simple single output units, often with narrow range AC inputs. An \"option\" would be to have a front panel selector switch to allow the product to accept 230VAC input. Switching power supply design rules expensive and more efficient than equivalent linear supplies. Not long ago, efficiency hinged on the converter's switching devices that wasted most of the power budget during relatively low-frequency transitions -- typically 20 to 30 kHz -- between on and off states. Improving efficiency by increasing Class G Amplifiers Class G amplifier operation involves changing the power supply voltage from a lower level to a higher level when larger output swings are required. There are several ways to do this; the simplest involves a single class AB output stage that is connected to two power-supply rails by a diode Brushless DC Motor Control Using PIC18FXX31 MCUs A PICDEM TM MC demo board was used to develop, test and debug the motor control code. The PICDEM MC has a",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}