{
    "relation": [
        [
            "Part #",
            "710-511",
            "710-503"
        ],
        [
            "Distributor",
            "Global Industrial",
            "Global Industrial"
        ],
        [
            "Manufacturer",
            "Invensys",
            "Invensys"
        ],
        [
            "Product Category",
            "Not Provided",
            "Not Provided"
        ],
        [
            "Description",
            "Gas Heating Valve - 1/2\" Inlet, Hi-Lo Pressure Regulator 1.7\" - 3.5\" Nat.",
            "Gas Heating Valve - 1/2\" Inlet, 3/8\" Outlet, Hi-Lo Pressure Regulator"
        ]
    ],
    "pageTitle": "Gas Valve Pressure Regulators | Products & Suppliers | IHS Engineering360",
    "title": "",
    "url": "http://www.globalspec.com/industrial-directory/gas_valve_pressure_regulators",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476871647,
    "recordOffset": 476845970,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{35405=Description: Gases • Liquids • Acids • Oil Main Features ss 316L balanced valve high flow capacity Cv 3.84 leak tight shut-off diaphragm or piston sensing shell design according to EN 12516, 115540=Description: TESCOM™ WEGA Corrosive Gases and Purging cylinder pressure regulators are designed with a captured bonnet for use with corrosive gases and gas mixtures (based on the highly reliable 44-2200 and 44-2800 Series regulator technology). Dual-stage version is available. Ideal for use in reduction, 59073=Description: TESCOM™ Line Pressure Reducers (Purity 6.0) are based on the reliable and precise 44-2200 and 44-3200 Series. These regulators are supplied with compression fittings and a pressure gauge for the outlet pressure. Ideal for use in line pressure control as a second stage regulator.}",
    "textBeforeTable": "Parts by Number Top",
    "textAfterTable": "Conduct Research Top Bellows smooth valve moves electrodeposited nickel bellows connected by a common orifice. With the turbine shut down, the valve-poppet return spring forces damping oil into the first bellows. On start-up, gas pressure on a diaphragm compresses the first bellows and displaces oil into the second. As the turbine runs, oil constantly MICRO: Ultrapure Gas Delivery - Morgan (September 2000) by the process recipe. These subsystems generally consist of several automatic shutoff valves, a pressure regulator, and a mass-flow controller (MFC). A gas stick receives its supply from a \" gas room, \" which contains the various high- pressure process gases used throughout the facility. These gases MICRO: Characterizing an electrochemical oxygen sensor for process gas monitoring applications to commissioning. However, during routine fab operations, an inadvertent error by a process tool operator or the failure of a delivery system component such as a valve or pressure regulator can cause gas contamination, which, if not detected in a timely manner, can result in a significant amount of scrapped Evaluating the use of MEMS-based gas and fluid delivery systems and electromechanical counterparts. With recent MEMS innovations, the list of conventional gas and liquid control components",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}