{
    "relation": [
        [
            "Payment method",
            "",
            "Postal order/Banker's draft",
            "Personal cheque"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "BIFFY CLYRO ( BRAND NEW CD ) OPPOSITES [ PA ] 2013 | eBay",
    "title": "",
    "url": "http://www.ebay.co.uk/itm/BIFFY-CLYRO-BRAND-NEW-CD-OPPOSITES-PA-2013-/350980310376?pt=UK_CDsDVDs_CDs_CDs_GL&hash=item51b80e8568",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 400974219,
    "recordOffset": 400921322,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details If you have questions about this VAT, please contact the seller. The actual VAT requirements and rates may vary depending on the final sale. VAT price: 20.0% (included in the listed price). paid before 14:00 BST (excludes weekends and holidays). Expected dispatch time may vary and is based on seller's order cut-off time. Will usually dispatch within same working day if Domestic dispatch time payment clears - opens in a new window or tabestimated delivery date . based on the seller’s dispatch time and delivery service. Delivery times may vary, especially during peak periods and will depend on when your * You’ll see an Fri. 7 Aug. and Mon. 17 Aug. Estimated between Royal Mail",
    "textAfterTable": "Seller's payment instructions **FOR INTERNATIONAL/OVERSEAS BUYERS WE ACCEPT PAYPAL ONLY** FOR UK BUYERS PAYING BY GBP CHEQUE, PLEASE ALLOW 7 WORKING DAYS FOR YOUR CHEQUE TO CLEAR BEFORE WE CAN DISPATCH THE ORDER. WE LIKE OUR TRANSACTIONS TO BE SMOOTH, HONEST & FRIENDLY EXCHANGES - WE ONLY WANT HAPPY CUSTOMERS! IF YOU CANNOT PAY...PLEASE DO NOT BUY - THANK YOU. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}