{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No.",
            "Airspace Docket No."
        ],
        [
            "regulations.gov",
            "2015-09388",
            "",
            "FAA-2014-0917",
            "14-ASO-14"
        ]
    ],
    "pageTitle": "14 CFR Part 71 - DESIGNATION OF CLASS A, B, C, D, AND E AIRSPACE AREAS; AIR TRAFFIC SERVICE ROUTES; AND REPORTING POINTS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/14/part-71",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916762591,
    "recordOffset": 916725321,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1041=Title 14 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{265112=This action proposes to amend Class E airspace at Chillicothe Municipal Airport, Chillicothe, MO; Cuba Municipal Airport, Cuba, MO; Farmington Regional Airport, Farmington, MO; Lamar Municipal Airport, Lamar, MO; Mountain View Airport, Mountain View, MO; Nevada Municipal Airport, Nevada, MO; and Poplar Bluff Municipal Airport, Poplar Bluff, MO. Decommissioning of the non-directional radio beacons (NDB) and/or cancellation of NDB approaches due to advances in Global Positioning System (GPS) capabilities has made this action necessary for the safety and management of Instrument Flight Rules (IFR) operations at the above airports. Geographic coordinates are also adjusted at Lamar Municipal Airport, Lamar, MO; and Nevada Municipal Airport, Nevada, MO., 471920=This supplemental notice of proposed rulemaking proposes to remove Class D airspace and Class E surface area airspace at Independence Municipal Airport, Independence, KS. In an NPRM published in the Federal Register September 25, 2014, the FAA proposed to remove Class D airspace at Independence Municipal Airport, Independence, KS. The FAA has reassessed the proposal to include the removal of the associated Class E surface area airspace. The closure of the airport's air traffic control tower has necessitated the need for this proposal., 101027=This action corrects an error in the title of a final rule published in the Federal Register on May 1, 2015, amending Class D Airspace at William P. Gwinn Airport, Jupiter, FL. It should read Class D Airspace, not Class E Airspace, and the word Proposed is removed., 110834=This action corrects the effective date of a final rule published in the Federal Register of April 24, 2015, establishing Class E airspace at Dry Creek Airport, Cypress, TX., 363776=This action withdraws the NPRM published in the Federal Register on May 6, 2014 proposing to amend Class E airspace in the State of North Dakota. The FAA has determined that withdrawal of the NPRM is warranted as additional analysis is needed., 368099=This action withdraws the NPRM published in the Federal Register on May 6, 2014, proposing to amend Class E airspace in the State of South Dakota. The FAA has determined that withdrawal of the NPRM is warranted as additional analysis is needed., 57719=This action corrects an error in the title of a final rule published in the Federal Register on April 29, 2015, amending Class D Airspace at Martin State Airport, Baltimore, MD. It should read Amendment of Class D Airspace Baltimore, Martin State Airport, MD. This action also corrects reference to Restricted Area R-4001C as being MSL, and corrects the airport designation., 208062=Title 14 published on 2015-01-01, 372432=This action withdraws the NPRM published in the Federal Register on May 6, 2014, proposing to amend Class E Airspace in the State of Michigan. The FAA has determined that withdrawal of the NPRM is warranted as additional analysis is needed., 115657=This action amends Class D Airspace at Jupiter, FL, by removing reference to Restricted Area R-2936 in the regulatory text of the Class D airspace area as the restricted area is no longer needed. This action also updates the geographic coordinates of the airport.}",
    "lastModified": "Fri, 31 Jul 2015 18:43:16 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 44841 - Establishment of Class E Airspace; Headland, AL 2015-07-28; vol. 80 # 144 - Tuesday, July 28, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 14. Title 14 published on 2015-01-01. Amdt. 71-14, 56 FR 65654, Dec. 17, 1991, unless otherwise noted. Source: 40120; E.O. 10854, 24 FR 9565, 3 CFR, 1959-1963 Comp., p. 389. 40113, 40103, 49 U.S.C. 106(g), Authority: SUBPART H — Reporting Points (§§ 71.901 - 71.901) SUBPART F — G [Reserved]",
    "textAfterTable": "DEPARTMENT OF TRANSPORTATION, Federal Aviation Administration Final rule. Effective 0901 UTC, October 15, 2015. The Director of the Federal Register approves this incorporation by reference action under title 1, Code of Federal Regulations, part 51, subject to the annual revision of FAA Order 7400.9 and publication of conforming amendments. 14 CFR Part 71 Summary This action establishes Class E Airspace at Headland, AL, to accommodate new Area Navigation (RNAV) Global Positioning System (GPS) Standard Instrument Approach Procedures (SIAPs) serving Headland Municipal Airport. Controlled airspace is necessary for the safety and management of instrument flight rules (IFR) operations at the airport. 80 FR 44842 - Amendment of Class E Airspace; Campbellsville, KY GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-18342 RIN Docket No. FAA-2015-0458 Airspace Docket No.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}