{
    "relation": [
        [
            "Fund",
            "Enterprise Funds",
            "- The U.S.-Russia Investment Fund (TUSRIF)",
            "- Western NIS Enterprise Fund (WNISEF)",
            "- Central Asian-American Enterprise Fund (CAAEF)",
            "Subtotal",
            "EBRD Small Business Funds",
            "- Russia Small Business Fund",
            "- Lower Volga Regional Venture Fund",
            "Trans-Caucasus Enterprise Fund",
            "Total"
        ],
        [
            "Funds Authorized",
            "",
            "$440m",
            "$150m",
            "$150m",
            "$740m",
            "",
            "$35m",
            "$20m",
            "$25m",
            "$820m"
        ],
        [
            "Funds Obligated",
            "",
            "$297m",
            "$137m",
            "$111m",
            "$509m",
            "",
            "$35m",
            "$20m",
            "$20m",
            "$584m"
        ],
        [
            "Funds Expended",
            "",
            "$260m",
            "$112m",
            "$106m",
            "$478m",
            "",
            "$29.1m",
            "$13.4m",
            "$20m",
            "$540.5m"
        ]
    ],
    "pageTitle": "III. Agency Overviews, Regional Program Assessments",
    "title": "",
    "url": "http://www.state.gov/p/eur/rls/rpt/23602.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 723988647,
    "recordOffset": 723873335,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{237289=The English Language Fellows Program is designed to provide universities, U.S.-Eurasian binational centers, teacher training colleges, Ministries of Education and other language-education institutions with American professional expertise in teaching English as a foreign language. The objective of this program is to promote the teaching of English while simultaneously providing broad access to information and diverse perspectives; facilitating democratic institution building; and encouraging participation in the global economy. Ten-month fellowships are given to senior-level English Language Fellows to conduct teacher training and development activities in areas such as teaching methodology, curriculum and text analysis, and/or English for specific purposes, and to junior-level English Language Fellows who are recent graduates of master's-degree teaching English as a foreign/second language (TEFL/TESL) programs to do classroom teaching. In FY 2002, English Language Fellows were placed in Azerbaijan, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Turkmenistan, Ukraine and Uzbekistan, with a focus on teaching English to help in the transition to a democratic and open society, in educational and economic restructuring, and in dealing with cross-cultural issues. In FY 2003, emergency supplemental funding will provide for the placement of additional fellows in the Kyrgyz Republic and Tajikistan. Similarly, the English Language Specialist/Speaker Program is designed to place professionally trained Americans in the field of TEFL/TESL or applied linguistics on short-term projects in curriculum design, material development, English for specific purposes, program evaluation, and teacher training., 527986=In Eurasia during FY 2002, Ex-Im Bank authorized a total of $192.3 million, covering insurance transactions, as well as medium and long-term guarantees and loans. This represented a decrease of 36% from FY 2001, where the aggregate total was $302.3 million. The breakdown for authorizations within Eurasia for FY 2002 was as follows: Russia - 60%; Uzbekistan - 38%; Kazakhstan - 1%; and Azerbaijan - 1%. In most cases the countries of the region have recovered from the financial crises of the late 1990's, although recent global economic woes have had a negative effect on both their recoveries and the total number of Ex-Im Bank authorizations in FY 2002. Nonetheless, demand for U.S. goods and services increased for most of the region., 754090=The CDR/CAR initiative has the following objectives: (1) to provide limited assistance to maintain the scientific communities in Central Asia and Georgia; (2) to provide financial and technical assistance for research directed toward basic needs of the people in the region; 3) to expose the Eurasian scientific community to the Western-style system of competitive institutional grants; (4) to utilize Israeli expertise and practical scientific methods, primarily in the management of science and technology in improving agriculture; (5) to establish multiple independent links between the people of this historically Muslim region and Israel; and (6) to link the formerly isolated scientific community of the region with the world scientific community. Since 1993, CDR/CAR has awarded over 80 research grants of up to $150,000, a figure that does not include the considerable matching funds provided by Israeli research institutions. Projects are chosen from proposals jointly authored by Israeli and target county scientists, and selections are made by USAID on the advice of peer review panels composed of U.S. scientists. The U.S. Government is visible as the donor, and American scientists are eligible to participate as funded third partners on the grants., 503291=The United States also contributed $2 million through the SME Fund at the EBRD to support small and micro lending programs in Georgia ($1.2 million) and the Kyrgyz Republic ($0.8 million). In Georgia, EBRD is working with two local banks as well as one dedicated microfinance bank (Microfinance Bank of Georgia) to provide loans to MSEs. U.S. funds are used to provide technical assistance to train loan officers, improve lending procedures and strengthen management in the partner banks. In 2002, over 10,000 loans to MSEs totaling $43.5 million were supported under the program. In the Kyrgyz Republic, EBRD began a new program to help local Kyrgyz banks develop their capacity to lend to MSEs. Four Kyrgyz banks are receiving technical assistance funded by the U.S. as well as loans from the EBRD. Because these banks are relatively weak and small, the U.S. also provided loan funds together with EBRD's loan funds., 170678=The Eurasian Professional Exchanges and Training Program administered by the ECA Bureau's Office of Citizen Exchanges is designed to encourage the growth of democratic institutions by enhancing institutional partnerships and offering practical information to individuals and groups. The exchanges and training programs supported by the program are conducted by U.S. NGOs and universities in partnership with Eurasian institutions. These programs not only expand and enhance partnerships between U.S. and Eurasian institutions, but also enable Eurasia citizens to develop knowledge and skills that advance their professional development. Program activities supported in FY 2002 included internships, study tours, training, consultations, and intensive, extended workshops. These components were conducted in both the United States and in the Eurasian countries. Many of the programs were designed to accommodate non-English speakers and take into account the need for ongoing information-sharing, training and plans for self-sustainability. Programs also provided support for the establishment of training centers, professional networks and associations, Internet communication, materials development and train-the-trainer programs. In FY 2002, the Office of Citizen Exchanges awarded approximately 16 grants to support international exchange programs for 144 Eurasian citizens and 62 U.S. citizens. These grants also touch the lives of several hundred individuals in regionally based training programs led by former participants after returning to their home countries., 533644=The U.S. Government-funded Enterprise Funds are designed to promote private-sector development, including small businesses, joint ventures and the agricultural sector, as well as to promote policies and practices conducive to private-sector development. The Funds are authorized to provide loans, grants and equity investments, and to support feasibility studies, technical assistance, training, insurance, guarantees and other mechanisms to achieve the above-mentioned objectives. The Enterprise Funds have provided venture capital and long-term financing in situations where financial markets are still evolving and the business environment remains fragile so that local banks and foreign investors continue to be reluctant to commit funds to small and medium-sized enterprises. The programs offered by the funds range from venture capital to lending for micro-enterprises. The Funds have also assisted enterprises by providing limited technical assistance and training. Private boards of directors set policy and oversee the management of the Funds, with almost complete independence from the U.S. Government. Some boards have performed extremely well, while others have had mixed results. The table below shows the basic financial status of the Enterprise Funds and other equity capital funds operating in the Eurasian region as of the end of FY 2002., 584681=Interoperability Programs: DoD funds also pay for a range of DoD Interoperability Programs, which are generally initiated by the Office of the Secretary of Defense and usually operate at the Ministry of Defense level. FY 2002 programs included:, 460304=IATP, which was established by the Bureau of Educational and Cultural Affairs (ECA) in 1995, sponsors public-access Internet facilities throughout Eurasia, and offers training in how to use the Internet, including how to create a website, how to design distance learning courses and databases, and how to conduct searches on the World Wide Web. Project Harmony administers IATP in Russia, and the International Research and Exchanges Board (IREX) administers IATP in Belarus, Moldova, Ukraine, Central Asia and the Caucasus. The main goals of IATP are to provide Internet access to alumni of U.S. Government-funded training and exchange programs and targeted members of the general public; to train alumni and other targeted audiences in the effective use of the Internet and the resources of the World Wide Web; to establish and maintain contact through the Internet between alumni of U.S. Government-funded training and exchange programs, their U.S. host institutions, their sponsoring organizations and the ECA Bureau; to sponsor and encourage the development of local-language websites, distance learning courses, message boards and online journals; and to develop and encourage practical and meaningful Internet-based activities for exchange program alumni, their colleagues and their communities. There are currently 221 IATP Internet facilities serving 110,000 registered users throughout Eurasia, with plans to open additional facilities in Central Asia and Russia., 643070=* Material removed to the United Kingdom for permanent storage in 1998 ** Sabotage protection only, 709166=Since its inception, the Foundation has raised or leveraged nearly $41 million in non-U.S. Government funds from foundations, foreign governments, corporations, and private citizens for its programs. The Foundation continues to expand its donor base, having raised and leveraged over $6 million from non-U.S. Government sources in FY 2002. Major donations in FY 2002 include $1 million from Yukos Oil Company for grant making in several Russian regions; $212,000 from the Volga Federal Administration of Russia for grant making in that region; $186,000 from the United Kingdom's Foreign and Commonwealth Office for public policy institute development in the South Caucasus; $800,000 from the World Bank for EERC; $300,000 from the Finland Ministry for Foreign Affairs for EERC; $300,000 from the Global Development Network for EERC; and $236,000 from the Swedish International Development Cooperation Agency for MVF., 102443=The Junior Faculty Development Program (JFDP), which is administered by the American Councils for International Education (ACTR/ACCELS), offers fellowships to university instructors from Armenia, Azerbaijan, Georgia, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Turkmenistan, Tajikistan, Ukraine and Uzbekistan. Fellows are selected through an open, merit-based competition and attend U.S. universities for one academic year to work with faculty mentors in order to develop new curricula and approaches to teaching in their fields of study. University instructors in the following fields of study may participate in the JFDP: American studies, arts management, architecture and urban planning, business administration, cultural anthropology, economics, education administration, environmental studies, history, journalism, law, library science, linguistics, literature, philosophy, political science, psychology, public administration, public policy, and sociology. Upon completion of the academic component of the program, JFDP Fellows participate in two-month practical internships at institutions and organizations across the United States. In FY 2002, there were a total of 100 JFDP participants from Eurasia., 430718=Democracy Funds Small Grants Awarded in FY 2002, 399148=The SABIT Program provides managers and scientists from Eurasia with training in U.S. entrepreneurial and management practices. Eurasian participants are placed with U.S. companies for hands-on training for periods of four weeks to six months. Since 1992, more than 2,800 managers and scientists have participated in the SABIT Program. SABIT also has facilitated hundreds of partnerships between U.S. and Eurasian businesses. In FY 2002, 316 managers and scientists from all 12 Eurasian countries participated in training programs, bringing the cumulative total of SABIT participants to 2,820. Over 500 U.S. companies donated technical and business training to SABIT participants in FY 2002. Region-wide highlights included the following:, 495011=The principal objectives of the SEC's technical assistance program for Eurasia under the FREEDOM Support Act (FSA) are to assist securities regulatory authorities and self-regulatory organizations in these countries with the development of transparent, well-regulated securities markets in which both domestic and foreign investors will have confidence. There are many issues relating to rule of law and other infrastructure, as well as macroeconomic conditions, beyond the control of the SEC and its Eurasian counterparts, which affect the realization of these objectives. Nevertheless, the SEC believes that its program objectives are being substantially achieved, specifically by providing U.S. and overseas training for senior personnel of the Eurasian regulatory and self-regulatory organizations, and providing specific technical assistance with respect to laws and regulations when requested to do so. During FY 2002, the SEC provided funding for training to 17 professionals from six Eurasian countries, bringing the cumulative total of participants trained since the inception of the Eurasian program in 1994 to approximately 337 from 13 countries across the region. Specific SEC activities included the following:, 654052=Since 1998, the United States and Russia have conducted studies and pilot-scale tests and demonstrations of a host of technologies needed to dispose of surplus weapon-grade plutonium. This work has assisted in confirming the viability of certain technologies that might be used for disposition of surplus Russian plutonium. For additional details, please see the Russia country assessment in Part II of this report., 444741=LEAP promotes free access to information in Ukraine and assists regional libraries transitioning to the modern world of information science. Under this program, the Public Affairs Section of the U.S. Embassy in Kiev has awarded a total of $900,000 in small grants to city and regional libraries across Ukraine to create public-access Internet centers. More than 40 centers were opened in FY 2002 in regional capitals and smaller cities. For additional information on this program, please see the Ukraine country assessment in Part II of this report., 599219=In FY 2002, the State Department received a $30 million transfer from the Department of Defense to establish a Bio-Industry Initiative to facilitate the redirection of former Soviet BW facilities to commercial production of vaccines and products to address infectious diseases and enhance public health. This effort is just beginning to get underway, but will be implemented through the Science Centers., 628472=In Europe and Eurasia, IMET is a key assistance program within the U.S. Government's regional strategy, which promotes English language training, military professionalism, interoperability of forces, and honing of peacekeeping units to operation in the global arena. Cooperation with coalition forces in the war on terrorism have made it clear that English language and other military training obtained through IMET is invaluable to the smooth cooperation of a greater number of countries. We will continue in out-years to engender military cooperation and security relationships in line with the demands of Operation Enduring Freedom and the war on terrorism. Many Eurasian countries require greater exposure to education, rule of law, civil-military control, and human rights, and the IMET program is one of our strongest tools for enhanced military cooperation. The great benefits of IMET for U.S. interests in Europe and Eurasia has led us to seek increases in IMET to most of our countries for FY 2003 and FY 2004. (See country assessments in Part II of this report.), 100175=The Edmund S. Muskie Ph.D. Fellowship Program supports outstanding citizens from Georgia, Russia and Ukraine for doctoral study in the United States in the fields of business administration, economics, public administration, and public policy. The Muskie Ph.D. Program is designed to allow future university professors, government officials, and leaders in the business and non-profit communities of the participating countries to receive a Ph.D. degree and return to their home countries to teach at the university level or otherwise contribute on an expert level in the public or private sector. The Muskie Ph.D. Program is administered on behalf of the ECA Bureau by the American Councils for International Education (ACTR/ACCELS). U.S. host universities provide waivers of tuition and fees averaging fifty percent. Current host universities include American University, Brandeis University, Florida State University, Georgetown University, Indiana University, John Jay School of Criminal Justice, Ohio State University, Purdue University, Rutgers University, Temple University, University of Delaware, University of Georgia, University of Kansas, University of Michigan, University of Pittsburgh. In FY 2002, a total of 17 fellowships were awarded, and nine fellows began their Ph.D. programs., 471827=In FY 2002, IIP sent a total of 36 Speakers/Specialists and PIRs to the Eurasian countries with FSA funding, and 56 Speakers/Specialists through IIP's own base appropriation. A country-by-country overview is provided below:, 736073=In FY 2002, 50% of SPA Grant-funded activities in Eurasia were in the area of education, 16% in environment, 14% in health and water sanitation, 6% in small and medium size enterprise development, 12% in youth activities and 2% supporting local NGOs and municipal development., 614376=The BTEP program plan for FY 2003 includes the following activities:, 59279=Since 1993, the U.S. Government has brought over 100,000 people, including over 10,350 in FY 2002 alone, from the Eurasian countries to the United States on training and exchange programs in fields ranging from management to social service provision to NGO development. These programs have proven to be our most effective tool in reaching out to the next generation of Eurasian leaders to give them first-hand experience with the day-to-day functioning of a market-based, democratic system., 528779=On January 25, 2002, Ex-Im Bank and the Black Sea Trade and Development Bank signed a Memorandum of Understanding to promote U.S. goods and services to the Black Sea region. Under the agreement, Ex-Im Bank's short-, medium- and long-term financing products can be used to support exports of U.S. goods and services to any country located in the region, which includes Russia, Ukraine, Moldova, Georgia, Romania, Bulgaria, Albania, Turkey, Greece, Armenia and Azerbaijan. The agreement will enable the Black Sea Trade and Development Bank to act as an obligor or guarantor on specific transactions and also provide for a parallel financing arrangement. For additional information, please see the country assessments in Part II of this report., 489770=BISNIS is a unique provider of market information and related support that fosters Eurasian economic development and U.S.-Eurasian commercial partnership. In FY 2002, BISNIS worked to strengthen U.S.-Eurasian commercial cooperation and entrepreneurship, particularly among small and medium enterprises, through: industry, country, and other practical market reporting; lead identification and distribution; counseling and referrals for both U.S. and Eurasian business people; roundtables, outreach and individual meetings; and collaboration with and support to a range of international financial institutions, U.S. and Eurasian governments, private organizations, and training groups. In FY 2002, BISNIS launched \"Expolink Eurasia,\" a Russian-language electronic listing of U.S. firms seeking partners in Eurasia. BISNIS also maintains a successful Russian-language website. Additional BISNIS activities in FY 2002 included mailing the BISNIS Bulletin to over 33,000 recipients each month, including more than 6,000 Eurasian recipients; providing frequent email updates to 13,000 clients, including 3,700 in Eurasia; publishing 208 U.S. export and 108 Eurasian partner leads; conducting direct outreach to U.S. companies in 33 U.S. cities, 50 Russian cities and dozens of other cities in Eurasia; and piloting videoconferencing and call-in consultations., 430197=FY 2002 marked the eighth year of this high-impact small-grants program, under which embassy-based Democracy Commissions in each Eurasian country award grants of up to $24,000 to indigenous non-governmental organizations (NGOs) or individuals in support of democracy-building activities, independent media, and the free flow of information. In FY 2002, the Democracy Funds Small-Grants Program awarded over 370 grants with a total value of approximately $3.5 million., 421406=Total 1993-2002, 261195=A breakdown of FY 2002 GTD and START participants by country and type and location of training is provided on the following page., 753088=The USAID-funded U.S.-Israel Cooperative Development Research (CDR) Program was established in 1985 to support joint applied research projects involving Israeli scientists and their counterparts in developing countries, allowing them to work on significant problems facing the developing countries. In 1992, a special initiative extended the program to Kazakhstan, the Kyrgyz Republic, Turkmenistan, Uzbekistan, and Georgia. This initiative focuses on research in arid lands agriculture -an area of Israeli strength and particular need in Central Asia- and includes projects in water management and environmental protection as well as agronomy and livestock management. Like the rest of the CDR Program, this initiative for the Central Asian Republics and Georgia (CDR/CAR) does not promote the economic development of Israel, but emphasizes areas in which Israeli research interests and expertise are particularly valuable to the target countries., 634182=The National Nuclear Security Administration, a semi-autonomous body within the Department of Energy, is responsible for the Department's numerous cooperative security-related assistance programs in Russia and the former Soviet states. These programs focus on a number of areas: securing nuclear materials; reducing stockpiles of nuclear materials, technology and expertise; accelerating the transition of facilities and workers from nuclear defense work to civilian purposes; and nuclear safety. The overarching goal of these programs is to reduce the threat of nuclear material falling into the wrong hands, especially given the September 11, 2001 terrorist attacks. The programs have evolved since their inception due to the changing environment in Russia and the former Soviet states and shifting U.S. policy priorities., 594424=In FY 2002, the Department of State obligated both regular and supplemental funds for: meetings, workshops, and seminars, licensing procedures and practices workshops; legal and regulatory training and other DOC-provided training; nuclear nonproliferation activities; detection and enforcement equipment and related training; maritime assistance, including mobile training teams; in-country program advisors; regional programs; and regional conferences., 647463=The mission of the IPP program is to provide meaningful, sustainable, non-weapons-related work for former Soviet weapons of mass destruction (WMD) scientists, engineers, and technicians in Eurasia through commercially viable market opportunities. The IPP program provides seed funds for the identification and maturation of technology, and facilitates interactions between U.S. industry and Eurasian institutes for developing industrial partnerships, joint ventures, and other mutually beneficial arrangements. Since 1994, the IPP program has funded over 700 projects involving more than 10,000 former Soviet weapons scientists at over 180 institutes. Total funding for FY 2002 was budgeted at $36 million, bringing funding since 1994 to $275 million., 571953=During a July 1994 visit to Warsaw, President Clinton announced that he would request $100 million from the U.S. Congress to \"help America's new democratic partners work with us to advance the Partnership for Peace's goals.\" The U.S. Government's Warsaw Initiative was intended to jump-start Partnership for Peace (PFP) participation with an infusion of readily available funds. The Departments of Defense and State continue to provide assistance under the Warsaw Initiative to facilitate partner-country participation in PFP exercises, conferences, seminars and other events and to enable partners to procure equipment and training to enhance the interoperability of their armed forces with those of NATO., 549388=DOE/NNSA is working to improve the safety of Soviet-designed nuclear power plants and research reactors through bilateral and multilateral cooperative activities in Russia, Ukraine, Armenia, and Kazakhstan. Program activities help prevent nuclear incidents and accidents by upgrading equipment, improving safety-related practices, and strengthening nuclear safety infrastructure. Activities are coordinated with government agencies and conducted with personnel from nuclear power plants and scientific and technical institutes. In FY 2002, program efforts addressed several significant safety issues at Soviet-designed reactor facilities and with overall nuclear infrastructure., 258715=During FY 2002, GTD and START in Eurasia trained 14,050 participants: 647 from Russia; 10,001 from Central Asia, 1,259 from Western Eurasia; and 2,143 from the Caucasus. Of these individuals, 51 percent were female. Approximately 82 percent (11,610 participants) were trained in-country, 8.5 percent in a third country, and nine percent in the United States. Grouped by USAID Strategic Assistance Area (SAA), some 44 percent received training in economic restructuring; 33 percent in democratic transition; 19 percent in social stabilization; and four percent in special initiatives and cross-cutting activities. From March 1993 through September 2002, USAID's regional training projects have trained nearly 80,000 individuals from the Eurasian countries, including some 21,000 who were trained in the United States. The achievements of former GTD and START participants contributed to economic, democratic, and social advances in their respective countries during FY 2002. Training prepared them to identify areas that needed to be addressed and provided them with the skills and resources to implement creative mechanisms to bring about sustainable change. The following results illustrate the benefits gained from the professional relationships established with colleagues either in the United States or in third countries through GTD and START regional training programs (for country-specific program information, please see the Armenia, Russia and Ukraine country assessments in Part II of this report):, 725495=As has been the case in prior years, the greatest number of SPA-funded activities in FY 2002 were in the area of education, particularly with respect to assisting community schools enhance their educational resource centers and upgrade libraries and language learning laboratories to include computer technology and other audio-visual equipment. While SPA funds are available to assist communities in acquiring computers and software, the community matching funds provide the resources for Internet access and related recurring operational costs. SPA resources also strengthened educational opportunities by supporting enhancement of teacher training skills, as well as the construction and renovation of school buildings, classrooms and community resource centers. With SPA support, community and school groups organized youth camps focusing on leadership, environmental awareness, and English-language immersion., 119951=The Civic Education Project (CEP) is a private voluntary international educational organization founded in 1991 to assist democratic reform by cooperating with educational reform efforts at universities and other institutions of higher education in Central and Eastern Europe and the Eurasian countries. CEP works in close cooperation with Central European University and Yale University. CEP receives a grant from the ECA Bureau to sponsor U.S. Visiting Faculty Fellows to teach for at least one academic year in the social science departments of Armenian and Azerbaijani universities. Through interactive teaching methods, curriculum reform efforts, library improvements, research partnerships and student conferences, Visiting Faculty Fellows aid in the development and improvement of university faculties in which they teach. Four CEP fellows were resident in Armenia in FY 2002: two at Yerevan State University, one at Briusov Linguistic University and one at Acharyan University., 535053=Financial Status of U.S. Government-Backed Funds as of September 30, 2002, 594931=Current planning for FY 2003 includes an estimated $38.6 million in total FSA and NADR funding for EXBS activities, including an estimated $17 million for Georgia (see country assessment section in Part II of this report)., 446644=Rapid-Response Emergency Fund: In FY 2002, DRL initiated a Eurasia-wide project designed to offer bridge support to embattled human rights and democracy activists. The Rapid-Response Emergency Fund provides direct support in the form of small, one-time emergency grants to human rights activists, NGOs, and independent journalists in Eurasia who are being harassed by their governments. It also provides support to lawyers who are working on human rights cases. The main objective of this program is to keep human rights and democracy activists functioning within their own countries in their hometowns, without having to resort to the extreme measure of fleeing abroad. HRDF support enables activists to obtain legal assistance and overcome the temporary loss of resources due to excessive government fines or job loss., 172301=Thematic priorities for FY 2002 included media internships, training for press spokespersons, tourism and economic development, public health, civil rights, library development, and youth issues. In FY 2003, the Office of Citizen Exchanges will support single-country projects focusing on media training for journalists and media managers in Armenia, Kazakhstan, Russia and Uzbekistan; prevention of trafficking in persons in Armenia, Azerbaijan, Belarus, Georgia, the Kyrgyz Republic and Tajikistan; tolerance in Georgia and Russia; intellectual property rights in Russia; professional association building for political scientists and economists in Ukraine; religion in a democracy in Kazakhstan; business development in Turkmenistan; community and local government relations in Armenia; public health awareness in Armenia; and training in NGO law making in Turkmenistan. Project implementers will be selected through an open competition announced in the Federal Register., 487924=In FY 2002, ABA/CEELI's RIBAs and in-country institution-building advisors (IBAs) continued to provide comprehensive organizational development assistance to legal reform NGOs. The RIBA Program in Eurasia has expanded to include in-country IBAs in eight countries: Armenia, Belarus, Georgia, Kazakhstan, the Kyrgyz Republic, Moldova, Ukraine and Uzbekistan. All IBAs have been provided advanced training in assessment and consulting methodology. ABA/CEELI is now offering assessments and a wide range of institution-building services in Central Asia. Five partner organizations in Central Asia have been through the first-round assessment workshop, which leads to the creation of one- to two-year organizational development plans. In countries where the RIBA program is more established, IBAs have developed a new second-round assessment tool that is designed to help facilitate the process of institutionalizing regular organizational self-assessment within more advanced partner organizations. Seven local partners have completed the second-round assessments, and four more assessments are planned. The IBA in Ukraine has also developed an assessment tool and sustainability index for student legal clinics. A total of 16 legal clinics in Ukraine have participated in assessments and sustainability training, and consultations have been provided based on the results of the assessments. For additional information on these activities, please see the individual country assessments in Part II of this report., 664253=In FY 2002, USAID's Europe and Eurasia Bureau sponsored a major international conference in Washington, D.C., to review ten years of health systems transition in Central and Eastern Europe and Eurasia. Over 700 participants from 37 countries attended. The exchange of \"lessons learned\" provided new insights and challenges to each participant country and emphasized the importance of continued investments in improved primary health care. Conference theme papers and findings are being documented in a report that will be available online at the conference's website http://www.eurasiahealthtransitionconference.org/home.htm., 583488=SORBET ROYALE 02 was held on May 20-31, 2002 at Fredickshaven, Denmark. The exercise is a LIVEX designed to examine submarine escape and rescue procedures. The exercise's objectives are designed to foster and demonstrate submarine rescue techniques and to provide experience and training for all involved. Russia, Ukraine, and Sweden participated., 526433=In FY 2002, the U.S. Department of Labor (DOL) continued implementing its DOL-funded Worker Adjustment / Labor Market Transition project in Ukraine, began a new labor-management mediation project in Kazakhstan, and began implementing its FY 2001-funded anti-trafficking regional project. These projects strive to improve the skills of their respective targeted workforces, and to improve workplace relations and workplace conditions. Public awareness and outreach are also significant components. The projects in Kazakhstan and the regional anti-trafficking activities will report on project indicators and results in FY 2003., 661872=Hospital-acquired infections are among the most common adverse outcomes of hospitalization in the Eurasian countries. Basic infection control, such as proper hand washing and safe removal of waste, help prevent the transmission of communicable and infectious diseases between patients and healthcare workers, and is an important focus of hospital and primary care reform. Infection control programs reduce patient mortality and morbidity and decrease hospital costs. As part of a region-wide initiative, AIHA has cooperated with Ministries of Health in Georgia, Kazakhstan, Russia, and Ukraine to assist in the development of national infection control programs. Through FY 2002, 1,936 medical professionals had received continuing education in modern infection control practices. Over 50 instructors in those countries are conducting monthly training for physicians, chief nurses, epidemiologists and microbiologists. Also in 2002, the program initiated a multi-country study of urinary tract infections during pregnancy to determine the severity of drug resistance and provided assistance to the Russian Ministry of Health to revise the Russian infection control policy. Such a revision could significantly improve public health practices in Russia and other Eurasian countries., 759419=In FY 2002, the U.S. Government contributed $1 million in PKO funds to support Ukraine's participation in KFOR peacekeeping operations in Kosovo., 401199=In addition, the SABIT Program sponsored approximately 27 alumni events in FY 2002. These activities included follow-on training, conferences and seminars in cities throughout Eurasia. One of the highlights of the year was a three-day conference held in Dubna, Russia, that brought together area health professionals. The conference was co-sponsored with the Open World Program, and organized by SABIT alumni., 602473=In FY 2002, funded under the State Department FSA account at an estimated $5 million, ARS collaboration with institutes in Russia, Kazakhstan, and Uzbekistan continued to grow, presenting an opportunity to engage increasing numbers of former BW institutes and scientists in agricultural research. With FY 2002 assistance, total program funding since 1998 reached $32.6 million. The key feature of this program is substantial contact between ARS and Eurasian scientists to optimize the collaboration at the scientist level and share success between U.S. and Eurasian laboratories. Proposals between ARS and Eurasian scientists are developed collaboratively as a result of visits to the United States by the Eurasian scientists involved. In FY 2002, 55 Russian, Kazakhstani, Uzbek scientists traveled to the United States to meet with ARS counterparts to develop project proposals or work on existing projects. In addition, 22 ARS scientists or representatives traveled to Russia and Kazakhstan under on-going projects or as part of ARS team visits. Forty-six approved ARS-Eurasian projects (20 approved in FY 2002) involve approximately 900 Eurasian scientists, half of whom are former BW scientists, in the areas of plant and animal health and natural resources. Twenty-four of those 46 projects are funded (11 funded in FY 2002). All projects selected for collaboration meet the nonproliferation goals of U.S. foreign policy as well as enhance the ARS National Research Program., 681615=FY 2002 was marked by ongoing violence in Chechnya and increased pressure by authorities for IDPs in Ingushetiya to return to Chechnya. Almost 3,000 IDPs have returned involuntarily., 524840=The EMP Program funds technical assistance projects that increase U.S. agricultural exports to emerging markets around the world. EMP funds proposals from organizations such as U.S. trade associations, universities, state departments of agriculture, and U.S. government agencies. In FY 2002, EMP provided a total of almost $1.06 million in funding to the National Agricultural Statistics Service (NASS), USDA's Cochran Fellowship Program, and various U.S. agricultural trade associations and groups for projects involving Kazakhstan, Russia and Uzbekistan. For example, EMP provided $300,000 for continued USDA technical assistance and training to improve the capability of Russia's State Committee on Statistics (GosKomStat) and Kazakhstan's National Statistical Agency to furnish timely, adequate, and relevant statistical data on agriculture. EMP also supported market research, training programs, and regulatory reform efforts in Kazakhstan, Uzbekistan and Russia. In addition, EMP funding to the Cochran Fellowship Program, which provides business and government officials with important skills needed to further market reform, supported the training of approximately 50 Russian officials in the areas of agricultural policy and market access., 679790=The Bureau of Population, Refugees and Migration (PRM) has primary responsibility for formulating U.S. policy on population, refugees, and migration, and for administering U.S. refugee assistance and admissions programs. In FY 2002, PRM provided over $37 million to assist refugees, internally displaced persons (IDPs), and migrant groups affected by continuing crises in Eurasian countries., 681127=PRM contributed more than 25% to UNHCR's and ICRC's programs in Central Asia. The repatriation and reintegration of Tajik refugees from the Tajik civil war through targeted integration projects continues to be a priority. Other populations of concern are Afghan refugees (including those displaced before September 11, 2001), Chechens, and Uighurs from China., 582638=COOPERATIVE ZENITH 02 was held on September 5-13, 2002 at Valdosota, Georgia and the United Kingdom. The exercise provides training in Maritime Air Search and Rescue (SAR) using NATO procedures and focuses on the practice of SAR planning and execution with a field demonstration. Bulgaria, Estonia, the Former Yugoslav Republic of Macedonia, Georgia, Latvia, Lithuania, Romania, Slovakia, Sweden, Ukraine, and Uzbekistan participated., 57038=Since 1998, the Organization for Economic Cooperation and Development (OECD) has operated the Anti-Corruption Network for Transition Economies, which links international donors, key government officials, and civil society representatives in a forum to exchange information about anti-corruption policies and best practices. Building on existing regional initiatives, the Network coordinates efforts, shares information, and promotes international instruments and best practices as benchmarks, and supports a website: www.anticorruptionnet.org., 560595=Through bilateral military exchanges, the U.S. Government seeks to promote demilitarization (e.g., military reform and restructuring, transparency, regional confidence building, etc.) and counterproliferation efforts, and to help NIS countries improve their border controls as a means of safeguarding material and technology related to weapons of mass destruction. The Defense and Military Contacts program has grown from initial familiarization exchanges among senior officials to an ever-expanding set of substantive exchanges between counterparts at all levels of government - from enlisted personnel, to field grade and flag officers, to ministers of defense. The sheer number of annual contacts continues to increase over time, from the low tens in the early CTR years, to almost 350 contact events for FY2002. These increased bilateral contacts have resulted in strengthened channels of communication with NIS militaries and have facilitated the start of their transition to western military models., 646745=The DOE/NNSA Warhead and Fissile Material Transparency Program promotes transparent nuclear reductions by working with the Russian Federation to negotiate legally binding agreements and transparency options to allow confirmation of Russian nuclear weapons reductions and that excess fissile materials are not used in production of new nuclear weapons. In FY 2002, the Warhead and Fissile Material Transparency Program funded $5 million in projects related to Russia For additional details, please see the Russia country assessment in Part II of this report., 652932=DOE is working to improve the safety of Russia's and Ukraine's nuclear power plants to reduce the chance of an accident. In FY 2002, substantial operational and technical improvements were made. For details, please see the Russia and Ukraine country assessments in Part II of this report., 659726=By the end of FY 2002, more than 15,000 medical personnel had received training in neonatal resuscitation techniques, based on the guidelines of the American Academy of Pediatrics. This training took place at 16 neonatal resuscitation training centers (NRTCs) in six Eurasian countries supported by USAID's Health Partnerships Program: Armenia, Azerbaijan, Georgia, Russia, Ukraine, and Uzbekistan. A recent study analyzing almost 8,300 births from 13 NRTCs found that 30 percent of newborns in the study needed some resuscitation. Compared to those born at institutions where fewer personnel had been trained, infants born at institutions where more than 25 percent of personnel were trained had better health scores at five minutes after birth, fewer central nervous system problems at the age of seven days, and lower incidence of asphyxia and respiratory distress syndrome., 713668=The South Caucasus Cooperation Project (SCCP): The SCCP was established in 1998 to facilitate greater contact and cooperation among leading organizations in Armenia, Azerbaijan, and Georgia. Implemented by staff in all three countries, SCCP has provided a forum for grantees to come together to explore cross-border initiatives that address issues of concern across the entire region. SCCP grants are awarded exclusively to projects that incorporate all three countries of the South Caucasus, with grants made to organizations in each country simultaneously. SCCP grant making in FY 2002 included support for development of and cooperation between nascent public policy institutes and facilitation of cross-border public dialogue through independent media bridges. In FY 2002, SCCP awarded 68 grants totaling over $1 million to fund 24 regional projects of Armenian, Azeri, and Georgian NGOs. Since the program's inception, it has funded 284 grants (102 cooperative projects) totaling nearly $3 million., 630493=In FY 2002, the U.S. Government contributed $1 million in PKO funds to support Ukraine's participation in KFOR peacekeeping operations in Kosovo. PKO funds were also used to support the Georgia Border Monitoring mission which provides key independent assessments of the situation along the Georgian-Chechen border and underline the international community's support for Georgian independence and territorial integrity. The U.S. Government contributed $1.4 million in PKO funds toward this effort., 81972=The ECA Bureau's FSA Undergraduate Exchange Program provides grants to Eurasian citizens for one year of non-degree undergraduate study in the United States in a number of areas, including agricultural and environmental management, American studies, business, computer science, economics, education methodology, journalism/mass communications, political science, and sociology. Second-year students receive scholarships to study at community colleges, while third- and fourth-year students compete for scholarships at four-year colleges and universities. Academic studies are enhanced through community service activities, practical internships, and a mid-year workshop. In addition to one year of non-degree course work, FSA Undergraduate students give back to their communities through their volunteer efforts. This year students have helped build houses for the poor with Habitat for Humanity; delivered mail and newspapers to patients at St. Luke's Healthcare Center in Utica, New York; volunteered at the American Diabetes Association Marathon in Norfolk, Virginia; and taught business courses for the Mississippi Small Business Development Center. In FY 2002, the program funded 293 participants. The FSA Undergraduate Exchange Program is administered by the International Research and Exchanges Board (IREX). FSA Undergraduate Exchange Program participants are studying at 115 universities and community colleges in 39 states., 158455=The ECA Bureau's base-funded IV Program gives participants from the Eurasian countries an opportunity to familiarize themselves with American society, government and culture; study U.S. approaches to their professional fields; and establish professional contacts with their U.S. counterparts. IV Program participants are nominated by U.S. embassies and come to the United States for approximately three weeks to meet with experts in their fields in Washington, D.C., and various cities around the country. The FSA Grant Program, the FSA-funded counterpart of the IV Program, brings mid- to senior-level regional and local government officials and key professionals in selected fields to the United States to meet with their professional counterparts and examine issues related to democratic and economic reform. Program participants are also nominated by U.S. embassies. They spend several days meeting and developing working relationships with experts in their professional fields in Washington, D.C., and throughout the United States. Participants develop working relationships with their U.S. counterparts, from whom they can gather information on an ongoing basis. The programs, which are typically two to three weeks in length, have included government officials, members of federal and local legislatures, leading economists, journalists and government spokespersons, regional leaders, judges and prosecutors, and representatives of NGOs. Topics addressed in FY 2002 included elections, the U.S. system of government and politics, intergovernmental relations, foreign-policy decision-making, economic development and regional investment, entrepreneurship, small-business development, HIV/AIDS, rights of the disabled, religious freedom, immigration and consular issues, judicial reform, and journalism., 504476=The FTF Program has been renamed the John Ogonowski Farmer-to-Farmer Program to honor the pilot on American Airlines Flight 11 that crashed into the World Trade Center in New York City on September 11, 2001. USAID's congressionally mandated Farmer-to-Farmer (FTF) Program is funded through the Farm Bill, with P.L. 480 funds transferred to USAID for program implementation. The Eurasian component of the Program operates in all 12 countries of Eurasia. FTF provides short-term agricultural technical assistance through U.S. volunteers to facilitate the transition to a free-market economy. The FTF program focuses on agribusiness development, including production, credit, processing, marketing, development of associations and cooperatives and agricultural/business training. FTF is implemented by a consortium of private voluntary organizations and cooperative development organizations including ACDI/VOCA, the Citizens' Network for Foreign Affairs, Land O'Lakes, Winrock International and Mercy Corps International. In many Eurasian countries, FTF collaborates with other USAID and USDA grantees and the Peace Corps. In Eurasia, the FTF Program seeks to increase sustainability of private agribusiness through improved technologies and business management practices; help farmers' associations and cooperatives, and business support organizations achieve sustainable service delivery and advocacy; strengthen rural finance systems to provide credit and other services to agricultural enterprises; develop and disseminate best practices for volunteer technical assistance; and improve environmental and natural resource management., 156701=The ECA Bureau supports a network of 70 educational information centers throughout Eurasia, which promotes the participation of Eurasian students and scholars in U.S. academic programs. The ECA Bureau provides books, materials, equipment, and training to all of these centers, 15 of which also receive direct financial support through cooperative agreements with American Councils for International Education (ACTR/ACCELS), the International Research and Exchanges Board (IREX), and the Open Society Institute. The centers provide students with services including group and individual advising on U.S. educational opportunities, pre-departure orientations, lectures on special-interest topics, educational fairs, alumni activities, and computer-based testing. The centers, which are open to the general public, also provide information about a wide range of U.S. Government-sponsored exchange programs. In FY 2002, the ECA Bureau sponsored a special training conference in Almaty for advisers from throughout Central Asia, which focused on promoting U.S. education to a broad audience, as well as providing the latest information on visa issues, testing requirements, and pre-departure information. IIE's publication Open Doors reports increases of over 25 percent in the numbers of students studying in the United States from the Kyrgyz Republic, Tajikistan and Azerbaijan, and more modest increases in students from Armenia, Belarus, Moldova and Ukraine., 551503=EPA activities in Eurasia during FY 2002 continued to emphasize three primary objectives to meet ongoing environmental needs: (1) improving environmental quality and addressing public health problems, (2) introducing environmental programs that also contribute to economic growth, and (3) promoting civil society and furthering democratic principles in environmental decision-making. All EPA activities balance short-term, tangible results with long-term capacity building designed to help Eurasian institutions resolve their own environmental problems. Specific program areas include:, 653394=DOE/NNSA negotiates and implements transparency measures under the U.S./Russia HEU Purchase Agreement. Under the Agreement, 500 metric tons of weapons grade HEU is to be blended down to reactor grade uranium and sent to the United States for use as fuel for nuclear reactors. Through December 2002, 171 metric tons of HEU have been processed, equivalent to the destruction of about 6,850 Russian nuclear weapons. For details, please see the Russia country assessment in Part II of this report., 55429=In FY 2002, as in previous years, the overwhelming majority of USAID-funded assistance activities were conducted bilaterally, and are described in the 12 country assessments in Part II of this report. However, some activities were conducted across two or more Eurasian countries. USAID's regional programs promote regional stability in Eurasia, a region critical to U.S. national interests and the war on terrorism. In FY 2002, the development challenge in Eurasia remained one of supporting and sustaining the transition of formerly authoritarian, centrally planned societies towards participatory democracies with strong market-based economies. Policy reform, institutional development, and broad-based citizen participation are central goals of USAID's regional programs., 759992=Other uses of PKO funds in Eurasia during FY 2002 are outlined below:, 621421=Institution Building: The CRDF continued its efforts to establish and support independent non-governmental science funding organizations in Armenia, Georgia, Moldova, and Azerbaijan. From January 8-20, 2002, the CRDF gathered representatives of these organizations for a 12-day workshop in Virginia with seminars on program management, proposal review, delivering proposal-writing workshops, financial accounting, and export controls. Participants found the workshop provided an opportunity to identify and discuss common goals and problems. An additional benefit was the Azerbaijani, Armenian, and Georgian representatives agreed, contingent on funding, to organize a regional workshop on a scientific topic of common interest. They have tentatively chosen the study of the Arak River as the workshop topic. Also in FY 2002, CRDF and its counterpart organizations in Armenia and Georgia announced new awards for bilateral cooperation and the Moldovan Research and Development Association and CRDF announced five grants to young Moldovan scientists to conduct three months of research at U.S. universities. In Azerbaijan, CRDF initiated an administrative award to staff, train and equip the newly established Azerbaijan National Science Foundation., 403189=The Cochran Program developed several regional training activities in FY 2002. Examples of regional courses included agricultural credit (for participants from Armenia and Georgia), cooperative development (Azerbaijan, the Kyrgyz Republic, Tajikistan, Turkmenistan and Uzbekistan), and fruit and vegetable processing (Azerbaijan, the Kyrgyz Republic, Tajikistan, Turkmenistan and Uzbekistan). These programs dealt with agricultural issues common to all of the participating countries and will thus help develop regional cooperation as well as increased technical skills., 658634=In FY 2002, USAID contributed $2.5 million in FREEDOM Support Act funds to the Global Fund to Fight AIDS, Tuberculosis, and Malaria. The Global Fund was established in January 2002 as a financial instrument to complement existing donor programs addressing HIV/AIDS, tuberculosis and malaria worldwide. The purpose of the Global Fund is to attract, manage and disburse additional resources through public-private partnerships. This contribution to the fund supports the President's initiative and will be used to make a sustainable and significant impact on the reduction of infections, illness and death. Several countries in the region have already applied for funding, and have been awarded first-year grants to begin implementation of comprehensive responses. Moldova has received a grant for almost $1.74 million, and Ukraine for just over $9 million. In addition, a proposal from Tajikistan was being considered for a grant of over $620,000., 491988=Throughout FY 2002, CLDP assisted the governments of Russia, Ukraine, and Moldova to improve the legal, commercial, and regulatory environment for doing business. In Russia and Ukraine, the focus of the program was on accession to the World Trade Organization (WTO), a process requiring each country to bring its laws, regulations, and procedures into compliance with WTO requirements and international norms. In addition to assisting with the formulation of WTO compliant legislative framework, CLDP's activities facilitate the development of negotiation and other skills inherent in the formation and implementation of effective trade policies. In Moldova, which became a member of the WTO in 2001, the program emphasized the implementation of WTO obligations that are required of following accession. By adopting and implementing the wide-ranging reforms required for WTO membership, the economies of Russia, Ukraine, and Moldova are becoming more transparent and business friendly to new domestic and foreign commercial opportunities. For additional information, please see the country assessments in Part II of this report., 438128=Since FY 1995, over 1,650 grants have been awarded among the participating countries, including 142 in Armenia; 96 in Azerbaijan; 397 in Belarus; 114 in Georgia; 81 in Kazakhstan; 105 in the Kyrgyz Republic; 199 in Moldova; 137 in Russia; 41 in Tajikistan; 56 in Turkmenistan; 174 in Ukraine; and 123 in Uzbekistan., 598594=With greater emphasis being placed on promoting self-sustainability of former WMD scientists and institutes, Department of State resources increasingly will be directed to funding projects and activities with clear commercial potential. Anticipated changes in FY 2003 that will affect U.S. funding are the expected accession of Azerbaijan, Tajikistan, and possibly Moldova to the Science Centers, with a concomitant increase in the numbers of research proposals submitted to the Department of State for evaluation and funding. FY 2003 funding is estimated at $32 million., 635497=In addition to activities in Russia, DOE's Nuclear Material Security and Safeguards Program seeks to reduce the risk of theft and diversion of nuclear materials and the sabotage of nuclear facilities in other Eurasian countries by assuring that facilities meet International Atomic Energy Agency (IAEA) guidelines and to assure that, with limited technical assistance from the United States, these facilities will meet IAEA guidelines as the U.S. transitions operational and financial responsibility to the recipient states. The amount of weapons-usable nuclear material secured to date is approximately 3.6 metric tons of highly-enriched uranium and plutonium. In June 1999, the IAEA revised its recommendations for physical security of nuclear material and nuclear facilities. The most dramatic change was the addition of a chapter with specific recommendations related to the sabotage of nuclear material or facilities. Since physical security upgrades were completed in the Eurasian region prior to this revision, the present program is now reviewing the physical security systems at all nuclear material sites within the region to determine what additional upgrades will be needed to meet the revised guidelines. Once identified, any deficiencies will be corrected., 657023=In FY 2002, OPDAT's technical assistance and training to prosecutors, other law enforcement officials, and criminal justice organizations focused on the development of sustainable skills and institutions that enable participating countries to more effectively combat complex and transnational crime. OPDAT hosted five regional seminars at ILEA Budapest led by U.S., European and East European / Eurasian experts in the following areas: criminal procedure, reform of the prosecutor's office, anti-corruption commissions, public corruption investigations, and prosecutions, and organized crime investigations and prosecutions. These programs highlighted best practices, promoted regional communication and cooperation, and allowed participating countries to compare experiences moving from Soviet to post-Soviet legal systems. In FY 2002, OPDAT continued to fund ABA/CEELI's Anti-Corruption Strategy Coordinator. The Coordinator worked to develop CEELI's anti-corruption priorities and supported the development and introduction of resources, such as concept papers, briefings, training sessions, and CD-ROMs, that enhance the efforts of local counterparts to address corruption., 583126=STRONG RESOLVE 02 was held on March 1-15, 2002 at Szczecin, Poland and Norway. The exercise is designed to exercise NATO's ability to cope with multiple, simultaneous crisis in separate geographic regions. Bulgaria, Estonia, Latvia, Lithuania, Romania, Slovakia, Sweden, Ukraine, and Uzbekistan participated., 581136=COOPERATIVE NUGGET 02 was held on January 17-28, 2002 in Portugal and Sweden. The exercise develops interoperability through practice of combined peacekeeping and humanitarian assistance relief tactics, techniques, and communications procedures at the staff level. Exercise focuses on command, control, and logistics support of a combined peacekeeping force, coordination with NGOs, and civilian military cooperation. Albania, Austria, Azerbaijan, Bulgaria, Estonia, the Former Yugoslav Republic of Macedonia, Ireland, Latvia, Lithuania, Romania, Slovakia, Sweden, Ukraine, and Uzbekistan participated., 133247=The ECA Bureau's Office of Global Educational Programs administers specialized curriculum development and training projects that emphasize civic education and elementary and middle school curriculum development, in collaboration with local partners throughout Eurasia and Eastern Europe. These projects are designed to equip the successor generations in the regions with the skills necessary to contribute as citizens to the development of civil society and the democratic governance of their countries. FY 2002 funding is providing opportunities for 23 U.S. and 31 Eurasian citizens to participate in exchange activities under these civic education grants, with an additional 3,295 educators taking part in the training components conducted in the Eurasian countries., 532357=In the eleven years since the program has been active, USTDA has funded studies on hundreds of major infrastructure and industrial projects. These projects represent $42 billion in export opportunities for U.S., and the export of U.S. goods and services stemming from these projects already totals $914,027,961. In FY 2002, program funds obligated for Eurasia totaled $4,686,233 from transfer funds and $4,557,039 from TDA's core budget, for a total of $9,243,272. USTDA also sponsored a conference on tourism infrastructure, which highlighted key projects in the Eurasia region., 616177=The U.S. Civilian Research and Development Foundation for the Independent States of the Former Soviet Union (CRDF) is a public-private partnership that promotes scientific and technical collaboration between the United States and countries of Eurasia through grants, technical resources, and training. The CRDF funds collaboration on civilian basic and applied research conducted to redirect efforts of former weapons scientists toward peaceful purposes and promote the development of market economies in Eurasia. The CRDF was authorized by the U.S. Congress and established by the National Science Foundation in 1995 with an initial $5 million from the Defense Department's Cooperative Threat Reduction (CTR) Program, matched by a $5 million grant from the Soros Foundation. In FY 1996, funding for CRDF's activities shifted to the U.S. Department of State under the FREEDOM Support Act (FSA). From FY 1995 to FY 2002, the CRDF received more than $81 million for its activities, of which FSA funding has accounted for $49.99 million. CRDF programs have also attracted funds from the Eurasia ($9.7 million) and American industry (approximately $9.38 million). In FY 2002, with an estimated $14 million from the FSA, the CRDF activated almost 300 new awards to research teams or individual Eurasian scientists. Funds received by the CRDF are committed to the following programs: Cooperative Grants, Building Collaborations, Next Steps to the Market, Regional Experimental Support Centers (RESC), Institution Building; and Non-Proliferation Initiatives, and contract support. Highlights are in the individual country descriptions in Part II of this report., 649194=The program includes participation of ten U.S. National Laboratories and the DOE Kansas City Plant. The National Laboratories provide critical oversight and accountability of the work being performed by the institutes in Russia, Ukraine and Kazakhstan. Payment for work at those institutes is made only after certification by the national laboratory principal investigator that the work is contemporary and within the scope of the agreement. The National Laboratories also provide technical direction, project management, intellectual property management assistance, and engagement of U.S. industry partners through the Cooperative Research and Development Agreement mechanism. The IPP program funded 20 new industry cost-shared projects in FY 2002 and provided continuation funding for 10 more. The United States Industry Coalition, which is the membership organization for U.S. companies involved in IPP project work, increased its membership by one-third, bringing the total to 146 companies and universities. On average, U.S. companies have contributed $1.4 dollars for every $1 the IPP program allocates., 683588=The Humanitarian Programs Division of the Office of the Coordinator of U.S. Assistance to Europe and Eurasia (EUR/ACE) is responsible for coordinating and facilitating the provision of emergency and transitional humanitarian assistance to the Eurasian countries. This includes the coordination of U.S. Government humanitarian assistance efforts with other donor countries and several international organizations. In the wake of the September 11, 2001 terrorist attacks EUR/ACE shifted its priorities toward Central Asia in order to assist in the effort to combat international terrorism by supporting new allies in the region. This shift was manifested in new grants for PVOs working in Uzbekistan and Tajikistan as well as the continuation of a grant for work in the Kyrgyz Republic. The $53 million hospital upgrade project in Uzbekistan was a good opportunity to showcase U.S. commitment to support states willing to help in the fight against international terror. In FY 2002, under Operation Provide Hope, EUR/ACE obligated $22.4 million to leverage and facilitate the delivery of over $280 million in privately donated and U.S. Department of Defense (DoD) excess humanitarian commodities to targeted groups in greatest need in Eurasian countries. Working closely with numerous U.S. private voluntary organizations (PVOs), contracted freight forwarders, and various U.S. Government agencies, the Coordinator's Office also funded several emergency and transitional humanitarian programs. FY 2002 program highlights include the following:, 206055=Under the FLEX Program, students from all 12 Eurasian countries live with U.S. host families and attend U.S. high schools for one academic year. FLEX participants are placed in all 50 states and take part in local civic education and community service activities. In FY 2002, 1,268 participants were selected. In February, a group of 120 FLEX essay contest winners took part in a week-long civic education workshop in Washington, D.C., organized by the Close-Up Foundation. The FLEX Program generated an estimated $10.8 million in cost-sharing and in-kind contributions in FY 2002, mostly by host families and schools. FLEX students performed more than 20,000 hours of community service during the 2001-02 school year, and after returning to their home countries, their community service focus was encouraged through special training and alumni follow-on activities. These included a FLEX Alumni Grants Competition for which 90 proposals were submitted and 28 grants awarded to alumni from 11 Eurasian countries for projects on civic education, professional development, and community service. In addition, 32 specially selected FLEX students participated in a workshop designed to teach them to become computer teachers and conduct community-based Internet training activities upon returning to their home countries., 543748=U.S. Department of Defense (DoD) - Cooperative Threat Reduction / Defense Enterprise Fund: In FY 1995, the U.S. Defense Department's Cooperative Threat Reduction (CTR) Program shifted the focus of its defense conversion efforts from the direct creation of joint ventures to support for joint projects though the Defense Enterprise Fund (DEF). The U.S. Congress established the DEF to assist Russia, Ukraine, Kazakhstan and Belarus in privatizing their defense industries and converting their military technologies and capabilities to civilian activities. In practice, the DEF provides loans and grants and makes equity investments in joint defense conversion projects involving U.S. companies and Eurasian enterprises formerly involved in producing WMD. These activities support U.S. national security objectives of eliminating weapons production capability and promoting development of democratic, market-based systems in the Eurasian countries., 679191=In FY 2002, the CENTCOM Humanitarian Assistance Program initiated and implemented humanitarian projects in two of the twelve Eurasian countries. CENTCOM's currently operating or completed programs include school and orphanage refitting programs in the Kyrgyz Republic and a disaster preparedness study and a refugee camp water supply project in Tajikistan. The cost for these programs was approximately $460,000., 651115=DOE/NNSA is working to improve the safety of Soviet-designed nuclear power plants and research reactors through bilateral and multilateral cooperative activities in Russia, Ukraine, Armenia, and Kazakhstan. Program activities help prevent nuclear incidents and accidents by implementing equipment upgrades, improving safety-related practices, and strengthening nuclear safety infrastructure. Activities are coordinated with government agencies and conducted with personnel from nuclear power plants and scientific and technical institutes. In FY 2002, program efforts addressed several significant safety issues at Soviet-designed reactor facilities and with overall nuclear infrastructure., 60894=The Eurasian component of the State Department's Fulbright Program provides fellowships for U.S. faculty to teach in the Eurasian countries and research awards for Eurasian scholars to study in the United States. The program gives U.S. students an opportunity to study and conduct research in any of the Eurasian countries and students from Russia and Ukraine an opportunity to study in the United States. The Fulbright Program is administered through Fulbright Offices in Moscow and Kiev and by the Public Affairs Sections of U.S. Embassies elsewhere in Eurasia. Although the Fulbright Program emphasizes the humanities and social sciences, fellowships also are awarded in biology, chemistry, mathematics, medicine, and related fields. In addition to funding 71 U.S. scholars, 93 Eurasian scholars, 40 U.S. students, and 31 Russian and Ukrainian students in FY 2002, the program also provided materials for use by U.S. grantees at their Eurasian host institutions. Some 13 additional Eurasian faculty (five from Russia, three from Armenia, two from Kazakhstan, and one each from Belarus, Georgia, and Moldova) participated in the Fulbright Study of the United States Program. The Fulbright Program offers Eurasian scholars experience with diversity, perspectives on the American liberal arts curriculum, and a global network of personal and professional contacts., 660742=USAID supports the crossborder work of 24 Women's Wellness Centers (WWCs) in five Eurasian countries: Belarus, Georgia, Moldova, Russia and Ukraine. Each WWC provides a client-centered approach to health-care services that addresses women's needs throughout their life, from adolescence through old age, and offers a comprehensive range of ambulatory clinical and educational services, including early detection, screening, disease prevention and health-promotion services. During FY 2002, more than 375,000 patient visits were recorded in these centers. In addition, the WWC Regional Task Force, composed of directors from each of the WWCs and government representatives, attended AIHA's Women's Wellness Center Quality Improvement and Dissemination Conference. The Task Force revised treatment guidelines for the region, re-examined quality improvement plans, and developed a consensus with Health Ministry representatives about the role of WWCs in national reproductive health policies., 155036=American University's Center for Global Peace is implementing Track II, a program to promote improved relations between Armenians and Turks and between Armenians and Azeris. Track II engages civil society in order to enable contact; advance mutual understanding; and promote practical areas of cooperation. It also seeks to create an atmosphere conducive to the success of official diplomatic efforts. FY 2002 project activities included leadership development activities, parliamentary exchanges, local government capacity-building, conflict resolution training, media exchanges, cultural events, the development of a virtual agricultural wholesale market, research on mutual perceptions, and the development of a regional academic consortium., 500701=The results of OTA's Enforcement in Russia were particularly notable during FY 2002. The resident advisor assisted Russia's Financial Monitoring Committee (FMC) in its successful application to join the Egmont Group of worldwide Financial Intelligence Units, as well as in the FMC's successful petition to be removed from the Financial Action Task Force (FATF) Non-Compliant Countries and Territories (NCCT) list. Separately, OTA used FSA funding to help the FMC purchase software needed to analyze the many suspicious transaction reports filed by Russia's banks., 449192=NED is a private, nonprofit organization created in 1983 to strengthen democratic institutions around the world by supporting non-governmental democracy-building efforts. With its annual Congressional appropriation, NED conducts competitive small-grants programs that help promote and strengthen pro-democracy groups, NGOs, and independent media around the world. Since FY 1997, the Office of the Coordinator of U.S. Assistance to Europe and Eurasia has provided FREEDOM Support Act (FSA) funding to augment NED's grant-making activities in Belarus. In FY 2001, the Coordinator's Office also provided FSA funds to augment NED's grant-making activities in Ukraine, and in FY 2002, FSA funding was also provided to augment NED's grant-making activities in Russia and Central Asia. In addition, the Bureau of Democracy, Human Rights, and Labor also provided funding to NED, through the Human Rights and Democracy Fund (HRDF), to supplement NED's grant-making activities in Russia and Central Asia. In FY 2002, the Department provided NED a combined total of $4.40 million in FSA and HRDF funding. An overview by country is provided below:, 595207=EXBS - Georgia Border Security and Law Enforcement (GBSLE) Assistance Program: A primary effort under the EXBS program, the GBSLE continues to be the largest single U.S. Government funded assistance program in Georgia. In FY 2002, assistance provided to the Georgian Border Guards, Customs, Defense, and other export control, law enforcement, and border security agencies totaled $17.1 million bringing the cumulative total for FY 1998-2002 to $89 million. See the Georgia country assessment section in Part II of this report., 604006=Agricultural Research Service Participant Exchanges in FY 2002, 529691=OPIC provides financing through direct loans and loan guaranties that provide medium to long-term funding to ventures in developing countries and emerging markets that involve significant equity and/or management participation by U.S. businesses. OPIC provides political risk insurance to U.S. investors to mitigate the risks of overseas business ventures in these areas. OPIC's insurance and financing programs continue to be in demand throughout Europe and Eurasia. While historically the demand has been greatest from U.S. companies investing in the telecommunications, energy, financial services, and manufacturing sectors, there has more recently been interest in the agribusiness, services, and technology sectors. Russia continues to dominate OPIC's business in this part of the world both in terms of aggregate insurance issued and number of projects. OPIC clients continue to struggle with the difficult operating environment in some countries in Europe and Eurasia. In FY 2002, OPIC committed a total of $288.5 million in insurance and financing for nine long-term investment projects in Eurasia. This includes a $150 million loan guaranty to Citibank, N.A. for the development of an on-lending facility for financing investments with U.S. business participation in Russia and the Eurasian region. OPIC also committed in FY 2002 a $43 million loan guaranty to Soros Private Funds Management, LLC for the Soros Investment Capital Fund, enabling it to make equity investments in the Caucasus region. For additional information, please see the country assessments in Part II of this report., 425869=All FEP participants report that they have been able to introduce new material into their academic courses upon returning to their home institutions. Three participants from the 2001 group have been offered promotions to positions of higher authority where they can more easily effect change at their home institutions. One former participant from Moscow was selected for the Edmund Muskie Ph.D. Fellowship Program in FY 2002 to continue studies at Purdue University on a topic that she began during her FEP program. A total of 12 U.S. faculty members from the Universities of Minnesota and Nebraska, the Pennsylvania State University and Colorado State University provided follow-on support visits to a total of 40 participants in Kazakhstan, Russia and Ukraine. Like their predecessors, FY 2002 FEP participants wrote articles on selected aspects of the U.S. agricultural system that will be of interest to their Eurasian colleagues. These articles were compiled, published in the Russian language and distributed to all agricultural universities in Kazakhstan, Russia and Ukraine., 651954=The U.S. Department of Energy is working to improve the safety of the Armenia Nuclear Power Plant's Unit 2 to reduce the chance of an accident. In FY 2002, substantial operational and technical improvements were made. For additional details, please see the Armenia country assessment in Part II of this report., 714745=The Caucasus Research Resource Center Project (CRRC): In FY 2002, SCCP entered into partnership with the Carnegie Corporation of New York to implement the Caucasus Research Resource Center project. The CRRC is working to create a network of resource centers - one each in Baku, Tbilisi, and Yerevan - to strengthen efforts by social scientists researching topics relevant to contemporary public policy formation. The Foundation plans to launch all three centers in early 2003., 645198=In FY 2002, the RERTR program activities continued to support testing of LEU fuel elements, which can be used for HEU to LEU conversion of reactors in Uzbekistan, Hungary, Ukraine, and Bulgaria, and at the St. Petersburg Nuclear Physics Institute. Tube-type fuel tests were completed and pin-type fuel tests have been initiated. In addition, development of pin-type high-density fuels for Russian-designed research reactors continues at the Bochvar Institute. Studies and analysis of the prospects for converting a number of Russian-designed research reactors from operating with HEU fuels to LEU have continued. Fuel qualification tests were continued and neutronic feasibility studies started to assess the performance of LEU fuel for research reactors in Poland, Uzbekistan, and Russia. In FY 2002, RERTR spent $0.9M of $1.17M of its budgeted funds; all $1.17M are obligated., 757861=In keeping with the heightened U.S. foreign-policy interest in Central Asia, a key goal for CDR/CAR in FY 2003 is to promote more U.S. links to the region via the participation of American scientists and research institutions in the program. Therefore, the program guidelines have been amended to require a U.S. partner on each new grant. Future projects can make use of the strong Israeli-Central Asian partnerships already built by CDR in order to facilitate greater involvement by the U.S. scientific community in development of the region. This change has already resulted in a significant increase in both the quality and quantity of pre-proposals submitted to the program., 101664=This program, which is administered by the International Research and Exchanges Board (IREX), combines academic coursework with complementary community service and an internship, and targets Russian university graduates who have demonstrated leadership skills and an interest in public service. The program provides full scholarships for one year of non-degree study in the United States at qualified universities and colleges. Russian students select a concentration in Community Affairs, Governmental Affairs, or Corporate Affairs. FY 2002 funding is providing fellowships for 27 Russian participants., 563400=A total of $29.02 million has been spent on these two programs through the end of FY 2002. Those funds have enabled the achievement of significant program milestones:, 609341=While several projects in FY 2002 were continued from previous years, new projects were also developed and implemented. Two projects were completed: genetic analysis of MDR-TB - State Research Center for Applied Microbiology (Obolensk) and CDC (26 Russian participants) and development of methodology for kits to detect hazardous pathogens in blood - State Research Center of Virology and Biotechnology (Vector) and FDA (1 Russian scientist on a U.S. training visit)., 531452=The U.S. Trade and Development Agency (TDA) is a small, independent federal agency that has been active in the Eurasia region since the collapse of the Soviet regime in 1991. In 2002, the program continued to expand, especially in Central Asia, where the war on terrorism highlighted the strategic importance of this region. Uzbekistan, in particular, was a top recipient of TDA-funded studies in FY 2002. With nine feasibility studies, it came out second with respect to obligations in TDA's worldwide program. Continued political and economic stability in Russia led to an increase in feasibility studies and technical assistance in that country. Overall, TDA increased its policy-oriented assistance with respect to WTO accession, and in industries such as telecommunications and power, which hold enormous potential for U.S. products and services., 577302=COOPERATIVE DETERMINATION (CD) was a NATO/CINCSOUTH sponsored Peace Support Operations exercise. The exercise was conducted in Switzerland. Its purposes were to enhance military interoperability for Peace Support Operations (PSO) and Humanitarian Assistance (HA) operations at the Multi-National Brigade (MNB) level; practice the request and coordination of land tasks; practice the request and coordination of airlift, airdrop, Search and Rescue (SAR), and MEDEVAC operations in support of land operations; understand the interoperability requirements for logistic support; and practice refugee control procedures. Participants included Moldova and Azerbaijan., 678261=In FY 2002, the EUCOM Humanitarian Assistance Program initiated and implemented humanitarian projects in eleven of the twelve Eurasian countries. EUCOM's currently operating or completed programs include: a school renovation and a dental outreach program in Azerbaijan; an emergency hospital program in Gomel, Belarus, including provision of vehicles; a handicapped training center, in cooperation with the International Red Cross, in Digomi, Georgia; an orphanage support mission and a prisoner TB program in Moldova; and a medical upgrade program in Kurgan, Russia. These programs have delivered over $200,000 in commodities at an approximate cost of $690,000. EUCOM has approved projects for next year in Azerbaijan, Georgia, Moldova, Russia, and Ukraine., 193660=During the 2002-03 hosting cycle, 680 business participants will be successfully placed in internships and 890 professional participants will attend site visits, seminars and meetings relevant to their fields. In FY 2002, 50 local organizations were part of the Community Connections U.S. hosting network. In addition, during FY 2002, U.S. host organizations organized a variety of follow-on activities (seminars, round tables, lectures, etc.) designed to build on the training and experiences that Community Connections alumni gained in the United States. Approximately 83 Americans traveled to the Eurasian countries to implement follow-on programming. Overall, there are currently more than 12,000 Community Connections alumni throughout Eurasia who remain active by participating in activities developed by host organizations, recruitment organizations and U.S. embassies., 444045=The Media Development Fund, which is administered by the Public Affairs Section of the U.S. Embassy in Kiev, is a small-grants program that promotes the development of a free and independent media in Ukraine. In FY 2002, the Fund awarded over 45 grants totaling some $460,000 to independent newspapers and magazines, radio and television stations, individual journalists, and NGOs working to develop independent media. For additional information on this program, please see the Ukraine country assessment in Part II of this report., 583896=OPEN ROAD 02 was held on January 20-24, 2002 at Portsmouth, Virginia. This exercise is an operational seminar/wargame for senior NATO/PFP military and political leaders. It is designed to explore new NATO missions and the operation of CJTFs. Albania, Bulgaria, Georgia, the Former Yugoslav Republic of Macedonia, Romania, and Ukraine participated., 543106=Central Asian-American Enterprise Fund (CAAEF): CAAEF was created in 1994 to promote the creation of small and medium-sized businesses in Central Asia. The CAAEF has a total authorized capitalization of $150 million with $111 million obligated to date. Business conditions in most of Central Asia are extremely difficult especially for equity investments, which make up the majority of the Fund's portfolio. The Fund is not making any new investments, and is in the process of winding down its loan programs and will exit its equity investments as soon as is feasible., 545892=Distribution of DEF Activity by Country as of December 30, 2001, 762103=Early in the 1980s, the Executive Branch, Congress, and the U.S. academic community pooled their efforts to create the Soviet-Eastern European Research and Training Act of 1983 (also known as Title VIII). The intent of the bill was to redress the diminishing supply of experts on this region by providing stable, long-term financing on a national level for advanced research; graduate and language training (domestic and on-site); public dissemination of research data, methods and findings; and contact and collaboration among Government and private specialists., 122234=The FSA Educational Partnership Program provides grants of up to $300,000 for U.S. and Eurasian institutions to exchange faculty and staff for the purpose of teaching, lecturing, faculty and curriculum development, collaborative research and outreach. Cost-sharing by the U.S. partner institutions and other sources covers approximately 45 percent of all program costs. In FY 2002, the ECA Bureau awarded 23 new grants for U.S.-Eurasian partnerships that will provide exchange opportunities to a total of 279 Eurasian and 234 U.S. participants. Two of these grants were awarded to community colleges. In May 2002, representatives of 23 U.S. schools and 19 Eurasian schools involved in partnerships in the field of business administration met at a workshop in Washington, D.C., to share their experiences in curriculum development in the field of business administration. Project directors described how they had developed new degree programs, business development centers, and executive management training programs., 597100=Through the multilateral International Science and Technology Center (ISTC) in Moscow and the Kiev-based Science and Technology Center in Ukraine (STCU), the Department of State budgeted an estimated $37 million for activities in FY 2002, a slight increase over the $35 million in FY 2001. The Science Centers are intergovernmental organizations that coordinate the efforts of numerous governments, international organizations, and private sector industries to provide former Soviet weapons scientists with opportunities to redirect their talents to peaceful civilian research, thus helping to prevent the proliferation of their expertise. The United States contributed a majority of the FY 2002 multilateral funding for projects that engaged 7,030 scientists - including 4,268 former Soviet WMD experts - in peaceful scientific research. This brings to more than 50,000 the number of scientists engaged in the program since its inception in 1992, a majority of whom are categorized as WMD scientists. The program reduces the risk that weapons expertise might be successfully targeted by countries of proliferation concern or terrorist groups. In addition, eight new U.S. industry partners were recruited to invest in scientific research through the Science Centers, and several new technologies were brought to market, including a linear differential equation solver, a laser-based fluorocarbon detector, and computer animation technology., 566952=DoD / U.S. Customs Service Counterproliferation Program: the DoD / U.S. Customs Service Counterproliferation Program was authorized in Section 1424 of the National Defense Authorization Act for FY 1997. Unlike the DoD / FBI Counterproliferation Program, the DoD / U.S. Customs Service Counterproliferation Program focuses heavily on equipment in its initial implementation. A government-to-government counterproliferation agreement must be in place between the United States and the participating nation prior to the delivery of U.S. Government-funded equipment. These agreements serve as umbrella agreements for this program and future U.S. bilateral initiatives, establish proper government commitments to stop WMD proliferation and trafficking, and provide the necessary liability protections, privileges and immunities, and tax / customs exemptions for U.S. Government-funded equipment and personnel. The DoD / U.S. Customs Service Counterproliferation Program has three objectives: (1) to assist in the continuing establishment of a professional cadre of border enforcement personnel; (2) to enhance customs and border guards ability to detect, interdict, identify, investigate, and respond to the illicit trafficking of weapons mass destruction; and (3) to establish a long-term and mutually beneficial working relationship between us agencies and the border enforcement agencies of the program participating countries., 636821=In FY 2002, DOE/NNSA achieved significant results in the other Eurasian countries besides Russia by further increasing the level of security at the Institute of Nuclear Physics in Tashkent, Uzbekistan. These enhancements were designed to protect against sabotage and provided a system compatible with the IAEA's revised guidelines. In addition, the program worked on sustaining previously installed MPC&A systems, further assessing the current state of upgraded MPC&A systems, remedying noted deficiencies within upgraded MPC&A systems, and aiding the Eurasian countries in meeting their international safeguards commitments and physical protection guidelines., 632918=The ATA Program for the countries of Eurasia began in 1994 with airport security training in Georgia. After 1999, the program expanded into Central Asia. In the past few years a major goal of the program has been to assist governments in addressing the terrorists threats and activities emanating from Afghanistan. Since the September 11 terrorist attacks ATA has more than doubled its efforts to provide outreach to front line nations that would benefit from antiterrorism training assistance., 501318=OTA was also able to re-direct resources to support U.S. foreign policy priorities in Central Asia and the Caucasus. After the waiver of Section 907 restrictions, OTA advisors rapidly conducted assessment missions in Azerbaijan. Work programs in the budget and financial crimes enforcement areas soon followed. Later in the year, OTA conducted a similar assessment in Uzbekistan. Leading with a macroeconomic advisory program to assist reform elements in the Uzbek government to confront the need to restructure its economy, OTA now has budget, tax, government debt and financial institutions programs active in this country. The decision in FY 2001 to re-build the Regional Office in Budapest, Hungary played an important role in OTA's flexible and cost-effective response in these situations., 614110=Seven projects have been approved and will commence October 1, 2002. More than thirty additional proposals are currently in project development or merit review and include very promising areas of research., 261378=USAID Global Training for Development (GTD) and Strategic Technical Assistance for Results with Training (START) Numbers of Participants in FY 2002 by Strategic Assistance Area (SAA) , 618604=Cooperative Grants Program: CRDF's grants program is a multidisciplinary competition for collaborative US-Eurasia research grants selected through a competitive, merit-based review process. In FY 2002, CRDF funded 148 Cooperative Grants Program proposals totaling $6.9 million in FSA funds, $1.1 million from the National Science Foundation and $1.4 million from the National Institutes of Health. The average grant size is approximately $60,000 over two years. At least 80% of each grant is directed toward expenses of the Eurasian team. Approximately 43 percent of projects include Eurasian scientists who are former weapons scientists. The CRDF also helps Eurasian applied scientists to identify and establish contact with U.S. companies working in complementary fields through its Travel Grants Programs. In FY 2002 the CRDF awarded 106 grants for industry-oriented visits to the United States by former Soviet researchers seeking U.S. partners., 441811=The Department of State continues to provide support to the Georgian Institute of Public Affairs (GIPA) for training public officials in effective public administration in a democratic and market-oriented environment. In FY 2002, the first group of students enrolled in GIPA's School of Local Government, and GIPA's School of Journalism graduated its first class of 20 students and enrolled its first class of master's-degree journalism students. Support for the Georgian Foundation for Strategic and International Studies (GFSIS) fosters the development of local capacity to produce high-quality policy research and strategic analysis. Local grants for GIPA and GFSIS through the Public Affairs Section of the U.S. Embassy in Tbilisi are coordinated with grants through the Bureau of Educational and Cultural Affairs that bring U.S. specialists to Georgia. In Belarus, the Bureau of European and Eurasian Affairs provides support for the independent European Humanities University (EHU) through a program of means-tested scholarships for talented Belarusian students. In the Kyrgyz Republic, FY 2002 funds were allocated to the U.S. Embassy in Bishkek to provide institutional support for the American University of Central Asia (AUCA), formerly known as the American University in Kyrgyzstan (AUK), which serves as a regional model for integrity in education in Central Asia and as a locus for Western-style free inquiry and open discussion on campus. AUCA now enrolls approximately 1,000 students from across Eurasia and elsewhere in Asia and offers 11 different undergraduate majors. In addition to direct institutional support, funding allocated to the U.S. Embassy in Ashgabat in FY 2002 will allow 21 students from Turkmenistan to attend AUCA during the first year of a new scholarship program. Attending AUCA will provide students from Turkmenistan with an opportunity to study fields that support democratic reform and economic development—opportunities that are currently not available in Turkmenistan., 755406=A number of technical accomplishments were achieved in FY 2002, including the following:, 672519=In FY 2002, USDA allocated $95 million in export guarantee programs to the Eurasian countries. These programs include the GSM-102 Program (GSM-102), Supplier Credit Guarantee Program (SCGP), and the Facility Guarantee Program (FGP). An overview of these programs is provided below. For additional details, please see the country assessments in Part II of this report. A country-by-country overview of USDA export guarantee programs is provided below:, 569825=Since 1996, the AMEC program has conducted a number of technology demonstration projects in support of Norway, a key NATO ally, which address Russian pollution of their prime fishing grounds. Funded at $3.2 million in FY 2002, 80% of the AMEC projects address radiological waste issues in Northwest Russia, including projects designed to enhance the security of stored radioactive material, decreasing the potential for diversion and possible use in the manufacture of dirty bombs. Non-radiological projects are focused on elimination of hazardous waste produced during nuclear submarine dismantlement. During FY 2002, a variety of AMEC projects have been integrated into a comprehensive nuclear waste storage system. As a result, key changes in Russian nuclear waste storage technology have occurred which allowed transition from a wet system, prone to failure, to a dry system used by most Western Nations. Storage and transport of Spent Nuclear Fuel (SNF) - which accounts for 99% of the radioactivity released from radioactive waste while constituting only 5% of the volume - has been improved through the use of the AMEC 40 ton cask and a temporary storage/transshipment pad. The cask, Project 1.1, is Russia s first dual-use transport and storage cask while the pad, Project 1.1-1, will reduce the shipment time of SNF from 3 months to 3 weeks. Solid Radioactive Waste (SRW) processing, transport and storage will be improved through the use of a Mobile Pretreatment Facility (MPF), Project 1.3 and the use of steel transport and storage containers another dual-use first Project 1.4. Radioactive storage sites will be monitored remotely for both radiological and ecological conditions, Project 1.5-1, and the personal safety of radioactive waste workers has been improved through training and U.S. and Norwegian supplied dosimeters. All of these projects have, or will be completed during FY 2003., 556676=The Soviet Nuclear Threat Reduction Act of 1991 (also known as the Nunn-Lugar Act) charged DoD with establishing a program to assist the Soviet Union and any successor states to store, safeguard, destroy and prevent the proliferation of weapons of mass destruction (WMD) and other weapons. The resulting Cooperative Threat Reduction (CTR) Program has played a crucial role in the U.S. Government's proliferation prevention strategy. Belarus, Kazakhstan and Ukraine acceded to the Nuclear Nonproliferation Treaty in 1994 based on the commitment of DoD to provide CTR assistance to help rid their countries of nuclear weapons. The removal of all nuclear weapons from these states to Russia was achieved in 1996., 59998=In FY 2002, the ECA Bureau brought approximately 6,900 Eurasian citizens to the United States and sent approximately 1,200 U.S. citizens to the Eurasian countries on short- and long-term professional and academic exchange programs addressing a wide range of topics related to democratic and free-market reform. The ECA Bureau's FY 2002 assistance programs for Eurasia were funded through the FREEDOM Support Act (FSA) as well as through the ECA Bureau's own base appropriation under the Educational and Cultural Exchanges (ECE) Account. The funding source for each of the programs described below is noted as FSA-funded, ECA base-funded, or jointly funded., 532990=For FY 2003, USTDA will continue to emphasize projects in Central Asian countries that are affected by the war in Afghanistan, and will provide policy-related assistance throughout the region. TDA's Eurasia division also expects to augment its activity in sectors such as health care and information technology. These sectors are priorities for local governments in Eurasia, as well of increasing interest to U.S. industry. For additional information, please see the country assessments in Part II of this report., 562102=In FY 1995, under the U.S. Defense Department's Cooperative Threat Reduction (CTR) Program, the Defense Enterprise Fund (DEF) was established to facilitate defense conversion efforts in the former Soviet states. (See Enterprise Funds Section above)., 707800=The Eurasia Foundation promotes the development of democratic institutions and private enterprise at the grassroots level. Conceived in 1992, shortly after the dissolution of the Soviet Union, the Foundation began its grant making in 1993 with a grant from USAID. The Foundation is privately managed and field-driven, and is unique in its ability to offer a quick and flexible response to needs identified by Eurasian organizations and to reach areas often untouched by other donors. While its primary tool for providing assistance is an open-door grants program, the Foundation also employs grants competitions to target certain priority areas on a regional basis. Over the past nine years, the Foundation has used funding to award nearly 6,500 grants, totaling approximately $128 million, including 611 grants totaling over $13.4 million in FY 2002. Of the FY 2002 amount, U.S. Government support funded 528 grants totaling over $12.8 million. The Foundation also manages several projects including: the Economics Education and Research Consortium (EERC); the Small Business Loan Program (SBLP) in Ukraine and Armenia; the Media Viability Fund (MVF) in Russia and Ukraine; the Media Strengthening Program (MSP) in Armenia; and the Caucasus Research Resources Centers (CRRC) in Armenia, Azerbaijan, and Georgia., 643340=Drawing upon experience in the U.S. nuclear export control system, DOE/NNSA cooperates with agencies responsible for nuclear export controls in several Eurasian countries, emphasizing technical expertise in order to assist the development of advocates for nonproliferation controls throughout Eurasia. In FY 2001, NNSA took steps to augment federal staffing of its Eurasian Export Control Program and expand cooperation beyond Russia, Ukraine and Kazakhstan - the states representing the highest risk of illicit nuclear supply - to other Eurasian countries and to involve the states that pose transit risks, namely, the Southern Tier (Central Asia and the Caucasus). NNSA also boosted strategic planning efforts to focus on three core goals: improving nuclear export licensing processes, promoting industry compliance, and strengthening enforcement capabilities. This approach is expected to optimize out-year planning and interagency coordination. FY 2002 funding from DOE for the INECP was budgeted at $1.7 million. Major FY 2002 accomplishments are highlighted below:, 717659=Following the dissolution of the Soviet Union, the Peace Corps was invited to send Volunteers into eight Eurasian countries (Armenia, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Turkmenistan, Ukraine and Uzbekistan) to help facilitate their transition to market-oriented democracies. Then, in 2001, Peace Corps sent its first group of Volunteers into the Republic of Georgia. Peace Corps Volunteers (PCVs) have helped overcome the previously limited contact between the United States and Eurasia, have established and strengthened new bonds of friendship and cross-cultural understanding by addressing issues of mutual concern at the grass-roots level - one community at a time. Volunteers have helped build institutional and human capacity in these transitional economies, while helping change perceptions of their host communities and counterparts regarding the United States and the American people. After returning home from their Peace Corps experience, Peace Corps Volunteers also have helped educate Americans about the people and cultures of the Eurasian region. In FY 2002, the Peace Corps' activities included:, 544768=In FY 1997, funding responsibility for the DEF was transferred from the U.S. Department of Defense to the U.S. Department of State under the FREEDOM Support Act (FSA). The DEF received a total of $66.7 million from the Departments of Defense and State. While no Defense Department funding has been appropriated for the DEF since FY 1995, and no State Department funding since FY 1997, the DEF's investments have contributed to transformation efforts in the former Soviet military industrial complex. The DEF has invested in a total of 10 projects in Russia, two in Kazakhstan, and one in Ukraine. Several DEF investment projects have been successfully harvested and, despite the August 1998 Russian financial crisis and its spillover effects throughout Eurasia, most remaining projects continue to perform adequately. Due to difficulties related to privatization laws and human rights abuses in Belarus, the DEF has been unable to invest in projects in that country. The DEF has expended the bulk of their available funds and are not making new investments at this time., 248910=The Eurasia Alumni Program provides funds to encourage professional development, cooperation, and a sense of community among alumni of U.S. Government-funded exchange programs. In FY 2002, the Eurasia Alumni Program supported 64 special alumni projects in Armenia, Belarus, Georgia, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Turkmenistan, Ukraine and Uzbekistan. This support has, in turn, fostered the development of NGOs and promoted volunteerism by alumni in their local communities. The Eurasia Alumni Program also provided U.S. Embassy Public Affairs Sections with funds to pay for local alumni coordinators in Chisinau, Kiev, Almaty, Ashgabat, Moscow, and Tashkent, and to operate Alumni Resource Centers in Tbilisi, Chisinau, and Kiev., 427017=A third FEP Reunion Workshop was held in Moscow in October 2001, bringing together 69 out of 85 FEP alumni and 10 faculty members from U.S. universities. The workshop allowed Eurasian and U.S. faculty members to discuss progress and results to date in curriculum reform and course development and ways in which U.S. universities and USDA can provide ongoing and future support. The workshop provided an opportunity to share valuable information and to continue the program's emphasis on networking, partnerships and information-sharing. A collection of papers presented at the workshop were also published in the Russian language and distributed to all agricultural universities in Russia, Kazakhstan and Ukraine. As a result of the Moscow workshop, a FEP website was established at Voronezh State Agricultural University to exchange information, course outlines, research papers, articles, and general information on agricultural development in all FEP participant countries., 564571=DoD / FBI Counterproliferation Program: The National Defense Authorization Act, 1995 (P.L. 103-337) authorized the Secretary of Defense and the Director of the FBI to develop a joint program to expand and improve U.S. Government efforts to deter, interdict and prevent the possible proliferation and acquisition of weapons of mass destruction (WMD) by organized crime groups and individuals in Eurasia. The focus of the DoD / FBI Counterproliferation is on nuclear, chemical and biological weapons-related law enforcement training to prevent smuggling and trafficking. The program's work plan is divided into three elements: policy consultations and program development, training and assistance, and equipment procurement. Program plans and the first country assessments were initiated in 1996 to determine program requirements. Following training and reviews of existing assistance, some equipment may be provided to enable trained personnel to execute their responsibilities more efficiently and competently. The DoD/FBI Program has three objectives: (1) to assist in continuing establishment of a professional cadre of law enforcement personnel within participating nations who are trained and equipped to prevent, deter, and investigate crimes related to proliferation and/or diversion of WMD related materials; (2) to assist participating nations, upon their request, in developing appropriate laws, regulations, and enforcement mechanisms in accordance with international standards; and (3) to build a solid and long-lasting bureaucratic framework reinforced by political commitment that would enable participating governments to address the proliferation problem., 578894=REGIONAL COOPERATION 02 (FORMERLY CENTRASBAT) in the past has been a Computer Assisted Command Post Exercise (CPX) designed as a peace enforcement training. It was cancelled in FY 2002 due to Operation Enduring Freedom., 666493=In FY 2002, USDA provided $146.59 million in humanitarian aid and concessional loans to the Eurasian countries, including almost $74 million in targeted direct-feeding and food-aid monetization programs implemented by private voluntary organizations (PVOs), a $16.90 million allocation of food commodities to Tajikistan through the United Nations World Food Program (WFP), and a concessional loan of approximately $36 million to Uzbekistan under the P.L. 480 Title I Program. An overview of these programs is provided below. For additional details, please see the country assessments in Part II of this report., 601380=The Agricultural Research Service (ARS) is the principal in-house research agency of the U.S. Department of Agriculture (USDA). In 1998, at the request of the Departments of State and Defense, ARS initiated a program with funds from the FREEDOM Support Act (FSA) to engage former Soviet biological weapons scientists in peaceful, agricultural research. Through scientific cooperation, the program helps reduce the risk of proliferation of weapons of mass destruction expertise, increases transparency at former Soviet biological weapons (BW) research sites, and supports the transition of former Soviet weapons scientists in Russia, Kazakhstan and Uzbekistan to civilian research activities by redirecting their biotechnology expertise to agricultural research. In addition, the program advances agricultural science by establishing new expertise in Eurasian countries, enhances the effectiveness and productivity of ARS research programs, and helps to improve the economy of Eurasian countries through advances in agricultural technology., 617896=Also in FY 2002, the CRDF announced a special initiative, the Special Competition for Research on Minimizing the Effects of Terrorist Acts on Civilian Populations, designed to provide funding opportunities for cooperative research in techniques and technologies designed to minimize the impact of terrorist acts on civilians. In response, the CRDF received 140 proposals, most from teams including scientists with weapons of mass destruction expertise. Awards will be announced in early 2003. The average grant size will be $80,000-$100,000 over nine-months. CRDF expects to be able to fund 8-12 proposal and anticipates seeking other sources of funding., 576750=COOPERATIVE BEST EFFORT (CBE02) was an annual NATO Partnership for Peace joint, multi-national infantry squad level peacekeeping skills LIVEX. CBE 02 location was Vaziani, Republic of Georgia (approximately 18 KMs SE of Tbilisi) and held in three phases: (1) familiarization and training, (2) task oriented training with selected NATO standard drills, and (3) FTX. The exercise is usually conducted at the end of each fiscal year (September) but this year's exercise was conducted June 17-28, 2002., 113646=The ECA Bureau's Contemporary Issues Fellowship Program provides participants with an opportunity to conduct research and participate in professional conferences and public fora on a range of topics, including sustainable growth and economic development; democratization, human rights and the rule of law; political, military, security and public-policy issues; strengthening civil society; Internet; New Media; and intellectual property rights. The program, which is administered by the International Research and Exchanges Board (IREX), targets Eurasian government officials, NGO leaders and private-sector professionals who are engaged in the political, economic, social, or educational transformation of their countries. Fellows are selected through an open, merit-based competition and placed in four-month-long programs at U.S. universities, think tanks, non-governmental organizations (NGOs), and U.S. Government offices. They are also matched with U.S. host advisors, who guide their research and professional development. FY 2002 funding is providing placements for 108 Contemporary Issues fellows., 619634=Next Steps to the Market Program: This program funds pre-commercial, cooperative projects carried out by U.S. and Eurasian scientists and engineers to facilitate commercial utilization of research results. The CRDF activated 14 Next Step to Markets grants in FY 2002 and attracted almost $4 million from U.S. industry for its $1.7 million investment in FY 2002. The First Steps to Market (FSTM) program, started in FY 2002, will consist of project grants and commercialization workshops to develop technology transfer offices in Eurasia, and other outreach activities designed to connect U.S. companies with Eurasian scientists and engineers. This program addresses a critical decision point in industrial collaborations that is separate from, and more specialized than, research and development projects supported by NSTM. The prototype can show that the Eurasian laboratory can provide something that works at a level required for the company to enter into a long-term commercial relationship., 656341=As a result of FY 2002 supplemental funding that will be obligated during FY 2003, INL-managed programs in the five Central Asian states of Kazakhstan, the Kyrgyz Republic, Tajikistan, Turkmenistan and Uzbekistan will expand significantly in areas relating to establishment of national drug control agencies, judicial and legal programs, technical assistance to combat financial crimes, and projects to develop improved interdiction of narcotics and trafficking of persons., 582183=COOPERATIVE SAFEGUARD 02 was held on October 9-12, 2001 in Keflavik, Iceland. This was a disaster relief exercise to improve interoperability between international military forces, civil agencies and non-governmental agencies. The exercise includes search and rescue operations and civil defense operations. Austria, Estonia, Ireland, Lithuania, Romania, Slovakia, Sweden, and Uzbekistan participated., 561654=In FY 2001, the CTR program funded almost 250 defense and military contact events in Eurasia, and 350 events in FY 2002 including military exercises, high-level exchanges, ship visits and exchanges of delegations on defense and military topics., 564044=The success of the programs can be seen in the increasing rate of WMD seizures made by local officials. For example, in 1998, Bulgaria intercepted a shipment of nuclear reactor equipment, while Romania seized one of WMD-controlled equipment. In 1999, the Kyrgyz Republic seized a shipment of plutonium, and Bulgaria and Georgia seized shipments of U-235. In 2000, radioactive material was stopped at the Uzbek-Kazakh border and in 2001 at another border post in Uzbekistan., 655847=INL's International Law Enforcement Academy (ILEA) in Budapest is a continuing program that targets European and Eurasian law enforcement agencies and officials. Mid-level law enforcement management training, specialized courses and short term training combine to provide the countries receiving Freedom Support Act assistance with an integrated program for participants from the region. FY 2002 support for ILEA was approximately $859,000., 650449=NCI was established in 1998 through a Government-to-Government Agreement between the United States and the Russian Federation. NCI represents an unprecedented effort to contribute to the irreversible, transparent downsizing of the Russian weapons complex - by removing functions and equipment from the complex, reducing the physical footprint, and creating sustainable, alternative non-weapons work for displaced nuclear experts. For additional details, please see the Russia country assessment in Part II of this report., 607506=The BTEP program was established in March 1999 as part of the U.S. Government efforts to combat proliferation of weapons of mass destruction and reduce risks of bioterrorism. Total funding from FY 1999 - FY 2002 is $34.9 million including FY 2002 funds budgeted at $9 million under the State Department FREEDOM Support Act account. (FY 1999 was $4.8 million, with a 50% restriction on funding to Russia; FY 2000 was $11 million; and FY 2001 was $10 million). Through this program, HHS is engaging former Soviet biological weapons scientists in projects of collaborative research and redirecting their biotechnology expertise to peaceful research in areas of urgent public health needs in Eurasia. In order to administer projects locally and to pay Eurasian scientists and participants for their work, HHS has become a partner with the International Science and Technology Center (ISTC) in Moscow., 648268=In FY 2002, the IPP program emphasized commercialization by approving only new projects that have a clear commercial focus and a participating U.S. industrial partner on a cost-share basis. The IPP program's research projects engaged scientists in Russia, Ukraine and Kazakhstan. U.S. industry partners are required to match U.S. Government funds with their own resources, which are devoted to commercializing the projects. Through FY 2002, the U.S. Government has allocated, over the life of the program, more than $90 million to U.S. industry cost-shared projects. This amount public funds has been leveraged by over $125 million of in-kind and \"funds-in\" private contributions by U.S. industry. This reflects the strong endorsement by U.S. industry of the IPP program and is an indicator of the long-term self-sustaining potential of many of the IPP projects., 438598=U.S. Government support for GIPI's work in Russia and Ukraine is enabling U.S. partners to work with local partners to establish ongoing working groups with key stakeholders—including Internet service providers (ISPs), content providers, foreign investors, telecommunications and wireless service providers, NGOs, government officials, and foreign experts—to develop and promote an agenda for policy reform in order to support affordable and unfettered Internet access. GIPI is implemented by Internews and the Center for Democracy and Technology. In FY 2002, GIPI worked with Russian and Ukrainian government officials to develop the legislative and regulatory frameworks necessary to make the Internet more open and accessible in Russia and Ukraine. GIPI also informed policymakers and stakeholders about telecommunications reforms and their impact through a series of roundtables and the publication of numerous articles on Internet issues in the local press., 191597=The Community Connections Program offers community-based, three- to five-week practical training opportunities with home-stays in the United States for entrepreneurs, local government officials, legal professionals, NGO leaders and other professionals from Armenia, Azerbaijan, Belarus, Georgia, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Ukraine, and Uzbekistan. FY 2002 funding is supporting training for approximately 1,570 participants., 592731=In the aftermath of the September 11 terrorist attacks, however, border security assistance, particularly in the Central Asian front line states was increased significantly with $41 million in Emergency Response Funds provided for EXBS Assistance and an additional $10 million in the Supplemental for Further Recovery from and Response to the Terrorist Attacks. Thus, over the past year, just over $93 million was provided for State Department FY 2002 EXBS regular and supplemental efforts in the Eurasian states. This level of funding enabled the State Department to continue to expand both the geographic coverage and scope of EXBS assistance. While there were initially some problems in supporting such a significant increase requiring rapid implementation, assistance providers such as U.S. Customs have adjusted support levels to meet these requirements., 668292=Azerbaijan, 486680=ABA/CEELI's USAID-funded activities support the rule of law; the protection of civil, political and property rights; and the limiting of arbitrary government action. The rule of law requires an impartial judiciary, professional and honest prosecutors, effective legal representation, and well-defined legal procedures that help ensure uniform and timely enforcement of laws. USAID-funded activities support legislative drafting, strengthen the independence and accountability of the judiciary, encourage more transparent and efficient administration of cases, train judges, and build professional associations. USAID's regional rule-of-law activities achieved substantial results in FY 2002. Regional institution-building advisors (RIBAs) fielded by ABA/CEELI continued to provide comprehensive assistance to key NGOs in the field of legal reform, primarily in Armenia, Belarus, Moldova and Ukraine. As a result of ABA/CEELI's efforts, several of its key local partners, in particular the Environmental Public Advocacy Centers (EPACs) supported by ABA/CEELI in Ukraine, have been able to secure non-USAID funds through improved proposal-writing skills and effective public outreach efforts., 416895=The FEP provides six months of practical training to university educators from progressive Eurasian agricultural institutions to increase their capacity to develop academic and adult education programs and curricula in agricultural economics and marketing, agribusiness, and agrarian law. The FEP is designed and managed by the Professional Development Program (PDP) of the Food Industries Division of the Office of International Cooperation and Development, which is part of the Foreign Agricultural Service. A total of 17 participants from Russia, Ukraine and Kazakhstan completed a six-month program in December 2001. An additional 23 participants from Russia, Ukraine, Kazakhstan and, for the first time, Uzbekistan, began a six-month program in July 2002. The total number of FEP graduates since the program's 1995 inception is 119: 59 participants from Russia, 48 from Ukraine and 12 from Kazakhstan. They represent 54 different universities, institutes and training institutions: 19 Ukrainian, 30 Russian, and five Kazakhstani., 588707=Tajikistan became eligible for WI funding on November 18, 2001 when the country became an official member of the Partnership for Peace. One of the first activities is to install the Partnership for Peace Information Management System (PIMS) in December 2002 to facilitate Internet access. Five other events such as a defense planning exchange and a regional airspace initiative are planned for FY 2003. Approximately $43 million (later reduced by the OSD Comptroller to $40.5 million) was appropriated to support the DoD Warsaw Initiative Program in FY 2002 in Eurasia and in Central and Eastern European countries. Of this amount, $14.1 million was budgeted to support Eurasia interoperability programs and PIMS activities. Another $26.3 million went to support: (1) U.S. European Command - $14.7 million (includes funding for National Guard participation in exercises); (2) U.S. Central Command - $2.6 million; and (3) JFCOM AT - $8.8 million., 716538=The Media Viability Fund (MVF): The MVF helps independent media outlets in Russia and Ukraine to receive long-term, low-interest loans and provides them with targeted technical assistance. Supporting the sustainability of independent media sources contributes to the development of greater pluralism and freedom of information services in these countries. MVF also provides training to help newspapers, television stations, and radio stations in Russia and Ukraine remain independent by operating as profitable enterprises in competitive markets. In FY 2002, MVF worked with 17 independent media companies in Russia and Ukraine to finance the purchase of printing presses; conduct individually tailored on-site consultations and training on newsroom management, financial management, production, design, marketing, advertising and sales, and content management; and encourage horizontal ties and professional communication by organizing four client-to-client trips., 681851=Total PRM funding earmarked for the North Caucasus was $7.7 million in FY 2002. Specifically, PRM earmarked $3.4 million to the UN agencies working in the region, and another $4.3 million was programmed to NGOs working in the North Caucasus. In addition, PRM's substantial regional contribution to the Eurasian states, although not earmarked specifically for Chechnya, covered approximately 25% of ICRC's total budget in the North Caucasus for the year (approximately $6.2 million)., 88693=The Edmund S. Muskie/FSA Graduate Fellowship Program provides highly qualified Eurasian participants with opportunities to undertake graduate-level study leading to a master's degree or professional certificate in U.S. institutions of higher education. Muskie/FSA Graduate Fellows matriculate in one- or two-year graduate programs in the fields of business administration, economics, education, environmental policy and management, international affairs, journalism and mass communications, law, library and information science, public administration, public health, or public policy. In addition, fellows are eligible to participate in professional internships and to receive limited practical training after the completion of their master's-degree program if the training will lead to a permanent job with the same company back in their home country. A variety of activities are available to alumni of the Muskie/FSA Program, including a small-grants competition (the Local Initiative Grants Program) and Support for Community Outreach and University Teaching (SCOUT), which provides stipends to teach in institutions of higher education on a full- or part-time basis. In FY 2002, 338 fellowships were provided for Eurasian participants. Since the program's inception, more than 2,800 Fellows have completed the Muskie/FSA program and returned to their home countries with advanced U.S. degrees., 558739=From FY 1992 through FY 2002, DoD has budgeted a total of $4.0 billion for CTR assistance to the Eurasian states. Congress provided $400.2 million for the CTR program in FY 2002, with $289.6 million of this allocated for assistance to Russia, the largest recipient of CTR assistance. During FY 2002, DoD provided CTR assistance to the following Eurasian countries Russia, Ukraine, Moldova, Georgia, Kazakhstan, the Kyrgyz Republic, Tajikistan and Uzbekistan. The CTR program continues to enjoy strong support within the administration and in Congress for its important contribution to U.S. national security. Country-specific CTR activities are described in the country assessments in Part II of this report. Pursuant to legislative requirements, DoD provides separate, detailed annual reports on the CTR program to the U.S. Congress., 620703=Regional Experimental Support Centers (RESC): By the end of 2002, CRDF will have funded 20 RESC sites in Armenia (2), Azerbaijan (3), Georgia (4), Kazakhstan (3), Moldova (2), Russia (3), Ukraine (1), and Uzbekistan (2). The RESC program seeks to increase the capacity of selected research centers to support experimentalists in scientific and technological research that requires up-to-date and sophisticated equipment such as spectrometers, microscopes, x-ray diffractometers, and similar high-quality instrumentation. A condition of the program is that other applied or industrial research facilities must have equal access to the equipment., 472103=IIP Speakers/Specialists and Professionals in Residence in FY 2002, 712607=Examples of FY 2002 cross border and regional programs follow. For information about country-specific program activities, please see the country assessments in Part II of this report., 663289=With support from USAID, Carelift International provided Armenia, Azerbaijan, Belarus, Georgia, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Ukraine, and Uzbekistan with donated medical equipment, supplies and related training. Recipient institutions included organizations participating in the AIHA Health Partnerships Program and other organizations participating in high-priority USAID-funded health sector programs. The Carelift International program is designed to increase the appropriateness, effectiveness and sustainability of the donated medical equipment, thereby improving the delivery of primary health care in the region. During FY 2002, Carelift delivered $1.8 million in goods and services, bringing the FY 2000-02 total to $8.35 million., 499889=An important development in OTA's programming during FY 2002 was the expansion of the efforts of OTA's Financial Crimes Enforcement Policy Team. This team provides technical assistance in three main areas: (1) money laundering and terrorist financing; (2) anti-corruption policies and procedures; and (3) organizational development and training law enforcement entities to help them detect, investigate, and prosecute financial crimes. Utilizing FREEDOM Support Act (FSA) funds provided both directly and through the State Department's Bureau of International Narcotics and Law Enforcement Affairs (INL), OTA managed projects to combat corruption, money laundering, and the financing of terrorist activities in Armenia, Georgia, Moldova, Ukraine, and Russia., 644583=In FY 2002, DOE/NNSA continued its efforts to place the spent fuel assemblies from the BN-350 nuclear power plant in Aktau, Kazakhstan in safe and secure storage. These assemblies contain nearly three tons of weapons-grade plutonium. In FY 2002, the program focused on evaluating different options for BN-350 spent fuel transportation and storage. For additional details, please see the Kazakhstan country assessment in Part II of this report., 763409=From 1985-1990, the U.S. Congress appropriated to the Title VIII Program about $4.6 million annually in support of the activities listed above. In light of the dramatic changes in the region, Congress appropriated a total of about $10 million annually for FY 1991 to FY 1994. Subsequent allocations have been as follows:, 599850=This program originated with one Russian institute and now involves some 40 institutes across Eurasia, and continues to engage additional institutes and to start new project work. In consultation with other U.S. Government agencies, the Department of State provides overall program coordination and policy guidance, and also provides funds to support program activities carried out by the Departments of Health and Human Services (HHS), Agriculture (USDA), and the Environmental Protection Agency (EPA). The involvement of other U.S. Government agencies, including DoD, DOE, DHHS, USDA, and EPA, provides technical and scientific expertise otherwise unavailable to the State Department. Through one-time transfer of $30 million from DoD in FY 2002, the State Department began the Bio-Industry Initiative, which focuses on the redirection of former BW production facilities toward peaceful uses and accelerated drug and vaccine development. The initiative aims to facilitate Russian-U.S. industry partnerships within the area of biotechnology and seeks to further develop elements of the infrastructure required to support a Russian biotechnology industry, while providing former weapon scientists an opportunity to move toward longer-term self-sustainability through civilian employment., 568451=Several initiatives are being taken to consolidate and strengthen the two programs during FY 2003 / FY 2004. In the aggregate, the Defense Department intends to:, 596631=In FY 2002, two NDF-funded projects totaling $1.1 million provided assistance to Moldova and Uzbekistan specifically. NDF continued to provide assistance for 4 additional projects in Russia, Kazakhstan and Uzbekistan that were approved in prior years., 550280=The NRC, a small, independent federal agency, is a pioneer in providing nuclear safety and regulatory assistance to Europe and Eurasia. NRC's involvement began in 1988, 2 years after the accident at the Chornobyl Nuclear Power Plant. Following the breakup of the Soviet Union, NRC's nuclear safety assistance activities were broadened to include European and Eurasian countries within which Soviet-designed nuclear power plants were operated (Armenia, Bulgaria, Czech Republic, Hungary, Kazakhstan, Lithuania, Russia, Slovak Republic and Ukraine). Since FY 1992, NRC has received approximately $42.45 million in FREEDOM Support Act (FSA) funds to support nuclear safety assistance activities in the Eurasian countries. During FY 2002, NRC provided training to approximately 50 Russian, Ukrainian, Kazakhstani, and Armenian nuclear regulators, bringing the total number of regulatory officials trained by NRC since 1992 to approximately 800. For additional details, please see the Armenia, Kazakhstan, Russia, and Ukraine country assessments in Part II of this report., 257693=The purpose of the USAID-funded GTD and START projects is to provide U.S.-based, in-country, and third-country training programs to equip leaders and professionals in the countries of Eurasia with the skills and tools needed to guide their nations' transition to free-market economies and democratic governance. From 1993 to 1997, USAID-funded training programs were conducted under the NIS Exchanges and Training Project (NET) Project; from 1997 to 2001, under the GTD Project; and since 2001, under the START Project. All three projects have been implemented by the Academy for Educational Development (AED) in Russia, Armenia, Central Asia (Kazakhstan, Kyrgyz Republic, Uzbekistan, Tajikistan, and Turkmenistan), and Western Eurasia (Ukraine, Belarus, and Moldova). AED implemented the training project for Georgia and Azerbaijan under the NET and GTD contracts. Beginning in January 2002, the START Project was implemented by World Learning in these two countries., 631399=The Foreign Assistance Act of 1961, as amended, serves as the legislative mandate for Anti-Terrorism Assistance (ATA). ATA assistance provided to selected governments focuses on three major objectives: (1) enhancing the antiterrorism skills of friendly countries by providing training and equipment to deter and counter the threats of terrorism; (2) strengthening the bilateral ties of the United States with friendly foreign governments by offering concrete assistance in areas of mutual concern; and (3) increasing respect for human rights by sharing with civilian authorities modern, humane, and effective antiterrorism techniques., 559783=Since 1994, the U.S. Government has sought to promote our counterproliferation, demilitarization, and defense reform objectives by fostering dialogue and cooperation with CTR-eligible militaries. Currently, CTR-eligible countries are Armenia, Azerbaijan (following the waiver of the restrictions in Section 907 of the FREEDOM Support Act), Georgia, Kazakhstan, the Kyrgyz Republic, Moldova, Russia, Tajikistan, Ukraine, and Uzbekistan. Although the Secretary of State did not certify Russia in 2002, the President did sign a waiver in August 2002 with the result that a portion of the planned FY 2002 defense and military contacts were conducted until expiration of the waiver in October 2002. The Secretary of State did not certify Turkmenistan for FY 2002., 51887=Home » Under Secretary for Political Affairs » Bureau of European and Eurasian Affairs » Bureau of European and Eurasian Affairs Releases » Bureau of European and Eurasian Affairs Reports » U.S. Government Assistance to and Cooperative Activities with Eurasia » FY 2002 U.S. Assistance to Eurasia » III. Agency Overviews, Regional Program Assessments, 584297=ELOQUENT NUGGET 02 was held on June 2-16, 2002 at Washington, D.C. This seminar familiarizes partner nations with civilian democratic control of the military. Albania, Armenia, Azerbaijan, Bulgaria, Croatia, Estonia, Georgia, Ireland, Latvia, Lithuania, Romania, Slovakia, Slovenia, Sweden, Turkmenistan, and Ukraine participated., 562524=Under separate legislative acts in FY 1995 and FY 1997, the U.S. Congress directed the Secretary of Defense to develop and implement, with the U.S. Customs Service and the Federal Bureau of Investigation (FBI), two counterproliferation initiatives to provide training and technical assistance to NIS law enforcement, customs and border guard personnel. These two programs, the DoD/FBI Counterproliferation Program and the DoD / U.S. Customs Service Counterproliferation Program (known collectively as DoD International Counterproliferation Programs), are planned and developed by the Office of the Secretary of Defense; overseen by the National Security Council; coordinated with the Department of State; and implemented by the Defense Threat Reduction Agency (DTRA), the Federal Bureau of Investigation, and U.S. Customs., 506164=Building on its successes in providing assistance to individual enterprises, the FTF Program is working with both production and processing entities to strengthen specific sectors in an array of commodities. In FY 2002, Farmer-to-Farmer volunteers assisted 385 organizations representing 31,076 beneficiaries in the Eurasia region. Of those, FTF provided direct formal training to 8,384 individual producers, processors and rural credit specialists. Surveys of participating organizations showed that 83% increased annual production while 77% showed an increase in profits. FTF volunteers also assisted farmers and farm groups to formalize relationships and form 18 new organizations in the region this year, as well as helping 47 existing organizations to increase their memberships. Participating organizations surveyed indicated that 100% successfully intervened in government or business on behalf of their members. Volunteer assistance to the rural financial sector in the region increased credit opportunities for farmers and agribusinesses. Fifty-two percent of financial institutions surveyed reported an increase in their annual number of agricultural related loans and 83% improved their overall banking services to the agricultural sector. In addition, a large part of the FTF program in the Eurasian region is devoted to assisting women entrepreneurs and women farm-owners/managers. FTF volunteers have been instrumental in providing training and advice in management and accounting skills, technical and handicraft skills for rural women, and skills in dealing with the social needs of rural women. Of the 31,076 beneficiaries of FTF volunteer assistance in FY 2002, 43% are women., 224240=The ECA Bureau's secondary school partnership programs build sustainable institutional linkages between U.S. and Eurasian secondary schools through substantive collaborative projects and student and educator exchanges. These exchange programs are generally reciprocal three- to four-week group visits. The collaborative projects have a thematic focus and tangible outcomes, such as the production of new educational materials. In FY 2002, secondary school partnership projects focused on leadership development, applied economics, community service, civic education, journalism, health education, and environmental education. In FY 2002, the ECA Bureau awarded a total of eight grants under its two secondary school partnership programs to support 42 linkages. The Secondary School Partnership Program (SSPP) is competed openly, while the Secondary School Excellence Program (SSEP) promotes new and continuing linkages with the home institutions of TEA Program national winners and their U.S. counterparts. Under the SSEP, the schools of TEA winners are matched for the reciprocal exchange of students. These partner schools work on joint projects, many of which illustrate citizen involvement in their own governance. FY 2002 funding is enabling a total of 389 Eurasian and 380 U.S. students and teachers to benefit from these exchanges., 591693=With initial funding from the U.S. Defense Department's Cooperative Threat Reduction (CTR) Program, the Departments of Commerce, Energy, State, and Treasury (U.S. Customs Service) provided approximately $39 million in export control assistance to Russia, Ukraine, Kazakhstan, and Belarus through FY 1995. In FY 1996, funding responsibility for EXBS assistance shifted to the Department of State under the Nonproliferation and Disarmament Fund (NDF). In FY 1998, State Department funding for global EXBS assistance became a separate budget line-item under the Nonproliferation, Anti-Terrorism, De-mining, and Related Programs (NADR) account and was also funded as directed by Congress under the FREEDOM Support Act (FSA). In FY 2002, the total funding for EXBS in Department of State NADR and FSA accounts totaled $42.4 million, including $4.9 million in NADR funds and an estimated $37.5 million in FSA funds (including $17 million for EXBS assistance for Georgia as described below)., 428649=In FY 2003, the FEP will focus on selecting participants from universities in Russia, Kazakhstan, Uzbekistan, and Ukraine that have not yet participated in the FEP or similar programs, selecting additional participants from progressive universities to build a core of U.S.-trained staff at each institution, supporting U.S.-Eurasian university partnerships, and encouraging networking and information exchange among former FEP participants and with their U.S. host universities. In FY 2003, FEP plans to bring together all program graduates and participating U.S. faculty for a fourth program workshop in Moscow, and to expand the program to include the Kyrgyz Republic., 401799=USDA's Cochran Fellowship Program has been providing short-term agricultural training programs for Eurasian agriculturalists and policy-makers since 1993. Training programs are conducted in the United States for selected mid- and senior-level specialists and administrators in areas that help a country develop its own agricultural food system and strengthen agricultural trade linkages with U.S. agribusinesses. Training is implemented in conjunction with USDA agencies, agricultural trade and market development associations, universities, and private agribusinesses. In FY 2002, the Cochran Program provided training to 154 Eurasian participants from 11 countries—144 with FREEDOM Support Act (FSA) funding, bringing the total number of FSA-funded Cochran Fellows since 1993 to 1,314; and 10 with funding from USDA's Emerging Markets Program (EMP), bringing the total number of EMP-funded Cochran Fellows since 1993 to 654. EMP-funded Cochran Fellowships are targeted towards trade-related activities focusing mostly on food wholesale and retail training. Many training programs that had been scheduled for FY 2001 but were postponed due to the September 11 terrorist attacks were rescheduled for the first quarter of FY 2002: a total of 34 participants from the Eurasian region received training during the first quarter of FY 2002., 576011=COMBINED ENDEAVOR 02 was a HQ USEUCOM ISO PFP exercise planned and executed to identify, test, and document command, control, communications, and computer systems (C4) interoperability between NATO and PFP nations' military equipment. In an effort to standardize the communications technology among the participating countries, leading military experts conducted a series of exercises to test communications and computer capabilities among participating countries. COMBINED ENDEAVOR 02 consisted of five conferences and associated technical working group meetings as well as the exercise itself. The exercise was conducted on Lager Aulenbach in Baumholder, Germany from May 9-23, 2002., 493223=U.S. DEPARTMENT OF COMMERCE - GOOD GOVERNANCE PROGRAM In FY 2002 the Good Governance Program (GGP) expanded its activities in Russia, Central Asia, and the Caucasus. Business ethics initiatives were launched in the Russian Far East, Kazakhstan, and Uzbekistan, and GGP further developed its ethics initiatives in Armenia, Azerbaijan, and Georgia. In addition, Good Governance Program alumni in St. Petersburg and Samara continued their efforts to promote transparency and accountability in business through ethics and corporate governance initiatives. In FY 2002 GGP also began development of a business ethics manual. The manual will also address the issues of corporate social responsibility and corporate governance. A key aspect of the manual will be its hands-on application and relevance for small and medium-sized enterprises as well as large companies. In the coming years, pending availability of future funding, GGP will focus on developing sustainable initiatives in ethics, corporate governance and IPR and doing business outreach. In cooperation with the U.S. private sector, GGP will seek to develop a business ethics fellowship program to foster improvements in business ethics and partnerships by bringing ethics officers from U.S. companies to work directly with enterprises in Russia, the Caucasus, and Central Asia. Additionally, the program will seek to develop regional and interregional initiatives in Central Asia and the Caucasus on corruption issues. For additional details on this program, please see the country assessments in Part II of this report., 58432=The Network is a source of information on anti-corruption initiatives, legislation, public documents, reports and surveys, success stories, and best practices, and monitors donor activities in this field. The Network sponsored its fourth annual meeting in 2002, with civil society and government participants from countries in Europe and Eurasia. Publications released in 2002 included a comparative study of the development of competitive public procurement systems in countries in the region, and, in coordination with the OECD Development Assistance Committee (DAC), seven country case studies analyzing experiences from donor-supported programs that fight corruption., 212588=The ECA Bureau's Teaching Excellence Awards (TEA) Program recognizes and rewards talented secondary school teachers in the fields of English language and American studies in Armenia, Azerbaijan, Georgia, Kazakhstan, the Kyrgyz Republic, Russia, Tajikistan, Turkmenistan, Ukraine and Uzbekistan. Nominations are elicited in all oblasts (regions) of the participating countries, and nominees are screened by local committees. Regional winners receive educational equipment and materials for their schools. Those chosen as national finalists travel to the United States for a seven-week professional enrichment program. In summer 2002, about 500 regional winners were honored, and 105 national winners participated in the U.S. program, at which time they had a chance to interact with 31 American TEA participants—all winners of independent U.S. teacher competitions. A total of 28 U.S. teachers then traveled to Russia, Ukraine, Kazakhstan, the Kyrgyz Republic, Georgia, Azerbaijan, Armenia and Turkmenistan on two-week professional programs in October 2002. The TEA Program is administered by the American Councils for International Education (ACTR/ACCELS). Professional development programs for the Eurasian national finalists were organized in summer 2002 by the University of South Carolina, University of California at Chico, and Montana State University. TEA Program alumni remain active in sharing what they have learned with colleagues, students and community members by giving presentations, organizing seminars, publishing articles, and taking leadership roles in professional organizations., 555549=EcoLinks' grants program provides small quick-response awards (QRAs) to assist in partner matching and larger challenge grants to support feasibility studies and capacity building in environmental management. In FY 2002, EcoLinks awarded 18 QRAs valued at more than $77,000 and 20 challenge grants totaling over $980,000 in the Eurasian countries. In FY 2002, EcoLinks realized more than $9.2 million in trade and private-sector loans to the region, including purchases of nearly $600,000 in U.S. goods and services., 502346=In FY 2002, the U.S. Department of Treasury contributed $5 million in FREEDOM Support Act (FSA) funds to the small and medium enterprise activities of the European Bank for Reconstruction and Development (EBRD). The United States contributed $3 million to the Russian Small Business Fund (RSBF) to fund technical assistance to banks that provide loans to micro and small entrepreneurs (MSEs). EBRD offers loan funds in conjunction with the donor-funded technical assistance. The program, which began in 1994, has supported over 100,000 loans to MSEs, and banks under the program are currently lending at a rate of 5,500 loans per month. Loans supported under the program range from $50 to $250,000 with the average loan size under $10,000. The FY 2003 funding will help the program to expand the number of cities where the RSBF operates from about 110 currently to 150 over the next 3 years., 724400=The Peace Corps' Small Projects Assistance (SPA) Program awards small community grants in support of PCV-implemented activities that help strengthen civic organizations, small businesses, educational institutions, and NGOs. In addition to the grants, SPA also provides resources and support for technical skills training to bolster the capacity of host-country citizens in the areas of technical expertise, community and NGO development, and small project design and management. Since its inception in FY 1996, the Eurasia component of the SPA Program has expended approximately $2.6 million to help build institutional capacity at the grassroots level. During FY 2002, the SPA Program authorized 177 community-level grants totaling $355,424 in the nine participating Eurasian countries (ten Peace Corps posts). Grants averaged just over $2,000, ranging from $200 to $5,000 per activity. This past year saw the continuation of a trend demonstrating significant host-country local contributions to the sustainability of activities undertaken., 144033=The Partners in Education (PiE) Program seeks to improve the content and methodology of civic education in schools in Armenia, Azerbaijan, Georgia, the Kyrgyz Republic, Ukraine and Uzbekistan. In FY 2002, the PiE Program provided opportunities for over 220 English-speaking civic education and social science teachers, administrators and teacher-trainers to learn about U.S. approaches to teaching civics. PiE participants are selected through an open, merit-based competition, and travel to the United States for a six-week program consisting of an intensive school-based internship and a series of professional development workshops. PiE participants stay with American families and are hosted by U.S. universities, secondary schools, and private organizations. The groups each produce curricula or lessons for their home institutions. In exchange for hosting the Eurasian educators, 20 U.S. host-school educators are eligible to participate in two-week follow-up programs in the Eurasian educators' home countries designed in collaboration with their counterparts., 715295=The Small Business Loan Program (SBLP): The SBLP provides loans to small and medium-sized businesses in Armenia and Ukraine. The program provides capital to the private sector and intensive, hands-on training to participant bank lenders in credit analysis and collection methodology. In FY 2002, the Ukraine SBLP continued its strong growth for a third year, disbursing 31 loans totaling $1.4 million and creating 132 jobs. The Armenian SBLP approved 31 loans totaling $1.3 million and created 317 jobs., 710562=The Foundation concentrates its grant making in three program areas: private enterprise development, public administration and policy, and civil society. In FY 2002, the Foundation continued its strategy to allocate a portion of grant resources to high-priority fields identified by local offices, with the remainder devoted to open-door grants. Across the Foundation, small and medium enterprise development, community development, and cross-border initiatives were identified as the most critical areas. The Foundation's plan to award institutional development grants that strengthen organizations to achieve financial independence was implemented during FY 2002. Institutional development grants are intended to help non-profit organizations in strategic fields to develop into mature entities, thus improving their performance and enhancing their program impact over the medium-term. The first of these grants was made in Azerbaijan to the Independent Consumers' Union, which will receive support over two years to strengthen its operations and acquire an independent food testing laboratory to support its work. All grant-making offices continue to work with organizations that might be eligible for institutional development assistance in the future. The headquarters office also made a number of strong partnership grants in FY 2002. Many of these grants resulted from field initiatives, and these jointly developed programs will provide a strong foundation in building the field offices' capacity to make larger grants. The largest of these partnerships, a two-phase $500,000 program to strengthen Kelajak Ilmi, the first private business education program in Uzbekistan, emerged from an extensive competition designed jointly by the Tashkent and D.C. offices. Grants to extend the markets of Central Asian artisans were made to PEOPLink and Aid to Artisans, grants that also emerged from field-driven initiatives in close coordination with the Almaty, Bishkek, and Tashkent offices., 578024=SEA BREEZE exercises focus on past annual engagement with the Ukrainian Naval Forces. SEA BREEZE, traditionally a Black Sea naval exercise, was moved to the Mediterranean in 2002 due to U.S. forces requirements. Ukrainians traveled to Naples and trained with NAVEUR. The exercises' purposes were to conduct interoperability and engagement training for maritime peace support operations; partner interoperability training during Peace Keeping Operations (PKO) involving Marines for Partner nations; and staff officer interoperability training for all participants to gain further understanding of NATO staff procedures / communications during a PKO. Twelve other nations - including seven NATO members and Russia were invited., 635194=Since 1992, the United States and Russia have worked together under DOE's MPC&A Program to prevent the theft or loss of nuclear material. For additional details on this program, please see the Russia country assessment in Part II of this report., 155950=The Hubert H. Humphrey Fellowship Program provides one-year grants to mid-career professionals from selected Eurasian countries as part of a worldwide program of U.S.-based graduate-level study and practical professional experience designed to develop leadership and management skills. The program is administered by the Institute of International Education (IIE). In FY 2002, a total of nine professionals from Eurasia (two from Armenia, and one each from Azerbaijan, Georgia, Moldova, Russia, Tajikistan, Turkmenistan, and Uzbekistan) were awarded Humphrey Fellowships., 715872=The Economics Education and Research Consortium (EERC): The EERC was created in 1996 to encourage professional policy research and improved economic policy-making in Ukraine and Russia. In Ukraine, the EERC supports a master's degree program in economics at the National University of Kiev-Mohyla Academy, which has produced 165 graduates to date. In Russia, the EERC supports small research grants and a series of complementary activities that help build a professional community of Russian economists. As of October 2002, the program has supported 250 research projects and 330 researchers., 491195=In FY 2002, BISNIS continued to promote vigorously other U.S. Government-funded business development programs and resources, especially the U.S. Department of Commerce's SABIT Program, the U.S. Commercial Service, and trade missions. BISNIS support and input also have fostered new relationships, activities, and projects for various other U.S. Government agencies, including the Trade and Development Agency, Export-Import Bank, Small Business Administration, and Overseas Private Investment Corporation. For country-specific details, please see the country assessments in Part II of this report., 160317=In FY 2002, the ECA Bureau's Office of International Visitors organized group and individual FSA Grant exchange programs for a total of 719 Eurasian participants. The IV Office also carried out base-funded group and individual IV programs for a total of 261 Eurasian participants in FY 2002., 712844=Regional Small Grants: The Foundation funds a number of cross border and regional activities through its small grants program. For example, as part of its efforts to promote cross border cooperation in the South Caucasus in FY 2002, the Foundation awarded a grant to a partnership between the three national associations of professional accountants and auditors in Armenia, Azerbaijan, and Georgia to encourage the regional harmonization of national accounting systems and financial reporting methods with international standards. As part of the project, the partner organizations will strengthen cooperative links and develop a consultative network among national professional associations and respective governmental agencies at the regional level., 682799=PRM's partners are UNHCR, OCHA, ICRC and several NGOs. PRM's contributions to UNHCR and ICRC in the region comprised more than 25% of those organizations' budgets. PRM earmarked a little more than $1.6 million to UNHCR for programs in Georgia, Armenia and Azerbaijan. PRM's un-earmarked contribution of $1.8 million to IOM also covers the South Caucasus. PRM also gave $149,900 to OCHA in Georgia, $219,302 to Action Against Hunger to assist IDPs in western Georgia, and $398,532 to the International Medical Corps (IMC) in Azerbaijan to assist IDPs., 581792=COOPERATIVE SUPPORT 02 was held on October 8-16, 2002 in Tallinn, Estonia. The exercise was designed to review NATO multinational combined joint task force logistic operations. Austria, Bulgaria, Estonia, Finland, the Former Yugoslav Republic of Macedonia, Latvia, Lithuania, Romania, Slovakia, Sweden, Switzerland, Ukraine participated., 654679=In FY 2002, State Department's Bureau of International Narcotics and Law Enforcement (INL), in coordination with other U.S. agencies, international assistance providers, and non-governmental organizations, continued to advance the goals of developing host nation capacities to fight international criminal activity, drug trafficking, corruption, and trafficking in persons, which undermine public institutions, hinder development, and foster the spread of international criminal and terrorist networks. INL managed and supported programs that achieved important objectives: developing more accountable law enforcement institutions, improving border and territorial controls, establishing new legal entities, and strengthening non-governmental organizations, judicial systems and other entities that promote the rule of law and human rights. The INL anti-crime and counter-narcotics programs in each country and throughout the Eurasian region are expanding with supplemental funding being provided to combat organizations that support or protect international terrorism and can destabilize newly developing nations., 439724=The goal of the State Department's Book Translation and Library Development programs is to help increase citizens' local access to information through both direct assistance to public libraries and support to commercial publishers to bring translations of U.S. books to the local market. In Azerbaijan and Russia, the U.S. Embassy Public Affairs Sections distributed much-needed materials in business, economics, civics, U.S. government and society, and English teaching, to libraries, schools, universities and other public institutions. Assistance to public libraries also included the provision of electronic resources and training for librarians in modern techniques. In Ukraine, the Public Affairs Section has established \"Windows on America\" Centers as partnerships between the U.S. Government and Ukrainian public libraries, with the regional libraries providing space and English-speaking staff members and the U.S. Government providing start-up capital to purchase a basic set of books and provide training for the local staff. The libraries also receive a grant for furniture and equipment, including a computer with Internet access, a printer, copy machine, and a CD-ROM drive. Each of the centers has five key information modules about the U.S. Government, U.S. reference materials, business, English-language teaching, and education. Four centers were opened in FY 2002, and three more are scheduled to open in early FY 2003. Similarly, FY 2002 funding will allow the U.S. Embassy in Turkmenistan to open two American Corners, which will conduct outreach and provide information about the United States to alumni of U.S. Government-funded exchange programs and the general public. American Corners are also typically based on partnerships between the U.S. Government and a local public library. The U.S. Government provides host institutions with books and CD-ROMs about America, Internet access, and hands-on training., 428047=In May 2002, a week-long agricultural extension workshop was organized in Poland by the Pennsylvania State University and the Polish Government. Seven Ukrainian FEP graduates and nine of their colleagues, including two rectors and two vice-rectors, participated in this event. All costs associated with the attendance of FEP graduates were paid by two Pennsylvania agribusinesses, Pennsylvania State University, the participants' universities, and the Polish Extension Service. This annual conference will be held in Vinnitsya, Ukraine, in FY 2003., 445645=The DRL Bureau's Human Rights and Democracy Fund (HRDF) supports innovative, cutting-edge programs that uphold democratic principles, support and strengthen democratic institutions, promote human rights, and build civil society in countries and regions of the world that are geo-strategically important to the United States. HRDF funds projects that have an immediate, short-term impact but that have potential for continued funding beyond HRDF resources. HRDF finances projects that \"push the envelope\" and are not usually included in traditional assistance programs by the regional bureaus or USAID. In FY 2002, HRDF provided $4.7 million for projects in Eurasia—$2.0 million in FY 2002 HRDF funds and $2.7million in prior-year funds. Examples of HRDF-funded crossborder and regional programs are provided below. For information about single-country HRDF-funded programs, please see the country assessments in Part II of this report., 574645=ADVEXC 02 (FY 2003) was an exercise for the Immediate Reaction Task Force (Land) (IRTF (L)) concept and was the third attempt by SHAPE and AMF(L) to incorporate Partner Nation forces. The exercise covered the full range of operations from Peace Keeping to Peace Enforcement (primary focus). The exercise occurred on October 2-18, 2002 in Ukraine, Yavoriv PFP Training Center. Fourteen NATO and partner nations participated or observed. Objectives were to exercise the AMF (L) in an Out of Area / Peace Support Operations (OOA/PSO) in an \"un-mandated\" scenario; (2) to exercise the integration of staff officers from partner nations into HQ AMF (L), BN GP and COY HQS; (3) to test and exercise NATO and national procedures for warning, alerting, and deploying the AMF (L) in OOA/PSO operations; (4) to familiarize participants with NATO planning and operational procedures within a multinational brigade in an OOA/PSO; (5) to train NATO and partner staffs in planning and conducting operations in a multinational OOA/PSO; (6) to practice procedures for deployment, employment, and re-deployment of AMF (L) in an OOA/PSO; and (7) to exercise and execute command, control, communications and information (C2I) procedures, including reporting for a NATO-led, OOA/PSO, and the application of the ROE., 587759=Conferences and Seminars: Warsaw Initiative funds pay for partner participation at U.S.-sponsored PFP / NATO conferences, seminars (such as those held at the Marshall Center), expert visits, exchanges, and other programs. Most PFP member-states are eligible to receive Warsaw Initiative assistance. Eligible Eurasian states include Albania, Armenia, Azerbaijan (following the waiver of the restrictions in Section 907 of the FREEDOM Support Act), Croatia, Georgia, Kazakhstan, the Kyrgyz Republic, Macedonia, Moldova, Russia, Tajikistan, Turkmenistan, Ukraine, and Uzbekistan. Most forms of U.S. assistance to the Government of Belarus, including WI, are currently suspended. While Tajikistan is now eligible for WI funding, no programs were conducted in FY 2002 although events such as a defense planning exchange and a regional airspace initiative are planned for FY 2003., 572894=These programs seek to address near-term problems which limit the ability of partners to engage in PFP activities; promote interoperability with NATO; defense reform; increase the level of participation in PFP exercises; and support efforts to deepen defense and military cooperation between the United States and NATO and their PFP partners. The funds used for the WI are DoD-budgeted operations and maintenance (O&M) funds. The Under Secretary of Defense for Policy and the Office of the Assistant Secretary of Defense (International Security Policy) are responsible for policy oversight of the Warsaw Initiative program for Eurasia. The Defense Security Cooperation Agency administers Warsaw Initiative funds. Support for Exercises and Related Activities: DoD WI funds partners countries' participation costs (travel, hotel, food, and other consumables such as fuel) in PFP or \"In the Spirit of PFP\" exercises in which U.S. forces are also participating. Over 50 PFP or \"In the Spirit of PFP\" exercises are conducted each year, including peacekeeping, humanitarian assistance deliveries, command post exercises, and field training exercises. Some examples of WI-funded exercises which were conducted in FY 2002, and were either hosted by Eurasian countries or included significant Eurasian participation, follow:}",
    "textBeforeTable": "Fulbright Scholars The Eurasian component of the State Department's Fulbright Program provides fellowships for U.S. faculty to teach in the Eurasian countries and research awards for Eurasian scholars to study in the United States. The program gives U.S. students an opportunity to study and conduct research in any of the Eurasian countries and students from Russia and Ukraine an opportunity to study in the United States. The Fulbright Program is administered through Fulbright Offices in Moscow and Kiev and by the Public Affairs Sections of U.S. Embassies elsewhere in Eurasia. Although the Fulbright Program emphasizes the humanities and social sciences, fellowships also are awarded in biology, chemistry, mathematics, medicine, and related fields. In addition to funding 71 U.S. scholars, 93 Eurasian scholars, 40 U.S. students, and 31 Russian and Ukrainian students in FY 2002, the program also provided materials for use by U.S. grantees at their Eurasian host institutions. Some 13 additional Eurasian faculty (five from Russia, three from Armenia, two from Kazakhstan, and one each from Belarus, Georgia, and Moldova) participated in the Fulbright Study of the United States Program. The Fulbright Program offers Eurasian scholars experience with diversity, perspectives on the American liberal arts curriculum, and a global network of personal and professional contacts. J. William Fulbright Program (ECA Base-Funded) ACADEMIC EXCHANGES In FY 2002, the ECA Bureau brought approximately 6,900 Eurasian citizens to the United States and sent",
    "textAfterTable": "37 Uzbekistan 3 5 8 Total 71 93 164 Fulbright Students Country U.S. Participants (Base-funded) Eurasian Participants (Base-Funded) Total Participants Armenia 2 0 2 Azerbaijan 1 0 1 Belarus 0 0 0",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}