{
    "relation": [
        [
            "",
            "Total Amount",
            "Ranking"
        ],
        [
            "G",
            "66",
            "10"
        ],
        [
            "A",
            "124",
            "10"
        ],
        [
            "+/-",
            "46",
            "1"
        ],
        [
            "PIM’s",
            "172",
            "7"
        ],
        [
            "PPP",
            "52",
            "11"
        ],
        [
            "SOG",
            "704",
            "10"
        ],
        [
            "Wins",
            "9",
            "12"
        ],
        [
            "GAA",
            "3.17",
            "12"
        ],
        [
            "SV%",
            "0.904",
            "9"
        ],
        [
            "SHO",
            "0",
            "12"
        ]
    ],
    "pageTitle": "Montreal Hockey Talk | Montreal Hockey Talk",
    "title": "",
    "url": "http://montrealhockeytalk.com/tag/montreal-hockey-talk/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 167006663,
    "recordOffset": 166943086,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{103636=Gallagher’s Gonads and Markov’s Bionic knee skated to a 5-5 deadlock this week. The tie in fantasy hockey is about as exciting as watching New Jersey’s Devils hockey circa 2000. I can say that both teams are still in playoff positions and if designing your teams in the NJ Devils trap style leads to overall titles at least they will be happy. GG’s goal scoring exploded this week for 15 goals with Kesler netting 3 and Kane, Subban, and Parise all hitting the twine twice. MBK had solid goaltending that gained him a sweep of those categories and allowed them to equal the offensive prowess of GG., 171141=EightFive tried to goon it up Ogie Oglethorpe style to gain the victory but #50in07 was having none of it. #50in07 used a strong work ethic on defense and Carey Price like goaltending to win Week 4. They were led by forwards Blake Wheeler (1G, 3A) and Jonathan Drouin (3A) on the offensive end, but the real magic this week was provided by the 2010 Olympic hero Roberto Luongo. He posted 2 wins, a paltry 0.97 GAA, and a sick .962 SV% for week 4. EightFive just couldn’t keep pace with that production on the back end but was able to net 13 PPP out of 27 total points. EightFive better figure out their problems because they are sitting in 9th place and they are out of the playoffs. Things can quickly turn desperate in the crazy world of fantasy hockey. #50in07 is holding strong in 5th place, but with all these teams so close in the standings, no spot is safe and every week matters., 255291=During the Sunday Shinny, Nick and Gary were joined by Ryan Szporer, featured columnist with Bleacher Report  to discuss the five Montreal Canadiens whom will be most important to a successful 2013-14 Season.  The boys also spoke to Derek Wills, play-by-play voice of the Hamilton Bulldogs, about the Bulldog’s 4-3 shootout loss and the promising performance of some of the Dogs new additions., 44811=PR epitomizes the absentee owner and this league could be in trouble if they decide to take an interest because they have some nice pieces. Considering they haven’t checked their team since Oct. 2nd the fact that they are tied for 1st in wins and have the best GAA in the league is remarkable. PR’s goalie trio could land them some help with their injury riddled forwards. Losing Nathan Horton and Patrick Sharp really hurts your bottom line but not making daily roster changes kills your chance of competing most of the time. Just moving Chara and Sharp into the empty IR spots until they get healthy and dropping Horton could add as many as 20 goals to their overall total. PR is dead last in 4 of 6 skater categories and in the other 2 they’re in 11th. I will say grabbing Rinne, Backstrom, and Tuukka Rask has led this team to having the best goaltending numbers overall in the league. Trading Rask or Rinne could grab them a top forward and a middle of the road goalie which combined with making daily roster changes could really turn this season around for PR.}",
    "textBeforeTable": "Gallagher Gonads (GG) is in 3rd place and is doing it solely on the backs of their core group of forwards. Being top 5 in 3 of the 6 offensive categories is helping them win but being 10th in 3 of 4 goalie categories hurts. Here’s how things are breaking down for GG: Gallagher Gonads (#3)   MSV is in the same boat as EI when it comes to why their team is winning and where they need to sure up some problem area’s. MSV is counting on the return of John Gibson to give their goaltending the boost it needs. When Gibson returns you can bet that MSV will be looking to move out valuable asset Jonathan Bernier for a PIM’s leader. They should make up ground in net with Elliot’s injury and Allen becoming the #1 in St Louis but, one can never count on injuries in fantasy hockey. MSV is winning for the same reasons that East Infection is in 1st. MSV’s top 3 draft picks (Alex Ovechkin, Carey Price, Max Pacioretty) are playing at or well above their expected level of play. They also nailed the late rounds of the draft and added key free agents like Tyler Taffoli, Jake Allen, and Nick Foligno. With things being so tight it will be interesting to see if MSV can catch East Infection. 5th 7th 6th 5th 1st 1st 6th 1st 4th 1st Ranking 0.918 1024 2.41 25 537 88 190 67 151",
    "textAfterTable": "GG is getting great production from everywhere in their draft. His offense is led by Patrick Kane, Nicklas Backstrom, Zach Parise, Tyler Bozak, and Ryan Kesler. They’re all playing at All-Star levels and are producing wins for GG. The problem they have is in net, the Mike Smith and Cory Schneider duo has been less than advertised. GG is in 10th place in 3 of 4 categories and that’s just not getting it done. Cory Schneider started out slow but has been good as of late but Mike Smith has been a total let down. Smith is currently being out played by as Coach K put it an AHL goalie in Devan Dubnyk. Hmmmm….. maybe GG should see if they can work a deal out for Bernier?   Parenteau Guidance (#4) Parenteau Guidance (PG) is in 4th place but goaltending issues might derail their bid for a championship. They are top 3 in 3 offensive categories but are in the bottom half or middle of the pack in every netminding stat. Here’s how things are breaking down for PG: G A +/- PIM’s PPP Hits Wins GAA SV’s SV% Total Amount 69 155 56 249 66 395 10 2.85 1025 0.915 Ranking 9 3 2 2 8 6 11 9 6 6 PG is off to a good start",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}