{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-27489",
            "0648-BE64",
            "120814338-2711-02"
        ]
    ],
    "pageTitle": "50 CFR Part 660, Subpart G - West Coast Groundfish | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/50/part-660/subpart-G?qt-cfr_tabs=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 914089211,
    "recordOffset": 914054125,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1126=Title 50 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{41791=NMFS issues this final rule for the 2015 Pacific whiting fishery under the authority of the Pacific Coast Groundfish Fishery Management Plan (FMP), the Magnuson Stevens Fishery Conservation and Management Act (Magnuson-Stevens Act), and the Pacific Whiting Act of 2006. This final rule announces the 2015 U.S. Total Allowable Catch (TAC) of 325,072 metric tons, establishes the tribal allocation of 56,888 metric tons of Pacific whiting for 2015, authorizes NMFS to reapportion unused tribal allocation to the non-tribal sectors earlier in the fishing season, establishes a set-aside for research and bycatch of 1,500 metric tons, and announces the allocations of Pacific whiting to the non-tribal fishery for 2015. This rule will ensure that the 2015 Pacific whiting fishery is managed in accordance with the goals and objectives of the Magnuson-Stevens Act, the FMP, the Pacific Whiting Act of 2006, and other applicable laws., 112149=This action revises regulations for the Pacific coast groundfish fishery with an implementation date of January 1, 2015. Final implementation of the 2015-2016 biennial harvest specifications and management measures will be delayed beyond January 1, 2015. NMFS has identified two issues that must be addressed prior to January 1, 2015, to prevent interruption of ongoing fisheries and to allow harvest of the total allowable and available groundfish. This action addresses those issues by revising groundfish regulations in two ways. First, this action reinstates a mechanism whereby NMFS can issue interim groundfish allocations at the beginning of the year in years when annual groundfish harvest specifications are not yet finalized, as is the case for January 1, 2015. Second, this action amends regulations to allow NMFS to issue that portion of the allowable catch currently allocated to an Adaptive Management Program (AMP) to quota shareholders until final criteria and a process for distribution of the AMP quota shares is developed and implemented., 107132=NMFS issues a final rule under authority of the Magnuson-Stevens Fishery Conservation and Management Act (MSA) to implement Amendment 18 to the Pacific Coast Salmon Fishery Management Plan for Commercial and Recreational Salmon Fisheries off the Coasts of Washington, Oregon, and California (FMP). Amendment 18 revises the description and identification of essential fish habitat (EFH) for Pacific salmon managed under the FMP, designates habitat areas of particular concern (HAPCs), updates information on fishing activities, and updates the list of non-fishing related activities that may adversely affect EFH and potential conservation and enhancement measures to minimize those effects. NMFS approved Amendment 18 on September 12, 2014., 252722=NMFS issues this proposed rule for the 2015 Pacific whiting fishery under the authority of the Pacific Coast Groundfish Fishery Management Plan (FMP), the Magnuson Stevens Fishery Conservation and Management Act (Magnuson-Stevens Act), and the Pacific Whiting Act of 2006. This proposed rule would allocate 17.5% of the U.S. Total Allowable Catch of Pacific whiting for 2015 to Pacific Coast Indian tribes that have a Treaty right to harvest groundfish, and would revise the regulation authorizing NMFS to reapportion unused allocation from the tribal allocation to the non-tribal sectors earlier in the fishing season., 278997=This proposed rule would establish the 2015-2016 harvest specifications and management measures for groundfish taken in the U.S. exclusive economic zone off the coasts of Washington, Oregon, and California, consistent with the Magnuson-Stevens Fishery Conservation and Management Act (MSA) and the Pacific Coast Groundfish Fishery Management Plan (PCGFMP). This proposed rule would also revise the management measures that are intended to keep the total catch of each groundfish species or species complex within the harvest specifications. This action also includes regulations to implement Amendment 24 to the PCGFMP, which establishes default harvest control rules for setting harvest specifications after 2015-2016., 81265=This final rule would establish the 2015-2016 harvest specifications and management measures for groundfish taken in the U.S. exclusive economic zone off the coasts of Washington, Oregon, and California, consistent with the Magnuson-Stevens Fishery Conservation and Management Act (MSA) and the Pacific Coast Groundfish Fishery Management Plan (PCGFMP), and approve Amendment 24 to the PCGFMP. This final rule would also revise the management measures that are intended to keep the total catch of each groundfish species or species complex within the harvest specifications. This action also includes regulations to implement Amendment 24 to the PCGFMP, which establishes default harvest control rules for setting harvest specifications after 2015-2016., 341962=This proposed rule would revise regulations for the Pacific Coast Groundfish fishery with a target implementation date of January 1, 2015. Final implementation of the 2015-2016 biennial harvest specifications and management measures will likely be delayed beyond January 1, 2015. NMFS has identified two issues that must be addressed prior to January 1, 2015, to prevent interruption of ongoing fisheries and to allow harvest of the total allowable groundfish catch. This action would address those issues by revising groundfish regulations in two ways. First, this action would replace language that was inadvertently deleted after a series of temporary rulemakings. This would reinstate a mechanism whereby NMFS can issue interim groundfish allocations at the beginning of the year, allowing the Pacific coast groundfish fishery to continue in years when annual groundfish harvest specifications are expiring and new ones are not yet finalized, as is likely for January 1, 2015. Second, this action would amend regulations to extend NMFS' authority to issue the full shorebased trawl allocation of groundfish to current quota share holders in the Shorebased Individual Fishing Quota Program. Specifically, the rule would allow NMFS to issue that portion of the allowable catch currently allocated to an Adaptive Management Program (AMP), to quota share holders until final criteria and a process for distribution of the AMP quota shares is developed and implemented., 140177=§ 1801 - Findings, purposes and policy, 127082=NMFS is reopening the U.S. commercial fishery for Pacific bluefin tuna (PBF) in the eastern Pacific Ocean (EPO) until the 500 metric ton (mt) catch limit is reached. If the 500-metric ton limit, which was established under the Tuna Conventions Act (TCA) and regulations implementing Resolution C-13-02 of the Inter-American Tropical Tuna Commission (IATTC) in the EPO, is not met, the fishery will close on December 31, 2014. This reopening of the fishery vacates the closure made by NMFS on September 5, 2014. Following the closure, NMFS received updated information indicating that only 404 mt of the 500 mt catch limit was caught. Thus, the closure was imposed prematurely. This rule also imposes a 1 mt trip limit on retention of PBF in the EPO by commercial vessels as an emergency action under the Magnuson-Stevens Fishery Conservation and Management Act (MSA)., 36924=NMFS is prohibiting fishing with large-mesh drift gillnet (DGN) gear ( ≥ 14 inches mesh) off the coast of southern California east of 120° W. meridian from the effective date of this rule through August 31, 2015. This prohibition is based on the Assistant Administrator for Fisheries' (AA) determination that El Niño conditions are occurring off the coast of southern California. This action protects Endangered Species Act (ESA)-listed loggerhead sea turtles ( Caretta caretta ), specifically the endangered North Pacific Ocean Distinct Population Segment., 52418=Through this action NMFS is prohibiting directed fishing for Pacific sardine off the coasts of Washington, Oregon and California. This action is necessary because the adjusted non-tribal directed harvest allocation of approximately 5084 metric tons (mt) for the third harvest allocation period from January 1, 2015, through June 30, 2015, is projected to be reached by the date of closure. From the effective date of this rule through June 30, 2015, Pacific sardine may be harvested only as part of either the live bait or tribal fishery or incidental to other fisheries; the incidental harvest of Pacific sardine is limited to 45-percent by weight of all fish per trip. Fishing vessels must cease fishing (be at shore and in the process of offloading) at or before the effective date of this closure., 17018=NMFS issues this final rule to implement annual management measures and harvest specifications to establish the allowable catch levels ( i.e. annual catch limit (ACL)/harvest guideline (HG)) for the northern subpopulation of Pacific sardine (hereafter, simply Pacific sardine), in the U.S. exclusive economic zone (EEZ) off the Pacific coast for the fishing season of July 1, 2015, through June 30, 2016. These specifications were determined according to the Coastal Pelagic Species (CPS) Fishery Management Plan (FMP). This action includes a prohibition on directed non-tribal Pacific sardine commercial fishing for Pacific sardine off the coasts of Washington, Oregon and California, which is required because the estimated 2015 biomass of Pacific sardine has dropped below the cutoff threshold in the HG control rule. Under this action Pacific sardine may still be harvested as part of either the live bait or tribal fishery or incidental to other fisheries; the incidental harvest of Pacific sardine will initially be limited to 40-percent by weight of all fish per trip when caught with other CPS or up to 2 metric tons (mt) when caught with non-CPS. The ACL for 2015-2016 Pacific sardine fishing year is 7,000 mt. This rule is intended to conserve and manage the Pacific sardine stock off the U.S. West Coast., 62521=NMFS issues a final rule to update management reference point values for Southern Oregon coastal Chinook salmon, Grays Harbor fall Chinook salmon, and Willapa Bay natural coho, as recommended by the Pacific Fishery Management Council (Council) for use in developing annual management measures beginning in 2015., 47046=Through this final rule NMFS establishes fishery management measures for the 2015 ocean salmon fisheries off Washington, Oregon, and California and the 2016 salmon seasons opening earlier than May 1, 2016. Specific fishery management measures vary by fishery and by area. The measures establish fishing areas, seasons, quotas, legal gear, recreational fishing days and catch limits, possession and landing restrictions, and minimum lengths for salmon taken in the U.S. exclusive economic zone (EEZ) (3-200 NM) off Washington, Oregon, and California. The management measures are intended to prevent overfishing and to apportion the ocean harvest equitably among treaty Indian, non-treaty commercial, and recreational fisheries. The measures are also intended to allow a portion of the salmon runs to escape the ocean fisheries in order to provide for spawning escapement and inside fisheries (fisheries occurring in state internal waters). This document also announces the availability of an environmental assessment (EA) that analyzes the environmental impacts of implementing the 2015 ocean salmon management measures., 331735=This ANPR announces a control date of June 23, 2014, that may be used as a reference for allocation decisions when considering potential future management actions to limit the number of participants in the large-mesh drift gillnet (DGN) fishery that targets swordfish and thresher sharks. The Pacific Fishery Management Council (Council) selected the June 23, 2014, control date based on discussions at its June meeting. The Council requested this ANPR to discourage speculative fishing effort as they review the current state-managed DGN limited entry program and consider establishing a federally-managed limited entry program for this fishery. This ANPR is intended to promote public awareness of the Council's interest and the potential for a future rulemaking., 336708=NMFS proposes to implement the annual catch limit (ACL), harvest guideline (HG), and associated annual reference points for Pacific mackerel in the U.S. exclusive economic zone (EEZ) off the Pacific coast for the fishing season of July 1, 2014, through June 30, 2015. This rule is proposed pursuant to the Coastal Pelagic Species (CPS) Fishery Management Plan (FMP). The proposed 2014-2015 HG for Pacific mackerel is 29,170 metric tons (mt). This is the primary commercial fishing target level. The proposed annual catch target (ACT), which will be the directed fishing harvest target, is 24,170 mt. If the fishery attains the ACT, the directed fishery will close, reserving the difference between the HG (29,170 mt) and ACT as a 5,000 mt set-aside for incidental landings in other CPS fisheries and other sources of mortality. This rule is intended to conserve and manage the Pacific mackerel stock off the U.S. West Coast., 141769=Title 50 published on 2014-10-01, 189152=NMFS proposes to implement annual management measures and harvest specifications to establish the allowable catch levels ( i.e. annual catch limit (ACL)/harvest guideline (HG)) for the northern subpopulation of Pacific sardine (hereafter, simply Pacific sardine), in the U.S. exclusive economic zone (EEZ) off the Pacific coast for the fishing season of July 1, 2015, through June 30, 2016. This rule is proposed according to the Coastal Pelagic Species (CPS) Fishery Management Plan (FMP). The proposed would include a prohibition on directed non-tribal Pacific sardine commercial fishing for Pacific sardine off the coasts of Washington, Oregon and California, which is required because the estimated 2015 biomass of Pacific sardine has dropped below the cutoff threshold in the HG control rule. Under the proposed action Pacific sardine may still be harvested as part of either the live bait or tribal fishery or incidental to other fisheries; the incidental harvest of Pacific sardine would initially be limited to 40-percent by weight of all fish per trip when caught with other CPS or up to 2 metric tons (mt) when caught with non-CPS. The proposed annual catch limit (ACL) for 2015-2016 Pacific sardine fishing year is 7,000 mt. This proposed rule is intended to conserve and manage the Pacific sardine stock off the U.S. West Coast., 86707=NMFS is issuing regulations that require use of a NMFS-approved vessel monitoring system (VMS) and institute a pre-trip notification requirement for West Coast large-mesh swordfish drift gillnet (DGN) vessel owners and operators. The DGN fishery operates under the authority of the Federal Fishery Management Plan for U.S. West Coast Fisheries for Highly Migratory Species (HMS FMP). Installing and operating VMS on vessels in this fishery will provide NMFS and law enforcement personnel with the ability to monitor the DGN fishery for compliance with conservation measures, efficiently deploy agents to inspect vessels, and provide the ability to more closely examine and compare the distribution of observed and unobserved fishing effort. The pre-trip notification will assist NMFS with timely and efficient placement of NMFS-trained observers on board DGN vessels. This action implements the recommendations of the Pacific Fishery Management Council (Council) and satisfies terms and conditions of the NMFS' 2013 Endangered Species Act (ESA) Section 7 Biological Opinion (Opinion)., 140359=§ 1803 - Authorization of appropriations, 140277=§ 1802 - Definitions, 67061=This action implements revisions to the Pacific Coast Groundfish Trawl Rationalization Program affecting the limited entry midwater trawl fisheries managed under the Pacific Coast Groundfish Fishery Management Plan (FMP). This action revises the primary season-opening date for the Shorebased Individual Fishing Quota (IFQ) Program midwater trawl fishery (targeting both whiting and non-whiting species) to May 15 north of 40°30′ N. lat. to the U.S./Canada border. This moves the season a month earlier for waters off the coasts of Washington and Oregon, and a month and half later for waters off the coast of northern California (north of 40°30′ N. lat.). This action increases consistency in the season start date along the coast and between the shorebased and at-sea midwater trawl fleets., 243062=NMFS proposes updates to management reference point values for Southern Oregon coastal Chinook salmon, Grays Harbor fall Chinook salmon, and Willapa Bay natural coho, as recommended by the Pacific Fishery Management Council (Council) for use in developing annual management measures beginning in 2015. This update is implemented as part of the 2014 methodology review where the Council and its advisory bodies considered new information on the three stocks of salmon to make a determination on whether changes to reference points for these stocks were warranted., 97372=NMFS implements the annual catch limit (ACL), harvest guideline (HG), and associated annual reference points for Pacific mackerel in the U.S. exclusive economic zone (EEZ) off the Pacific coast for the fishing season of July 1, 2014, through June 30, 2015. This rule is implemented according to the Coastal Pelagic Species (CPS) Fishery Management Plan (FMP). The 2014-2015 HG for Pacific mackerel is 29,170 metric tons (mt). This is the primary commercial fishing target level. The annual catch target (ACT), which will be the directed fishing harvest target, is 24,170 mt. If the fishery attains the ACT, the directed fishery will close, reserving the difference between the HG (29,170 mt) and ACT as a 5,000 mt set-aside for incidental landings in other CPS fisheries and other sources of mortality. This final rule is intended to conserve and manage the Pacific mackerel stock off the U.S. West Coast., 263418=This action would implement revisions to the Pacific Coast Groundfish Trawl Rationalization Program affecting the limited entry midwater trawl fisheries managed under the Pacific Coast Groundfish Fishery Management Plan (FMP). This action would revise the Shorebased Individual Fishing Quota (IFQ) Program regulations to change the primary season opening date for the shorebased whiting fishery and the shorebased non-whiting midwater trawl fishery to May 15 north of 40°30′ N. lat. to the U.S./Canada border. This moves the season a month earlier off Washington and Oregon, and a month and half later off northern California (north of 40°30′ N. lat.), increasing consistency in the season start date along the coast and between the shorebased and at-sea midwater trawl fleets., 27419=NMFS announces approval by the Office of Management and Budget (OMB) of collection-of-information requirements contained in regulations pertaining to the U.S. West Coast drift gillnet (DGN) fishery in a final rule that published on February 26, 2015, pursuant to the Paperwork Reduction Act of 1995 under OMB control number 0648-0498. The intent of this final rule is to publish the OMB control number for the collection-of-information requirements associated with the vessel monitoring system (VMS) regulations and to inform the public of their effectiveness.}",
    "lastModified": "Mon, 03 Aug 2015 05:05:46 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 44887 - Fisheries Off West Coast States; Highly Migratory Species Fisheries; Recreational Fishing Restrictions for Pacific Bluefin Tuna 2015-07-28; vol. 80 # 144 - Tuesday, July 28, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 50. Title 50 published on 2014-10-01. 75 FR 60995, Oct. 1, 2010, unless otherwise noted. Source: § 660.360 — Recreational fishery—management measures. § 660.353 — Recreational fishery—recordkeeping and reporting. § 660.352 — Recreational fishery—prohibitions. § 660.351 — Recreational fishery—definitions. § 660.350 — Purpose and scope.",
    "textAfterTable": "DEPARTMENT OF COMMERCE, National Oceanic and Atmospheric Administration Final rule. The final rule is effective July 30, 2015. 50 CFR Part 660 Summary The National Marine Fisheries Service (NMFS) is issuing regulations to modify the existing Pacific bluefin tuna (PBF) Thunnus orientalis recreational daily bag limit in the Exclusive Economic Zone (EEZ) off California, and to establish filleting-at-sea requirements for any tuna species in the U.S. EEZ south of Point Conception, Santa Barbara County, under the Magnuson-Stevens Fishery Conservation and Management Act (MSA). This action is intended to conserve PBF, and is based on a recommendation of the Pacific Fishery Management Council (Council). 2015-07-22; vol. 80 # 140 - Wednesday, July 22, 2015 80 FR 43336 - Fisheries Off West Coast States; Modifications of the West Coast Commercial Salmon Fisheries; Inseason Actions #14 and #15 GPO FDSys XML | Text Additional Documents",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}