{
    "relation": [
        [
            "",
            "Step 1",
            "Step 2",
            "Step 3",
            "Step 4",
            "Step 5",
            "Step 6"
        ],
        [
            "Command or Action",
            "configure terminal Example: Device# configure terminal Device(config)#",
            "ip igmp ssm-translate group-prefix source-addr Example: Device(config)# ip igmp ssm-translate 232.0.0.0/8 10.1.1.1",
            "show running-configuration igmp Example: Device(config)# show running-configuration igmp",
            "show ip igmp groups Example: Device(config)# show ip igmp groups",
            "show ip mroute Example: Device(config)# show ip mroute",
            "copy running-config startup-config Example: Device(config)# copy running-config startup-config"
        ],
        [
            "Purpose",
            "Enters configuration mode.",
            "Configures the translation of IGMPv1 or IGMPv2 membership reports by the IGMP process to create the (S,G) state as if the router had received an IGMPv3 membership report.",
            "(Optional) shows the running-configuration information, including ssm-translate command lines.",
            "(Optional) Displays the IGMP attached group membership for a group or interface, the default VRF, a selected VRF, or all VRFs.",
            "(Optional) Shows IP multicast routing table for default VRF.",
            "(Optional) Saves configuration changes."
        ]
    ],
    "pageTitle": "Cisco Nexus 7000 Series NX-OS Multicast Routing Configuration Guide - Configuring IGMP [Cisco Nexus 7000 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/sw/nx-os/multicast/configuration/guide/b_multicast/b_multicast_chapter_011.html?referring_site=smartnavRD",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 369690603,
    "recordOffset": 369668065,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{35979=For detailed information about IGMPv2, see RFC 2236.}",
    "textBeforeTable": "Procedure For information about configuring multicast route maps, see Configuring Route Maps to Control RP Information Distribution. To configure route-map policies, see the Cisco Nexus 7000 Series NX-OS Unicast Routing Configuration Guide. 1 Use this command only when there is one receiver behind the interface for a given group. Note    Option that minimizes the leave latency of IGMPv2 group memberships on a given IGMP interface because the device does not send group-specific queries. When immediate leave is enabled, the device will remove the group entry from the multicast routing table immediately upon receiving a leave message for the group. The default is disabled. Immediate leave Only the match ip multicast group command is supported in this route map policy. The match ip address command for matching an ACL is not supported. Note    1 Option that configures a route-map policy to control the multicast groups that hosts on the subnet serviced by an interface can join. Access groups Access policy for IGMP reports that is based on a route-map policy.",
    "textAfterTable": "Caution    The device CPU must be able to handle the traffic generated by using this command. Because of CPU load constraints, using this command, especially in any form of scale, is not recommended. Consider using the ip igmp static-oif command instead. ip igmp static-oif {group [source source] | route-map policy-name} switch(config-if)# ip igmp static-oif 230.0.0.0 Statically binds a multicast group to the outgoing interface, which is handled by the device hardware. If you specify only the group address, the (*, G) state is created. If you specify the source address, the (S, G) state is created. You can specify a route-map policy name that lists the group prefixes, group ranges, and source prefixes to use with the match ip multicast command. Note    A source tree is built for the (S, G) state only if you enable IGMPv3. ip igmp startup-query-interval seconds switch(config-if)# ip igmp startup-query-interval 25 Sets the query interval used when the software starts up. Values can range from 1 to 18,000 seconds. The default is 31 seconds. ip igmp startup-query-count count switch(config-if)# ip igmp startup-query-count 3",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}