{
    "relation": [
        [
            "Patent application number",
            "20100152450",
            "20130184313"
        ],
        [
            "Description",
            "NICOTINIC ACETYLCHOLINE RECEPTOR LIGANDS AND THE USES THEREOF - The invention relates to pyridinyl nicotinic acetylcholine receptor ligands, compositions comprising an effective amount of a pyridinyl nicotinic acetylcholine receptor ligand and methods to treat or prevent a condition, such as depression and nicotine dependence, comprising administering to an animal in need thereof an effective amount of a pyridinyl nicotinic acetylcholine receptor ligand.",
            "NICOTINIC ACETYLCHOLINE RECEPTOR LIGANDS AND THE USES THEREOF - The invention relates to pyridinyl nicotinic acetylcholine receptor ligands, compositions comprising an effective amount of a pyridinyl nicotinic acetylcholine receptor ligand and methods to treat or prevent a condition, such as depression and nicotine dependence, comprising administering to an animal in need thereof an effective amount of a pyridinyl nicotinic acetylcholine receptor ligand."
        ],
        [
            "Published",
            "06-17-2010",
            "07-18-2013"
        ]
    ],
    "pageTitle": "Liu, IL - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/liu-il-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433836379,
    "recordOffset": 433789281,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{104252=Patent applications by Jianjun Liu, Aurora, IL US}",
    "textBeforeTable": "Jianhua Liu, Chicago, IL US //]]> BarDraw('2716996',['Patent applications by Jialing Liu, Palatine, IL US'],[[4,4,9,1]],['2010','2013','2014','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2716996\" align=\"center\"></div> </div> <canvas id=\"bg2716996\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jialing Liu, Palatine, IL US</p> <div class=\"bar2716996\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-19-2015</td> <td><a href=\"/patents/app/20150078190\">DEVICE AND METHOD OF ENHANCING DOWNLINK UE-SPECIFIC DEMODULATION REFERENCE SIGNAL TO FACILITATE INTER-CELL INTERFERENCE CANCELLATION AND SUPPRESSION</a> - Various devices and methods are provided that use enhanced downlink demodulation reference signals (DMRS) to facilitate inter-cell interference cancellation and suppression. Coordinated configuration of DMRS port assignments for transmission from cells in a group of neighboring cells is provided. Each cell's physical cell identification (PCID) is mapped with its corresponding assigned antenna port(s).</td> <td>20150078190</td> <tr> </tr> <td>11-13-2014</td> <td><a href=\"/patents/app/20140334320\">Systems and Methods for Network Adaptation Support in Wireless Network</a> - Embodiments are provided for implementing network adaptation schemes, including small cell on/off adaptation and transmission power control. In an embodiment method for supporting network adaptation, a network component receives a discovery reference signal (DRS) from a network controller that is in a switch-off transmission mode. The network component then performs measurements according to the DRS, and reports the measurements to a network associated with the network controller. In return, the network component receives a radio resource control (RRC) signaling from the network. The RRC signaling includes configuration information allowing a connection between the network component and the network controller. The network component then connects",
    "textAfterTable": "Jianjun Liu, Aurora, IL US Patent application number Description Published 20110002824 COMPOSITION AND METHOD FOR ENHANCING THE PRODUCTION OF CRYSTAL AGGLOMERATES FROM A PRECIPITATION LIQUOR - The present invention relates ways to increase the output of a high quality product from the precipitation liquor crystallization process exemplified through the aluminum hydroxide recovery processes such as the Bayer process. The invention is a method of increasing the size of precipitated of a liquor. The invention in one embodiment relates to the use of a crystal growth modifier compositions added to the precipitation process to increase the particle size distribution of the precipitated alumina trihydrate. 01-06-2011 20110200503 COMPOSITION AND METHOD FOR IMPROVED ALUMINUM HYDROXIDE PRODUCTION - An improved method and composition for producing aluminum hydroxide crystals from precipitation liquor, involves the addition of an emulsified crystal growth modifier comprising a C 08-18-2011 20130035405 COMPOSITION AND METHOD FOR ENHANCING THE PRODUCTION OF CRYSTAL AGGLOMERATES FROM A PRECIPITATION LIQUOR - The present invention relates to compositions and methods to increase the output of a high quality product from the precipitation liquor crystallization process exemplified through the aluminum hydroxide recovery processes such as the Bayer process. The invention is a method of increasing the size of precipitates from a liquor. The invention in one embodiment relates to the use of a crystal growth modifier compositions added to the precipitation process to increase the particle size distribution of the precipitated alumina",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}