{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "EVERYTHING! small campus but lots of nearby fun if you are driving",
            "Small but pretty good tasting food court",
            "I cant say because I never lived in a dorm",
            "Make new friends and allow yourself to use the resources Bowie offeres.",
            "A wonderful university which provides minority students with the ability to grow and pursue career in variuos fields"
        ]
    ],
    "pageTitle": "Bowie State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Bowie-State-University/reviews?_escaped_fragment_=/show/9586",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00039-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908237975,
    "recordOffset": 908180394,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28907=Always file your FAFSA really early (around December or January) for the following academic year. You will be happy you did so. For those wanting to live on campus, make sure to apply for housing early on as well., 310545=© 2015, Cappex.com, LLC, 40250=Not worth the $2000 to $5000 a semester it cost to stay in certain dorms.}",
    "textBeforeTable": "01/19/2010 Reviewer is A current student here. 11 out of 11 people found this review useful. 1 of 78 Jasmine from Clinton, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Login to rate or flag the reviews Tia from Converse, TX 10/13/2010 Reviewer is A current student here. 6 out of 6 people found this review useful. 2 of 78 Categories Comments Great for these types of students Commuters should join the commuter student association. Different groups for different majors. If you choose nursing, keep up with your grades because it is very competitive. Tips for prospective students Get a tutor early in the semester. Try to find something to get involved in. You determine how your year will be. Do not take early morning classes, they will catch up with you. Get to know fellow students and your professors. Bang for the buck The tuition is pretty low (around $3000 a semester) which is a big plus for the school. Am enjoying being here I am still trying to find things to get into because I am a commuter, but",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}