{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4"
        ],
        [
            "Mana",
            "70",
            "80",
            "90",
            "100"
        ],
        [
            "Cooldown",
            "120",
            "120",
            "120",
            "120"
        ],
        [
            "Range",
            "900",
            "900",
            "900",
            "900"
        ],
        [
            "AoE",
            "900",
            "900",
            "900",
            "900"
        ],
        [
            "Duration",
            "N/A",
            "N/A",
            "N/A",
            "N/A"
        ],
        [
            "Effects",
            "Persuades a creep up to level 3 that takes 50% extra damage from non-neutral units. 10% damage bonus.",
            "Persuades a creep up to level 4 that takes 50% extra damage from non-neutral units. 16% damage bonus.",
            "Persuades a creep up to level 5 that takes 50% extra damage from non-neutral units. Can persuade magic immune units. 23% damage bonus.",
            "Persuades a creep up to level 6 that takes 50% extra damage from non-neutral units. Can persuade magic immune units and Ancients. 30% damage bonus."
        ]
    ],
    "pageTitle": "[REMAKE] Traxex, the Drow Ranger - DotA Forums",
    "title": "",
    "url": "http://www.playdota.com/forums/showthread.php?t=711687",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 651049463,
    "recordOffset": 650999669,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The Drow Ranger is able to be quite a versatile fighter. She can provide constant support with her Frost Arrows to keep enemies pinned. She afflicts them with a poisonous Weakening Shot that amplifies the damage they take and silences them so they can't retaliate with spells once they're forced to fight. Her Gift of the Drow allows her to take control of a single creep that she desires, including the magic immune Mud Golems and Ancients, and passively increases her damage and that of units nearby and under her control. Her Extreme Conditioning grants her exceptional mobility and Agility needed to outwit opponents that would otherwise overpower her. You can say without a doubt that Traxex has more than one trick up her sleeve. Traxex was a skilled archer in her oppressive underground homeland, the Underdark, until she grew sick of her kin's evil ways and fled to the surface world. As a part of her resolution, she joined the Sentinel, bringing her excellent marksmanship to the fray. Some of her abilities include stripping magical beings of their voices, and enchanting her arrows with an icy cold. While such powers are valuable, her true origin will never cease to linger around in the judging eyes of others. Traxex",
    "textAfterTable": "Starting HP/MP: 473/195 Attack Range: 625 Sight Range: 1800/800 FROST ARROWS Type: active Targeting: Unit Hotkey: R Induces a freezing effect to the hero's attacks. Each attack slows the enemy's movement and attack rates.   Mana Cooldown Range AoE Duration Effects 1 12 0 625 N/A 1.5 seconds on Heroes (7 on creeps) Slows movement speed by 10% and attack speed by 10%",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}