{
    "relation": [
        [
            "Patent application number",
            "20090281789",
            "20100217582"
        ],
        [
            "Description",
            "SYSTEM AND METHODS FOR MAINTAINING SPEECH-TO-SPEECH TRANSLATION IN THE FIELD - A method and apparatus are provided for updating the vocabulary of a speech translation system for translating a first language into a second language including written and spoken words. The method includes adding a new word in the first language to a first recognition lexicon of the first language and associating a description with the new word, wherein the description contains pronunciation and word class information. The new word and description are then updated in a first machine translation module associated with the first language. The first machine translation module contains a first tagging module, a first translation model and a first language module, and is configured to translate the new word to a corresponding translated word in the second language. Optionally, the invention may be used for bidirectional or multi-directional translation",
            "SYSTEM AND METHODS FOR MAINTAINING SPEECH-TO-SPEECH TRANSLATION IN THE FIELD - A field maintainable class-based translation system and apparatus with components that ease use by linguistically untrained users is disclosed. The apparatus includes modules for recovering errors, extending and customizing language coverage and increasing the speed of effective communication."
        ],
        [
            "Published",
            "11-12-2009",
            "08-26-2010"
        ]
    ],
    "pageTitle": "Lane, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/lane-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00325-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440001383,
    "recordOffset": 439963262,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ian R. Lane, Pittsburgh, PA US 01-07-2010 RAPID SYNTHESIS OF TERNARY, BINARY AND MULTINARY CHALCOGENIDE NANOPARTICLES - A method for synthesizing a chalcogenide nanoparticle is provided. The method comprises reacting a metal component with an elemental chalcogen precursor in the presence of an organic solvent. The chalcogenide nanoparticles include ternary, binary and/or multinary chalcogenide nanoparticles and the metal component comprises metal halides or elemental metal precursors. The alkylamine solvent has a normal boiling temperature of above about 220° C. and an average particle size of from about 5 nm to about 1000 nm. 20100003187 Published Description Patent application number Hugh W. Lane, West Lafayette, IN US 03-17-2011 BIOPROSTHETIC VALVE HOLDER AND HANDLE WITH CUTTING MECHANISM AND METHOD OF USING SAME - A surgical apparatus for use with a prosthetic holder to which a prosthesis is secured by sutures. The apparatus includes an elongated handle having a grip end and a coupler end and defining a first aperture extending along a length from the grip end to the coupler end. The apparatus can also include a first shaft at least partially disposed within the first aperture with a first actuator at the grip end and a holder coupling mechanism at the coupler end. The apparatus can have one of a second shaft and a sheath disposed along the handle with a second actuator at the grip end and a cutting element at the coupler end. A",
    "textAfterTable": "Jeffrey Lane, Corvallis, OR US Patent application number Description Published 20080308706 Imaging device mounting apparatus - An imaging device mounting apparatus providing three-point stabilization is described. 12-18-2008 20090058987 Video camera calibration system and method - A video camera calibration system includes a video camera, having a fixed location and a variable viewing orientation with respect to a fixed object, and a video calibration target, integral with the fixed object and having a known position. The viewing orientation of the video camera can be adjusted by aligning the position of the video calibration target in a video image produced by the video camera. 03-05-2009 Jeffrey S. Lane, Moore, SC US Patent application number Description Published 20080248705 Processes for generating halamine compounds on textile substrates to produce antimicrobial finish - Provided herein are processes for topically applying an antimicrobial finish to a textile substrate, such as a yarn, a fabric, a composite, or an assembled article (for example, a garment). Specifically, the antimicrobial finish is based on hindered amine compounds that are applied in an aqueous bath (such as a commercial or home laundry setting), using the factors of pH and compound solubility to promote the formation of a durable antimicrobial halamine finish. Advantageously, the antimicrobial finish, which may be applied to fabrics made of any of a variety of fiber types and combinations of fiber types, has been",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}