{
    "relation": [
        [
            "Patent application number",
            "20120315843",
            "20120315844",
            "20120329388",
            "20120329389"
        ],
        [
            "Description",
            "Communications Device for Intelligently Routing Information Among Multiple User Interfaces - A near field communications (NFC) device is disclosed that intelligently routes NFC data from a NFC device between multiple user interfaces based upon a power level of its internal batteries. The communications device utilizes a communications device user interface to send and/or receive the NFC data from the NFC device when its internal batteries are sufficient to operate the communications device user interface. The communications device begins to route some of this NFC data from being sent and/or received by the communications device user interface to a NFC user interface as its internal batteries deplete. Eventually, all of the NFC data will be sent to and/or received by the NFC user interface as the internal batteries of the communications device become so depleted that they are unable to reliably operate the communications device user interface.",
            "TOUCHING AN ANTENNA OF A NEAR FIELD COMMUNICATIONS (NFC) DEVICE TO CONTROL ITS OPERATION - A near field communications (NFC) device is disclosed that interacts with other NFC devices to exchange information and/or the data. An operator may touch, or be sufficiently proximate to, an antenna module of the NFC device to operate and/or control the NFC device. The antenna module includes antenna components that are characterized by a corresponding characteristic impedance. The touch, or sufficient proximity, of the operator changes the corresponding characteristic impedance of antenna components. The NFC device may determine a location of the touch, or proximity, of the operator based upon this change. The NFC device may interpret the location of the touch, or proximity, of the operator as information from the operator to operate and/or control the NFC device.",
            "NFC-Enabled Devices to Store and Retrieve Portable Application-Specific Personal Information for Use with Computational Platforms - A method of providing, over a near-field communications link, portable application-specific personal information to a web-based application, includes storing a list of at least one web-based application, storing at least one set of credentials in a corresponding at least one memory region within an NFC-enabled device, each set of credentials associated with a corresponding web-based application from the list of web-based applications, disposing the NFC-enabled device within a near-field operational range of a computational platform, near-field communicating the list of web-based applications to the computational platform, and near-field communicating the plurality of sets of credentials to the computational platform. Alternative methods further include one or more of communicating commands to a near-field coupled computational platform, storing sets of cookies, and communicating sets of cookies to a near-field coupled computational platform. Commands may include reset the computational platform, restart the computational platform, perform a virus scan, and perform a malware scan.",
            "Measurement and Reporting of Received Signal Strength in NFC-Enabled Devices - An NFC-enabled device including tag emulation circuitry and reader emulation circuitry operates so as to provide a signal strength meter function. The signal strength meter function, in tag emulation mode, measures and reports on how well the tag is coupled to a third party reader field. In reader emulation mode, the signal strength meter function measures and reports how well the reader of the NFC-enabled device couples to a tag that is being read. One exemplary method includes detecting an NFC reader field, operating reader receiver circuitry at the NFC-enabled device so as to at least determine the strength of a signal received from the reader field, generating information representative of the determined strength of the signal received from the reader field at a first time, and performing one or more predetermined actions based at least in part on the one or more signals representative of the determined strength. Predetermined actions may include generating visual, audio, and/or other indications of the received signal strength."
        ],
        [
            "Published",
            "12-13-2012",
            "12-13-2012",
            "12-27-2012",
            "12-27-2012"
        ]
    ],
    "pageTitle": "Cox, GB - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cox-gb-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432378479,
    "recordOffset": 432352373,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50558=Patent applications by Ingemar J. Cox, London GB}",
    "textBeforeTable": "David Grant Cox, Newbury GB 08-07-2014 Reinforced Hose - A hose comprising a tubular body of flexible material arranged between an inner and outer helically wound wire. The hose further comprises an elongate member having opposing longitudinal edges, the elongate member being helically wound around the tubular body such that the opposing longitudinal edges of the layer are in an adjacent or overlapping arrangement, wherein each longitudinal edge includes a formation capable of interengaging with a cooperating formation on the opposing longitudinal edge, wherein the elongate member is provided at least one reinforcing member which extends along the longitudinal axis of the elongate member. 20140216591 Published Description Patent application number David Charles Cox, Thornton Heath GB 03-14-2013 Biomarkers - The use of HLA-DQA1 as a biomarker for predicting or determining the therapeutic efficacy of anti-TNF therapy. 20130064819 Published Description Patent application number Charles John Cox, Stevenage GB 06-21-2012 METHOD OF TREATING CANCER - Methods are provided of treating a human for cancer comprising administering at least one dose of lapatinib, or a pharmaceutically acceptable salt or composition thereof, to a patient, wherein said patient does not have one or more allelic polymorphisms selected from the group of: HLA-DQA1*0201, HLA-DQB1*0202, and HLA-DRB1*0701. Patients may also be free of genotypes in TNXB; rs12153855 and/or rs17207923. 20120156200 Published Description Patent application number",
    "textAfterTable": "David Grant Cox, Dorset GB Patent application number Description Published 20140065961 COMMUNICATIONS DEVICE FOR INTELLIGENTLY ROUTING INFORMATION AMONG MULTIPLE USER INTERFACES - A near field communications (NFC) device is disclosed that intelligently routes NFC data from a NFC device between multiple user interfaces based upon a power level of its internal batteries. The communications device utilizes a communications device user interface to send and/or receive the NFC data from the NFC device when its internal batteries are sufficient to operate the communications device user interface. The communications device begins to route some of this NFC data from being sent and/or received by the communications device user interface to a NFC user interface as its internal batteries deplete. Eventually, all of the NFC data will be sent to and/or received by the NFC user interface as the internal batteries of the communications device become so depleted that they are unable to reliably operate the communications device user interface. 03-06-2014 David Ian Cox, Wigan GB Patent application number Description Published 20110167942 Continuously Variable Transmission with Brake - A transmission is disclosed for a wheeled vehicle. The transmission has a rotary input ( 07-14-2011 David Kenneth Cox, Cheshire GB Patent application number Description Published 20100228028 PROCESSES FOR THE MANUFACTURE OF ROSUVASTATIN AND INTERMEDIATES - A process for the manufacture of a compound",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}