{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "There are a few places around campus that have food but town is only a few minutes away so that adds to the options.",
            "There is a wide variety of dorms, the only downside is that hardly any have air conditioning.",
            "You get what you put into it.",
            "It is a relatively small school that only has a few main building, but it is a close knit community of students. EVERYTHING is within walking distance so no need for a bike, but a car is pretty much necessary due to the fact that it's pretty far out. Campus is extremely safe and is rather nice!"
        ]
    ],
    "pageTitle": "Manchester University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Manchester-University/reviews?_escaped_fragment_=/show/36271",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912870519,
    "recordOffset": 912837378,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46287=MayDay weekend, right before spring semester finals, is so much fun. So many activities packed into the weekend. Also, our Jan Term is great for studying abroad for a month, or just focusing on one class instead of five or six at a time., 108341=I am in a variety of clubs and sports which keep me really busy. I have gone on several field trips with my clubs including a local organic farm, a nature conservancy, and New York City for the People's Climate March. I also attend Manchester Activity Council events when they seem interesting., 117366=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/10/2009 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 25 unanimous Check out reviews left by other students or leave your own review. You could win a free scholarship. Manchester University Reviews Manchester University › Indiana › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Ashlea from North Manchester, IN 05/06/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 2 of 25 Categories Comments Campus Safety Campus saftey deserves four stars. They always seem to be on time and they always do their jobs well. Greek Life There is no greek life on campus. Good and bad. Less hazing, but harder socialization. Clubs and Activities There is a wide variety of clubs and organizations on campus. You're almost sure to find something that peekes your interest. Great for these types of students People that prefer smaller schools. Also, if you're looking for teachers that actually know your name, this is the place for you. Bang for the buck Some would say what you get is not worth what you put",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}