{
    "relation": [
        [
            "Patent application number",
            "20120209969",
            "20120309450"
        ],
        [
            "Description",
            "Browser adjusting method and mobile terminal - The disclosure discloses a method for adjusting a mobile terminal browser, which comprises setting an upper threshold value and a lower threshold value of a downloading speed for a mobile terminal browser. The method further comprises: calculating a current average downloading speed of the mobile terminal browser; comparing the current average downloading speed with the upper threshold value and the lower threshold value of the downloading speed; resetting network parameters of the mobile terminal browser when the current average downloading speed is less than the lower threshold value of the downloading speed or greater than the upper threshold value of the downloading speed. The disclosure also discloses a mobile terminal. The disclosure optimizes the network parameters of the mobile terminal browser according to the current network environment, and simultaneously increases downloading efficiency and stability of the mobile terminal browser, thereby avoiding the process of manually setting the relative network parameters of the browser by a mobile terminal user according to different network environments, so that the browser is more humanized and user experience is greatly improved.",
            "Method for Controlling Communication States of Mobile Terminal and Mobile Terminal - The invention provides a method for controlling communication states of a mobile terminal and the mobile terminal. The method comprises: the mobile terminal receiving and storing a planned time period input by a user and a communication state corresponding to the planned time period through a specific setup interface; and the mobile terminal detecting whether the current time is in the planned time period, if yes, detecting whether the current communication state is consistent with the communication state corresponding to the stored planned time period, and if they are inconsistent, adjusting the current communication state to the communication state corresponding to the planned time period. The invention allows the user to set time planning and corresponding communication states in his mobile terminal according to his own work or learning needs, in order to avoid unnecessary disturbance from incoming calls and short messages while keeping normal communication in his leisure time."
        ],
        [
            "Published",
            "08-16-2012",
            "12-06-2012"
        ]
    ],
    "pageTitle": "Cheng, Shenzhen - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/cheng-shenzhen-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439339999,
    "recordOffset": 439282897,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Qun Cheng, Shenzhen CN 11-28-2013 METHOD OF SPLICING POLARIZED FILMS - The present invention discloses a method of splicing polarized films. The method includes steps of providing a substrate; attaching a first polarized film to the substrate; attaching a second polarized film to the substrate so that a side portion of the second polarized film is correspondingly overlapped with a side portion of the first polarized film; correspondingly cutting off the overlapped side portions of the first polarized film and the second polarized film; removing separated parts of the side portions from the first polarized film and the second polarized film; and performing a flatten treatment to the cut side portions of the first polarized film and the second polarized film. The method effectively reduces the interval between spliced polarized films so that the light leakage problem at the joint position is improved. 20130312902 Published Description Patent application number Quan Cheng, Shenzhen CN 07-23-2009 METHOD AND DEVICE FOR INVOKING EARPIECE APPLICATION PROGRAM - The embodiments of the present invention disclose a method and a device for invoking earpiece application program. The method includes: detecting whether an earpiece is connected or not; and displaying a prompt list of all applications supporting the earpiece in terminal equipment when detecting that the earpiece is connected. The embodiments of the present invention further disclose terminal equipment. 20090185675 Published Description Patent application number",
    "textAfterTable": "Rong Cheng, Shenzhen CN Patent application number Description Published 20100183140 Method and Apparatus for Double-Talk Detection - The present invention discloses a double-talk detection method and apparatus. The method includes: obtaining a far-end signal frame and a near-end signal frame; and detecting a talk state according to a spectrum difference between the far-end signal frame and the near-end signal frame. The apparatus includes: an obtaining module, adapted to obtain a far-end signal frame and a near-end signal frame; and a spectrum detecting module, adapted to detect a talk state according to a spectrum difference between the far-end signal frame and the near-end signal frame. With the present invention, the talk state is detected according to the spectrum difference between the far-end signal and the near-end signal. Even if nonlinear distortion exists, the precision of detection is not impacted, whereas, the greater the distortion is, the more precise the detection result and the better the detection performance will be. 07-22-2010 20110310896 METHOD FOR TRANSMITTING POLICY INFORMATION BETWEEN NETWORK EQUIPMENT - A method for transmitting policy information between network equipment, extending protocol types of messages in layer-2, layer-3 or a higher application layer between an IP-uplink broadband user access equipment and a BRAS so as to construct a PITP to bear policy information; a PITP message includes a policy information transmission type field, an operation type field and a policy information content field, and different types of policy information are",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}