{
    "relation": [
        [
            "Patent application number",
            "20090015860",
            "20100073728",
            "20120314256"
        ],
        [
            "Description",
            "METHODS AND SYSTEMS FOR IMPROVED JOB WORKFLOW PROCESSING - Methods and systems for improved workflow management for a related group of jobs. A group of related jobs are received from a job source and are processed independently and in accordance with an associated job type for each job. The jobs may be processed and reprocessed independent of all other jobs in the group and may be processed substantially concurrently or in parallel. A group workflow manager assures synchronization of the jobs to generate the expected order in the output. The synchronization is defined by synchronization actions processed as part of the workflow processing. The synchronization actions may be defined in the job type of each job, or in a group job type, or defined by user interaction.",
            "APPARATUS, SYSTEM, AND METHOD FOR PRINTING ON VARIABLE FORM MEDIA - An apparatus, system, and process for printing on variable form media are provided. Variable form media has a variety of physical configurations. Each physical configuration may have a unique print target for receiving printing. The apparatus, system, and process include a computer configured to receive text information. The computer organizes the text information as relocatable print data. The relocatable print data may be printed at one or more print targets on one or more variable form medias. Each print target has a distinct position, orientation, and dimensions. The computer further calculates spatial print data directed to a specific variable form media from the relocatable print data. The spatial print data specifies the position, orientation, and dimension of the relocatable print data. The apparatus, system, and process print the spatial print data on the variable form media. In addition, the apparatus, system, and process may render the spatial print data and the variable form media on a display.",
            "CUSTOMER-CONFIGURABLE WORKFLOW SYSTEM - Methods, systems, and apparatus for flexible, configurable job workflow processing. Features and aspects hereof provide for generating workflow models from configurable templates. The workflow models may include one or more phases, each comprising one or more processes, each process comprising one or more steps. The Phases, processes, and steps may all be defined by configuring parameters of corresponding templates. Information defining the workflow models and all job information for jobs to be executed are entries in an integrated database such that creation and update of workflow model information and job information is performed as simple database queries and updates."
        ],
        [
            "Published",
            "01-15-2009",
            "03-25-2010",
            "12-13-2012"
        ]
    ],
    "pageTitle": "Palmer, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/palmer-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00144-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433580319,
    "recordOffset": 433543684,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Dwight R. Palmer, Longmont, CO US 09-27-2012 DRINKING CUP LID - A drinking cup lid is disclosed. The drinking cup lid includes a body with a deck and an annular wall that depends downwards. The annular wall is adapted to insert into a drinking cup. A first gasket and a second gasket extend outward from the annular wall and are configured for sealing engagement with the drinking cup. A closure is pivotally attached to the annular wall and configured and arranged to pivot between a closed position, sealing the drinking cup closed, and an open position, opening the drinking cup. 20120241453 Published Description Patent application number Douglas Palmer, Warwick, RI US //]]> BarDraw('2869885',['Patent applications by Donald A. Palmer, Oliver Springs, TN US'],[[1,1,1,1,1,1]],['2006','2008','2010','2012','2013','2014'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2869885\" align=\"center\"></div> </div> <canvas id=\"bg2869885\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Donald A. Palmer, Oliver Springs, TN US</p> <div class=\"bar2869885\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-29-2014</td> <td><a href=\"/patents/app/20140147371\">CARBONATION OF METAL SILICATES FOR LONG-TERM CO2 SEQUESTRATION</a> - In a preferred embodiment, the invention relates to a process of sequestering carbon dioxide. The process comprises the steps of: (a) reacting a metal silicate with a caustic alkali-metal hydroxide to produce a hydroxide of the metal formerly contained in the silicate; (b) reacting carbon dioxide with at least one of a caustic alkali-metal hydroxide and an alkali-metal silicate to produce",
    "textAfterTable": "Patent applications by Dwight R. Palmer, Longmont, CO US Eric Clark Palmer, Richmond, VA US Patent application number Description Published 20100077529 ARTICLE, LAMINATE AND ASSOCIATED METHODS - An article includes a porous membrane having pores, a first selectively permeable coating supported by the membrane and a component protective against delamination of the selectively permeable coating from the porous membrane and/or any other coatings applied thereto. The first selectively permeable coating includes an antichemical, antibiological, antiradiological and/or antimicrobial agent. The protective component may be provided alone, or as an element of the first selectively permeable coating, or, a second selectively permeable coating. A laminate and methods of providing these are also provided. 04-01-2010 Gary L. Palmer, Shelley, ID US Patent application number Description Published 20090050718 Method for Micro-sizing Organic, Inorganic and Engineered Compounds - A method and system are provided herein for forming microparticles from plastic and elastomeric materials that cannot be reduced in size by conventional methods. The system includes a high-pressure liquid nitrogen energy source, a feeder for providing a preferred constant and uninterrupted feed to a mill, a preferred integral injection device to meter the feed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}