{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN"
        ],
        [
            "regulations.gov",
            "2014-21790",
            "2900-AP04"
        ]
    ],
    "pageTitle": "38 CFR 17.131 - Payment of abandoned claims prohibited. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/38/17.131?quicktabs_7=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00243-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 916773487,
    "recordOffset": 916748576,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1051=Title 38 published on 2014-07-01.}",
    "TableContextTimeStampAfterTable": "{59982=Title 38 published on 2014-07-01, 44133=The Department of Veterans Affairs (VA) amends its medical regulations concerning the copayment required for certain medications. But for this rulemaking, beginning on January 1, 2015, the copayment amount would increase based on a formula set forth in regulation. The maximum annual copayment amount payable by veterans would also increase. This rulemaking freezes copayments for 2015 at the current rate for veterans in priority categories 2 through 8, and thereafter resumes increasing copayments in accordance with the regulatory formula., 25880=This rulemaking adopts as final, without change, a proposed rule creating regulations for the Home Improvements and Structural Alterations (HISA) benefits program. Through the HISA benefits program, VA provides monetary benefits to disabled veterans for necessary home improvements and alterations. An increase in the HISA benefits limit was authorized by the Caregivers and Veterans Omnibus Health Services Act of 2010. This rulemaking codifies regulations governing the HISA benefits program and incorporates the increase in HISA benefits authorized by the 2010 Act., 48525=This document amends Department of Veterans Affairs (VA) regulations in order to implement a statutory mandate that VA provide health care to certain veterans who served at Camp Lejeune, North Carolina, for at least 30 days during the period beginning on January 1, 1957, and ending on December 31, 1987. The law requires VA to furnish hospital care and medical services for these veterans for certain illnesses and conditions that may be attributed to exposure to toxins in the water system at Camp Lejeune. This rule does not implement the statutory provision requiring VA to provide health care to these veterans' family members; regulations applicable to such family members will be promulgated through a separate notice., 77116=The Department of Veterans Affairs is correcting and clarifying a proposed rule that published in the Federal Register on June 17, 2015 (80 FR 34794)., 34968=The Department of Veterans Affairs (VA) is amending its medical regulations by making technical corrections to conform to the Veterans' Health Care Eligibility Reform Act of 1996 (Act of 1996). Currently VA regulations read that veterans receive only VA hospital care to treat medical conditions of eligible veterans. We are amending our regulation to clarify that VA provides hospital care and medical services to eligible veterans., 16149=The Department of Veterans Affairs (VA) amends its medical regulations implementing section 101 of the Veterans Access, Choice, and Accountability Act of 2014, which directed VA to establish a program to furnish hospital care and medical services through eligible non-VA health care providers to eligible veterans who either cannot be seen within the wait-time goals of the Veterans Health Administration or who qualify based on their place of residence (hereafter referred to as the Veterans Choice Program, or the “Program”). VA published an interim final rule implementing the Veterans Choice Program on November 5, 2014. Under current law, VA uses a straight-line or geodesic distance to determine eligibility based on place of residence. This interim final rule modifies how VA measures the distance from a veteran's residence to the nearest VA medical facility. This modified standard will consider the distance the veteran must drive to the nearest VA medical facility, rather than the straight-line or geodesic distance to such a facility., 39337=The Department of Veterans Affairs (VA) amends its medical regulations concerning its authority for eligible veterans to receive care from non-VA entities and providers. The Veterans Access, Choice, and Accountability Act of 2014 directs VA to establish a program to furnish hospital care and medical services through non-VA health care providers to veterans who either cannot be seen within the wait-time goals of the Veterans Health Administration or who qualify based on their place of residence (hereafter referred to as the Veterans Choice Program, or the “Program”). The law also requires VA to publish an interim final rule establishing this program. This interim final rule defines the parameters of the Veterans Choice Program, and clarifies aspects affecting veterans and the non-VA providers who will furnish hospital care and medical services through the Veterans Choice Program., 21003=The Department of Veterans Affairs (VA) adopts, with changes, the interim final rule concerning VA's Program of Comprehensive Assistance for Family Caregivers. VA administers this program to provide certain medical, travel, training, and financial benefits to caregivers of certain veterans and servicemembers who were seriously injured during service on or after September 11, 2001. Also addressed in this rulemaking is the Program of General Caregiver Support Services that provides support services to caregivers of veterans from all eras who are enrolled in the VA health care system. Specifically, changes in this final rule include a requirement that Veterans be notified in writing should a Family Caregiver request revocation (to no longer be a Family Caregiver), an extension of the application timeframe from 30 days to 45 days for a Family Caregiver, and a change in the stipend calculation to ensure that Primary Family Caregivers do not experience unexpected decreases in stipend amounts from year to year., 52814=The Department of Veterans Affairs (VA) is promulgating regulations to implement statutory authority to provide payment or reimbursement for hospital care and medical services provided to certain veterans' family members who resided at Camp Lejeune, North Carolina, for at least 30 days during the period beginning on January 1, 1957, and ending on December 31, 1987. Under this rule, VA will reimburse family members, or pay providers, for medical expenses incurred as a result of certain illnesses and conditions that may be attributed to exposure to contaminated drinking water at Camp Lejeune during this time period. Payment or reimbursement will be made within the limitations set forth in statute and Camp Lejeune family members will receive hospital care and medical services that are consistent with the manner in which we provide hospital care and medical services to Camp Lejeune veterans.}",
    "lastModified": "Mon, 03 Aug 2015 05:41:27 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 44859 - Update to NFPA Standards, Incorporation by Reference 2015-07-28; vol. 80 # 144 - Tuesday, July 28, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 38. Title 38 published on 2014-07-01. 61 FR 21966, May 13, 1996] [33 FR 19012, Dec. 20, 1968. Redesignated at Any informal claim for the payment or reimbursement of medical expenses which is not followed by a formal claim, or any formal claim which is not followed by necessary supporting evidence, within 1 year from the date of the request for a formal claim or supporting evidence shall be deemed abandoned, and payment or reimbursement shall not be authorized on the basis of such abandoned claim or any future claim for the same expenses. For the purpose of this",
    "textAfterTable": "DEPARTMENT OF VETERANS AFFAIRS Final rule. This regulation is effective August 27, 2015. The incorporation by reference of certain publications listed in the regulations is approved by the Director of the Federal Register as of August 27, 2015. 38 CFR Parts 17, 51, 52, and 59 Summary The Department of Veterans Affairs (VA) is amending its regulations incorporating by reference the National Fire Protection Association (NFPA) codes and standards. These codes and standards are referenced in VA regulations concerning community residential care facilities, contract facilities for certain outpatient and residential services, Medical Foster Homes, and State home facilities. To ensure the continued safety of veterans in these facilities, VA is continuing to rely upon NFPA codes and standards for VA approval of such facilities. This rulemaking updates our regulations to adhere to more recent NFPA codes and standards. 2015-07-22; vol. 80 # 140 - Wednesday, July 22, 2015 80 FR 43320 - Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards; Updating References GPO FDSys",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}