{
    "relation": [
        [
            "Citing Patent",
            "US8320303 *",
            "US8689239",
            "EP2336907A1"
        ],
        [
            "Filing date",
            "May 16, 2007",
            "May 20, 2009",
            "Nov 24, 2009"
        ],
        [
            "Publication date",
            "Nov 27, 2012",
            "Apr 1, 2014",
            "Jun 22, 2011"
        ],
        [
            "Applicant",
            "Alcatel Lucent",
            "Microsoft Corporation",
            "Software AG"
        ],
        [
            "Title",
            "Wimax network, wimax network element, and method of handling QoS requirements therein",
            "Dynamic event collection and structured storage",
            "Method for generating processing specifications for a stream of data items"
        ]
    ],
    "pageTitle": "Patent US7502845 - Event consumers for an event management system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7502845?dq=7,117,485",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 459613579,
    "recordOffset": 459572202,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{30047=This application claims the benefit of and is a continuation application of U.S. patent application Ser. No. 09/875,775, filed Jun. 5, 2001 (which issued as U.S. Pat. No. 7,412,501), which in turn claims the benefit of U.S. Provisional Application No. 60/210,330, filed Jun. 7, 2000.}",
    "textBeforeTable": "Patent Citations Although the description above uses language that is specific to structural features and/or methodological acts, it is to be understood that the invention defined in the appended claims is not limited to the specific features or acts described. Rather, the specific features and acts are disclosed as exemplary forms of implementing the invention. For purposes of illustration, programs and other executable program components such as the operating system are illustrated herein as discrete blocks, although it is recognized that such programs and components reside at various times in different storage components of the computer, and are executed by the data processor(s) of the computer. The invention has been described in part in the general context of computer-executable instructions, such as program modules, executed by one or more computers or other devices. Generally, program modules include routines, programs, objects, components, data structures, etc. that perform particular tasks or implement particular abstract data types. Typically the functionality of the program modules may be combined or distributed as desired in various embodiments. Computer 442 typically includes at least some form of computer readable media. Computer readable media can be any available media that can be accessed by computer 442. By way of example, and not limitation, computer readable media may comprise computer storage media and communication media. Computer storage media includes volatile and nonvolatile, removable and non-removable media implemented in any method or technology for",
    "textAfterTable": "US6658465 Nov 23, 1999 Dec 2, 2003 Intel Corporation Method and apparatus for monitoring and controlling programs in a network US6662195 Jan 21, 2000 Dec 9, 2003 Microstrategy, Inc. System and method for information warehousing supporting the automatic, real-time delivery of personalized informational and transactional data to users via content delivery device US6829639 * Nov 15, 1999 Dec 7, 2004 Netvision, Inc. Method and system for intelligent global event notification and control within a distributed computing environment * Cited by examiner Non-Patent Citations Reference 1 \"IEEE standards for local and metropolitan area networks: supplemnt to LAN/MAN management, Discovery and dynamic control of event forwarding,\" Abstract form Inst. Electr. & Electron. Eng., Jul. 8, 1993, 1 pg. 2 \"Network PC System Design Guidelines\", by Compaq Dell Helwett Packard Intel and Microsoft published on Aug. 5, 1997, 148 pages. 3 Frankowski et al, \"Concurrency and Multi-Threaded Interaction in the Task-Script User Interface Model,\" Proceedings of",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}