{
    "relation": [
        [
            "Published Date",
            "Jun 12, 2014",
            "May 5, 2014",
            "Dec 16, 2013",
            "Mar 18, 2013",
            "Feb 19, 2013",
            "Nov 30, 2012",
            "Aug 28, 2012",
            "Jan 21, 2011",
            "Apr 18, 2008"
        ],
        [
            "Version",
            "9 (current)",
            "8",
            "7",
            "6",
            "5",
            "4",
            "3",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - TRAZODONE HYDROCHLORIDE- trazodone hydrochloride tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=4006d439-e2de-4590-82e9-fc9d56e3ec1b",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00166-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60635267,
    "recordOffset": 60593082,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{118342=• Abnormal Bleeding: May increase the risk of bleeding. Use with NSAIDs, aspirin, or other drugs that affect coagulation may compound this risk (5.7, 7)., 112044=Revised: 6/2014, 7218=Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088., 116677=• Discontinuation Symptoms: May occur with abrupt discontinuation and include anxiety and sleep disturbance. Upon discontinuation, taper trazodone hydrochloride tablets and monitor for symptoms (5.13)., 114559=• CYP3A4 Inducers (e.g., Carbamazepine): May necessitate higher dose of trazodone hydrochloride tablets (7)., 121576=• Starting dose: 150 mg in divided doses daily. May be increased by 50 mg per day every three to four days. Maximum dose: 400 mg per day in divided doses (2)., 19863=Rev. E 5/2014, 115363=or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch, 114760=• CYP3A4 Inhibitors: May necessitate lower dose of trazodone hydrochloride tablets (7)., 4928=Rev. B. 5/2014, 122558=Warnings and Precautions (5.12) 06/2014, 5727=For more information, call 1-888-838-2872., 28467=50 mg: White, round, compressed tablet, debossed “PLIVA 433” on one side and scored on the other side. Available in bottles of 100, 500 and 1000., 28302=100 mg: White, round, compressed tablet, debossed “PLIVA 434” on one side and scored on the other side. Available in bottles of 100, 500 and 1000 Tablets.}",
    "textBeforeTable": "Number of versions: 9 TRAZODONE HYDROCHLORIDE- trazodone hydrochloride tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Boxed Warnings, Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - Pliva Inc. (118234421) 09/30/1990 ANDA071525 ANDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 500 in 1 BOTTLE NDC:50111-441-02 2",
    "textAfterTable": "RxNorm TRAZODONE HYDROCHLORIDE- trazodone hydrochloride tablet RxCUI RxNorm NAME RxTTY 1 856364 traZODone HCl 150 MG Oral Tablet PSN 2 856364 Trazodone Hydrochloride 150 MG Oral Tablet SCD 3 856373 traZODone HCl 100 MG Oral Tablet PSN 4 856373 Trazodone Hydrochloride 100 MG Oral Tablet SCD 5 856377 traZODone hydrochloride 50 MG Oral Tablet PSN 6 856377 Trazodone Hydrochloride 50 MG Oral Tablet SCD Get Label RSS Feed for this Drug TRAZODONE HYDROCHLORIDE- trazodone hydrochloride tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=4006d439-e2de-4590-82e9-fc9d56e3ec1b To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}