{
    "relation": [
        [
            "England—",
            "Yorkshire...",
            "Elsewhere...",
            "",
            "Scotland...",
            "Wales and Monmouthshire...",
            "Total..."
        ],
        [
            "",
            "1,425,000",
            "2,851,000",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "",
            "Tons",
            "4,276,000",
            "982,300",
            "737,037",
            "5,995,337"
        ]
    ],
    "pageTitle": "Lalor, Cyclopaedia of Political Science, V.2, Entry 121, GREAT BRITAIN | Library of Economics and Liberty",
    "title": "",
    "url": "http://www.econlib.org/library/YPDBooks/Lalor/llCy512.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00329-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419646491,
    "recordOffset": 419577033,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{67=—For the composition of the so called lower house, and the changes wrought in it by the reform bills of 1832 and 1867, see HOUSE OF COMMONS.}",
    "TableContextTimeStampAfterTable": "{71985=—3d. Income Tax. The income tax is levied upon incomes of £100 per annum and upward. The net yield of this tax is estimated as averaging £1,100,000 per penny; so that a tax of nine pence on the pound will yield a revenue of £9,900,000. The income tax is levied upon incomes derived from rent of land or houses or other real estate, from commerce or professional services, or from salaries. The income tax was first established by the younger Pitt in 1798. At the end of the Napoleonic wars, in 1815, when its annual yield was about £14,000,000, it was abolished; and was not again imposed until 1842, when a deficit of £10,000,000 having rolled up in the course of five years. Sir Robert Peel laid a tax of seven pence in the pound on incomes of £150 and upward, for three years. Incomes in Ireland were exempted from this tax. In 1845, in order to assist Sir Robert Peel in his projects of commercial reform, the tax was continued; and since then it has from time to time been continued by special legislation, for various specific purposes. In 1853 Mr. Gladstone extended the tax to incomes of £100 and upward, besides extending its operation to Ireland. This arrangement was intended to last only until 1860; but the Crimean war intervening in 1854, it was found necessary not only to prolong the period of the tax, but to increase its rate even to sixteen pence in the pound. Since 1860, although the rate has been reduced to four pence, and although a tax of this kind is always and deservedly unpopular, the proper occasion for abolishing it altogether does not seem to have arrived., 141904=—V. POOR LAW. Down to the time of Henry VIII. the only institutions for public charity were the monasteries, which by distributing alms alleviated distress in a fitful and irregular manner. Upon the dissolution of the monasteries it was soon found desirable to establish some civil machinery for the relief of the poor, and various more or less ineffectual measures were passed during the sixteenth century, with this object in view, until at last in 1601 the famous statute 43 Eliz., c. 2, became the foundation of the modern English poor law. This statute provided that every parish should have a board of overseers of the poor, consisting of the churchwardens, together with from two to four householders to be appointed annually by the justices of the peace nearest at hand. It was the duty of these overseers to levy a \"poor rate\" upon the landed property in the parish, and to apply the proceeds of this tax, first, in setting to work indigent children and able-bodied persons without means of subsistence; and secondly, in relieving the aged or infirm or other poor people who were unable to work, and who had no parents, grandparents or children able to support them. Should any parish prove unable to furnish sufficient money for these purposes, the justices might make good the deficiency out of any other parish within the hundred; and if the resources of the hundred also were found inadequate to bear the burden, the deficiency might be made good out of some other part of the county. An appeal against the rates might be carried to the justices in quarter sessions. The overseers were further authorized to apprentice pauper children, and, with the consent of the lord of the manor, to build poor houses on the waste land of the parish. In cities and boroughs the mayor might exercise the powers herein granted to the justices of the peace. One evil result of this arrangement was that the well-regulated parishes had to carry a heavier burden than the poor and ill-managed parishes, as paupers were inclined to migrate from the latter to the former. This evil gave rise to what was known as the doctrine of settlement, in accordance with which it was provided in 1662 that, on complaint of the churchwardens or overseers, an indigent person coming into a parish might be compelled to return to the parish where he was born, or at least where he was last settled. Such abuses prevailed in the administration of this system of poor relief that in 1834 a new act was passed, placing the administration of the poor law under the control of a board of commissioners to be appointed by the crown. The powers lodged in this board passed through various vicissitudes into the hands of the local government board in 1871. By the act of 1834, and later acts, the board was authorized to insist upon the erection of workhouses in which able-bodied paupers should be compelled to reside; and, wherever necessary, to consolidate several adjacent parishes into a union, with a workhouse in common. Masters of workhouses and other wage-receiving officers of unions or parishes were made removable by the board, which was also empowered to provide for a thorough inspection of workhouses, and for a proper audit of the accounts of overseers. Each parish was to remain separately chargeable for the maintenance of its own poor. The effects of this act of 1834 were such that within three years from its passage the total annual expenditure for the relief of the poor was reduced from £6,317,253 to £4,044,741. The expenditure at the present time is over £8,000,000 annually for England and Wales; but in view of the enormous increase in wealth and population, this burden is much lighter than in 1834., 199308=—The following table shows the number of textile factories, and of operatives employed in them, in the three divisions of the United Kingdom, on Oct. 31, 1874:, 129250=—IV. CHURCH. The established church of England is the Protestant Episcopal, the fundamental doctrines of which are regarded as embodied in the thirty-nine articles, agreed upon in convocation in 1562, and finally settled in 1571. The separation of the English church from Rome, which was declared by Henry VIII., was consummated at the beginning of the reign of Elizabeth. The crown was declared by parliament to be the supreme head of the realm in matters spiritual as well as in matters temporal. The thirty-nine articles, together with the book of common prayer, were adopted as containing an authoritative statement of the cardinal tenets of the church. The dogma of transubstantiation was rejected, and with it were rejected works of supererogation, purgatory, indulgences, the worship of images and relics, the worship of the virgin and the saints, auricular confession, and the celibacy of the clergy; and communion in both kinds was allowed to the laity as well as to the clergy. An oath was required of all the clergy, as well as of all members of parliament and all public officials, recognizing the sovereign as the head of the church. At first there was no recognition of liberty of conscience; both Catholics on the one hand, and Calvinistic Puritans on the other, were subject to persecution. But the spirit of persecution is not congenial with the spirit of civil liberty which has always been so powerful in England; and by the eighteenth century complete toleration had begun to prevail. At the present day all sects are fully tolerated in England, and civil disabilities do not attach to any class of citizens for religious reasons., 189003=—The average number of domestic animals in the annual census taken on the 25th of June is about three million horses, ten million oxen and cows, thirty-three million sheep, and five million hogs., 171876=—IX. NAVY Down to the time of Henry VII., whenever it was necessary to have an armed fleet for the defense of the British or the assault of the French coasts, it was customary to press merchant vessels into the service, very much as the United States government in 1861 appropriated New York ferry-boats to be used as gunboats. It was under Henry VIII. that the English navy first assumed a distinct existence, although nearly two centuries before, under Edward III., the English had won at Sluys a naval victory of the first magnitude, destroying the antagonist French fleet almost as thoroughly as at the Nile or at Trafalgar. The superiority of the English navy became pronounced in the reign of Elizabeth, and by the end of the seventeenth century was generally acknowledged, though the French and Dutch still held their position as formidable rivals. Since the middle of the eighteenth century the supremacy of the English navy over the waters of the earth has been undisputed. Until the reign of Anne the government of the navy was vested in the lord high admiral; but since then it has been administered by the board of admiralty, or \"Lords Commissioners for executing the office of Lord High Admiral.\" The board consists of five members who are always changed with every change of the government. The financial secretary of the board is also changed. The fixed administration, independent of the state of political parties, consists of two permanent secretaries, the controller of the navy, the accountant general, the directors of engineering and architectural works, of transports, of contracts, of naval construction, of naval ordnance, and of the medical department, and the superintendents of victualing and stores. The first lord of the admiralty, corresponding to our secretary of the navy, is always a member of the cabinet; he has supreme authority over the navy, and all questions of importance are left to his decision. The other members of the board are the senior naval lord, who is responsible for the discipline of the fleet, and directs its general movements; the third lord, who superintends the management of the dock yards and the building of ships; the junior naval lord, who superintends the transport and commissariat; and the civil lord, who is responsible for the accounts. Unlike the army, the existence of which has to be renewed every year by act of parliament, the British navy is a permanent establishment, and the statutes in accordance with which its discipline is maintained run in perpetuity, or until revoked or amended by the house of commons., 198363=—Until the nineteenth century the manufacture of woolen cloths was the principal industry of Great Britain. In 1801 the total manufactures of the country were valued at £60,000,000, of which woolens represented more than one-fourth. Since then the production has quadrupled. England and Scotland now consume in their mills one-fourth of the total wool clip of the world; the mills count more than 5,000,000 spindles and 279,000 operatives. The fluctuations in the wool trade from 1867 to 1880, inclusive, were as follows:, 204523=These tables show that while the commerce of the United Kingdom extends all over the world, its principal dealings are with few countries. More than one-half of all its commercial dealings are with six countries: the United States, France, India, Germany, Australasia, and the Netherlands. Our own country ranks first in the list; and the trade between Great Britain and the United States is more than twice as great as that between Great Britain and France, the second country on the list in the table of 1879. In other words, the commercial ties between Great Britain and the United States are more than twice as strong as the ties between any other two countries in the world; and their strength is rapidly growing year by year., 185536=In this table the ships marked with an asterisk were not yet launched at the beginning of 1881, but were expected to be finished in the course of the year. The Inflexible, built at Portsmouth and launched in 1878, is the most formidable war vessel that has ever existed. She is 320 feet in length and 75 feet in extreme breadth. In her central part a citadel 12 feet high, one-half above and one-half below the water, contains the engines and boilers, the hydraulic loading gear, the magazines, and the base of the rotating turrets. The walls of this citadel, 41 inches thick, consist of armor plates varying from 16 to 24 inches in thickness, with a strong teak backing. Within this armored citadel are the two turrets, 12 feet high and 28 feet in diameter. The turrets do not stand in line fore-and-aft, but are placed en échelon, so as to command a fore-and-aft fire from all the guns. Each turret holds two 81-ton guns, capable of firing a ball weighing 1,650 lbs., with a charge of 300 lbs. of powder. The vessels of the second class are designed for ocean warfare, but are inferior in power to those of the first class. The Polyphemus, now building at Chatham, deserves especial mention as representing an entirely new style of war ship. She may be described as simply a steel tube, deeply immersed, her convex deck rising but 4½ feet above the water line. She carries no heavy guns, her whole power being concentrated in a tremendous ram 12 feet in length. Besides the ram, the Polyphemus has three torpedo ports. The third class comprises a group of very swift and powerful cruisers. The ships of the fourth class are at present regarded as fit only for coast defense. Those of the fifth class were built for the most part between 1861 and 1863, and are now antiquated, except for the protection or destruction of mercantile fleets. Not a single vessel built prior to 1861 now remains in use in the British navy., 145859=—VI. PUBLIC INSTRUCTION. Public education has made great progress in Great Britain during the past half century, but has nowhere attained so high a level as has been reached in the northern United States. The difference in respect of illiteracy, moreover, between different counties of Great Britain is quite as marked as the difference between Massachusetts and Mississippi. The test usually applied is only an approximate one, consisting in ascertaining the proportion of men or women who are able to sign the marriage register. Judged by this test, the percentage of illiterate men in England in 1841 was 33, and the percentage of illiterate women was 49; but in 1876 the percentage of men was reduced to 16 and that of women to 22; and in 1877 the percentage of men was 15 and of women 20. In Scotland the percentage of illiteracy is much smaller, being 9 in the case of men and 18 in the case of women. In Ireland it is much greater, being 31 in the case of men and 37 in the case of women. Among the different parts of England the smallest percentage of illiteracy is found in Westmoreland, and next in Middlesex, while next in honorable mention come Surrey and Rutland. The highest percentage of illiteracy is found in Wales. As compared with the rest of Great Britain in respect to public education, Scotland has ever since the reformation been far in advance. The Presbyterian reformers ordered every parish to establish a primary school under the supervision of the minister, and these schools have been of immense benefit to the country. In 1871, out of 629,235 children in Scotland between the ages of five and thirteen years, 494,860 were enrolled as attending the public schools. An important measure toward the advancement of primary education in England was carried through parliament by Mr. Gladstone's government in 1870. In this act it is ordered that \"there shall be provided for every school district a sufficient amount of accommodation in public elementary schools available for all the children resident in such district, for whose elementary education efficient and suitable provision is not otherwise made.\" These schools are in each district placed under school boards invested with great powers, among others that of enforcing attendance at school upon all children between the ages of five and thirteen. The expenses of these schools are charged upon the local rates. Under the operation of this act we find that whereas in 1871 there were 9,521 schools, attended by 1,345,802 children, in 1879 there were 17,166 schools, attended by 2,594,995 children. The members of the school boards are elected for three years by the burgesses in boroughs or by the rate payers in parishes. The number of members varies from five to fifteen. They serve gratuitously, but are allowed indemnity for expenses or damages resulting from their service on the board. The board àppoints the instructors and any other necessary officials, it fixes their salaries, and can dismiss them when requisite. Instruction is not absolutely gratuitous, as in the United States, but there is a small charge for tuition, the rate being fixed by the board. If the parents of a child are too poor to pay the tuition fee, the board pays it for them; if it appears, on due inspection, that a district is too poor to bear the expense of tuition fees, the department of education authorizes the board to establish a school there which shall be entirely gratuitous. In 1879 the average amount of school fees paid by each scholar was 10s. 5¼d., equivalent to $2.50½. Scholars who distinguish themselves may continue their education in normal schools, where £23 are allowed for expenses in the case of a boy and £17 in the case of a girl., 140599=—In 1871 the census of Ireland showed the following distribution of sects: Roman Catholics, 4,141,933; Episcopalians, 683,293; Presbyterians, 558,238; Wesleyans, 41,815; Baptists, 4,643; Congregationalists, 4,485; Quakers; 3,834; Jews, 258; Miscellaneous, 19,035., 56807=—This final and unmistakable assertion of the supremacy of parliament has been further illustrated by the growth of modern cabinet government, which took its rise in the revolution of 1688. Before William III., the kings of England had had ministers, but up to his time each minister had been regarded as the personal servant of the crown so far as concerned the discharge of the duties of his own office. Each minister was separately responsible before the law, but that kind of collective responsibility whereby the whole group of ministers assume or resign office together had not yet been established. It was not even necessary that the various ministers should belong to the same political party, or should hold similar views on great questions of public policy. Under William III, began the practice of insuring practical co-operation between the crown and parliament by means of total changes in the ministry; and from this beginning it has gradually come to pass that the change of ministry is determined entirely in accordance with the will of parliament, and not at all with reference to the will of the sovereign; and thus it has further come to pass that the real executive power in England no longer resides in the crown but in the cabinet. A conflict between crown and parliament, such as occurred in the seventeenth century, could not occur at the present time, since all the active power of the crown has passed into its representative, the cabinet—a representative agent which changes in personality as often as the parliamentary majority changes. The crown, as such, is in England a mere \"survival\"; and such reasonable prospect of permanence as it has is mainly due to the very fact that it has become a mere survival. Yet from a practical point of view it can hardly be doubted that the abolition of the monarchy to-day need not modify in any essential respect the already well-established operation of cabinet government in England., 162813=The regular army of the United Kingdom in 1882, exclusive of India, consisted of 7,222 commissioned officers, 17,555 non-commissioned officers, trumpeters and drummers, and 108,217 rank and file; a total of 132,994 men of all ranks. The following table shows the composition of this force:, 90183=—3d. National Debt. The largest branch of national expenditure is that for the interest and management of the national debt. The origin of the national debt goes back to 1694, when the bank of England loaned the government £1,200,000 at 8 per cent. interest, in consideration of certain chartered privileges which were secured to it at about that time. During the past hundred years the expenditure on account of the debt has increased more than fivefold. The debt is partly funded, partly unfunded. The holders of the funded debt can not demand the payment of the principal, but only the annual interest, while the holders of the unfunded debt can call for payment of principal as well as interest. The funded debt has been funded partly in perpetuity, partly in terminable annuities. The perpetual annuities are redeemable on payment of the principal which they represent; but in the case of most of them the government can not exercise its right of redemption without giving at least a year's notice. The unredeemed principal of the perpetual funded debt amounted in 1871 to about £731,000,000. Of the terminable annuities, some are the outstanding balances of annuities of which the term was originally fixed, while others are brief annuities created by the government in exchange for loans of money applied to the redemption of the perpetual funded debt; so that the creation of a terminable annuity in this way is a step toward the payment of the debt., 74200=—5th. Land Tax. This is a tax of four shillings in the pound, or 20 per cent. on the annual income of all landed property. These figures seem enormous, but are really moderate enough. since the valuation upon which the tax is assessed is the valuation of the year 1692, which is a merely nominal figure when compared with the present value of estates. Besides this, in the same group of taxes, come the taxes upon dwelling houses, upon domestic servants, private carriages and horses, and various articles of luxury. Note of these taxes are levied in Ireland., 171359=—There is no conscription, or enforced military service, in Great Britain; the force of the army is maintained entirely by voluntary recruiting. The greatest abuse which had characterized the army administration, namely, the purchase of commissions, was abolished by Mr. Gladstone in 1871., 215459=It will be seen from this that the proportion of steamers is growing so rapidly that before very long the sailing vessels will be in the minority. The tendency of the merchant vessels is to increase in size and tonnage. The average tonnage has more than doubled since 1840, and in this way the nation has effected a saving of 123,000 seamen, as compared with the former number of hands to tonnage, as we may see from the following table:, 152902=—As regards the higher instruction, the two great universities at Oxford and Cambridge are subjects far too extensive and complicated to be treated, even in a cursory way, in a brief, sketchy article like the present. The university of London, founded in 1837, differs from these in giving no direct instruction; it simply examines candidates for a degree, and its examinations are very severe. Women are admitted as candidates. To this university, however, are attached two colleges, both situated in London. The one, known as University college, prepares pupils for the examinations, and is entirely unsectarian in its management; the other, called King's college, is Episcopalian in complexion. In Scotland there are four excellent universities, at Edinburgh, Glasgow, Aberdeen and St. Andrews., 45675=—But during the fifteenth century the power of parliament in both its houses received a shock through that terrible series of struggles known as the wars of the roses. These wars during a period of thirty years (1455-85) were carried on with an obstinacy and barbarity unequaled elsewhere in English history. The battles were distinguished for their enormous slaughter, that of Towton, March 29, 1461, having been probably the bloodiest battle ever fought on English soil. After each victory of either party followed a series of wholesale executions; such of the nobles as escaped death on the field were usually beheaded without mercy. So great was this slaughter that the first parliament of Henry VII. contained only twenty-nine lay peers. The old nobility, in short, was almost annihilated, both in person and in property; for along with the slaughter there went wholesale confiscations, and these confiscations added greatly to the disposable wealth of the crown. These events contributed in various ways to enhance the royal power at the expense of parliament. In the first place, the peers newly created by the Tudor kings were for a time inclined to be subservient to the crown; and this tendency was aided under Henry VIII. by the dissolution of the monasteries, which at once withdrew thirty-six abbots and priors from the house of lords, and thus eliminated another source of opposition to the royal authority. In the second place, the available wealth of the crown was so far increased by escheats and confiscations that it became for a time to some extent independent of the house of commons; it became unnecessary to summon parliaments quite so frequently as before. In the third place, the effect of thirty years of anarchy was to arouse in the people a feeling of intense loyalty to the Tudor sovereigns as the guarantors of order and peace. And this feeling was strengthened by the curious uncertainty as to the succession which prevailed through the Tudor period. Throughout the sixteenth century the terrible memories of the civil war of the fifteenth made people unusually sensitive to the evils of a disputed succession. It was this feeling which caused some of the most atrocious acts of Henry VIII. and his daughter Mary to be condoned. This feeling went far toward making the Tudor parliaments more subservient to the crown than any others which have ever assembled in England. \"Very different indeed,\" says Mr. Freeman, \"from the parliaments which overthrew Richard II. and Charles I. were the the parliaments which, almost without a question, passed bills of attainder against any man against whom Henry's caprice had turned, the parliaments which, in the great age of religious controversy, were ever ready to enforce by every penalty that particular shade of doctrine which for the moment commended itself to the defender of the faith, to his son or to his daughters.\", 191748=—The production of coal in 1879 was distributed as follows., 100058=—Lord Lieutenant. This officer is appointed by the crown (i.e., by the prime minister), and is chosen from among the principal noblemen residing in the county. He is assisted by one or more deputies whom he appoints himself, and who compose with him the lieutenancy of the county. He is the keeper of the rolls, and in this capacity takes part in the sittings of the justices of the peace. Down to 1871 he was commander of the militia, and appointed its officers, as well as those of the yeomanry and the volunteers; but in 1871 these prerogatives were transferred to the crown., 221511=At the end of 1879 between 5,000 and 6,000 miles of new lines were in process of construction in the different parts of the empire. The railways in the United Kingdom employ a force of 276,000 men. No less than 176 members of parliament are railway directors. From 1847 to 1873 the number of passengers killed per million steadily decreased; since 1873 it has risen, as is shown in the following table:, 179630=These estimates not being found quite sufficient, a supplementary grant for the navy, of £83,000, was made toward the close of the session of 1880., 215040=—The following table shows the distribution of the total amount of shipping into sail and steam, and also into home and foreign trade, for the years 1866 and 1879, omitting the intervening years:, 55858=—The second revolution, in 1688, finally settled the question as to where the ultimate authority in the English government resided. It settled it in much the same way that it had been settled in 1399 by the deposition of Richard II., but this time the questions at issue had been much more definitely propounded, and the solution was much more unmistakable. The turning out of Richard had been a plain assertion of the right of parliament to make and unmake kings; but the turning out of James, coming as it did within forty years from the overthrow and execution of his father, showed that henceforth the king of England could keep his place on the throne only on condition of \"governing by act of parliament.\", 134471=—There are about 12,000 parishes in England, besides something like 200 places ranked as extra-parochial. Every parish has a parish church, presided over by the rector, who is called the \"parson.\" He holds during life the freehold of the parsonage, with its manse and glebe-lands, and receives the tithes and other dues. But in some cases the benefice is annexed in perpetuity to some spiritual corporation, which thus appropriates the dues and becomes the patron of the living. A vicar is a person appointed by such a corporation, to hold the living as its lieutenant; in other respects the vicar does not differ from a rector. The patronage, or right of nomination to a benefice, is called the advowson, and is legally classified under the head of real property. Of the 11,728 benefices now existing in England and Wales, 1,144 are in the gift of the crown, 1,853 are presented by bishops, 938 by chapters, 931 by officers of metropolitan churches, 770 by the universities of Oxford and Cambridge, the colleges of Eton, Winchester and others, and 6,092 by lords, gentlemen and ladies in the enjoyment of private patronage. Rectors receive the whole revenue of their benefices; but vicars, as simple agents or delegates of the holders of the benefices, receive only a portion. By an act of 1871, when a parson who has held a living for seven years or more is incapacitated by physical infirmity from discharging his duties, he may be retired on a pension not exceeding one-third the revenue of the living., 149889=—In secondary as well as primary education Scotland takes the lead. Instruction is given in the \"borough schools,\" and in special industrial schools or mercantile colleges. The Andersonian university, founded in 1708 at Glasgow for scientific studies, is now an evening school where some 800 pupils receive instruction in penmanship, modern languages, book keeping, and elementary mathematics and physics. At Edinburgh the Watt institution, founded in 1821, teaches chemistry, physics, mathematics, modern languages, drawing and modeling; more than half the pupils are laboring men. There are something like twenty mechanics' institutes in Scotland; and schools of design have been established in many cities, of which that in Edinburgh is attended by 1,800 pupils. In England there are a great many higher schools established by private liberality and more or less richly endowed. In the first rank come the great schools of Eton with 800 pupils. Harrow with 520, and Rugby with 500, which were founded in the sixteenth century and are situated in the country; others, somewhat less celebrated, are situated at Winchester, London and Shrewsbury. The expense of living at these schools often reaches £200 per year, but there are systems of pecuniary aid analogous to those adopted in American colleges. More modern in character are the college of the city of London, founded in 1841, giving instruction in ancient and modern languages, mathematics and vocal music; the Owens college at Manchester, giving scientific and literary instruction; and the collegiate institution at Liverpool, which is at once a scientific school and a preparatory school for the universities. Among the institutions especially devoted to industrial training, a most conspicuous place is held by the public institution established in 1859 at South Kensington under the name of the \"Science and Art Department.\" This establishment comprises a normal school of design, a central school of design, and an industrial museum. Pupils in the normal school of design, after having passed six semi-annual examinations, are placed in charge of art schools established in different towns and cities of the United Kingdom. In 1871 there were 212,500 pupils studying in these art schools. In scientific instruction the department has made use of various \"mechanics' institutes\" and other popular courses of instruction which were already in existence. Deserving pupils obtain prizes and endowments for the purpose of pursuing their studies in the royal school of mines, the royal college of chemistry, the London laboratory of metallurgy, or the royal scientific college at Dublin. The courses of study comprise all the sciences, as well as architecture and the designing of machinery., 87802=The expenditure for the financial years 1868 and 1869 included supplemental appropriations for the Abyssinian expedition, amounting to £5,600,000, and the expenditure for 1874 included the sum of £3,200,000 paid for the Alabama claims under the treaty of Washington., 169823=One or two items of the foregoing table require a word of explanation. Beside the regular forces, the army estimates include appropriations for four classes of auxiliary and reserve forces, the titles of which appear in the table under that heading. In the year 1880-81 the total number of militia was 139,111; that of yeomanry, 14,511; that of volunteers, 245,648; and that of enrolled pensioners, etc., 47,000; making the total auxiliary force, 446,270. This, added to the regular army, 1880-81, makes a total of 553,370 men available for the military defense of Great Britain., 137032=—Of the entire population of England and Wales, about 14,000,000 belong to the established church, leaving about 11,500,000 to all other sects. Among the Protestant dissenters, the most numerous and influential are the Independents or Congregationists, the Wesleyans, and the Baptists. The Wesleyans have more than 9,000 places of worship, the Congregationalists about 3,500, and the Baptists about 2,000. Other dissenting sects of more or less social importance, are the Unitarians, Quakers and Moravians. There are about 1,000,000 Roman Catholics in England; and the Roman church has 14 dioceses there, all united in the socalled \"province of Westminster,\" and presided over by one archbishop and thirteen bishops. In Scotland the Roman church has three vicars. In 1877 there were 1,039 Catholic chapels in England, and 233 in Scotland., 189460=—The census of 1871 showed in Great Britain 549,784 farms of all sizes. Of this number 51.3 per cent. were farms of 20 acres and less, and 48.7 per cent. were larger farms. It is difficult to make a very precise estimate of the wages paid for agricultural labor, since the usages, the rates and the mode of payment differ considerably in different parts of the country. In some districts wages are paid in kind; in some places a certain amount of labor is given in exchange for rent. Wages paid in money range ordinarily from 12 to 15 shillings (i.e., from $2.88 to $3.60) per week., 140266=—In 1876 it was estimated that there were 51,250 Jews in Great Britain, of whom 39,883 resided in London., 214209=—Shipping. The number of vessels carrying the British flag was at the beginning of the present century greater than that of any other nation of ancient or modern times, and during the present century it has quadrupled. The following table exhibits the total shipping of the United Kingdom, both sailing and steam, and for both home and foreign trade, for years 1867-80:, 14123=GREAT BRITAIN. The official designation is \"The United Kingdom of Great Britain and Ireland.\" The greater island was known in Cæsar's time as Britain, a name of prehistoric (probably Iberian) origin and uncertain meaning. The inhabitants were called Britons by their Roman conquerors, but called themselves Kymry; their English conquerors afterward called them Welsh, or \"strangers.\" Another ancient name of Britain is Albion, a word of Celtic origin, meaning \"hilly,\" and kindred with the names of the Alps, Albania on the eastern shore of the Adriatic, and Albany, an ancient epithet of Scotland. The island is supposed to have taken its name Albion from the cliffs of Dover visible from the opposite Gaulish coast. The northern part of the island was known to the Romans as Caledonia, a Celtic name of disputed meaning; but it acquired its name of Scotland from the Scots, an Irish tribe which early in the Christian era obtained possession of the western highlands. Ireland itself, Ierne, or Hibernia, is simply \"the western land.\" From the fourth century to the tenth, Britain was overrun and occupied by successive swarms of invaders from the northern coast of Germany, from Denmark, and from Norway. The German tribes were known chiefly as Angles, Saxons, Jutes, and Frisians. The Angles, coming from a little district called Angeln, on the Baltic coast of Sleswick, were much the most numerous, and at last gave their name to the new home, Angleland, or England, although it was first under a Saxon king that the various parts of the country were united into a great kingdom. Of these tribes the Jutes and Frisians settled mainly in Kent and the Isle of Wight; the Saxons settled in the south and centre of the English territory, and the Angles in the east and north, as far as the site of Edinburgh. The Danes and Norwegians, coming later, effected settlements on the east coasts of England and of Ireland, and on the northern coasts of Scotland. In the course of these centuries of invasion, the ancient British population of Britain was largely forced into the western districts—into Cumberland and Lancashire, Wales and Cornwall, and into Brittany, the northwestern peninsula of Gaul. The various tribes of North German invaders, under leaders bearing now the title of kings, now simply that of ealdormen or earls, founded many petty kingdoms in Britain, some of which corresponded nearly in outline to modern shires or counties. But the title \"king\" in those days did not mean the ruler of a specified territory; it meant the principal chief of a particular tribe of men. At various times there were kingdoms of the Northumbrians, or \"people north of the Humber\"; of the Mercians, or people on the March or western border against the Welshmen; of the East Angles, of the East, Middle, South and West Saxons, and of the Kentish men or Jutes Modern authors used to speak of a heptarchy, or system of seven Teutonic kingdoms in Britain; but the expression is inaccurate, as there were never at any one time seven regularly organized states, and at some times the number of fluctuating divisions amounted to ten or eleven. The relations of these states were those of chronic warfare. Sometimes one king gained a temporary supremacy over all his rivals, and then called himself Bretwalda, or \"wielder of Britain,\" but this did not mean that he was king over the whole country, in the modern sense; it only meant that the other kings owed him, for the time being, an indefinite homage. In the first half of the seventh century Northumbria took the lead among these little kingdoms; in the following half century the lead passed to Mercia; at the beginning of the ninth century the first place was decisively taken by Egbert, king of the West Saxons, but England can hardly be regarded as constituting a single kingdom until the reign of Edgar, 959-75. Since the time of Edgar, England has always been under a single government—an instance of political stability to which the history of the rest of the world has hitherto afforded no parallel—but its boundaries have in one instance been enlarged, namely, by the conquest of Wales under the great king Edward I., in 1283. Scotland was also conquered by Edward I. in 1296-8, but regained its independence in the following reign, the work being completed by Robert Bruce at Bannockburn in 1314. At the death of Elizabeth in 1603, the crown of England passed to the king of Scotland as next of kin, and for another century the two kingdoms remained distinct and independent, with one king, but with two parliaments, one at Westminister and one at Edinburgh. In 1706-7 Scotland was united to England, and began to be represented in the parliament at Westminster in such manner as will be shown below. At this time, therefore, the \"United Kingdom of Great Britain\" began its formal existence. The conquest of Ireland was attempted as early as 1170, in the reign of Henry II., by Richard, earl of Pembroke, surnamed \"Strongbow\"; and Ireland indeed continued thereafter nominally subject to the king of England. Yet the conquest of Ireland can hardly be said to have been accomplished earlier than the reign of Elizabeth, and it was first really carried to completion by Oliver Cromwell. Though subject to the English crown, Ireland retained its independent legislature until 1801. when it was formally united with Great Britain, and began to be represented in the parliament at Westminster. So the formal existence of the \"United Kingdom of Great Britain and Ireland,\" strictly speaking, begins with the beginning of the nineteenth century., 109378=—Parishes. At the base of local administrative organization in Great Britain is found the parish. The ancient division of the county was into hundreds and townships, but these divisions at the present day have had their principal functions merged in or obscured by those of the county and the parish. At the head of each hundred there is an officer called the high constable, who was formerly elected by the freeholders of the hundred, but who is now appointed by the justices of the peace in quarter sessions. The duties of this officer have lost their ancient importance, and are now limited to the collection of taxes and the serving of writs. The word \"town\" has to a considerable extent departed from its ancient meaning. Towns which are not especially chartered as cities or boroughs have no distinct government as such, but for all administrative purposes make a part of the county in which they are situated. Nevertheless, neither the old townships nor the old free assembly of the township have disappeared, though both are disguised by a peculiar nomenclature. The change from the old township to the modern parish is in most instances merely a change of name; and the old town meeting survives in the vestry meeting of the parish. The vestry elects officers for the administration of parochial affairs, such as church wardens, commissioners of cemeteries, constables, overseers of the poor, and highway surveyors. The church wardens, of whom there are two in each parish, have charge of the repair of the parish church and of whatever secular business belongs directly to the church. They are paid from the revenues of the church; and before 1868, when their wages from this source were inadequate, a special tax was levied, known as the church rate, which could not exceed 5 per cent. of the annual revenue from the properties on which it could be laid. Since 1868 the payment of church rates has been made optional. Wherever there is a parochial cemetery, its administration is entrusted to a special committee, which provides for its expenses by a tax on burials. Whenever it is necessary to establish a new cemetery, or enlarge an old one, the committee may negotiate a loan, with the consent of the vestry. All country roads except turnpikes are kept up by the parishes, by means of a highway rate which is assessed in precisely the same manner as the poor rate. Petitions for the abatement of these classes of taxes may be heard by the justices of the peace in special or quarter sessions. Besides these obligatory charges, the vestry can undertake, at its own option, the service of the police and that of lighting the streets, the taxes for these purposes being assessed after the manner of the poor rates, except that properties consisting in buildings pay three times as much as lands. Besides these local services, there are others—such as public carriages, water supply, fire department, repair of town clocks, public baths, markets, etc.—which are sometimes discharged by the vestry, but perhaps more generally by local committees whose sphere of activity may extend over several parishes. The extent of the circuit of such local committees is determined by the home secretary, but the committees are responsible not to the national government, but to the parishes with which their work is concerned., 96888=—The following table exhibits the condition of the national debt from its origin down to the year 1881, at various periods:, 193240=The production of pig iron in 1879 was distributed as follows:, 141090=—The Roman Catholic church in Ireland has 4 archbishoprics (Armagh, Cashel, Dublin and Tuam) and 23 bishoprics. The church is supported by fees on the celebration of births, marriages and masses; by Christmas and Easter dues; and by voluntary subscriptions and free-will offerings. The Catholic college of Maynooth was disendowed Jan. 1, 1871. The Protestant Episcopal church was established by law in Ireland, from the time of Elizabeth until 1869, when Mr Gladstone's government disestablished it. It is henceforth on the same footing practically as any other free or dissenting sect., 218501=At the end of 1878 the total length in miles of railways in the British empire was as follows:, 170617=—The total force of the British army in India usually stands at about 60,000; since 1877 it has been kept at the figure of 62,653., 205471=—The six chief articles of import into Great Britain for the year 1880 are as follows:, 181693=—The number of ships in the British navy has undergone great variations, not simply with the growth of the navy in actual strength, but also with the progress of the art of naval warfare. In 1588 the fleet which defeated the Spanish Armada consisted of 176 ships and 14,992 men; but of this great force only 34 ships and 6,225 men belonged to the royal navy; the rest were volunteers serving in merchantmen pressed into the service. In 1679 there were 76 ships-of-the-line in commission. In 1750, shortly before the beginning of the war which made England the mistress of the seas, the navy consisted of 135 ships-of-the-line, 112 frigates, and 130 sloops and smaller vessels. During the great war between England and France at the beginning of this century, the British navy was increased to enormous dimensions. In 1800 it comprised 850 ships of all classes. In 1810 it comprised 1,239 vessels actually ready for service, of which nearly 300 were ships-of the-line, about 600 were frigates, and the remainder were sloops and corvettes. In 1820 the navy comprised 745 vessels, of which 140 were ships-of-the-line. In 1822 the introduction of steam brought about an entire revolution in naval warfare. The grand old line-of-battle ships soon began to become obsolete. Down to 1835, however, the 625 vessels of which the British navy consisted comprised 110 ships-of-the-line, 150 frigates, and 350 smaller craft, with only 15 steam ships. In 1842 the invention of the screw propeller by Ericsson, and its substitution for the paddle wheel, introduced fresh changes of great importance into the art of naval construction; six years after, the British navy contained 49 screw steamers, of which 1 was classed as a ship-of-the line and 10 as frigates. At the close of the Crimean war in 1856, the navy comprised 964 vessels, among which were 45 screw steamers classed as ships-of-the-line, 30 classed as frigates, and 300 of inferior power; besides all this, there were 14 paddle wheel frigates, and 100 paddle wheel corvettes; of sailing vessels, there were 50 ships-of-the-line, 125 frigates, and 300 sloops and brigs. In 1860 the introduction of plated armor, followed in 1862 by Ericsson's invention of the turret ship, taken in connection with the simultaneous progress in the art of gunnery, entirely revolutionized the art of naval construction. The appearance of the \"Monitor\" in Hampton Roads, March 9, 1862, marks perhaps the greatest single step that has ever been taken in the history of naval warfare. Its immediate effect was to render antiquated all the most recently built ships then existing in all the navies of the world. Important innovations have been made since the invention of the \"Monitor\"; but the present British navy dates from the year 1862; and for the purposes of naval warfare at the present day the great navy of the Crimean war would be of no more use than a squadron of 964 pleasure boats., 33235=—This unquestioned supremacy of the commons in the English government is of modern growth. We can hardly refer it to a period back of the revolution of 1688, at which time, as we shall see, cabinet government, in the strict sense of the term, had its beginnings. Yet back of that time, and far back in the middle ages, it is not so much true that the ultimate governing power did not reside in the commons as that it was more or less uncertain where it resided. In Plantagenet times it was to some extent true—as it is not at all true to-day—that the sovereignty was shared between \"king, lords and commons.\" To determine precisely where the ultimate authority resided, and in what ways it might constitutionally exert itself, required several generations of discussion and more or less of hard fighting. England has never at any time, save for five years under Cromwell, been governed despotically; at no time has the sovereign been able to override the laws, save now and then through the subserviency of the judiciary, which was one great curse of the Tudor and still more of the Stuart times. The gradual dissolution of the feudal system, which resulted in the temporary establishment of despotic government all over the continent of Europe, resulted in the firm establishment of a free popular government in England. Many circumstances conspired to bring about such a result, but one of the most important was the conquest of the kingdom by the Normans. The accession of William the Conqueror was marked by a tendency toward centralization such as at that time characterized no other kingdom in Europe, but this centralization was achieved at the expense of the nobles, not at the expense of the common people. The old English nobility, through manifold acts of confiscation, was pushed down into a subordinate position in the social and political scale; while the new Norman nobility, through the very circumstances of its creation, was unable to assert such an independence of the crown as was asserted until nearly the end of the middle ages by the nobility of France and other continental countries. The king's authority, through his sheriffs and lord lieutenants, penetrated, with more or less efficiency, into every county. Instead of tyrannizing over the common people, and making war on the king, each in his own interest, the nobles were obliged to court the aid of the yeomanry and burghers, and, when they opposed the crown, to do so in an organized body and for the acquirement of certain permanent legal rights which under the circumstances they must needs share with the yeomanry and burghers who were their allies. Such was, in rough outline, the general character of the relations between \"king, lords and commons\" during the great formative period of English constitutional history between the Norman conquest and the accession of Edward I. Its most important feature was the alliance between the nobles and the common people, which resulted from the weakness of the nobles relatively to the crown, and which was consummated during the thirteenth century in the rebellion organized against Henry III. by the barons under Simon de Montfort. It was in the course of this struggle that the house of commons, as an independent legislative body, originated. The oldest English sovereigns—the kinglets over such little realms as Kent or Essex—used to hold consultations with their \"elders\" or nobles, after the fashion of Homeric kings, while the crowd of \"churls\" or common people stood about and listened, and signified approval or disapproval by cheers or groans, or by clashing their weapons. But after there had come to be one king over all England, the common people could not all come to hear his consultations with the nobles, and rattle their spears or quarter-staves; and so the parliaments or meetings for \"talking\" public business came gradually to consist only of the king and such great nobles as he thought it worth while or felt obliged to invite to come and discuss public affairs with him. In the days of the united monarchy before the Norman conquest, such meetings of king and nobles were called \"witenagemote\" or \"meetings of wise men.\" But though the common people—the yeomen and burghers—had given up the practice of attending such royal meetings, they never quite gave up the practice of attending county meetings. When it had become manifestly impracticable for all the freemen in a county to attend in a body, they hit upon the device of sending representatives. Each township sent to the county assembly its \"reeve\" or principal magistrate, accompanied by \"four discreet men.\" This had become a time-honored custom long before the thirteenth century, and so when Simon de Montfort wished to increase the strength of the popular party espoused by the barons, he had a precedent for a representative assembly all ready to hand. In 1265 Earl Simon called together a parliament in which the peers sat in person as heretofore, while each town sent two elected citizens and each county sent two elected \"knights of the shire.\" And these elected citizens or burghers, and knights of the shire, sitting and voting separately from the body of peers, formed the first real house of commons., 30904=—It was said above that the house of lords has no power to reverse a decision of the house of commons. There is no possibility of a real deadlock between the two houses. In point of fact, a bill which has passed the commons may be defeated in the lords, but whether the commons accepts such a veto or not depends entirely upon the strength of its determination and of its interest in the bill. When the commons has finally made up its mind, the lords must sooner or later submit. In case the lords were to persist in opposing the will of the commons, the lord chancellor would be authorized to commission a sufficient number of new peers to \"swamp\" the upper house. This prerogative is something to be used only with reluctance and as a last resort, and it has not actually been used since the reign of Anne, but the knowledge that it can be used constitutes a sufficient check upon the house of lords. In 1832 the government was prepared, if necessary, to secure the adoption of the reform bill by the creation of eighty liberal peers; and the knowledge of this fact at last caused the lords to withdraw their opposition to the bill. In the reign of George I. an attempt was made to take away this prerogative of creating new peers (technically supposed to be a prerogative of the sovereign), but it was evidently fortunate for the peers as a legislative body that the attempt was unsuccessful. The continuance of the independent existence of the house of lords is favored by its manifest inability to obstruct seriously the course of legislation, while as a revising and criticising body it has often been found of great service. In like manner the continuance of the English monarchy is favored by the fact that the sovereign has come to be merely an ornamental part of the governing organization, without the power of doing serious mischief. In many instances, indeed, the sovereign is useful as the theoretical source of \"prerogatives\" that derive their practical value only from being exercised by a responsible ministry with the approval of the majority of the house of commons., 216107=According to the scale of 1849 it is obvious that 320,000 seamen, instead of 197,000, would be required to man the British merchant fleet at the present day. The saving thus effected in gross amounts to 38 per cent., thus allowing a great reduction of freight charges, and enabling food and raw materials to be imported, and manufactures to be exported, with less expense and greater profit., 155199=—Besides the justices of the peace, there are the sixty county courts in England and Wales, which deal with petty matters. These courts are held by a single salaried judge, appointed for life, and they can try cases involving not more than £50. They have also the powers of a court of chancery in cases involving not more than £500. By an act of 1863, in towns with a population of 25,000 or more, there may be appointed, at the request of the local authorities, a salaried magistrate who, either by himself or with the aid of the justices of the peace, may do the work of these county courts. In London and some other cities there are special police courts, held also by a single salaried judge, which take cognizance of petty crimes and misdemeanors. In the city of London the lord mayor also holds a police court at the Mansion House, and one is held by an alderman at the Guildhall., 199726=Of this total number of persons employed (1,005,685) there were 61,209 boys and 64,677 girls under thirteen years of age. The average wages of the cotton operatives in Lancashire were estimated in 1860 at 18s. 6d. per week for men, 10s. 2d. for women, 7s. for boys, 5s. for girls. In the linen factories at Belfast wages vary from 5s. 6d. to £2 per week, according to the skill of the workman. The average wages paid in England and Scotland for work in the woolen factories were at the same time from 6s. to 7s. per week for spinning, and 9s. for weaving; these operations being mainly carried on with the assistance of women and young girls; the wages of men in the same factories averaged from 16s. to 26s. per week., 216715=—The proportion of trade done all over the world in British vessels is as follows: United Kingdom, 55,120,000 tons, or 88 per cent.; United States, 7,434,000 tons, or 59 per cent.; Canada, 5,673,000 tons, or 80 per cent.; France, 5,254,000 tons, or 36 per cent.; Australasia, 4,492,000 tons, or 93 per cent.; Netherlands, 3,790,000 tons, or 51 per cent.; Germany, 2,298,000 tons, or 36 per cent.; Italy, 1,887,000 tons, or 23 per cent.; South America, 1,200,000 tons, or 50 per cent.; West Indies, 1,180,000 tons, or 60 per cent.; Russia, 1,006,000 tons, or 34 per cent.; South Africa, 1,004,000 tons, or 86 per cent. The total carrying trade of Great Britain is therefore about 90,000,000 tons, which, at an average of 10s. ($2.40) per ton, yields an income of £45,000,000 per annum. The sum paid by British underwriters averages £1,500,000 yearly, being about £6 per ton on vessels and £8 per ton on cargoes. The total amount of marine insurance usually exceeds £450,000—Railways. From the opening of the first railway, in 1825, down to the end of 1850, the number of miles of railway constructed in the United Kingdom was 6,621; this was at the rate of 265 miles annually. In 1860 the length of lines was 10,433, the average rate of construction being 381 miles annually. At the end of 1879 the length of lines was 17,696, the annual average on the total length having increased to 402 miles. The principal recent railway statistics of Great Britain are comprised in the following table:, 88295=—During the whole period of sixteen years there has been an almost uninterrupted reduction of taxation, as may be seen from the following statement. In 1864 the taxes were reduced by £4,615,508; in 1865 by £3,235,384; in 1866 by £5,343,405; and in 1867 by £601,462. In 1868 they were increased by £1,285,000; and in 1869 by £1,450,000. In 1870 they were reduced by £2,735,670; and in 1871 by £4,497,343. In 1872 they were increased by £3,050,066. In 1873 they were reduced by £3,895,105; in 1874 by £3,327,380; in 1875 by £4,554,903; and in 1876 by £66,000. In 1877 they were increased by £1,549,050. In 1878 they were reduced by £6,000. In 1879 they were increased by £4,340,000. The increase in 1868 and 1869 was connected with the expenses of the Abyssinian expedition; that of 1877 was connected with extraordinary disbursements on account of the war between Russia and Turkey; and that of 1879 was connected with the war in South Africa., 159449=—VIII. ARMY. The maintenance of a standing army in time of peace, without the consent of parliament, was prohibited in 1690 by the bill of rights. It requires an annual vote of the house of commons to keep the army in existence from year to year. A cabinet meeting is held shortly before the sitting of parliament, which receives communications from the commander-in-chief respecting the number of officers and men, in each branch of the service, which are needed for the ensuing year. On the basis thus furnished, the cabinet authorizes the secretary of state for war to draw up his \"army estimates\" to be submitted to the approval of the house of commons. A further efficient means of controlling the army is furnished by the mutiny act. In the absence of the mutiny act, the soldier on English soil is subject only to the common law, and could be punished, even for desertion, only by a civil action of contract. That martial law, without which an army can not maintain its orderly existence, exists itself only through the mutiny act which is limited in duration to a single year, and consequently has to be renewed at the beginning of every session of parliament. To such precautions were the English people led by the attempts of the Stuarts to set up a tyranny; and they were obviously so thorough as to make henceforth the merest beginning of a military despotism well nigh impossible., 48853=—Nevertheless, even during the reign of Henry VIII., when the English government made perhaps its nearest approach to despotism, the importance of the house of commons was acknowledged by the persistence of the efforts made to corrupt it. The Tudor tyranny was scrupulously legal in form, and it has been truly said that \"every deed of wrong done by Henry with the assent of parliament was in truth a witness to the abiding importance of parliament.\" One feature of the Tudor period was the continual and energetic interference of the government in parliamentary elections, and this alone shows that the assent of the commons was even in these times held indispensable. Still stronger illustration of this is shown by the creation of rotten boroughs, more especially in Cornwall, which we must be careful not to confound with such other rotten boroughs as Old Sarum. Many of the boroughs disfranchised by the great reform bill of 1832 had become \"rotten\" in a natural way, simply by being outstripped in rate of growth by adjacent towns. But besides these, many rotten boroughs were called into existence in the Tudor period by the government sending writs of election to petty places likely to return members who would be found subservient to the court. That the crown could not get along without the house of commons is shown by nothing more forcibly than by the very pains which it thus took to pack that legislative body. Nevertheless all such proceedings tended to impair the quality of the legislature and to weaken its authority; and it was clear that if English freedom was to be maintained, a constitutional struggle must arise, in which the independence of parliament must be asserted and the arbitrary tendencies of the crown checked. Such a struggle would no doubt have come before the end of the sixteenth century but for reasons which it is easy to point out. During the first half of Elizabeth's reign the dread of a disputed succession, which had been so effective ever since the accession of her grandfather, was greatly enhanced by the fact that in case of her death without issue her probable successor would be the Catholic queen of Scotland, whose cause was supported by Philip II. of Spain, the most formidable enemy to popular liberty in all Europe. Until the overthrow of the Invincible Armada in 1588 the king of Spain was an enemy whose power of mischief it would not do to underrate. This state of things so thoroughly identified the interests of the people with the interests of the great queen, both before and after her magnificent triumph over Spain, that anything like a serious constitutional struggle between herself and her parliament was quite out of the question. Besides all this, Elizabeth was a woman of too much good sense and tact to get herself drawn into a quarrel about questions of authority and prerogative. After her death all was changed. It was clear that no future sovereign could afford to take such liberties with the constitution as the Tudors had done, unless endowed either with unusual shrewdness or with unbounded personal popularity, or both. But Elizabeth's successors had little shrewdness and little personal popularity. In foreign relations, while the cause of Elizabeth had been identical with that of England, on the other hand the Stuarts always contrived to favor just that line of foreign policy most calculated to alarm and disgust the English people. While the memory of the Armada was still fresh in the land, James I. ostentatiously cherished a perverse friendship for Spain; and in the latter part of the century, when Spain had ceased to be dangerous, and France under Louis XIV. had become the chief enemy to freedom in Europe, then James' grandsons showed even greater perversity in their criminal subservience to the French court. Thus, as the causes which kept the nation loyal to the Tudors no longer existed, it was natural that the great struggle which was to teach the sovereign hereafter to \"know his place\" should begin with the accession of the House of Stuart. By this time, too, the spirit of the old nobility had grown up again in the new, and the united strength of lords and commons was as great, in relation to that of the crown, as it had been in the days of Richard II. The occasion for conflict, moreover, was precipitated by the impecuniosity of the Stuart kings. James I. and Charles I., without anything like the pecuniary resources of Henry VII., were much more anxious than Henry VII. to get along independently of parliament, and the larger part of the history of their reigns is the history of their attempts to raise money in unconstitutional ways. \"Tonnage and poundage,\" \"ship money,\" and other similar illegal exactions, combined with the persecution of the Puritans to bring about the rebellion which for a few years resulted in overturning the throne. The so-called commonwealth, which ensued, far from vindicating for the popular legislature its title to the supreme authority in the government, proceeded to overturn the legislature as well as the throne. The brief period of the commonwealth was in reality a season of anarchy, save during the briefer included period of Cromwell's supreme authority. The attempts of Cromwell to rule in connection with a house of commons were totally unsuccessful, because the constitution supplied no precedents adequate for determining the character of the relations between the two. In case of a conflict of policy the ultimate authority must rest with the party strongest for the time being, which in this instance was the lord protector as head of an invincible army. The brief rule of Cromwell, though deservedly glorious in English History, was a pure despotism with nothing constitutional about it. It was a despotism which did not deserve to last, which endured some five years only by reason of the transcendent ability and weighty character of Cromwell himself, but to which even Cromwell's greatness could hardly have sufficed to insure a much longer duration. The restoration of the monarchy, with all the constitutional precedents grouped about it, was really the only condition upon which the good work begun by the long parliament could be successfully carried on. The essential triumph of the Puritan rebellion was illustrated in the reformatory measures of the first parliament of Charles II., and it would have been even more complete but for the temporary reaction of feeling which the anarchical character of the commonwealth had brought about. For a moment the crown was once more associated in men's minds with peace and quietness, a feeling of which Charles and his brother proceeded to take advantage to defy public opinion., 120457=—The following table exhibits the amounts of the various branches of local expenditure in the year ending March 31, 1874:, 79434=—2d. Public Expenses of Administration. Some time before the annual meeting of parliament, the heads of the different departments, after consultation with the lords of the treasury, prepare estimates of the probable expenses of the administration of their departments for the ensuing year. Four especial budgets are handed in: one for the navy, one for the army, one for the revenue department, and one for the civil service. The civil service is subdivided into departments, such as that of public works, law and justice, education, colonial and consular service, and charitable institutions; and besides all this, there is a section devoted to various temporary purposes. Down to the year 1863, moreover, a small sum was put at the disposal of the ministers for unforeseen expenses. But since 1863 this item has been provided for by a regular and permanent assignment of £120,000. The estimates are subdivided into articles, each article having reference to a special branch of expense. The amount assigned by parliament for the civil service of the preceding year is set down in a column by itself; and by the side of it are set down the corresponding estimates for the ensuing year; and these estimates are accompanied by very elaborate explanations concerning every detail of expense, however minute. Printed copies of these estimates are distributed to each member of the house of commons. After a while they are submitted to the committee of supply for examination, and the articles are then discussed and put to vote, one after another. After a certain number of articles have been adopted, an act is passed authorizing the lords of the treasury to apply a certain proportion of the public revenue to the purposes assigned by vote of the house of commons. This act is called the \"ways and means act.\" The gross amount specified in this act can never exceed the amount of the sums already appropriated by the committee of supply. Several acts of ways and means are ordinarily passed in the course of each session, in accordance with an old constitutional tradition whereby enough money is to be granted during the sitting of parliament to prevent any delay in public business, without putting into the hands of the crown enough funds to enable it to dispense with parliament. Thus are the financial proceedings of the house of commons still affected by reminiscences of that family of Stuart kings whom it was not safe to trust with money! At the close of the session a general act of ways and means is passed, recapitulating all these minor acts, and authorizing the lords of the treasury to appropriate the revenue in general as therein assigned. This general act is called the act of appropriation. In times of war, when it is impossible to foresee exactly the characters and amounts of all the expenses that may be found necessary, it is customary to pass a \"vote of confidence,\" allowing the government several millions sterling in order to provide for extraordinary war expenses. Funds granted in this way can not be appropriated for any purpose that is not immediately connected with the war going on at the time. If the government turn out to have need of any further funds, parliament must be summoned and demand made for a further credit., 190277=—Mineral Products. British agriculture, though conducted with great care and skill, is too limited in extent either to obtain a controlling position in the markets of the world, or to furnish a sphere for the activity and satisfaction for the material wants of the dense and rapidly increasing population of the United Kingdom. The industrial and commercial development of Great Britain has been primarily due (next to the free constitution of the government) to the immense mineral resources of the country. The most important mineral and metal products are coal and pig iron, the annual yield of which, in the years 1868-79, is shown in the following table:, 67664=—1. Revenue. The total revenue of the United Kingdom for the year ending March 31, 1880, amounted to £70,747,079, equal to $339,585,979. The chief sources of this revenue were, 1st, Custom house duties, £19,326,000; 2d, Excise tax, £25,300,000; 3d, Income and property tax, £9,230,000; 4th, Stamp duty, £10,316,103; 5th, Land and assessed tax, £2,670,000; 6th, Postoffice receipts, £3,330,000; 7th, Crown lands, £390,000; 8th, Miscellaneous, £184,976. These sources of revenue may be considered in detail., 98123=—The balances in the exchequer for the sixteen years 1866-81, are shown in the following table:, 89617=—The annual revenue derived from the income tax, the most important of the direct taxes, during each of the financial years 1870-81, was as follows., 196598=—The recent condition of the textile industries of Great Britain may best be represented in a series of tables. In 1815 the total imports of cotton were 99,000,000 lbs.; in 1820, 152,000,000 lbs.; in 1830, 264,000,000 lbs., in 1840, 592,000,000 lbs.; in 1850, 663,576,861 lbs.; in 1860, 1,390,938,752 lbs.; and in 1863, 669,583,264 lbs. The falling off between 1860 and 1863, due to the blockade of the southern states in the rebellion, is very noticeable; and it is worthy of remark that a supply of cotton more than adequate for the industries of England in 1850, had become, through the mere expansion of industry, so inadequate, only thirteen years later, as to produce a period of distress almost comparable to a famine. Subsequent fluctuations are exhibited in the following table:, 174734=—The following table gives the navy estimates for the year ending March 31, 1882:, 68458=—1st. Custom House Duties. Since 1845 customs duties have been levied only on imported goods, and the number of articles subject to duty has been greatly reduced. In 1841 the tariff list contained something like 1,200 articles; in 1881 it contained only eight, of which only five are of any importance, to wit: tea, yielding £4,016,319; coffee, yielding £216,925; wines, yielding £1,378,508; spirits, yielding £4,941,871; tobacco, yielding £8,596,757. The only other dutiable articles are chicory, cocoa and dried fruits. Customs duties are levied indiscriminately upon goods produced in British colonies and goods produced in foreign countries, and no distinctions are made with reference to the nationality of the ships from which goods are landed. The articles made dutiable are in the main articles which can not be produced in the United Kingdom. Where a dutiable article is produced in Great Britain, as in the case of spirituous liquors, it is subjected to an excise tax as nearly as possible equivalent to the duty. It will be seen, therefore, that the British tariff is devised simply for the purpose of raising revenue, and not at all for the purpose of what is called \"encouraging native industry\" by taxing consumers for the benefit of producers. The most important changes made in the tariff during the present century have been made by Sir Robert Peel in 1842 and 1845, and by Mr. Gladstone in 1853 and 1860. The results of these changes, as affecting the revenue derived from the tariff, may be seen in the following brief statement: In 1842 the total revenue from 1,200 articles was £22,523,000; in 1880 the total revenue from eight articles was £19,326,000. The custom house department is administered by a board of six commissioners holding office for life or during good behavior; this board is under the general direction of the treasury, and, more specifically, of the chancellor of the exchequer. Customs duties have in all ages been part of the revenues of the British government. In former times they were known by the epithet \"tonnage and poundage,\" the tonnage duties being applicable to wines or spirits, and the poundage duties being analogous to what are now commonly known as ad valorem duties., 105773=—Cities and Boroughs. These names are applied particularly to municipal corporations independent of the county, which retain, by virtue of a charter or of a special act of parliament, the power of self-government intact. Legislation regarding these corporations was summed up and epitomized in an act of 1835. A municipal corporation consists of a mayor, a board of aldermen, a common council, and citizens or burgesses. The citizens are all individuals having attained their legal majority who have occupied during three consecutive years a house, shop or office within the city, or who have their true residence within the city or within a radius of seven miles of it, and who have besides been enrolled as liable to the poor tax. The citizen list, or roll of burgesses, is publicly revised every year. The citizens elect the councilors, auditors and assessors. Councilors are chosen subject to a property qualification of not less than £500. No ecclesiastic can be elected councilor, nor can any one who is in receipt of a salary from the city. Councilors are elected for a term of three years. Aldermen are appointed by the common council, and hold office for a term of six years, and no one is eligible as alderman who is not eligible as councilor. The aldermen men preside at city elections, and one of them takes the place of the mayor in the case of his absence or death. The mayor is elected annually by the common council, and is taken indifferently from among the aldermen or from among the councilors. The mayor is ex officio justice of the peace during his year of office and the following year. In the municipal council his sole privilege is to preside at the meetings. The municipal council holds its meetings quarterly, and besides this, extraordinary meetings can be summoned by the mayor or by any five councilors. Two-thirds of the members of the council are required for a quorum. The council may make regulations for the city and ensure their observance by affixing fines not exceeding £5. Such regulations become effective only after having been posted for forty days at the entrance to the city hall, and after having been communicated to the home secretary. The council administers the municipal estates and revenues, and it has supervision over the local administration of justice, over prisons and houses of correction, and other local matters. Besides the council there are in every city certain officers which are either appointed by the council or elected by the citizens. The assessors and auditors are elected by the citizens, while the other officers are appointed by the council and hold office for life or during good behavior. Among these are the town clerk (who has charge of the charters and archives of the city, and prepares the electoral lists), the town treasurer, etc., etc. In most cities and boroughs there are county courts for the trial of civil actions, the extent of their circuit being prescribed by the lord chancellor. These courts have cognizance of all civil actions not exceeding £50 in value. At the request of any city, its magistrates may undertake the administration of criminal justice in petty cases, the expense being defrayed by the city. The principal expenses of cities and boroughs are expenses for lighting, water, repair of streets, and police., 91881=—An attempt was made by Mr. Gladstone in 1853 to reduce the interest of a considerable portion of the debt to 2½ per cent.; but the attempt was unsuccessful. The principal feature of this plan was the issue of exchequer bonds bearing 2 8/4 per cent. interest until 1864, and 2½ per cent. until 1894, after which the bonds should be redeemable at the pleasure of the government. These bonds were offered in exchange for bills of exchequer or for shares in the consolidated fund, but they were only taken up to the amount of about £400,000, and this was almost solely in exchange for bills of the exchequer. The arrears of the national debt are paid through the agency of the bank of England, which receives a commission upon the payments that it makes. Formerly so much importance was attached to the maintenance of a sinking fund for redeeming a certain amount of the debt each year, that loans were often made for the purpose of keeping it up. But the obvious futility of borrowing in order to pay the debt caused this sinking fund to be abolished. But by the provisions of an act of parliament of 1875, the national debt is now to be gradually reduced by means of a new permanent sinking fund, maintained by annual votes of the legislature. The charge of the sinking fund for the financial year ending March 31, 1876, was fixed at £27,400,000; for the following year at £27,700,000; and for every subsequent year at £28,000,000. It was also provided that the charges under this head should be entered under the consolidated fund., 138108=—The established church in Scotland is Presbyterian in government and Calvinistic in doctrine. There is in each parish a parochial tribunal, called a \"kirk session,\" consisting of the minister as president, together with several other persons prominent in the neighborhood, of whom two are selected as \"elders.\" A certain number of parishes constituting a district send each its minister and one of its elders to an assembly called a \"presbytery,\" which has the power of ordaining ministers, of authorizing candidates to preach before ordination of investigating complaints against members of the church, of admitting new members, and of pronouncing sentences of excommunication. Minor matters of church discipline are dealt with in the kirk session, from which, however, an appeal always lies to the presbytery, and ultimately to the general assembly, the highest body in the Scotch church. The general assembly is composed partly of ministers and partly of lay members, elected annually by the different presbyteries, boroughs and universities. It consists of 386 members, and meets in May every year. The nomination of ministers belongs either to the crown or to private individuals. In 1830 some of the Scotch people protested against this use of patronage, and in 1843 the result was the division of the church. Alongside of the national church of Scotland there grew up the free church of Scotland. The latter church, supported entirely by voluntary contributions, has built 900 churches and 600 school houses, besides establishing several foreign missions. Including the free church, considerably more than half the population of Scotland may be ranked as dissenters from the established church of Scotland. There are numerous bodies of Congregationalists, Wesleyans, Baptists and Unitarians. The national church of Scotland has three presbyteries in England., 194411=The exports of coal to foreign countries have increased more than fivefold since 1850. In 1879 the quantity of coal exported was 15,740,082 tons, valued at £6,793,932, of which 3,317,370 tons went to France, 2,055,080 tons to Germany, and the remainder, distributed in quantities not exceeding 100,000 tons, to some forty different countries., 163541=—The following table shows the cost of maintaining the army for the year ending March 31, 1882:, 87431=—The following tables show the total amounts of revenue and expenditure for the sixteen financial years 1866-81:, 65273=—The treasury department of the British government was in former times administered by the lord high treasurer an officer who ranked immediately after the two archbishops and the lord chancellor, as the fourth personage in the kingdom outside of the royal family. But this office became obsolete in the reign of Anne, and the treasury is now administered by a bureau or committee of five. The chairman of this committee, known as the \"first lord of the treasury,\" is usually the prime minister, who has the general business of the government to superintend; so that, in point of fact, the especial charge of the business of the treasury is lodged with the second officer of the committee, who is known as the \"chancellor of the exchequer.\" The other three members of the committee are of no especial account. Now and then it has happened that the same person has occupied the offices of first lord of the treasury and chancellor of the exchequer at the same time. This was the case with Sir Robert Peel in 1834 and with Mr. Gladstone in 1874; and both offices are held by Mr. Gladstone at the present time (1881); but in the nature of things such a union of two such onerous offices must be exceptional. All the five members of the treasury committee, as well as their two secretaries, must be members of parliament and all go into or out of office together when there is a change of administration. It is the business of the chancellor of the exchequer to present each year to the house of commons his financial statement for the year just expired, and also his \"budget\" or estimate of receipts and expenses for the current year. The financial year in Great Britain ends on the last day of March, and the budget is usually presented to the house a few weeks later. In presenting the budget, the chancellor indicates what modifications, if any, the government proposes to make in the system of taxation for the ensuing year; and he usually makes out his estimate in such a way as to allow a margin of from two to three million dollars for incidental or unforeseen additions to the reckoned expenses., 156332=—The higher courts of common law (modified by acts of 1873 and 1875) are: the court of king's bench, the court of exchequer, and the court of common pleas. They are held at Westminster, where the court of chancery also sits. Each of these common law courts is held by a president and four assistants. The presiding judge, in the queen's bench and in the common pleas, is called lord chief justice; in the exchequer he is called lord chief baron. Formerly the provinces of these three courts differed considerably, but with the progress of business they have come to overlap each other in many directions; but the court of exchequer, as its name implies, is purely a fiscal court; the common pleas is simply a civil court; while the queen's bench has cognizance of both civil and criminal cases, and appeals lie to it from all the inferior courts., 60296=—But although we can not say precisely when this change was consummated, we may say that the most important date in English constitutional history since 1688 is unquestionably 1832, the year of the great reform bill. In that year was inaugurated a change whereby the house of commons has come to represent, much more truly than before, the whole English people. While the old \"rotten boroughs\" and \"pocket boroughs\" existed, although the vote of the commons determined what was to be the supreme law of the land, it was nevertheless possible and customary for the crown and the peerage, through corrupt influence upon the elections, to determine to some extent the composition of the house of commons. The year 1832 may be assigned as the epoch at which the supremacy of the commons became finally complete throughout all departments of the government., 97619=—During the fifteen years 1867-81, the capital of the national debt varied as follows:, 22618=It will be seen that the population of England has nearly trebled since the beginning of the present century, and that the population of Scotland has more than doubled; while, on the other hand, the population of Ireland remains the same as at the beginning of the century, the natural increase having been drawn off by emigration. The rate of increase in Great Britain, though very small compared to that of the United States, has been greater than that of any other European country. England is more densely populated than any other country in the world excepting Belgium. The population of England is 437 to the square mile, whereas that of Massachusetts, the most densely peopled state in the American Union, is 225 to the square mile, and that of China proper is about 300 to the square mile. At the beginning of the reign of Edward III., in 1327, the population of England is estimated to have reached 4,000,000; but in 1348 and the following years the terrible plague known as the Black Death, destroyed half the population, reducing it to about 2,000,000. Toward the end of Elizabeth's reign the population had reached about 5,000,000. In 1700 it was 6,045,008; in 1750 it was 6,517,035., 136229=—The church revenues are derived very largely from real estate, and also from tithes (which in 1836 were commuted for a fixed charge in money), as well as from surplice fees for baptisms, marriages and burials. The sum total has been estimated at £4,480,000. The archbishop of Canterbury receives about £15,000; the archbishop of York, £10,000; the bishop of London, £10,000; the bishop of Durham, £8,000; the bishop of Winchester, £7,000; and the other bishops from £3,000 to £5,000. The deans receive £1,000 and upward., 191167=The total amount of iron ore produced in 1879 was 16,692,802 tons, valued at £6,746,668. As to other mineral products, the yield for 1879 is shown in the following table:, 184896=—The most important portion of the present British navy at the beginning of 1881, consisted of 68 ironclad ships, afloat and building, of which number 48 were described as efficient, while 17 had become antiquated or otherwise inefficient, and 3 had been built solely for colonial use and were not reckoned as strictly British. The following table gives a general idea of the character of the 48 effective ironclads:, 206833=The six chief articles of export for 1880 are exhibited in the following table:, 197643=The first shipment of cotton from the United States to Great Britain was in 1791, and consisted of 182,000 lbs. During the past fifty years other countries have begun to rival the United States as cotton growers. The imports of raw cotton, from various parts of the world, in 1837 and in 1879, have been as follows:, 204079=And the following shows the dealings of the United Kingdom with the different countries in 1880. (This table, like the former, is taken from the \"Statesman's Manual,\" by Frederick Martin.), 20107=—The total geographical area of the United Kingdom is about 122,161 square miles, divided as follows: England, with Wales, 58,311; Scotland, 31,326: Ireland. 32,524; total, 122,161. In other words, the area of England with Wales is almost exactly equal to that of the New England States, omitting Vermont; or to that of the state of New York with Vermont added; or to that of the state of Georgia. The area of either Scotland or Ireland alone is a little less than that of the state of Indiana. The area of Great Britain without Ireland is equal to that of the six New England states with half of New York added. The area of the United Kingdom is equal to that of the four states of Vermont, New York, Pennsylvania and New Jersey. The greatest length of Great Britain, from its southwest corner at Land's End to Duncansby Head, where John of Groat in the reign of James IV. built his celebrated ferry-house on the beach of the Pentland Firth, is about 600 miles. Its greatest width, along the south coast, is 320 miles; its least width—say from Kincardine on the Forth to Dumbarton on the Clyde—is less than 30 miles. The greatest length of Ireland is 300 miles, and crosswise from Carnsore Point to Erris Head it measures about 200 miles. The higher mountains of Great Britain rise in the west of the island, so that most of the rivers belong to the North sea drainage. The largest of these, the Thames, draining an area about equal to that of the state of Connecticut, and possessing a tidal upflow for 60 miles from its mouth, makes London practically a seaport. The climate of Great Britain displays to a remarkable extent the effects of maritime situation. While the parallel of London runs through Labrador, the summers are not only much cooler, but the winters are much less severe, than in any part of the northern United States. In January the thermometer in London seldom goes below 32° Fahrenheit, while in July it seldom goes above 80°., 93678=—The unfunded or floating debt comprises bills of the exchequer and bonds of the exchequer. There are various kinds of exchequer bills, distinguished as \"supply bills,\" \"deficiency bills,\" and \"ways and means bills.\" Between the two latter kinds of bills there is a close analogy. The bills of ways and means serve as a guaranty for loans made at the bank in order to cover some deficit in the quarterly revenues designed for supplying the public service; and in just the same way the deficiency bills provide against slight deficits in the consolidated funds. These two classes of bills may be issued without special recourse to parliament, in virtue of the general authority given to the government for financial management. The supply bills of the exchequer are issued in virtue of a direct authorization by parliament. They are a kind of promissory notes, bearing an interest fixed from time to time by the treasury, and payable at assigned dates. These notes are usually issued in March and June of each year, and they usually run for one year from the date of issue. They have most of the characters of bank bills, and are receivable in payment of the revenues for the year in anticipation of which they are issued. But formerly the sum of these bills in circulation would occasionally become too large to be redeemed under these conditions; and in such cases it was customary to authorize a new issue each year for the purpose of paying off the bills of the preceding year arrived at maturity. The inconvenience of this is obvious, and in 1861 a new system was introduced. Bills of the exchequer are now charged to the account of the consolidated fund. They are thus payable at the close of one year from the date of issue, but are only paid in case payment is demanded by the holders. If they are not presented for payment at the end of the year, they are payable at the end of the following year, and so on. The treasury is authorized to issue new bills in amount sufficient to replace those which have been paid on presentation. The holders of bills of the exchequer which have not more than six months to run may offer them in payment of taxes. The treasury has the right to fix the rate of interest on these bills, which can not, however, exceed 5½ per cent. per annum. The sum total of exchequer bills in circulation does not exceed £6,000,000, though formerly it attained a much higher figure., 119817=—The total amount annually raised by local taxation was as follows, in the three divisions of the United Kingdom, in the year ending March 31, 1874, this being the latest official return:, 74987=—6th. Postoffice Receipts. The postal service, in connection with the public revenue, was established by Cromwell in 1657, but its revenue-yielding function has always been regarded as entirely secondary to its function as a public convenience. In 1868 the telegraph lines throughout Great Britain were purchased by the government, and have since that time been operated by the postoffice department, greatly to the benefit of the public. Throughout Great Britain and Ireland every post-office has a telegraph office connected with it, and messages are sent to any distance at a uniform rate of one shilling for twenty words. The revenue derived from this source amounts to about one-tenth of that derived from the carriage of letters; but this ratio constantly tends to increase, from which it may perhaps be inferred that the tariff will ultimately be diminished.}",
    "textBeforeTable": "—The force of the regular army at decennial periods since the beginning of the present century, and cost of maintaining it, have been as follows: II.121.78 —VIII. ARMY. The maintenance of a standing army in time of peace, without the consent of parliament, was prohibited in 1690 by the bill of rights. It requires an annual vote of the house of commons to keep the army in existence from year to year. A cabinet meeting is held shortly before the sitting of parliament, which receives communications from the commander-in-chief respecting the number of officers and men, in each branch of the service, which are needed for the ensuing year. On the basis thus furnished, the cabinet authorizes the secretary of state for war to draw up his \"army estimates\" to be submitted to the approval of the house of commons. A further efficient means of controlling the army is furnished by the mutiny act. In the absence of the mutiny act, the soldier on English soil is subject only to the common law, and could be punished, even for desertion, only by a civil action of contract. That martial law, without which an army can not maintain its orderly existence, exists itself only through the mutiny act which is limited in duration to a single year, and consequently has to be renewed at the beginning of every session of parliament. To such",
    "textAfterTable": "14,840,000 1870, 107,836 \"... 14,093,500 1880, 107,100 \"... 15,541,300 The regular army of the United Kingdom in 1882, exclusive of India, consisted of 7,222 commissioned officers, 17,555 non-commissioned officers, trumpeters and drummers, and 108,217 rank and file; a total of 132,994 men of all ranks. The following table shows the composition of this force: II.121.79 —The following table shows the cost of maintaining the army for the year ending March 31, 1882: EFFECTIVE SERVICES 1. Regular Forces. General staff and regimental pay, allowances, etc. £4,436,000 Divine service... 52,400 Administration of martial law... 39,800 Medical establishment and services... 300,500 2. Auxiliary and Reserve Forces. Militia pay and allowances... 476,800 Yeomanry cavalry... 73,900 Volunteer corps... 540,500 Enrolled pensioners, and army reserve force... 218,800 3. Commissary Department. Commissariat establishments and wages... 404,800 Provisions, transport, and other services... 3,411,000",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}