{
    "relation": [
        [
            "Patent application number",
            "20090299510",
            "20120203367"
        ],
        [
            "Description",
            "METHOD FOR MINIMIZING PRODUCTIVITY LOSS WHILE USING A MANUFACTURING SCHEDULER - Tools and/or resources which newly become available to a re-entrant flow manufacturing line, data processing pipeline or the like are allocated in substantially real time to processing operations independent of and consistent with a scheduling segment previously generated by dispatching items such as workpieces or data to tools and/or resources of a manufacturing line until the newly available tool or resource can be conveniently included in a subsequently generated schedule segment in order to avoid productivity loss due to schedule latency. Items can be dispatched in a priority order to accelerate completion of processing. A schedule segment including the newly available tool or resource can be facilitated by merging allocations of a real time dispatch list with allocations of a dispatch list corresponding to a previously generated schedule segment.",
            "METHOD FOR MINIMIZING PRODUCTIVITY LOSS WHILE USING A MANUFACTURING SCHEDULER - Tools and/or resources which newly become available to a re-entrant flow manufacturing line, data processing pipeline or the like are allocated in substantially real time to processing operations independent of and consistent with a scheduling segment previously generated by dispatching items such as workpieces or data to tools and/or resources of a manufacturing line until the newly available tool or resource can be conveniently included in a subsequently generated schedule segment in order to avoid productivity loss due to schedule latency. Items can be dispatched in a priority order to accelerate completion of processing. A schedule segment including the newly available tool or resource can be facilitated by merging allocations of a real time dispatch list with allocations of a dispatch list corresponding to a previously generated schedule segment."
        ],
        [
            "Published",
            "12-03-2009",
            "08-09-2012"
        ]
    ],
    "pageTitle": "Kent, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kent-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 437610095,
    "recordOffset": 437579813,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Heath C. Kent, Norwalk, CT US 07-04-2013 Eyeglass System - An eyeglass system having interchangeable components. The eyeglass system includes right and left temples that are connected to a front frame via a decorative pin. The pin is easily removed to allow one to replace the temples with those having another style, or use the temples with another frame. A front cover can also be connected to the frame via the pin to further change the style or design of the eyeglasses. 20130169923 Published Description Patent application number Gwendolyn R. Kent, Lake Forest, IL US 04-21-2011 DRAW TAPE BAG WITH SIDE SEAL ATTACHED ELASTIC STRIP - The bag includes a draw tape that may be used to cinch closed the opening of the bag. The bag may include at least one stretched elastomeric strip attached to the bag edges or the ends of the draw tape in an extended condition. In one embodiment, the draw tape is elastic and is attached to the bag edges. 20110091137 12-02-2010 Draw Tape Bag - The bag may include a draw tape that may be used to cinch closed the opening of the bag. The draw tape has at least one stretched elastomeric strip attached to the draw tape in an extended condition. The draw tape may be smaller in size than the bag sidewalls. The draw tape may include an elastic characteristic, such as patterned",
    "textAfterTable": "James Kent, Gahanna, OH US Patent application number Description Published 20080275903 FLEXIBLE INTERFACE USING SCALABLE VECTOR GRAPHICS WITH METALEVEL PALETTE - The present invention provides a method and system of storing information for drawing an object on a computer system that includes providing a palette file that includes a set of first labels matched with numerical values, tagging a vector graphics file for drawing the object with second labels, translating the second labels into one or more of the first labels, and plugging in values stored in the palette file associated with the translated second labels into the tagged vector graphics file. 11-06-2008 James P. Kent, Minneapolis, MN US Patent application number Description Published 20110028831 PERMANENTLY VISIBLE IMPLANTABLE FIDUCIARY TISSUE MARKER - A fiduciary marker includes a hollow cylindrical body comprised of a bio-compatible polymer and including a first end, a second end, an inner surface extending between the first end to the second end and an outer surface extending between the first end to the second end. A plurality of apertures are formed in the body and extend from the inner surface to the outer surface. 02-03-2011 James R. Kent, Gahanna, OH US Patent application number Description Published 20090201290 Methods and Systems for Scoring Multiple Time-Based Assets and Events - The methods and systems for scoring multiple time-based",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}