{
    "relation": [
        [
            "First Name",
            "Ruth",
            "April"
        ],
        [
            "Last Name",
            "Flower",
            "Mays"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=4BAF01E6-CBE0-443A-8FA2-A6C679FA317F&filingTypeID=78",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221549947,
    "recordOffset": 221541745,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 51446=H.R. 1876, Healthy Families Act, all provisions S. 984, Healthy Families Act, all provisions, 32076=H.R. 910, Energy Tax Prevention Act of 2011, all provisions S. 228, Defending America's Affordable Energy and Jobs Act, all provisions S. 231, EPA Stationary Source Regulations Suspension Act, all provisions S. 482, Energy Tax Prevention Act of 2011, all provisions, 22818=H.R. 780, Responsible End to the War in Afghanistan Act, all provisions H.R. 1540, National Defense Authorization Act for Fiscal Year 2012, Title X, provisions relating to implementation of the New START Treaty; Title XXXI, provisions relating to the National Nuclear Security Administration; and the bill as a whole H.R. 1735, Afghanistan Exit and Accountability Act, all provisions S. 1867, National Defense Authorization Act for Fiscal Year 2012, Title XXXI, provisions relating to the National Nuclear Security Administration; and the bill as a whole, 48581=S. 1262, Native Culture, Language and Access for Success in Schools Act, all provisions S. 1763, Stand Against Violence and Empower Native Women Act, all provisions S. 1925, Violence Against Women Reauthorization Act of 2011, provisions relating to Native American women, 12235=H.J.Res. 2, Proposing a balanced budget amendment to the Constitution of the United States., all provisions H.J.Res. 79, Continuing Appropriations Resolution, 2012, Sec. 702, 703 and 710, provisions relations to funding for the Department of Homeland Security H.R. 2055, Consolidated Appropriations Act, 2012, Division A, Title VIII, provisions relating to Afghanistan and Pakistan; Division B, Title III, provisions relating to Atomic Energy Defense Activities; and Division I, Department of State, Foreign Operations and Related Programs Appropriations Act, 2012, all provisions H.R. 2112, Consolidated and Further Continuing Appropriations Act, 2012, all provisions H.R. 2219, Department of Defense Appropriations Act, 2012, Title VIII, provisions relating to Afghanistan and Pakistan H.R. 2354, Energy and Water Development and Related Agencies Appropriations Act, 2012, Title III, provisions relating to Atomic Energy Defense Activities Unnumbered House bill, implementing the recommendations of the Joint Select Committee on Deficit Reduction, all provisions S. 1601, Department of State, Foreign Operations, and Related Programs Appropriations Act, 2012, all provisions S.J.Res. 23, A joint resolution proposing an amendment to the Constitution of the United States relative to balancing the budget, all provisions S.J.Res. 24, Joint resolution proposing a balanced budget amendment to the Constitution of the United States, all provisions Unnumbered Senate bill, implementing the recommendations of the Joint Select Committee on Deficit Reduction, all provisions, 37652=H.R. 1530, To establish the Afghanistan-Pakistan Study Group, all provisions H.R. 1905, Iran Threat Reduction Act of 2011, all provisions H.R. 2757, Iraq Withdrawal Accountability Act of 2011, all provisions H.R. 2829, United Nations Transparency, Accountability, and Reform Act of 2011, all provisions H.R. 2859, Repeal of the Authorization for Use of Military Force, all provisions Treaty Doc. 103-39, United Nations Convention on the Law of the Sea, all provisions Treaty Doc. 105-28, Comprehensive Test Ban Treaty, all provisions Unnumbered treaty, further nuclear arms reduction treaty between the United States and Russia, all provisions, 45572=H.R. 3012, Fairness for High-Skilled Immigrants Act of 2011, all provisions S. 1258, Comprehensive Immigration Reform Act of 2011, all provisions Request for Janet Napolitano, Secretary of Homeland Security, to use caution with immigrants detained through U.S. Immigration and Customs Enforcement in Alabama because of the anti-immigrant law, HB 56, 54158=H.R. 3630 (House bill), Middle Class Tax Relief and Job Creation Act of 2011, Sec. 501, relating to Keystone XL pipeline; and the bill as a whole H.R. 3630 (Senate bill), Temporary Payroll Tax Cut Continuation Act of 2011, the bill as a hole, 28301=H.R. 2250, EPA Regulatory Relief Act of 2011, all provisions H.R. 2307, Ethanol Subsidy Repeal Act, all provisions H.R. 3537, North American Energy Security Act, all provisions S. 398, Implementation of National Consensus Appliance Agreements Act of 2011, all provisions S. 741, A bill to amend the Public Utility Regulatory Policies Act of 1978 to establish a renewable electricity standard, all provisions S. 884, Domestic Energy Promotion Act of 2011, all provisions S.1000, Energy Savings and Industrial Competitiveness Act of 2011, all provisions, 35550=H.R. 822, National Right-to-Carry Reciprocity Act of 2011, all provisions}",
    "textBeforeTable": "",
    "textAfterTable": "City WASHINGTON State DC Zip Code 20002 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  David Culp  2025476000  david@fcnl.org 5. Senate ID#  15532-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}