{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "We have officers on campus at all times, and emergency call boxes",
            "I don't believe we have it on the St. Pete campus, but maybe at the Tampa campus.",
            "There is a huge amount of clubs on campus. They will be featured in the courtyard every semester, so you can choose which one you like!",
            "Environmental majors, art/graphic design majors, bio majors.",
            "The school isn't really old enough for that, but lets make some!",
            "Affordable, and nice.",
            "There are tons of ways to get involved on campus! If that doesn't excited you, there is also downtown, museums, and the beach near by!",
            "If you are a first year student you will be required to pay for a meal plan. The staff is awesome, and the food isn't too bad, but I would prefer to cook for myself.",
            "Large dorms available. My dorm is four bedroom, two bath, living room, and kitchen! Right by the water, and a five minute walk to down town!",
            "Like in any other learning facility, the output of what you get depends on your input.",
            "Take advantage of the small classrooms. If you are interested in an enviromental degree or an art degree this campus is perfect. It s located right on the water (great research opportunities!), the campus it right by the Dali museum and the Fine Arts museum, and for those premed students.. there is even an All Children's Hospital down the street!",
            "The campus at USFSP is breathtaking. You'll love study breaks by the water, and waterfront activities that are perks of being s student. The campus is small, so you are sure to get to know your teachers much more personally."
        ]
    ],
    "pageTitle": "University of South Florida St. Petersburg Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-South-Florida-St-Petersburg/reviews?_escaped_fragment_=/show/33015",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 884307691,
    "recordOffset": 884261539,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{37959=The dorms are all new. One opens this fall 2012. The oldest resident hall we have is only 7yrs old., 11355=The dorms are beautiful! RHO was built in 2006 and it is still fairly new. Another awesome building (which is where I'll be living) is almost finished and will be open this fall(2012). Lots of great people. If you're looking for a party school, you might want to go somewhere else., 37590=We have a brand new dining hall opening this year fall of 2012 so it should be great., 209068=© 2015, Cappex.com, LLC, 31584=The St.Pete campus only had one dorm building, and the overflow had to live in the hotel down the street (with-in walking distance) for a more expensive price. However, they built another building and is set to open Fall 2012 which will serve as student living, activity center and more., 35535=We don't have a greek life yet but we are working on a couple for this fall 2012.}",
    "textBeforeTable": "02/29/2012 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 49 Elna from Valrico, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. University of South Florida St. Petersburg Reviews University of South Florida St. Petersburg › Florida › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Login to rate or flag the reviews Bridgit from Coral Springs, FL 02/08/2012 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 49 Categories Comments Clubs and Activities so many clubs to choose from, such as: barbecue club, gardening club, criminology club and way more. Share any unusual traditions or locations on campus located on the water which is a nice and relaxing place to study or de-stress. What to do for fun hang out with my roommates, attend campus activities, enjoy the downtown st. pete since everything is in walking distance. Tips for prospective students if you enjoy one on one help from your teachers over being just a number in a bigger university then this is the place for you. In three sentences this school is quiet, small, productive and overall a great place to study and receive an education",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}