{
    "relation": [
        [
            "Task",
            "1. Load the Diskette",
            "2. Examine its Contents",
            "3. Exchange Files",
            "4. Is Diskette Still in Use?",
            "5. Eject the Diskette"
        ],
        [
            "Description",
            "Insert the diskette into its drive and enter the volcheck command.",
            "Optional. To examine the contents of the diskette, look in the appropriate directory under /diskette.",
            "Optional. Copy files or directories between the diskette and your file system.",
            "Optional. Before ejecting the diskette, find out if the diskette is still in use.",
            "When you finish, eject the diskette from its drive."
        ],
        [
            "For Instructions, Go To",
            "\"How to Load a Diskette\"",
            "\"How to Examine the Contents of a Diskette\"",
            "\"How to Copy or Move Information From a Diskette\" \"How to Copy or Move Information to a Diskette\"",
            "\"How to Find Out If a Diskette Is Still in Use\"",
            "\"How to Eject a Diskette\""
        ]
    ],
    "pageTitle": "Chapter 16 Formatting and Using Diskettes From the Command Line (Tasks) (System Administration Guide, Volume 1)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19455-01/805-7228/6j6q7ueqo/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 69418103,
    "recordOffset": 69399629,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Thu, 03 Feb 2011 11:24:25 GMT",
    "textBeforeTable": "Table 16-1 Formatting Diskettes Task Map Formatting Diskettes Task Map \"How to Make Local Diskettes Available to Other Systems\" \"How to Access Diskettes on Other Systems\" \"How to Eject a Diskette\" \"How to Find Out If a Diskette Is Still in Use\" \"How to Copy or Move Information to a Diskette\" \"How to Copy or Move Information From a Diskette\" \"How to Examine the Contents of a Diskette\" \"How to Load a Diskette\" \"How to Format a DOS Diskette\" \"How to Place a UFS File System on a Diskette\" \"How to Format a UFS Diskette\" This chapter describes all the tasks required to format and use diskettes from the command line in the Solaris environment. This is a list of the step-by-step instructions in this chapter. Chapter 16 Formatting and Using Diskettes From the Command Line (Tasks) Next: Chapter 17 Using PCMCIA Memory Cards From the Command Line (Tasks) Previous: Chapter 15 Using CDs From the Command Line (Tasks)",
    "textAfterTable": "Using Diskette Names When working with diskettes, you can identify them by name or with a designator from Table 16-2. For brevity, task descriptions use floppy0, but you can replace this with either the diskette name or a different designator. Table 16-2 How to Identify Diskettes Diskette  Alternate Name  First diskette drive  floppy0 Second diskette drive  floppy1 Third diskette drive  floppy2 Note - Diskettes that are not named (that is, they have no \"label\") are assigned the default name of noname. Hardware Considerations A Solaris system can format diskettes for use on both Solaris and DOS systems. However, the hardware platform imposes some limitations. They are summarized in the table below. Solaris On This Platform ...  Can Format Diskettes For ... ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}