{
    "relation": [
        [
            "Name",
            "Gronland balinası",
            "Grönland balinası"
        ],
        [
            "Sources",
            "World Register of Marine Species (WoRMS)",
            "World Register of Marine Species (WoRMS)"
        ],
        [
            "Status",
            "Trusted",
            "Trusted"
        ]
    ],
    "pageTitle": "Common Names for Bowhead Whale (Balaena mysticetus) - Encyclopedia of Life",
    "title": "",
    "url": "http://www.eol.org/pages/328577/names/common_names",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432004647,
    "recordOffset": 431988253,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "English marks the preferred name for each language. Common names listed by language 3 synonyms 107 common names 4 related names 6 classifications Many people know organisms only by the common names, or \"vernacular\" names. Unlike scientific names, common names are almost always different for speakers of different languages. They may also vary regionally within a language. This tab shows all the common names provided to EOL for this organism from a variety of providers, including EOL curators. Currently we can only set one preferred common name per language on a given EOL page, but all the names should be searchable. Updates Literature Resources Community Names 8 Maps 69 Media Data Detail Overview Add to a collection Bowhead Whale learn more about names for this taxon Balaena mysticetus &mdash; Common names",
    "textAfterTable": "baleine a tete d'arc World Register of Marine Species (WoRMS) Trusted black right whale Integrated Taxonomic Information System (ITIS), Species 2000 & ITIS Catalogue of Life: April 2013, World Register of Marine Species (WoRMS), uBio Trusted bowhead Animal Diversity Web Descriptions, IUCN Red List, Integrated Taxonomic Information System (ITIS), NCBI Taxonomy, NatureServe resource, Species 2000 & ITIS Catalogue of Life: April 2013, uBio Trusted bowhead whale Anage Data, IUCN Red List, Integrated Taxonomic Information System (ITIS), Leo Shapiro, Monthly ARKive text import , NCBI Taxonomy, Paleobiology Database, Species 2000 & ITIS Catalogue of Life: April 2013, World Register of Marine Species (WoRMS), uBio Trusted bunch-back whale World Register of Marine Species (WoRMS) Trusted Common whale uBio Unknown Great polar whale World Register of Marine Species (WoRMS), uBio Trusted Greenland right whale IUCN Red List, NCBI Taxonomy, World Register of Marine Species (WoRMS), uBio Trusted Greenland whale World Register of Marine Species (WoRMS) Trusted Greenland white whale uBio Unknown Right whale uBio Unknown",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}