{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Food and Dining",
            "In three sentences"
        ],
        [
            "Comments",
            "Creative types",
            "The food and dining the college offers isn't that great.",
            "University of the Arts is a non-profit accredited art school that offers numerous majors. However, one of the down sides of The University of the Arts is it has inconvenient labs hours and doesn't offer 24 hour access to the University until the end of the semester. If your looking for an accredited art school in the Philadelphia area that offers majors such as film,game design, performing arts and graphic design come check out University of the Arts."
        ]
    ],
    "pageTitle": "The University of the Arts Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/The-University-of-the-Arts/reviews?_escaped_fragment_=/show/38494",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 880630203,
    "recordOffset": 880593223,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{115384=They have changed the curriculum for this year (2013-2014). Most of the work is foundation, and really stretching your creativity in the arts. You get to explore different mediums and learn new techniques., 132433=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/13/2010 Reviewer is A current student here. 17 out of 18 people found this review useful. 1 of 31 Brittney from Warminster, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {//",
    "textAfterTable": "Am enjoying being here I love University of the Arts. The teachers are incredibly helpful. I feel that U Arts is like a big extended family for me. It is also in Philadelphia which means that there is always something to do. Am learning a lot My major is photography and in high school that was the only art class that I took with the exception of crafts. At University of the Arts I am learning all different forms of art that I wouldn't be able to learn anywhere else. Login to rate or flag the reviews Ixchel from Fredericksburg, VA 11/22/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 2 of 31 Categories Comments Great for these types of students Uarts is great for any artist! Dancers, Musical Theater, Theater, Musicians, Vocal Performers, Illustrators, Animators, Painters, Sculptors, Photography, Graphic Design, Writers, to name a few. Anyone who wants to learn about their",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}