{
    "relation": [
        [
            "First Name",
            "Bruce",
            "David",
            "Cynthia",
            "Francesca",
            "Ken",
            "MaryAnne",
            "Matthew"
        ],
        [
            "Last Name",
            "Yarwood",
            "Hebert",
            "Morton",
            "Fierro O'Reilly",
            "Preede",
            "Sapio",
            "Smyth"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "President & CEO",
            "SVP of Policy and Government Relations",
            "Sr Director of Congressional Affairs",
            "Sr Director of Legislative Affairs",
            "Director of Government Relations",
            "Director of Government Relations",
            "Director of Grassroots and Member Advocacy"
        ],
        [
            "New",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=3C7F997E-210F-436F-AA60-4D1FB698A875&filingTypeID=51",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 222052267,
    "recordOffset": 222042210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60321=H.R.312 - To authorize the presentation of flags at the funerals of civilian Federal employees engaged in the support of military operations who have died in combat zones in the course of their duties. S.CON.RES.70 - An original concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2009 and including the appropriate budgetary levels for fiscal years 2008 and 2010 through 2013. H.R.3043 - Making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2008, and for other purposes. H.R.3013 - To provide appropriate protection to attorney-client privileged communications and attorney work product. H.R.2764 - Making appropriations for the Department of State, foreign operations, and related programs for the fiscal year ending September 30, 2008, and for other purposes. H.R.3222 - Making appropriations for the Department of Defense for the fiscal year ending September 30, 2008, and for other purposes. H.R.4156 - Making emergency supplemental appropriations for the Department of Defense for the fiscal year ending September 30, 2008, and for other purposes. S.1710 - An original bill making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2008, and for other purposes., 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 67556=H.R.2406 - To authorize the National Institute of Standards and Technology to increase its efforts in support of the integration of the healthcare information enterprise in the United States. S.1408 - A bill to improve quality in health care by providing incentives for adoption of modern information technology. S.1693 - A bill to enhance the adoption of a nationwide interoperable health information technology system and to improve the quality and reduce the costs of health care in the United States., 47553=H.R.1644 - To amend the National Labor Relations Act to clarify the definition of \"supervisor\" for purposes of such Act. H.R.800 - To amend the National Labor Relations Act to establish an efficient system to enable employees to form, join, or assist labor organizations, to provide for mandatory injunctions for unfair labor practices during organizing efforts, and for other purposes. H.R.378 - To direct the Secretary of Labor to issue an occupational safety and health standard to reduce injuries to patients, direct-care registered nurses, and other health care providers by establishing a safe patient handling standard. S.969 - A bill to amend the National Labor Relations Act to modify the definition of supervisor. S.1322 - A bill to amend the Internal Revenue Code of 1986 to improve the operation of employee stock ownership plans, and for other purposes., 22835=HR 2807 - To intensify stem cell research showing evidence of substantial clinical benefit to patients, and for other purposes. HR 1783 - To amend the Social Security Act to enhance the social security of the Nation by ensuring adequate public-private infrastructure and to resolve to prevent, detect, treat, intervene in, and prosecute elder abuse, neglect, and exploitation, & for other purposes. H.R.2521 - To provide loans and grants for fire sprinkler retrofitting in nursing facilities. H.R.3025 - To amend title XVIII of the Social Security Act to provide comprehensive improvements to the Medicare Prescription Drug Program, and for other purposes. H.R.1046 - To amend titles XI and XVIII of the Social Security Act to modernize the quality improvement organization (QIO) program. H.R.1841 - To amend the Social Security Act and the Internal Revenue Code of 1986 to provide for an AmeriCare that assures the provision of health insurance coverage to all residents, and for other purposes. H.R.4082 - To improve the quality of, and access to, long-term care. H.R.976 - An act to amend title XXI of the Social Security Act to extend and improve the Children's Health Insurance Program, and for other purposes. H.R.3784 - To amend title XVIII of the Social Security Act to improve the quality of care in skilled nursing facilities under the Medicare Program through requiring the reporting of expenditures for nursing. H.R.3453 - To amend title XVIII of the Social Security Act to repeal the Medicare competitive bidding demonstration project for clinical laboratory services. H.R.4854 - To amend the provisions of title 31, United States Code, relating to false claims to clarify and make technical amendments to those provisions, and for other purposes. H.R.3180 - To amend title 31, United States Code, to clarify who is an original source for purposes of bringing a qui tam action. H.R.5480 - To respond to a Medicare funding warning. S.1980 - A bill to improve the quality of, and access to, long-term care. S.2662 - A bill to respond to a medicare funding warning. S.2041 - A bill to amend the False Claims Act. S.1693 - A bill to enhance the adoption of a nationwide interoperable health information technology system and to improve the quality and reduce the costs of health care in the United States. S.2641 - A bill to amend title XVIII and XIX of the Social Security Act to improve the transparency of information on skilled nursing facilities and nursing facilities and to clarify and improve the targeting of the enforcement of requirements with respect to such facilities. S.1947 - A bill to amend title XI of the Social Security Act to improve the quality improvement organization (QIO) program. S.2099 - A bill to amend title XVIII of the Social Security Act to repeal the Medicare competitive bidding project for clinical laboratory services. S.1070 - A bill to amend the Social Security Act to enhance the social security of the Nation by ensuring adequate public-private infrastructure and to resolve to prevent, detect, treat, intervene in, and prosecute elder abuse, neglect, and exploitation, and for other purposes. S.1019 - A bill to provide comprehensive reform of the health care system of the United States, and for other purposes. S.1814 - A bill to provide individuals with access to health information of which they are a subject, ensure personal privacy with respect to health related information, promote the use of non-identifiable information for health research, impose criminal and civil penalties for unauthorized use of protected health information, to provide for the strong enforcement of these rights, and to protect States' rights. S.1615 - A bill to provide loans and grants for fire sprinkler retrofitting in nursing facilities. S.845 - A bill to direct the Secretary of Health and Human Services to expand and intensify programs with respect to research and related activities concerning elder falls. S.334 - A bill to provide affordable, guaranteed private health coverage that will make Americans healthier and can never be taken away. S.325 - A bill to provide for innovation in health care through State initiatives that expand coverage and access and improve quality and efficiency in the health care system. S.1980 - A bill to improve the quality of, and access to, long-term care., 39739=H.R.976 - An act to amend title XXI of the Social Security Act to extend and improve the Children's Health Insurance Program, and for other purposes. H.R.1841 - To amend the Social Security Act and the Internal Revenue Code of 1986 to provide for an AmeriCare that assures the provision of health insurance coverage to all residents, and for other purposes. H.R.3912 - To provide for the transfer of naval vessels to certain foreign recipients. H.R.819 - To expand access to preventive health care services that help reduce unintended pregnancy, reduce abortions, and improve access to women's health care. H.R.3088 - To amend the Internal Revenue Code of 1986 to provide that distributions from an individual retirement plan, a section 401(k) plan, a section 403(b) contract, or a section 457 plan shall not be includible in gross income to the extent used to pay long-term care insurance premiums. S.334 - A bill to provide affordable, guaranteed private health coverage that will make Americans healthier and can never be taken away. S.504 - A bill to amend the Internal Revenue Code of 1986 to establish long-term care trust accounts and allow a refundable tax credit for contributions to such accounts, and for other purposes. S.1019 - A bill to provide comprehensive reform of the health care system of the United States, and for other purposes. S.1809 - A bill to amend the Internal Revenue Code of 1986 to provide that distributions from an individual retirement plan, a section 401(k) plan, a section 403(b) contract, or a section 457 plan shall not be includible in gross income to the extent used to pay long-term care insurance premiums. S.1244 - A bill to amend the Occupational Safety and Health Act of 1970 to expand coverage under the Act, to increase protections for whistleblowers, to increase penalties for certain violators, and for other purposes., 54285=H.R.1645 - To provide for comprehensive immigration reform, and for other purposes. S.1639 - A bill to provide for comprehensive immigration reform and for other purposes., 33110=H.R.2580 - To improve patient access to health care services and provide improved medical care by reducing the excessive burden the liability system places on the health care delivery system. H.R.3010 - To amend chapter 1 of title 9 of United States Code with respect to arbitration. S.2838 - A bill to amend chapter 1 of title 9 of United States Code with respect to arbitration. S.243 - A bill to improve patient access to health care services and provide improved medical care by reducing the excessive burden the liability system places on the health care delivery system. S.1481 - A bill to restore fairness and reliability to the medical justice system and promote patient safety by fostering alternatives to current medical tort litigation, and for other purposes., 73787=H.R.1591 - Making emergency supplemental appropriations for the fiscal year ending September 30, 2007, and for other purposes. H.R.2521 - To provide loans and grants for fire sprinkler retrofitting in nursing facilities. H.R.2207 - Making supplemental appropriations for agricultural and other emergency assistance for the fiscal year ending September 30, 2007, and for other purposes. H.R.2206 - Making emergency supplemental appropriations and additional supplemental appropriations for agricultural and other emergency assistance for the fiscal year ending September 30, 2007, and for other purposes. H.R.2882 - To authorize the Secretary of Health and Human Services to make grants to promote professional retrofit installation of fire alarm detection systems and other fire detection and prevention technologies in nursing homes, hospice facilities, and other appropriate facilities. S.1615 - A bill to provide loans and grants for fire sprinkler retrofitting in nursing facilities. S.965 - An original bill making emergency supplemental appropriations for the fiscal year ending September 30, 2007, and for other purposes. S.1621 - A bill to amend the Internal Revenue Code of 1986 to treat certain farming business machinery and equipment as 5-year property for purposes of depreciation., 12218=HR 3025 - To amend title XVII of the Social Security Act to provide comprehensive improvements to the Medicare Prescription Drug Program, and for other purposes. HR 1459 - To improve Medicare beneficiary access by extending the 60 percent compliance threshold d to determie whether a hospital or unit is an impatient rehabilitation facility. H.R.976 - An act to amend title XXI of the Social Security Act to extend and improve the Children's Health Insurance Program, and for other purposes. H.R.562 - To amend title XVIII of the Social Security Act to ensure and foster continued patient quality of care by establishing facility and patient criteria for long-term care hospitals and related improvements under the Medicare Program. H.R.4105 - To impose a moratorium on the use of recovery audit contractors under the Medicare Integrity Program. H.R.3162 - To amend titles XVIII, XIX, and XXI of the Social Security Act to extend and improve the children's health insurance program, to improve beneficiary protections under the Medicare, Medicaid, and the CHIP program, and for other purposes. H.R.1621 - To amend title XIX of the Social Security Act to provide individuals with disabilities and older Americans with equal access to community-based attendant services and supports, and for other purposes. H.R.1536 - To amend part D of title XVIII of the Social Security Act to assist low-income individuals in obtaining subsidized prescription drug coverage under the Medicare prescription drug program by expediting the application and qualification process and by revising the resource standards used to determine eligibility for such subsidies, and for other purposes. H.R.4541 - To amend title XVIII of the Social Security Act to provide for patient protections under the Medicare prescription drug program for residents of long term care facilities. H.R.3963 - To amend title XXI of the Social Security Act to extend and improve the Children's Health Insurance Program, and for other purposes. H.R.5604 - To amend title XVIII of the Social Security Act to reduce cost-sharing under part D of such title for certain non-institutionalized full-benefit dual eligible individuals. S.543 - A bill to improve Medicare beneficiary access by extending the 60 percent compliance threshold used to determine whether a hospital or unit of a hospital is an inpatient rehabilitation facility under the Medicare program. S.1107 - A bill to amend title XVIII of the Social Security Act to reduce cost-sharing under part D of such title for certain non-institutionalized full-benefit dual eligible individuals. S.1893 - An original bill to amend title XXI of the Social Security Act to reauthorize the State Children's Health Insurance Program, and for other purposes. S.338 - A bill to amend title XVIII of the Social Security Act to ensure and foster continued patient quality of care by establishing facility and patient criteria for long-term care hospitals and related improvements under the Medicare program. S.2499 - A bill to amend titles XVIII, XIX, and XXI of the Social Security Act to extend provisions under the Medicare, Medicaid, and SCHIP programs, and for other purposes. S.2396 - A bill to amend title XI of the Social Security Act to modernize the quality improvement organization (QIO) program. S.2708 - A bill to amend the Public Health Service Act to attract and retain trained health care professionals and direct care workers dedicated to providing quality care to the growing population of older Americans. S.2705 - A bill to authorize programs to increase the number of nurses within the Armed Forces through assistance for service as nurse faculty or education as nurses, and for other purposes. S.2786 - A bill to amend title XVIII of the Social Security Act to improve access to health care under the Medicare program for beneficiaries residing in rural areas. H.R.5613 - To extend certain moratoria and impose additional moratoria on certain Medicaid regulations through April 1, 2009.}",
    "textBeforeTable": "",
    "textAfterTable": "b. Telephone Number c. E-mail  Ms.  Meghan O'Reilly  2022907643  moreilly@ahca.org 5. Senate ID#  2491-12 7. Client Name Self Check if client is a state or local government or instrumentality  American Health Care Association 6. House ID#  316080000 TYPE OF REPORT 8. Year  2008 Q1 (1/1 - 3/31) Q2 (4/1 - 6/30) Q3 (7/1 - 9/30) Q4 (10/1 - 12/31) 9. Check if this filing amends a previously filed version of this report 10. Check if this is a Termination Report",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}