{
    "relation": [
        [
            "Name",
            "csf-key",
            "role"
        ],
        [
            "Description",
            "Credential Store Key that maps to a username and password in the Oracle Platform Security Services identity store. Default settings: Value—Not set Default—basic.credentials ContentType—Required Description—Not set",
            "SOAP role. Default settings: Value—Not set Default—ultimateReceiver ContentType—Constant Description—Not set"
        ]
    ],
    "pageTitle": "C Predefined Assertion Templates",
    "title": "",
    "url": "http://docs.oracle.com/cd/E21764_01/web.1111/b32511/assertions.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 71963599,
    "recordOffset": 71923001,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:19:25 GMT",
    "textBeforeTable": "Table C-26 wss_http_token_over_ssl_client_template Configurations For information about overriding policies, see \"Attaching Client Policies Permitting Overrides\". Table C-26 lists the configuration properties and the default settings for the wss_http_token_over_ssl_client_template assertion template. For details about the configuration property settings, see \"Editing the Configuration Properties\". Configurations Disabled Flag that specifies whether to include a timestamp. A timestamp can be used to prevent replay attacks by identifying an expiration time after which the message is no longer valid. Transport Security—Include Timestamp Disabled Disabled—One-way authentication is required. The service must authenticate itself to the client, but the client is not required to authenticate itself to the service. Enabled—The service must authenticate itself to the client, and the client must authenticate itself to the service. Flag that specifies whether two-way authentication is required. Valid values include: Transport Security—Mutual Authentication Required None Name of the authentication header. Authentication Header—Header Name basic custom—Not supported in this release. Custom authentication mechanism. cert—Not supported in this release. Client",
    "textAfterTable": "oracle/wss_http_token_over_ssl_service_template The wss_http_token_over_ssl_service_template assertion template extracts the credentials in the HTTP header and authenticates users against the Oracle Platform Security Services identity store. Settings The settings for the wss_http_token_over_ssl_service_template assertion template are identical to the client version of the assertion template. See Table C-25 for information on the settings. Configurations Table C-27 lists the configuration properties and the default settings for the wss_http_token_service_template assertion template. For details about the configuration property settings, see \"Editing the Configuration Properties\". For information about overriding policies, see \"Attaching Client Policies Permitting Overrides\". Table C-27 wss_http_token_over_ssl_service_template Configurations Name Description realm HTTP Realm. Default settings: Value—Not set Default—owsm ContentType—Constant Description—Not set role SOAP role. Default settings: Value—Not set Default—ultimateReceiver ContentType—Constant Description—Not set oracle/wss_saml_token_bearer_over_ssl_client_template The wss_saml_token_bearer_over_ssl_client template assertion template includes SAML tokens in outbound SOAP request messages. The SAML token with confirmation method [",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}