{
    "relation": [
        [
            "Exhibit Number",
            "2.1",
            "2.2",
            "3.1",
            "3.2",
            "3.3",
            "10.1",
            "10.2",
            "10.3",
            "10.4",
            "10.5",
            "10.6",
            "10.7",
            "10.8",
            "10.9",
            "10.10",
            "10.11",
            "10.12",
            "10.13",
            "10.14",
            "10.15",
            "10.16"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description",
            "Agreement and Plan of Merger and Reorganization, dated as of September 1, 2011, by and among Blue Calypso, Inc., Blue Calypso Acquisition Corp., and Blue Calypso Holdings, Inc. (incorporated by reference to Exhibit 2.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Agreement and Plan of Merger, dated September 9, 2011, by and between Blue Calypso, Inc., a Nevada corporation, and Blue Calypso, Inc., a Delaware corporation (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 15, 2011)",
            "Certificate of Incorporation (incorporated by reference to Exhibit 3.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on October 19, 2011)",
            "Certificate of Designation of Series A Convertible Preferred Stock (incorporated by reference to Exhibit 3.2 to Current Report on Form 8-K filed with the Securities and Exchange Commission on October 19, 2011)",
            "Bylaws of Blue Calypso, Inc., a Delaware corporation, adopted September 9, 2011 (incorporated by reference to Exhibit 3.3 to Current Report on Form 8-K filed with the Securities and Exchange Commission on October 19, 2011)",
            "2011 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Form of Incentive Stock Option Agreement (incorporated by reference to Exhibit 10.2 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Form of Non-Qualified Stock Option Agreement (incorporated by reference to Exhibit 10.3 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Form Restricted Stock Award Agreement (incorporated by reference to Exhibit 10.4 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Agreement of Conveyance, Transfer and Assignment of Assets and Assumption of Obligations, dated as of September 1, 2011 (incorporated by reference to Exhibit 10.5 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Stock Purchase Agreement, by and between Blue Calypso, Inc. and Deborah Flores, dated as of September 1, 2011 (incorporated by reference to Exhibit 10.6 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Securities Purchase Agreement, dated as of September 1, 2011, by and among Blue Calypso, Inc. and certain purchasers set forth therein (incorporated by reference to Exhibit 10.7 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Registration Rights Agreement, dated as of September 1, 2011, by and among Blue Calypso, Inc. and certain purchasers set forth therein (incorporated by reference to Exhibit 10.9 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Form of Warrant (incorporated by reference to Exhibit 10.10 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011)",
            "Letter Agreement, dated January 16, 2012, by and between Blue Calypso, Inc. and Aztec Systems, Inc. (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on January 20, 2012)",
            "Promissory Note, dated January 17, 2012, issued by Blue Calypso, Inc. to Aztec Systems, Inc. (incorporated by reference to Exhibit 10.2 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on January 20, 2012)",
            "Securities Purchase Agreement, dated April 19, 2012, by and between Blue Calypso, Inc. and the Buyer thereto (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012)",
            "Senior Secured Convertible Note issued April 19, 2012 (incorporated by reference to Exhibit 10.2 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012)",
            "Common Stock Purchase Warrant issued April 19, 2012 (incorporated by reference to Exhibit 10.3 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012)",
            "Security Agreement, dated April 19, 2012, by and between the Company, Blue Calypso, LLC and the Buyer (incorporated by reference to Exhibit 10.4 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012)",
            "Intellectual Property Security Agreement, dated April 19, 2012, by and between the Company, Blue Calypso, LLC, and the Buyer (incorporated by reference to Exhibit 10.5 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012)"
        ]
    ],
    "pageTitle": "bcyp10Q1_2012_amendment",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1399587/000151316213000750/bcyp_1q10qa2012.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 693912923,
    "recordOffset": 693857022,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{950505=Letter Agreement, dated January 16, 2012, by and between Blue Calypso, Inc. and Aztec Systems, Inc. (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on January 20, 2012), 867098=Cash used in operating activities during the three months ended March 31, 2012 was $718,258, as compared to $92,692 for the three months ended March 31, 2011.  The change was due to an $1,611,028 increase in net loss, offset by the non-cash expense for deferred stock option compensation of $763,480 and a non-cash loss associated with the change in the fair value of derivative liabilities of $426,580.  The other significant factor was the conversion of the accounts payable balance owed to Aztec Systems Inc. in the aggregate amount of $254,993, to a promissory note on January 1, 2012., 871838=We are a development stage company and have incurred cumulative losses of $14,318,115 since beginning operations on September 11, 2009.  At March 31, 2012, we had a cash balance of $21,155 and negative working capital of $12,528,598.  On October 17, 2011, $1,500,000 of our convertible promissory notes converted into 1,500,000 shares of our Series A Convertible Preferred Stock.  On September 1, 2011, $1,475,000 of notes payable converted to 28,135,234 shares of common stock as part of the reverse merger.  Funding for our operations has been primarily dependent upon the proceeds from the issuance of debt and equity securities., 902952=Agreement of Conveyance, Transfer and Assignment of Assets and Assumption of Obligations, dated as of September 1, 2011 (incorporated by reference to Exhibit 10.5 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 861095=Sales and Marketing. For the three months ended March 31, 2012 sales and marketing expenses increased by $169,994 to $243,425 compared to the same period in 2011.  The increase was due primarily to increased advertising expenses, increased costs related to trade show attendance and increased costs related to additional sales and marketing staff., 899377=2011 Long-Term Incentive Plan (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 907770=Letter Agreement, dated January 16, 2012, by and between Blue Calypso, Inc. and Aztec Systems, Inc. (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on January 20, 2012), 913465=Intellectual Property Security Agreement, dated April 19, 2012, by and between the Company, Blue Calypso, LLC, and the Buyer (incorporated by reference to Exhibit 10.5 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 92232=2012, 920145=Certification of Chief Financial Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002., 736105=December 31,  2011, 18167=As of March 31, 2012 there were 126,845,640 shares of the issuer\u0092s common stock outstanding., 713541=The Company\u0092s free standing derivatives consist of warrants to purchase common stock that were issued in connection with its private placement transactions (see Note 7) and embedded conversion options with convertible notes. The Company evaluated these derivatives to assess their proper classification in the condensed consolidated balance sheets as of March 31, 2012 and December 31, 2011 using the applicable classification criteria enumerated under GAAP. The Company determined that certain common stock purchase warrants and the embedded conversion features do not contain fixed settlement provisions.  The exercise price of such warrants is subject to adjustment in the event that the Company subsequently issues equity securities or equity linked securities with exercise prices lower than the exercise price in these warrants. The convertible notes contained a conversion feature such that the Company could not ensure it would have adequate authorized shares to meet all possible conversion demands., 40920=March 31, 2012, 789100=MARCH 31, 2012, 854648=This quarterly report contains the restated condensed consolidated balance sheet as of December 31, 2011 and the effects of the restated condensed consolidated statements of operations for the three months ended March 31, 2012 and from September 11, 2009 (date of inception) through March 31, 2012.  Refer to Note 2 of the Notes to the accompanying Condensed Consolidated Financial Statements in this Quarterly Report on Form 10-Q for further detail., 750605=The following table sets forth a summary of the changes in the fair value of the Company\u0092s Level 3 financial liabilities that are measured at fair value on a recurring basis for the three months ended March 31, 2012:, 177965=Beginning Balance, September 11, 2009, 904895=Securities Purchase Agreement, dated as of September 1, 2011, by and among Blue Calypso, Inc. and certain purchasers set forth therein (incorporated by reference to Exhibit 10.7 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 722150=In December 2011, the Financial Accounting Standards Board (FASB) issued ASU 2011-10-Property, Plant, and Equipment (Topic 360): De-recognition of in Substance Real Estate\u0097a Scope Clarification (a consensus of the FASB Emerging Issues Task Force). This ASU is effective for periods after June 15, 2012.  We do not expect this ASU 2011-10 to apply to the Company or to have a material effect on the financial position, results of operations or cash flows., 903926=Stock Purchase Agreement, by and between Blue Calypso, Inc. and Deborah Flores, dated as of September 1, 2011 (incorporated by reference to Exhibit 10.6 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 783909=On September 1, 2011 and as part of the reverse merger, the Company issued convertible promissory notes (the \u0093Promissory Notes\u0094) to two accredited investors in a private placement transaction (the \u0093Private Placement\u0094) pursuant to a Securities Purchase Agreement (the \u0093Securities Purchase Agreement\u0094) in the aggregate principal amount of One Million Five Hundred Thousand Dollars ($1,500,000) and five-year warrants (the \u0093Warrants\u0094) to purchase up to 22,091,311 shares of the Company\u0092s common stock at an exercise price of $0.10 per share. The notes are due December 1, 2011 and accrue no interest. The Promissory Notes are automatically convertible at $1 into One Million Five Hundred Thousand (1,500,000) shares of the Company\u0092s Series A Convertible Preferred Stock (\u0093Series A Preferred\u0094) immediately upon the creation of the Series A Preferred by the Company. The Series A Preferred stock was approved October 17, 2011 and the notes were immediately converted into 1,500,000 preferred shares. The Series A Preferred shares are convertible into shares of the Company\u0092s common stock at a conversion rate of $0.0679 per share or 22,091,311 common shares.  During the three months ended March 31, 2012, one of the two accredited investors purchased an additional 200,000 shares of Series A Preferred share that are convertible into the Company\u0092s common stock at the a conversion rate of $0.0679 per share or 2,945,508 shares.  This increased the total convertible warrants to 25,036,818 shares.  The conversion of preferred into common stock is limited to the extent that the beneficial owners own greater that 4.99% of the Company\u0092s common stock., 910674=Senior Secured Convertible Note issued April 19, 2012 (incorporated by reference to Exhibit 10.2 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 881208=Restatement of Previously Issued Financial Statements. On August 26, 2013, after consulting with the Company\u0092s Audit Committee and with the Company\u0092s newly appointed Independent Registered Public Accounting Firm, Marcum LLP, management changed its accounting for certain of the Company\u0092s warrants previously issued in connection with preferred stock and common stock and conversion features related to previously issued convertible notes which were recorded in periods prior to the engagement of Marcum LLP in order to comply with US GAAP. Such warrants and the embedded conversion options should have been reflected as liabilities on the consolidated balance sheets included in the Original 10-Q, rather than as a component of equity., 727833=March 31,  2012, 233773=Restricted shares issued- 9/20/2010, 832445=Prior to September 1, 2011, we were a public shell company without material assets or liabilities. On September 1, 2011, Blue Calypso Holdings, Inc. completed a reverse merger with us, pursuant to which Blue Calypso Holdings, Inc. became our wholly-owned subsidiary and we succeeded to the business of Blue Calypso Holdings, Inc. as our sole line of business and the former security holders of Blue Calypso Holdings, Inc. became our controlling stockholders. For financial reporting purposes, Blue Calypso Holdings, Inc. was the accounting acquirer in the reverse merger and the former public shell company is considered the acquired company. On December 16,,2011 Blue Calypso Holdings, Inc. was merged into its sole-owner, Blue Calypso, Inc.  Accordingly, the historical financial statements presented and the discussion of financial condition and results of operations herein are those of Blue Calypso, Inc., and do not include the historical financial results of our former business. The accumulated earnings of Blue Calypso, Inc. were also carried forward after the reverse merger for all periods presented.  Operations reported for periods prior to the reverse merger are those of Blue Calypso Holdings, Inc., 774140=2015, 670534=Mar 31, 2012, 790045=During 2011 the Company granted options to purchase 2,420,000 shares of the Company\u0092s common stock to non-employee board members and other consultants under the Plan.  The options vest pro rata quarterly over two years.  During the first three months ended March 31, 2012, the Company granted options to purchase 2,495,325 shares of the Company\u0092s common stock to employees and a nonemployee advisory board member.  These options were granted at a range of strike prices and vesting schedules.  The fair value for the Company\u0092s options were estimated at the date of grant using the Black-Scholes option pricing model with the weighted average assumptions as noted in the following table. The Black-Scholes option valuation model incorporate ranges of assumptions for inputs, and those ranges are disclosed below. Expected volatilities are based on similarindustry-sector indices. The expected life of options granted is derived from the output of the option valuation model and represents the period of time that options granted are expected to be outstanding. The risk-free interest rate assumption is based on market yield on U.S. Treasury securities at 2-year constant maturity, quoted on investment basis determined at the date of grant., 755724=Property and equipment consist of the following at March 31, 2012 and December 31, 2011:, 774928=2016, 879011=(a) Evaluation of disclosure controls and procedures. Our management, with the participation of our Chief Executive Officer and Chief Financial Officer, evaluated the effectiveness of our disclosure controls and procedures (as defined in Rule 13a-15 under the Securities Exchange Act of 1934 (the \u0093Exchange Act\u0094)) as of the end of the period covered by this Quarterly Report on Form 10-Q/A. In designing and evaluating the disclosure controls and procedures, management recognizes that any controls and procedures, no matter how well designed and operated, can provide only reasonable assurance of achieving the desired control objectives. In addition, the design of disclosure controls and procedures must reflect the fact that there are resource constraints and that management is required to apply its judgment in evaluating the benefits of possible controls and procedures relative to their costs., 801321=0.2005, 706699=We have presented basic loss per share, computed on the basis of the weighted average number of common shares outstanding during the year, and diluted loss per share, computed on the basis of the weighted average number of common shares and all potentially dilutive common shares outstanding during the year. Potential common shares result from stock options, vesting of restricted stock grants and convertible notes. However, for the years presented, all outstanding stock options, restricted stock grants and convertible notes are anti-dilutive due to the losses incurred. Anti-dilutive common stock equivalents of 57,059,903 were excluded from the loss per share computation for the three months ended March 31, 2012., 786918=The stockholders approved the Blue Calypso, Inc. 2011 Long-Term Incentive Plan (the \u0093Plan\u0094) on September 9, 2011.  The Plan provides for the granting of incentive stock options, nonqualified stock options, stock appreciation rights, restricted stock, restricted stock units, performance awards, dividend equivalent rights, and other awards which may be granted singly, in combination, or in tandem, and which may be paid in cash or shares of common stock.  Subject to certain adjustments, the maximum number of shares of common stock that may be delivered pursuant to awards under the Plan is 35,000,000 shares., 773332=2014, 781291=The Company recorded a gain (loss) on change in fair value of derivative liabilities of ($426,850) and $0 for three months ended March 31, 2012 and 2011, respectively., 217255=Restricted shares issued- 6/10/2010, 927718=Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized., 938341=Agreement and Plan of Merger, dated September 9, 2011, by and between Blue Calypso, Inc., a Nevada corporation, and Blue Calypso, Inc., a Delaware corporation (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 15, 2011), 785835=Blue Calypso, Inc. is authorized to issue 685,000,000 shares of capital stock: 680,000,000 shares of common stock with voting rights at a par value of $.0001 and 5,000,000 shares of Series A Convertible Preferred Stock, also at $.0001 par value per share.  There were 127,045,641 shares of common stock issued and outstanding as of March 31, 2012.  There were 1,700,000 shares of preferred stock were issued and outstanding as of March 31, 2012.  The Company did not make or declare any distributions to shareholders during the quarter ended March 31, 2012 or March 31, 2011., 775736=2017, 850881=Income taxes are recorded in accordance with ASC 740, \u0093Income Taxes.\u0094 Deferred income taxes are recognized for the future tax consequences attributable to temporary differences between the financial statement carrying amounts of existing assets and liabilities and their respective tax bases. Deferred tax assets and liabilities are measured using enacted tax rates expected to apply to taxable income in the years in which those temporary differences are expected to be recovered or settled. The effect on deferred tax assets and liabilities of a change in tax rates is recognized in income in the period that includes the enactment date. An allowance is provided when it is more likely than not that tax benefits will not be utilized, which is the case as of the March 31, 2012 financial statements., 294422=Ending Balance, March 31, 2011, 920944=Certification of Principal Executive Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002., 921747=Certification of Chief Financial Officer pursuant to Section 906 of the Sarbanes-Oxley Act of 2002., 813520=The Company signed an agreement with Aztec Systems, Inc. under January 5, 2012, whereby the outstanding Accounts Payable balance due to Aztec was converted to a Note Payable to Aztec.  The terms of the note provides for Aztec to loan additional monies to the Company up to $30,000 per month until March, 2012.  The note has an interest rate of 8% per annum and is payable in full by September 30, 2012., 809399=Restricted shares issued as of December 31, 2011, 41486=December 31, 2011, 692014=The financial statements are stated in U.S. dollars and include the accounts of Blue Calypso, Inc. and BCHI which were merged effective December 16, 2011. The financial statements have been prepared in accordance with accounting principles generally accepted in the United States of America., 915661=Subsidiary Guarantee, dated April 19, 2012, by Blue Calypso, LLC, in favor of the Buyer (incorporated by reference to Exhibit 10.6 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 717317=Significant concentrations of credit risk may arise from the Company\u0092s cash maintained in the bank.  The Company maintains cash in quality financial institution, however, at times, cash balance may exceed the federal deposit insurance limits (FDIC limits).  As of March 31, 2012 the cash balance with the bank exceeded the $250,000 FDIC limit, but is covered under the temporary unlimited deposit insurance coverage for non-interest bearing transaction accounts through March 31, 2012, and so there was no significant credit risk., 778259=In assessing the realizability of deferred tax assets, management considers whether it is more likely than not that some portion or all of the deferred tax assets will not be realized. The ultimate realization of deferred tax assets is dependent upon the generation of future taxable income during the periods in which those temporary differences become deductible. Management considers the scheduled reversal of deferred tax liabilities, projected future taxable income, and tax planning strategies in making this assessment. At March 31, 2012, the Company believed it was more likely than not that future tax benefits from net operating loss carry-forwards and other deferred tax assets would not be realizable through generation of future taxable income and accordingly deferred tax assets are fully reserved., 811385=Unvested restricted shares as of March 31, 2012, 911589=Common Stock Purchase Warrant issued April 19, 2012 (incorporated by reference to Exhibit 10.3 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 855417=On August 26, 2013, after consulting with the Company\u0092s Audit Committee and with the Company\u0092s newly appointed Independent Registered Public Accounting Firm, Marcum LLP, management changed its accounting for certain of the Company\u0092s warrants previously issued in connection with preferred stock and common stock and conversion features related to previously issued convertible notes which were recorded in periods prior to the engagement of Marcum LLP in order to comply with US GAAP. Such warrants and the embedded conversion options should have been reflected as liabilities on the consolidated balance sheets included in the Original 10-Q, rather than as a component of equity., 757286=12/31/2011, 726918=Financial liabilities as of March 31, 2012 and December 31, 2011 measured at fair value on a recurring basis are summarized below:, 756737=3/31/2012, 898440=Bylaws of Blue Calypso, Inc., a Delaware corporation, adopted September 9, 2011 (incorporated by reference to Exhibit 3.3 to Current Report on Form 8-K filed with the Securities and Exchange Commission on October 19, 2011), 812076=A total of 200,000 shares were granted on January 20, 2012 and vest on the second anniversary date. The share based compensation expense is $0 and $0 for quarter ended March 31, 2012 and March 31, 2011, respectively., 817620=The Company evaluated events or transactions occurring after March 31, 2012, the balance sheet date, through May 8, 2012,  and October 9, 2013 as to Note 2, the date the financial statements were available to be issued, and determined any events or transactions which could impact the financial statements as of and for the quarter ended March 31, 2012., 908738=Promissory Note, dated January 17, 2012, issued by Blue Calypso, Inc. to Aztec Systems, Inc. (incorporated by reference to Exhibit 10.2 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on January 20, 2012), 860390=Cost of Revenue.  Cost of revenue is primarily comprised of payments to endorsers for promoting advertiser content.  Our cost of revenue was $92,707 for the three months ended March 31, 2012, as compared to $72 for the same period in 2011.  The increase was due to company-sponsored advertising activity intended to attract an endorser base., 522833=On August 26, 2013, after consulting with the Company\u0092s Audit Committee, management changed its accounting for certain of the Company\u0092s warrants previously issued in connection with preferred stock and common stock and conversion features related to previously issued convertible notes which were recorded in periods prior to the engagement of Marcum LLP in order to comply with US GAAP. Such warrants and the embedded conversion options should have been reflected as liabilities on the consolidated balance sheets included in the Original 10-Q, rather than as a component of equity., 772544=2013, 762262=Depreciation expense was $1,189 for the three months March 31, 2012., 2756=QUARTERLY REPORT PURSUANT TO SECTION 13 OR 15(d) OF THE SECURITIES EXCHANGE ACT OF 1934, 11290=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.  x Yes  o No, 868044=Cash used in investing activities during the three months ended March 31, 2012 was $176,973, as compared to $52,679 for the three months ended March 31, 2011.  This was due to continued development of the underlying software technology., 800118=Balance, March 31, 2012, 770707=The amortization expense relating to the capitalized development costs was $54,152 and $23,999 for the three months ended March 31, 2012 and 2011, respectively.  Amortization expense for the next five years is estimated to be as follows:, 909699=Securities Purchase Agreement, dated April 19, 2012, by and between Blue Calypso, Inc. and the Buyer thereto (incorporated by reference to Exhibit 10.1 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 720675=The Company\u0092s advertising and marketing costs, which consist primarily of marketing and trade show costs, business development and printed promotional and sales presentation materials, are charged to expense when incurred.  The advertising and marketing expense was $4,535 and $32,892 for the three month periods ended March 31, 2012 and 2011, respectively., 191910=Ending Balance, December 31, 2009, 816355=These financial statements have been prepared assuming that the Company is a going concern. The Company incurred a net loss in the years ended March 31, 2012 and 2011 and for the period from September 11, 2009 (inception) to March 31, 2012., 865863=Our development activities are outsourced to Aztec Systems, Inc., a company that is majority owned by Mr. Levi, our chairman and chief executive officer.  For the quarter ended March 31, 2012, we incurred $176,775 of software development costs.  We began to recognize amortization of this amount during the quarter ended March 31, 2011, and recognized amortization expense related to capitalized software development costs of $54,152 and $23,999 for the years ended March 31, 2012 and 2011 respectively., 861796=General and Administrative.  For the three months ended March 31, 2012, general and administrative expense were $962,626, as compared to $68,713 for the three months ended March 31, 2011. The increase was primarily due to increased deferred compensation expense related to stock options that vested in the current quarter totaling $763,480. Also contributing to the increase were legal and professional expenses related to statutory filing process, patent legal and legal and accounting related to continued fund raising activities., 349010=Ending Balance, September 30, 2011, 4282=TRANSITION REPORT PURSUANT TO SECTION 13 OR 15 (d) OF THE SECURITIES EXCHANGE ACT OF 1934, 894575=Agreement and Plan of Merger and Reorganization, dated as of September 1, 2011, by and among Blue Calypso, Inc., Blue Calypso Acquisition Corp., and Blue Calypso Holdings, Inc. (incorporated by reference to Exhibit 2.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 822264=Unless the context requires otherwise, references in this Form 10-Q to the \u0093Company,\u0094 \u0093we,\u0094 \u0093our\u0094 and \u0093us\u0094 for periods prior to the closing of the reverse merger on September 1, 2011 refer to Blue Calypso Holdings, Inc., a privately held Texas corporation that was merged into Blue Calypso, Inc. on December 16, 2011, and, references to the \u0093Company,\u0094 \u0093we,\u0094 \u0093our\u0094 and \u0093us\u0094 for periods subsequent to the closing of the reverse merger on September 1, 2011 and before October 19, 2011, refer to Blue Calypso, Inc., a Nevada corporation, and its subsidiaries, and references to the \u0093Company,\u0094 \u0093we,\u0094 \u0093our\u0094 and \u0093us\u0094 for periods subsequent to October 19, 2011, refer to Blue Calypso, Inc., a Delaware corporation, and its subsidiaries., 524305=The effects of the revision on the accompanying balance sheet as of December 31, 2011 and March 31, 2012 is summarized below., 3141=For the quarterly period ended March 31, 2012, 875577=During 2011, the Company had a significant contractual obligation consisting of convertible promissory notes payable of $1,500,000 that would have been due on December 1, 2011.  These promissory notes automatically converted into 1,500,000 shares of Series A Convertible Preferred Stock on October 17, 2011.  During the three months ended March 31, 2012, an additional 200,000 shares of preferred stock was issued that provided $200,000 of funding in the quarter.  As indicated in footnote 11 of the financial statements, Blue Calypso has engaged the services of the related party, Aztec Systems, Inc., for software development, use of network operating center, and accounting.  We have warrants outstanding for a total of 25,036,818 shares at a price of $0.10 per share.  As is indicated in the legal proceedings section of this document, Blue Calypso has retained the services of two law firms to protect Blue Calypso patents from infringement., 265994=Ending Balance, December 31, 2010, 596097=March 31, 2012, 918397=Stockholder\u0092s Agreement, dated April 19, 2012, by and between Andrew Levi and the Company (incorporated by reference to Exhibit 10.9 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 520188=On September 1, 2011, BCHI executed a share exchange agreement and merged with a public shell company Blue Calypso Acquisition, Corp., a wholly-owned subsidiary of Blue Calypso, Inc. (formerly known as \u0093JJ&R Ventures, Inc.\u0094). The Merger was accounted for as a reverse-merger and recapitalization in accordance with the generally accepted accounting principles in the United States. BCHI is the acquirer for financial reporting purposes and Blue Calypso, Inc. is the acquired company.  Consequently, the assets and liabilities and the operations that will be reflected in the historical financial statements prior to the Merger will be those of BCHI and will be recorded at its historical cost basis. The operations after completion of the Merger include those of BCHI and Blue Calypso Inc. Common stock and corresponding capital amounts of BCHI pre-merger have been retroactively restated as capital stock shares reflecting the exchange ratio in the Merger.  On December 16, 2011 Blue Calypso Holdings, Inc. was merged into its 100% sole-owner, Blue Calypso, Inc., 895619=Agreement and Plan of Merger, dated September 9, 2011, by and between Blue Calypso, Inc., a Nevada corporation, and Blue Calypso, Inc., a Delaware corporation (incorporated by reference to Exhibit 10.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 15, 2011), 864816=During the quarter ended March 31, 2012, we incurred sales and marketing expenses of $243,425, general and administrative expenses of $184,525 and other operating expenses of $778,101.  We hired one new sales staff member during the quarter.  Sales and marketing expense included the compensation and benefit expense of the five sales and marketing staff members as well as travel, entertainment and advertising expense directly attributable to the sales and marketing function.  General and administrative expenses primarily consisted of contract labor, outside services and professional fees.  Other operating expenses primarily consisted of supplies, travel and entertainment expenses as well as deferred compensation on stock options vested during the quarter totaling $763,480., 819050=In connection with this Private Placement, the Company also entered into a Security Agreement, an Intellectual Property Security Agreement, Amendment No. 1 to the Common Stock Purchase Warrant, a Stockholder\u0092s Agreement and various ancillary certificates, disclosure schedules and exhibits in support thereof, each dated April 19, 2012.  In addition, the subsidiary of the Company, Blue Calypso, LLC, entered into a Subsidiary Guarantee in favor of the Buyer, dated April 19, 2012., 669198=The effects of the aboved described adjustments resulted in a change in the net gain or loss for the three months ended March 31, 2012 and the period for the inception to date through March 31, 2012. , 93359=2011, 864515=Comparison of Quarter ended March 31, 2012 Versus the Quarter ended March 31, 2011, 798988=Granted - Q1, 2012, 743118=The fair value of the warrants and the conversion options was calculated using a binomial lattice formula with the following weighted average assumptions during the three months ended March 31, 2012., 707933=Preferred shares subject to mandatory redemption (if any) are classified as liability instruments and are measured at fair value. The Company classifies conditionally redeemable preferred shares, which includes preferred shares that feature redemption rights that are either within the control of the holder or subject to redemption upon the occurrence of uncertain events not solely within the Company\u0092s control, as temporary equity. At all other times, the Company classifies its preferred shares in stockholders\u0092 deficiency.  As of March 31, 2012, the Company does not have any preferred shares subject to mandatory redemption outstanding., 212740=Ending Balance, March 31, 2010, 912502=Security Agreement, dated April 19, 2012, by and between the Company, Blue Calypso, LLC and the Buyer (incorporated by reference to Exhibit 10.4 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 20174=On August 26, 2013, after consulting with the Company\u0092s Audit Committee and with the Company\u0092s newly appointed Independent Registered Public Accounting Firm, Marcum LLP, management changed its accounting for certain of the Company\u0092s warrants previously issued in connection with preferred stock and common stock and conversion features related to previously issued convertible notes which were recorded in periods prior to the engagement of Marcum LLP in order to comply with US GAAP. Such warrants and the embedded conversion options should have been reflected as liabilities on the consolidated balance sheets included in the Original 10-Q, rather than as a component of equity., 762748=Intangible assets consist of the following at March 31, 2012 and December 31, 2011:  , 919342=Certification of Principal Executive Officer pursuant to Section 302 of the Sarbanes-Oxley Act of 2002., 779508=At August 31, 2011, the company had convertible subordinated notes payable issued to eleven entities/individuals.  The notes accrued simple interest at the rate of 8% per annum.  The principal amount of the notes, along with all accrued interest thereon was subject to automatic conversion upon the next financing transaction in which the Company sells shares of its capital stock to an outside vendor in an arm\u0092s length transaction.  The principal balance of $1,475,000 (including notes payable to affiliate of $200,000) and accrued interest thereon of $90,088 were converted into 28,135,234 common shares as of September 1, 2011., 884225=(b) Changes in internal control over financial reporting. There have been no changes in our internal control over financial reporting that occurred during the quarter ended March 31, 2012, that have materially affected or are reasonably likely to materially affect our internal control over financial reporting., 721500=In July 2011, the Financial Accounting Standards Board (FASB) issued ASU 2011-06-Other Expenses (Topic 720): Fees Paid to the Federal Government by Health Insurers (a consensus of the FASB Emerging Issues Task Force). This ASU is effective for periods ending after December 31, 2013.  We do not expect this ASU 2011-06 to apply to the Company or to have a material effect on the financial position, results of operations or cash flows., 771736=2012, 797841=Balance, December 31, 2011, 857458=Comparison of Three Months Ended March 31, 2012 and 2011, 523663=Specifically, the change in treatment of the warrants and the conversion feature embedded in certain convertible notes resulted in a change to the equity and liability portions of the consolidated balance sheets as of March 31, 2012 and resulted in a loss on the fair value of the derivative liabilities which impacted our results of operations and earnings (loss) per share as reported in our Original 10-Q., 21801=In addition, the Company has concluded that these accounting changes constitue an additional deficiency in the Company\u0092s internal control over financial reporting as of March 31, 2012 and that its disclosure controls and procedures were not effective as of March 31, 2012., 421504=Ending Balance, March 31, 2012, 886651=There are no further disclosures. All information that was required to be disclosed in a Form 8-K during the fourth quarter 2011 has been disclosed., 812731=Aztec Systems, Inc. is an affiliate of the Company that provides administrative and technical support services to the Company.  The majority owner of Aztec Systems, Inc. is also the majority stockholder of the Company. The Company incurred management fees of $ 9,064 and $13,161 and software development fees of $176,775 and $70,570 relating to Aztec Systems for quarter ended March 31, 2012 and March 31, 2011, respectively. The Company had accounts payable to Aztec Systems of $58,143 and $176,775 as of March 31, 2012 and March 31, 2011, respectively., 519599=Blue Calypso Holdings, Inc. (a development stage company) a Texas corporation (\u0093BCHI\u0094), was formed in February 2010 as an investment entity to hold a 100% single-member ownership interest in Blue Calypso, LLC, a Texas Limited Liability Company formed on September 11, 2009. The companies are under common control., 859013=Revenue.  Revenue for the three months ended March 31, 2012 was $584, as compared to $4,758 in revenues for the same period in 2011.  We are a development stage company and have had modest revenue to date., 869309=During the three months ended March 31, 2012, cash provided by financing was $554,993, as compared to 100,022 for the same period in 2011.  The increase was due to the issuance of additional preferred stock of $200,000 and the conversion of accounts payable owed to Aztec Systems to a promissory note totaling $344,993 as of March 31, 2011.  The promissory note made to Aztec Systems, Inc. is the combination of the initial transfer of indebtedness on January 1, 2012 of $254, 993 combined with additional advances during the quarter., 315383=Ending Balance, June 30, 2011, 518883=MARCH 31, 2012, 19405=This Amendment No. 1 hereby amends our Quarterly Report on Form 10-Q (\u0093Form 10-Q/A\u0094) for the period ended March 31, 2012, which was originally filed with the Securities and Exchange Commission on May 15, 2012 (the \u0093Original 10-Q\u0094). This Amendment is being filed mainly to include restated financial statements as described in Note 2, Restatement of Previously Issued Financial Statements of the Notes to the condensed consolidated financial statements. The condensed consolidated financial statements are being restated to reflect the following:, 958407=Subsidiary Guarantee, dated April 19, 2012, by Blue Calypso, LLC, in favor of the Buyer (incorporated by reference to Exhibit 10.6 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012), 870344=Our registered independent auditors have issued an opinion on our financial statements for the year ended December 31, 2011 which includes a statement describing our going concern status.  This means that there is substantial doubt that we can continue as an on-going business for the next 12 months unless we obtain additional capital to pay our bills and meet our other financial obligations.  Our ability to continue as a going concern is dependent upon our ability to obtain additional equity or debt financing, attain further operating efficiencies, reduce expenditures, dispose of selective assets, and ultimately, generate additional revenue. The going concern opinion may also limit our ability to access certain types of financing, prevent us from obtaining financing on acceptable terms, and limit our ability to obtain new business due to potential customers\u0092 concern about our ability to deliver products or services.  We must raise capital to implement our project and stay in business., 925646=+ The Interactive Data Files on Exhibit 101 hereto (XBRL (Extensive Business Reporting Language) information) is furnished and not filed as part of a registration statement or prospectus for purposes of Section 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise not subject to liability under these sections., 818198=On April 19, 2012 the Company entered into a Private Placement with an existing stockholder.  This Private Placement resulted in a Securities Purchase Agreement whereby the Company issued (i) a senior secured convertible debenture in the original aggregate principal amount of $35,000  and (ii) a warrant to purchase 6,500,000 shares of common stock, $0.001 par value per share, of the Company, and the Buyer covenanted to purchase up to an additional $465,000 of senior secured convertible debentures in a series of four closing at such times as may be designated by the Company in its sole discretion through October 19, 2012, 810067=Granted during three months ended March 31, 2012, 53133=Capitalized software development costs, net of accumulated amortization of $187,431 and $133,279 in 2012 and 2011, respectively, 857712=Net Loss.  For the three months ended March 31, 2012, we had a net loss of $1,785,795, as compared to a net loss of $174,766 for the three months ended March 31, 2011.  The increase in net loss was due to three factors.  The first was related to an increase in expenses related to increased investment in sales, marketing, operations, development and administration in comparison to the three months ended March 31, 2011.  The second was related to the recording of a deferred compensation expense of $763,480 related to options vested during the three months ended March 31, 2012. The third factor was the loss associated with the change in the fair value of derivative liabilities reflected in three months ended March 31, 2012 of $426,580., 816810=Management believes that the current cash and revenue should fund the Company\u0092s expected burn rate into early in the third quarter of 2012.  The Company will require additional funds to continue operations.  Management is currently attempting to secure additional equity investment monies.  There is a high level of uncertainty as to whether these efforts will be successful., 51686=Property and equipment, net of accumulated depreciation of $3,586 and $2,397 in 2012 and 2011 respectively, 941170=Bylaws of Blue Calypso, Inc., a Delaware corporation, adopted September 9, 2011 (incorporated by reference to Exhibit 3.3 to Current Report on Form 8-K filed with the Securities and Exchange Commission on October 19, 2011), 863671=Interest Expense.  Interest expense was $5,700 for the three months ended March 31, 2012 in comparison to $13,052 for the three months ended March 31, 2011.  The current period interest expense related to a notes payable to related party, Aztec Systems, Inc.  The note was a result of a conversion of open accounts payable to a note that occurred in the current quarter.  The note has per annum interest rate of 8%.  The balance at March 31, 2012 was $344,993., 795205=Using the valuation assumptions noted above, the Company estimated the value of stock options granted to be $1,953,072 and $0 for the three months ended March 31, 2012 and March 31, 2011, respectively. All the 2,420,000 options were granted on September 8, 2011 when the stock price was estimated to be .0679 per share so there was no intrinsic value for any options granted. The value of these options is being amortized to stock-based compensation expense consistently with the vesting events. The stock-based compensation expense recorded was $763,480 and $0 during quarter ended March 31, 2012 and March 31, 2011, respectively.  The following table summarizes the stock option activity as of March 31, 2012, 968728=+ The Interactive Data Files on Exhibit 101 hereto (XBRL (Extensive Business Reporting Language) information) is furnished and not filed as part of a registration statement or prospectus for purposes of Section 11 or 12 of the Securities Act of 1933, as amended, is deemed not filed for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, and otherwise not subject to liability under these sections., 777525=The company\u0092s income taxes are recorded in accordance with ASC 740 \u0093Income Taxes\u0094. The tax effects of the Company\u0092s temporary differences that give rise to significant portions of the deferred tax assets as of March 31, 2012 and 2011 consisted primarily of net operating losses totaling $1,785,795 and $174,767 which were fully reserved.  Deferred tax assets and liabilities are computed by applying the effective U.S. federal and state income tax rate to the gross amounts of temporary differences and other tax attributes., 862921=Depreciation and Amortization. Depreciation and amortization expenses relate primarily to the amortization of capitalized software development.  The increase from $24,256 for the three months ended March 31, 2011 to $55,341 for the three months ended March 31, 2012 was due to our ongoing software development initiative and implementation of improvements and new services related to our network., 525362=December 31, 2011, 229319=Ending Balance, June 30, 2010, 930639=October 9, 2013, 196091=Shares issued at $.0001 per share-3/10/2010, 821069=The following discussion and analysis of our financial condition and results of operations for the fiscal quarters ended March 31, 2012 and March 31, 2011 should be read in conjunction with \u0093Selected Consolidated Financial Data\u0094 and our audited consolidated financial statements for the fiscal quarter ended March 31, 2011 and the notes to those statements filed as Exhibit 99.1 to our current report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011. Our discussion contains forward-looking statements based upon current expectations that involve risks and uncertainties, such as our plans, objectives, expectations and intentions. Actual results and the timing of events could differ materially from those anticipated in these forward-looking statements as a result of a number of factors, including those set forth under \u0093Cautionary Note Regarding Forward-Looking Statements\u0094 below and elsewhere in this Quarterly Report., 245839=Ending Balance, September 30, 2010, 384457=Ending Balance, December 31, 2011, 159457=PERIOD FROM SEPTEMBER 11, 2009 (DATE OF INCEPTION) TO MARCH 31, 2012, 905894=Registration Rights Agreement, dated as of September 1, 2011, by and among Blue Calypso, Inc. and certain purchasers set forth therein (incorporated by reference to Exhibit 10.9 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 94493=March 31, 2012, 89057=FOR THE THREE MONTHS ENDED MARCH 31, 2012 (RESTATED) AND 2011 AND THE PERIOD SEPTEMBER 11, 2009 (DATE OF INCEPTION) TO MARCH 31, 2012 (RESTATED), 937306=Agreement and Plan of Merger and Reorganization, dated as of September 1, 2011, by and among Blue Calypso, Inc., Blue Calypso Acquisition Corp., and Blue Calypso Holdings, Inc. (incorporated by reference to Exhibit 2.1 to Current Report on Form 8-K filed with the Securities and Exchange Commission on September 8, 2011), 21113=Specifically, the change in treatment of the warrants and the conversion feature embedded in certain convertible notes resulted in a change to the equity, and liability portions of the consolidated balance sheets as of March 31, 2012 and resulted in a loss on the fair value of the derivative liabilities which impacted our results of operations and earnings (loss) per share as reported in our Original 10-Q.}",
    "lastModified": "Wed, 09 Oct 2013 21:23:45 GMT",
    "textBeforeTable": "  Copies of the following documents are included as exhibits to this report pursuant to Item 601 of Regulation S-K.   ITEM 6.  EXHIBITS AND REPORTS ON FORM 8-K.     Table of Contents     24   None. ITEM 5.  OTHER INFORMATION.   None.   ITEM 4.  MINE SAFETY DISCLOSURES.   None.   ITEM 3. DEFAULTS UPON SENIOR",
    "textAfterTable": "  25         Table of Contents   10.17   Subsidiary Guarantee, dated April 19, 2012, by Blue Calypso, LLC, in favor of the Buyer (incorporated by reference to Exhibit 10.6 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012) 10.18   Form of Lock-Up Agreement (incorporated by reference to Exhibit 10.7 to our Current Report on Form 8-K filed with the Securities and Exchange Commission on April 24, 2012) 10.19",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}