{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is very safe with a great campus police presence!",
            "Yes!",
            "Way too many to name...you will never be bored!",
            "All!!",
            "I love feeding the ducks at the duck pond. There is an annual undy-run before the Cat/Griz football game! Cat/ Griz football with rival University of Montana.",
            "MSU has great programs whether it is 2, 4, or graduate school. The engineering program is top of the line and is at the forefront of science and technology working with groups like NASA, Boeing, and BP. The arts are also great with music, theater, and art, there is something for everyone. The fact that MSU is a liberal arts college is also nice because it ensures that every student is well-rounded and prepared to enter society as a productive member!",
            "The city of Bozeman has so many fun and exciting things to do, whether it is hiking, fishing, camping, hunting, skiing, or bowling, movies, great hangouts, and many more. It is definitely a small town with a big city feel!",
            "There are a wide variety of food and dining choices available for all income levels!",
            "I do not live in the dorms, but my friends love them and say that they are a great place to meet new friends.",
            "The academia is very rigorous, but it is well worth it. The university does offer great free tutoring and many other great academic helps. There is no reason that you can't succeed here!",
            "1. APPLY HERE! It will be the best decision of your life! 2. Pick a major early. There is no reason you can't change, but is pointless to spend all this money not knowing what you want to do. 3. Don't be nervous. MSU has friendly, helpful staff that will guide you and make you feel right at home. 4. Have fun! There are so many clubs and so much to do around Bozeman. Take advantage of this beautiful area and all it has to offer. 5. APPLY HERE! I can't stress what an amazing college MSU is! There is no place like it.",
            "Montana State university is an awesome place, whether you are here to be a ski bum or for the top-notch academics! The staff is amazing, and the students are friendly and welcoming. MSU is definitely a gem and the quality and value for the price just can't be beat!"
        ]
    ],
    "pageTitle": "Montana State University (MSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Montana-State-University/reviews?_escaped_fragment_=/show/103119",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00127-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889265283,
    "recordOffset": 889148385,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{618240=© 2015, Cappex.com, LLC, 540225=The annual Undie Run. Students run a 5k race in their underwear every November., 585210=If you love to ski/snowboard, and I mean REALLY love the snow, MSU is the place for you. In my first year here, there has been snow cover since november with temps in the -20s. Great, friendly people, and a great atmosphere for learning with lots of outlets for help in every class., 153188=Bring warm clothes! It's a lot colder starting in September than I would have imagined., 512599=If you like the outdoors, MSU is the place for you! Almost every one here rides a bike, skateboards, hikes, skis, snowboards, or all of the above! Also, MSU has a great engineering program, ranking very high in the US. There will also be a new business college in 2015 that focuses especially on those looking into entrepreneurship!, 543495=Get a good winter coat. Bozeman is sunny and beautiful all through september and most of october but after that the temperature drops rapidly, the snow flies, and the skiers come out of hibernation, 217645=There is an undies run in September where everyone goes running in their underwear even when it's snowing., 11810=If you are looking for great research or internship opportunities this is the place to be. Montana State is within the Nation's top tier for this! If you are a minority this would be a great place to go if interesting in the hard sciences, math, engineering, etc. But I would also like to add that with the past few years MSU lost about 9 million in funding. This is significant because programs across campus have been cut completely, some altered(budget cuts), some merged into other programs, and some may lose all funding in 2012., 20575=No doubt, I am learning a ton! The vacations are longer: Winter break is 17-Jan11 and summer starts May 5. Despite these relatively short semesters, the professors pile on the homework and I think that they truly care about theit students., 82463=They start placing people into the residence halls as soon as March so sign up early for housing in order to get the placement you want. Make sure to ask questions because everyone is willing to answer but they won't really double check to make sure everyone is doing fine. Talk to your professors.}",
    "textBeforeTable": "09/16/2009 Reviewer is A current student here. 24 out of 25 people found this review useful. 1 of 137 Margaret from Bozeman, MT Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Am learning a lot My classes here are amazing. Most professors are really flexible with office hours and love to have students stop by, which is so great. They are such good resources to take advantage of. They also push you to your limits and make you really think about what you know and what you're learning, which makes it that much better. Login to rate or flag the reviews Ashley from Sioux Falls, SD 01/06/2010 Reviewer is A current student here. 6 out of 8 people found this review useful. 3 of 137 Categories Comments Great for these types of students Any and all don't be afraid to be yourself Bozeman welcomes all types of students. Tips for prospective students Check us out you will not be disappointed. Bang for the buck MSU is worth every penny, and I'm an out of state student. This college is defently worth",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}