{
    "relation": [
        [
            "Shipping and handling",
            "US $3.79",
            "US $6.49"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Shipping",
            "Expedited Shipping (USPS Priority Mail®)"
        ],
        [
            "Delivery*",
            "Estimated within 3-12 business days",
            "Estimated within 3-6 business days"
        ]
    ],
    "pageTitle": "Captain America 1983 280 Scarecrow VF VF Marvel | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/CAPTAIN-AMERICA-1983-280-SCARECROW-VF-VF-MARVEL/380907564540?_trkparms=aid%3D444000%26algo%3DSOI.DEFAULT%26ao%3D1%26asc%3D20140402094601%26meid%3D8379885005349618384%26pid%3D100012%26prg%3D20140402094601%26rk%3D6%26rkt%3D10%26sd%3D380935511634",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00216-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 420753003,
    "recordOffset": 420704639,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 1 items available. Please enter a number less than or equal to 1. -Select- Australia Belgium Canada Croatia, Republic of Denmark France Germany Netherlands New Zealand Spain Switzerland United Kingdom United States Change country: Excludes: Africa, Asia, Central America and Caribbean, Middle East, Southeast Asia, South America, American Samoa, Cook Islands, Fiji, French Polynesia, Guam, Kiribati, Marshall Islands, Micronesia, Nauru, New Caledonia, Niue, Palau, Papua New Guinea, Solomon Islands, Tonga, Tuvalu, Vanuatu, Wallis and Futuna, Western Samoa, Bermuda, Greenland, Mexico, Saint Pierre and Miquelon, Albania, Andorra, Austria, Belarus, Bosnia and",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 2 business days of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer is responsible for return shipping costs. Return policy details",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}