{
    "relation": [
        [
            "Shipping and handling",
            "US $2.54",
            "US $5.90"
        ],
        [
            "To",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Shipping (USPS First Class Package®)",
            "Expedited Shipping (USPS Priority Mail Legal Flat Rate Envelope®)"
        ],
        [
            "Delivery*",
            "Estimated within 3-7 business days",
            "Estimated within 2-5 business days"
        ]
    ],
    "pageTitle": "Costume Make UP Mehron Makeup Fantasy F X 1oz Tube Make UP FFX | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Costume-Make-Up-Mehron-Makeup-Fantasy-F-X-1oz-Tube-FFX-/310225588215?pt=LH_DefaultDomain_0&var=&hash=item483ae2cff7",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00267-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417470831,
    "recordOffset": 417415129,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 792 items available. Please enter a number less than or equal to 792. -Select- Australia Austria Belgium Canada Denmark Finland France Germany Ireland Italy Netherlands Norway Portugal Sweden Switzerland United Kingdom United States Vatican City State Change country: Quantity: Excludes: Africa, Asia, Central America and Caribbean, Middle East, Southeast Asia, South America, American Samoa, Cook Islands, Fiji, French Polynesia, Guam, Kiribati, Marshall Islands, Micronesia, Nauru, New Caledonia,",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Estimated sales tax Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Seller charges sales tax for items shipped to: MA (6.25%). Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money Back The buyer",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}