{
    "relation": [
        [
            "Concept/provision",
            "Adjusted section 97 assessable amount",
            "Net capital gain 102-5",
            "Attributable franked distribution 207-37(1)(a)",
            "Franking credit 207-35(4)(b)(i)",
            "Total assessable income",
            "Amount received from the trust"
        ],
        [
            "Ash",
            "$15,680",
            "$61,700",
            "$10,920",
            "$4,680",
            "$92,980",
            "$150,000"
        ],
        [
            "Bradshaw",
            "$0",
            "$25,000",
            "$0",
            "$0",
            "$25,000",
            "$50,000"
        ],
        [
            "Claire",
            "$0",
            "$0",
            "$20,000",
            "$30,000",
            "$50,000",
            "$20,000"
        ],
        [
            "Dawson",
            "$84,320",
            "$63,300",
            "$59,080",
            "$25,320",
            "$232,020",
            "$270,000"
        ],
        [
            "Total",
            "$100,000",
            "$150,000",
            "$90,000",
            "$60,000",
            "$400,000",
            "$490,000"
        ]
    ],
    "pageTitle": "ParlInfo - Tax Laws Amendment (2011 Measures No. 5) Bill 2011",
    "title": "",
    "url": "http://parlinfo.aph.gov.au/parlInfo/search/display/display.w3p;query%3DId%3A%22legislation%2Fems%2Fr4593_ems_625045bc-ff2f-4e43-abd3-44d002a0868d%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 185029367,
    "recordOffset": 184919701,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{8809=25-01-2012 05:21 PM, 5356=Tax Laws amendment (2011 measures No . 5) bill 2011, 6664=2010-2011, 9357=Tax Laws Amendment (2011 Measures No. 5) Bill 2011}",
    "TableContextTimeStampAfterTable": "{315622=The trust had a (prior year) net capital loss of $50,000 carried forward into the 2010-11 income year., 215076=2.111           Instead, the trustee is assessed on the taxable income relating to the capital gain under section 99 or 99A of the ITAA 1936 as appropriate (by way of section 115-222).  This is done by deeming the trustee to be specifically entitled to the capital gain.  [Schedule 2, item 17, paragraph 115-230(4)(b)], 782419=In 2010-11, all of XYZ Housing Group’s dwellings are eligible for the full NRAS incentive.  Accordingly, the South Australian Government makes a payment in May 2011 to the approved participant of XYZ Housing Group of $914,000 (that is, $2,285  Ã\u0097  400)., 857519=5.4                   The fringe benefits tax (FBT) law was introduced in 1986 to ensure that all forms of employee remuneration are taxed, whether provided as salary and wages or in a non-cash form. , 714037=3.24               As the definition of ‘NRAS consortium’ includes non-entity joint ventures, the ongoing operation of section 380-10 of the ITAA 1997 for parties to existing non-entity joint ventures is assured., 167937=[Schedule 2, items 2, 4 and 5, subsection 95(1) of the ITAA 1936 and item 25, subsection 995-1(1)], 88012=2.12               On 4 March 2011, after examining the advice provided by the Board, the Government announced that it would:, 925489=From 1 April 2014 until the end of the lease, the annualised kilometres driven would be 10,500  Ã\u0097  365  /  91  =  42,115 kms.  The statutory rate applying to the lease would be 0.20., 677187=2.211           The Government has included this choice for the trustees of MITs (and certain trusts treated like MITs) in recognition that these trusts generally do not ‘stream’ capital gains or franked distributions and instead distribute all of their trust income proportionally.  In addition, this choice allows MITs to use the current ‘proportional approach’ in Division 6 until the Government’s new MIT regime commences on 1 July 2012., 903625=During April 2011, Constance begins discussions with a salary packaging provider about obtaining a car through a salary sacrifice arrangement.  On 2 May 2011, Constance agrees to a particular option with the provider, and the car is ordered.  She signs a contract with her employer., 820608=4.35               The current disregard of section 159JA of the ITAA 1936 will continue to apply.  That is, a taxpayer will be entitled to 50 per cent of their dependent spouse tax offset entitlement, assuming no age restriction applies and also that there is no rule in section 159JA that precludes the taxpayer from claiming the dependent spouse tax offset while they are a member of a Family Tax Benefit (Part B) family or the taxpayer or their spouse is in receipt of parental leave pay. , 177713=2.82               Subdivision 115-C may also increase the amount on which a trustee is assessed, either under section 98 of the ITAA 1936 (on behalf of a beneficiary) or under section 99 or 99A of the ITAA 1936.  This does not lead to double taxation, because the amounts included directly under Division 6 of the ITAA 1936 are adjusted appropriately.  [Schedule 2, item 11, sections 115-220 and 115-222], 17623=Schedule 3 to this Bill addresses several technical issues which have arisen from the interaction between the tax law and the National Rental Affordability Scheme Act 2008 and the associated regulations. , 959362=Item 6, subsection 100AB(7) of the ITAA 1936, 14086=Schedule 2 to this Bill amends Subdivision 115-C and Subdivision 207-B of the Income Tax Assessment Act 1997 to ensure that, where permitted by the trust deed, the capital gains and franked distributions (including any attached franking credits) of a trust can be effectively streamed for tax purposes to beneficiaries by making them ‘specifically entitled’ to those amounts. , 791540=4.5                   The dependent spouse tax offset originated in the initial ITAA 1936.  It is one of a number of tax offsets in section 159J of the ITAA 1936 for taxpayers that maintain particular types of dependant.  Other examples are the invalid relative tax offset, parent/parent-in-law tax offset and the child-housekeeper tax offset., 672835=2.207           The Government has provided eligible taxpayers with the ability to make this choice to ensure that they are not disadvantaged by the introduction of these amendments after the end of the relevant trust’s 2010-11 income year., 142075=The Zhang Trust buys an investment property in 2001 for $100,000.  The trustee of the trust has the power to revalue the property according to generally accepted accounting principles and treat any increase in its value as income of the trust., 204754=2.99               The attributable gain is calculated in the same way as described in steps 1 to 3 above, based on the beneficiary’s share of each capital gain.  The trustee will generally be liable to be assessed on that amount under section 98 of the ITAA 1936, even if the amount it would otherwise have been assessed on under that section was reduced to nil because of Division 6E., 623020=2.170           The amendments in this Schedule introduce two specific anti-avoidance rules into the ITAA 1936.  Both are designed to prevent exempt beneficiaries being used to inappropriately reduce the amount of tax payable on the taxable income of a trust. , 804354=4.21               As noted above, section 159J of the ITAA 1936 provides for a number of offsets that assist taxpayers who maintain particular types of dependants.  These include the invalid relative tax offset which is available to taxpayers who maintain an ‘invalid relative’ as defined in subsection 159J(6). , 813240=4.31               If a taxpayer is entitled to the dependent spouse tax offset in respect of a dependent spouse born before 1 July 1971, they will not be entitled to claim the equivalent amount in respect of an ‘invalid spouse’ or a ‘carer spouse’.  Taxpayers will also not be entitled to claim an amount in respect of a ‘carer spouse’ if they have already claimed an amount in respect of an ‘invalid spouse’., 64540=Aaron and Elizabeth also hold FMDs during the 2010-11 income year.  The trustee also chooses them for the purposes of the FMD provisions for the income year.  They are therefore taken to carry on the primary production business carried on by the trustee of the Bennett Trust for the purposes of these provisions and are able to retain their FMDs for the income year., 908971=Adding this accessory will not result in a new commitment, and Tom’s contract will remain grandfathered until 1 March 2013., 673945=Before the end of 31 December 2010, the trustee (acting in accordance with its powers under the trust deed) resolved to distribute capital gains and franked distributions to specific beneficiaries. , 883072=5.35               All car benefits will be covered by the new rules unless it can be proved that an agreement was in place prior to 7:30 pm, AEST on 10 May 2011, committing to the transaction.  The car benefit does not need to have been delivered by 10 May 2011, but the commitment needs to be financially binding on one or more of the parties., 808741=4.25               From 1 July 2011, taxpayers with a dependent spouse born on or after 1 July 1971 will no longer be entitled to claim the dependent spouse tax offset.  This means the dependent spouse tax offset will be gradually phased out as the population ages to remove disincentives to enter the workforce for younger dependent spouses without children., 150603=Kerry receives $100,000 from the trust and $100,000 is included in her assessable income under section 97 of the ITAA 1936 (as modified by Division 6E)., 58797=In the 2010-11 income year the Wilson Trust has a loss for trust law purposes.  As the trust meets the certain entitlements requirement and as Kevin would have been presently entitled to a share of the trust income had the trust had some trust income for the income year, Kevin is taken to carry on the primary production business carried on by the trustee of the Wilson Trust for the purposes of income averaging and FMDs., 863351=5.14               However, on 29 May 1986, the then Treasurer announced that as a result of discussions with the Australian Democrats, the Government would amend the statutory formula percentages in order to secure the passage of the overall FBT measure., 143008=In the 2011-12 income year, the trustee sells the property for $400,000.  The trustee makes an accounting gain of $100,000 ($400,000 less the revalued amount of $300,000) and a (tax) capital gain of $300,000 ($400,000 capital proceeds minus the cost base of $100,000).  The trustee distributes the $100,000 accounting gain to William., 11919=Schedule 1 to this Bill amends Divisions 392 and 393 of the Income Tax Assessment Act 1997 (ITAA 1997) to allow trust beneficiaries to continue to use the primary production averaging (income averaging) and farm management deposits (FMDs) provisions in an income year where the trust does not have any trust law income (trust income) to which a beneficiary can be presently entitled (for example, because the trust has a loss for trust law purposes)., 595955=â\u0080¢        Dawson’s Division 6E present entitlement is $84,320 (calculated under subsection 102UY(4) of the ITAA 1936 as her present entitlement to trust income of $270,000 minus her $126,600 share of capital gains ($84,400 plus $42,200) and her $59,080 share of franked distributions)., 951269=Item 6, subsections 100AA(3) and 100AB(2) of the ITAA 1936, 270269=A fully franked distribution of $70 is paid to the trustee of the Marsden Trust in the 2010-11 income year.  The trust also has $300 of interest income for the income year.  The income of the trust estate is $370.  The taxable income of the trust is $400 (including the $30 franking credit attached to the distribution). , 202580=2.98               Where a trustee is assessed and liable to pay tax under section 98 of the ITAA 1936 in respect of a beneficiary, the trustee increases the assessable amount to reflect the beneficiary’s attributable gain in respect of each capital gain of the trust [Schedule 2, item 11, section 115-220] ., 809435=4.26               In recognition of the limited employment opportunities for some dependent spouses, taxpayers maintaining a dependent spouse born on or after 1 July 1971 who is an invalid or permanently unable to work or providing care, will remain entitled to claim an amount equivalent to the dependent spouse tax offset in respect of a dependent ‘invalid spouse’ or dependent ‘carer spouse’. , 833545=4.50               The amendments also ensure that if a taxpayer is entitled to claim the dependent spouse tax offset in respect of a dependent spouse born before 1 July 1971, they are not also entitled to claim an amount in respect of an ‘invalid spouse’ or a ‘carer spouse’.  [Schedule 4, item 15, subsection 159J(ID)], 906366=One such car is ordered on 15 May 2011, and the car is replaced on 15 June 2011.  If the statutory formula method is used to value the car fringe benefits, the car would fall under the new arrangements., 485952=â\u0080¢        Ash’s Division 6E present entitlement is $45,400 — calculated under subsection 102UY(4) of the ITAA 1936 as his present entitlement to trust income of $150,000 minus his $31,850 share of franked distributions and minus $72,750 (since only half of his $145,500 share of the capital gain is included in trust income)., 785068=3.81               Item 1, which introduces the concept of an NRAS consortium and recognises that certificates are issued to the approved participant of the consortiums rather than to the consortiums directly, applies to the 2009-10 income year and later income years.  [Schedule 3, item 3], 752566=â\u0080¢        the entity is one of the following:  an individual; a corporate tax entity when the NRAS rent flows indirectly to it; the trustee of a trust that is liable to be assessed on a share of, or all or a part of, the trust’s net income under the Income Tax Assessment Act 1936 ; the trustee of an First Home Savers Account; a superannuation fund; an approved deposit fund; or a pooled superannuation trust. , 640801=As the Smith Trust has taken immediate action to notify the Quay Trust of its entitlement, and it was not unreasonable for the Smith Trust to be unaware of the Quay Trust’s taxation status, the Commissioner decides to exercise his discretion under subsection 100AA(4) of the ITAA 1936 to disregard the failure of the trustee of the Smith Trust to comply with subsection 100AA(1) of the ITAA 1936., 295188=Anthea’s Division 6E present entitlement to the Division 6E income of the trust is $100,000 (no part of her present entitlement is attributable to capital gains or franked distributions).  The amount she is assessed on under section 97 of the ITAA 1936 is therefore $100,000 (as she has a 100 per cent share of the Division 6E income and therefore is assessed on 100 per cent of the Division 6E net income)., 749251=then it must be assumed for sections 380-15 and 380-20 of the ITAA 1997 that the member (rather than the approved participant) has been issued with a certificate in relation to the NRAS year that covers the dwellings for which the member has NRAS rent.  The amount stated in the certificate is the total amount that the member is eligible to receive in relation to the dwellings.  [Schedule 3, item 1, section 380-14], 252543=The McLachlan Trust receives and then distributes in full four different franked distributions of $70 and one unfranked distribution of $100 in the 2010-11 income year.  The trust incurs directly relevant expenses of $100 in relation to one of the franked distributions.  Under the terms of the trust Geoff is entitled to 50 per cent of the dividend income of the trust. , 25814=Proposal announced :  This measure was announced in the 2011-12 Budget and in the Treasurer’s Media Release No. 050 of 10 May 2011., 624962=â\u0080¢        As set out in subsection 6(1) of the ITAA 1936 and subsection 995-1(1) an ‘exempt entity’ includes an entity whose income is exempt from income tax., 54943=1.19               The certain entitlements requirement is broadly similar to the no material discretionary elements approach in Subdivision 126-G (CGT roll-over relief for the transfer of assets between fixed trusts) of the ITAA 1997, which was enacted by the Tax Laws Amendment (2009 Measures No. 6) Act 2010 ., 961361=Item 7, subsection 102UY(2) of the ITAA 1936, 792885=4.7                   The amount of offset reduces by $1 for every $4 by which the adjusted taxable income of the dependent spouse exceeds $282.  That is, the effective tax rate on the first $10,000 earned by a spouse is around 25 per cent, meaning that dependent spouses, often women, face the prospect of being penalised for doing some part time work.  The taxpayer is entitled to the maximum offset if the dependent spouse has adjusted taxable income of $282 or less.  In 2010-11, a dependent spouse could have adjusted taxable income of $9,426 and the taxpayer would receive some offset. , 89858=2.14               After consulting with interested stakeholders, the Assistant Treasurer and Minister for Financial Services and Superannuation confirmed via Media Release No. 052 of 13 April 2011 that the Government would defer consideration of the proposal to better align the concept of ‘income of the trust estate’ with ‘net income of the trust estate’ until the broader review of the taxation of trust income. , 911812=Distance travelled during the FBT year (1 April - 31 March), 647993=2.192           As discussed in paragraphs 2.71 to 2.75 these amendments insert a definition of a beneficiary’s adjusted Division 6 percentage into subsection 95(1) of the ITAA 1936.  It is the share of the income of the trust estate to which the exempt entity is presently entitled for the purposes of Division 6 excluding capital gains or franked distributions to which any beneficiary or trustee is specifically entitled.  [Schedule 2, item 2, subsection 95(1) of the ITAA 1936], 858069=5.5                   Before the introduction of the FBT law in 1986, providing fringe benefits to employees became a major source of tax avoidance and evasion, in particular for high income earners., 8091=Income Tax Assessment Act 1997, 130649=Upon settlement of the contract, the trustee will be taken to have made a capital gain at the time when the contract was entered into.  Therefore, the trust will have a capital gain of $200,000 in the 2010-11 income year. , 946556=Items 3 and 6, subsections 95(1) and 100AB(4) of the ITAA 1936, 379193=â\u0080¢        Dawson’s Division 6E present entitlement is $70,580 (calculated under subsection 102UY(4) of the ITAA 1936 as her present entitlement to trust income of $120,000 minus her share of franked distributions of $49,420). , 674548=The Robinson Trust is therefore subject to the application of the amendments made by this Schedule for its 2010-11 income year, 595336=â\u0080¢        Ash’s Division 6E present entitlement is $15,680 (calculated under subsection 102UY(4) of the ITAA 1936 as his present entitlement to trust income of $150,000 minus his $123,400 share of capital gains ($115,600 plus $7,800) and his $10,920 share of franked distributions)., 939380=Item 13, section 393-27 of the Income Tax (Transitional Provisions) Act 1997, 819116=4.33               These amendments give effect to the 2011-12 Budget measure to phase out eligibility for the dependent spouse tax offset for taxpayers who maintain a dependent spouse born on or after 1 July 1971 but to retain eligibility for an amount equivalent to the dependent spouse tax offset entitlement as though no age restriction applies for particular taxpayers., 12565=Date of effect :  These amendments, which are favourable for taxpayers, apply where the income year of the trust is the 2010-11 income year or a later income year., 943113=Item 1, subsections 95AAB(3) and 95AAC(5) of the ITAA 1936, 945844=Items 2, 4 and 5, subsection 95(1) of the ITAA 1936 and item 25, subsection 995-1(1), 901896=5.52                Changes made after 7:30 pm, AEST on 10 May 2011 to commitments made prior to 7:30 pm, AEST on 10 May 2011, such as re-financing a car, altering the duration of an existing contract or changing employers, are new commitments and will therefore be subject to the new arrangements., 731710=As outlined in ATO ID 2009/146, in this situation the manager, Affordable Rental Solutions Company, is deriving NRAS rent and the individual dwelling owner is deriving ordinary rent.  As such, the manager would be the entity eligible for the NRAS tax offset., 835113=4.52               A taxpayer’s ‘invalid spouse’ or ‘carer spouse’ are included in class 5 of the table in subsection 159J(2) of the ITAA 1936.  As a result, the existing invalid relative tax offset is extended to include two new amounts that equate to the amount of dependent spouse tax offset in class 1.  These amounts will be able to be claimed by taxpayers maintaining a ‘carer spouse’ or an ‘invalid spouse’.  [Schedule 4, item 16, subsection 159J(2) (item 5 in the table)], 908502=Tom entered into a salary sacrifice arrangement for the provision of the use of a car under a novated lease on 1 March 2010.  The lease expires 1 March 2013., 958026=Item 6, subsection 100AB(5) of the ITAA 1936, 799175=4.13               Examples are the offset for taxpayers maintaining a full-time student aged less than 25 and the offset for a child aged less than 21 (not being a student).  These offsets are allowed for in the table in subsection 159J(2) but, from 1 July 1976, they have not been able to be claimed by taxpayers pursuant to subsection 159J(1A). , 900670=5.50               The reforms will apply to all car fringe benefits after 7:30 pm, AEST on 10 May 2011, unless it can be proved that there was a pre-existing commitment in place to provide a car.  [Schedule 5, item 8], 263292=A fully franked distribution of $70 is made to the trustee of the Sloper Trust in the 2010-11 income year.  The trust also has $100 of rental income for the income year.  The income of the trust estate is $170.  The taxable income of the trust is $200 (including the $30 franking credit attached to the distribution). , 635021=2.182           The trustee of the trust is then assessed and liable to pay tax under section 99A of the ITAA 1936 on the amount of the taxable income of the trust estate that is attributable to the present entitlement effectively cancelled by the application of subsection 100AA(3) of the ITAA 1936 (unless the Commissioner of Taxation (Commissioner) exercises the discretion provided for in subsection 100AA(4) of the ITAA 1936).  [Schedule 2, item 6, subsection 100AA(4) of the ITAA 1936], 952604=Item 6, subsections 100AA(4) and (5) of the ITAA 1936, 39658=1.11               However, Bamford held that a beneficiary cannot be presently entitled to a share of income of a trust if there is no income legally available for distribution.  Because of this, the ATO view in Taxation Ruling TR 95/29 was no longer correct at law and the ruling was withdrawn on 30 June 2010 (although the ruling still applies to the 2009-10 and earlier income years)., 684325=2.220           These rules are intended to apply in respect of references such as those in sections 102AAM and 160AAB of the ITAA 1936 and section 165-60 of the ITAA 1997., 694860=3.8                   The NRAS incentive is $9,140 per dwelling in 2010-11, comprising $6,855 from the Australian Government and $2,285 from the States.  These amounts are indexed annually in line with the rents component of the consumer price index., 904048=The car is scheduled for delivery on 1 August 2011, at which point she will sign documents with the leasing provider for the provision of the car., 906900=Blake entered into a novated lease arrangement with his employer for a car benefit in 2009.  The lease expires in September 2011.  Blake travelled 32,000 kms in the 2011-12 FBT year.  The car is valued under the statutory formula method., 378114=â\u0080¢        Ash’s Division 6E present entitlement is $29,420 (calculated under subsection 102UY(4) of the ITAA 1936 as his present entitlement to trust income of $50,000 minus his share of franked distributions of $20,580 — note that his share of the capital gain of the trust is not part of trust income)., 794505=4.9                   Taxpayers are also not entitled to the dependent spouse tax offset if their adjusted taxable income is more than the ‘income limit for Family Tax Benefit (Part B)’.  Income limit for Family Tax Benefit (Part B) is defined as the ‘amount specified in subclause 28B(1) of Schedule 1 to the A New Tax System (Family Assistance) Act 1999 , as indexed under Part 2 of Schedule 4 to that Act’., 73560=1.30               Consequential amendments are made to insert suitable subheadings before subsections 393-25(2) and (3).  A consequential amendment is also made to the FMD provisions to re-enact subsection 393-25(4), which is about the application of Division 393 of the ITAA 1997 and Division 4A of Part VA of the ITAA 1936 to a beneficiary who is no longer under a legal disability, as section 393-28.  [Schedule 1, items 7 and 8, subsections 393-25(2) and (3) and item 11, section 393-28)], 914672=From 1 April 2014, 637633=2.183           The Commissioner has a discretion to disregard the failure of the trustee to notify the exempt entity of the present entitlement (or pay that entitlement) where he is of the opinion that it would be unreasonable to treat the exempt entity as not being presently entitled to any amount that was neither notified nor paid, having taken into account the factors set out in subsection 100AA(5) of the ITAA 1936.  The Commissioner has been provided with this discretion to deal with unfair consequences arising from the application of this anti-avoidance provision.  [Schedule 2, item 6, subsections 100AA(4) and (5) of the ITAA 1936], 656968=â\u0080¢        so much of the net income of one trust (the first trust) that is included under section 97 of the ITAA 1936 in the calculation of the net income of another trust, but which does not represent a distribution of, or an entitlement to income of the first trust;, 268191=2.148           These amendments deal separately with the case where, disregarding Division 6E, a trustee is assessed and liable to pay tax under section 98, 99 or 99A of the ITAA 1936.  Subsection 207-35(5) now lists the requirements that must be met before subsection 207-35(6) operates to make a trustee liable to be assessed (and pay tax).  [Schedule 2, item 18,  subsections 207-35(5) and (6)], 953281=Item 6, subsection 100AA(6) of the ITAA 1936, 962029=Item 7, subsection 102UY(3) of the ITAA 1936, 80248=2.3                   Schedule 2 also amends Division 6 of Part III of the Income Tax Assessment Act 1936 (ITAA 1936), hereafter referred to as Division 6, to include specific anti-avoidance rules to address the potential opportunities for tax manipulation that can result from the inappropriate use of exempt entities as beneficiaries. , 660806=The trustee specifically allocates all of the franked distributions to Mark and appoints all of the remaining income of the trust estate to Casey Pty Ltd ($5,000).  The trustee notifies Casey Pty Ltd of its entitlement by 31 August 2011.  The trustee appoints all of the capital in respect of that year to Emma ($95,000). , 897541=for the 2020-21 FBT year:  =  0.20  Ã\u0097  $40,000  =   $8,000, 649140=2.193           The benchmark percentage against which an exempt entity’s adjusted Division 6 percentage is compared is calculated under subsection 100AB(3) of the ITAA 1936.  It is the percentage of the ‘adjusted net income’ of the trust estate to which the exempt entity is presently entitled.  [Schedule 2, item 6, subsection 100AB(3) of the ITAA 1936], 22344=2013-14, 674925=2.208           Further, the amendments made by this Schedule apply to a trust that is a MIT (or a trust that is treated in the same way as a MIT for the purposes of Division 275) for the 2010-11 or 2011-12 income years where the trustee of the MIT chooses to apply these amendments.  [Schedule 2, item 51, subitems 51(5) to (7)], 826517=4.42               A taxpayer’s ‘relevant rebate amount’ is amended so that the age restriction is disregarded in determining the dependent spouse tax offset component of this amount.  This means that, for example, a taxpayer with a dependent spouse born on or after 1 July 1971, who is also maintaining a child under 21 (not being a student), will be eligible for the relevant proportion of the ‘notional’ dependent spouse (with child) tax offset as part of their zone tax offset entitlement.  [Schedule 4, item 6, subsection 79A(4)], 656450=â\u0080¢        an amount taken to be a dividend paid to the trustee of the trust pursuant to subsection 109D(1) of the ITAA 1936 (loans treated as dividends under Division 7A of Part III of the ITAA 1936);, 484988=The beneficiaries’ assessable amounts under section 97 of the ITAA 1936 are adjusted by the operation of Division 6E, based on the amounts calculated under section 102UY of the ITAA 1936., 852567=4.72               The restriction of eligibility for the dependent spouse tax offset in respect of dependent spouses born on or after 1 July 1971, and revisions to the zone, overseas forces and overseas civilian tax offsets and the invalid relative tax offset, take effect for the 2011-12 income year and later income years.  [Schedule 4, item 34], 24683=Schedule 5 to this Bill amends the Fringe Benefits Tax Assessment Act 1986 to reform the current statutory formula method for determining the taxable value of car fringe benefits by replacing the current statutory rates with a single statutory rate of 20 per cent, regardless of kilometres travelled. , 14664=Schedule 2 also amends Division 6 of Part III of the Income Tax Assessment Act 1936 , to include specific anti-avoidance rules to address the potential opportunities for tax manipulation that can result from the inappropriate use of exempt entities as beneficiaries. , 641338=Therefore, the Quay Trust is notionally assessed on all of the Smith Trust’s taxable income of $10,000.  Had the Commissioner not exercised his discretion, the trustee of the Smith Trust would have been assessed and liable to pay tax under section 99A of the ITAA 1936 on all of its taxable income of $10,000., 783052=The practice of XYZ Housing Group is to have the economic benefit of the NRAS incentive flow to the individual dwelling owners.  Accordingly, in May 2011 the manager makes a payment of $2,285 to Mr Smith., 696003=3.10               Division 380 of the ITAA 1997 provides for the NRAS tax offset. , 923393=5.56               A contract entered into after 7.30 pm, AEST on 10 May 2011, where the car travels 30,000 kilometres per annum, would use the statutory rate of 0.14 from the start of the contract until 31 March 2012, 0.17 from 1 April 2012 until 31 March 2013, then the statutory rate of 0.20 thereafter., 272896=Under Division 6E, the amount assessed to the beneficiaries and trustee under Division 6 is calculated as if the $70 dividend and $30 associated franking credit were disregarded for the purposes of calculating the trust’s taxable income, the $70 franked distribution was disregarded for the purposes of calculating the income of the trust estate, and the beneficiaries’ present entitlements exclude their share of the franked distribution.  As such, section 97 of the ITAA 1936 includes in Huy’s assessable income $150 (($185  â\u0088’  $35)/($370  â\u0088’  $70)  Ã\u0097  ($400  â\u0088’  $100)) instead of $200 as would otherwise have been the case., 663036=In the 2010-11 income year, the trustee of the Delta Family Trust derives $90,000 interest.  The trustee also receives a distribution from a managed fund of $10,000, in respect of which it is required to include $11,000 in its assessable income under section 97 of the ITAA 1936. , 25171=Date of effect :  These amendments will apply to commitments made after 7:30 pm, Australian Eastern Standard Time (AEST) on 10 May 2011 and be phased in over four years., 950601=Item 6, subsection 100AA(3) of the ITAA 1936, 909746=On 12 November 2011, Y Co. officially takes over X Co, and Anna is now an employee of Y Co., 26853=2010-11, 678679=The Banfield Trust is treated in the same way as a MIT for the purposes of Division 275 for the 2011-12 income year.  The trustee of the Banfield Trust did not choose to apply the amendments contained in this Schedule for the 2010-11 income year. , 913540=From 10 May 2011, 70037=1.27               These amendments, which are favourable to taxpayers, apply where the income year of the trust is the 2010-11 income year or a later income year.  [Schedule 1, item 14], 665779=2.200           To avoid any unfair outcomes that might result from the application of subsection 100AB(2) of the ITAA 1936, the Commissioner has a discretion to not apply the subsection where he forms the opinion that it is unreasonable for it to apply.  [Schedule 2, item 6, subsection 100AB(5) of the ITAA 1936], 78732=2.1                   Schedule 2 to this Bill amends Subdivision 115-C and Subdivision 207-B of the Income Tax Assessment Act 1997 (ITAA 1997) to ensure that, where permitted by the trust, the capital gains and franked distributions (including any attached franking credits) of a trust can be effectively streamed for tax purposes to beneficiaries by making them ‘specifically entitled’ to those amounts. , 87342=2.11               The Government also announced that it would obtain advice from the Board of Taxation (Board) on whether there are any issues with the current operation of the trust income tax provisions that must be addressed from the 2010-11 income year as an interim measure pending the broader review of the taxation of trust income. , 956015=Item 6, subsection 100AB(2) of the ITAA 1936, 801248=4.16               The maximum ‘notional’ dependent spouse (with child) offset is indexed in accordance with section 159HA.  In 2010-11, the maximum amount was $2,656 and it will be $2,736 in 2011-12., 823811=4.39               That is, taxpayers eligible for the overseas civilian tax offset who are maintaining a dependent spouse born on or after 1 July 1971, will be entitled to up to $338 as their base amount plus the full amount of dependent spouse tax offset as though no age restriction applies.  They will also be entitled to 50 per cent of their dependent spouse tax offset amount, assuming no age restriction applied, section 159JA did not apply and other amendments had been made to section 159J. , 275903=2.151           The sole effect of Division 6E is to adjust the amount included in a beneficiary’s assessable income or assessed to the trustee under Division 6 — it does not adjust the ‘income of the trust estate’, ‘net income of the trust’ or a beneficiary’s present entitlement to trust income for any other purpose.  For example, Division 6E does not modify the operation of Division 6 for the purposes of applying section 100A of the ITAA 1936., 10811=National Rental Affordability Scheme Act 2008, 807815=4.24               The ‘invalid relative’ definition does not currently include a dependent spouse of the taxpayer.  The definition also does not include the brother, sister or child of a spouse of the taxpayer.  The maximum invalid relative tax offset amount in 2010-11 is $839.  The maximum amount of this offset is indexed each year with reference to the All Groups Consumer Price Index number in accordance with section 159HA of the ITAA 1936. , 811761=4.29               Because of their continuing eligibility for the dependent spouse tax offset, taxpayers with a dependent spouse born before 1 July 1971 will only be entitled to an amount equating to 50 per cent of their dependent spouse tax offset entitlement as part of their zone, overseas forces or overseas civilian tax offset (or 20 per cent if they are a resident of Zone B).  , 94517=2.20               These amendments ensure that, for the 2010-11 and later income years, where a trustee has the power to appoint or ‘stream’ capital gains and/or franked distributions (including any attached franking credits) to specific beneficiaries this will be effective for tax purposes, subject to relevant integrity rules. , 629469=2.177           Section 100AA of the ITAA 1936 ensures that where an exempt entity is not aware of their present entitlement to income of the trust estate, the trustee rather than the exempt entity is liable to pay tax on the taxable income of the trust that relates to that present entitlement., 48224=(This is the position from 1 July 2010, if the law is not amended.), 658606=2.199           An amount included in the taxable income of a trust as a result of the application of Part IVA of the ITAA 1936 is expressly included in the trust’s adjusted net income, notwithstanding that it does not represent a net accretion of value to the trust estate.  Excluding such an amount from the trust’s adjusted net income would effectively ‘unwind’ the work done by Part IVA. , 76889=1.34               A consequential amendment is made to the note to section 202DL of the ITAA 1936 to update the references to the FMD provisions.  [Schedule 1, item 5, note to section 202DL of the ITAA 1936], 874785=5.21               In the Treasurer’s joint Media Release with the Assistant Treasurer and Minister for Financial Services and Superannuation of 10 May 2011, the Deputy Prime Minister and Treasurer, said:, 15133=Date of effect :  This measure applies for the 2010-11 income year and later income years., 65733=The trustee of the Swain Trust carried on a business of primary production during the 2009-10 income year.  During that income year Bruce, Judith, their six children, and their children’s six spouses, were all presently entitled to a share of trust income and were therefore taken to carry on the primary production business carried on by the trustee for the purposes of income averaging and FMDs., 853611=4.73               The amendment to section 13-1 of the Income Tax Assessment Act 1997 , which lists offsets that are claimable, includes the offset available in respect of a taxpayer’s ‘invalid spouse’ or ‘carer spouse’ in the item in the table for ‘invalid relative’.  [Schedule 4, item 33, section 13-1], 898083=for the 2022-23 FBT year:  =  0.20  Ã\u0097  $40,000  =  $8,000, 486588=â\u0080¢        Dawson’s Division 6E present entitlement is $54,600 — calculated under subsection 102UY(4) of the ITAA 1936 as her present entitlement to trust income of $120,000 minus her $38,150 share of franked distributions and minus $27,250 (since only half of her share of the capital gain is included in trust income)., 639464=In the 2010-11 income year, the Smith Trust generated $10,000 of interest income.  The trust has no other income or expenses and its taxable income is therefore $10,000., 924549=In the FBT period from 1 July 2012 to 31 March 2013, James drives 35,000 kms.  From 1 April 2013 to 31 March 2014, James drives 42,000 kms in the car.  From 1 April 2014 until the end of the lease, James drives 10,500 kms., 693292=3.5                   The NRAS is a Government initiative to stimulate the supply of new affordable rental dwellings.  The initiative commenced on 1 July 2008., 907273=In August, Blake decides to re-finance the same car for another year, and signs a form saying he is extending the lease by 12 months.  This would be considered a new arrangement, and Blake will now fall under the new arrangements for valuing car fringe benefits (from the beginning of the next FBT year following the date he signed, 1 April 2012). , 66256=The trustee of the Swain Trust carries on a business of primary production during the 2010-11 income year, however, the trust has a loss for trust law purposes for this income year.  The Swain Trust does not meet the certain entitlements requirement.  As there were 14 beneficiaries that were taken to carry on the primary production business carried on by the trustee for the purposes of income averaging and FMDs in the 2009-10 income year, the trustee is able to nominate not more than 14 beneficiaries for the purposes of income averaging and FMDs for the 2010-11 income year.  The trustee need not nominate the same beneficiaries, or even the same number of beneficiaries, for both the income averaging and FMD provisions., 217935=As a result of this election, the capital unit-holders are not taken to have any extra capital gain.  Instead, the trustee is taken to be specifically entitled to the full amount of the gain.  The trustee therefore increases its assessable amount under section 99 or 99A of the ITAA 1936 by $200 (being the amount produced after applying section 115-222). , 948576=Item 6, paragraphs 100AA(1)(b) and 100AB(1)(b) of the ITAA 1936, 112646=â\u0080¢        the application of new Division 6E of the ITAA 1936 (hereafter referred to as Division 6E) to adjust the assessable amounts under Division 6 (see paragraphs 2.150 to 2.164);, 131265=Bob can reasonably be expected to receive the trust profit on the sale of the asset and is specifically entitled to the capital gain for the purposes of the 2010-11 income year., 689431=3.2                   All references are to the ITAA 1997 unless otherwise stated., 205485=2.100           The attributable gain is doubled if the capital gain is a discount capital gain and the beneficiary is a company or a beneficiary in the capacity as a non-resident trustee of another trust estate (unless subsection 97(3) of the ITAA 1936 applies to that beneficiary).  This effectively removes the effect of the discount from beneficiaries who would not be able to claim the discount had they made the capital gain directly.  [Schedule 2, item 11, paragraph 115-220(1)(b)], 943800=Item 1, section 95AAC of the ITAA 1936, 20102=Schedule 4 to this Bill amends the Income Tax Assessment Act 1936 to implement the 2011-12 Budget measure to phase out the dependent spouse tax offset., 962682=Item 7, subsection 102UY(4) of the ITAA 1936, 7035=ITAA 1936, 21763=2011-12, 905028=On 17 August 2011, as Tim is nearing the 40,000 kms, he gets the contract changed to allow for 50,000 kms.  This would be considered a new commitment, and from 1 April 2012, the contract would move to the new arrangements (under the transitional arrangements).  (Since the amendments begin to apply part way through an FBT year in relation to a car that was available from 1 April, the new arrangements will apply from 1 April 2012.), 696558=3.11               Under the current legislation, taxpayers collectively participating in the NRAS (other than through a partnership or trust arrangement) must be operating through a non-entity joint venture.  ‘Non-entity joint venture’ is defined by subsection 995-1(1) of the ITAA 1997.  It requires the Commissioner of Taxation (Commissioner) to be satisfied of the presence of a contractual arrangement under which multiple parties undertake an economic activity that is subject to a ‘control’ test., 810172=4.27               Taxpayers with a dependent spouse born on or after 1 July 1971 who are eligible for the zone, overseas forces or overseas civilian tax offsets will remain eligible for an amount equivalent to the dependent spouse tax offset as a component of their zone, overseas forces or overseas civilian tax offset.  This is in recognition of limited employment opportunities that may exist in remote or isolated regions or if a person’s spouse is deployed overseas., 951941=Item 6, subsection 100AA(4) of the ITAA 1936, 18429=Date of effect :  The amendment to the treatment of state and territory NRAS-related payments applies from the 2008-09 income year.  The amendments providing for an optional election apply from the 2010-11 income year.  The remaining amendments apply from the 2009-10 income year., 899023=Chris leases a car under a novated lease arrangement with his employer on 1 January 2015, on a four-year lease.  The base value of the car is $50,000.  The car is used 50 per cent of the time for private use and 50 per cent for work-related use., 91530=2.16               Further, as a result of consultation on exposure draft legislation, the Government has provided a carve-out for managed investment trusts (MITs) and certain trusts treated like MITs in recognition that these trusts generally do not ‘stream’ capital gains or franked distributions and instead distribute all of their trust income proportionally.  This carve-out enables MITs to use the current ‘proportional approach’ in Division 6 until the Government’s new MIT regime commences on 1 July 2012.  The trustees of these trusts can still choose to apply these amendments provided they make a valid election for the 2010-11 or 2011-12 income year., 907762=Since the amendments begin to apply part way through an FBT year in relation to a car that was available from 1 April, the statutory rate of 0.11 will apply for the entire 2011-12 FBT year with the amendments beginning to apply from 1 April 2012. , 664518=The adjusted net income of the Delta Family trust excludes $1,000 of the $11,000 assessed to it under section 97 of the ITAA 1936 in respect of the trust distribution, as only $10,000 of that sum represents a net accretion to the trust.  The adjusted net income of the trust is therefore $100,000 and equal to the income of the trust estate., 16002=Proposal announced :  This measure was announced in the Assistant Treasurer and Minister for Financial Services and Superannuation’s Media Release No. 052 of 13 April 2011. , 831915=4.48               The maximum amount of dependent spouse tax offset and ‘notional’ dependency tax offsets are indexed in accordance with section 159HA of the ITAA 1936.  In response to the inclusion of the ‘notional’ dependent spouse with child component of the overseas civilian tax offset in new subsection 23AB(7A), there is a need to update the section reference of the amount to be indexed in the ‘indexable amount’ definition in section 159HA.  [Schedule 4, item 14, subsection 159HA(7)], 45900=(This is the position from 1 July 2010, if the law is not amended.), 300805=Under the ordinary operation of Division 6, the income of the trust estate is $200 and the taxable income is $1,000.  As Aaron and Bennett are each entitled to 50 per cent of the ‘income of the trust estate’, they would each be assessed on $500 under section 97 of the ITAA 1936., 807032=â\u0080¢        a medical practitioner appointed by the ‘Families Secretary’, being the Secretary of the department that deals with matters arising under the A New Tax System (Family Assistance) (Administration) Act 1999 (Cth) that is administered by the ‘Families Minister’, being the Minister administering section 1 of the A New Tax System (Family Assistance) (Administration) Act 1999 (Cth)., 934734=Item 4, note to section 97A of the ITAA 1936, 785804=3.82               Items 4 and 6, which provide an optional election for certain taxpayers, applies to the 2010-11 income year and later income years.  [Schedule 3, item 7], 796947=â\u0080¢        overseas civilian tax offset (section 23AB of the ITAA 1936):  which is available to personnel that have served overseas under the control of the United Nations and are prescribed in Regulation 6 of the Income Tax Regulations 1936 . , 924253=James enters into a novated lease arrangement on 1 July 2012 for a car with a base value of $35,000.  The lease on the car is for three years, running until 30 June 2015., 7382=Income Tax Assessment Act 1936, 644971=2.189           In determining whether an exempt entity would otherwise be assessed on a disproportionate share of the trust’s taxable income, the conditions in subsection 100AB(1) of the ITAA 1936 must be satisfied.  That is, there must be an exempt entity (excluding an exempt Australian government agency) that is presently entitled to an amount of the income of the trust estate; and that beneficiary’s adjusted Division 6 percentage of the income of the trust estate must exceed the benchmark percentage calculated in accordance with subsection 100AB(3) of the ITAA 1936.  [Schedule 2, item 6, subsections 100AB(1) and (3) of the ITAA 1936], 881205=5.32               The change will apply to all car fringe benefits after 7:30 pm, AEST on 10 May 2011, except where an employee, employer or their associate has committed to the acquisition of the car that will be the subject of a car benefit (for a specified period of time) prior to 7:30 pm, AEST on 10 May 2011., 130329=In June 2011, the Straddle Trust signed a contract for the sale of a property for $500,000 with a settlement date in October 2011.  The trustee purchased the property in 2006 for $300,000. , 58059=The trustee of the Wilson Trust carries on a primary production business during the 2010-11 income year.  At all times during this income year, the manner or extent to which each beneficiary of the trust can benefit from the trust is not capable of being significantly affected by the exercise, or non-exercise, of a power., 777108=Alternatively, the parties to the consortium may have predicated their participation in the NRAS on the basis that the NRAS incentive would be enjoyed by the dwelling owners, rather than the manager.  To achieve this outcome, following receipt of the certificate from the Housing Secretary, the manager may elect to relinquish its entitlement to a tax offset for the income year corresponding to the NRAS year covered by the certificate.  The manager is eligible to make this election because it is entitled to a tax offset under section 380-10 of the ITAA 1997 and it is the approved participant in relation to the NRAS consortium., 175790=2.80               Beneficiaries no longer need to have an amount of assessable income included under section 97, 98A or 100 of the ITAA 1936 to be treated as having an extra capital gain under section 115-215.  This ensures that a ‘capital beneficiary’ that is specifically entitled to an amount representing a capital gain of a trust is treated as having an extra capital gain in relation to that amount even if they are not presently entitled to a share of the income of the trust estate.  [Schedule 2, item 9,  subsection 115-215(3)], 792248=4.6                   The maximum dependent spouse tax offset was $2,286 in 2010-11 and will be $2,355 in 2011-12.  The maximum amount of offset is indexed each year with reference to the All Groups Consumer Price Index number in accordance with section 159HA of the ITAA 1936., 313451=In the 2010-11 income year, the trust derived the following amounts., 790299=4.3                   The Treasurer announced in the 2011-12 Budget that the Government will phase out the dependent spouse tax offset for dependent spouses who are aged less than 40 on 1 July 2011, to help encourage more Australians into paid employment. , 32291=1.2                   All the legislative references in this chapter are to the ITAA 1997 unless otherwise specified., 672001=2.206           The amendments made by this Schedule only apply to a trust that is an early balancer for the 2010-11 income year where the trustee of that trust makes a choice in accordance with subitem 51(4).  The trustee must make this choice in writing and before the end of two months after the commencement of these amendments.  [Schedule 2, item 51, subitems 51(2) to (4)], 206640=2.101           A trustee increases the amount it is assessed and liable to pay tax on under section 99 or 99A of the ITAA 1936 to reflect the trustee’s share of each capital gain of the trust.  This applies even if the only reason for the section 99 or 99A assessment is because the trustee has a share of a capital gain.  [Schedule 2, item 11, section 115-222], 955328=Item 6, subsections 100AB(1) and (3) of the ITAA 1936, 37125=1.8                   Before the High Court’s decision in Commissioner of Taxation v Bamford (2010) 240 CLR 481 (Bamford), the Australian Taxation Office (ATO) regarded a beneficiary as presently entitled to a share of the trust income provided there was some gross trust income and the trustee exercised their discretion in favour of the beneficiary (or in the absence of an appointment or accumulation of income, the trust income had fallen to the beneficiary as a default beneficiary).  Further, where there was no gross trust income, the ATO regarded a beneficiary (including a default beneficiary) as presently entitled to a share of trust income where they had a vested and indefeasible interest in trust income and were therefore deemed to be presently entitled to trust income (under subsection 95A(2) of the Income Tax Assessment Act 1936 (ITAA 1936)). , 867963=5.16               The statutory formula percentages were increased in 1995-96 to their current rates.  The below rates have applied from the FBT year beginning 1 April 1995., 797551=4.11               Recipients of the zone, overseas forces or overseas civilian tax offsets receive a base amount of offset.  In addition, they also receive up to 50 per cent of any dependency tax offsets to which they are entitled that are or were provided for in section 159J of the ITAA 1936.  These offsets are described as the ‘relevant rebate amount’ for the purposes of the zone tax offset and ‘concessional rebate amount’ for the purposes of the overseas forces tax offset.  In addition, eligible taxpayers receive an amount of dependent spouse tax offset under section 159J. , 674274=To ensure the streaming of these amounts, the trustee of the Robinson Trust makes a written choice on 1 August 2011 to apply these amendments. , 81602=2.5                   On 30 March 2010, the High Court handed down its decision in Commissioner of Taxation v Bamford (2010) 240 CLR 481.  In that case, the Court considered the meaning of ‘income of the trust estate’ and the meaning of ‘share’ for the purposes of section 97 of the ITAA 1936. , 786423=3.83               An election in relation to an NRAS certificate may be made within 30 days after the day the amendment receives Royal Assent, if the Housing Secretary has already issued the NRAS certificate for the NRAS year 2010-11 before that date.  [Schedule 3, item 8], 953949=Item 6, subsections 100AA(7) and 100AB(8) of the ITAA 1936, 673555=The Robinson Trust has been granted leave by the Commissioner to adopt a substituted accounting period that ends on 31 December 2010 in lieu of the income year ending on 30 June 2011.  The trust is therefore an early balancer for the 2010-11 income year., 806346=â\u0080¢        a medical officer of the ‘Health Department’, being the department that deals with matters arising under section 1 of the National Health Act 1953 (Cth) that is administered by the ‘Health Minister’, being the Minister who administers section 1 of the National Health Act 1953 (Cth); or, 942456=Item 1, section 95AAB of the ITAA 1936, 908785=On 15 September 2011, Tom decides to have the car windows tinted., 663988=The trustee distributes $6,000 to an exempt beneficiary (a church).  As the exempt beneficiary is paid this amount within two months after the end of the income year, section 100AA of the ITAA 1936 does not apply., 630079=2.178           Section 100AA of the ITAA 1936 applies where:, 20717=Proposal announced :  This measure was announced in the 2011-12 Budget and in the Treasurer’s Media Release No. 047 of 10 May 2011., 679062=However, on 1 July 2011 the trustee of the Banfield Trust makes an election, in writing, to apply the amendments in this Schedule for the 2011-12 income year.  The Banfield Trust is therefore subject to the amendments contained in this Schedule for the 2011-12 income year, 642729=2.186           The purpose of the second anti-avoidance rule contained in section 100AB of the ITAA 1936 is to prevent an exempt entity from receiving a disproportionate share of the trust’s taxable income, relative to the exempt entity’s trust entitlements., 958694=Item 6, subsection 100AB(6) of the ITAA 1936, 956683=Item 6, subsection 100AB(3) of the ITAA 1936, 836150=4.53               The amount of offset included in the table for an ‘invalid spouse’ or ‘carer spouse’ is $2,100.  In accordance with section 159HA, this amount is deemed to have been indexed from 1 July 2008 so the maximum amount of the offsets is $2,355 in 2011-12.  This amount will be indexed in accordance with section 159HA in future years. , 949933=Item 6, subsection 100AA(2) of the ITAA 1936, 300388=In the 2011-12 income year, the trustee of the trust made a $100 capital gain (no CGT concessions applied).  The trustee also had $100 of other income for trust purposes.  However, due to a timing difference, the amount of other income assessable for tax purposes is instead $900. , 86728=2.10               On 16 December 2010, in recognition of the longstanding problems with the taxation of trusts, the Government announced a public consultation process as the first step towards updating the trust income tax provisions and rewriting them into the ITAA 1997. , 670785=2.204           The amendments made by this Schedule apply in relation to the 2010-11 income year and later income years.  [Schedule 2, item 51, subitem 51(1)], 22634=2014-15, 637226=As the Philips Trust is unaware of its full present entitlement it is only notionally assessed on $50,000.  However, the trustee of the Daley Trust is assessed and liable to pay tax under section 99A of the ITAA 1936 on the remaining $50,000 of the trust’s taxable income, 641783=2.185           Subsection 100AA(6) of the ITAA 1936 applies to ensure that where the application of section 99A is triggered, these amendments apply in the same way for both non-resident and resident trust estates.  [Schedule 2, item 6, subsection 100AA(6) of the ITAA 1936], 941795=Item 1, section 95AAA of the ITAA 1936, 168262=2.74               If the sum of beneficiaries’ adjusted Division 6 percentage is less than 100 per cent, the difference is the trustee’s adjusted Division 6 percentage.  If there is no income of the trust remaining after disregarding amounts to which any entity is specifically entitled, the trustee has an adjusted Division 6 percentage of 100 per cent.  [Schedule 2, items 2 and 4,  subsection 95(1) of the ITAA 1936 and item 25, subsection 995-1(1)], 59395=1.22               Examples of powers that may be capable of significantly affecting the manner and extent to which a beneficiary can benefit from a trust were set out in the explanatory memorandum to the Tax Laws Amendment (2009 Measures No. 6) Bill 2009 in paragraph 1.34.  That explanatory memorandum also set out examples of powers that would not be regarded as significantly affecting the manner and extent to which a beneficiary can benefit from a trust in paragraphs 1.35 and 1.36., 636899=However, the Daley Trust fails to provide the Philips Trust with written notice of its entitlement before 31 August 2011 and only makes a payment of $50,000 to the Philips Trust before that date. , 822878=4.38               The amendments also mean that taxpayers eligible for the overseas civilian tax offset who are maintaining a dependent spouse born on or after 1 July 1971 remain entitled to claim the full amount of dependent spouse tax offset, assuming no age restriction applies, as a component of their overseas civilian tax offset amount.  [Schedule 4, item 2, subparagraph 23AB(7)(a)(iii)], 947242=Item 6, subsection 100AA(1) of the ITAA 1936, 945129=Items 2 and 4,  subsection 95(1) of the ITAA 1936 and item 25, subsection 995-1(1), 802360=4.18               Taxpayers eligible for the zone tax offset may receive three different base amounts depending on the zone in which they reside.  The zones are Zone A, Zone B and ‘special areas’ within zones.  ‘Special areas’ are defined in subsection 79A(3D) of the ITAA 1936 and comprise points in Zone A or Zone B that are more than 250 kilometres from the centre point of the nearest urban centre with a census population of more than 2,500 as at 1 November 1981., 725721=3.33               Section 380-10 of the ITAA 1997 deals with claims by a member of an NRAS consortium that is an individual, corporate tax entity or a superannuation fund.  It is the mechanism by which groups of taxpayers collectively participating in the NRAS each become entitled to an NRAS tax offset., 776694=If an election is not made, the manager would be entitled to a tax offset, as the manager is the entity deriving NRAS rent.  The dwelling owners, having not derived any NRAS rent, would not be entitled to a tax offset.  This is not NRAS rent for the reasons given in ATO ID 2009/146., 63472=Aaron, Elizabeth, Michael and Daniel are beneficiaries of the Bennett Trust.  The Bennett Trust does not meet the certain entitlements requirement.  The trustee of the Bennett Trust carries on a business of primary production during the 2010-11 income year, however, the trust has a loss for trust law purposes for this income year., 805783=4.23               The certificate must have been issued for the purpose of examining the dependant’s eligibility for disability support pensions under the Social Security Act 1991 (Cth) by:, 913044=New contracts entered into after 7:30 pm, AEST on 10 May 2011, 647074=2.191           The trustee of the relevant trust is then assessed and liable to pay tax under section 99A of the ITAA 1936 on the taxable income of the trust estate that is attributable to the percentage by which the exempt entity’s Division 6 percentage exceeds the benchmark percentage. , 208934=2.104           This treatment removes the benefit of any CGT discounts for a trustee assessed under section 99A of the ITAA 1936, replicating the effect of the repealed section 115-225., 234804=2.127           A beneficiary’s proportionate share of that part of a franked distribution to which no beneficiary is specifically entitled, is calculated in accordance with paragraph 207-55(4)(b).  This amount is the amount of the franked distribution multiplied by the beneficiary’s adjusted Division 6 percentage.  Again allowance is made for circumstances where a trustee is assessed in respect of a beneficiary under section 98 of the ITAA 1936.  [Schedule 2, item 23, subparagraphs 207-55(4)(b)(i) and (ii)]  , 914293=From 1 April 2013, 925263=From 1 April 2013 to 31 March 2014, when James drives 42,000 kms, the statutory rate of 0.17 would apply., 276672=2.152           Division 6E does not ‘unwind’ any increase in a trustee’s liability under section 98, 99 or 99A of the ITAA 1936 arising from Subdivisions 115-C and 207-B.  In other words, an increase in the trustee’s liability under Subdivision 115-C and 207-B happens after any modification by Division 6E., 32884=1.3                   On 16 December 2010, the Government announced that it would introduce amendments to the income tax law so that trust beneficiaries can continue to use the income averaging and FMD provisions in a loss year., 909416=Anna works for X Co, and enters into a novated lease arrangement with her employer in January 2010.  The lease runs until January 2013. The car fringe benefit is valued under the statutory formula method., 646112=2.190           Where section 100AB of the ITAA 1936 applies, the exempt beneficiary is treated as not being presently entitled and never having been presently entitled to the amount of the income of the trust estate that is attributable to the percentage by which the exempt entity’s adjusted Division 6 percentage exceeds the benchmark percentage.  [Schedule 2, item 6, subsection 100AB(2) of the ITAA 1936], 650793=2.195           The ‘adjusted net income’ of a trust, is the taxable income of the trust for that income year (as defined in subsection 95(1) of the ITAA 1936) adjusted by the amounts set out in subsection 100AB(4) of the ITAA 1936.  It is necessary to adjust the taxable income of the trust in this way to ensure that an entity’s benchmark percentage can be properly compared to its adjusted Division 6 percentage.  [Schedule 2, items 3 and 6, subsections 95(1) and 100AB(4) of the ITAA 1936], 788934=4.1                   Schedule 4 to this Bill amends the Income Tax Assessment Act 1936 (ITAA 1936) to restrict eligibility for the dependent spouse tax offset to taxpayers with a dependent spouse born before 1 July 1971., 235805=2.128           The concept of a beneficiary’s ‘adjusted Division 6 percentage’ is defined in subsection 995-1(1) to have the same meaning as in subsection 95(1) of the ITAA 1936.  This percentage is the Division 6 percentage of a beneficiary or trustee calculated on the assumption that the amount of any capital gains or franked distributions to which any beneficiary or trustee is specifically entitled are disregarded in working out the income of the trust estate.  [Schedule 2, item 2, subsection 95(1) of the ITAA 1936]  , 20449=Date of effect :  1 July 2011., 960698=Item 7, sections 102UX and 102UY of the ITAA 1936, 70896=1.28               The current FMD provisions, including subsection 393-25(3), only apply from the 2010-11 income year.  For income years before this the FMD provisions were contained in Schedule 2G to the ITAA 1936.  To ensure that the amendments allowing a trustee of a trust without certain entitlements to nominate beneficiaries for the purposes of the FMD provisions operate appropriately in the 2010-11 income year, a transitional provision is inserted into the Income Tax (Transitional Provisions) Act 1997 .  For the purpose of determining the maximum number of choices that the trustee may make under subsection 393-27(2) for the 2010-11 income year, subsection 393-25(3) is treated as having applied to a beneficiary covered by paragraph (c) of the definition of ‘primary producer’ in section 393-25 in Schedule 2G to the ITAA 1936 in the 2009-10 income year.   [Schedule 1, item 13, section 393-27 of the Income Tax (Transitional Provisions) Act 1997], 665374=As the exempt entity’s adjusted Division 6 percentage equals the benchmark percentage, section 100AB of the ITAA 1936 does not apply., 643974=2.188           Section 100AB of the ITAA 1936 applies even when an exempt entity that is the beneficiary of a trust is informed of, or paid, its present entitlement to income of the trust estate.  The section applies subject to the operation of section 100AA of the ITAA 1936.  That is, it applies on the basis of a beneficiary’s present entitlement to income as determined following the application of section 100AA of the ITAA 1936.  This ensures that an amount of present entitlement assessed to a trustee under section 100AA of the ITAA 1936 is not assessed to the trustee again under section 100AB of the ITAA 1936. , 63983=The trustee chooses Aaron, Elizabeth, Michael and Daniel for the purposes of the income averaging provisions for the 2010-11 income year.  They are therefore treated as carrying on the primary production business carried on by the trustee of the Bennett Trust for the purposes of these provisions and their primary production income for the income year is nil (they do not have any primary production income from any other source)., 745076=HP is a member, but not the approved participant, of an NRAS consortium who is entitled to an NRAS tax offset.  HP derives $12,000 of NRAS rent from the NRAS dwelling for the 2010-11 NRAS year.  $12,000 is the total amount of NRAS rent derived from the NRAS dwelling for the 2010-11 NRAS year and therefore HP is the only entity deriving NRAS rent from the NRAS dwelling in the 2010-11 NRAS year., 740704=HP is a member of an NRAS consortium who is entitled to an NRAS tax offset.  HP derives $12,000 of NRAS rent from the NRAS dwelling for the 2010-11 NRAS year.  $12,000 is the total amount of NRAS rent derived from the NRAS dwelling for the 2010-11 NRAS year and therefore HP is the only entity deriving NRAS rent from the NRAS dwelling in the 2010-11 NRAS year., 698604=3.14               However, under such arrangements, joint ventures may be legally structured in a way that results in the approved participant (manager) deriving NRAS rent and the investor deriving ordinary rent (this arrangement was highlighted in the Australian Taxation Office Interpretive Decision (ATO ID) 2009/146).  In these cases the manager, rather than the ultimate investor, would be the entity entitled to the tax offset as the manager is the entity deriving NRAS rent.  This will be addressed by these amendments., 821451=4.36               Further, if the taxpayer maintains a dependent spouse born on or after 1 July 1971 and also maintains a child under 21 (not being a student) or a full-time student under 25, they will be entitled to 50 per cent of the higher, ‘notional’ dependent spouse (with child) offset amount., 812491=4.30               By contrast, taxpayers with a dependent spouse born on or after 1 July 1971 would be entitled to the relevant proportion of their dependent spouse tax offset entitlement, assuming no age restriction applied.  In addition, the taxpayer could claim the full amount of this dependent spouse tax offset entitlement as a component of their zone, overseas forces or overseas civilian tax offset. , 741196=The certificate issued in relation to the NRAS dwelling indicates an incentive of $6,000 for the NRAS dwelling for the 2010-11 NRAS year., 651762=2.196           Subsection 100AB(4) of the ITAA 1936 adjusts the taxable income of a trust in three ways. , 669900=2.203           Subsection 100AB(7) of the ITAA 1936 applies to ensure that where the application of section 99A is triggered, these amendments apply in the same way for both non-resident and resident trust estates.  [Schedule 2, item 6, subsection 100AB(7) of the ITAA 1936], 7744=ITAA 1997, 904756=Tim is provided with a salary sacrificed car on a lease contract that lasts the sooner of two years or 40,000 kms, commencing 1 January 2010., 376902=The beneficiaries’ assessable amounts under section 97 of the ITAA 1936 are adjusted by the operation of Division 6E, based on the amounts calculated under section 102UY of the ITAA 1936., 169415=In the 2010-11 income year, the Lang Trust received $100,000 of rental income and $70,000 of fully franked distributions.  The trust has no expenses.  Its income is therefore $170,000 and its taxable income is $200,000 (including the $30,000 franking credit attached to the distribution)., 832865=4.49               The amendments then give effect to the Government decision to phase out the dependent spouse tax offset for taxpayers with a dependent spouse born on or after 1 July 1971.  [Schedule 4, item 15, subsection 159J(1C)], 799868=4.14               Subsection 159J(1B) provides for an increased child-housekeeper tax offset if the taxpayer would have been entitled to an offset in respect of a dependent full-time student or child less than 21 (not being a student) but for the fact those offsets have not been claimable from 1 July 1976.  In 2010-11, the amount of this child-housekeeper (with child) offset was $2,232 and it will be $2,299 in 2011-12., 238286=A franked distribution of $70 is made to the trustee of the Harvey Trust in the 2010-11 income year.  The trust also has $100 of interest income for the income year and has incurred a $50 interest expense on the borrowings used to purchase the share which gave rise to the $70 distribution.  The income of the trust estate is therefore $120.  The taxable income of the trust is $150 (including the $30 franking credit attached to the distribution). , 131002=In accordance with the trust deed, in July 2011 the trustee resolves to distribute all of the trust profit on the sale to Bob upon settlement., 636168=In the 2010-11 income year, the Daley Trust generated $100,000 of rental income.  The trust has no other income or expenses and its taxable income is therefore $100,000., 233889=2.126           Where a trustee is liable to be assessed and pay tax in respect of a beneficiary under section 98 of the ITAA 1936 (or would be so liable but for another provision in the Act such as Division 6E), subparagraph 207-55(4)(a)(ii) operates to treat the trustee as being specifically entitled to the amount of the franked distribution to which the relevant beneficiary is specifically entitled.  [Schedule 2, item 23, paragraph 207-55(4)(a)]  , 676480=2.210           However, if the trustee makes an effective choice to apply these amendments for the 2010-11 income year, the amendments also apply for the 2011-12 income year.  That is, a trustee’s choice to apply the amendments for the 2010-11 income year is effectively irrevocable.  This is necessary to ensure that it is clear as to which version of the law applies to the relevant trust., 267392=As such, section 97 of the ITAA 1936 includes $50 (($85 â\u0088’ $35) / ($170 â\u0088’ $70) Ã\u0097 ($200 â\u0088’ $100)) in both of Phillip’s and Katie’s assessable income instead of $100 as would otherwise have been the case., 659503=In the 2010-11 income year, the Bell Trust generated $100,000 of rental income and $70,000 of franked distributions (with $30,000 franking credits attached).  The trust had no expenses.  The taxable income of the trust is $200,000 (being the $100,000 rental income, $70,000 franked distributions and $30,000 franking credits)., 776140=These facts are identical to those addressed by ATO ID 2009/146 (with the references to ‘non-entity joint venture’ replaced by ‘NRAS consortium’)., 675695=2.209           The choice is available for the 2010-11 or the 2011-12 income year.  The trustee of the MIT must make this choice in writing and before the end of two months after the later of the commencement of these amendments and the end of the year in relation to which that choice is made.  [Schedule 2, item 51, subitem 51(7)], 851265=4.71               In response to the inclusion of ‘invalid spouse’ and ‘carer spouse’ as categories of dependants in class 5 in the table in subsection 159J(2), it is necessary to amend the definition of ‘dependant’ for the purposes of the net medical expenses tax offset in section 159P of the ITAA 1936.  The amendment to the ‘dependant’ definition clarifies that paragraph (ca) only applies to an ‘invalid relative’.  An ‘invalid spouse’ or ‘carer spouse’ of the taxpayer would be captured by ‘spouse of the taxpayer’ in paragraph (a) of the definition.  [Schedule 4, item 32, subsection 159P(4)], 947910=Item 6, subsections 100AA(1) to (3) of the ITAA 1936, 897836=for the 2021-22 FBT year:  =  0.20  Ã\u0097  $40,000  =  $8,000, 76131=1.33               A consequential amendment is made to the note to section 97A of the ITAA 1936 to update the references to section 393-25.  [Schedule 1, item 4, note to section 97A of the ITAA 1936], 908135=From 1 April 2012, a rate of 0.17 will apply., 909958=From 12 November 2011, any car benefits provided to Anna will come under the new arrangements., 82716=â\u0080¢        ‘income of the trust estate’ in section 97 of the ITAA 1936 refers to the distributable income of the trust as determined according to trust law and in accordance with the deed; and, 954641=Item 6, subsections 100AB(1) and (2) of the ITAA 1936, 15480=The Government is implementing a Board of Taxation recommendation that the measure apply from the start of the 2010-11 income year.  This provides certainty for taxpayers following the withdrawal of relevant public rulings and practice statements of the Australian Taxation Office with effect from the 2010-11 income year.  This measure is generally beneficial to taxpayers., 957358=Item 6, subsection 100AB(4) of the ITAA 1936, 783812=3.79               Item 10, which amends the treatment of state and territory payments, applies to the 2008-09 income year and later income years.  [Schedule 3, item 11] , 949273=Item 6, paragraph 100AA(1)(c) of the ITAA 1936, 669288=2.202           Where the Commissioner exercises the discretion conferred under subsection 100AB(5) of the ITAA 1936, the exempt entity is assessed in accordance with the ordinary operation of Division 6 (as then adjusted by Division 6E and Subdivisions 115-C and 207-B). , 883757=5.36               Changes made after 7:30 pm, AEST on 10 May 2011 to commitments made prior to 7:30 pm, AEST on 10 May 2011, such as re-financing a car, altering the duration of an existing contract or changing employers, are new commitments and will therefore be subject to the new arrangements., 793847=4.8                   Taxpayers cannot claim the dependent spouse tax offset for any part of the income year that they are a member of a Family Tax Benefit (Part B) family without shared care, or parental leave pay is payable to the taxpayer or their spouse, pursuant to section 159JA of the ITAA 1936. , 83200=â\u0080¢        ‘share’ means ‘proportion’ such that once the share of the distributable income of the trust to which the beneficiary is presently entitled is determined, the beneficiary is assessed on that same percentage share of the trust’s net income as defined in section 95 of the ITAA 1936 (hereafter referred to as the trust’s ‘taxable income’). , 214333=2.110           If the trustee makes the choice, no beneficiary is treated as having an extra capital gain under Subdivision 115-C.  The trustee is also not assessed on behalf of any beneficiary under section 98 of the ITAA 1936.  [Schedule 2, item 17, paragraph 115-230(4)(a)], 913914=From 1 April 2012, 960030=Item 7, section 102UW of the ITAA 1936, 81013=2.4                   The legislative references in this chapter are to the ITAA 1997 unless otherwise specified., 855491=5.1                   Schedule 5 to this Bill amends the Fringe Benefits Tax Assessment Act 1986 to reform the current statutory formula method for determining the taxable value of car fringe benefits by replacing the current statutory rates with a single statutory rate of 20 per cent, regardless of kilometres travelled., 896697=Tamara leases a car under a novated lease arrangement with her employer on 1 April 2020.  The lease is a three-year lease. The base value of the car is $40,000.  During the first FBT year, the car is driven 23,000 kms.  The next year, it is driven 40,000 kms, and in the final year the car is driven 37,000 kms.  The car is available to Tamara from 1 April 2020, and is available for the whole tax year.  The car is solely for private use., 743074=3.44               In certain situations where the approved participant has changed their status throughout the NRAS year (for example, from an endorsed charitable institution to another eligible approved participant), the Housing Secretary may make a payment for NRAS dwellings in relation to part of the NRAS year and also issue a certificate for the NRAS dwellings in relation to the other part of the NRAS year.  (The provisions that determine the situation where this may occur are outlined in Regulation 29 of the National Rental Affordability Scheme Regulations 2008 .), 815839=Taxpayers are not entitled to claim the dependent spouse tax offset in respect of a dependent spouse born on or after 1 July 1971., 688733=3.1                   Schedule 3 to this Bill amends the Income Tax Assessment Act 1997 (ITAA 1997) to address technical issues which have arisen from the interaction between the tax law and the National Rental Affordability Scheme Act 2008 (NRAS Act)., 31416=1.1                   Schedule 1 to this Bill amends Divisions 392 and 393 of the Income Tax Assessment Act 1997 (ITAA 1997) to allow trust beneficiaries to continue to use the primary production averaging (income averaging) and farm management deposits (FMDs) provisions in an income year where the trust does not have any trust law income (trust income) to which a beneficiary can be presently entitled (for example, because the trust has a loss for trust law purposes)., 627976=2.175           Under both rules, the trustee is assessed under section 99A of the ITAA 1936 on that share of the trust’s taxable income that corresponds to the share of the income to which the beneficiary is treated as not being presently entitled.  [Schedule 2, item 6, subsections 100AA(3) and 100AB(2) of the ITAA 1936], 944457=Item 2, subsection 95(1) of the ITAA 1936, 935386=Item 5, note to section 202DL of the ITAA 1936, 874227=5.20               The Government announced on 10 May 2011 that it will reform the statutory formula method by replacing the current statutory rates with a single rate of 20 per cent that applies regardless of the distance travelled., 12966=Proposal announced :  This measure was announced in the Assistant Treasurer and Minister for Financial Services and Superannuation’s Media Release No. 025 of 16 December 2010., 22053=2012-13, 640184=However, the Smith Trust is unaware that the Quay Trust is an exempt entity until 30 September 2011 and therefore does not inform the Quay Trust of its entitlement before 31 August 2011, but rather at the (later) time when its accounts are prepared and it notifies all beneficiaries of their entitlements for trust purposes.  When the Smith Trust becomes aware that the Quay Trust is an exempt entity it takes immediate action to notify the Quay Trust of its entitlement., 711027=3.20               When the National Rental Affordability Scheme Bill 2008 was introduced, the Government stated in Parliament that they expected the scheme would facilitate new and creative partnerships between institutional investors, developers and community housing providers. , 904315=Constance entered into a commitment prior to 7:30 pm, AEST on 10 May 2011, and her contract will be grandfathered., 844982=4.64               The amendment to subsection 159JA(1) of the ITAA 1936 adds a taxpayer’s ‘invalid spouse’ or ‘carer spouse’ to the classes of dependants referred to in that subsection.  As a result, if the taxpayer is a member of a Family Tax Benefit (Part B) family, or they or their ‘invalid spouse’ or ‘carer spouse’ is receiving parental leave pay, the taxpayer will be unable to claim an offset for that part of the year in respect of the dependant.  [Schedule 4, item 25, paragraph 159JA(1)(a)], 666559=2.201           In forming an opinion for the purposes of subsection 100AB(5) of the ITAA 1936, the Commissioner must have regard to the matters set out in subsection 100AB(6) of the ITAA 1936, including:, 662223=Casey Pty Ltd’s adjusted Division 6 percentage exceeds the benchmark percentage by 95 per cent.  The trustee of the Bell Trust is therefore assessed and liable to pay tax on $95,000 (0.95  Ã\u0097  $100,000) under section 99A of the ITAA 1936. , 830146=4.46               To ensure taxpayers maintaining a spouse born on or after 1 July 1971 remain entitled to 50 per cent of their dependent spouse tax offset amount, assuming the age restriction does not apply, an amendment is made to the definition of ‘concessional rebate amount’.  [Schedule 4, item 12, subsection 79B(6)], 924902=From 1 July 2012 until 31 March 2013, the annualised kilometres driven would be 35,000  Ã\u0097  366  /  275  =  46,582 kms.  As such, the statutory rate applied to the car fringe benefits would be 0.13.}",
    "textBeforeTable": "The following table sets out for each beneficiary the overall tax treatment of the amounts they received from the trust.  (It assumes for convenience that beneficiaries had no other capital gains and no capital losses or net capital loss, and are eligible for the franking credits.) Step 6 — overall result $70,580 70.6% ($70,580/$100,000) $70,580 Dawson $0 0%",
    "textAfterTable": "Note that the total assessable income equals the net income of the trust.  The total amounts received from the trust equals the trust income of $190,000 plus $150,000 of capital distributions to Ash and Bradshaw. Example 2.28   Following on from Example 2.27, suppose that the trust had carry forward tax losses of $280,000.  The taxable income of the trust is therefore $120,000  ($400,000  â\u0088’  $280,000).  (The trust income does not change and assume that the trustee’s resolutions also do not change.) The sum of the net capital gain and (net) franked distributions is $240,000.  As this exceeds the net income of the trust (excluding franking credits) of $60,000, the taxable income of the trust attributable to each capital gain and franked distribution is reduced by three quarters ($60,000/$240,000) because of subsections 115-225(2) and (3) and subsections 207-37(2) and (3).  Therefore: â\u0080¢        Ash reduces his extra capital gain to $32,350 ($129,400/4) and his assessable franked distribution to $5,145 ($20,580/4).  â\u0080¢       ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}