{
    "relation": [
        [
            "Color",
            "Blue",
            "Blue",
            "Brown",
            "Brown"
        ],
        [
            "Design",
            "Bold",
            "Fine",
            "Bold",
            "Fine"
        ],
        [
            "Luminance (cd/m2)",
            "2.3",
            "3.9",
            "3.3",
            "7.1"
        ]
    ],
    "pageTitle": "Minimum Retroreflectivity Levels for Blue and Brown Traffic Signs - FHWA-HRT-08-029",
    "title": "Table 16. Luminance criteria for symbols.",
    "url": "https://www.fhwa.dot.gov/publications/research/safety/08029/index.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00187-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898756895,
    "recordOffset": 898712502,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{15379=U.S. Department of Transportation Federal Highway Administration 1200 New Jersey Avenue, SE Washington, DC 20590 202-366-4000, 3231=In 1992, the Congress directed the Secretary of Transportation to revise the Manual on Uniform Traffic Control Devices to include a standard for minimum levels of retroreflectivity that must be maintained for traffic signs. In 2003, the Federal Highway Administration published research recommendations for minimum maintained retroreflectivity levels for traffic signs. The recommendations included most sign types but did not include information signs, with blue backgrounds and white legends, and cultural resource signs, with brown backgrounds and white legends., 5186=As of July 2011, this online document was modified in the following ways:}",
    "TableContextTimeStampAfterTable": "{162114=Minimum Sign Contrast Ratio ≥ 3:1 (white retroreflectivity ÷ red retroreflectivity)., 44035=It was reported that the overall results of the study indicated that the 1993 MR guidelines were adequate, as more than 90 percent of the responses were correct at the luminance levels used to derive the MR levels. In addition, it was also reported that all four background scenes had correct response frequencies above the 85th percentile criterion at the guideline luminance levels. However, the findings do demonstrate that the there may be significant differences between surroundings with high complexity (metropolitan and suburban settings) and low complexity (dark and rural settings). Therefore, the investigation into the differences among visual surroundings conducted as part of the research described hereafter appears to be necessary and well justified., 37499=As recently as 2004, Van Derlofsky et al. discussed glare in relation to headlamp design and location.(4) The researchers reviewed a collection of research on the topic of glare to determine threshold values for discomfort and disability glare. The researchers also reported that under normal driving conditions, typical glare illuminance from oncoming headlamps ranges from 0 to 10 lx. A value of 0.1 lx at the eye is enough to cause driver discomfort, whereas an illuminance level between 1 and 3 lx is sufficient to cause drivers to flash their headlamps at the oncoming vehicle. A level of 3 to 10 lx is sufficient to cause unbearable discomfort., 16390=During August 2005, the researchers conducted a nighttime field study to determine the minimum luminance needed to read white-on-blue and white-on-brown signs. The research team designed a nighttime field evaluation that used the legibility of blue and brown signs to determine the minimum sign luminance needed for legibility (in the case of text legends) and recognition (in the case of symbol signs). The evaluation included the use of a glare source to simulate an oncoming vehicle and the use of roadway lighting. The signs were designed based on current Manual on Uniform Traffic Control Devices (MUTCD) guidelines. Chapter 4 describes the field evaluation and subsequent findings., 149856=The minimum luminance accommodation levels determined in the previous chapter were used in conjunction with the TTI MR model to determine the MR values for blue- and brown-background signs with white legends. These MR levels are based on 50 percent accommodation at 4.8 m/cm (40 ft/inch) LI. They are presented to be compatible with MR levels the FHWA has used in rulemaking (Federal Register, July 30, 2004, at 69 FR 45623) to amend the MUTCD to include traffic sign retroreflectivity maintenance levels., 4801=Form DOT F 1700.7 (8-72) Reproduction of completed page authorized, 40554=An experiment was conducted in the Photometric and Visibility Laboratory at the Federal Highway Administration's (FHWA) Turner-Fairbank Highway Research Center in McLean, VA.(7) The study was conducted to determine the adequacy of the 1993 MR levels in situations of varying visual complexity and environmental illumination (because the retroreflectivity values were developed for a dark environment with a medium-complexity background). Subjects were seated in a 1996 Ford Taurus inside the darkened laboratory and asked to determine if a traffic sign was present and to identify the sign from a nighttime driving scene projected onto a screen. Using projected photographs supplemented with scaled retroreflective signs illuminated at various levels to represent different luminance levels, subjects completed a target search and recognition operation on a set of 11 traffic signs presented at 4 different background complexities., 67321=The same vehicle was used throughout the entire data collection effort—a 2004 Ford Taurus, model SE. The Taurus headlamps were tungsten-halogen visually/optically aimed style. Specifically, the driver's side headlamp was HB5 VOR LH DOT SAE AHRT5P2P 00T8 and the passenger's side headlamp was HB5 VOR RH DOT SAE AHRI5P2P 00T8. \"VOR\" indicates that the headlamp is to be visually/optically aimed using the right side of the cutoff, which is to be adjusted such that it is on the horizon line (at the same height as the center of the headlamp) when shown at a wall 7.6 m (25 ft) away. All subjects were tested from the driver's seat of the test vehicle. A researcher was in the passenger's seat at all times during data collection., 138488=AMENDED July 5, 2011}",
    "textBeforeTable": "Figure 17. Graph. Luminance required for symbols signs. Comparison to Previous MR Research In the field evaluation, subjects viewed white-on-green signs in addition to the white-on-blue and white-on-brown signs. The white-on-green signs were viewed to enable the research team to compare the results of this study with previous work on minimum retroreflectivity and sign luminance.(1) This activity was used to validate the repeatability of the previous experimental protocol and as reassurance that the study described in this report was similar.   White-on-Green Legend Sign Results Using the accommodation values from the previous MR research, a comparison was made using the luminance results for distances associated with an LI of 4.8 m/cm (40 ft/inch).(1) Figure 18 illustrates that the measured luminance data",
    "textAfterTable": "Light Glare 3.9 Brown No Light No Glare 6.4 Brown No Light Glare 9.6 Brown Light No Glare 5.9 Brown Light Glare 7.2 Table 16. Luminance criteria for symbols. Color Design Luminance (cd/m2) Blue Bold 2.3 Blue Fine 3.9 Brown Bold 3.3 Brown Fine 7.1 The results for conditions without roadway lighting and without glare showed that green and blue signs require nearly the same luminance values for equal legibility, but brown signs must provide a higher level of luminance. The font of the brown signs is more difficult to read, as noted by the higher luminance required and anecdotal comments from a few research participants indicating that the serifs made words less legible with higher luminance levels. However, the combination of white on brown appears to require more luminance in general, as demonstrated by the symbol sign luminance criteria (the same six symbols were used for each color). When glare was added to the testing conditions, the amount of luminance needed to correctly read the signs increased by 215 percent for the blue signs and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}