{
    "relation": [
        [
            "Parameter, Description",
            "μm, Monthly Flow utility of being matched",
            "μmmo, Monthly Flow utility of being mismatched with metro area",
            "μd, Monthly Flow utility penalty of having 2 positions",
            "\\tilde{σ}, Stdev. Of match quality shocks",
            "σ infi, Monthly Stdev of inflow into economy"
        ],
        [
            "Estimate",
            "0.0273",
            "0.0014",
            "0.0000",
            "0.0937",
            "0.0012"
        ],
        [
            "Standard Error",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Standard Error",
            "0.0007",
            "0.0114",
            "0.0050",
            "0.0333",
            "0.0002"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Screen Reader Version - Endogenous Sources of Volatility in Housing Markets: The Joint Buyer-Seller Problem*",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/feds/2013/201360/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441396859,
    "recordOffset": 441349830,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{36389=We begin the paper by using detailed records on the universe of transactions in the Los Angeles metropolitan area from 1992-2008 to establish a series of new empirical facts about the nature of housing transactions over the cycle. Following homeowners as they buy and sell houses, we first show that internal transaction volume is incredibly volatile and indeed much more pro-cyclical than external volume.2 In particular, internal transaction volume at the peak of the boom in 2003-2005 is three times greater than in the preceding trough in 1993 and four times greater than in the subsequent trough in 2008, while external transaction volume varies in a much more narrow band. As a result, the fraction of homes sold by internal movers is highly pro-cyclical, ranging from a low of 20 percent in the trough years to over 40 percent in the peak years. We demonstrate that similar patterns hold for internal transaction volume in various volatile housing markets across the country3 and that the substantial volatility of internal movement over the cycle holds for households with both low and high loan-to-value ratios.4, 25200=The data for this section of the paper are drawn from detailed records on the universe of housing transactions in the Los Angeles metropolitan area from January 1988-June 2009. Dataquick is the provider of these data. The records include precise information on the property and structure, the transaction price, the date of the transaction, and, most importantly, the names of the buyer(s) and seller(s). When spouses purchase houses jointly, both names are observed on the property record., 23540=Before examining the data on transactions and movement, it is helpful to characterize the market cycles in the Los Angeles metropolitan area over this time period. To this end, Figure 1 presents a real housing price index for the LA metropolitan area from 1988-2008, calculated using a repeat sales analysis similar to Shiller [1991]. The underlying data for this and the other figures presented in this section are shown in Table 1. The Los Angeles market experienced booms in the late 1980s and in the early 2000s. In between these booms, the market experienced a substantial bust with real housing prices falling by 45 percent from 1990-1996. Much like the US housing market as a whole, the Los Angeles metropolitan area experienced a major bust following the early 2000s boom. Figure 1 also shows transaction volume and the median TOM over the cycle.8 Like prices, transaction volume and TOM are quite volatile over time, and they are positively and negatively correlated with prices, respectively., 21124=To ensure that our results on internal movement are not unique to Los Angeles or dependent on any assumptions in our name matching algorithm, we also examine internal movement using the FRBNY/Equifax Consumer Credit Panel data. Using these data, we can track when homeowners throughout the country move using a household id (i.e. we do not need to match names) and we can see whether they move within or outside their MSA. Owner occupancy is not observed directly but is inferred from the mortgage information of the individual. We find that the level of the internal mover share is comparable in the Equifax data during the years in which the two datasets overlap. In Equifax, the average internal mover share for MSAs in California between 2001-2008 is 38 percent, versus 35 percent for Los Angeles using the Dataquick data. We not only find that the internal mover share is positively correlated with the house price cycle for MSAs in California; we also find that across MSAs in the U.S., differences in the volatility of the internal mover share over time are strongly related to across MSA differences in house price dynamics, as illustrated in Appendix Figure 1. The details of the Equifax data and the analyses are discussed in Appendix A. Appendix A also discusses a third robustness check we conduct using the American Housing Survey for Los Angeles. This dataset is more limited, but it confirms our finding that most housing transactions are indeed external.}",
    "TableContextTimeStampAfterTable": "{88851=Paul E. Carrillo. An empirical stationary equilibrium search model of the housing market*. International Economic Review, 53(1):203-234, 2012., 92841=John M. Quigley and Steven Raphael. Regulation and the high cost of housing in california. The American Economic Review, 95(2):pp. 323-328, 2005., 93529=Jeremy C. Stein. Prices and trading volume in the housing market: A model with downpayment effects. The Quarterly Journal of Economics, 110(2):379-406, 1995., 91705=Atif Mian and Amir Sufi. House prices, home equity-based borrowing, and the us household leverage crisis. American Economic Review, 101(5):2132-56, 2011., 89468=N. Edward Coulson and Paul L.E. Grieco. Mobility and mortgages: Evidence from the psid. Regional Science and Urban Economics, 43(1):1 -7, 2013., 93117=Sam Schulhofer-Wohl. Negative equity does not reduce homeowners' mobility. Technical report, National Bureau of Economic Research, 2011., 92160=Rachel Ngai and Silvana Tenreyro. Hot and cold seasons in the housing market. mimeo London School of Economics, 2010., 93386=Robert Shimer. The cyclical behavior of equilibrium unemployment and vacancies. The American Economic Review, 95(1):pp. 25-49, 2005., 88014=Elliot Anenberg and Ed Kung. Estimates of the size and source of price declines due to nearby foreclosures. Working Paper 84, Federal Reserve Board, December 2012., 91354=Steven D. Levitt and Chad Syverson. Market distortions when agents are better informed: The value of information in real estate transactions. Review of Economics and Statistics,90(4):599-611, 2008., 90987=Donghoon Lee and Wilbert Van der Klaauw. An introduction to the frbny consumer credit panel. Working Paper 479, FRB of New York Staff, November 2010., 88588=John Campbell, Stefano Giglio, and Parag Pathak. Forced sales and house prices. American Economic Review, 2011., 92288=Robert Novy-Marx. Hot and cold markets. Real Estate Economics, 37(1):1-22, 2009., 89324=Sewin Chan. Spatial lock-in: Do falling house prices constrain residential mobility? Journal of Urban Economics, 49(3):567-568, 1997., 92562=Monika Piazzesi and Martin Schneider. Momentum traders in the housing market: Survey evidence and a search model. American Economic Review Papers and Proceedings, 99(2): 406-411, 2009., 88710=Andrew Caplin and John Leahy. Trading frictions and house price dynamics. Journal of Money, Credit and Banking , 43:283-303, 2011., 92379=Francois Ortalo-Magne and Sven Rady. Housing market dynamics: On the contribution of income shocks and credit constraints. Review of Economic Studies , 73(2):459-485, 2006., 121729=Notes: Year 2009 includes sales through June only. A transaction is internal if the seller also bought a house in the Los Angeles MSA within 12 months of the selling date. A transaction is external if the seller does not buy a house in the Los Angeles MSA within 12 months of the selling date. All data except for Days on Market comes from Dataquick. Days on Market data comes from California Association of Realtors. We cannot break out total transaction volume into internal and external movement during the years before 1992 because the buyer and seller names are severely truncated in the Dataquick data for those years. Notes: Year 2009 includes sales through June only. A transaction is internal if the seller also bought a house in the Los Angeles MSA within 12 months of the selling date. A transaction is external if the seller does not buy a house in the Los Angeles MSA within 12 months of the selling date. All data except for Days on Market comes from Dataquick. Days on Market data comes from California Association of Realtors. We cannot break out total transaction volume into internal and external movement during the years before 1992 because the buyer and seller names are severely truncated in the Dataquick data for those years., 91147=Donghoon Lee and Kenneth I. Wolpin. Accounting for wage and employment changes in the us from 1968-2000: A dynamic model of labor market equilibrium. Journal of Econometrics, 156(1):68 - 85, 2010., 90114=David Genesove and Lu Han. Search and matching in the housing market. Journal of Urban Economics , 2012., 90858=John Krainer. A theory of liquidity in residential real estate markets. Journal of Urban Economics, 49(1):32-53, 2001., 93265=Robert J. Shiller. Arithmetic repeat sales price estimators. Journal of Housing Economics, 1(1):110-126, 1991., 88189=Patrick Bayer, Christopher Geissler, and James W. Roberts. Speculators and middlemen: The role of ippers in the housing market. Working Paper 16784, National Bureau of Economic Research, February 2011., 87679=James Albrecht, Axel Anderson, Eric Smith, and Susan Vroman. Opportunistic matching in the housing market. International Economic Review, 48(2):641-664, 2007., 87848=Elliot Anenberg. Loss aversion, equity constraints and seller behavior in the real estate market. Regional Science and Urban Economics , 41(1):67-76, 2011., 90406=Edward L. Glaeser, Joseph Gyourko, and Raven Saks. Why have housing prices gone up? The American Economic Review, 95(2):pp. 323-328, 2005.Allen Head, Huw Lloyd-Ellis, and Hongfei Sun. Search, liquidity and the dynamics of house prices and construction. mimeo Queens University, 2011., 88401=Craig Burnside, Martin Eichenbaum, and Sergio Rebelo. Understanding booms and busts in housing markets. Working Paper 16734, National Bureau of Economic Research, January 2011., 90229=David Genesove and Christopher Mayer. Loss aversion and seller behavior: Evidence from the housing market. The Quarterly Journal of Economics, 116(4):1233-1260, 2001., 97563=Appendix Figure 1 plots the internal mover share by year for MSAs in California, averaged across MSAs. We smooth through the year 2003 because there is an uptick in internal movement (not just in California but in all states) due to a change in Equifax's methodology of determining someone's address. The level of the internal mover share is similar to the level of the internal mover share calculated from the Dataquick data specifically for Los Angeles. The internal mover share is also pro-cyclical for MSAs in California. Interestingly, the internal mover share peaks just before the house price index, which we also find to be the case in Dataquick (see Figure 1). Since the Equifax data is nationally representative, we can also investigate across MSA differences in the dynamics of the internal mover share. The states in the left panel of Appendix Figure 1 had large price run-ups in the early 2000's, followed by large house price declines starting in the middle of the decade. The states in the right panel had more subdued house price dynamics according to CoreLogic. The evidence strongly suggests that the dynamics of internal movement are correlated with the house price cycle., 99454=We use the American Housing Survey data for Los Angeles to calculate the share of owner-occupied housing units with recent movers where the previous unit of the recent mover was also owner-occupied (Source: Table 3-10). This should overstate the internal mover share as we define it because a move between two owner occupied units from one MSA to another would be included in the numerator. The survey is only conducted every 5 years or so, but the average share in the six most recent surveys is 40 percent, consistent with our finding that most housing transactions are external. The share is the highest in 1989 (during a house price boom) and the lowest in 1995 (during a house price bust)., 89153=Karl E Case, John M Quigley, and Robert J Shiller. Comparing wealth effects: the stock market versus the housing market. Advances in macroeconomics, 5(1), 2005., 93697=William C. Wheaton. Vacancy, search, and prices in a housing market matching model. Journal of Political Economy, 98(6):pp. 1270-1292, 1990., 91869=Raven Molloy and Hui Shan. The postforeclosure experience of us households. Real Estate Economics, 2012., 91562=Guido Menzio and Shouyong Shi. Efficient search on the job and the business cycle. Journal of Political Economy , 119:468-510, 2011., 92997=Jean-Marc Robin. On the dynamics of unemployment and wage distributions. Econometrica, 79(5):1327-1355, 2011., 89966=Fernando Ferreira, Joseph Gyourko, and Joseph Tracy. Housing busts and household mobility. Journal of Urban Economics, 68(1):34-45, 2010., 92757=Christopher Pissarides. Equilibrium unemployment theory. MIT Press, 2000., 89782=Gary Engelhardt. Nominal loss aversion, housing equity constraints, and household mobility: evidence from the united states. Journal of Urban Economics, 53(1):171-195, 2003., 89004=Karl E. Case and Robert J. Shiller. The e\u000eciency of the market for single-family homes. The American Economic Review, 79(1):125-137, 1989., 90700=Arthur J. Hosios. On the efficiency of matching and related models of search and unemployment. The Review of Economic Studies, 57(2):279-298, 1990., 91984=Dale T. Mortensen and Christopher A. Pissarides. Job creation and job destruction in the theory of unemployment. The Review of Economic Studies, 61(3):397-415, 1994.}",
    "lastModified": "Wed, 05 Feb 2014 17:57:54 GMT",
    "textBeforeTable": "Table 1: Summary Of Transactions and Prices Los Angeles Metropolitan Area 1988-2009 Appendix 1: Internal Mover Share from Equifax Data (Top Panel) and House Prices (Bottom Panel) Figure 8: Inefficiency for Different Choices of Nash Bargaining Parameter as a Fraction of Inefficiency Under Baseline Specificiation(Symmetric Bagaining Power) city (RS).\" /> realizations are such that there is a long boom and bust",
    "textAfterTable": "-- -- -- -- 1991 0.08 104532 86 -- -- -- -- 1992 -0.00 95813 88 22.4 67903 27910 29.1 1993 -0.13 97441 93 26.2 76170 21271 21.8 1994 -0.22 115865 80 27.1 90966 24899 21.5 1995 -0.27 99876 75 29.7 78632 21244 21.3 1996 -0.31 115053 59 30.2 88821 26232 22.8 1997 -0.29 127579 48 30.2 95671 31908 25.0 1998 -0.20 146705 38 29.0 102987 43718 29.8 1999 -0.13 155617 36 29.7 106084 49533 31.8 2000 -0.06 147946 29 28.8 96727 51219 34.6 2001 0.02 142185 27 24.9 89207 52978 37.3 2002 0.14 155375 24 23.7 96270 59105 38.0 2003 0.30 157820 24 25.0 92356 65464 41.5 2004 0.53 148012 23 27.3 86084 61928 41.8 2005 0.68 144048 25 30.1 83966 60082 41.7 2006 0.73 109414 44 36.6 68887 40527 37.0 2007 0.63 74984 53 37.4 53981 21003 28.0 2008 0.31 81295 49 28.2 67020 14275 17.6 2009 0.11 49037 37 -- -- -- -- Notes: Year 2009 includes sales through June only. A transaction is internal if the seller also bought a house in the Los Angeles MSA within 12 months of the selling date. A transaction is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}