{
    "relation": [
        [
            "#",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Employer",
            "Boeing",
            "Quiksilver",
            "Cambro Manufacturing",
            "Verizon",
            "Hyatt Regency Huntington Beach",
            "C & D Aerospace",
            "Huntington Beach Hospital",
            "Fisher & Paykel",
            "Rainbow Disposal",
            "Home Depot (including Expo)"
        ],
        [
            "# of Employees",
            "4,352",
            "1,337",
            "909",
            "723",
            "670",
            "600",
            "503",
            "441",
            "408",
            "386"
        ]
    ],
    "pageTitle": "MUSIC INSTRUMENTS ORANGE COUNTY, MUSIC SCHOOL ORANGE COUNTY, MUSIC STORE HUNTINGTON BEACH CA, PRIVATE MUSIC LESSONS, GUITAR LESSONS, DRUM LESSONS, VOICE LESSONS, PIANO LESSONS, GUITARS, LESSONS, VIOLINS, KEYBOARDS, RENTALS, REPAIRS, DRUMS, UKULELES, Guitar, Drums, Voice, Piano, Fountain Valley, Andrew Morrison, James Haley, Laura Valle, Vera Mearus, guitar strings, guitar accessories, Tuning, Books, DVD, Videos, Amps, Music Lessons, Cello, Flute, Trumpet, Saxaphone, Clarinet, Violin, Ukulele, Keyboard, Piano, Huntington Beach, Fountain Valley, Newport Beach, Seal Beach, Costa Mesa, Orange County, Electric Guitars, Acoustic Guitars, Bass Guitars, Elixir Guitars, Cleartone Guitars, D'adario Guitars, Martin Guitars, John Pearse Guitars, Dean Marley Guitars, Augustine Guitars, Savarez Guitars, La Bella Guitars, Ernie Ball Guitars, Gypsy Guitars, The Loar Guitars, 1/4 Classic Guitar, 1/2 Classic Guitar, 3/4 Classic Guitar, 4/4 Classic Guitar, Baritone Ukuleles, Tenor Ukuleles, Concert Ukuleles, Soprano Ukuleles, Uke Strings, Strings, Aquila Strings, Martin Strings, Hawaiian Strings, 1/4 Violins, 1/2 Violines, 3/4 Violins, 4/4 Violins, Drum Sets, Custom Keyboards, Tuners, Metronomes, Pitch Pipes, Tuning Forks, Cables, Straps, Cases, Gig Bags, Foot Stools, Jazz Kat Amplifiers, Amplifiers, Instructional Books, Music Books, Band Personality Books, Sheet Music, Guitar Lessons, Acoustic Guitar Lessons,Electric Guitar Lessons, Bass Guitar Lessons,Violin Lessons, Cello Lessons, Music School, Flute Lessons, Clarinet Lessons, Saxophone Lessons, Trumpet Lessons, Instrument Rentals, Saxaphone Rental, Clarinet Rental, Trumpet Rental, Flute Rental, Violin Rental, Cello Rental, School Rental, Monthly Musical Instrument Rental, Video Music Training, DVD Music Training, Instructional Videos, Instructional DVD, Instructional Video Rental, Instruction DVD Rental, Guitar Repair, Guitar Tuning, Set-ups, Cracks, Neck Rests, Fret Replacements, Violin Repair, Damaged Violin Repair, Damaged Guitar Repair, Musical Instrument Repair, Keyboard Repair, Ukulele Repair, Cello Repair, High School Musical Instruments - Rental and Repair, Band Instrument Repair, All Musical Instrument Repairs, 92605, 92615, 92646, 92647, 92648, 92649, AB Music Studios",
    "title": "",
    "url": "http://musicinstrumentsorangecountymusicschoolstorehuntingtonbeachca.com/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 163439799,
    "recordOffset": 163306060,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{158125=Andre Schaeffner, a curator at the Musée de l'Homme, disagreed with the Hornbostel-Sachs system and developed his own system in 1932. Schaeffner believed that the physical structure of a musical instrument, rather than its playing method, should determine its classification. His system divided instruments into two categories: instruments with solid, vibrating bodies and instruments containing vibrating air., 240983=If you've always wanted to learn to play a musical instrument here is your chance! If you've always wanted to have your kids play or they need some help, we can be of assistance! We make it easy - from the first chord we teach one to one, the best ways to learn how to play - you'll be playing well in no time! You can purchase equipment from us, rent it, or let us fix or repair what you have. AB Music Studios is one of the best equiped music stores in Orange County! Please come Visit us for your Music Needs! AB Music offers private music lessons, repairs, rentals, and instructional music videos . We have been providing services in Huntington Beach since 1981., 198624=In July 1995, Slovenian archaeologist Ivan Turk discovered a bone carving in the northwest region of Slovenia. The carving, named the Divje Babe flute, features four holes that Canadian musicologist Bob Fink determined could have been used to play four notes of a diatonic scale. Researchers estimate the flute's age to be between 43,400 and 67,000 years, making it the oldest known musical instrument and the only musical instrument associated with the Neanderthal culture. However, some archaeologists question the flute's status as a musical instrument. German archaeologists have found mammoth bone and swan bone flutes dating back to 30,000 to 37,000 years old in the Swabian Alb. The flutes were made in the Upper Paleolithic age, and are more commonly accepted as being the oldest known musical instruments., 23612=As talking pictures emerged in the early 20th century, with their prerecorded musical tracks, an increasing number of moviehouse orchestra musicians found themselves out of work. During the 1920s live musical performances by orchestras, pianists, and theater organists were common at first-run theaters. With the coming of the talking motion pictures, those featured performances were largely eliminated. The American Federation of Musicians (AFM) took out newspaper advertisements protesting the replacement of live musicians with mechanical playing devices. One 1929 ad that appeared in the Pittsburgh Press features an image of a can labeled \"Canned Music / Big Noise Brand / Guaranteed to Produce No Intellectual or Emotional Reaction Whatever\", 67126=Ancient music can only be imagined by scholars, based on findings from a range of paleolithic sites, such as bones in which lateral holes have been pierced: these are usually identified as flutes, blown at one end like the Japanese shakuhachi. Instruments, such as the seven-holed flute and various types of stringed instruments have been recovered from the Indus Valley Civilization archaeological sites. India has one of the oldest musical traditions in the world\u0097references to Indian classical music (marga) can be found in the ancient scriptures of the Hindu tradition, the Vedas. The earliest and largest collection of prehistoric musical instruments was found in China and dates back to between 7000 and 6600 BC., 179652=Musical instruments such as zithers appear in Chinese literature written around 1100 BC and earlier. Early Chinese philosophers such as Confucius (551\u0096479 BC), Mencius (372\u0096289 BC), and Laozi shaped the development of musical instruments in China, adopting an attitude toward music similar to that of the Greeks. The Chinese believed that music was an essential part of character and community, and developed a unique system of classifying their musical instruments according to their material makeup. Idiophones were extremely important in Chinese music, hence the majority of early instruments were idiophones. Poetry of the Shang Dynasty mentions bells, chimes, drums, and globular flutes carved from bone, the latter of which has been excavated and preserved by archaeologists. The Zhou Dynasty introduced percussion instruments such as clappers, troughs, wooden fish, and yu. Wind instruments such as flute, pan-pipes, pitch-pipes, and mouth organs also appeared in this time period. The short lute, a pear-shaped form of a western instrument that spread through many cultures, came into use in China during the Han Dynasty., 167784=Beginning in about 1400, the rate of development of musical instruments increased in earnest as compositions demanded more dynamic sounds. People also began writing books about creating, playing, and cataloging musical instruments; the first such book was Sebastian Virdung's 1511 treatise Musica getuscht und angezogen (English: Music Germanized and Abstracted). Virdung's work is noted as being particularly thorough for including descriptions of \"irregular\" instruments such as hunters' horns and cow bells, though Virdung is critical of the same. Other books followed, including Arnolt Schlick's Spiegel der Orgelmacher und Organisten (English: Mirror of Organ Makers and Organ Players) the same year, a treatise on organ building and organ playing. Of the instructional books and references published in the Renaissance era, one is noted for its detailed description and depiction of all wind and stringed instruments, including their relative sizes. This book, the Syntagma musicum by Michael Praetorius, is now considered an authoritative reference of sixteenth century musical instruments., 172267=Despite the influences of Greece and Rome, most musical instruments in Europe during the Middles Ages came from Asia. The lyre is the only musical instrument that may have been invented in Europe until this period. Stringed instruments were prominent in Middle Age Europe. The central and northern regions used mainly lyres, stringed instruments with necks, while the southern region used lutes, which featured a two-armed body and a crossbar. Various harps served Central and Northern Europe as far north as Ireland, where the harp eventually became a national symbol. Lyres propagated through the same areas, as far east as Estonia. European music between 800 and 1100 became more sophisticated, more frequently requiring instruments capable of polyphony. The Persian geographer of the 9th century (Ibn Khordadbeh), mentioned in his lexicographical discussion of music instruments that in the Byzantine Empire typical instruments included the urghun (organ), shilyani (probably a type of harp or lyre), salandj (probably a bagpipe) and the Byzantine lyra (Greek: ???? ~ lu-ra-) . Lyra was a medieval pear-shaped bowed string instrument with three to five strings, held upright and is an ancestor of most European bowed instruments, including the violin. The monochord served as a precise measure of the notes of a musical scale, allowing more accurate musical arrangements. Mechanical hurdy-gurdies allowed single musicians to play more complicated arrangements than a fiddle would; both were prominent folk instruments in the Middle Ages. Southern Europeans played short and long lutes whose pegs extended to the sides, unlike the rear-facing pegs of Central and Northern European instruments. Idiophones such as bells and clappers served various practical purposes, such as warning of the approach of a leper. The ninth century revealed the first bagpipes, which spread throughout Europe and had many uses from folk instruments to military instruments. The construction of pneumatic organs evolved in Europe starting in fifth century Spain, spreading to England in about 700. The resulting instruments varied in size and use from portable organs worn around the neck to large pipe organs. Literary accounts of organs being played in English Benedictine abbeys toward the end of the tenth century are the first references to organs being connected to churches. Reed players of the Middle Ages were limited to oboes; no evidence of clarinets exists during this period., 168755=Musical instrument development was dominated by the Western Occident from 1400 on\u0097indeed, the most profound changes occurred during the Renaissance period. Instruments took on other purposes than accompanying singing or dance, and performers used them as solo instruments. Keyboards and lutes developed as polyphonic instruments, and composers arranged increasingly complex pieces using more advanced tablature. Composers also began designing pieces of music for specific instruments. In the latter half of the sixteenth century, orchestration came into common practice as a method of writing music for a variety of instruments. Composers now specified orchestration where individual performers once applied their own discretion. The polyphonic style dominated popular music, and the instrument makers responded accordingly., 160720=Erich von Hornbostel and Curt Sachs later took up the ancient scheme and published an extensive new scheme for classification in Zeitschrift für Ethnologie in 1914. Their scheme is widely used today, and is most often known as the Hornbostel-Sachs system., 196335=A cuneiform tablet from Nippur in Mesopotamia dated to 2000 BCE indicates the names of strings on the lyre and represents the earliest known example of music notation., 57673=In 1800, the Romantic era (1800-1890s) in music developed, with Ludwig van Beethoven and Franz Schubert as transitional composers who introduced a more dramatic, expressive style. During this era, existing genres, forms, and functions of music were developed, and the emotional and expressive qualities of music came to take precedence over technique and tradition. In Beethoven's case, motifs (developed organically) came to replace melody as the most significant compositional unit. The late 19th century saw a dramatic expansion in the size of the orchestra, and in the role of concerts as part of urban society. Later Romantic composers such as Pyotr Ilyich Tchaikovsky and Gustav Mahler created complex and often much longer musical works. They used more complex chords and used more dissonance to create dramatic tension., 184349=In contrast with Mesopotamia and Egypt, professional musicians did not exist in Israel between 2000 and 1000 BC. While the history of musical instruments in Mesopotamia and Egypt relies on artistic representations, the culture in Israel produced few such representations. Scholars must therefore rely on information gleaned from the Bible and the Talmud. The Hebrew texts mention two prominent instruments associated with Jubal, ugabs and kinnors. These may be translated as pan pipes and lyres, respectively. Other instruments of the period included tofs, or frame drums, small bells or jingles called pa'amon, shofars, and the trumpet-like hasosra. The introduction of a monarchy in Israel during the 11th century BC produced the first professional musicians and with them a drastic increase in the number and variety of musical instruments. However, identifying and classifying the instruments remains a challenge due to the lack of artistic interpretations. For example, stringed instruments of uncertain design called nevals and asors existed, but neither archaeology nor etymology can clearly define them. In her book A Survey of Musical Instruments, American musicologist Sibyl Marcuse proposes that the nevel must be similar to vertical harp due to its relation to \"nabla\", the Phoenician term for \"harp\"., 188536=Images of musical instruments begin to appear in Mesopotamian artifacts in 2800 BC or earlier. Beginning around 2000 BC, Sumerian and Babylonian cultures began delineating two distinct classes of musical instruments due to division of labor and the evolving class system. Popular instruments, simple and playable by anyone, evolved differently from professional instruments whose development focused on effectiveness and skill. Despite this development, very few musical instruments have been recovered in Mesopotamia. Scholars must rely on artifacts and cuneiform texts written in Sumerian or Akkadian to reconstruct the early history of musical instruments in Mesopotamia. Even the process of assigning names to these instruments is challenging since there is no clear distinction among various instruments and the words used to describe them. Although Sumerian and Babylonian artists mainly depicted ceremonial instruments, historians have been able to distinguish six idiophones used in early Mesopotamia: concussion clubs, clappers, sistra, bells, cymbals, and rattles. Sistra are depicted prominently in a great relief of Amenhotep III, and are of particular interest because similar designs have been found in far-reaching places such as Tbilisi, Georgia and among the Native American Yaqui tribe. The people of Mesopotamia preferred stringed instruments to any other, as evidenced by their proliferation in Mesopotamian figurines, plaques, and seals. Innumerable varieties of harps are depicted, as well as lyres and lutes, the forerunner of modern stringed instruments such as the violin., 61682=During the Medieval music era (500-1400), the only European repertory which has survived from before about 800 is the monophonic liturgical plainsong of the Roman Catholic Church, the central tradition of which was called Gregorian chant. Alongside these traditions of sacred and church music there existed a vibrant tradition of secular song. Examples of composers from this period are Léonin, Pérotin and Guillaume de Machaut. From the Renaissance music era (1400-1600), much of the surviving music of 14th century Europe is secular. By the middle of the 15th century, composers and singers used a smooth polyphony for sacred musical compositions. The introduction of commercial printing helped to disseminate musical styles more quickly and across a larger area. Prominent composers from this era are Giovanni Pierluigi da Palestrina, Thomas Morley and Orlande de Lassus., 181743=Evidence of musical instruments in use by early civilizations of India is almost completely lacking, making it impossible to reliably attribute instruments to the Munda and Dravidian language-speaking cultures that first settled the area. Rather, the history of musical instruments in the area begins with the Indus Valley Civilization that emerged around 3000 BC. Various rattles and whistles found among excavated artifacts are the only physical evidence of musical instruments. A clay statuette indicates the use of drums, and examination of the Indus script has also revealed representations of vertical arched harps identical in design to those depicted in Sumerian artifacts. This discovery is among many indications that the Indus Valley and Sumerian cultures maintained cultural contact. Subsequent developments in musical instruments in India occurred with the Rigveda, or religious hymns. These songs used various drums, shell trumpets, harps, and flutes. Other prominent instruments in use during the early centuries AD were the snake charmer's double clarinet, bagpipes, barrel drums, cross flutes, and short lutes. In all, India had no unique musical instruments until the Middle Ages., 197528=Archaeological evidence of musical instruments was discovered in excavations at the Royal Cemetery in the Sumerian city of Ur (see Lyres of Ur). These instruments include nine lyres, two harps, a silver double flute, sistra and cymbals. A set of reed-sounded silver pipes discovered in Ur was the likely predecessor of modern bagpipes. The cylindrical pipes feature three side-holes that allowed players to produce whole tone scales. These excavations, carried out by Leonard Woolley in the 1920s, uncovered non-degradable fragments of instruments and the voids left by the degraded segments which, together, have been used to reconstruct them. The graves to which these instruments were related have been carbon dated to between 2600 and 2500 BCE, providing evidence that these instruments were being used in Sumeria by this time., 165114=Beginning in the seventeenth century, composers began creating works of a more emotional style. They felt that a monophonic style better suited the emotional music and wrote musical parts for instruments that would complement the singing human voice. As a result, many instruments that were incapable of larger ranges and dynamics, and therefore were seen as unemotional, fell out of favor. One such instrument was the oboe. Bowed instruments such as the violin, viola, baryton, and various lutes dominated popular music. Beginning in around 1750, however, the lute disappeared from musical compositions in favor of the rising popularity of the guitar. As the prevalence of string orchestras rose, wind instruments such as the flute, oboe, and bassoon began to be readmitted to counteract the monotony of hearing only strings., 2360=One of the earliest mentions of Music Therapy was in Al-Farabi's (c. 872 - 950) treatise Meanings of the Intellect which described the therapeutic effects of music on the soul. Music has long been used to help people deal with their emotions. In the 17th century, the scholar Robert Burton's The Anatomy of Melancholy argued that music and dance were critical in treating mental illness, especially melancholia. He noted that music has an \"excellent power ...to expel many other diseases\" and he called it \"a sovereign remedy against despair and melancholy\". He pointed out that in Antiquity, Canus, a Rhodian fiddler, used music to \"make a melancholy man merry, ...a lover more enamoured, a religious man more devout.\" In November 2006, Dr. Michael J. Crawford and his colleagues also found that music therapy helped schizophrenic patients. In the Ottoman Empire, mental illnesses were treated with music., 185827=Musical instruments used by the Egyptian culture before 2700 BC bore striking similarity to those of Mesopotamia, leading historians to conclude that the civilizations must have been in contact with one another. Sachs notes that Egypt did not possess any instruments that the Sumerian culture did not also possess. However, by 2700 BC the cultural contacts seem to have dissipated; the lyre, a prominent ceremonial instrument in Sumer, did not appear in Egypt for another 800 years. Clappers and concussion sticks appear on Egyptian vases as early as 3000 BC. The civilization also made use of sistra, vertical flutes, double clarinets, arched and angular harps, and various drums. Little history is available in the period between 2700 BC and 1500 BC, as Egypt (and indeed, Babylon) entered a long violent period of war and destruction. This period saw the Kassites destroy the Babylonian empire in Mesopotamia and the Hyksos destroy the Middle Kingdom of Egypt. When the Pharaohs of Egypt conquered Southwest Asia in around 1500 BC, the cultural ties to Mesopotamia were renewed and Egypt's musical instruments also reflected heavy influence from Asiatic cultures. Under their new cultural influences, the people of the New Kingdom began using oboes, trumpets, lyres, lutes, castanets, and cymbals., 22603=Since legislation introduced to help protect performers, composers, publishers and producers, including the Audio Home Recording Act of 1992 in the United States, and the 1979 revised Berne Convention for the Protection of Literary and Artistic Works in the United Kingdom, recordings and live performances have also become more accessible through computers, devices and Internet in a form that is commonly known as Music-On-Demand., 194380=German musicologist Curt Sachs, one of the most prominent musicologists and musical ethnologists in modern times, proposed that a geographical chronology until approximately 1400 is preferable, however, due to its limited subjectivity. Beyond 1400, one can follow the overall development of musical instruments by time period., 161806=An ancient system, dating from at least the 1st century BC, divides instruments into four main classification groups: instruments where the sound is produced by vibrating strings; instruments where the sound is produced by vibrating columns of air; percussion instruments made of wood or metal; and percussion instruments with skin heads, or drums. Victor-Charles Mahillon later adopted a system very similar to this. He was the curator of the musical instrument collection of the conservatoire in Brussels, and for the 1888 catalogue of the collection divided instruments into four groups: string instruments, wind instruments, percussion instruments, and drums., 164099=In the mid-seventeenth century, what was known as a hunter's horn underwent transformation into an \"art instrument\" consisting of a lengthened tube, a narrower bore, a wider bell, and much wider range. The details of this transformation are unclear, but the modern horn or, more colloquially, French horn, had emerged by 1725. The slide trumpet appeared, a variation which includes a long-throated mouthpiece that slid in and out, allowing the player infinite adjustments in pitch. This variation on the trumpet was unpopular due to the difficulty involved in playing it. Organs underwent tonal changes in the Baroque period, as manufacturers such as Abraham Jordan of London made the stops more expressive and added devices such as expressive pedals. Sachs viewed this trend as a \"degeneration\" of the general organ sound., 59563=The era of Baroque music (1600-1750) began when the first operas were written and when contrapuntal music became prevalent. German Baroque composers wrote for small ensembles including strings, brass, and woodwinds, as well as choirs, pipe organ, harpsichord, and clavichord. During the Baroque period, several major music forms were defined that lasted into later periods when they were expanded and evolved further, including the fugue, the invention, the sonata, and the concerto. Composers from the Baroque era include Johann Sebastian Bach, George Frideric Handel and Georg Philipp Telemann. The music of the Classical period (1750-1800) is characterized by homophonic texture, often featuring a prominent melody with accompaniment. These new melodies tended to be almost voice-like and singable. The now popular instrumental music was dominated by further evolution of musical forms initially defined in the Baroque period: the sonata, and the concerto, with the addition of the new form, the symphony. Joseph Haydn and Wolfgang Amadeus Mozart are among the central figures of the Classical period.}",
    "TableContextTimeStampAfterTable": "{158185=Areas of Newport Beach include Corona del Mar, Balboa Island, Newport Coast, San Joaquin Hills, and Balboa Peninsula (also known as Balboa)., 54505=The downtown district includes an active art center, a colorful shopping district, and the International Surfing Museum. This district was also once the home of the famous restaurant and music club \"The Golden Bear.\" In the late 1960s and 1970s it hosted many famous bands and acts. The Huntington Beach Pier stretches from Main Street into the Pacific Ocean. At the end of the pier is a Ruby's Diner. The Surf Theatre, which was located one block north of the pier, gained fame in the 1960s and 1970s for showing independent surf films such as The Endless Summer and Five Summer Stories. The Surf Theatre was owned and operated by Hugh Larry Thomas from 1961 until it was demolished in 1989. A newer version of The Surf Theatre is now closed, but the International Surf Museum has preserved its memory with a permanent exhibit featuring vintage seats and screening of surfing movies once shown at a Huntington Beach theater., 60809=Huntington Beach is the site of the world surfing championships, held in the summer every year. The city is often referred to as \"Surf City\" because of this high profile event, its history and culture of surfing. It is often called the \"Surfing Capital of the World\", not for the height of the waves, but rather for the consistent quality of surf. Gordon Duane established the city's first surf shop, Gordie's Surfboards, in 1955., 128427=Westminster was incorporated in 1957, at which time it had 10,755 residents. Originally, the city was named Tri-City because it was the amalgamation of three cities: Westminster, Barber City, and Midway City. Midway City ultimately turned down incorporation, leaving Barber City to be absorbed into the newly incorporated Westminster. The former Barber City was located in the western portion of the current City of Westminster., 265372=As of the census of 2000, there were 24,157 people, 13,048 households, and 5,884 families residing in the city. The population density was 810.3/km² (2,099.5/mi²). There were 14,267 housing units at an average density of 478.6/km² (1,240.0/mi²). The racial makeup of the city was 88.91% White, 1.44% African American, 0.30% Native American, 5.74% Asian, 0.18% Pacific Islander, 1.28% from other races, and 2.16% from two or more races. Hispanic or Latino of any race were 6.43% of the population., 15790=Meadowlark Airport, a small general aviation airport, existed in Huntington Beach from the 1950s until 1989., 280907=Moses parted the \"Red Sea\" for Cecil B. DeMille's 1923 version of The Ten Commandments on the flat seashore of Seal Beach. (Cecil B. DeMille's 1956 epic color version with Charlton Heston as Moses has no connection to Seal Beach.), 287395=Orange County is a county in Southern California, United States. Its county seat is Santa Ana. According to the 2000 Census, its population was 2,846,289, making it the second most populous county in the state of California, and the fifth most populous in the United States. The state of California estimates its population as of 2007 to be 3,098,121 people, dropping its rank to third, behind San Diego County. Thirty-four incorporated cities are located in Orange County; the newest is Aliso Viejo. Unlike many other large centers of population in the United States, Orange County uses its county name as its source of identification whereas other places in the country are identified by the large city that is closest to them. This is because there is no defined center to Orange County like there is in other areas which have one distinct large city. Five Orange County cities have populations exceeding 170,000 while no cities in the county have populations surpassing 360,000. Seven of these cities are among the 200 largest cities in the United States. Orange County is also famous as a tourist destination, as the county is home to such attractions as Disneyland and Knott's Berry Farm, as well as sandy beaches for swimming and surfing, yacht harbors for sailing and pleasure boating, and extensive area devoted to parks and open space for golf, tennis, hiking, kayaking, cycling, skateboarding, and other outdoor recreation. It is at the center of Southern California's Tech Coast, with Irvine being the primary business hub. The average price of a home in Orange County is $541,000. Orange County is the home of a vast number of major industries and service organizations. As an integral part of the second largest market in America, this highly diversified region has become a Mecca for talented individuals in virtually every field imaginable. Indeed the colorful pageant of human history continues to unfold here; for perhaps in no other place on earth is there an environment more conducive to innovative thinking, creativity and growth than this exciting, sun bathed valley stretching between the mountains and the sea in Orange County. Orange County was Created March 11 1889, from part of Los Angeles County, and, according to tradition, so named because of the flourishing orange culture. Orange, however, was and is a commonplace name in the United States, used originally in honor of the Prince of Orange, son-in-law of King George II of England., 130343=As of the census of 2000, there were 88,207 people, 26,406 households, and 20,411 families residing in the city. The population density was 3,368.6/km² (8,724.2/mi²). There were 26,940 housing units at an average density of 1,028.8/km² (2,664.5/mi²). The racial makeup of the city was 45.79% White, 0.99% African American, 0.61% Native American, 38.13% Asian, 0.46% Pacific Islander, 10.19% from other races, and 3.84% from two or more races. Hispanic or Latino of any race were 21.70% of the population., 53195=An ongoing dispute between Huntington Beach and Santa Cruz, California over the trademark garnered negative national publicity in 2007 when a law firm representing Huntington Beach sent a cease-and-desist letter to a Santa Cruz t-shirt vendor. A settlement was reached in January, 2008, which allows the Huntington Beach Conference and Visitors Bureau to retain the trademark., 208427=In 1801, the Spanish Empire granted 62,500 acres (253 km2) to Jose Antonio Yorba, which he named Rancho San Antonio. Yorba's great rancho included the lands where the cities of Olive, Orange, Villa Park, Santa Ana, Tustin, Costa Mesa and Newport Beach stand today., 234745=Costa Mesa has two high schools, Costa Mesa High School and Estancia High School. Costa Mesa has two public middle schools; Tewinkle Middle School, which was named after Costa Mesa's first mayor, and Costa Mesa Middle School which shares the same campus as Costa Mesa High School. Costa Mesa also has two alternative high schools that share the same campus, Back Bay High School and Monte Vista High School. Costa Mesa High School's sports programs have been very successful, and Costa Mesa graduates include 2008 Olympic high jumper Sharon Day., 209617=To the south, meanwhile, the community of Harper had arisen on a siding of the Santa Ana and Newport Railroad, named after a local rancher. This town prospered on its agricultural goods. On May 11, 1920, Harper changed its name to Costa Mesa, which literally means \"coastal table\" in Spanish. This is a reference to the city's geography as being a plateau by the coast., 279232=Seal Beach is currently under the Los Alamitos School District. Younger students (K-5) go to McGaugh Elementary School or Hopkinson Elementary School. Students in grades 6-8 attend either Oak Middle School or McAuliffe Middle School. High school students go to Los Alamitos High School. Until 2000, the Orange County High School of the Arts was part of Los Alamitos High School. In 2000, the school district suffered a major blow when the community lost the Orange County High School of the Arts to Santa Ana, where it is now located., 212620=Costa Mesa offers 26 parks, a municipal golf course, 26 public schools and 2 libraries. It is also home to the Orange County Fairgrounds, which hosts one of the largest fairs in California, the Orange County Fair, each July. The Fair receives more than one million visitors each year. Adjacent to the Fairgrounds is the Pacific Amphitheater, which has hosted acts such as Madonna, Bill Cosby, Jessica Simpson, Steppenwolf, Kelly Clarkson and many more., 51253=While Huntington Beach retains its 15-year trademark of Surf City Huntington Beach, the Huntington Beach Conference and Visitors Bureau filed four applications to register the Surf City USA trademark in November 2004. The idea was to market the city by creating an authentic brand based on Southern California's beach culture and active outdoor lifestyle while at the same time creating a family of product licensees who operate like a franchise family producing a revenue stream that could also be dedicated to promoting the brand and city. A ruling by the U.S. Patent and Trademark Office released on May 12, 2006 awarded three trademark registrations to the Bureau; nine additional trademark registrations have been granted since this time and ten other Surf City USA trademarks are now under consideration. One of the first products the Bureau developed to promote its brand was the Surf City USA Beach Cruiser by Felt Bicycles in 2006. The product has sold out every year in markets worldwide and created demand for a second rental bicycle model that will be marketed to resort locations across the globe starting in 2009. The Bureau now has dozens of other licensed products on the market from Surf City USA soft drinks to clothing to glassware. As of April 2008, the Bureau had more than 20 licensing partners with over 50 different products being prepared to enter the market over the next 18 months. Four of the Bureau's registrations of the trademark are now on the principal register and the remaining ten trademark applications are expected to follow. The Bureau is actively considering registration of the Surf City USA trademark in several different countries and anticipates a growing market for its branded products overseas in coming years., 15519=The city's first high school, Huntington Beach High School was built in 1906. The school's team, the Oilers, is named after the city's original natural resource., 248765=By the 20th century, it was known as Bay City, but there was already a Bay City located in Northern California. When the time came to incorporate on 25 October 1915, the town was named Seal Beach. The town became a popular recreation destination in the area, and featured a beach-side amusement park long before Disneyland was founded inland., 155459=Settlements filled in on the Peninsula, West Newport, Balboa Island and Lido Isle. In 1923 Corona del Mar was annexed and in 2002 Newport Coast was annexed., 65706=Huntington Beach also hosts the annual Surf City USA Marathon and Half-Marathon, which is usually held on the first Sunday of February., 12061=The area was originally occupied by the Tongva people. European settlement can be traced to a Spanish soldier, Manuel Nieto, who in 1784 received a Spanish land grant of 300,000 acres (1,200 km2), Rancho Los Nietos, as a reward for his military service and to encourage settlement in Alta California. Nieto's western area was reduced in 1790 because of a dispute with the Mission San Gabriel, but he retained thousands of acres stretching from the hills north of Whittier, Fullerton and Brea, south to the Pacific Ocean, and from today's Los Angeles River on the west, to the Santa Ana River on the east., 155000=In 1905 city development increased when Pacific Electric Railroad established a southern terminus in Newport connecting the beach with downtown Los Angeles. In 1906 with a population of 206 citizens, the scattered settlements were incorporated as the City of Newport Beach., 274588=The second longest wooden pier in California (the longest is in Oceanside) is located in Seal Beach and is used for fishing and sightseeing. There is also a restaurant (Ruby's) at the end of the pier. The pier has periodically suffered severe damage due to storms and other mishaps, requiring extensive reconstruction. A plaque at the pier's entrance memorializes Federal Emergency Administration of Public Works, 1938, Project No. Calif. 1723-F, a rebuilding necessitated by storms in 1935. Another plaque honors the individuals, businesses, and groups who helped rebuild the pier after a storm on March 2, 1983, tore away several sections. Most prominent was a \"Save the Pier\" group formed in response to an initial vote by the City Council not to repair the pier. The ensuing outcry of dismay among residents caused the City Council to reverse its stance while claiming the city lacked the necessary funds. Residents mobilized and eventually raised $2.3 million from private and public donors to rebuild the pier., 154732=In 1870 a steamer named \"The Vaquero\" made its first trip to a marshy lagoon for trading. Ranch owners in the Lower Bay decided from then on that the area should be called \"Newport.\", 41564=As of the census of 2000, there were 189,594 people, 73,657 households, and 47,729 families residing in the city. The population density was 2,773.9/km² (7,183.6/mi²). There were 75,662 housing units at an average density of 1,107.0/km² (2,866.8/mi²). The racial makeup of the city was 79.22% White, 0.81% Black or African American, 0.65% Native American, 9.34% Asian, 0.24% Pacific Islander, 5.81% from other races, and 3.94% from two or more races. 14.66% of the population were Hispanic or Latino of any race., 176854=As of the census of 2000, there were 70,032 people, 33,071 households, and 16,965 families residing in the city. The population density was 1,829.5/km² (4,738.8/mi²). There were 37,288 housing units at an average density of 974.1/km² (2,523.1/mi²). The racial makeup of the city was 92.22% White, 0.53% African American, 0.26% Native American, 4.00% Asian, 0.12% Pacific Islander, 1.13% from other races, and 1.74% from two or more races. Hispanic or Latino of any race were 4.71% of the population., 127714=Westminster is a city in Orange County, California, United States. It was founded in 1870 by Rev. Lemuel Webber as a Presbyterian temperance colony. Its name is taken from the Westminster Assembly of 1643, which laid out the basic tenets of the Presbyterian faith. For several years of its early history, its farmers refused to grow grapes because they associated grapes with alcohol., 246577=Seal Beach is a city in Orange County, California. As of 2000, its population was 24,157. The city was incorporated on October 25, 1915., 231412=As of the census of 2000, there were 108,724 people, 39,206 households, and 22,778 families residing in the city. The population density was 2,685.8/km² (6,956.3/mi²). There were 40,406 housing units at an average density of 998.1/km² (2,585.2/mi²). The racial makeup of the city was 69.48% White, 1.40% Black or African American, 0.78% Native American, 6.90% Asian, 0.60% Pacific Islander, 16.57% from other races, and 4.27% from two or more races. 31.75% of the population were Hispanic or Latino of any race., 57477=Huntington Beach hosts car shows such as the Beachcruiser Meet and a Concours d'Elegance. The Beachcruiser Meet is held in March, attracting over 250 classic cars displayed along Main Street and the Pier parking lot. A Concours d'Elegance is held at Central Park in June and benefits the public library., 270675=The Lions Club Pancake Breakfast in April, and their Fish Fry (started in 1943) in July are two of the biggest events in Seal Beach. There has been a Rough Water Swim the same weekend as the Fish Fry since the 1960s. The Seal Beach Chamber of Commerce sponsors many events, including: a Classic Car Show in April, a Summer Concert series in July & August, the Christmas Parade in December along with Santa & the Reindeer. Also in the fall is the Kite Festival in September., 133011=Westminster is located at (33.752418, -117.993938). According to the United States Census Bureau, the city has a total area of 26.2 km² (10.1 mi²), all land., 31859=Between Downtown Huntington Beach and Huntington Harbour lies a large marshy wetland, much of which is protected within the Bolsa Chica Ecological Reserve. A $110 million restoration of the wetlands was completed in 2006. The Reserve is popular with bird watchers and photographers., 67360=The Huntington Beach Public Library is located in Central Park in a notable building designed by Richard Neutra and Dion Neutra. It houses almost a half-million volumes, as well as a theater, gift shop and fountains. The library was founded as a Carnegie library in 1914, and has been continuously supported by the city and local activists, with new buildings and active branches at Banning, Oak View, Main Street, and Graham. The library has significant local historical materials and has a special genealogical reference collection. It is independent of the state and county library systems., 44240=The 2009 population estimated by the California Department of Finance was 202,480., 178872=According to a 2008 US Census estimate, the median income for a household in the city was $110,511, while the median family income was $162,976. Males had a median income of $73,425 versus $45,409 for females. The per capita income for the city was $63,015. About 2.1% of families and 4.4% of the population were below the poverty line, including 3.0% of those under age 18 and 3.5% of those age 65 or over., 56005=Many of the events at Huntington Beach are focused around the beach during the summer. The U.S. Open of Surfing and Beach Games are featured on the south side of the pier. Huntington Beach is a stop on the AVP beach volleyball tour. A biathlon (swim/run) hosted by the Bolsa Chica & Huntington State Beach Lifeguards takes place in July, early at dawn. The race begins at the Santa Ana River Jetties and ends at Warner Avenue, Bolsa Chica State Beach. Huntington Beach Junior Lifeguard day camps are held which teaches preadolescents and adolescents ocean swimming, running, and first-aid medical knowledge., 9671=Huntington Beach is a seaside city in Orange County in southern California, United States. According to the 2000 census, the city population was 189,594. It is bordered by the Pacific Ocean on the southwest, by Seal Beach on the northwest, by Costa Mesa on the east, by Newport Beach on the southeast, by Westminster on the north, and by Fountain Valley on the northeast., 105171=According to the census of 2009, there were 58,309 people, 18,162 households, and 14,220 families residing in the city. The population density was 2,382.4/km² (6,167.8/mi²). There were 18,473 housing units at an average density of 800.5/km² (2,072.4/mi²). The racial makeup of the city was 64.02% White, 1.11% Black or African American, 0.46% American Indian or Alaskan Native, 25.76% Asian, 0.40% Native Hawaiian or other Pacific Islander, 3.95% from other races, and 4.30% from two or more races. 10.68% of the population were Hispanic or Latino of any race., 17796=Huntington Beach has a Mediterranean climate (Köppen climate classification Csb). The climate is generally sunny, dry and cool, although evenings can be excessively damp. In the morning and evening, there are often strong breezes, 15 mph (24 km/h). Ocean water temperatures average 55 °F (13 °C) to 65 °F (18 °C). In the summer, temperatures rarely exceed 85 °F (29 °C). In the winter, temperatures rarely fall below 40 °F (4 °C), even on clear nights. There are about 14 inches (360 mm) of rain, almost all in mid-winter. Frost occurs only rarely on the coldest winter nights. The area is annually affected by a marine layer caused by the cool air of the Pacific Ocean meeting the warm air over the land. This results in overcast and foggy conditions in May and June., 43681=According to a 2007 estimate, the median income for a household in the city was $81,112, and the median income for a family was $101,023. Adult males had a median income of $52,018 versus $38,046 for adult females. The per capita income for the city was $36,964. About 4.3% of families and 6.6% of the population were below the poverty line, including 8.2% of those under age 18 and 4.4% of those age 65 or over., 101110=Fountain Valley is a city in Orange County, California, United States. The population was 58,309 according to the 2009 estimate by the California Department of Finance. A classic bedroom community, Fountain Valley is a middle-class residential area., 44783=According to Huntington Beach's 2008 Comprehensive Annual Financial Report, the top employers in the city are:, 14158=Huntington Beach incorporated on February 17, 1909 under its first mayor, Ed Manning. Its original developer was the Huntington Beach Company (formerly the West Coast Land and Water Company), a real-estate development firm owned by Henry Huntington. The Huntington Beach Company is still a major land-owner in the city, and still owns most of the local mineral rights., 88789=In 1926, the Santa Ana River dam failed, and flash-flooded its entire delta. The southern oceanic terminus of this delta is now a settled area of Huntington Beach. The distant dam is still functional, but silting up, which is expected to reduce its storage volume, and therefore its effectiveness at flood-prevention. The flood and dam-endangered areas are protected by a levee, but lenders require expensive flood insurance in the delta. There have been serious discussions to eliminate the need for flood insurance and this requirement has already been waived in some areas and may one day no longer be considered a credible threat., 207510=Members of the Gabrieleño/Tongva and Juaneño/Luiseño nations long inhabited the area. After the 1769 expedition of Gaspar de Portolà, a Spanish expedition led by Father Junípero Serra named the area Vallejo de Santa Ana (Valley of Saint Anne). On November 1, 1776, Mission San Juan Capistrano became the area's first permanent European settlement in Alta California, New Spain., 76045=Huntington Beach High School, which is the district's flagship school, celebrated its 100 year anniversary in 2006., 65369=Huntington Beach is the host city of the National Professional Paintball League Super 7 Paintball Championships. The NPPL holds its first event of the year traditionally between the dates of March 23 through March 26., 275883=Surfing locations in Seal Beach include the Seal Beach pier and \"Stingray Bay\" (or Ray Bay—the surfer's nickname for the mouth of the San Gabriel River—the stingrays are attracted by the heated water from several upstream powerplants). Classic longboard builders in the area include Harbour Surfboards established in 1959 in Seal Beach and Bruce Jones Surfboards in Sunset Beach. The classic surf trunks of Kanvas by Katin in nearby Sunset Beach are world famous., 188702=The Catalina Flyer, a giant 500 passenger catamaran, provides daily transportation from the Balboa Peninsula in Newport Beach to Avalon, California located on Santa Catalina Island. The historic Balboa Pavilion, established in 1906, is Newport Beach's most famous landmark., 108862=Fountain Valley is home to Mile Square Regional Park, a 640 acres (2.6 km2) park containing two lakes, three 18-hole golf courses, playing fields, picnic shelters, and a 20-acre (81,000 m2) urban nature area planted with California native plants, a 55-acre (220,000 m2) recreation center with tennis courts, basketball courts, racquetball courts, a gymnasium, and the Kingston Boys & Girls Club; also a community center and a new senior center that opened in June, 2005. A major redevelopment of the recreation center and city-administered sports fields was completed in early 2009., 102730=The city was incorporated in 1957, before which it was known as Talbert (also as Gospel Swamps by residents). The name of Fountain Valley refers to the very high water table in the area at the time the name was chosen, and the many corresponding artesian wells in the area. Early settlers constructed drainage canals to make the land usable for agriculture, which remained the dominant use of land until the 1960s, when construction of large housing tracts accelerated., 188301=Attractions include beaches on the Balboa Peninsula (featuring body-boarding hot-spot The Wedge), Corona del Mar State Beach and Crystal Cove State Park, to the south., 156737=Newport Beach extends in elevation from sea level to the 1161 ft (354 m.) summit of Signal Peak in the San Joaquin Hills, but the official elevation is 25 feet (8 m) above sea level at a location of (33.616671, -117.897604)., 129569=A large number of Vietnamese refugees came to the city in the 1970s, settling largely in an area now officially named Little Saigon. As of the 2000 census, the city had a total population of 88,207. Westminster won the All-America City Award in 1996., 209079=After the Mexican-American war, California became part of the United States and American settlers arrived in this area and formed the town of Fairview in the 1880s near the modern intersection of Harbor Boulevard and Adams Avenue. An 1889 flood wiped out the railroad serving the community, however, and it shriveled., 206588=Costa Mesa is a suburban city in Orange County, California, United States. The population was 116,479 as of January 1, 2009 . Since its incorporation in 1953, the city has grown from a semi-rural farming community of 16,840 to a suburban city with an economy based on retail, commerce and light manufacturing., 56867=In addition to the beach-focused events, the Fourth of July parade has been held since 1904. The SoCal Independent Film Festival takes place every September., 179708=As of October 2008, there were 35,870 registered Republicans and 13,850 registered Democrats., 152525=Newport Beach, incorporated in 1906, is a city in Orange County, California, United States 10 miles (16 km) south of downtown Santa Ana. As of January 1, 2009, the population was 86,252. The current OMB metropolitan designation for Newport Beach lies within the Santa Ana-Anaheim-Irvine area. The city is currently one of the wealthiest communities in California and consistently places high in United States rankings., 57140=During the winter the annual Cruise of Lights Boat Tour is held in the Huntington Harbour neighborhood. This is a parade of colorful lighted boats as well as boat tours to view the decorated homes. The annual Kite Festival is held just north of the pier in late February., 179426=Housing prices in Newport Beach ranked eighth highest in the United States in a 2009 survey., 32488=The northern and southern beaches (Bolsa Chica State Beach and Huntington State Beach, respectively) are state parks. Only the central beach (Huntington City Beach) is maintained by the city. Camping and RVs are permitted here, and popular campsites for the Fourth of July and the Surfing Championships must be reserved many months in advance. Bolsa Chica State Beach is actually a sand bar fronting the Bolsa Bay and Bolsa Chica State Ecological Reserve., 280043=In the 2001 film American Pie 2, the beach town the gang drives through is Main Street in Seal Beach. The same street was used for the 1967 motorcycle-gang film The Born Losers which introduced the Billy Jack character.}",
    "textBeforeTable": "As of the census of 2000, there were 189,594 people, 73,657 households, and 47,729 families residing in the city. The population density was 2,773.9/km² (7,183.6/mi²). There were 75,662 housing units at an average density of 1,107.0/km² (2,866.8/mi²). The racial makeup of the city was 79.22% White, 0.81% Black or African American, 0.65% Native American, 9.34% Asian, 0.24% Pacific Islander, 5.81% from other races, and 3.94% from two or more races. 14.66% of the population were Hispanic or Latino of any race. There were 73,657 households out of which 29.0% had children under the age of 18 living with them, 50.7% were married couples living together, 9.6% had a female householder with no husband present, and 35.2% were non-families. 24.3% of all households were made up of individuals and 6.7% had someone living alone who was 65 years of age or older. The average household size was 2.56 and the average family size was 3.08. In the city the population was spread out with 22.2% under the age of 18, 8.4% from 18 to 24, 34.9% from 25 to 44, 24.0% from 45 to 64, and 10.4% who",
    "textAfterTable": "Huntington Beach sits above a large natural fault structure containing oil. Although the oil is mostly depleted, extraction continues at a slow rate, and still provides significant local income. There are only two off-shore extraction facilities left, however, and the day is not far off when oil production in the city will cease and tourism will replace it as the primary revenue source for resident industry. The city is discussing closing off Main Street to cars from PCH through the retail shopping and restaurant areas, making it a pedestrian zone only. Other shopping centers include Bella Terra, built on the former Huntington Center site, and Old World Village, a German-themed center. Huntington Beach has an off-shore oil terminus for the tankers that support the Alaska Pipeline. The terminus pipes run inland to a refinery in Santa Fe Springs. Huntington Beach also has the Gothard-Talbert terminus for the Orange County portion of the pipeline running from the Chevron El Segundo refinery. Several hotels have been constructed on the inland side of Pacific Coast Highway (State Route 1) within view of the beach, just southeast of the pier. Huntington Beach contains a major installation of Boeing, formerly McDonnell-Douglas. A number of installations on the Boeing campus were originally constructed to service the",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}