{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Other",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Orthodox",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "677,149",
            "102,012",
            "50,181",
            "39,923",
            "16,758",
            "13,189",
            "440,320"
        ],
        [
            "Congregations",
            "73",
            "168",
            "184",
            "251",
            "22",
            "45",
            "-"
        ]
    ],
    "pageTitle": "Farmingdale, New York (NY 11735) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Farmingdale-New-York.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 364479087,
    "recordOffset": 364340110,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{174344=Zip codes: 11735., 183649=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 21466=Carbon Monoxide (CO) [ppm] level in 2012 was 0.241. This is better than average. Closest monitor was 1.6 miles away from the city center., 613=Graphs represent county-level data. Detailed 2008 Election Results, 19998=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.03. This is significantly better than average. Closest monitor was 1.6 miles away from the city center., 61192=According to our research of New York and other state lists there were 5 registered sex offenders living in Farmingdale, New York as of July 30, 2015. The ratio of number of residents in Farmingdale to the number of sex offenders is 1,646 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average., 18555=Particulate Matter (PM10) [µg/m3] level in 2004 was 17.5. This is about average. Closest monitor was 1.6 miles away from the city center., 22118=Air Quality Index (AQI) level in 2012 was 98.2. This is worse than average., 2041=1996 Presidential Elections Results, 79976=Incorporated in 1904, 1469=2004 Presidential Elections Results, 20743=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 17.6. This is significantly worse than average. Closest monitor was 16.5 miles away from the city center., 4962=School Enrollment by Level of School (%) in 2013, 45118=On 7/10/1989, a category F4 (max. wind speeds 207-260 mph) tornado 49.0 miles away from the Farmingdale village center injured 40 people and caused between $50,000,000 and $500,000,000 in damages., 5360=Educational Attainment (%) in 2013, 19254=Ozone [ppb] level in 2012 was 27.1. This is about average. Closest monitor was 1.6 miles away from the city center., 17806=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.08. This is about average. Closest monitor was 1.6 miles away from the city center., 1755=2000 Presidential Elections Results, 44824=On 9/27/1970, a category F2 (max. wind speeds 113-157 mph) tornado 3.7 miles away from the village center caused between $50,000 and $500,000 in damages., 25785=Tourist attractions: Fun Zone Amusements (Amusement & Theme Parks; 229 Broadhollow Road), Adventureland Restrnt (Arcades & Amusements; 2245 Route 110)., 897=2012 Presidential Elections Results, 1183=2008 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{105760=Total of 207 patent applications in 2008-2015., 17588=4.09% of this county's 2010 resident taxpayers moved to other counties in 2011 ($63,559 average adjusted gross income), 107097=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 26136=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population), 15382=3.66% of this county's 2011 resident taxpayers lived in other counties in 2010 ($68,565 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Farmingdale village (based on Nassau County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Other fuel (1%) Bottled, tank, or LP gas (1%) Electricity (15%) Fuel oil, kerosene, etc. (38%) Utility gas (45%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 556 Nassau County: 4.11 / 10,000 pop. New York: 4.13 / 10,000 pop. Number of supercenters and club stores: 7 This county: 0.05 / 10,000 pop. State: 0.06 / 10,000 pop. Number of convenience stores (no gas): 201 Nassau County: 1.49 / 10,000 pop. New York: 0.92 / 10,000 pop. Number of convenience stores (with gas): 174 Nassau County: 1.29 / 10,000 pop. State: 1.68 / 10,000 pop. Number of full-service restaurants: 1,219 Here: 9.01 / 10,000 pop. State: 8.82 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}