{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "Orthodox",
            "Black Protestant",
            "None"
        ],
        [
            "Adherents",
            "50,354",
            "20,681",
            "4,483",
            "4,420",
            "175",
            "160",
            "109,654"
        ],
        [
            "Congregations",
            "30",
            "87",
            "39",
            "16",
            "2",
            "2",
            "-"
        ]
    ],
    "pageTitle": "North Canaan, Connecticut (CT 06018) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/North-Canaan-Connecticut.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365349127,
    "recordOffset": 365247732,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13111=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.394. This is significantly better than average. Closest monitor was 12.8 miles away from the city center., 63759=Incorporated on 05/1858, 14595=Carbon Monoxide (CO) [ppm] level in 2012 was 0.161. This is significantly better than average. Closest monitor was 12.8 miles away from the city center., 15242=Air Quality Index (AQI) level in 2012 was 74.3. This is about average., 1764=2000 Presidential Elections Results, 77784=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 1192=2008 Presidential Elections Results, 31443=On 5/29/1995, a category F4 (max. wind speeds 207-260 mph) tornado 12.5 miles away from the North Canaan town center killed 3 people and injured 24 people and caused between $5,000,000 and $50,000,000 in damages., 4593=School Enrollment by Level of School (%) in 2000, 622=Graphs represent county-level data. Detailed 2008 Election Results, 12363=Ozone [ppb] level in 2012 was 35.7. This is about average. Closest monitor was 14.0 miles away from the city center., 11663=Particulate Matter (PM10) [µg/m3] level in 2012 was 8.24. This is significantly better than average. Closest monitor was 14.0 miles away from the city center., 13858=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 1.66. This is significantly better than average. Closest monitor was 12.8 miles away from the city center., 4991=Educational Attainment (%) in 2000, 1478=2004 Presidential Elections Results, 10893=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 5.51. This is significantly better than average. Closest monitor was 14.0 miles away from the city center., 2050=1996 Presidential Elections Results, 906=2012 Presidential Elections Results, 31120=On 8/28/1973, a category F4 tornado 17.4 miles away from the town center killed 4 people and injured 36 people and caused between $5,000,000 and $50,000,000 in damages.}",
    "TableContextTimeStampAfterTable": "{7517=4.87% of this county's 2010 resident taxpayers moved to other counties in 2011 ($50,634 average adjusted gross income), 5285=4.29% of this county's 2011 resident taxpayers lived in other counties in 2010 ($55,683 average adjusted gross income), 34376=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 14329=Fatal road traffic accident statistics for 1975 - 2013 (per 100,000 population)}",
    "textBeforeTable": "Religion statistics for North Canaan town (based on Litchfield County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results No fuel used (1%) Utility gas (1%) Other fuel (1%) Wood (1%) Bottled, tank, or LP gas (4%) Electricity (23%) Fuel oil, kerosene, etc. (70%)",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 43 Litchfield County: 2.29 / 10,000 pop. Connecticut: 2.21 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.05 / 10,000 pop. State: 0.07 / 10,000 pop. Number of convenience stores (no gas): 12 Litchfield County: 0.64 / 10,000 pop. Connecticut: 1.02 / 10,000 pop. Number of convenience stores (with gas): 56 Litchfield County: 2.98 / 10,000 pop. State: 2.27 / 10,000 pop. Number of full-service restaurants: 208 Here: 11.07 / 10,000 pop. State: 9.19 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}