{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "22,112",
            "5,299",
            "4,143",
            "1,504",
            "575",
            "89,510"
        ],
        [
            "Congregations",
            "11",
            "21",
            "37",
            "13",
            "2",
            "-"
        ]
    ],
    "pageTitle": "Somersworth, New Hampshire (NH 03878) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Somersworth-New-Hampshire.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367819203,
    "recordOffset": 367679976,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7361=According to our research of New Hampshire and other state lists there were 30 registered sex offenders living in Somersworth, New Hampshire as of August 02, 2015. The ratio of number of residents in Somersworth to the number of sex offenders is 392 to 1., 26176=Incorporated in 1754, 127722=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{49589=Educational Attainment (%) in 2013, 53026=1996 Presidential Elections Results, 53598=2004 Presidential Elections Results, 41032=Particulate Matter (PM10) [µg/m3] level in 2012 was 13.9. This is significantly better than average. Closest monitor was 4.2 miles away from the city center., 40333=Ozone [ppb] level in 2012 was 28.3. This is about average. Closest monitor was 3.4 miles away from the city center., 53312=2000 Presidential Elections Results, 163108=Total of 39 patent applications in 2008-2015., 54170=2012 Presidential Elections Results, 75663=6.95% of this county's 2010 resident taxpayers moved to other counties in 2011 ($38,729 average adjusted gross income), 164490=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 16006=On 6/9/1953, a category F3 (max. wind speeds 158-206 mph) tornado 20.2 miles away from the Somersworth city center injured 5 people and caused between $5000 and $50,000 in damages., 41801=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.63. This is about average. Closest monitor was 13.4 miles away from the city center., 38859=Nitrogen Dioxide (NO2) [ppb] level in 2008 was 7.39. This is about average. Closest monitor was 4.2 miles away from the city center., 53884=2008 Presidential Elections Results, 38212=Air Quality Index (AQI) level in 2012 was 86.5. This is about average., 39586=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.691. This is significantly better than average. Closest monitor was 4.2 miles away from the city center., 73428=6.89% of this county's 2011 resident taxpayers lived in other counties in 2010 ($39,594 average adjusted gross income), 16284=On 5/14/1963, a category F2 (max. wind speeds 113-157 mph) tornado 2.6 miles away from the city center caused between $5000 and $50,000 in damages., 54454=Graphs represent county-level data. Detailed 2008 Election Results, 49987=School Enrollment by Level of School (%) in 2013}",
    "textBeforeTable": "Religion statistics for Somersworth city (based on Strafford County data) Sherwood Glen neighborhood Downtown neighborhood Crocketts Crossings (Crocketts Crossing) neighborhood Colonial Village neighborhood Central Park neighborhood Somersworth, New Hampshire Neighborhood Map) Neighborhoods in Somersworth:( Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 21 Strafford County: 1.73 / 10,000 pop. New Hampshire: 2.14 / 10,000 pop. Number of supercenters and club stores: 1 This county: 0.08 / 10,000 pop. State: 0.15 / 10,000 pop. Number of convenience stores (no gas): 30 Strafford County: 2.48 / 10,000 pop. New Hampshire: 1.78 / 10,000 pop. Number of convenience stores (with gas): 46 Strafford County: 3.80 / 10,000 pop. State: 4.02 / 10,000 pop. Number of full-service restaurants: 99 Here: 8.17 / 10,000 pop. State: 9.70 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}