{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very affordable! With my state financial aid, I only had to pay $52 for the first semester.",
            "They offer numerous clubs and activities for students.",
            "The food here comes at great taste and value.",
            "There is no dorm life because this is a community technical college.",
            "Academic rigor really depends on the professor. Some are very serious when it comes to their job while others take a more casual approach. The ones who take it seriously will make it hard on you while still being fair.",
            "Register for classes early! They always fill up fast!",
            "It has a small, friendly atmosphere. Class sizes are small. The campus is always clean."
        ]
    ],
    "pageTitle": "Tri-County Technical College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Tri-County-Technical-College/reviews?_escaped_fragment_=/show/67711",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911304899,
    "recordOffset": 911270576,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{118391=The academics here are very confusing and some times hard. I wouldnt even go to this school if your basing it off of the numbers on website. Its so much more than the academics, people that have went here and the to Clemson say that they teach the same thing, but it tech was 20 times as harder and have a 7:10 ratio of failing rate. Im just saying you should think about going here before you go., 121644=© 2015, Cappex.com, LLC, 102744=There is a cafeteria that is open from 7:30 am to 3:00 pm most days, The food is usually pretty good, and the menu is large enough. It would be nice if they were open a little later, since some of the classes go a little later. There are vending machines available.}",
    "textBeforeTable": "07/16/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 30 Katherine from Anderson, SC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Clubs and Activities Tri-County Technical College offers hundreds of clubs and organizations and is always open to add more to the list. Great for these types of students Tri-County Technical College is great for all types of students including students still in high school or adult students with families and jobs. Share any unusual traditions or locations on campus The campus is filled with many outdoor communing areas that make study groups and lunch time a quite enjoyable affair. Bang for the buck Tri-County Technical College is very affordable and offers many scholarships to eligible students. The school also offers several locations making it easy to pick a campus that best suits each student. What to do for fun Many students go into Anderson to see movies in several theaters or for shopping at the mall and surround shops. At night, downtown Clemson becomes a mecca for students with a multitude of bars to experience. The local favorite, Tiger Town Tavern, is always a must stop during the night. Another personal favorite, for someone whose looking for dinner and a drink might try 365, a sushi and martini bar. The small college town is also filled with plenty of spaces for",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}