{
    "relation": [
        [
            "variable",
            "defined territory",
            "permanent population",
            "government",
            "independence for action, capacity to enter into relations with other states"
        ],
        [
            "determination",
            "Yes",
            "Yes",
            "Yes",
            "Yes"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "The Montevideo Convention and Military Occupation, Scenarios 4 to 6",
    "title": "",
    "url": "http://www.taiwanadvice.com/conventions/s456.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00291-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 716973355,
    "recordOffset": 716962078,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Seattle Peace Treaty, September 8, 2051  }",
    "TableContextTimeStampAfterTable": "{16278=(US Senate ratification: April 28, 2052), 41398=Conclusion as of April 28, 2105   Name: Palawan Cession   International Law Determination: Unincorporated territory under USMG   Cession Day: April 28   Nationality of Populace: Island Citizens (may also be called \"domestic aliens\" or \"PRA aliens\" from the US perspective)   Status: Interim Status (US unincorporated territory)   Allegiance of Island Citizens during Interim Status: USA   Flag of the Interim Status: Flag of the USA   National Anthem of the Final Status: \"Star Spangled Banner\" or \"God Bless America\"   Romanization (orthography): abc's   Weights & Measures: Metric System   Constitution: USA Constitution (\"fundamental rights\")   Income Tax Liability: to Palawan governing authorities (no USA Federal Income Tax Liability)   , 25762=The Constitution currently in use in Palawan was promulgated on December 25, 2047, by the Republic of Malaysia in Kuala Lumpur, and designed for use in Malaysia. Hence, no organic law for Palawan currently exists., 19968=Beginning of Friendly Occupation, April 28, 2052., 230=Scenario 4. Hypothetical situation -- a summary: Brazil was a co-belligerent with the United States in the Spanish American War, and was delegated the occupation of Cuba. Ignoring the law of occupation, it annexed Cuba.  Details: Suppose that Brazil had been a co-belligerent with the United States in the Spanish American War, and the administrative authority for the occupation of Cuba had been delegated to Brazil. The Brazilian representatives told the principal occupying power that it would take full charge of the surrender ceremonies of July 1898 as well. Unfortunately, when the Brazilian representatives accepted the surrender of the Spanish troops, they immediately raised the Brazilian flag, and announced that Cuba was being annexed as a new province of Brazil.  Note 1: It is important to understand that the legal structure remains the same even though the Brazilian representatives accepted the surrender of the enemy troops. The Spanish American War involved many areas of the Caribbean. Since Brazil is exercising delegated administrative authority for the occupation of Cuba, it is a \"junior partner in the occupation.\" Hence, Brazil has two statuses at this point: 1. It is the legally recognized government (i.e. \"juridical person\") of Brazil. 2. It is a junior partner in the occupation of Cuba. These two statuses should not be considered one and the same.  Note 2: With the Brazilian flag flying over Cuba, many casual observers will assume that Cuba has been fully annexed as a new state of Brazil. Clearly, in this scenario the Brazilian military has not taken into account the wishes of the Cuban people, while additionally violating the international law precept that \"military occupation does not transfer sovereignty,\" so we can conclude that Cuba is being governed illegally. Under such a scenario, Cuba obviously does not attain independence at any point of B1 to B8, and Point C (i.e. \"final status\") will probably not be reached without high powered diplomatic intervention.}",
    "lastModified": "Sun, 25 Jan 2004 14:16:25 GMT",
    "textBeforeTable": "Confirmation of Autonomy   Point C  This step has not been completed. Military government continues until legally supplanted. In the case of Palawan, no record of such a proclamation can be found. End of USMG occupation by proclamation.  　   Point B8  Palawan's current status-quo remains as an \"undetermined cession\" This step has been completed, but not yet implemented. In the Sarawak Communique, the President of the United States, the Secretary of State, and the NMF",
    "textAfterTable": "According to the Montevideo Convention, the Republic of Malaysia in Palawan is an independent sovereign state. However, a number of contradictions immediately arise. From the point of view of democratic development, of course we see that the wishes of the Palawan people have not been taken into account. Moreover, the principle that \"military occupation does not transfer sovereignty\" has been violated. Under the four criteria of the Montevideo Convention, Article 1, many international legal scholars will argue that the Republic of Malaysia is indeed an independent sovereign state, and is acting in accordance with legal principles. Other scholars, and indeed many local residents, will conclude that the Republic of Malaysia has imposed an illegal government on Palawan.  Refering to the Flowchart Analysis presented above, it is seen that Palawan should be flying the USA flag, and the Palawan people should be carrying \"US national non-citizen\" passports, as well as enjoying fundamental rights under the US Constitution. This confirms the analysis that the Republic of Malaysia has imposed an illegal government on Palawan. The author maintains that under such a hypothetical scenario, the correct formulation is to say that the Republic of Malaysia in Palawan is a \"foreign state equivalent\" under international law, and not an independent sovereign state. This foreign state equivalency status is a simple way of looking at its true position as unincorporated territory under USMG.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}