{
    "relation": [
        [
            "compartment",
            "Ban Siang Cai (Wat Luang)",
            "Ban Siang In",
            "Ban Siang Yün",
            "Ban Siang Lae",
            "total"
        ],
        [
            "number of families",
            "107",
            "31",
            "32",
            "39",
            "209"
        ],
        [
            "number of inhabitants",
            "546",
            "156",
            "303",
            "220",
            "1.225"
        ],
        [
            "inhabitants in %",
            "44.6",
            "12.7",
            "24.7",
            "18.0",
            "100.0"
        ],
        [
            "number of women",
            "293",
            "87",
            "140",
            "109",
            "620"
        ]
    ],
    "pageTitle": "Laos: Müang Sing (3rd ed.NOV2000), English main page",
    "title": "",
    "url": "http://www.mp.haw-hamburg.de/pers/Kaspar-Sickermann/mgsing/emgs.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00225-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 583493159,
    "recordOffset": 583471233,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2517=This is an essay about the development of the town from ca. 1870 AD until today and its history with an outlook into the future. The essay is based on documents, town plans, inscriptions, information supplied by the local administration and on a visit in Müang Sing in November 1996 and a second one in February 1998 by Grabowsky und Kaspar-Sickermann.}",
    "textBeforeTable": "According to latest official statistics (from 1992) the area inside the old town wall comprised slightly more than 200 households. This indicates a rather slow increase of only 50% within one century. There was probably more than one cause for Müang Sing's demographic stagnation. One cause could have been the declining economic importance of Müang Sing due to the closing of borders with Burma and China (until very recently). The figures in detail: Lao Thoeng (Khmu) Lao Soung (Hmong) Thai Yao Thai Nüa Lü Akha In the polyethnic society of Laos the province of Luang Nam Tha has the greatest diversity of ethnic groups. In the district of Müang Sing live Population back to the contents Not only the quadratic layout of Müang Sing deserves our attention. The high number of gates, that rendered an effective defence of the town even more difficult, seems not to be accidental, too. It is interesting to note that several other walled towns in the region had exactly twelve gates as well. One example is Siang Hung whose earthen wall was of oval shape and surrounded by a palisade of 6 sok (3 m) depth. Another one is Siang Tung from where the ruling family of",
    "textAfterTable": "back to the contents The future Town Plan On the drawing board the future of Müang Sing has already started. The development plan of 1991 (JPG: 35K) is closely orientated at the original quadratic layout and keeps the delineation of the street system intact. The plan envisages a much higher population density than is the case at present. It depends obviously on the hope that the urban population will encrease steadily, at least by 2.6% per annum which was the average for the province of Luang Nam Tha in the late 1980s. The statistics for Müang Sing are different. During the 1988 - 1992 period the average increase of population was less than 1.5% per annum. It seems that both town and district of Müang Sing were net emigration areas during the last two or three decades. One has to wait and see whether the assumption of the district administration that this trend could be reverted in the future is realistic. The only remarkable difference to the town map of 1890 is that the centre of the town, i.e. the palace area, would move exactly one square closer to the main commercial road to China. The total urban area of 83.3 ha, which includes roughly 20 ha outside the old town wall, would be",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}