{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Switch Solenoid FOR Dalco PG260D PG260F1 PG260F2 PG260G PG260 Starter Motors | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Dalco-starter-motor-Switch-Solenoid-/280629857286",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00293-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 419299479,
    "recordOffset": 419250643,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at Returns policy All returns must be in 30 days of purchase and item NOT installed. Receipt must be sent with all returned items. Failure to do so will delay refunds and charged. All returned items must be in original(all accessory with item) & resalable condition to receive refund. Refund will be given within 14 business days of receiving item. Item purchased exceed 30 days, exchange warranty applied ONLY, no refund. An incorrect item has been purchased and it’s deemed Trump Auto’s error , Trump Auto will pay return postage. If incorrectly or a deemed buyers error, postage costs buyer. Buyer MUST use the parts OEM number for matching, or check with Trump Auto for confirm. Fail to do so, 20% handling&restocking+Ebay Fee+ Postage charged fee will be deducted from the refund. (Eg:Refund Amount = Item Cost- 20% handling&restocking -Ebay Charge-Postage Cost) Warranty claims policy The person fitting the parts needs to be",
    "textAfterTable": "Seller's payment instructions Please deposit to: National Australia Bank. Name: Trump Auto Electrical Parts. Account: 083324-825018133. Please mark your payment. Thanks! Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}