{
    "relation": [
        [
            "Patent application number",
            "20090298125",
            "20100028972",
            "20100167345",
            "20100304459",
            "20110161265",
            "20110257023",
            "20120208259"
        ],
        [
            "Description",
            "HALOHYDRIN DEHALOGENASES AND RELATED POLYNUCLEOTIDES - The present invention relates to novel halohydrin dehalogenase polypeptides and the polynucleotides that encode them. These polypeptides are useful in the production of 4-substituted-3-butyric acid derivatives and vicinal cyano, hydroxyl substituted carboxylic acid esters. The invention also provides related vectors, host cells and methods.",
            "KETOREDUCTASE POLYPEPTIDES AND RELATED POLYNUCLEOTIDES - The present invention is directed to variant polypeptides having enhanced ketoreductase activity and/or thermostability for use in the stereospecific reduction of ketones. In addition, the present invention is directed to polynucleotides that encode the ketoreductase polypeptides, including codon optimized versions of the polynucleotides which provide for enhanced expression in host cells. In another aspect, the present invention is directed to nucleotide constructs, vectors and host cells that are transformed with polynucleotides of the present invention.",
            "HALOHYDRIN DEHALOGENASES AND RELATED POLYNUCLEOTIDES - The present invention relates to novel halohydrin dehalogenase polypeptides and the polynucleotides that encode them. These polypeptides are useful in the production of 4-substituted-3-butyric acid derivatives and vicinal cyano, hydroxyl substituted carboxylic acid esters. The invention also provides related vectors, host cells and methods.",
            "GLUCOSE DEHYDROGENASE POLYPEPTIDES AND RELATED POLYNUCLEOTIDES - The present invention is directed to glucose dehydrogenase (GDH) polypeptides that have enhanced GDH activity and/or thermostability relative to the backbone wild-type glucose dehydrogenase polypeptide. In addition, the present invention is directed to a polynucleotide that encodes for the GDH polypeptides of the present invention, to nucleic acid sequences comprising the polynucleotides, to expression vectors comprising the polynucleotides operatively linked to a promoter, to host cells transformed to express the GDH polypeptides, and to a method for producing the GDH polypeptides of the present invention.",
            "METHODS, SYSTEMS, AND SOFTWARE FOR IDENTIFYING FUNCTIONAL BIO-MOLECULES - The present invention generally relates to methods of rapidly and efficiently searching biologically-related data space. More specifically, the invention includes methods of identifying bio-molecules with desired properties, or which are most suitable for acquiring such properties, from complex bio-molecule libraries or sets of such libraries. The invention also provides methods of modeling sequence-activity relationships. As many of the methods are computer-implemented, the invention additionally provides digital systems and software for performing these methods.",
            "METHODS, SYSTEMS, AND SOFTWARE FOR IDENTIFYING FUNCTIONAL BIOMOLECULES - The present invention generally relates to methods of rapidly and efficiently searching biologically-related data space. More specifically, the invention includes methods of identifying bio-molecules with desired properties, or which are most suitable for acquiring such properties, from complex bio-molecule libraries or sets of such libraries. The invention also provides methods of modeling sequence-activity relationships. As many of the methods are computer-implemented, the invention additionally provides digital systems and software for performing these methods.",
            "Halohydrin Dehalogenases and Related Polynucleotides - The present invention relates to novel halohydrin dehalogenase polypeptides and the polynucleotides that encode them. These polypeptides are useful in the production of 4-substituted-3-butyric acid derivatives and vicinal cyano, hydroxyl substituted carboxylic acid esters. The invention also provides related vectors, host cells and methods."
        ],
        [
            "Published",
            "12-03-2009",
            "02-04-2010",
            "07-01-2010",
            "12-02-2010",
            "06-30-2011",
            "10-20-2011",
            "08-16-2012"
        ]
    ],
    "pageTitle": "Davis, San Francisco - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/davis-san-francisco-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00170-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428507043,
    "recordOffset": 428480756,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "S. Christopher Davis, San Francisco, CA US 12-06-2012 READER WITH ENHANCED USER FUNCTIONALITY - A bookmarking system including a reader interface configured to cause content to be displayed on an electronic device having a touch-sensitive screen. The system includes a bookmark module configured to add a bookmark when a user swipes downwardly on the screen, wherein the bookmark is a record relating to the content displayed on the screen during the downward swipe. 20120311509 Published Description Patent application number Matthew G. Davis, San Francisco, CA US 06-28-2012 BYPASSING BLUETOOTH DISCOVERY FOR DEVICES IN A SPECIAL LIST - A method of rejecting a Bluetooth communications request is disclosed. A portable device receives a Bluetooth communications request from a computing device. The communications request includes a device identification of the computing device. A list of trusted device identifications stored in a memory resource of the portable device is automatically accessed. The Bluetooth communications request is rejected in response to determining that the device identification is not in the list of trusted device identifications. 20120164947 Published Description Patent application number Mart T. Davis, San Francisco, CA US 04-09-2009 METHOD FOR BYPASSING PASSKEY EXCHANGE AND AUTHENTICATION PROCEDURES - A method and system thereof for establishing a wireless connection to a device while bypassing passkey exchange and authentication procedures. Passkeys are authenticated and exchanged with another device. At the",
    "textAfterTable": "Patent applications by S. Christopher Davis, San Francisco, CA US Simon Christopher Davis, San Francisco, CA US Patent application number Description Published 20090118130 Structure-activity relationships - The present disclosure relates to compositions and methods for screening a plurality of polypeptide variants. 05-07-2009 20130157900 STRUCTURE-ACTIVITY RELATIONSHIPS - The present disclosure relates to compositions and methods for screening a plurality of polypeptide variants. 06-20-2013 20130165341 STRUCTURE-ACTIVITY RELATIONSHIPS - The present disclosure relates to compositions and methods for screening a plurality of polypeptide variants. 06-27-2013 20150017696 RECOMBINANT HOST CELLS AND PROCESSES FOR PRODUCING 1,3-BUTADIENE THROUGH A CROTONOL INTERMEDIATE - The present disclosure relates to recombinant host cells comprising one or more recombinant polynucleotides encoding enzymes in select pathways that provide the ability to use the cells to produce 1,3-butadiene. The present disclosure also provides methods of manufacturing the recombinant host cells, and methods for the use of the cells to produce 1,3-butadiene, either through formation of the intermediate compound crotonol followed by chemo-catalytic dehydration to 1,3-butadiene, or through the use of a recombinant cell comprising a fully enzymatic pathway capable of converting crotonyl-CoA or crotonyl-ACP to crotonol and then crotonol to 1,3-butadiene.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}