{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "we have our own police department that is always on duty. we also have a service provided by students that ensures you don't walk home alone at night.",
            "hall council is a great way to get involved in your residence hall community.",
            "i go to all of the sporting events and i hang out with my friends.",
            "shively is by far the best dining hall on campus. the others aren't terrible but shively ranks way higher than the rest.",
            "dorm life is my favorite part of college. i love the relationships i've made with everyone here.",
            "classes are definitely challenging but they prepare you for the best.",
            "i recommend living on the green closest to your class locations.",
            "ohio university deserves a 10 out of 10! the campus and atmosphere here is remarkable. the teachers really want you to succeed and so do your peers."
        ]
    ],
    "pageTitle": "Ohio University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ohio-University-Main-Campus/reviews?_escaped_fragment_=/show/40961",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00260-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897246459,
    "recordOffset": 897085437,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{883699=© 2015, Cappex.com, LLC, 816021=Every college has sporting events, but one thing Ohio has that those others do not would have to be the Ohio University Marching 110. The 110 performs at all football and basketball games (men and women). They have performed around the world; from Rome and Ireland in 2013 to being invited to perform in China during the 60's. Along with the band though, the university's sports have been performing extremely well over the past few years, including 5 straight bowls for the football team, and a recent Sweet 16 run for the men's basketball team. There are other events that happen on Court Street in Athens, the craziest 1/2 mile in all of Ohio. Home to over 20 bars and a ton of restaurants, there is always something to do in Athens, Ohio!, 339987=I am not familiar with a lot at this time since school just started this week but there is a March 110 that takes all the incoming freshman. The band plays and marches across the main campus bridge with freshman class following them. It is really cool!, 645160=Halloween is HUGE at Ohio University. Rated the best campus to be on in the United States on Oct. 31st.}",
    "textBeforeTable": "07/07/2009 Reviewer is A current student here. 48 out of 49 people found this review useful. 1 person found this inaccurate. 1 of 197 Caitlin from Kings Mills, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. Ohio University-Main Campus Reviews Ohio University-Main Campus › Ohio › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students Ohio University is great for any type of student. There are so many groups, clubs, and other students here, that anyone can find what they are looking for. Tips for prospective students For those of you thinking of coming here to OU here are a few tips: 1. GO TO CLASS. This is probably the most important thing to do because, now that we are on our own, we have many distractions and fun things to do. However, you are here to get an education and the best way to do that is going to class. 2. Study: To do well on test and exams, do your work and study so that you will be prepared. Also by study you will most likely get better grades, making your parents happy and keeping you off academic probation. Bang for the buck Personally I believe Ohio University is expensive, especially for out of state students. From what me and my friends have learned from this past year, OU will try and take as much of your money as possible whenever they have the chance. With this said, OU will give you many opportunities and connections to help further your career. Also you will have a great quality education. Am enjoying being here",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}