{
    "relation": [
        [
            "Command",
            "debug channel ilan",
            "debug channel packets"
        ],
        [
            "Description",
            "Displays CIP love letter events.",
            "Displays per-packet debugging output."
        ]
    ],
    "pageTitle": "Cisco IOS Debug Command Reference - Commands A through D - debug backhaul-session-manager session through debug channel packets [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/debug/command/a1/db-a1-cr-book/db-b1.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 357759831,
    "recordOffset": 357625252,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5332=This command was implemented on Cisco IAD2420 series integrated access devices (IADs). This command is not supported on the access servers in this release., 6285=This command was implemented on the Cisco 2600 series, Cisco 3600 series, and Cisco MC3810.}",
    "TableContextTimeStampAfterTable": "{206607=Dec 26 13:58:25.682: Call mgmt per minute statistics:, 208032=Dec 26 13:58:26.538: Mdm-Slot#1, Mdm-Port#3, TTY#219, 206305=Indicates that the call is connected via the B channel on Serial7/17:1 to the asynchronous modem resource 1/03 (interface async1/03, also known as line tty219)., 221958=The following example depicts a call coming in to 10.1.1.4 and codec type g729r8. Because there is no cache entry for this IP address, a g729r8 probe is initiated. The probe consists of 20 packet returns with an average delay of 43 milliseconds. The \"jitter out\" is jitter from source to destination router and \"jitter in\" is jitter from destination to source router. The delay, loss, and Calculated Planning Impairment Factor (ICPIF) values following g113_calc_icpif are the instantaneous values, whereas those values following \"New smoothed values\" are the values after applying the smoothing with weight 65., 208181=Indicates that the call has been disconnected via the B channel on Serial7/17:1 to the asynchronous modem resource 1/03 (interface async1/03, also known as line tty219)., 207137=Dec 26 13:58:26.538: msg_to_calls_mgmt: msg type, 663487=Interface MTU Size 500, Msg Size 1096, 215469=The following example depicts a call coming in to 10.1.1.4 with codec g729r8. A lookup is performed, entry is found, and a fallback decision is made to admit the call., 299551=This command was integrated into Cisco IOS Release 12.3(1) and support was added for the Cisco 2600 XM series, Cisco 2691, and Cisco 3700 series platforms., 489923=This command was implemented on Cisco 2600 series and Cisco 3600 series routers., 491021=The tone keyword was added for the following platforms: Cisco 2610XM, Cisco 611XM, Cisco 2620XM, Cisco 2621XM, Cisco 2650XM, Cisco 2651XM, Cisco 2691, Cisco 3640A, Cisco 3660, Cisco 3725, and Cisco 3745., 89912=(Optional) Number of an expanded access list used to filter debugging messages. The range is from 1300 to 2699., 43975=The router has received this BFD packet from the BFD router with source address 172.16.10.2., 490665=This command was integrated into Cisco IOS Release 12.2(11)T and implemented on the Cisco IAD2420 series., 40265=Session [172.16.10.1, 172.16.10.2, Fa0/1,1], event RX IHY 0, 71420=This argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons., 7639=This command was implemented on Cisco IAD2420 series integrated access devices (IADs). This command is not supported on the access servers in this release., 6692=This command was implemented on the Cisco 2600 series, Cisco 3600 series, and Cisco MC3810., 214209=The following example depicts a call coming in to 10.1.1.4 with codec g729r8. Because there is no cache entry for this destination, a probe is sent and values are inserted into the cache. A lookup is performed again, entry is found, and a fallback decision is made to admit the call., 63685=Numerical value of 1000 assigned to a route by a router configured for route dampening in another autonomous system each time a route flaps. Penalties are cumulative. The penalty for the route is stored in the BGP routing table until the penalty exceeds the suppress limit. If the penalty exceeds the suppress limit, the route state changes from history to damp., 299165=This command was integrated into Cisco IOS Release 12.2(2)T and support was added for the Cisco 2600 series and Cisco 3600 series platforms., 43856=Rx IP: src 172.16.10.2, 65764=Limit by which a route is suppressed. If the penalty exceeds this limit, the route is suppressed. The default value is 2000., 58668=This command was introduced on Cisco ASR 1000 Series Routers., 490253=Support for enhanced MGCP voice gateway interoperability was added to Cisco CallManager Version 3.1 for the Cisco 2600 series, Cisco 3600 series, and Cisco VG200., 679288=This command was introduced on the Cisco 2600 and Cisco 3600 series routers., 39185=Session [172.16.10.1, 172.16.10.2, Fa0/1,1], 325484=This command was introduced for the Cisco 2600 and Cisco 3600 series routers.}",
    "textBeforeTable": "Syntax Description { all | session-id } { state | xport } session backhaul-session-manager debug no { all | session-id } { state | xport } session backhaul-session-manager debug To debug all the available sessions or a specified session, use the debugbackhaul-session-managersession command in privileged EXEC mode. To disable debugging output, use the noform of this command. debug backhaul-session-manager session debug backhaul-session-manager session through debug channel packets debug backhaul-session-manager session through debug channel packets debug backhaul-session-manager session through debug channel packets debug channel packets debug channel love debug channel ilan debug channel events debug cfm debug ces-conn debug cem ls events debug cem ls errors debug cell-hwic virt-con debug cellular messages sms debug cellular messages debug cellular messages management debug cellular messages dm debug cellular",
    "textAfterTable": "Command Default Debugging for backhaul-session-manager session is not enabled. Command Modes Privileged EXEC Command History Release Modification 12.1(1)T This command was introduced. 12.2(2)T Support for this command was introduced on the Cisco 7200 series routers. 12.2(4)T This command was implemented on the Cisco 2600 series, Cisco 3600 series, and Cisco MC3810. 12.2(2)XB This command was implemented on the Cisco AS5350 and Cisco AS5400. 12.2(2)XB1 This command was implemented on the Cisco AS5850 platform. 12.2(8)T This command was implemented",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}