{
    "relation": [
        [
            "Release",
            "10.3",
            "12.0",
            "12.0(10)S",
            "12.0(16)ST",
            "12.1(9)E",
            "12.2(8)T",
            "12.0(22)S",
            "12.2(14)S",
            "12.2(15)T",
            "12.2(33)SRA",
            "12.2SX",
            "15.2(2)S",
            "Cisco IOS XE Release 3.6S",
            "Cisco IOS XE Release 3.7S",
            "15.2(4)S"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was modified. The local-as keyword was added.",
            "This command was modified. Named community list support was added.",
            "This command was modified. Named community list support was introduced.",
            "Named community list support was integrated into Cisco IOS Release 12.1(9)E.",
            "Named community list support was integrated into Cisco IOS Release 12.2(8)T.",
            "This command was modified. The maximum number of expanded community list numbers was increased from 199 to 500.",
            "This command was modified. The maximum number of expanded community list numbers was increased from 199 to 500 and named community list support were integrated into Cisco IOS Release 12.2(14)S.",
            "This command was modified. The maximum number of expanded community list numbers was increased from 199 to 500.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware.",
            "This command was modified. The gshut keyword was added.",
            "This command was modified. The gshut keyword was added.",
            "This command was implemented on the Cisco ASR 903 router.",
            "This command was implemented on the Cisco ASR 7200 router."
        ]
    ],
    "pageTitle": "IP Routing: BGP Command Reference, Cisco IOS XE Release 3SE (Catalyst 3850 Switches) - BGP Commands_ C through I [Cisco Catalyst 3850 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/iproute_bgp/command/iproute_bgp-xe-3se-3850-cr-book/iproute_bgp-xe-3se-3850-cr-book_chapter_01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00270-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 376536671,
    "recordOffset": 376501867,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{27873=This command was introduced on Cisco ASR 1000 Series Routers., 34724=This argument must be in the form documented in RFC 2373 where the address is specified in hexadecimal using 16-bit values between colons.}",
    "TableContextTimeStampAfterTable": "{134200=In the following example, an extended community list is configured that permits routes from route target 64512:10 and site of origin 65400:20 and denies routes from route target 65424:30 and site of origin 64524:40. List 1 shows a logical OR condition; the first match is processed. List 2 shows a logical AND condition; all community values must match in order for list 2 to be processed., 136507=In the following example, a named extended community list is configured that will permit routes only from route target 65505:50. All other routes are implicitly denied., 93604=BGP community exchange is not enabled by default. The exchange of BGP community attributes between BGP peers is enabled on a per-neighbor basis with the neighbor send-community command. The BGP community attribute is defined in RFC 1997 and RFC 1998., 53718=In the following example, a metric of 1024 is set for routes redistributed into BGP from OSPF:, 3210=The route refresh capability, as defined in RFC 2918, allows the local router to reset inbound routing tables dynamically by exchanging route refresh requests to supporting peers. The route refresh capability does not store update information locally for non-disruptive policy changes. It instead relies on dynamic exchange with supporting peers. Route refresh is advertised through BGP capability negotiation. All BGP routers must support the route refresh capability., 5956=In the following example, the route refresh capability is enabled on the BGP neighbor routers and a soft reconfiguration is initiated for the inbound session with the neighbor 172.16.10.2, and the outbound session is unaffected:}",
    "textBeforeTable": "Syntax Description (explicit id ) To reset IPv6 Border Gateway Protocol (BGP) sessions, use the clear bgp ipv6command in privileged EXEC mode. clear bgp ipv6 ip prefix-list ip extcommunity-list ip community-list ha-mode graceful-restart exit-peer-session default-metric (BGP) continue clear ip bgp clear bgp ipv6 BGP Commands_ C through I ip prefix-list ip extcommunity-list ip community-list ha-mode graceful-restart exit-peer-session default-metric (BGP) continue clear ip bgp clear bgp ipv6 BGP Commands_ C through I Contents BGP Commands_ C through I --> pre.screen { padding: 5px 5px 5px 5px; border: outset; background-color: #CCCCCC; margin-top: 2px; margin-bottom : 2px; white-space: pre} .nocellnorowborder { border:solid 1px; border-left:solid 1px; border-right:solid 1px; border-top:solid 1px; border-bottom:solid 1px;} .cell-norowborder { border:solid",
    "textAfterTable": "12.2(2)T This command was introduced. 12.0(21)ST This command was integrated into Cisco IOS Release 12.0(21)ST. 12.0(22)S This command was integrated into Cisco IOS Release 12.0(22)S. 12.2(14)S This command was integrated into Cisco IOS Release 12.2(14)S. 12.3(2)T The unicast keyword was added to Cisco IOS Release 12.3(2)T. 12.0(26)S The unicast and multicast keywords were added to Cisco IOS Release 12.0(26)S. 12.3(4)T The multicastkeyword was added to Cisco IOS Release 12.3(4)T. 12.2(25)S The multicastkeyword was added to Cisco IOS Release 12.2(25)S. 12.2(28)SB This command was integrated into Cisco IOS Release 12.2(28)SB.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}