{
    "relation": [
        [
            "",
            "2000 mg Ofatumumab + DR",
            "2000 mg Ofatumumab + BFR",
            "2000 mg Ofatumumab + Other"
        ],
        [
            "Description",
            "Ofatumumab iv infusion was initiated at 300 mg, followed by seven weekly 2000 mg infusions and then four monthly infusions of 2000 mg for a duration of 24 weeks. The IRC classified these participants as DR, defined as participants who were enrolled in the study and were refractory to both fludarabine and alemtuzumab.",
            "Ofatumumab iv infusion was initiated at 300 mg, followed by seven weekly 2000 mg infusions and then four monthly infusions of 2000 mg for a duration of 24 weeks. The IRC classified these participants as BFR, defined as participants who were enrolled in the study and were refractory to fludarabine with bulky lymphadenopathy.",
            "Ofatumumab iv infusion was initiated at 300 mg, followed by seven weekly 2000 mg infusions and then four monthly infusions of 2000 mg for a duration of 24 weeks. The IRC classified these participants as \"other,\"defined as participants who were enrolled in the study but did not meet criteria for DR or BFR."
        ]
    ],
    "pageTitle": "HuMax-CD20 in B-Cell Chronic Lymphocytic Leukemia (B-CLL) Patients Failing Fludarabine and Alemtuzumab - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00349349?sect=Xl015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00186-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 860571898,
    "recordOffset": 860555957,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: ofatumumab Intervention: Leukaemia, Lymphocytic, Chronic Condition: Allocation: Non-Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Single Group Assignment;   Masking: Open Label;   Primary Purpose: Treatment Study Design: Interventional Study Type: Results First Received: October 20, 2011  ",
    "textAfterTable": "Participant Flow:   Overall Study     2000 mg Ofatumumab + DR     2000 mg Ofatumumab + BFR     2000 mg Ofatumumab + Other   STARTED     95     112     16   COMPLETED     42     50     10   NOT COMPLETED     53     62     6   Adverse Event                 5                 6                 2   Withdrawal by Subject  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}