{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Go out with friends.",
            "Home cooked meals will always be better!",
            "Always fun to meet people the first year in dorms.",
            "Very, if you had A's in high school be ready for a B or two.",
            "Be prepared to do things on your own.",
            "A small campus. Great teachers. Amazing friends."
        ]
    ],
    "pageTitle": "Truman State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Truman-State-University/reviews?_escaped_fragment_=/show/89777",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00338-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897764531,
    "recordOffset": 897698123,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{108691=I always went to the 1000 Hills lake about 5 miles from Kirksville, where you can fish, trail run or lay out. Although the Quad (area in the middle of campus) always has activities and games., 120058=Join organizations and hit the town when you can. Make sure to get out of the dorms and explore. 1000 Hills Park is fun for hiking and boating. Night life is kind of limited because there are really only 3 good bars in town, but they are still fun., 260426=The Joseph Baldwin statue in the Quad was cast in 1929., 40107=The website Parents & Colleges selected Truman as one of America's Best Colleges for 2010, listing the university 5th among the Top 10 Best Value Public Colleges and Universities. Truman is constantly recognized for its high-quality, private education for a public price., 322608=© 2015, Cappex.com, LLC, 307060=Truman State University is a small school that truly values the quality and not quantity of students. Student to professor ratio is 16:1 and professors hold students to a high standard when it comes to academics. There are many opportunities available a Truman that cannot be offered anywhere else., 276702=Your'e going to hear this a lot, but the key to fun is getting involved. We have so many organization on campus, and we also have Greek Life. I've met people from everywhere and 9 times out of 10, they are always involved in something. We also have a 1000 Hills State Park, and there is a beautiful lake that you can go boating and canoeing on. The Square is a really cute little town that is in walking distance from the school. They have restaurants, thrift shops, and lots of other things. I encourage you to meet new people. Make as many friends as possible and you'll never encounter a dull moment., 222522=Rush isn't till September which is nice because by then you know if you have time for it and you are settled in., 248420=Kirksville is small, so join an organization! There are plenty of sports and clubs. The Greek Life on campus is friendly and fairly inexpensive. I would recommend going through rush even if you are unsure, many people decide to try it out and then do not actually pledge. The town of Kirksville has farmers markets until October on the square and a variety of places to eat. There's a bowling alley with $1 bowling every Monday. Monday-Thursday students get $5 tickets at the theatre. Truman SAB is pretty good about bringing in concerts. We had Childish Gambino a year ago and Flogging Molly 4 years ago!}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 20 out of 23 people found this review useful. 1 of 66 Keara from Wildwood, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Chelsea from Kansas City, MO 10/14/2010 Reviewer is A current student here. 4 out of 5 people found this review useful. 2 of 66 Categories Comments Great for these types of students Students who are interested in getting a more rounded education. Tips for prospective students Apply for scholarships!! Bang for the buck Truman is a very reasonably priced school for the type of education you are receiving and the type of actives the school provides. It's the self proclaimed Harvard of the Midwest and it's affordable. Truman also provides students with plenty of scholarship opportunities before you even attend school there. Am enjoying being here You might think that a college located in a small town is not your ideal college setting. But you may be surprised by how many activities Truman provides for its students. There is always something happening. Truman wants you to be involved! Just because Kirksville is a small town doesn’t mean there isn’t plenty",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}