{
    "relation": [
        [
            "First Name",
            "Hank",
            "Dean",
            "Richard",
            "David",
            "Nick",
            "Pete"
        ],
        [
            "Last Name",
            "Webster",
            "Franks",
            "Juliano",
            "Bauer",
            "Goldstein",
            "Ruane"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "Intern, Rep. James Langevin",
            "Legislative Aide, Rep. Judy Biggert",
            "White House Liaison, U.S. DOT",
            "Personal Staff, Sen. Mark Hatfield",
            "Intern, U.S. Environmental Protection Agency",
            "Deputy Director, OEA, Office of Sec. of Defense"
        ],
        [
            "New",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=2443E511-3405-46D8-8CD0-20FFF6235B45&filingTypeID=82",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 224191423,
    "recordOffset": 224183221,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12199=Supported continued implementation of H.R. 1, the American Recovery and Reinvestment Act (ARRA) of 2009. Promoted job-creating benefits of infrastructure investments. Provided Congressional offices and members of the Administration with updates on ARRA project progress., 32314=Urged U.S. Environmental Protection Agency (EPA) officials not to regulate coal ash as a \"hazardous\" waste, which could make concrete more costly and less durable, thus increasing costs and the environmental impact of vital transportation improvement projects. Supported H.R. 2273, the Coal Residuals Reuse and Management Act and S. 1751, the Coal Residuals Reuse and Management Act, and S. 3512, the \"Coal Ash Recycling and Oversight Act.\", 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 37743=ARTBA, along with 77 other trade associations, urged Congress December 5 to extend the 50 percent bonus depreciation tax incentive for companies who make new capital investments in things like equipment, softward, and plant infrastructure. The tax incentive, in place since 2008 as an effort to stimulate the economy, was set to expire January 1 but was extended through 2013 as part of the short-term fiscal cliff agreement., 41457=ARTBA staff began meeting with newly elected Members of Congress to discuss myriad federal transportation issues, including the reauthorization of the Moving Ahead for Progress in the 21st Century Act within the term of the current Congress, September 30, 2014., 16378=Urged opposition to expanding the EPA and Army Corps of Engineers' Clean Water Act authority to regulate U.S. wetlands. Supported S. 2245, the \"Preserve the Waters of the United States Act,\" and similarly named H.R. 4965 in the House., 20066=Met November 30 with officials from U.S. Department of Transportation to discuss the implementation of H.R. 4348, the Moving Ahead for Progress in the 21st Century Act. Major topics covered were the new law's freight, performance process, and environmental streamlining process., 34896=ARTBA staff have met with Congressional Offices to urge inclusion of a long-term Highway Trust Fund revenue solution in any tax reform or deficit reduction package in 2013., 44393=ARTBA, along with 16 other trade associations, urged President Obama and U.S. Secretary of State Hillary Clinton December 13 to approve the permit application for the construction of a new international trade crossing between Detroit, Mich., and Windsor, Ontario.}",
    "textBeforeTable": "",
    "textAfterTable": "4a. Contact Name b. Telephone Number c. E-mail  Mr.  Hank Webster  2022894434  hwebster@artba.org 5. Senate ID#  3275-12 7. Client Name Self Check if client is a state or local government or instrumentality  ARTBA 6. House ID#  322370000 TYPE OF REPORT 8. Year  2012 Q1 (1/1 - 3/31) Q2 (4/1 - 6/30) Q3 (7/1 - 9/30) Q4 (10/1 - 12/31) 9. Check if this filing amends",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}