{
    "relation": [
        [
            "Published Date",
            "Nov 25, 2014",
            "Jul 10, 2014",
            "Jul 3, 2014",
            "Dec 4, 2013",
            "Jul 18, 2013",
            "Jul 10, 2013",
            "Jul 26, 2012",
            "Jul 18, 2012",
            "May 4, 2012",
            "Aug 16, 2011",
            "Sep 28, 2006"
        ],
        [
            "Version",
            "1445 (current)",
            "1440",
            "1439",
            "1428",
            "1423",
            "1421",
            "1416",
            "1410",
            "1408",
            "1401",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - K-TAB- potassium chloride tablet, film coated, extended release",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=6594df99-d8ce-49b9-3fbe-9ec7cdc9199b",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00049-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 60942303,
    "recordOffset": 60915022,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3489=©2013, 2014 AbbVie Inc., 3406=Manufactured by: AbbVie LTD Barceloneta, PR 00617 For: AbbVie Inc. North Chicago, IL 60064 03-A995 July, 2014, 2418=1000 Filmtab®, 7974=K-TAB (potassium chloride extended-release tablets, USP) contain 600 mg, 750 mg and 1500 mg of potassium chloride (equivalent to 8 mEq, 10 mEq and 20 mEq, respectively). K-TAB tablets are provided as extended-release Filmtab® tablets. K-TAB 600 mg tablets are round in shape, yellow in color and are debossed with the trademark K-TAB on one side. K-TAB 750 mg tablets are ovaloid in shape, yellow in color and are debossed with the “a” logo on one side and the trademark K-TAB on the other side. K-TAB 1500 mg tablets are ovaloid in shape, white in color and are debossed with the trademark K-TAB on one side., 1633=20 mEq (1500 mg), 34180=K-TAB (potassium chloride extended-release tablets) is a solid oral dosage form of potassium chloride containing 8 mEq, 10 mEq and 20 mEq of potassium chloride, USP, equivalent to 600 mg, 750 mg and 1500 mg of potassium, respectively, in a film-coated (not enteric-coated), wax matrix tablet. These formulations are intended to slow the release of potassium so that the likelihood of a high localized concentration of potassium chloride within the gastrointestinal tract is reduced. The expended inert, porous, wax/polymer matrix is not absorbed and may be excreted intact in the stool.}",
    "textBeforeTable": "Number of versions: 11 K-TAB- potassium chloride tablet, film coated, extended release View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close Labeler - AbbVie Inc. (078458370) 06/09/1980 NDA018279 NDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information 1000 in 1 BOTTLE; Type 0: Not a Combination Product NDC:0074-3058-46 4",
    "textAfterTable": "RxNorm K-TAB- potassium chloride tablet, film coated, extended release RxCUI RxNorm NAME RxTTY 1 198116 potassium chloride 20 MEQ (1500 MG) Extended Release Oral Tablet PSN 2 198116 Potassium Chloride 20 MEQ Extended Release Oral Tablet SCD 3 198116 K+ Chloride 20 MEQ Extended Release Oral Tablet SY 4 198116 Pot Chloride 20 MEQ Extended Release Oral Tablet SY 5 198116 potassium chloride 1500 MG (potassium 20 mEq) Extended Release Oral Tablet SY 6 198116 potassium chloride 1500 MG Extended Release Oral Tablet SY 7 312529 potassium chloride 8 MEQ Extended Release Oral Tablet PSN 8 312529 Potassium Chloride 8 MEQ Extended Release Oral Tablet SCD 9 312529 K+ Chloride 8 MEQ Extended Release Oral Tablet SY 10 312529 Pot Chloride 8 MEQ Extended Release Oral Tablet SY 11 312529 potassium chloride 600 MG Extended Release Oral Tablet SY 12 628953 potassium chloride 10 MEQ (750 MG) Extended Release Oral Tablet PSN 13 628953 Potassium Chloride 10 MEQ Extended Release Oral Tablet SCD 14 628953 K+ Chloride 10 MEQ Extended Release Oral Tablet SY",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}