{
    "relation": [
        [
            "Patent application number",
            "20120039440",
            "20120106816",
            "20120170709",
            "20120183108",
            "20130003912",
            "20130003914",
            "20130266115",
            "20130343623"
        ],
        [
            "Description",
            "SYSTEM AND METHOD OF OPTIMIZING A REPRESENTATION OF DUAL ENERGY SPECTRAL CT IMAGES - An imaging system includes an x-ray source, a detector, a data acquisition system (DAS) operably connected to the detector, and a computer operably connected to the DAS. The computer is programmed to obtain CT scan data with two or more incident energy spectra, decompose the obtained CT scan data into projection CT data of a first basis material and a second basis material, generate a first basis material image and a second basis material image using the decomposed projection CT data, generate a first monochromatic image from the first basis material image and the second basis material image at a first energy that is selected based on an amount of correlated noise at the first energy, noise-reduce the first monochromatic image to generate a noise-reduced first monochromatic image, and generate a final monochromatic image based at least on the noise-reduced first monochromatic image.",
            "SYSTEM AND METHOD FOR MATERIAL DECOMPOSITION OPTIMIZATION IN IMAGE DOMAIN - A system and method for material decomposition optimization in the image domain include a non-transitory computer readable medium has stored thereon a sequence of instructions which, when executed by a computer, causes the computer to access a reconstructed basis material image. For a first voxel of the reconstructed basis material image, the instructions also cause the computer to optimize a concentration of a pair of materials (a,b) in the first voxel exclusively in the image domain and based on a first probability based on random perturbations and a second probability based on random perturbations. The optimization is further based on a third probability based on known materials and a fourth probability based on concentrations of the pair of materials in a pair of voxels neighboring the first voxel.",
            "DYNAMIC COLLIMATOR FOR WIDE COVERAGE AND LOW DOSE CARDIAC CT IMAGING - A CT scanner comprising a dynamic collimator disposed near an x-ray source and a controller configured to rotate the x-ray source about a subject, wherein imaging data is acquired from a single rotation of the x-ray source, the single rotation being divided into a first half-scan and a second half-scan. The controller is further configured to position the dynamic collimator after acquiring image data from one of the first half-scan and the second half-scan and simultaneous to commencement of acquiring image data from the other of the first half-scan and the second half-scan to obstruct a central portion of an x-ray beam emitted by the x-ray source during one of the first half-scan and the second half-scan. The CT scanner is further configured to reconstruct a CT image using the first set of imaging data and the second set of imaging data.",
            "SYSTEMS AND METHODS FOR MULTICHANNEL NOISE REDUCTION - Systems and methods for multichannel noise reduce are provided. One method includes acquiring a multichannel signal, obtaining a noise correlation between a plurality of channels of the multichannel signal, and obtaining a signal characteristic in each of the plurality of channels. The method also includes removing signal noise based on (i) the correlated noise and (ii) at least one of an uncorrelated noise in each channel or the obtained signal characteristic in each channel.",
            "SYSTEM AND METHOD OF ACQUIRING COMPUTED TOMOGRAPHY DATA USING A MULTI-ENERGY X-RAY SOURCE - The subject matter disclosed herein relates to X-ray imaging systems, and more specifically, to multi-energy computed tomography (CT) X-ray imaging systems. In an embodiment, a multi-energy computed tomography (CT) imaging system includes an X-ray source that emits X-rays upon the application of a low stable bias, a high stable bias, and transitional biases between the low stable bias and the high stable bias. The imaging system also includes an X-ray detector configured to produce an electrical signal corresponding to the intensity of the X-rays emitted by the X-ray source that reach the X-ray detector. The imaging system also includes data processing circuitry configured to acquire a first set of data corresponding to the electrical signal produced by the X-ray detector only when the low stable bias or the high stable bias is applied to the X-ray source. The imaging system also includes a processor configured to process the first set of acquired data and construct one or more multi-energy CT images.",
            "METHOD AND SYSTEM FOR REDUCED DOSE X-RAY IMAGING - Approaches for acquiring CT image data corresponding to a full scan, but at a reduced dose are disclosed. In one implementation, X-ray tube current modulation is employed to reduce the effective dose. In other implementations, acquisition of sparse views, z-collimation, and two-rotation acquisition protocols may be employed to achieve a reduced dose relative to a full-scan acquisition protocol.",
            "SYSTEM AND METHOD FOR MULTI-ENERGY COMPUTED TOMOGRAPHY IMAGING - A CT system includes a gantry, an x-ray source, a detector, and a grating collimator that includes alternating first and second materials. The system includes a controller configured to emit a first beam of x-rays from a first focal spot and to a first detector pixel, wherein the first beam of x-rays passes along a ray and through one of the first materials of the grating collimator, and subsequently emit a second beam of x-rays from a second focal spot and to the first detector pixel, wherein the second beam of x-rays passes substantially along the ray and through one of the second materials of the grating collimator. The system includes a computer programmed to generate first and second kVp image datasets using data acquired from the first beam and second beams of x-rays, and reconstruct a basis material image of the object.",
            "METHODS AND SYSTEMS FOR REDUCING NOISE- RELATED IMAGING ARTIFACTS - A method for reducing noise in a medical diagnostic image includes acquiring an initial three-dimensional (3D) volume of projection data, generating a projection space noise estimate using the 3D volume of projection data, generating an initial 3D volume of image data using the 3D volume of projection data, generating an image space noise estimate using the 3D volume of image data, generating a noise projection estimate using the projection space noise estimate and the image space noise estimate, and reconstructing an image using the generated noise estimate. A system and non-transitory computer readable medium are also described."
        ],
        [
            "Published",
            "02-16-2012",
            "05-03-2012",
            "07-05-2012",
            "07-19-2012",
            "01-03-2013",
            "01-03-2013",
            "10-10-2013",
            "12-26-2013"
        ]
    ],
    "pageTitle": "Fan, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/fan-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441335419,
    "recordOffset": 441288823,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jiahua Fan, New Berlin, WI US //]]> BarDraw('2541241',['Patent applications by Jiahua Fan, Waukesha, WI US'],[[1,1,1]],['2009','2011','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2541241\" align=\"center\"></div> </div> <canvas id=\"bg2541241\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jiahua Fan, Waukesha, WI US</p> <div class=\"bar2541241\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>05-03-2012</td> <td><a href=\"/patents/app/20120106695\">DYNAMIC COLLIMATOR FOR WIDE COVERAGE AND LOW DOSE CARDIAC CT IMAGING</a> - A CT scanner comprising a dynamic collimator disposed near an x-ray source and a controller configured to rotate the x-ray source about a subject, wherein imaging data is acquired from a single rotation of the x-ray source, the single rotation being divided into a first half-scan and a second half-scan. The controller is further configured to position the dynamic collimator after acquiring image data from one of the first half-scan and the second half-scan and simultaneous to commencement of acquiring image data from the other of the first half-scan and the second half-scan to obstruct a central portion of an x-ray beam emitted by the x-ray source during one of the first half-scan and the second half-scan. The CT scanner is further configured to reconstruct a CT image using the first set of imaging data and the second set of imaging data.</td> <td>20120106695</td> <tr> </tr> <td>04-14-2011</td> <td><a href=\"/patents/app/20110085719\">SYSTEM AND METHOD OF IMAGE ARTIFACT REDUCTION IN FAST KVP SWITCHING CT</a> - A CT system includes a generator configured to energize an x-ray source to a first kilovoltage (kVp) and",
    "textAfterTable": "Jianke Fan US Patent application number Description Published 20120281679 RACH communication in cellular system - A solution for sharing random access parameters is provided. A plurality of terminal devices shares the same random access parameters, e.g. the random access preamble sequence, and different transmission opportunities are assigned to the terminal devices. The different transmission opportunities are used to distinguish the terminal devices in the random access procedure. 11-08-2012 Jianmei Fan, Hamden, CT US Patent application number Description Published 20090054514 BENZOFURAN AND BENZOTHIOPHENE DERIVATIVES USEFUL IN THE TREATMENT OF HYPER-PROLIFERATIVE DISORDERS - This invention relates to novel benzofuran and benzothiophene derivatives of the general formula 02-26-2009 Patent applications by Jianmei Fan, Hamden, CT US Jianxun Fan, Apex, NC US Patent application number Description Published 20110279147 APPARATUS AND METHOD FOR PHASE SYNCHRONIZATION IN RADIO FREQUENCY TRANSMITTERS - Apparatus and methods are disclosed related to phase synchronization in transmitters. One such apparatus includes a wireless transmitter with two or more separate and unrelated local oscillators. The apparatus can provide RF signals to multiple antenna elements, which can be implemented in",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}