{
    "relation": [
        [
            "Pos.",
            "G",
            "G",
            "G",
            "F",
            "F"
        ],
        [
            "Name",
            "J'Mychal Reese",
            "Fabyon Harris",
            "Elston Turner",
            "Kourtney Roberson",
            "Ray Turner"
        ],
        [
            "Yr.",
            "Fr.",
            "Jr.",
            "Sr.",
            "So.",
            "Sr."
        ],
        [
            "Ht./Wt.",
            "6-1/177",
            "5-11/173",
            "6-5/209",
            "6-9/238",
            "6-9/233"
        ],
        [
            "PPG",
            "7.2",
            "10.9",
            "15.5",
            "6.7",
            "9.7"
        ],
        [
            "RPG",
            "2.9",
            "1.8",
            "3.5",
            "6.7",
            "5.9"
        ]
    ],
    "pageTitle": "HuskerOnline.com - Noel emerging as leader as UK faces A&M again",
    "title": "",
    "url": "https://nebraska.rivals.com/content.asp?CID=1467230",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 877962407,
    "recordOffset": 877940165,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1929=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 HuskerOnline.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{40054=February 1, 2013, 63452=Top 10 upsets: A November to remember, 57085=3. Home Sweet Home: Despite its recent struggles, Texas A&M has been a tough out at home. The Aggies are 66-17 at Reed Arena since the start of the 2008-09, but just 23-14 in conference games. Since the start of the 2006-07 season, A&M is 100-20 at home. The Aggies are 133-25 since the start of the 2004-05 season. Texas A&M has won 47 of its last 54 home games against unranked opponents. The Aggies are in their 14th season at Reed Arena. After starting 41-41 there, the Aggies are 133-25., 41977=He'll try to keep it up on Saturday, when the Wildcats (14-6, 5-2 Southeastern Conference) get a second shot at Texas A&M (13-7, 3-4), a team that beat them Jan. 12 at Rupp Arena., 54316=Last meeting: Texas A&M 83, Kentucky 71, Jan. 12, Lexington, Ky. Elston Turner got off to a hot start and had a big finish, scoring 40 points to give the Aggies their first road win as an SEC program and hand Kentucky its first SEC home loss under John Calipari. Turner made 14-of-19 shots and 6-of-10 three-pointers, sinking all six of his free throws and adding six rebounds and four assists. Texas A&M trailed 62-58 with 6:12 to play but closed the game on a 25-9 run. Archie Goodwin led UK with 17 points. Nerlens Noel had 15 points, 11 rebounds, seven blocks, six assists and four steals., 43012=In his past six games, Noel has blocked 46 shots. He has 95 blocked shots this season, the most in a single season by any UK player other than Anthony Davis. Through 20 games, Noel is two blocks ahead of Davis' pace in 2011-12, when he set an NCAA Division I freshman record with 186 blocks.}",
    "textBeforeTable": "Texas A&M (13-7, 3-4 SEC) Coach: Billy Kennedy (27-25 in second season at Ole Miss; 238-204 in 14th season overall) Last game: Beat Mississippi State 55-49 (OT) Roster | Stats KENTUCKY (14-6, 5-2 SEC) Coach: John Calipari (116-20 in fourth season at Kentucky; 519-158 in 21st season overall) Last game: Beat Ole Miss 87-74 Roster | Stats KENTUCKY AT TEXAS A&M| SATURDAY | 6 P.M. | ESPN br> \"It's about the team,\" Noel said. \"I want the team to go as far as we can for the team, not just for a record that I want to break. If the team goes far, it's for the team to win a championship, and that's the main goal.\" Noel hopes he gets a chance to play as many. Davis got 40 games in leading his team to last",
    "textAfterTable": "Pos. Name Yr. Ht./Wt. PPG RPG G J'Mychal Reese Fr. 6-1/177 7.2 2.9 G Fabyon Harris Jr. 5-11/173 10.9 1.8 G Elston Turner Sr. 6-5/209 15.5 3.5 F Kourtney Roberson So. 6-9/238 6.7 6.7 F Ray Turner Sr. 6-9/233 9.7 5.9 Game/Series Information Game Information Site: Reed Arena (12,989), College Station, Texas. TV: ESPN (Mark Jones play-by play, Jimmy Dykes analyst). Radio: UK IMG Sports Network (Tom Leach play-by-play, Mike Pratt analyst); XM 85. Internet: Audio | Video Favorite: Kentucky by 7.5 Series Information Series record: Tied 2-2 At College Station: First meeting Coaches' records: Calipari 1-1 vs. Texas A&M; Kennedy 1-1 vs. Kentucky",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}