{
    "relation": [
        [
            "Season",
            "1989",
            "1990",
            "1995",
            "1997",
            "1999",
            "2000",
            "2000",
            "2001",
            "2003",
            "2004",
            "2006",
            "2010"
        ],
        [
            "Name",
            "Shawn McCarthy",
            "Steve Jackson",
            "Mike Alstott",
            "Brian Alford",
            "Drew Brees",
            "Drew Brees",
            "Matt Light",
            "Travis Dorsch*",
            "Stuart Schweigert",
            "Taylor Stubblefield#",
            "Anthony Spencer",
            "Ryan Kerrigan#"
        ],
        [
            "Pos.",
            "P",
            "DB",
            "RB",
            "WR",
            "QB",
            "QB",
            "OT",
            "P",
            "S",
            "WR",
            "DE",
            "DE"
        ]
    ],
    "pageTitle": "Purdue Boilermakers football - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Purdue_Boilermakers_football",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00275-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 870259323,
    "recordOffset": 870178064,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{31556=On October 31, 1903, 14 members of the 1903 squad were killed in Indianapolis Indiana when the train they were riding collided with a coal train. The event became known as the Purdue Wreck., 38739=On January 2, 1967, Jack Mollenkopf coached the school's first appearance in the Rose Bowl, leading Purdue to a 14–13 victory over USC. Against Purdue's in-state rivals, Mollenkopf tallied an 11–2–1 record versus Indiana and a 10–4 mark against Notre Dame. From 1966 to 1969, a Purdue player finished in the top three in balloting for the Heisman Trophy: quarterback Bob Griese was second in 1966, halfback Leroy Keyes placed third in 1967 and second in 1968, and quarterback Mike Phipps finished as runner-up in 1969. Mollenkopf's inaugural season in 1956 was the only losing campaign of his tenure as head coach at Purdue., 32642=For the 1922 season, Purdue hired Missouri Tigers football coach, James Phelan. Phelan lead the 1929 Boilermakers to a perfect 8-0 record and their first ever outright Big Ten Title., 34269=In 1925, Noble Kizer became an assistant coach at Purdue under Phelan and inherited the head coaching position upon Phelan's departure for the University of Washington., 34963=Allen Elward became head coach after serving as an assistant at Purdue from 1927 to 1936. He complied a 16–18–6 record at Purdue., 98869=Purdue's Pride sticker (given out for good performances) was the Purdue logo (locomotive). This was changed in 2006 to a sledgehammer with the slant \"P\" in the hammer's head (like the one wielded by mascot Purdue Pete). In the 2006 game against the Indiana State Sycamores, Purdue wore a throwback uniform from 1966, in honor of the 40th anniversary of the school's first Rose Bowl team. It featured a white jersey with two outer black stripes on the shoulder and one inner gold stripe. The numerals were black with no outline. The team wore gold pants with two black stripes on the sides, and the helmets were old gold with black numbers and one black stripe down the middle. The gold in the throwback uniforms was more yellow in hue than that in the regular 1997–present uniforms., 71999=In 1886 the Purdue Student Army Training Corps produced 5 men who provided music for the Army trainees to listen to during their morning conditioning runs. While operating without a director until 1904, the band had started playing at Purdue football games and had grown to over 50 members. In 1904, Paul Spotts Emrick, joined the band. His experience as a conductor resulted in his election as band president and director the next year. During his senior year at Purdue, the marching band, under Emrick, became the first band to break ranks and form a letter on the field—the famous Block \"P\".[77], 51901=In 1992, Colletto lost Rogers to academic ineligibility, and was forced to use a new running back.[52] The Rogers suspension opened the door for what would become Purdue's all-time leading rusher, Mike Alstott.[53], 44581=In December 1976, Purdue hired 41-year old Jim Young away from Arizona.[35] When Young arrived at Purdue, he named true freshman, Mark Herrmann as the team's starting quarterback, and the freshman lived up to expectations, throwing for 2,041 yards through the team's first eight games.[36] Herrmann would break the NCAA record for passing yards (2,453) and passing touchdowns (18) for freshman.[37] In 1978, Young would lead Purdue to a 9-2-1 record, and a victory over Georgia Tech in the 1978 Peach Bowl. Young was named the Big Ten's Coach of the Year, the first Boilermaker head coach to ever win the award.[38] Throughout his career, Herrmann would break the Big Ten's all-time career passing yards (6,734) and passing touchdowns (48) before his senior season.[39] After a disappointing 1981 season, Young resigned from his position as head coach at Purdue, citing his desire to concentrate on athletic administration.[40], 68388=The Boilermakers have called Ross-Ade Stadium home since 1924. It is named for David E. Ross and George Ade, the principal benefactors. Ross–Ade Stadium opened on November 22, 1924 with a seating capacity of 13,500 and standing room for an additional 5,000 people.[76] A series of additions and renovations pushed the seating capacity to almost 68,000 (70,000 with standing room). In 2001 Purdue University began a $70 million renovation, which led to a reduced seating capacity of 62,500., 82875=Due to having an odd number of teams from 1993 to 2010, the Big Ten utilized a rotating system of conference games. Every school was designated two official rivals, whom they played every year. The official rivals for Purdue were Indiana and Northwestern. However, after the expansion of the Big Ten to 12 schools, Purdue and Northwestern were placed into separate conference divisions and will no longer play each other on an annual basis. Beginning in 2011, Purdue's new designated cross-division rival will be Iowa. This matchup has been mocked by fans of both teams. The other cross-divisional rivalries set up by the Big Ten had some history or a trophy behind the pairing, but Purdue and Iowa were left over., 46983=In November 1981, defensive coordinator Leon Burtnett was promoted as Purdue's 30th head football coach.[41] During the 1984 campaign, Burtnett's team posted its best season, which the highlight of the year was beating #2 Ohio State 28-23.[42] The 1984 squad's 7-4 record earned Burtnett the Big Ten's Coach of the Year Award.[43] His success that year earned him a contract extension through 1990.[44] Burtnett's teams didn't improve after 1984, and after a 3-8 season in 1986, Burtnett resigned as head coach.[45], 78409=Financial and moral support for the first Boilermaker Special was provided by key members of the Purdue University graduating class of 1907, and members of the Purdue Reamer Club from the graduating classes of 1940 and 1941., 135856=Purdue has participated in 17 bowl games throughout its history, compiling a 9–8 record.[89] Purdue did not appear frequently in post-season play from 1967 to 1984, but they played well, winning 4 of 5 bowl games including four consecutive wins between 1967 and 1980. When Tiller arrived in 1997, Purdue went to eight consecutive bowl games, but only won three of the eight bowl games. Tiller would lead the Boilermakers to a total of 10 bowl games in his 12 seasons as head coach.[90] Of those 17 bowl appearances, the Boilermakers have participated in 1 \"major\" Division I-A/FBS bowl games, which was part of the BCS Bowl Games. The Boilermakers have never played in a National Championship Game., 52420=In 1994, the Boilermakers got out to a 4-1-1 start, and were starting to gain national attention.[54] With Rogers and Alstott leading the way out of the Purdue backfield, Purdue racked up 1,206 and 17 rushing touchdowns in 6 games.[54] However Purdue stumbled down the stretch, finishing the season 0-4-1., 101269=In 2013, Purdue designed a new black helmet that was used during the Ohio State and Indiana games. The all black helmet had a matte finish with a decal of train tracks down the center of the helmet, with the University's official athletic logo at the end of the tracks. Also on the helmet was the phrase \"One Brick Higher,\" the motto coach Darrell Hazell had chosen for the season.[85], 61072=The 2012 season was met with high expectations from fans, alumni, and Hope himself, who proclaimed that it would be his best team with many starters returning.[64] Moreover, with both Ohio State and Penn State serving bowl bans that year, the Boilermakers had a strong opportunity to win the Leaders division title. However, after a 3-1 non-conference start, the team would then open Big Ten play with five straight losses. Although the Boilers would eventually win their final three games, including victories over archrivals IU and Illinois, and become bowl-eligible for the second straight year, athletic director Morgan Burke announced on November 25, 2012 that Hope would be fired. Wide receivers coach Patrick Higgins was named interim coach for the bowl game.[65], 37142=During Stu Holcomb’s tenure as Boilermakers head coach he compiled a record of 35–42–4. His best year was 1952 when he led the Boilermakers to a Big Ten Conference co-championship and a #18 ranking in the final poll. Despite having only a 4–3–1 overall record, Holcomb's team played well in conference with a 4–1–1 record. Holcomb’s Purdue teams are, perhaps, best remembered for ending Notre Dame's 39-game unbeaten streak when his Boilermakers defeated the Irish, 28–14, in the second game of the 1950 season. Holcomb was known for developing solid quarterbacks including Bob DeMoss, Dale Samuels and Len Dawson. These players helped grow a strong tradition at Purdue of great quarterback play. On December 12, 1955, After his nine seasons at Purdue, Holcomb left Purdue to accept the athletic director position at the Northwestern University, 42504=After nine seasons as the Northwestern coach, Alex Agase accepted an offer at the end of 1972 to become head football coach at Purdue, one of the two schools for which he played.[31] Taking the job was \"not an easy decision to make,\" he said at the time, because he was happy at Northwestern.[31] Agase coached at Purdue through the 1976 season, but his team never posted a winning record in his years there.[32] He was fired in early 1977 and took a job as athletic director at Eastern Michigan University in Ypsilanti, Michigan.[33] He stayed in that job until 1982, when he unexpectedly resigned citing \"personal reasons\".[34], 79129=Purdue Pete was first designed as a logo by the University Bookstore in 1940.[78] They would put it on their products and portray him dressed up in different clothes for the different majors. He got the Purdue part of his name from Purdue University.[79] The owners of the bookstores gave him the name “Pete”, yet no one officially knows why this was chosen to be his name.[79] He was given a physical identity in 1956 as he came out and helped the students cheer at a pep rally.[78] Over the years, the appearance of Purdue Pete has gone under several drastic changes as well as several minor changes. His original head was made of paper-mâché, pasted onto a chicken wire frame.[79] This was very inconvenient for the person who would be underneath because it would limit his movements, yet he was still expected to move around and do stunts.[79] This head was changed to a giant fiberglass head where the person inside would use a harness to support it. This was unpractical due to the sheer size of it. In the 1980s, Purdue Pete acquired the appearance he is now associated with.[79] Proposals to switch to a soft-sculpture costume were rejected in 2006 and 2011.[80][81], 92408=Purdue has also had a more recent tradition of sending defensive ends to the NFL. Since 1999, Purdue has had 9 defensive ends selected in the NFL Draft. With their success in the NFL, Purdue has earned the nickname, the \"Den of Defensive Ends.\"[84], 28895=In 1891, Knowlton Ames became the head coach for Purdue, where he led the Boilermakers to a 12–0 record over two years.[17], 50295=Jim Colletto was named Purdue's head coach in December 1990, accepting the position while he was serving the offensive coordinator for Ohio State.[49] Colletto came to Purdue with the goal of recruiting kids from the Chicago area, and keeping Purdue's quarterback tradition trending onward.[49] During his introduction press conference, he stated that at practice field, he planned to install a small cemetery in which he would place a tombstone for every school Purdue upset or beat on the road.[50] Colletto also provided up change on offense, as he brought his I formation with him from Ohio State.[51] During his for season as head coach, the Boilermakers improved winning two more games than they had the year before, and freshman tailback Corey Rogers was named the Big Ten Freshman of the Year.[52], 206375=Since its institution in 1994, the Purdue University Intercollegiate Athletics Hall of Fame recognizes those participants that have helped elevate Boilermaker athletics into one of the most respected programs in the nation. Former athletes, coaches and administrators are eligible for selection 5 years following their association with Purdue athletics.[111] The following individuals have been inducted into the Purdue Intercollegiate Athletics Hall of Fame for their contributions to the Boilermaker football program:, 65848=Stuart Field was dedicated on April 16, 1892,[73] and named for Charles B. and William V. Stuart, two brothers who served on the university's board of trustees.[74] Originally a seven-acre[74] (2.8 ha) field with eight hundred seats,[73] by the 1910s it was expanded to twice that area[74] and a seating capacity of five thousand.[75], 54361=Joe Tiller was hired by Purdue in 1997.[56] Tiller inherited a program that had only had two winning seasons in the previous 18 years. However, the Boilermakers made an immediate splash in the second game of his rookie season with a nationally-televised upset of Notre Dame. Tiller would go on to lead the Boilermakers to ten bowl berths in twelve years, most notably the 2001 Rose Bowl. Prior to Tiller's arrival, Purdue had played in only five bowl games, most recently the 1984 Peach Bowl. On September 20, 2008, in a game versus Central Michigan, Tiller won his 85th game at Purdue to become the winningest coach in school history, topping the previous mark set by Jack Mollenkopf (1956–1969).[57] Tiller's \"basketball on grass\" offense was well renowned for its ability to score and score effectively, befuddling opposing defenses. This was especially the case when Drew Brees ran the team from 1997 to 2000. His Purdue squads were shut out only once, by Penn State, in a 12–0 defeat at Ross–Ade Stadium on October 28, 2006., 77331=Purdue did not have a mascot. In 1939, Purdue student Israel Selkowitz suggested the school adopt an official mascot to represent Purdue's engineering heritage. He originally proposed a \"mechanical man\". After much debate, it was decided to build a locomotive on an automobile chassis. This choice allowed the mascot to build on Purdue's engineering and railroading heritage, as well as represent the school's nickname \"Boilermakers\" in a meaningful way., 29187=In the fall of 1893, D. M. Balliet became the head football coach at Purdue. He led the team to a 5–2–1 record in 1893 and 9–1 in 1894. During the 1894 season, Balliet's Purdue squad defeated Amos Alonzo Stagg's Chicago Maroons and outscored opponents by a collective score of 177 to 42.[18][19] His 1895 squad finished with a record of 4–3.[20] In 1897, Balliet was reported to have given up a successful law practice to join the Klondike Gold Rush in Alaska.[21], 62690=On December 5, 2012, it was announced that Darrell Hazell would leave the Kent State Golden Flashes to become the head coach of the Boilermakers for the 2013 season.[66] The Boilermakers started the season with a 42–7 loss to the Cincinnati Bearcats at Nippert Stadium.[67] The following week against Indiana State, Hazell won his first game at Purdue 20–14.[68] After the Boilermakers started 1–2, and Rob Henry continuing to struggle in the team's 4th game, Danny Etling was thrust into a game with Purdue trailing 27–10 to Northern Illinois.[69] Etling finished the game with 241 yards passing while throwing two touchdowns and two interceptions.[70] During the ensuing week, Etling was named the starter for the Boilermakers.[71] With Etling at quarterback, Hazell showed he was playing the 2013 season to gain experience for younger players. The Boilermakers finished the 2013 season 1–11, one of the worst seasons in Purdue history.[72], 147198=Purdue has finished a season ranked in the Associated Press (AP) poll on 17 occasions.[91] The Boilermakers have finished ranked amongst the top 10 in college football on five occasions. Purdue attained its highest-ever ranking in the polls during the preseason of the 1968 season, when they were ranked #1 in the AP Poll for 6 straight weeks before they lost to #4 Ohio State 0-13.[91][92] Since the implementation of the Bowl Championship Series (BCS) in 1998, Purdue has finished the regular season ranked one time in the final BCS standings. While the Boilermakers are 54–175–5 against opponents ranked in the AP Poll, they have an all-time record of 111–65–10 when ranked in the AP Poll themselves.[93], 70949=The Purdue All-American Marching Band is the marching band of Purdue University. The Purdue \"All-American\" Marching Band (AAMB) is the primary source of auxiliary entertainment for Purdue University football games. AAMB does many service performances for high schools, junior high schools, and elementary schools, and has been the host band of the Indianapolis 500 race every year the race has been held since 1927. The band has grown from an original 5 members to 373 members, making it one of the largest marching bands in the world. The two most distinctive features of the AAMB are the World's Largest Drum and solo baton twirler the Purdue Golden Girl., 7357=The Purdue Boilermakers football team represents Purdue University (also referred to as simply \"Purdue\") in the NCAA Football Bowl Subdivision (FBS) of college football. Darrell Hazell is Purdue's current head coach, the 35th in the program's history. Purdue plays its home games at Ross-Ade Stadium on the campus of Purdue University in West Lafayette, Indiana. The Boilermakers compete in the Big Ten Conference as a member of the West Division.[3] Purdue had most recently been a part of the Leaders Division of the Big Ten,[4] but moved to the West Division in 2014 due to conference expansion., 8764=With a 593–526–48 record at the conclusion of the 2013 season, Purdue has the 45th-most victories among NCAA FBS programs.[5] Purdue was originally classified as a Major College school in the 1937 season until 1972. Purdue received Division I classification in 1973, becoming a Division I-A program from 1978 to 2006 and an FBS program from 2006 to the present.[6] The Boilermakers have registered 64 winning seasons in their history, with 19 of those seasons resulting in eight victories or more, 10 seasons resulting in at least nine wins, and one season with ten victories or more.[7] Of those successful campaigns, Purdue has produced five unbeaten seasons in its history, going 4–0 in 1891, 8–0 in 1892, 8–0 in 1929, 7–0–1 in 1932 and 9–0 in 1943.[7] The Boilermakers have won a total of 12 conference championships in their history, including four Indiana Intercollegiate Athletic Association titles and eight Big Ten Conference titles., 52998=Colletto resigned in November 1996.[55], 40092=Mollenkopf is Purdue's all-time leader in Big Ten Conference wins (58) and conference winning percentage (.637). His 84 wins at Purdue placed him first on the school's all-time wins list until Joe Tiller passed him in 2008, and he ranks fourth in overall winning percentage (.670). Mollenkopf's Boilermakers were nationally ranked for 80 weeks, the most under any Purdue head coach, and captured the #1 spot the first five weeks of the 1968 season., 35545=Elmer Burnham served as Purdue's freshman football coach for seven years before assuming the role as varsity head coach in 1942.[26] Burnham's 1943 squad went 9–0 and shared the Big Ten Conference title with Michigan., 41133=Former Purdue player and assistant coach Bob DeMoss was promoted to head coach in 1970.[27] DeMoss inherited a Purdue squad who was loaded at the running back position with Stan Brown, and Otis Armstrong, but the team struggled to find consistency out of its quarterback position.[28] DeMoss resigned following the 1972 season, citing his desire to be with his family more as his reason for stepping down.[29] DeMoss compiled a career college football record of 13–18.[30], 75724=Purdue University is a land-grant university (or Agricultural and Mechanical (A&M) university) created through the Morrill Act of 1862. In the 1890s, Purdue became a leader in the research of railway technology. For many years Purdue operated the \"Schenectady No. 1\", and later the \"Schenectady No. 2\", on a dynamometer in an engineering laboratory on the West Lafayette campus. These were 4-4-0 type steam locomotives manufactured by the Baldwin Locomotive Works of Philadelphia, Pennsylvania. The Schenectady was a classic Victorian-era design similar in construction to the Western and Atlantic Railroad No. 3 (see The General (locomotive) on display at the Southern Museum of Civil War and Locomotive History). Purdue even operated its own railroad to connect the campus to a main rail line. In the 1930s the dynamometer was decommissioned and the Schenectady No. 2 was retired as the railroad industry in the United States converted from steam to diesel-electric locomotives., 60185=Hope's teams would miss out on bowl games in both the 2009 and 2010 seasons. However, the 2011 team was able record a 6-6 overall record and a 4-4 conference record, including a second win against Ohio State in 3 years. The team would end up going to the Little Caesars Pizza Bowl, where they defeated Western Michigan 37-32 to achieve Hope's first winning season at Purdue.[63] Following the season, Burke extended Hope with a two-year contract extension.[59], 99768=In 2002, Purdue changed from its black home jersey to an old gold jersey. The old gold uniforms had white numerals and black outline for home games, and white uniforms with old gold numbers and back outline for away games. Some complained that the numerals on the jersey were too hard to see, so in 2003 they changed to an old gold jersey with black numerals outlined in white, and white pants with two black stripes down the sides. After losing their opening game at home to Bowling Green, Tiller and the team decided to dump the gold jerseys and go back to the black uniforms. After they changed back to the black uniforms, the team came out to Back in Black by AC/DC for every home game in 2003. Since then, Purdue has stayed with the black uniforms. In one game against Wisconsin in 2006, the Boilermakers wore the black jersey with black pants. They hadn't sported an all-black look at home since the last game of the season in 1996 against Indiana. In 2009, Purdue also wore the Black on Black in a night game against Notre Dame on the Purdue Blackout, and then wore them for the remainder of their home games. In 2010, the Black on Black remained the normal home uniform with the exception being the Homecoming game against Minnesota where the team donned Throwback Uniforms for the 2001 Rose Bowl team. While the original jerseys were made by Champion, the replicas were Nike branded., 23687=The Purdue University football team traces its origin back to October 29, 1887 when its team fell to Butler College by a score of 48-6 in Indianapolis, Indiana.[8] A group of students at Purdue University formed the school's first football team in 1887.[9] Albert Berg was hired as the coach. Despite being deaf, Berg was reportedly \"the only man in the territory with any knowledge of the game.\"[10] Berg was 23 years old when he became Purdue's football \"coacher.\"[11] He was paid $1 for each lesson he gave to the newly organized football team and had only one week to prepare the team for its first game.[11][12][13] The 1887 Purdue team played its only game on October 29, 1887, against the Butler College team at Athletic Park in Indianapolis. Butler soundly defeated Berg's squad by a score of 48–6.[14] After the loss to Butler, Purdue did not field a football team again until 1889.[11][12], 30328=Balliet was re-hired as the head coach at Purdue in September 1901.[22] He led the 1901 Purdue team to a 4–4–1 record, but finished the season with consecutive losses to Notre Dame, Illinois, and Northwestern.[23] At the end of the 1901 season, Purdue opted not to renew his services. In March 1902, the Indianapolis News reported, \"He is known to be a good coach, but he turned out a loser last year and Purdue wants a change.\"[24] In four seasons as Purdue's head coach, Balliet compiled a record of 22–10–2.[25], 58962=In his first game as head coach at Purdue in 2009, the Boilermakers won, 52–31, over Toledo.[60] Purdue lost their next five games before upsetting #7 Ohio State, 26–18, at home on October 17.[61] Later during the 2009 season, the Boilermakers won at Michigan for the first time since 1966 with a 38–36 come-from-behind win at The Big House on November 7. It was only the third time in program history that Purdue defeated Ohio State and Michigan in the same season.[62], 26928=In 1890, Clinton L. Hare became the third head football coach at Purdue. He coached the team that season to a record of 3–3. Purdue won each of its two home games in convincing fashion, shutting out Wabash, 54–0, on October 24 and Illinois, 62–0, on November 22. They also shut out DePauw in Greencastle, Indiana, 32–0. Purdue suffered its worst loss of the season on November 1 in Ann Arbor, falling to Michigan by a score of 34 to six. Hare's squad also dropped their season opener in Chicago on October 18 to the Chicago University Football Club, 10–6, and their season finale on November 27 against Hare's former team, Butler, by a score of 12 to 10.[15] With their wins over DePauw and Wabash and their loss to Butler, Purdue tallied a 2–1 mark against their opponents from within the state of Indiana. Hare's team finished second place in the Indiana Intercollegiate Athletic Association to Butler, who beat all three of their in-state foes and was awarded the state championship.[16], 72720=Emrick stayed on as director after his graduation in 1908. In 1921 Emrick commissioned Leedy to construct the World's Largest Drum, and it has been a part of the marching band ever since. In 1935, during a Purdue football game at Northwestern University the band donned lights on their uniforms while performing at halftime. With the stadium lights turned off for the performance, the band drew such awe from radio broadcaster Ted Husing, he referred to them as a \"truly All-American marching band,\" hence the current title of the band., 97499=Purdue's colors are Old Gold and Black, as are its uniforms. Home uniforms are black with white numerals and old gold outline. On the sleeve is the player's number in white, outlined in old gold, along with two outer old gold stripes and a black one inside at the end of the sleeve. The pants are old gold with two black stripes along both sides. The away uniform is white with black numerals and old gold outline. Both home and away jerseys sport the Purdue slant \"P\" logo in the center front of the collar, surrounded by a patch of black fabric. The away pants are black with two old gold stripes. Since the arrival of Joe Tiller in 1997, Purdue players have not worn names on the backs of their jerseys. This is the first year under Danny Hope that the players will wear their names on the backs of their jerseys., 36486=Cecil Isbell started out at Purdue as an assistant coach and took over as head coach in 1944. He coached there for three years with a 14–14–1 record. He was the first Purdue alumnus to the head football coach., 213340=As of June 2015, there are a total of 18 Boilermakers listed on team rosters in the NFL,[113] CFL,[114] and AFL.[115], 57878=Beginning on approximately January 7, 2008, several media outlets reported that Hope had been offered and accepted a coaching position at Purdue where it was expected that he would replace coach Joe Tiller as part of a succession plan.[58], 31812=Purdue bounced around with many different head coaches until 1921, with most having little to no success coaching at Purdue. However Purdue did hire Andy Smith (1913–15) and William Henry Dietz (1921), both of which would go on to become College Football Hall of Fame members.}",
    "lastModified": "Mon, 03 Aug 2015 02:10:22 GMT",
    "textBeforeTable": "Purdue University Boilermakers Head Coaches The Purdue Boilermakers have had 36 head coaches throughout the program's history. With 87 victories, Joe Tiller is first overall in the program's history, followed by Jack Mollenkopf (84 wins) and Noble Kizer (42).[87] Head coaches[edit] [86] Special Teams Coordinator Currently Vacant - Special Teams Coaches Defensive Backs Taver Johnson - Defensive Coordinator Greg Hudson - Linebackers Marcus Freeman - Defensive Line Rubin Carter - Defensive Coaches Running Backs Jafar Williams - Offensive Coordinator/Quarterbacks John Shoop - Wide Receivers Gerad Parker - Tight Ends Terry Malone - Offensive Line Jim Bridge – Offensive Coaches Darrell Hazell Head Coach Darrell Hazell, current head coach at Purdue.",
    "textAfterTable": "Name Seasons Record Leigh C. Turner 1907 0–5 Frederick A. Speik 1908–09 6–8 Bill Horr 1910–12 8–11–3 Andy Smith 1913–15 12–6–3 Cleo A. O'Donnell 1916–17 5–8–1 A. G. Scanlon 1918–20 7–12–1 William Henry Dietz 1921 1–6 James Phelan 1922–29 35–22–5 Noble Kizer 1930–36 42–13–3 Mal Elward 1937–41 16–18–6 Elmer Burnham 1942–43 10–8 Cecil Isbell 1944–45 14–14–1 Name Seasons Record Stu Holcomb 1946–55",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}