{
    "relation": [
        [
            "Job Title",
            "QA Tester",
            "Marketing Assistant/Graphic Designer",
            "Shipping/Receiving/Stockroom I - 830am - 5pm schedule",
            "I.T. Software Engineer, VB C# ASP.net Web Applications Developer - Strong DB skills preferred - Applications and Database Analysis Optimization",
            "Systems QA Analyst 4"
        ],
        [
            "Location",
            "Baltimore, MD",
            "Williamsville, NY",
            "Danville, IL",
            "Danville, IL",
            "San Francisco, CA"
        ]
    ],
    "pageTitle": "Technical Support - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/technical-support/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 622957807,
    "recordOffset": 622819358,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{245623=Green Mountain Coffee Roasters - One of the more interesting success stories in the coffee business is Green Mountain Coffee Roasters, which started as a small coffee shop in 1981., 152105=Trek - Trek is based in Waterloo, WI and has been pursuing a mission to “build the best bikes in the world” since they were founded in 1976., 322112=Copyright © 2007-2013 One Day, One Job. All rights reserved., 169226=The Trust for Public Land - The Trust for Public Land is a San Francisco, CA based org that was “founded in 1972 with goals of protecting land in and around cities and pioneering.\", 91204=Rand McNally - Rand McNally is a Skokie, IL based company that was founded in 1856. Since then they’ve been specializing “in maps, navigation, road travel, and trip planning.”}",
    "textBeforeTable": "web development video games television technical support software development mobile Massachusetts game design engineering customer service all employers See the complete Disruptor Beam profile Disruptor Beam - Disruptor Beam is a Framingham, MA based company that is aiming “to create the most fan-centric game company in the world.” Companies with Entry Level Jobs and Internships in Technical Support Systems Administration Software Development Engineering Customer Service Careers Related to Technical Support Women Tech Council Technology Network Bay Area IT / Tech Support Professionals QA & Technical Support Engineers Networking Opportunities Inside Tech Support Dennis Snow CustomerThink Blogs and Websites @Lotus_Support @MicrosoftHelps Key Folks to Follow on Twitter Ace the IT Interview by Paula Moreira Careers in Computer Support Required Reading If technical support still sounds like your cup of tea, here are a few things you should do to get started. Technical Support Resources To be a Technical",
    "textAfterTable": "Blinds.com - Blinds.com is a Houston, TX based company that is “the world’s largest online window covering store.” See the complete Blinds.com profile all employers analyst customer service data design information technology interior design sales technical support Texas Job Title Location UX Designer (Mobile Experience) Houston, TX Design Assistant Houston, TX Customer Service Representative Houston, TX Accountant Houston, TX Sr. Recruiter Houston, TX See all 10 job postings Xamarin - Xamarin is a San Francisco, CA based company allows developers to write “apps entirely in C#, sharing the same code on iOS, Android, Windows and Mac.” See the complete Xamarin profile all employers",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}