{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I have never experienced any safety issues while attending Keiser University.",
            "Students that work full-time or Part-time. Career oriented students. Military and long distance students. Students of all ages and returning students that took a break from college.",
            "Exceptional school for the tuition prices. Keiser University is well worth the money for all the work and resources they provide to make sure every student is progressing.",
            "Join a club and find ways to better the campus!",
            "To sum it up in one word, Amazing! Keiser Culinary Arts program provides the students with outstanding treats! Vending machines on campus if you need a snack.",
            "I attend a Keiser University that does not have a dorm.",
            "The classes are challenging,but the professors are dedicated to provide assistance during and after class to assist the students. The academics at Keiser University prepares the students for real life situations. Keiser academics are strongly integrated to provide each student with a challenge that forces one to tap into their creativity, problem solving, and networking skills.",
            "Be prepared to learn! Utilize all resources provided through the school. Communication is the key to your success at Keiser University.",
            "Excellent resources provided to help the student achieve goals. Highly trained and dedicated faculty that ensures a safe and effective learning environment. A university that is tailored to your lifestyle to help you succeed."
        ]
    ],
    "pageTitle": "Keiser University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Keiser-University/reviews?_escaped_fragment_=/show/28190",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00283-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 908287599,
    "recordOffset": 908208619,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{526722=© 2015, Cappex.com, LLC, 352072=May be pricey but they help you find funding and assist in finding work. out of pocket expenses are different for each person., 336028=I will see when I start in June., 400192=OK SO THIS ISN'T LIKE YOUR RUN OF THE MILL COMMUNITY COLLEGE. THIS IS A PRIVATE INSTITUTION. THE COST FOR TUITION IS SUPER EXPENSIVE EVEN IF YOU QUALIFY TO RECEIVE FINANCIAL AID AND STUDENT LOANS. IT COST NEARLY $2000 PER CLASS. SO THIS IS A MOTIVATING FORCE TO TRY YOUR HARDEST TO PASS EACH CLASS. WHO CAN AFFORD TO JUST THROW AROUND A COUPLE OF GRAND?, 466883=I walked into Keiser University recently in December of 2013, having a wishful dream to attend their IT program; the best IT program in the U.S. With their support and encouragement they had me believing this dream Ã?Â¢Ã?Â?Ã?Â?as mineÃ?Â¢Ã?Â?Ã?Â?, Ã?Â¢Ã?Â?Ã?Â?belonging to meÃ?Â¢Ã?Â?Ã?Â? and Ã?Â¢Ã?Â?Ã?Â?already in my possessionÃ?Â¢Ã?Â?Ã?Â?. I have just completed my first monthly PC course and thank them for a dream come true., 296696=Classes start February 4!, 138014=Excellent. They helped me through the TEAS test process and I am scheduled to meet with financial aid in July. Everybody there has been very supportive and helpful., 207859=I have been a student here since 1990. I am working on my 4th degree. I love this school.}",
    "textBeforeTable": "02/10/2011 Reviewer is A past student here. 7 out of 7 people found this review useful. 1 of 144 lucy from opalocka, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code",
    "textAfterTable": "Bang for the buck The tuition at Keiser is somewhat expensive but I definitely feel that it will be worth it. Am enjoying being here I believe I will enjoy being a student at this university. I feel honored that they have accepted me to be apart of their family. Am learning a lot Actually I have just recently been accepted to Keiser University but as I can tell so far the university staff are highly educated and very effective in helping their students acquire their goals. I am looking forward to the experience of attending Keiser University. Login to rate or flag the reviews Laura from Jacksonville, FL 10/24/2011 Reviewer is A past student here. 3 out of 3 people found this review useful. 3 of 144 Categories Comments Bang for the buck A bit pricey.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}