{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus of Macomb is protecetd by an armed security force who protect students needs. I have not heard of any crime being perpetrated upon any student in my time their. The college also uses the campus to train students in the Law-Enforcement curriculum. The campus is very safe.",
            "Their are numerous Greek Clubs that are present on the campus and always looking for new members. Just keep your G.P.A. at or above a 3.0 and you can apply for the one that best suits your social needs.",
            "Macomb has a Track Team, Basketball Team, Cross Country Team, Swimming Team, as well as a Debate Team.",
            "Technical, Culinary, Nursing",
            "Once a year at the K building, the Student Activities Committee hosts a Talent Show that is open to all student and all variety of Talent. It's Macomb's very own rendition of America's Got Talent. Students fill the auditorium up every year to support and cheer for their fellow companions. It's always a wonderful time for the students and staff.",
            "You definitely get more bang for the buck at this community college. Their technical and culinary programs work in cohesion with the industry leaders of their perspective fields. The Automotive Technician Program for example works side by side with General Motors to turn out the next generation of engineers and technicians with hands on experience and lectures and seminars given by representatives. As a result students who successfully complete the program often are hired by the corporation.",
            "For fun check out the infamous K building where students gather for discussions, gaming, and dining. If you require more activity in your leisure time, then the J building should satisfy all of your physical fitness needs. You can try the Olympic track or the Olympic swimming pool, or shoot some hoops in the gymnasium. The staff at Macomb definitely considered the stress levels of studies and have proovided adequate reliefs.",
            "The food is great and not that expensive. It is prepared by a host of chefs and line cooks from Macomb's world renowned Culinary Arts Program.",
            "There are not any dorms that I have Knowledge of.",
            "The professors really take their time to make sure that you get the information. Class sizes are small which allow the staff to work with a student who may be falling behind. The classes are designed so that at the end of each semester, students are definitely able to retain the information that they have been studying.",
            "Have great study habits. Be prepared to work with and learn from professors of all types of backgrounds. Treat the curriculum of your choice as if you were at a four year university and not a community college.",
            "Macomb Community College has great technical programs that can prepare students for advanced studies in the technical program that they are focused on. Macomb Community College offers a diverse experience for students which complements the fundamental belief of America being a place where all nationalities can study and learn from each other. Macomb Community College also offer affordable tuition, and a faculty of experieced professors who get students ready for their careers or for furthering their educational goals."
        ]
    ],
    "pageTitle": "Macomb Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Macomb-Community-College/reviews?_escaped_fragment_=/show/87516",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00032-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896807547,
    "recordOffset": 896746563,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{70665=The student center has changed since I went there my freshmen year and I liked it better then, than I do now. I'm sure I havent seen everything, but I prefered the older set up they had in 2006., 224594=One thing I love about Macomb is the Student life activities that the school offers. Some of the great activities that i have done through this program include DYI cupcakes. That activity allowed us to bake and decorate our own cupcakes. During the month of December in spirit of Christmas they allow us to construct our own Gingerbread houses. The gingerbread houses were a blast not to mention messy., 331616=© 2015, Cappex.com, LLC, 68581=I use to love the student center but as far as I have seen with the new changes there doesn't seem to be great opportunitys. I just see students sitting around talking, when back in 2006 there were pool tables, foozball, food court, ping pong, etc. If they do still have those things then I have no idea where it was moved to.}",
    "textBeforeTable": "10/02/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 79 Nathan from Ira Twp, MI Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am learning a lot You really learn a lot at college, just remember to study what you have learned occasionally. Login to rate or flag the reviews Kayleigh from Clinton Township, MI 07/12/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 79 Categories Comments Great for these types of students Macomb isn't specifically for a single type of person. It's a cheaper alternative to a larger university, the only thing it lacks is the personal dorm rooms. Macomb welcomes great diversity! Tips for prospective students I suggest you get referrals for teachers, either from friends or counselors. Also leave early, (not just the first day) depending on what lot your in, it can be very time consuming to find a spot-especially in winter. Register as early as possible, join a waitlist if need be, your chances are good. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}