{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Catalyst",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 7 am"
        ]
    ],
    "pageTitle": "The Age - Business, World & Breaking News | Melbourne, Australia",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.theage.com.au/am/2013/01/21/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 735985559,
    "recordOffset": 735916681,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100480=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 123331=January 26: Australia Day isn't just about the Skyworks on the river., 126258=January 28: Some say rock icons, others say music gods– the Big Day Out is booked for their stop in Oz., 265460=January 18 2013, 127296=January 31: Acclaimed UK artist and former Pulp member brings his tour to Perth's Rosemount Hotel., 245827=1000 views, 252688=gemini1945, Jan 21, 2013, 2:14AM, 125296=January 23: Weezer are bringing their Blue Album to the Perth Arena., 21431=BEN GRUBB Vodafone backs down on changes that would have made some of its prepaid customers' data quota vanish quicker than usual from February 13 after customers \"expressed concern\" about them., 124358=January 26: One lucky person will set off the fireworks at Ashfield Reserve's celebrations., 251829=Jeff, Jan 21, 2013, 2:25AM, 77973=A special presentation of stories from the devastating 2003 bushfires.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: If nothing else, this will make you a lot more careful. Seconds From Disaster What's on TV Tonight One of Disney.Pixar’s most beloved films ever returns to the big screen. Win 'Monsters, Inc' prize packs Competition We've done the legwork to help you decide which shows to see. Line up your laughs Brisbane Comedy Festival Brisbane TV show looking for energetic kids. The handball's in your court The Illusionists keep you watching closely.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Catalyst 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Catalyst 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}