{
    "relation": [
        [
            "Patent application number",
            "20090030916",
            "20090222435"
        ],
        [
            "Description",
            "LOCAL COMPUTATION OF RANK CONTRIBUTIONS - The claimed subject matter relates to an architecture that can identify, store, and/or output local contributions to a rank of a vertex in a directed graph. The architecture can receive a directed graph and a parameter, and examine a local subset of vertices (e.g., local to a given vertex) in order to determine a local supporting set. The local supporting set can include a local set of vertices that each contributes a minimum fraction of the parameter to a rank of the vertex. The local supporting set can be the basis for an estimate of the supporting set and/or rank of the vertex for the entire graph and can be employed as a means for detecting link or web spam as well as other influence-based social network applications.",
            "LOCALLY COMPUTABLE SPAM DETECTION FEATURES AND ROBUST PAGERANK - The claimed subject matter provides a system and/or a method that facilitates reducing spam in search results. An interface can obtain web graph information that represents a web of pages. A spam detection component can determines one or more features based at least in part on the web graph information. The one or more features can provide indications that a particular page of the web graph is spam. In addition, a robust rank component is provided that limits amount of contribution a single page can provide to the target page."
        ],
        [
            "Published",
            "01-29-2009",
            "09-03-2009"
        ]
    ],
    "pageTitle": "Teng, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/teng-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 444501767,
    "recordOffset": 444477116,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Shang-Hua Teng, Somerville, MA US 10-18-2012 Locating Bottleneck Threads in Multi-Thread Applications - A method for identifying a consumer-producer pattern in a multi-threaded application includes obtaining synchronization event data of the multi-threaded application, and identifying the consumer-producer communication pattern from the synchronization event data. 20120265968 Published Description Patent application number Qi Ming Teng US 06-14-2012 CELL FOR PREPARING COMPETENT CELL, METHOD FOR PREPARING COMPETENT CELL AND BACTERIAL STRAIN OF ESCHERICHIA COLI - The invention provides a cell for preparing competent cells, wherein the cell is capable of spontaneously accumulating self-producing trehalose therein and the cell is used for the preparation of competent cells. The invention also provides a method for preparing competent cells, including: culturing the cell for preparing the competent cell mentioned previously to obtain a cell suspension; placing the cell suspension into an ice bath; centrifuging the cell suspension to obtain a cell precipitate; mixing a transform reagent with the cell precipitate; and obtaining competent cells suspension. 20120149090 Published Description Patent application number Kelly Teng US 11-04-2010 CONTEXTUAL SOCIAL NETWORK BASED ON THE SEMANTIC WEB - A social network built around objects viewed over the Internet. A user interacts with a web page presenting a recognizable object (for example, a book, a restaurant or a stock quote). A plug-in in the user's browser extracts information from the web page, creates an identifier",
    "textAfterTable": "Stephanie Teng, Seattle, WA US Patent application number Description Published 20090055415 DYNAMIC AND VERSATILE NOTEPAD - Method for providing a versatile notepad for social networking and interactions with a plurality of users. An input content is received from a user. The received input content is analyzed based on at least the following expression types: expression indicative of time, expression indicative of a location, expression indicative of a statement, expression indicative of an individual, an expression indicative of a list, and a combination of expressions indicative the time, the location, the statement, the list, and the individual. The analyzed information is dynamically converted to a communication object as a function of the expression types. The communication object is rendered to the user. 02-26-2009 20110029923 INTEGRATING TRANSPORT MODES INTO A COMMUNICATION STREAM - Integrating multiple transport modes into a single communication stream on a computing device such as a mobile computing device. One or more recipients and one or more transport modes available for communication with the one or more recipients are provided to a user. An application program executing on the computing device receives a first message from the user to send to one or more selected recipients. The computing device transmits the received first message to the selected recipients via a first transport mode. Thereafter, the computing device receives a second message from one of the recipients via a second transport mode. The received second message is displayed",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}