{
    "relation": [
        [
            "",
            "Hip Strengthening Then Combined Exercises",
            "Quadricep Group Then Combined Exercises"
        ],
        [
            "Description",
            "Performed hip strengthening exercises for 4 weeks prior to crossing over to a combined hip and quadricep rehabilitation program",
            "Performed quadricep strengthening exercises for 4 weeks prior to crossing over to a combined hip and quadricep rehabilitation program"
        ]
    ],
    "pageTitle": "Comparing Rehabilitation Programs for Patellofemoral Pain Syndrome - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00445224?sect=X0125&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00266-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 869545935,
    "recordOffset": 869530537,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Reporting Groups Subjects were evaluated for PFPS using the following:(1)anterior knee pain reported during at least 2 activities: stair climbing, running, squatting, kneeling, and prolonged sitting;(2)insidious onset of symptoms ;(3)pain with compression of the patella; and(4)pain on palpation of patellar facets. Only three patients were excluded during study. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details 33 females with anterior knee pain (PFPS) volunteered to participate in this study. Enrollment began August 2007 and last subject was enrolled in August 2009. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Procedure: Therapeutic Exercise Intervention: Patellofemoral Pain Syndrome Condition:",
    "textAfterTable": "Participant Flow for 2 periods Period 1:   Specific Exercises     Hip Strengthening Then Combined Exercises     Quadricep Group Then Combined Exercises   STARTED     17     16   Baseline     17     16   4 Weeks     14 [1]   13 [1] COMPLETED     13 [2]   13 [2] NOT COMPLETED     4     3   Withdrawal by Subject                 3          ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}