{
    "relation": [
        [
            "",
            "(in thousands of dollars)",
            "Selling, general and administrative expenses",
            "Recovery of selling, general and administration",
            "Total"
        ],
        [
            "",
            "Six Months Ended February 28 2006",
            "$ 2,691",
            "-",
            "$ 2,691"
        ],
        [
            "",
            "Six Months Ended February 28 2005",
            "$ 1,772",
            "149",
            "$ 1,623"
        ],
        [
            "",
            "Change",
            "$ 909",
            "149",
            "$ 1,058"
        ]
    ],
    "pageTitle": "DC Filing Services Canada Inc. 403-717-3898",
    "title": "",
    "url": "http://www.wikinvest.com/stock/Peace_Arch_Entertainment_Group_(PAE)/Filing/6-K/2006/F5433995",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00020-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 827862411,
    "recordOffset": 827781915,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{179594=February, 28, 157314=April 13, 2006, 214737=Gross Profit.  Gross profit is comprised of revenue less amortization of film and television programming and other production costs. Gross profit for the six months ended February 28, 2006 was $1.4 million compared to $0.8 million for the comparable period in the prior year.  , 245691=On December 30, 2005, 1,435,897 Series II Preference Share warrants were exercised at a subscription price of US$0.50 per share for total proceeds of US$ 717,948., 160486=Vancouver Office - 1710 Columbia Street, 2nd Floor, Vancouver, BC V5Y 3C6 Tel: (604) 681-9308 Fax: (604) 688-3977, 520345=Pursuant to the conversion instrument, 336,000 Common Shares, which represent the number of shares that could be issued for the obligation of US$1,075,000, had previously been reserved for issuance. At February 28, 2006 and August 31, 2005 the obligation to Comerica is valued at $142,000., 254445=During the six months ended February 28, 2006, the Company paid $95,000 (2005 - $90,000) to a company controlled by a shareholder, director and officer of the Company   for executive services rendered. These expenditures are reflected in the Company's selling, general and administrative expenses., 437969= 2005, 513006=Pursuant to the reorganization, the Company's wholly owned subsidiary PAPDC became the owner of substantially all of the assets and business (collectively, the pre-existing assets) that the Company owned immediately prior to January 20, 2003, the date of the reorganization. The pre-existing assets consisted principally of accounts and loans receivable, film and television programming rights, and all shares and other securities (including intercompany loans) held by the Company in its subsidiaries existing at January 20, 2003., 150289=This form shall be used by foreign private issuers which are required to furnish reports pursuant to Rule 13a-16 or 15d-16 under the Securities Exchange Act of 1934., 368047=February 28, 158547=I hereby confirm that the unaudited Consolidated Financial Statements and the Management Discussion and Analysis for the results for six months ended February 28, 2006 were sent by first class mail to the registered shareholders and the shareholders of the supplemental mailing list of Peace Arch Entertainment Group Inc. on the above date., 231846=2005, 212896=Motion Picture revenue for the period ended February 28, 2006 was $1.2 million representing a decrease of $2.2 million, or a 64% decrease compared to revenue of $3.4 million for the comparable period in fiscal 2005. The decrease in revenues primarily reflects the lower number of projects produced by Peace Arch and is associated with the Company's strategy to prioritize the packaging, financing, and distribution of projects.  This strategy results in lower presale revenues at the time a project is completed and delivered. During the six months ended February 28, 2006, the Company did not take delivery of any motion pictures. The revenues for the six month period arose from sales of distribution rights on programs completed and delivered in prior years., 521965=Subsequent to the reorganization of PAPDC described in note 11(a), on August 1, 2003, the Company sold all of its shares in PAPDC for nominal consideration. During the year ended August 31, 2003, the operating results of PAPDC were included in the consolidated financial statements until the date of the disposal., 246207=As at February 28, 2006, the Company had available cash or cash equivalents of $0.7 million.  The Company borrows funds from banks and other financial institutions to finance the costs of production which are generally incurred in advance of contracted receipts and revenues from these programs. The Company typically finances the capitalized costs of its proprietary film and television programming through presales from customers, borrowings from bank facilities for individual production financing, government tax incentives, contributions from co-producers and working capital deployed as interim financing to contracted receipts. In the past, the Company has also funded capital requirements through the issuance of shares, warrants and debt.  The Company has a term loan and a letter of credit provided by a financial institution due on July 30, 2006.  Upon mutual agreement between the Company and the lender, the financing may be extended for a period of six months.  The Company is currently identifying various financing alternatives to enable the timely discharge of the Company's obligations.  Management will work toward funding capital requirements through the issuance of shares, warrants and debt, but there is no assurance that the Company will be successful in its financing efforts or the extension granted., 611915=2009, 423986=operating results of Peace Arch Project Development Corp. (\"PAPDC\"). As described in note 11(a),   PAPDC is the owner of the Company's assets and business in existence prior to the reorganization and   rationalization of its assets, operations and subsidiaries. Following the sale of PAPDC to a third party as   described in note 12 the Company continued to have a variable interest in PAPDC, and it had been   determined that the Company was required to absorb the majority of the expected losses of PAPDC. Under   the rules governing AcG-15, the Company was considered the primary beneficiary of PAPDC and   consequently the Company consolidated PAPDC on a retroactive basis effective December 1, 2004,   without restatement of prior periods., 619541=February 28, 474612=Of the loans outstanding there is $15,197,000 (August 31, 2005 - $8,498,000) denominated in United States dollars. Loans from various banks bear interest at rates ranging from the respective bank's United States dollar base lending rate or the LIBOR rate plus 1% to plus 3.75%. The Company has several loans outstanding from other parties which bear interest at the rate of 0% to 1.5% per month of the principal balance outstanding plus a premium payable at date of repayment. Loans denominated in Canadian dollars bear interest at rates ranging from the Canadian Imperial Bank of Commerce's prime lending rate plus 1% to plus 2% or the Royal Bank's prime lending rate plus 2%., 255679=As at February 28, 2006, the Company was owed $nil (2005 - $167,000) from a company controlled by a shareholder, director and officer of the Company. This amount   is included in accounts and other receivables., 551396=The Company has recorded stock compensation expense for the stock options granted to employees in the amount of $243,000 in selling, general and administrative expenses in the six months ended February 28,   2006 (2005 - $220,000). The Company incurred stock based compensation of $17,000 which was included   as part of the purchase price of kaBOOM as described in note 9. The fair value of each stock option was   estimated on the date of vesting using the Black-Scholes option pricing model with the following   assumptions:, 556972=On December 30, 2005, 1,435,897 Series II Preference Share warrants were exercised at a subscription price of US $0.50 per share for total proceeds of US $717,948., 519234=The Company issued a conversion instrument to Fremantle which permitted Fremantle to convert the amount of its outstanding debt including unpaid accrued interest at December 31, 2004, if any, into Common Shares of the Company for a period of 90 days commencing on December 31, 2004. On March 31, 2005 Fremantle agreed to convert its $8,793,000 note plus interest for 2,931,125 shares of the Company's common stock., 445467=August 31, 2005, 419833=Restatement of the Three Months Ended February 28, 2005, 609183=2006, 659900=During the six months ended February 28, 2006, the Company paid $95,000 (2005 - $90,000) to a company controlled by a shareholder, director and officer of the Company for executive services rendered. These expenditures are reflected in the Company's selling, general and administrative expenses., 259490=As at February 28, 2006, the Company's financial instruments included cash and cash equivalents, restricted term deposits, accounts and other receivables, corporate loan, production loans, revenue guarantee obligation, business acquisition obligation and accounts payable and accrued liabilities. The carrying values of the restricted term deposits and the revenue guarantee obligations approximate fair value as the interest rates are reflective of current market rates as at February 28, 2006. The carrying value of the business acquisition obligation to issue shares reflects fair value as it is reported at the fair value of the shares at February 28, 2006. The carrying value of the remaining financial instruments approximated their fair value due to their ability for prompt liquidation or short term to maturity., 228166=Other Amortization.   For the six months ended February 28, 2006, other amortization consisting of amortization of property and equipment and amortization of intangible assets amounted to $90,000 compared to $27,000 for the comparable period of the prior year, representing a $63,000 increase. This increase is due primarily to amortization of $45,000 for intangible assets. In the comparable period of fiscal 2005, the Company did not have amortization related to intangible assets., 444764=February 28, 2006, 160716=Los Angeles Office - 228 Main Street, Suite 14, Venice, CA 90291 Tel: (310) 450-1711 Fax: (310) 581-8040, 601139=On October 2, 2001, the Company initiated an action against Viacom, Inc., MTV Networks, VH1 Music First et al in British Columbia Supreme Court for damages in the amount of US$2,750,000 and consequential damages arising from the Defendants' failure to honour a contract for the co-financing of the television series Big Sound. During the year ended August 31, 2003, the subsidiary which initiated the action was sold as described in note 11. During the year ended August 31, 2005 the subsidiary was reacquired as part of the acquisition of PAPDC (see note 12)., 177923=On March 31, 2005, Fremantle agreed to convert its $8,793,000 note plus interest for 2,931,125 shares of the Company's common stock.  As a result of Fremantle's conversion the Company has recognized a gain on settlement of the obligation to issue shares of $1,105,000 representing the difference between the carrying amount of the obligation and the price of the Company's stock on the date of settlement., 618383=Selected information for the Company's operating segments for the three months and six months ended February 28, 2006 and February 28, 2005, net of intercompany amounts, is as follows:, 282391=2005, 231288=February, 232363=May 31,, 523868=PAPDC was considered a VIE under AcG-15 and was therefore consolidated from December 1, 2004 as described in note 2. On consolidation, the distribution obligation and associated distribution rights to all the film and television programming rights, as described above, were eliminated, as the liability to Fremantle and Comerica was also recorded within PAPDC and the investment in film balance existed in PAPDC. The Company then applied the purchase method to include PAPDC's assets, liabilities and retained earnings in its consolidated financial statements. The Company consolidated an investment in film and television balance of $1,681,000, accounts payable and accrued liabilities of $474,000 and the liability to Fremantle of $1,467,000., 515135=Effective January 30, 2003, the Company and Fremantle agreed to restructure the remaining $7,580,000 of term loan due to Fremantle. Fremantle agreed that the revised source of debt repayments and security would be restricted to the business, assets, and undertakings of the Company as they existed immediately prior to January 30, 2003 (the pre-existing assets), that date being the closing of the acquisition and financing transactions described elsewhere in this note. The new debt had no fixed repayment dates. Interest, which continued to accrue at 10% per annum, and principal were payable from the income, 191768=Television revenue for the period ended February 28, 2006 was $0.7 million representing a decrease of $0.6 million from $1.3 million for the comparable period of the prior year or a 46% decrease compared to the same period of the prior year. The decrease is mainly attributable to the recognition on 13 episodes of a television series during the quarter compared to revenue recognized on 26 episodes of two television series in the comparable period of the prior year., 485478=At August 31, 2002, the Company continued to occupy the second property through an operating lease arrangement. As the present value of the minimum lease payments was greater than the gain on the sale of $523,000, the gain was deferred and amortized over the four-year minimum lease term. During the year ended August 31, 2003, the Company amortized $127,000 of the deferred gain prior to disposal of the subsidiary in which the gain was recorded (PAPDC)., 437436=2006, 245208=On January 23, 2006, in connection with the acquisition of kaBOOM, the Company issued 1,764,118 common shares of the Company for proceeds of $0.8 million, net of issuance costs. The value of the common shares issued was $0.44 or $0.48, which was based on and determined by the average of the Company's common stock trading price for the 10 day period prior to the date of acquisition., 179654=2006, 250861=Production loan repayments are solely due from cash flows derived from each film and is independently secured by a charge over all the assets of the production subsidiary and the exploitation rights, tax credits and subsidies associated with each film.  Management expects that a significant portion of the loans due at February 28, 2006 will be payable over the next year.  The Company has total loan and credit facilities of $11.4 million which are due for annual renewal in the current fiscal year.  The Company obtained extensions in the past since the timing of collection of receipts and revenue streams may extend beyond the original estimated date.  Management seeks renewals and extensions of the individual production loan facilities and is confident that such an agreement will be achievable.  However, there is no assurance the Company will be successful.  , 661159=As at February 28, 2006, the Company was owed $nil (2005 - $167,000) from a company controlled by a shareholder, director and officer of the Company. This amount is included in accounts and other receivables., 184797=During fiscal 2005, the Company adopted AcG-15, Consolidation of Variable Interest Entities, as more fully described in note 2 of our consolidated financial statements. This change in accounting policy was applied on a retroactive basis effective December 1, 2004 without restatement of prior periods. This resulted in a cumulative increase of the Company's deficit in the amount of $53,000., 187417=Three Months Ended February 28,, 203922=Interest Income.   Interest income was $0.2 million for the three months ended February 28, 2006, compared to $0.3 million for the same period of the prior year.  Interest revenue represents interest earned on the Restricted Term Deposit. This interest revenue is offset by interest expense of the same amount recorded in respect of the Film Financing Obligation., 186442=Revenue. The Company reported revenue of $3.7 million for the three month period ended February 28, 2006 compared to $1.7 million for the comparable period in fiscal 2005 representing an increase of $2.0 million or 118% increase compared to the same period of the prior year. The following table presents revenues earned for each of our business segments;, 187936=2006, 368714=2006, 241950=During the year ended August 31, 2005, the Company identified a required revision to its second quarter February 28, 2005 financial statements related to its accounting treatment of a complex arrangement with Showtime for the project \"Our Fathers.\"  We have determined the arrangement was in the nature of a co-financing relationship where both parties contributed financially to the production.  Under GAAP, the co-financier's contribution to the project is considered a reduction of the film's negative costs.  Previously, the co-financier's contribution to the production was recognized as revenue by the Company from sale of rights.  The cost of the Company's investment in its film assets is similarly reduced., 270018=Additional financial information is provided in the Company's consolidated financial statements for its 2005 fiscal year and the Six Months ended February 28, 2006., 185739=For the three months ended February 28, 2006, the Company has reported a loss of $0.7 million or $0.04 diluted loss per share compared to a loss of $0.5 million for the comparable period in fiscal 2005 or $0.03 diluted loss per share., 326211=February 28, 221351=Selling, General and Administrative Expense.  Selling, general and administrative expense increased by $1.1 million, or 65.2%, to $2.7 million for the six months ended February 28, 2006 from $1.6 million for the comparable period in the prior year. This increase was mainly due to additional costs associated with the new home entertainment business that has been incurred from the date of the kaBOOM acquisition compared to the comparable period of the prior year. During the six months ended February 28, 2006 there was no recovery of selling, general and administrative expenses as the time period over which the Company was entitled to recover such expenses associated with managing certain assets to realize cashflows to retire the Fremantle debt had ended in fiscal 2005. The following table presents the comparative net selling, general and administrative costs for the last two comparable periods;  , 177247=I Preference Share and one Series II Preference Share warrant for proceeds of $2,349,000 or US$0.46 per Unit. Each warrant, upon exercise, entitles the holder to acquire one Series II Preference Share at a price of US$ 0.50 at any time up to July 29, 2009. Each Series I and Series II Preference Share is convertible into one Common Share of the Company. Each outstanding Series I and II Preference Share pays a 10% cumulative dividend on a quarterly basis. At August 31, 2005 all the Series II Preference Share warrants remained outstanding., 231673=November, 489130=On January 23, 2006, the Company acquired 100% of the issued and outstanding shares of kaBOOM! Entertainment Inc. (kaBOOM), a home entertainment studio in Canada that distributes videocassettes, digital video discs and ancillary merchandise to retailers and mass merchandisers in Canada.   The cost of the purchase was $7,127,000 consisting of 1,033, 058 common shares of the Company valued at $500,000, 50,000 options of the Company valued at $17,000, cash consideration of $3,000,000, future cash consideration of $3,202,000 and direct costs of the acquisition of $408,000.  The fair value of the common shares issued of $0.48 per share was determined based on the date the transaction was announced as having been completed.  The options, which are fully vested, entitle the holder to acquire shares of the Company at an exercise price of $0.41.   The agreement provides for payment of a maximum additional consideration of $1,000,000 based on kaBOOM's achieving certain results of operations for the twelve months ending April 30, 2006.  The additional consideration, if any, will be recognized when the results of operations for the twelve months ending April 30, 2006 have been determined and the additional consideration becomes payable.  Any additional consideration paid will be included as a cost of the purchase, resulting in additional goodwill.  The future cash consideration of $3,202,000 will be due when the final determination of any contingent consideration due has been made. The obligations to settle the future cash consideration and any contingent consideration are supported by letters of credit amounting to $4,202,000 which have been provided by a financial institution and certain of the preferred shareholders. Any portion of the letters of credit drawn would result in a loan payable by the Company to those parties providing the letters of credit.  The loan resulting from the drawdown of the financial institution letter of credit would bear interest at 12% per annum and be due on July 30, 2006.  Any loan resulting from the drawdown of the letters of credit provided by the preferred shareholders would bear interest at the prime rate plus 12% per annum and be due on demand.  The letter of credit from the financial institution and a portion of the letters of credit available from the preferred shareholders totalling $2,401,000 are available to be drawn at any time to July 30, 2006.  The remaining $1,801,000 letters of credit are available to be drawn on or after June 15, 2006.  In addition, the financial institution provided financing of $3,500,000 as described further in note 5.   In conjunction with the provision of financing described in the preceding paragraph, the Company incurred aggregate costs of $716,000 consisting of 731,060 common shares with a fair value of $325,000 issued to the financial institution, $108,000 which is payable in cash or common shares issuable to the preferred shareholders at the option of the Company and other fees and costs payable in cash of $283,000.  These costs will be amortized over the term of the loan and lines of credit. The Company also paid certain share issuance costs amounting to $25,000 which have been charged to capital stock. The acquisition of kaBOOM has been accounted for by the purchase method and the results of operations of kaBOOM have been included since January 23, 2006.  The preliminary allocation of the cost of the purchase, 413253=On July 29, 2005 the Company completed a private placement of 4,347,827 Preference Share Units of the Company for US$2 million. On December 30, 2005 1,435,897 of the Series II Preference Share warrants were exercised for total proceeds of US$717,948, which were used by the Company to fund working capital requirements and for general corporate purposes., 469742=February 28, 2006, 271886=1. I have reviewed the interim filings (as this term is defined in Multilateral Instrument 52-109 Certification of Disclosure in Issuers' Annual and Interim Filings) of Peace Arch Entertainment Group Inc., (the issuer) for the interim period ending February 28, 2006;, 244150=Quarterly net earnings (loss) have varied due to one time events that occurred during the third quarter of fiscal 2005 arising from the recognition of a one time $2.1 million gain on the settlement of obligations as described in note 11 of the August 31, 2005 consolidated financial statements., 524786=Pursuant to the original arrangements with PAPDC set out in note 11(a), the Company was obligated to carry out management services for PAPDC. This obligation continued until June 25, 2004. During the six months ended February 28, 2006, the Company recovered costs against the payable to Fremantle of $nil (2005 - $149,000)., 274507=Date: April 13, 2006, 640771=February 28, 2006, 204428=Interest Expense.   Interest expense was $0.7 million for the three months ended February 28, 2006, representing an increase of $0.3 million from $0.4 million for the same period of the prior year.  The increase is due to interest on outstanding production loans for projects produced and delivered in prior years which is no longer capitalized to the cost of the productions.  Interest expense also includes interest of $0.1 million on the deferred financing costs related to the kaBOOM acquisition.  Interest expense includes interest incurred on the Film Financing Obligation. This interest expense was offset by interest revenue of the same amount recorded in respect of the Restricted Term Deposit., 198436=Amortization.  Amortization for the three months ended February 28, 2006 was higher than the same comparable period.  Amortization was $2.4 million for the three months ended February 28, 2006 compared to $1.1 million for the three months ended February 28, 2005. The increase in amortization is reflective of the increase in revenues for the three months compared to the same period in the prior year., 242810=The adjustment to the February 2005 quarter is a reversal of $6.1 million in revenues and $5.7 million in amortization resulting in an increase of net loss of $0.4 million., 434113=Certain amounts presented for the six month period ending February 28, 2006 have been reclassified to, 612830=2010, 410825=February 28, 2006 and 2005, 233151=November 30,, 281708=February 28, 220691=Amortization.  Amortization for the six months ended February 28, 2006 was lower than that of the comparable period for the prior year. Amortization was $3.2 million for the six months ended February 28, 2006 compared to $4.0 million for the six months ended February 28, 2005. The decrease in amortization is reflective of the sales of product during the period with a higher gross margin, or lower amortization attached, compared to the sales of product in the comparable period of the prior year., 192701=Gross Profit.  Gross profit is comprised of revenue less amortization of film and television programming and other production costs. Gross profit for the three months ended February 28, 2006 was $1.3 million compared to $0.6 million for the same period in the prior year.  , 326512=2006, 143416=     Management's Discussion and Analysis, dated April 13, 2006, 465553=In connection with the acquisition of kaBOOM! Entertainment Inc. (note 9), the Company entered into an agreement with a financial institution to borrow $3,500,000. The loan bears interest at the rate of 12% per annum, compounded monthly and is due on July 30, 2006. Upon mutual agreement between the Company, 233861=2004, 536680=Balance - August 31, 2005, 662435=As at February 28, 2006, the Company was indebted to a shareholder, director, and officer of the Company in the amount of $50,000 (2005 - $nil). The amount is due on demand and is entitled to a 10% finance fee of the amount of the loan. This amount payable is included in production loans., 602043=The Company's subsidiary Peace Arch Motion Pictures Inc. (formerly GFT Entertainment Inc.) was named as one of several defendants in an action that commenced in June 2004 by Comerica Bank California. The Company believes that this claim is without merit because, among other things, the alleged events on which the claim is based occurred years prior to the formation of Peace Arch Motion Pictures Inc. The Company does not expect the outcome of this proceeding to have a material adverse effect on the Company's financial position, results of operations, or liquidity., 422167=Effective December 1, 2004, the Company was required to adopt the Canadian Institute of Chartered, 145331=Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized., 584006=For the six months ended February 28, 2006, the effect of potentially dilutive Series I Preferred Shares, Series II Preferred Share warrants, and other warrants (note 14) were excluded from the calculation of diluted net loss per share, as they are anti-dilutive to the basic net loss per common share., 660545=During the six months ended February 28, 2006, the Company paid $nil (2005 - $32,000) to a shareholder, director and officer of the Company for legal services rendered. These expenditures are reflected in the Company's selling, general and administrative expenses., 369039=2005, 413772=The Company has a term loan and a letter of credit provided by a financial institution which is due on July 30, 2006.  Upon mutual agreement between the Company and the lender, the financing may be extended for a period of six months.  The Company is currently identifying various financing alternatives to enable the timely discharge of the Company's obligations.  Management will work toward funding capital requirements through the issuance of shares, warrants and debt, but there is no assurance that the Company will be successful in its financing efforts or the extension granted., 231461=2006, 205767=Other Amortization.   For the three months ended February 28, 2006, other amortization consisting of amortization of property and equipment and amortization of intangible assets amounted to $70,000 compared to $23,000 for the comparable period of the prior year, representing a $47,000 increase. This increase is due to amortization of $45,000 during the quarter for intangible assets. In the comparable period of fiscal 2005, the Company did not have amortization related to intangible assets., 226317=Interest Income.   Interest income was $0.5 million for the six months ended February 28, 2006, compared to $0.5 million for the comparable period of the prior year.  Interest revenue represents interest earned on the Restricted Term Deposit. This interest revenue is offset by interest expense of the same amount recorded in respect of the Film Financing Obligation., 470139=August 31, 2005, 484938=During the year ended August 31, 2002, the Company sold two real estate properties. In October 2001, the first property was sold for gross proceeds of $2,313,000 and realized a gain on the sale of $88,000. In January 2002, the second property was sold for gross proceeds of $4,772,000. As consideration, the Company received cash in the amount of $3,722,000 and a $1,000,000 note receivable., 243097=The preceding table reflects the revised results of operations for the quarter ended February 28, 2005., 198131=As a percentage of revenue, gross profit was 35.7% for the three months ended February 28, 2006 which was comparable to the gross profit of 35.7% for the comparable period of the prior year., 528110=On January 23, 2006, in conjunction with the acquisition of kaBOOM as described in note 9 and the financing of the acquisition from the term loan as described in note 5, the Company issued 1,764,118 common shares as consideration for the purchase and in payment of financing fees related to financing provided by the financial institution.  These shares had a fair value of $825,000.  In connection with the issuance of these shares the Company paid certain share issuance costs amounting to $25,000, which have been charged to capital stock., 437825=August 31, 512346=The Company carried out a reorganization and rationalization of its assets, operations and subsidiaries. The reorganization was carried out in conjunction with, and pursuant to, the terms of the Debt Repayment Agreement with Fremantle Enterprises Ltd. (Fremantle) and the Release and Reconstitution Agreement of November 22, 2002 with Comerica Bank - California (Comerica), by which the debts of the Company, and its subsidiaries, to Fremantle and Comerica were renegotiated as in (b) below., 527292=On December 30, 2005, 1,435,897 Series II Preference Share warrants were exercised at a subscription price of US$0.50 per share for total proceeds of US$717,948.  During the six months ended February 28, 2006 the Company recorded dividends of $135,000 (2005 - $nil) in respect of the Series I Preference Shares and the Series II Preference Shares determined as 10% of the Series I and Series II Preferred Shares' face value of US$2,717,948., 175630=On March 30, 2006, Comerica agreed to convert its US$1,075,000 loan for 215,000 shares of the Company's common stock., 147519=April 10, 2006, 248478=During the comparable period in fiscal 2005, the Company utilized $3.6 million in operating activities. This was a result of the loss of $1.0 million for the six months, an increase of $1.5 million in film and television programming, net of amortization and a reduction in deferred revenue of $3.2 million. This utilization of operating cash was offset by cash provided from a reduction in accounts receivable of $2.3 million., 175898=On January 23, 2006, the Company acquired 100% of the issued and outstanding shares of kaBOOM! Entertainment Inc., a home entertainment studio in Canada. Total consideration of $7,127,000 was provided in the form of 1,033,058 common shares of the Company valued at $500,000, 50,000 stock options of the Company valued at $17,000, cash consideration of $3,000,000, future cash consideration of $3,202,000 and direct costs of acquisition of $408,000. The purchase price includes a provision for payment of the maximum additional consideration of $1,000,000 contingent upon kaBOOM's results of operation for the year ended April 30, 2006.  When the final determination of any contingent consideration due has been made, it will be recorded as an additional cost of acquisition., 517983=During the year ended August 31, 2003, the Company entered into a Release and Reconstitution Agreement with Comerica which restructured the terms of the loan guarantee. Repayment of the loan is restricted to the ultimate proceeds of specific exploitation rights secured under the original loan agreement and, subject to priority interests, including repayment to Fremantle, to the pre-existing assets., 230627=Fiscal 2005, 557847=On July 29, 2005, in connection with a private placement, the Company issued 4,347,825 Series II Preferred Share warrants.  Each warrant is convertible into one Series II Preference Share of the Company at a price of US$0.50 at any time up to July 29, 2009.  The allocation of the proceeds from the issuance of the Units to the warrants is $693,000., 230862=Fiscal 2004, 184301=The loss increased in the three months ended February 28, 2006 to $0.7 million compared to the loss of $0.5 million for the comparable period of the prior year., 208158=Six Months Ended February 28,, 247939=During the six months ended February 28, 2006, $7.6 million was used by operating activities, compared to $3.6 million used by operating activities for the same period in fiscal 2005. In the six months ended February 28, 2006, the Company increased its investment in film and television by $9.3 million, net of amortization. This increase was offset by cash provided from a reduction of accounts receivables of $2.8 million., 243816=Revenue recognized for the three months ended February 28, 2006 is primarily a result of distribution sales activity on film product delivered in prior years and sales generated from the new home entertainment business., 213802=Television revenue for the period ended February 28, 2006 was $0.8 million representing a decrease of $0.6 million from $1.4 million for the same period of the prior year or a 41% decrease compared to the same period of the prior year. The decrease is mainly attributable to the recognition of 13 episodes of a television series during the six month period compared to revenue recognized on 26 episodes of two television series in the comparable period of the prior year., 188117=2005, 518553=If any amount of the Comerica liability remains outstanding as of December 31, 2005, Comerica will, for a period of 90 days, have the right to convert such unpaid amount to Common Shares in the capital of the Company at a deemed price of $5.00 per share., 138592=For the month of April, 2006, 665796=On March 30, 2006, Comerica converted its US$1,075,000 note for 215,000 shares of the Company's common stock. The issuance of the Company's common stock will be valued at $168,000, which is based on the trading value of the Company's common stock at the close of business on the date of conversion., 271003=Dated April 13, 2006., 641078=August 31, 2005, 488212=On May 26, 2005, the Company re-acquired the 100% shares of PAPDC for a nominal amount as described in note 12.  These events have given rise to the amortization of the deferred gain of $43,000 (2005 - $32,000) for the six months ended February 28, 2006., 226827=Interest Expense.   Interest expense was $1.1 million for the six months ended February 28, 2006, representing an increase of $0.4 million from $0.7 million for the comparable period of the prior year.  The increase is due to interest on outstanding production loans from projects produced and delivered in prior years which is no longer capitalized to the cost of the productions.  Interest expense also includes $0.1 million of interest on the deferred financing costs related to the kaBOOM acquisition. Interest expense includes interest incurred on the Film Financing Obligation. This interest expense was offset by interest revenue of the same amount recorded in respect of the Restricted Term Deposit., 663037=As at February 28, 2006 the Company was indebted to the preferred shareholders in the amount of, 420523=February 28, 2005 financial statements related to its accounting treatment of a complex   arrangement with   Showtime for the project \"Our Fathers.\"  It was determined the arrangement was in the nature of a co-  financing relationship where both parties contributed financially to the production.  Under GAAP, the   co-  financier's contribution to the project is considered a reduction of the film's negative costs.  Previously,   the co-financier's contribution to the production was recognized as revenue by the Company from sale of   rights.  The cost of the Company's investment in its film assets is similarly reduced.  The adjustment to the   February 28, 2005 quarter is a reversal of $6,080,000 in revenues and $5,717,000 in amortization   resulting   in a $363,000 increase in net loss., 244559=In the fourth quarter of fiscal 2004 the net loss can be attributed, for the most part, to a valuation impairment charge on the Company's investment in film and television after review of its future revenue estimates that support the carrying value of the investment in film and television., 256217=As at February 28, 2006, included in accounts receivable was $nil (August 31, 2005 - $1,480,000 (US$1,200,000)) from a company owned by a member of senior management. This amount is a result of a sale of distribution rights to the related company prior to the individual becoming a member of senior management. The amount is secured by an irrevocable letter of credit., 207182=Revenue. The Company reported revenue of $4.6 million for the six month period ended February 28, 2006 compared to $4.8 million for the comparable period in fiscal 2005 representing a decrease of $0.2 million or 4% decrease compared the same period of the prior year. The following table presents revenues earned in each of our business segments;, 253171=At February 28, 2006, the Company had commitments of $4.7 million (August 31, 2005 - $3.1 million) with respect to the acquisition of film distribution rights to 6 films (August 31, 2005 - 3 films), which will be delivered to the Company during the year ended August 31, 2006. These payments are required to be made at the date of delivery of the respective films which is expected to be no later than August 31, 2006., 544927=Balance - February 28, 2006, 138337=UNDER THE SECURITIES EXCHANGE ACT OF 1934, 282248=August 31, 510409=Deferred financing costs of $716,000 represent costs associated with establishing the term loan as described in note 5.  The deferred financing costs are amortized over the term of the loan which matures on July 30, 2006.  Amortization as calculated from the date of acquisition of kaBOOM totalled $112,000 and is included in interest expense., 206545=For the six months ended February 28, 2006, the Company has reported a loss of $1.4 million or $0.07 diluted loss per share compared to loss of $1.1 million for the comparable period in fiscal 2005 or $0.06 diluted loss per share., 552564=February 28, 2006, 519822=As described, and in conjunction with the above, on January 30, 2003, the Company issued a conversion instrument to Comerica which permits Comerica to convert the amount of its outstanding loan at December 31, 2005, if any, into Common Shares of the Company for a period of 90 days commencing on December 31, 2005 at a price of $5.00 per share., 158127=Results for Six months ended February 28, 2006, 525314=On May 26, 2005, the Company re-acquired the 100% shares of PAPDC for a nominal amount, which had no effect on the carrying amount of any assets or liabilities., 279631=February 28, 2006, 661717=As at February 28, 2006, included in accounts receivable was $nil (August 31, 2005 - $1,480,000 (US$1,200,000)) from a company owned by a member of senior management. This amount is a result of a sale of distribution rights to the related company prior to the individual becoming a member of senior management. The amount is secured by an irrevocable letter of credit., 486367=On December 1, 2004 the Company adopted AcG-15 as described in note 2, resulting in PAPDC being consolidated as it was determined to be a VIE of which the Company was the primary beneficiary. PAPDC was consolidated in the Company's results of operations commencing December 1, 2004., 141366=[Indicate by check mark whether the registrant by furnishing the information contained in this Form is also thereby furnishing the information to the Commission pursuant to rule 12g3-2(b) under the Securities Exchange Act of 1934., 558354=During fiscal 2001, the Company granted, as partial compensation to retain an investment banker as its financial advisor, a warrant to purchase up to 100,000 Class B Shares at an exercise price of US$2.72 per share, exercisable to April 16, 2006. As the warrants were granted at an exercise price equal to the market value of Company's shares on the date of grant, no compensation expense was recorded., 233244= 2004, 420086=During the year ended August 31, 2005, the Company identified a required revision to its second, 206890=Diluted loss per share is calculated on 21,540,000 weighted average shares outstanding at February 28, 2006 and 17,418,000 weighted average shares outstanding in the prior year., 486082=During the year ended August 31, 2004, PAPDC was not consolidated by the Company resulting in no gain being recorded (see note 11)., 599912=At February 28, 2006, the Company had commitments of $4,689,000 (August 31, 2005 - $3,134,000) with respect to the acquisition of film distribution rights to 6 films (August 31, 2005 - 3 films), which will be delivered to the Company during the year ended August 31, 2006. These payments are required to be made at the date of delivery of the respective films which is expected to be no later than August 31, 2006., 620486=2005 (Restated), 249267=During the six months ended February 28, 2006, cash flow used in investing activities of $3.3 million is primarily due to the net cash required for the acquisition of kaBOOM of $3.2 million. For the comparable period of the prior year, cash used in investing activities of $24,000 was a result of the purchase of property and equipment.  , 326837= 2005, 193884=February 28, 611012=2008, 220141=As a percentage of revenue, gross profit was 30.3% for the six months ended February 28, 2006 compared to the gross profit of 16.1% for the comparable period of the prior year. The increase in gross profit is due to the product mix on sales in the six months of film and television rights with a greater proportion of product sales with a higher gross profit compared to the sales of product in the comparable period of the prior year., 256903=As at February 28, 2006, the Company was indebted to a shareholder, director, and officer of the Company in the amount of $50,000 (2005 - $nil). The amount is due on demand and is entitled to a 10% finance fee of the amount of the loan. This amount payable is included in production loans., 252116=During the year ended August 31, 2004, the Company provided a guarantee of the sales performance of its subsidiary Peace Arch Films Limited (PAF) of US$2.5 million to assist with a producer's financing for a production for which PAF has acquired worldwide distribution rights. PAF has also provided financing contributions towards the cost of the production. The sales performance obligation is due one year after the production's initial theatrical release. The obligation is recoverable by PAF from the proceeds of the production's sales or the receipt of government incentives due to the producer. In return for providing the additional guarantee, the Company will obtain an additional interest in the films from its co-producer. Should the Company default in the guarantee payment, the co-producer is entitled to receive the Company's shares in satisfaction of the obligation which would be issued at market price at that time less 10%., 177069=In a private placement on July 29, 2005 the Company issued 4,347,827 Units consisting of one Series, 520803=On June 25, 2004, the Company voluntarily issued 3,489,814 Common Shares of the Company to PAPDC in consideration for PAPDC agreeing to assume the obligation to issue the Common Shares of the Company to Fremantle and Comerica (collectively, the Lenders) should the Lenders eventually opt to call upon those shares in settlement of the PAPDC obligations. At February 28, 2006 and August 31, 2005 558,689 shares remain in escrow after Fremantle agreed to convert its $8,793,000 note plus interest for 2,931,125 shares of the Company's common stock., 161926=Management's Discussion and Analysis of the financial position and results of operations is prepared as at April 13, 2006, and should be read in conjunction with the accompanying unaudited financial statements and the notes therein., 437290=February 28, 257510=As at February 28, 2006 the Company was indebted to the preferred shareholders in the amount of $108,000.  This amount is the standby fee related to the letters of credit from the preferred shareholders, which is payable in cash or common shares at the option of the Company., 610095=2007, 586408= Six Months Ended February 28, 325841= February 28, 419100=The interim consolidated financial statements have been prepared in a manner which is consistent with the accounting policies described in the Company's audited financial statements for the year ended August 31,   2005 except as disclosed in notes 2(b) to 2(h) below and should be read in conjunction therewith., 596982=The majority of the film productions delivered during the years ended August 31, 2004 and 2005 were pursuant to co-production agreements with an independent producer (the co-producer) in another country. Certain production loans are arranged jointly by the co-producers to cover their individual funding of the respective film production. Each co-producer is responsible for the payment of its respective portion of the loans out of receipts from the respective co-producer's exploitation of the production. In the event of default by the co-producer, the Company is liable for any unpaid balance of the co-producer's share of the loan. At February 28, 2006, the total amount of such unpaid loans was approximately $293,000 (August 31, 2005 - $343,000). In the event of such a default, the Company has full recourse to all the copyright, exploitation and other rights attributed to the co-producer pursuant to the co-production agreement. No accrual has been made as the Company believes the likelihood of payment is remote., 180041=2005, 281853= 2006, 249973=In the six months ended February 28, 2006, cash contributed from financing activities was $10.2 million compared to cash provided from financing activities of $4.1 million in the comparable period in fiscal 2005. Cash provided from financing activities was due to the net addition of production loans for the period of $6.4 million, the issuance of $3.5 million in a term loan in connection with acquisition of kaBOOM, the issuance of $0.8 million in Series II Preferred Shares. For the comparable period of the prior year, cash contributed from financing activities amounted to $4.1 million, which was due to a net issuance of production loans. The addition to production loans is reflective of the increase in investment in film and television., 191405=Motion Picture revenue for the period ended February 28, 2006 was $0.4 million compared to revenue of $0.5 million for the comparable period in the prior year. The motion picture segmental revenue is comparable to the same period of the prior year., 255070=During the six months ended February 28, 2006, the Company paid $nil (2005 - $32,000) to a shareholder, director and officer of the Company for legal services rendered. These expenditures are reflected in the Company's selling, general and administrative expenses., 511443=On January 20, 2003, as approved and ratified by the shareholders of the Company at the Annual General Meeting of Shareholders on that date, the Company entered into a number of agreements to effect a business reorganization and certain asset acquisition transactions. Details of the transactions are as follows:, 584462=For the six months ended February 28, 2005, the effect of potentially dilutive stock options, other warrants (note 14) and shares held in escrow related to the Fremantle and Comerica obligation (note 11(b)) was excluded from the calculation of diluted net loss per share, as they are anti-dilutive to the basic net loss per common share., 232058=August 31,, 198977=Selling, General and Administrative Expense.  Selling, general and administrative expense increased by $0.8 million, or 85%, to $1.7 million for the three months ended February 28, 2006 from $0.9 million for the comparable period in the prior year. This increase was mainly due to additional costs associated with the new home entertainment business that have been incurred from the date of the kaBOOM acquisition compared to the three months ended February 28, 2005. During the three months ended February 28, 2006 there was no recovery of selling, general and administrative expenses as the time period over which the Company was entitled to recover such expenses associated with managing certain assets to realize cashflows to retire the Fremantle debt had ended in fiscal 2005. The following table presents the comparative net selling, general and administrative costs for the two comparable periods;  , 605091=During the year ended August 31, 2005, the Company provided a guarantee of the sales performance of its subsidiary Peace Arch Films Limited (PAF) of US$2,500,000 to assist with a third party producer's financing for a production for which PAF has acquired worldwide distribution rights. PAF has also provided financing contributions towards the cost of the production. The sales performance guarantee is due one year after the production's initial theatrical release which was expected to be February 2006. The guarantee obligation is recoverable by PAF from the proceeds of the production's sales or the receipt of government incentives due to the producer. In return for providing the guarantee, the Company will obtain an additional interest in the film from its co-producer. Should the company default in the guarantee payment, the co-producer is entitled to receive the Company's shares in satisfaction of the obligation which would be issued at market price at that time less 10%., 230392=Fiscal 2006, 186124=Diluted loss per share is calculated on 21,905,000 weighted average shares outstanding at February 28, 2006 and 17,429,000 weighted average shares outstanding for the comparable period of the prior year., 176792=On December 30, 2005, 1,435,897 Series II Preference Shares warrants were exercised at a subscription price of US$0.50 per share for total proceeds of US$717,948.}",
    "textBeforeTable": "For the month of April, 2006 UNDER THE SECURITIES EXCHANGE ACT OF 1934 REPORT OF FOREIGN PRIVATE ISSUER PURSUANT TO RULE 13a-16 OR 15D-16 FORM 6-K Washington, D.C., 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES DC Filing Services Canada Inc. 403-717-3898 Graphic Graphic Graphic Graphic 6-K Documents found in this filing: Peace Arch Entertainment Group 6-K 2006",
    "textAfterTable": "No þ (If \u0093Yes\u0094 is marked, indicate below the file number assigned to the registrant in connection with Rule 12g3-2(b): 82-_______________ EXHIBIT LIST        Confirmation of Mailing to Shareholders      Management's Discussion and Analysis, dated April 13, 2006      CEO Certification of Interim Filings, Form 52-109F2      CFO Certification of Interim Filings, Form 52-109F2      Quarterly Consolidated Financial Statements           SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}