{
    "relation": [
        [
            "Exhibit Number",
            "10.1",
            "10.2",
            "10.3",
            "10.4",
            "10.5",
            "10.6",
            "10.7",
            "10.8",
            "10.9",
            "10.10",
            "10.11",
            "10.12",
            "10.13",
            "10.14",
            "10.15",
            "10.16",
            "10.17",
            "10.18",
            "10.19",
            ""
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Description",
            "CH2M HILL Retirement and Tax-Deferred Savings Plan, as amended and restated effective June 1, 2000 filed as Exhibit 10.1 on Form 10-K, on March 29, 2000",
            "CH2M HILL Companies, Ltd. 1999 Stock Option Plan, as amended and restated on November 12, 1999 filed as Exhibit 10.3 on Form 10-K, on March 29, 2000",
            "CH2M HILL Companies, Ltd. Payroll Deduction Stock Purchase Plan as amended and restated effective January 1, 2002 filed as Exhibit 10.4 on Form 10-K, on March 29, 2002",
            "CH2M HILL Companies, Ltd. Pre-Tax Deferred Compensation Plan effective November 12, 1999 filed as Exhibit 10.5 on Form 10-K, on March 29, 2000",
            "CH2M HILL Companies, Ltd. After-Tax Deferred Compensation Plan effective November 12, 1999 filed as Exhibit 10.7 on Form 10-K, on March 29, 2000",
            "Deferred Compensation Retirement Program Arrangement effective December 1, 1995 filed as Exhibit 10.13 on Form 10-K, on March 29, 2000",
            "Executive Deferred Compensation Program Arrangement effective January 1, 1997 filed as Exhibit 10.14 on Form 10-K, on March 29, 2000",
            "CH2M HILL Companies, Ltd. 2002 Pre-Tax Deferred Compensation Plan effective November 10, 2000 filed as Exhibit 10.17 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. 2002 After-Tax Deferred Compensation Plan effective November 10, 2000 filed as Exhibit 10.19 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. Deferred Compensation Retirement Plan effective January 1, 2000 filed as Exhibit 10.21 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. Executive Deferred Compensation Plan effective January 1, 2000 filed as Exhibit 10.22 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. Deferred Compensation Plan effective January 1, 2001 filed as Exhibit 10.23 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. Restricted Stock Policy and Administration Plan effective January 1, 2000 filed as Exhibit 10.25 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. Short Term Incentive Plan effective January 1, 2000 filed as Exhibit 10.26 on Form 10-K, on March 20, 2001",
            "CH2M HILL Companies, Ltd. 2002 Pre-Tax Deferred Compensation Plan effective November 9, 2001 filed as Exhibit 10.27 on Form 10-K, on March 29, 2002",
            "CH2M HILL Companies, Ltd. 2002 After-Tax Deferred Compensation Plan effective November 9, 2001 filed as Exhibit 10.29 on Form 10-K, on March 29, 2002",
            "CH2M HILL Companies, Ltd. Long Term Incentive (LTI) Plan effective January 1, 1999 filed as Exhibit 10.32 on Form 10-K, on March 29, 2002",
            "CH2M HILL Companies, Ltd. 2003 Pre-Tax Deferred Compensation Plan effective November 8, 2002 filed as Exhibit 10.33 on Form 10-K, on March 26, 2003",
            "CH2M HILL Companies, Ltd. 2003 After-Tax Deferred Compensation Plan effective November 8, 2002 filed as Exhibit 10.35 on Form 10-K, on March 26, 2003",
            ""
        ]
    ],
    "pageTitle": "SEC Info - CH2M Hill Companies Ltd - ‘10-K’ for 12/31/04",
    "title": "",
    "url": "http://www.secinfo.com/dVut2.z4ch.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 694051163,
    "recordOffset": 693942297,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38469=range of services to the U.S. federal government, it also provides services to international governments. Our Civil Infrastructure segment generally provides a comprehensive range of services to various state and local governments. Our Industrial segment generally provides a comprehensive range of services to various private companies. Financial information for each segment for each of the last three years, including 2004, is included in Note 17 of the Notes to Consolidated Financial Statements in Item 15 of this Annual Report on Form 10-K., 732197=        As of December 31, 2004 and 2003, CH2M HILL had $2,564 and $3,124, respectively, in receivables related to the above contracts., 732675=        CH2M HILL provides services to clients through three operating segments: Federal, Civil Infrastructure and Industrial. In 2004, CH2M HILL reorganized such that the operating segments are more closely aligned with the types of clients CH2M HILL serves. The structure is intended to provide for better decision making on an enterprise-wide basis. For example, while the Federal segment generally provides a comprehensive range of services to the U.S. federal government, it also provides services to international governments. The Civil Infrastructure segment generally provides a, 118974=        No items were submitted to a vote of security holders during the fourth quarter of 2004., 488909=        CH2M HILL holds a common stock investment in a company which became publicly listed on a Korean stock exchange during the first quarter of 2004. This investment is classified as available for sale and is included in investments in unconsolidated affiliates on the accompanying consolidated balance sheet with any unrealized gains or losses included in shareholders' equity as a component of other comprehensive loss. At December 31, 2004, the fair value of the investment was $2,319 and the corresponding unrealized gain in comprehensive income was $1,419, net of tax. For the year ended December 31, 2004, CH2M HILL received proceeds of $1,937 on various sales of this investment and recognized gains of $1,528 which are included in other income in the accompanying consolidated statements of income., 643064=        Undistributed earnings of CH2M HILL's foreign subsidiaries amounted to approximately $19,422 at December 31, 2004. Those earnings are considered to be indefinitely reinvested and accordingly, no provision for U.S. federal and state income taxes or foreign withholding taxes has been made. Upon distribution of those earnings, CH2M HILL would be subject to U.S. income taxes (subject to a reduction for foreign tax credits) and withholding taxes payable to the various foreign countries. Determination of the amount of unrecognized deferred U.S. income tax liability is not practicable; however, the potential foreign tax credit associated with the deferred income would be available to reduce the resulting U.S. tax liabilities., 595908=        The credit facility, as amended, expires in July 2008, however, with the lender's consent, the credit facility can be extended for an additional one year prior to July 2005. At the option of CH2M HILL, the credit facility bears interest at a rate equal to either the London InterBank Offered Rate plus 1.00% to 1.75%, or the lender's applicable base rate plus margin of 0.0% to 0.25% based on CH2M HILL's ratio of funded debt to earnings before interest, taxes, depreciation and amortization, as defined. A commitment fee of approximately 0.20% to 0.35% per year on the unused portion of the, 133289=        As part of the total mix of information that our Board of Directors considers in determining the \"M\" factor, our Board of Directors also may take into account company appraisal information prepared by The Environmental Financial Consulting Group, Inc. (EFCG), an independent appraiser engaged by the trustees of our benefit plans. In setting the stock price, our Board of Directors compares the total of the going concern and book value components used in the valuation methodology to the enterprise value of the Company in the appraisal provided by EFCG. If, after such comparison, our Board of Directors concludes that its initial determination of the \"M\" factor should be re-examined, our Board of Directors may review, and if appropriate adjust, the \"M\" factor. Since the inception of the program on January 1, 2000, the total of the going concern and book value components used by our Board of Directors in setting the price for our stock has always been within the enterprise appraisal range provided quarterly by EFCG., 689037=        In February 1999, CH2M HILL established the Stock Appreciation Rights (SARs) Plan. Eligible individuals are generally individuals who are not residents of the U.S. SARs are granted at an exercise price equal to the fair market value of CH2M HILL's common stock and generally become exercisable 25%, 25% and 50% after one, two and three years, respectively, and have a term of five years from date of grant. All amounts granted under the SARs Plan are payable in cash only. Compensation expense under this plan is based on the vesting provisions and the fair market value of CH2M HILL's common stock., 486993=        Occasionally, CH2M HILL enters into derivative financial transactions to hedge the effects of exchange rate changes on cash exposures from receivables and payables denominated in foreign currencies. CH2M HILL does not enter into derivative transactions for speculative or trading purposes. Management recognizes derivative transactions on the accompanying consolidated balance sheets at fair value. Changes in the derivative's fair value are recognized in other comprehensive income or loss until the hedged item is recognized in earnings. Any ineffective portion of a derivative's change in fair value is recognized in earnings. Recognized gains or losses on derivatives entered into to manage foreign exchange risk are included in the accompanying consolidated statements of income and were minimal for the year ended December 31, 2004., 215096=        Revenues increased for the year-ended December 31, 2003, compared to 2002 by $109.3 million, or 14.1%. The increase was a result of our environmental and energy businesses reporting increases in U.S. federal government contracts and delivery orders. Additionally, effective in January 2003, our nuclear business was awarded a new performance-based contract by the DOE to accelerate the safe closure of the nuclear facilities at the former Mound Closure Plant in Miamisburg, Ohio, and to transition the site to industrial use. This new Mound Closure Project reported $103.8 million in revenues for the year ended December 31, 2003. This increase was offset by decreases in revenue at Hanford due to the timing of certain delivery efforts., 22475=The aggregate market value of the voting and non-voting common equity held by non-affiliates of the registrant computed by reference to the price as of June 30, 2004 was approximately $185.2 million. For purposes of this calculation, it is assumed that the registrant's affiliates include the registrant's Board of Directors, its executive officers and certain of its employee benefit plans. The registrant disclaims the existence of any control relationship between it and such employee benefit plans., 671793=        The estimated fair values of stock options granted during 2004, 2003 and 2002 were $923, $863 and $988, respectively, and were estimated using the minimum value method with the following weighted-average assumptions:, 496214=        At December 31, 2004, CH2M HILL has several stock-based employee compensation plans, which are described in Note 14. CH2M HILL accounts for these plans using the intrinsic value method under the recognition and measurement principles of Accounting Principles Board (APB), Opinion No. 25, \"Accounting for Stock Issued to Employees,\" and related interpretations. The following table illustrates the pro-forma effect on net income and earnings per share if CH2M HILL had applied the fair value recognition provisions of Financial Accounting Standards Board (FASB) Statement of Financial Accounting Standards (SFAS) No. 123, \"Accounting for Stock-Based Compensation,\" to stock-based employee compensation., 288829=        There have been no changes in our internal control over financial reporting during the quarter ended December 31, 2004 that have materially affected, or is reasonably likely to materially affect, our internal control over financial reporting., 602583=        CH2M HILL has entered into certain noncancellable leases, which are being accounted for as operating leases. At December 31, 2004, future minimum operating lease payments are as follows:, 657967=        CH2M HILL has several nonqualified deferred compensation programs that provide benefits payable to officers and certain highly compensated employees at specified future dates, upon retirement, or death. Both the Deferred Compensation Plan (DCP) and the Executive Deferred Compensation Plan (EDCP) utilize a rabbi trust arrangement. During the years ended December 31, 2004, 2003 and 2002, a total of 564,380 shares, 740,575 shares and 762,444 shares, respectively, were contributed by employees to the deferred compensation plans. The DCP provides for participants to elect to defer their base pay and incentive pay, in cash or common stock, on a pre-tax basis. The EDCP serves two purposes. It allows CH2M HILL the opportunity to provide a company match for compensation deferrals made by highly compensated employees, whose 401(k) Plan contributions are limited by the Employee Retirement Income Security Act (ERISA). It is also used by CH2M HILL to provide additional retirement benefits for certain of its senior executives at levels to be determined from time-to-time by the Board of Directors. The deferred compensation plans have several hypothetical investment options that a participant may choose to invest the cash portion of their deferred compensation. Each hypothetical investment option is based on an investment fund that is similar to the 401(k) Plan. All deferrals of common stock must remain invested in common stock and are distributed in common stock., 687061=        In January 2000, CH2M HILL established the Phantom Stock Plan, which provides eligible individuals with added incentives to continue in the long-term service of CH2M HILL. Eligible individuals are generally individuals who are not residents of the U.S. Phantom Stock grants are 100% vested on the grant date and may be redeemed after six months from the grant date. The value of phantom stock is equal to the fair market value of CH2M HILL's common stock. All amounts granted under the Phantom Stock Plan are payable in cash only and are generally granted in connection with the Short and Long Term Incentive Plans. Compensation expense is measured by the value of the units on the grant date., 344043=        In our opinion, management's assessment that CH2M HILL Companies, Ltd. and subsidiaries maintained effective internal control over financial reporting as of December 31, 2004, is fairly stated, in all material respects, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). Also, in our opinion, CH2M HILL Companies, Ltd. and subsidiaries maintained, in all material respects, effective internal control over financial reporting as of December 31, 2004, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO)., 731217=        CH2M HILL is involved in certain contracts with Kaiser-Hill, a non-consolidated affiliate, to provide information, computer and telecommunications support services. CH2M HILL reported revenue of $10,869 in 2004, $10,652 in 2003 and $473 in 2002 for such services in the accompanying consolidated statements of income. These services were billed to Kaiser-Hill at CH2M HILL's actual costs incurred., 868451=        At December 31, 2004, the Company employed approximately 794 hourly workers and approximately 306 salaried workers. Approximately 70% of the hourly employees are represented by United Steel Workers of America under a collective bargaining agreement, which expires on January 15, 2007., 808786=        In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the consolidated financial position of Kaiser-Hill Company, LLC and subsidiary as of December 31, 2004 and 2003, and the results of their operations and their cash flows for the three-year period ended December 31, 2004, in conformity with accounting principles generally accepted in the United States of America., 150585=        Starting in 2000, with the introduction of the Internal Market and its quarterly trades, our Board of Directors reviews the common stock price quarterly using the valuation methodology described above to set the price for the common stock. The prices of our common stock for the past three years, along with the various factors and values used by our Board of Directors to determine such stock prices on each date, are as follows:, 514601=        CH2M HILL has classified entities identified as VIEs into two groups, the first of which includes those entities that CH2M HILL will be required to consolidate under the guidance of FIN 46R in the first quarter of 2005 and the second group which includes those entities which CH2M HILL will not be required to consolidate. At December 31, 2004, the assets and liabilities, including minority interest balances, of the identified VIEs that will be consolidated are $43,070 and $35,680 respectively, of which CH2M HILL currently consolidates $5,441 and $4,193, respectively. At December 31, 2004, the assets and liabilities of the identified VIEs that will not be consolidated are $36,024 and $31,749, respectively., 236266=        Over the last three years we have acquired several companies, the largest being Lockwood Greene in 2003 in which we used $79.9 million of cash, net of cash acquired. We used $4.5 million in cash for our 2004 acquisition of MicroSource., 694906=        The amount of compensation expense recognized under the Restricted Stock Plan was $973, $218 and $152 for the year ended December 31, 2004, 2003 and 2002, respectively., 218083=        Pre-tax profit declined by $0.6 million, or 1.9%, for December 31, 2003 compared to 2002. The decrease was due to project delivery challenges in our operations and maintenance business on certain projects. This decline was offset by revenue improvements, service delivery improvements on design/build projects, additional efficiencies in business development and a reduction of overhead costs in our water, wastewater and water resources business., 76472=        For example, in 1998 Congress enacted the Transportation Equity Act for the 21st Century (TEA-21), a sweeping transportation infrastructure initiative. This initiative was expected to generate U.S. federal government appropriations and respective contracting opportunities in hundreds of millions of dollars over many years. The economic downturn in 2000 and the September 11, 2001 terrorist attacks have redirected short- and long-term government priorities, resulting in substantially lower than expected appropriations for TEA-21 initiatives. The reauthorization of TEA-21 has been extended through May 31, 2005 and the availability of the funding to support the initiative remains uncertain beyond that date. Continuing federal budget deficits and the costs and other demands of the war in Iraq have moved government spending priorities away from major infrastructure projects. While we have won and are continuing to seek federal contracts related to rebuilding Iraq and other projects that reflect current government priorities, it is possible that the reduction of infrastructure projects could adversely affect our business., 247226=        We are party to two lease agreements related to our corporate headquarters and two adjacent buildings. These lease agreements were recently restructured and the new lessors are not variable interest entities (VIEs) as the lessors are considered a business per the definition of revised Financial Accounting Standards Board (FASB) Interpretation (FIN) No. 46 (FIN 46R), \"Consolidation of Variable Interest Entities.\" These leases remain operating leases. One of the lease agreements calls for monthly lease payments of approximately $0.4 million through March 3, 2013 and requires that we guarantee a residual value of the facilities for approximately $42.0 million. Upon completion of the lease term, we have the option to purchase the facilities for $53.0 million. The other lease agreement calls for monthly lease payments at a variable interest rate, estimated to be approximately $0.1 million per month, based on current interest rates. The lease agreement requires that we guarantee a residual value of this building of approximately $17.6 million. Upon completion of the lease term, we have the option to purchase the additional building from the lessor for $20.8 million. The lease matures on September 28, 2008 and provides for five one year renewal option., 508819=effective date, except if prior awards are modified, repurchased or cancelled after the effective date. SFAS 123(R) also amends SFAS No. 95, \"Statement of Cash Flows,\" to require that excess tax benefits be reported as a financing cash inflow rather than as a reduction of taxes paid. Adoption of SFAS 123(R) will require CH2M HILL to record an expense for stock based compensation plans using the fair value method and will have an impact on CH2M HILL's financial statements as management has historically recorded compensation expense in accordance with APB No. 25, which requires the recording of an expense for stock based compensation plans based upon the equity investment's fair market value as compared to the purchase price by the employee on the grant date. CH2M HILL will adopt SFAS No. 123(R) on January 1, 2006 and management is currently assessing the impact on CH2M HILL's consolidated financial statements., 36789=        We are one of the largest engineering services firms worldwide and are employee-owned. Our business provides engineering, construction, operations, major project management and related technical services to municipal, state, federal and private sector clients worldwide. Founded in 1946, we have nearly 14,000 employees worldwide., 250056=        Commercial commitments outstanding as of December 31, 2004 are summarized below:, 20967=Indicate by check mark whether the registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days. Yes ý    No o, 688604=        Expenses related to the Phantom Stock Plan amounted to $427, $1,005 and $1,319 in 2004, 2003 and 2002, respectively., 806620=        We have audited the accompanying consolidated balance sheets of Kaiser-Hill Company, LLC and subsidiary (the Company) as of December 31, 2004 and 2003, and the related consolidated statements of income, members' equity, and cash flows for the three-year period ended December 31, 2004. These consolidated financial statements and the supplementary consolidating information referred to below are the responsibility of the Company's management. Our responsibility is to express an opinion on these consolidated financial statements and supplementary consolidating information based on our audits., 683764=        The estimated fair values of shares attributable to the PDSPP during 2004, 2003 and 2002 were $1,052, $1,108 and $1,023, respectively, and were estimated using the minimum value method with the following weighted-average assumptions:, 560420=        The goodwill associated with these transactions was $1,865, all of which was allocated to the Industrial operating segment. Other finite-lived intangible assets recognized as part of these transactions amounted to $2,241. The MicroSource acquisition has maximum contingent payments of $1,750, which become due based upon achieving certain operating results over 2005 through 2009., 276276=        In December 2004, the FASB issued SFAS No. 123 (Revised) \"Share-Based Payment,\" (SFAS No. 123 (R)), which replaces SFAS No. 123 and supercedes APB No. 25, \"Accounting for Stock Issued to Employees.\" SFAS 123(R) is effective as of the beginning of the first interim or annual reporting period that begins after December 15, 2005. SFAS 123(R) requires that the costs resulting from all share-based payment transactions be recognized in the financial statements. SFAS 123(R) applies to all awards granted after the required effective date, but does not apply to awards granted in periods before the required effective date, except if prior awards are modified, repurchased or cancelled after the effective date. SFAS 123(R) also amends SFAS No. 95, \"Statement of Cash Flows,\" to require that excess tax benefits be reported as a financing cash inflow rather than as a reduction of taxes paid. Adoption of SFAS 123(R) will require us to record an expense for stock based compensation plans using the fair value method and will have an impact on our financial statements as management has historically recorded compensation expense in accordance with APB No. 25, which requires the recording of an expense for stock based compensation plans based upon the equity investment's fair market value as compared to the purchase price by the employee on the grant date. We will adopt SFAS No. 123(R) on January 1, 2006 and are currently assessing the impact on our consolidated financial statements., 509924=        The American Jobs Creation Act created a temporary incentive for U.S. multinationals to repatriate accumulated earnings outside of the U.S. by providing an 85% dividend received deductions from controlled foreign corporations. In December 2004, the FASB issued FASB Staff Position (FSP) No. 109-2, \"Accounting and Disclosure Guidance for the Foreign Earnings Repatriation Provision within the American Jobs Creation Act of 2004,\" which provides accounting and disclosure guidance for this repatriation provision. CH2M HILL has not completed its evaluation of the new repatriation provisions and does not expect to complete its evaluation until after Congress or the Treasury Department provides additional guidance clarifying key elements of the provision. CH2M HILL expects to complete its evaluation of the effects of these provisions within a reasonable period of time following the publication of additional clarifying language. The range of possible amounts that management is currently considering eligible for repatriation is between zero and $20,000, as of December 31, 2004. The related potential range of income tax cannot be reasonably estimated. While management is currently studying the impact of the one-time favorable repatriation provision, it is management's intention to continue to indefinitely reinvest our undistributed foreign earnings., 23420=As of February 17, 2005, there were 31,336,921 shares of the registrant's stock outstanding., 727399=        Expected contributions to the active noncontributory defined benefit pension plan for 2005 is $1,099., 23831=Portions of the definitive Proxy Statement for the 2005 Annual Meeting of Shareholders are incorporated by reference in Part III of this Annual Report on Form 10-K where indicated., 661379=        At December 31, 2004 and 2003, the liability under the deferred compensation plans amounted to $23,389 and $16,963, respectively, and is included in other long-term liabilities. To assist in funding the deferred compensation liabilities, CH2M HILL has invested in corporate-owned life insurance policies. The cash surrender value of these policies included in other assets was $28,285 and $24,060 at December 31, 2004 and 2003, respectively., 805911=KAISER-HILL COMPANY, LLC AND SUBSIDIARY Consolidated Financial Statements and Schedules December 31, 2004 and 2003 (With Independent Auditors' Report Thereon), 55487=        Kaiser-Hill's current contract with the DOE, which has been effective since 2000, is a site closure contract and does not have a defined term. We are targeting closure of the site in late 2005 to early 2006. Under the contract, Kaiser-Hill is compensated through a base fee affected, up or down, by its performance against the agreed upon site target closure timetable and costs. For every dollar that the DOE saves, Kaiser-Hill receives a fee increase ranging from 20 to 30 cents up to an agreed upon maximum. At the same time, for every dollar the cleanup is over budget, the fee is reduced by 20 to 30 cents down to an agreed upon minimum. The ultimate fee will also be affected by the schedule to achieve site closure and the safety of our performance., 237160=        We used $34.2 million in cash for purchases of stock presented on our internal market in 2004 compared to $27.7 million in 2003 and $26.7 million in 2002. Additionally, during the year ended December 31, 2004, our average daily borrowing was $13.8 million under our credit facility for general corporate purposes. In December 2003, we borrowed $47.0 million under our credit facility to ensure sufficient liquidity to close our Lockwood Greene acquisition. These borrowings were repaid from cash flows from operations. It is likely, but uncertain, that we will continue to utilize our credit facility periodically during 2005 depending on the timing of cash receipts and disbursements. There were no amounts outstanding under our line of credit at December 31, 2004 or 2003., 844178=KAISER-HILL COMPANY, LLC AND SUBSIDIARY Consolidated Statements of Cash Flows Years ended December 31, 2004, 2003, and 2002 (Amounts in thousands of dollars), 809793=February 7, 2005, 221166=        We routinely enter into joint ventures to service the needs of our clients. Such arrangements are customary in the engineering and construction industry and generally are project specific. Our largest joint venture is Kaiser-Hill, in which we own a 50% interest. This joint venture is included in our Federal operating segment. Kaiser-Hill's current contract with the DOE, which has been effective since 2000, is a site closure contract and does not have a defined term. We are targeting closure of the site in late 2005 to early 2006. Under the contract, Kaiser-Hill is compensated through a base fee affected, up or down, by its performance against the agreed upon site target closure timetable and costs. For every dollar that the DOE saves, Kaiser-Hill receives a fee increase ranging from 20 to 30 cents up to an agreed upon maximum. At the same time, for every dollar the cleanup is over budget, the fee is reduced by 20 to 30 cents down to an agreed upon minimum. The ultimate fee will also be impacted by the schedule to achieve site closure and the safety of our performance., 662998=1999 Stock Option Plan, 229823=        We have presented a claim to the Internal Revenue Service (IRS) relating to the research and experimentation tax credit for the years 1996-2003. Although we are seeking resolution with the IRS, we only recognize tax benefits related to these credits for financial statement purposes when it is probable that such benefits will be realized. The amount of the tax credit claimed is significant, however, the ultimate amount to be realized and the timing of the recognition of the tax credit will depend upon the final resolution with the IRS., 598009=        CH2M HILL may repurchase shares from shareholders upon termination of employment or affiliation by issuing interest-bearing notes. The total amount outstanding for notes payable to former shareholders at December 31, 2004 and 2003 was $2,609 and $4,315, respectively. The interest rate on the notes is adjusted annually (on the anniversary dates of the notes) to 3/4 of the U.S. Federal Reserve Discount Rate on the first business day of each calendar year. For 2004, the interest rate on the notes was 1.50%. The notes are unsecured and payable in varying annual installments through 2009., 258169=        Our current insurance policies include coverage for terrorist acts, except for acts of war. In the future, terrorist act coverage may be limited or expensive to obtain due to the uncertainty of the extension beyond December 2005 of the Terrorism Risk Insurance Act of 2002. While we will attempt to renew our insurance policies without losing terrorism coverage, we do not believe that lack of such coverage would have a material impact on our business and also believe that the commercial insurance market may fill the void in the absence of the current federal program., 533539=        During December 2004, CH2M HILL issued 149,518 shares of common stock in exchange for certain outstanding shares of non-voting preferred stock in CH2M HILL Canada, LTD. This exchange resulted in an increase to additional paid in capital of $2,189., 225639=        Corporate expenses represent centralized management costs that are not allocable to individual operating segments and primarily include expenses associated with administrative compliance functions such as legal, treasury, accounting, tax and general business development efforts. Corporate expenses for the year ended December 31, 2004 were $14.9 million compared to $9.6 million in 2003 and $8.2 million in 2002. The increases of 55.2% in 2004 and 17.1% in 2003 compared to the prior years were due primarily to an increase in expenses associated with our implementation efforts to comply with the provisions of Section 404 of the Sarbanes-Oxley Act of 2002., 339043=        Our management's assessment of the effectiveness of our internal control over financial reporting as of December 31, 2004 has been audited by KPMG LLP, an independent registered public accounting firm, as stated in their report which is included on page F-3., 776232=        CH2M HILL has presented a claim to the Internal Revenue Service (IRS) relating to the research and experimentation tax credit for the years 1996-2003. Although CH2M HILL is seeking resolution with the IRS, CH2M HILL only recognizes tax benefits related to these credits for financial statement purposes when it is probable that such benefits will be realized. The amount of the tax credit claimed is significant, however, the ultimate amount to be realized and the timing of the recognition of the tax credit will depend upon the final resolution with the IRS., 688385=        The fair values of the units granted under the Phantom Stock Plan during 2004, 2003 and 2002 were $12.07, $11.89 and $11.21, respectively., 597455=        The agreement also allows CH2M HILL to issue letters of credit to support various trade activities. Issued letters of credit are reserved against the borrowing base of the line of credit. At December 31, 2004 and 2003, there were $20,382 and $40,680 issued and outstanding letters of credit, respectively., 214080=        Pre-tax profit significantly increased for the year ended December 31, 2004 compared to 2003 by $18.5 million, or 136.0%. Improvements over last year were reported in all of the industrial businesses. Although the semiconductor and microelectronics industries continued to operate in a slower than historical market, they significantly improved pre-tax profit year over year as a result of increased volumes and a reduction in indirect labor overhead. Improvements were also reported as a result of the acquisition of Lockwood Greene in December 2003 and increased volumes in the telecommunications business despite a depressed market., 84147=        As is customary in our industry, we are often required to provide performance and surety bonds to customers in connection with our construction, EPC and fixed price projects. These bonds indemnify the customer if we fail to perform our obligations under the contract. Failure to provide a bond on terms and conditions desired by a customer may result in an inability to compete for or win a project. Historically we have had and continue to have good relationships with our sureties and a strong bonding capacity. The issuance of bonds under any bonding facilities, however, is at the sureties' sole discretion. The recent difficult insurance market combined with large losses experienced by sureties in the aftermath of Enron and other financial scandals, as well as a result of the September 11, 2001 terrorist attacks have made surety bond markets, in general, unpredictable and chaotic. Bonds may be more difficult to obtain in the future or they may only be available at significant additional cost. There can be no assurance that bonds will continue to be available to us on reasonable terms. Our inability to obtain adequate bonding may result in our ineligibility to bid for construction, EPC, and fixed price projects, which could have a material adverse effect on our growth and financial condition., 512582=        In January 2003, the FASB issued Interpretation (FIN) No. 46, \"Consolidation of Variable Interest Entities,\" which provides guidance on when to consolidate variable interest entities (VIEs). In December 2003, the FASB revised FIN 46 with FIN 46R. In addition to conforming to previously issued FASB Staff Positions, FIN 46R deferred the implementation date for certain VIEs. CH2M HILL adopted the provisions of FIN 46R immediately for entities created after December 31, 2003. For entities created before December 31, 2003, CH2M HILL will adopt FIN 46R in the first quarter of 2005, as required., 235599=        Billings and collections on accounts receivable can impact our operating cash flows. We continuously monitor collection efforts and assess the allowance for doubtful accounts. Based on this assessment at December 31, 2004, we have deemed the allowance for doubtful accounts to be adequate; however, future economic conditions may adversely impact some of our clients' ability to pay our bills or the timeliness of their payments. Consequently, it may also impact our timing of cash receipts necessary to meet our operating needs., 246127=        The agreement requires us to, among other things, maintain minimum levels of net worth, a minimum coverage ratio of certain fixed charges, and a minimum leverage ratio of earnings before interest, taxes, depreciation and amortization to funded debt (all as defined in the agreement). As of December 31, 2004 we were in compliance with the covenants required by the agreement., 588924=        These indefinite lived intangible assets were reviewed for impairment during the year ended December 31, 2004. Management's review of the recoverability of these intangible assets indicated that there was no impairment of goodwill. Management wrote off $500 related to a tradename no longer being utilized during the year ended December 31, 2004., 692099=        In January 1999, CH2M HILL established the Long Term Incentive Plan (LTIP) to reward certain executives, project managers, and technologists for the creation of value in the organization through the achievement of specific long-term (3 year) goals of earnings growth and strategic initiatives for CH2M HILL, as well as individual goals. The Board of Directors of CH2M HILL determines which employees are eligible to participate in the LTIP in any program year and a new plan is established each year., 216237=        Pre-tax profit declined by $11.5 million, or 26.3%, for December 31, 2003 compared to 2002. The decrease in pre-tax profit resulted from a decline in earnings from Kaiser-Hill Company, LLC (Kaiser-Hill). The Federal operating segment recorded $17.0 million of additional earnings in 2002 ($6.7 million net of incentive accruals and related tax expense) from Kaiser-Hill as a result of favorable performance on the Rocky Flats project for the DOE. Kaiser-Hill's performance has increased the likelihood of receiving a larger performance fee upon completion, and therefore the financial results in 2002 reflected this positive performance., 657660=        Expenses related to defined contributions made in common stock for the 401(k) Plan for 2004, 2003 and 2002 were $8,309, $7,947 and $7,486, respectively., 279618=        In December 2003, the Securities and Exchange Commission issued Staff Accounting Bulletin (SAB) No. 104, \"Revenue Recognition,\" which supercedes SAB No. 101, \"Revenue Recognition in Financial Statements.\" SAB No. 104's primary purpose is to rescind accounting guidance contained in SAB No. 101 related to multiple element revenue arrangements, which was effectively superceded as a result of the issuance of Emerging Issues Task Force (EITF) Consensus No. 00-21, \"Accounting for Revenue Arrangements with Multiple Deliverables\". While the wording of SAB No. 104 has changed to, 596928=        The agreement requires CH2M HILL to, among other things, maintain minimum levels of net worth, a minimum coverage ratio of certain fixed charges, and a minimum leverage ratio of earnings before interest, taxes, depreciation and amortization to funded debt (all as defined in the agreement). As of December 31, 2004, CH2M HILL was in compliance with the covenants required by the agreement., 137552=        Total Shareholders' Equity (\"SE\").    \"SE\" is total shareholders' equity, which includes intangible items, as set forth on our most recently available quarterly or annual financial statements. Our Board of Directors, at its discretion, may exclude from Shareholders' Equity nonrecurring or unusual transactions that the market would not generally take into account in valuing an equity security. The exclusions from Shareholders' Equity will generally be those transactions that are non-cash and are reported as \"accumulated other comprehensive income (loss)\" on the face of our consolidated balance sheet. For example, during 2004, our Board of Directors excluded, and will continue to exclude, a non-cash reduction in shareholders' equity for a minimum pension liability adjustment. This adjustment was required by accounting rules and essentially reflected the stock market performance of the investments held in our pension plans relative to their future benefit obligations. Because this adjustment is unusual and may reverse as investment markets rebound, and given that the market would not generally take such adjustments into account when valuing equity securities, our Board of Directors excluded it from the SE parameter for stock valuation purposes. Similarly, other items that are reported as components of \"accumulated other comprehensive income (loss)\" include unrealized gains and losses on securities, unrealized gains and losses on derivatives and foreign currency translation adjustments., 644740=        The American Jobs Creation Act created a temporary incentive for U.S. multinationals to repatriate accumulated earnings outside of the U.S. by providing an 85% dividend received deductions from controlled foreign corporations. In December 2004, the FASB issued FSP No. 109-2, \"Accounting and Disclosure Guidance for the Foreign Earnings Repatriation Provision within the American Jobs, 731792=        In addition, Kaiser-Hill provides certain technical support services to CH2M HILL. CH2M HILL reported expenses of $3,999 in 2004, $4,892 in 2003 and $2,145 in 2002 related to these services in the accompanying consolidated statements of income. These services were billed to CH2M HILL at Kaiser-Hill's actual costs incurred., 532377=        During the years ended December 31, 2004, 2003 and 2002, CH2M HILL recognized undistributed earnings from Kaiser-Hill of $2,830, $3,649 and $21,107, respectively. Kaiser-Hill's ability to distribute cash is based on pre-negotiated payment terms in accordance with its contract with the DOE and can be different from the earnings recognized for accounting purposes. As the cleanup of the site progresses toward the targeted closure date of 2006, undistributed earnings, and therefore the investment balance, could continue to increase if Kaiser-Hill continues to perform at better than cost and schedule targets. As of December 31, 2004 and 2003, the investment in Kaiser-Hill was $35,246 and $32,416, respectively., 206906=        Revenues decreased for the year ended December 31, 2004 compared to 2003 by $39.3 million, or 4.4%. The decrease was primarily attributable to project and pursuit delays in our water, wastewater and water resources business. These delays resulted in lower volume of new business compared to last year at this time for our domestic design/build businesses and a flat domestic consulting market. These delays are a result of longer than expected finalization of contract terms and delays in the funding of several projects. We realized improvement during the fourth quarter of 2004, indicating that we are beginning to recover from these delays as we move into 2005. The overall decline in revenue for the water, wastewater and water resources business was partially offset by improvements in our international consulting and design/build businesses, particularly in Asia Pacific and the Middle East, where we were recently awarded an Iraq water reconstruction contract and in Canada where we have seen an increase in consulting projects. The international market remains strong and we believe we are well positioned for future large design/build projects. These opportunities are driven by population and, 305058=        Financial Statements of Kaiser-Hill Company, LLC as of December 31, 2004 and 2003 and for the three years ended December 31, 2004, 2003 and 2002., 690674=        In January 2000, CH2M HILL established the Short Term Incentive Plan (STIP) to aid in the motivation, recruitment, retention and reward of employees. Management determines which employees, directors, and eligible consultants participate in the STIP. A participant must be employed on the grant date of the award in order to be eligible to receive the award and on the date of the award payout in order to be eligible to receive the actual payout., 511448=        In December 2003, the SEC issued Staff Accounting Bulletin (SAB) No. 104, \"Revenue Recognition,\" which supercedes SAB No. 101, \"Revenue Recognition in Financial Statements.\" SAB No. 104's primary purpose is to rescind accounting guidance contained in SAB No. 101 related to multiple element revenue arrangements, which was effectively superceded as a result of the issuance of Emerging Issues Task Force (EITF) Consensus No. 00-21, \"Accounting for Revenue Arrangements with Multiple Deliverables\". While the wording of SAB No. 104 has changed to reflect the issuance of EITF No. 00-21, the revenue recognition principles of SAB No. 101 remain largely unchanged by the issuance of SAB No. 104. SAB No. 104 applies to CH2M HILL's O&M type contracts. SAB No. 104 does not have a material impact on CH2M HILL's consolidated financial statements., 878230=        During 2003, CH2M HILL began providing information technology services for the Company at negotiated rates. Costs incurred related to work performed by CH2M HILL, the majority of which are reimbursable and billed under the Contract and relate to information technology services provided, were approximately $10,869,000 in 2004, $10,652,000 in 2003, and $473,000 in 2002., 869022=        On January 24, 2000, the Company and the DOE entered into a new contract (the Contract) effective February 1, 2000. The Contract is in effect until the \"physical completion\" of the Rocky Flats Closure Project including, disposal of nuclear material, demolition of facilities, environmental remediation, disposal of waste, and completion of infrastructure and other general site operations. Under the Contract, the Company has the opportunity to earn an additional fee if the total costs incurred are below the Contract target cost or the completion of the site closure is before March 31, 2007. In addition, the Company can lose a portion of its fee if the costs exceed the Contract target cost or the site closure is after March 31, 2007. A contract modification signed in 2004 adjusted the maximum and minimum fee available, to be earned by the Company through the date of closure, to $560 million and $75 million, respectively., 886597=        The Company currently has a Business Loan and Security Agreement (the Agreement) with a bank. The term of the Agreement is through December 31, 2005. The Company, Kaiser, and CH2M HILL granted a first lien security interest to the bank in all of the ownership and equity interest of the Company. As of December 31, 2004 and 2003, the Company had no amounts outstanding under the Agreement., 333801=        We have audited the accompanying consolidated balance sheets of CH2M HILL Companies, Ltd. (an Oregon corporation) and subsidiaries as of December 31, 2004 and 2003, and the related consolidated statements of income, shareholders' equity and comprehensive income, and cash flows for each of the years in the three-year period ended December 31, 2004. These consolidated financial statements are the responsibility of the Company's management. Our responsibility is to express an opinion on these consolidated financial statements based on our audits., 213084=        In October 2004, we acquired the assets of MicroSource, Inc. (MicroSource) for a purchase price of $4.5 million. This acquisition has maximum contingent payments of $1.8 million, which become due based upon achieving certain operating results over 2005 through 2009. MicroSource provides network managed services focused on data networks for private sector and local government enterprises. We, 218887=        Revenues improved slightly for the year ended December 31, 2003 compared to 2002 by $15.5 million, or 4.3%. Lockwood Greene contributed $11.5 million of revenue. Our telecommunications business reported increased revenues as a result of slight improvements in the domestic wireless markets. While the telecommunications industry was still slow to recover on the capital expenditure side, we continued to invest in this business in order to be positioned to compete for work in other sectors of the telecommunications industry. These increases were offset by a decline in revenue primarily attributable to the depressed facility capital spending levels resulting from the recession in the semiconductor industry. The semiconductor industry showed initial signs of recovery at the end of 2003 which resulted in slightly increased workload and bid opportunities., 236592=        We are a professional services organization and, therefore, we do not require significant outflows of cash for capital expenditures. Our capital expenditures are primarily for office equipment and leasehold improvements. Capital expenditures during the years 2004, 2003 and 2002 were $6.8 million, $7.0 million and $6.0 million, respectively. We have a formal operating lease program under which most of our computers and related equipment is procured on an ongoing basis., 244854=        During December 2003, we amended our unsecured revolving line of credit to increase the maximum borrowing capacity from $125.0 million to $160.0 million. During June 2004, we amended our unsecured revolving line of credit and extended the expiration date. The credit facility may be used for general corporate purposes, permitted acquisitions and to support letters of credit., 245331=        The credit facility, as amended, expires in July 2008, however, with the lender's consent, the credit facility can be extended for an additional year prior to July 2005. At our option, the credit facility bears interest at a rate equal to either the London InterBank Offered Rate plus 1.00% to 1.75%, or the lender's applicable base rate plus margin of 0.0% to 0.25% based on our ratio of funded debt to earnings before interest, taxes, depreciation and amortization, as defined. A commitment fee of approximately 0.20% to 0.35% per year on the unused portion of the line of credit is payable based on our ratio of funded debt to earnings before interest, taxes, depreciation and amortization, as defined., 120359=        The Internal Market permits existing shareholders to offer to sell or purchase shares of our common stock on predetermined days (each, a Trade Date). Generally, there are four Trade Dates each year which typically occur approximately four weeks after the quarterly meetings of our Board of Directors. Currently our Board of Directors meetings are scheduled for February, May, August and November. All sales of our common stock are made at the price determined by our Board of Directors pursuant to the valuation methodology described below., 33251=        The Private Securities Litigation Reform Act of 1995 provides a safe harbor for forward-looking statements made by or on our behalf. We may from time-to-time make statements that are \"forward-looking,\" including statements contained in this Annual Report on Form 10-K and other filings with the Securities and Exchange Commission (SEC) and in reports to our shareholders. Such statements may, for example, express expectations or projections about future actions that we may take or about developments beyond our control including changes in domestic or global economic conditions. These statements are made on the basis of our management's views and assumptions as of the time the statements are made and we undertake no obligation to update these statements. Our actual results may differ significantly from the results discussed in the forward-looking statements. General factors that might cause such differences include, but are not limited to:, 190878=        In December 2003, we acquired substantially all of the assets and assumed certain liabilities of Lockwood Greene Engineers, Inc. (Lockwood Greene). Lockwood Greene is an industrial engineering and construction firm focused on national and multi-national clients. The operating results of Lockwood Greene are included in our Industrial operating segment., 642341=        A valuation allowance is required to be established for those deferred tax assets that it is more likely than not that they will not be realized. The above valuation allowances relate to foreign net operating losses of $23,257 and $9,600 for the years ended December 31, 2004 and 2003, respectively. Taxable income within the applicable foreign subsidiary are required in order for the deferred tax asset to be realized. The foreign net operating losses can be carried forward for varying terms depending on the foreign jurisdiction., 691610=        The fair values of the shares issued under the STIP during 2004, 2003 and 2002 were $12.07, $11.89 and $11.21, respectively., 96643=        Our backlog at December 31, 2004 was approximately $3,239.6 million. We cannot assure that the revenues projected in our backlog will be realized or, if realized, will result in profits. Projects may remain in our backlog for an extended period of time prior to project execution and, once project execution begins, it may occur unevenly over the current and multiple future periods. In addition, our ability to earn revenues from our backlog depends on the availability of funding for various U.S. federal, state, local and foreign government agencies. Most of our domestic and international industrial clients have termination for convenience provisions in their contracts. Therefore, project terminations, suspensions or reductions in scope may occur from time-to-time with respect to contracts reflected in our backlog. Some backlog reductions would adversely affect the revenue and profit we actually receive from contracts reflected in our backlog. Future project cancellations and scope adjustments could further reduce the dollar amount of our backlog and the revenues and profits that we actually earn., 246640=        The agreement also allows us to issue letters of credit to support various trade activities. Issued letters of credit are reserved against the borrowing base of the line of credit. At December 31, 2004 and 2003 there were $20.4 million and $40.7 million issued and outstanding letters of credit, respectively., 690224=        The estimated fair values of SARs granted during 2004, 2003 and 2002 were $12.53, $11.89 and $11.27, respectively., 682466=        In November 1999, CH2M HILL established the Payroll Deduction Stock Purchase Plan (PDSPP) which provides for the purchase of common stock at 90% of the market value as of the date of purchase through payroll deductions by participating employees. CH2M HILL has reserved 13,000,000 shares of common stock to be issued under the PDSPP. Eligible employees may purchase common stock totaling up to 15% of an employee's compensation through payroll deductions. An employee cannot purchase more than $25 of common stock under the PDSPP in any calendar year. The PDSPP is intended to qualify under Section 423 of the Internal Revenue Code (IRC). The PDSPP is not intended to qualify under Section 401(a) of the IRC and is not subject to ERISA., 191540=        Revenues and pre-tax profit or loss for the years ended December 31, 2004, 2003 and 2002 by operating segment were as follows:, 285272=        Interest rates.    Our interest rate exposure is generally limited to our unsecured revolving credit agreement and a building lease agreement that calls for monthly lease payments at a variable interest rate. Historically, we have used short-term variable rate borrowings under the unsecured revolving credit agreement on a limited basis. There were no amounts outstanding under the unsecured revolving credit agreement at December 31, 2004. Our variable lease payments on the building lease agreement are estimated to be approximately $0.1 million per month, based on current interest rates. We have assessed the market risk exposure on these financial instruments and determined that any significant changes to the fair value of these instruments would not have a material impact on our consolidated results of operations, financial position or cash flows., 230522=        Our primary sources of liquidity are cash flows from operations and borrowings under our unsecured revolving line of credit. Our primary uses of cash are to fund our working capital, acquisitions, capital expenditures and purchases of stock presented on our internal market. We believe based on our total cash and credit capacity at December 31, 2004 of $195.5 million that we have sufficient resources to fund our operations, any future acquisition and capital expenditure requirements,, 204528=        Revenues increased for the year ended December 31, 2004, compared to 2003 by $107.9 million, or 12.2%. All of our businesses within the Federal operating segment improved gross revenue over 2003. Our nuclear business reported significantly higher revenue for the year ended December 31, 2004 compared to 2003, primarily from various contracts with the U.S. Department of Energy's (DOE) Hanford River Protection Project (Hanford) and certain other DOE projects. In the first three quarters of 2004, revenues related to these projects were behind the prior year because of delays in the timing of delivery efforts, however, progress was made on the projects in the fourth quarter of 2004. Our CH2M HILL services business also reported improved revenues over last year resulting from our work on three reconstruction projects in Iraq, Qatar and Jordan that were awarded by the U.S. Department of Defense earlier in 2004. Our environmental services business reported increased revenues from U.S. federal government contracts including increased work on the Johnston Atoll in the Pacific under the ENRAC contract, Superfund work for the U.S. Environmental Protection Agency and continued expansion of our regulatory and construction work for the U.S. Air Force., 54761=        We are partnering with Kaiser Group Holdings, Inc. through a joint venture in which we hold a 50% interest, Kaiser-Hill Company, LLC (Kaiser-Hill), on the closure of the Rocky Flats site in Golden, Colorado. Rocky Flats is a former DOE nuclear weapons production facility. Kaiser-Hill has been performing services under successive contracts awarded by the DOE since 1995, including the oversight of plutonium stabilization and storage, environmental restoration, waste management, decontamination and decommissioning, site safety and security., 588287=        The initial purchase price and fair value estimates recorded for the December 2003 acquisition of Lockwood Greene were adjusted during the year ended December 31, 2004 to reflect changes in working capital pursuant to the provisions of the terms and conditions of the purchase agreement. Additionally, the acquisition of MicroSource resulted in an increase to goodwill for the year ended December 31, 2004 discussed above in Note 6., 238159=        Our contractual obligations at December 31, 2004 are shown below. Based upon our cash flow from operations and our credit capacity discussed above, we believe that we have or have access to adequate financial resources to fund these contractual obligations and fund our operations in 2005 and, 340010=        We have audited management's assessment, included in the accompanying Management's Report on Internal Control over Financial Reporting, that CH2M HILL Companies, Ltd. and subsidiaries maintained effective internal control over financial reporting as of December 31, 2004, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO). CH2M HILL Companies, Ltd. and subsidiaries management is responsible for maintaining effective internal control over financial reporting and for its assessment of the effectiveness of internal control over financial reporting. Our responsibility is to express an opinion on management's assessment and an opinion on the effectiveness of the Company's internal control over financial reporting based on our audit., 164935=        As of February 17, 2005, there were 4,162 holders of record of our common stock. As of such date, all of our common stock of record was owned by our current employees, directors, eligible consultants, and by our various employee benefit plans., 507869=        In December 2004, the FASB issued SFAS No. 123 (Revised) \"Share-Based Payment,\" which replaces SFAS No. 123 and supercedes APB No. 25, \"Accounting for Stock Issued to Employees\". SFAS 123(R) is effective as of the beginning of the first interim or annual reporting period that begins after December 15, 2005. SFAS 123(R) requires that the costs resulting from all share-based payment transactions be recognized in the financial statements. SFAS 123(R) applies to all awards granted after the required effective date, but does not apply to awards granted in periods before the required, 884985=        As of December 31, 2004, the Company has issued approximately 64,288,000 performance units and the estimated value to be paid is accrued as employer incentive plan liability. The payments of the unit bonus will take place upon closure of the Contract, and therefore, the associated accrual is classified as a long-term employee incentive plan liability in the accompanying consolidated balance sheets., 879511=        Contract receivables as of December 31, 2004 and 2003 primarily represent unbilled receivables due under the Contract. Unbilled receivables result from revenue and estimated fees that have been earned by the Company but not billed to the DOE as of the end of the period. Unbilled receivables can be invoiced at contractually defined intervals and milestones. Management anticipates that the current portion of unbilled receivables will be billed and collected in less than one year. Current unbilled receivables primarily represent allowable costs, including subcontractor costs, that have not been submitted to the DOE for payment. These costs cannot be invoiced to the DOE until payment has been made by the Company to the vendor. In addition, under the terms of the Contract, the Company receives a cash payment of 50% of the incentive fee due on a quarterly basis. These quarterly payments increased slightly during the last year and a lump sum additional fee payment was released at the end of the year, both are evidence of DOE's recognition of accelerated work progress. The remainder of the incentive fee, based on projected costs at completion and final closure date, is to be paid by the DOE within 90 days after the completion of the Contract. As such, these amounts are classified as noncurrent in the accompanying consolidated balance sheets. As discussed above, any modifications or changes in the cost estimates or the site closure date will impact these outstanding amounts and could increase or decrease such amounts., 211179=        Revenues increased significantly for the year ended December 31, 2004 compared to 2003 by $492.5 million, or 130.4%. The increase is primarily due to the December 2003 acquisition of Lockwood Greene. Lockwood Greene contributed revenues of $359.6 million for the year ended December 31, 2004. These revenues from Lockwood Greene were generated in projects related to the power, pharmaceutical, chemicals and general manufacturing sectors. Due to the timing of the acquisition, the operating results for Lockwood Greene had minimal impact on our revenues and pre-tax profits during 2003., 225085=progresses toward the targeted closure date of 2006, undistributed earnings could continue to increase if Kaiser-Hill continues to perform at better than cost and schedule targets. This could result in an increase in our investment in Kaiser-Hill, which was $35.2 million and $32.4 million as of December 31, 2004 and 2003, respectively., 134595=        Since the inception of the program on January 1, 2000, the \"M\" factor has not deviated from 1.0. In deciding that the \"M\" factor should remain unchanged, our Board of Directors has considered our, 335525=        In our opinion, the consolidated financial statements referred to above present fairly, in all material respects, the financial position of CH2M HILL Companies, Ltd. and subsidiaries as of December 31, 2004 and 2003, and the results of their operations and their cash flows for each of the years in the three-year period ended December 31, 2004 in conformity with U.S. generally accepted accounting principles., 272212=        We must assess the likelihood that we will be able to recover our deferred tax assets. If recovery is not likely, we must increase our tax provision by recording a valuation allowance for the deferred tax assets that we estimate will not ultimately be recoverable. As of December 31, 2004 and 2003, we reported a valuation allowance of $6.1 million and $3.2 million, respectively., 874702=        The Company maintains its cash accounts primarily with banks located in Colorado, New York, and Washington, D.C. Cash balances are insured by the FDIC up to $100,000 per bank and cash equivalents are not insured by the FDIC. As of December 31, 2004, the majority of the cash balance was made up of cash equivalents., 287635=        We carried out an evaluation as of the last day of the period covered by this Annual Report on Form 10-K, under the supervision and with the participation of our management, including our Chief Executive Officer and Chief Financial Officer, of the effectiveness of the design and operation of our disclosure controls and procedures as defined in Rule 13a-15(e) of the Securities Exchange Act of 1934. Based upon that evaluation, the Chief Executive Officer and Chief Financial Officer concluded that our disclosure controls and procedures (a) are effective to ensure that information required to be disclosed by us in reports filed or submitted under the Exchange Act is timely recorded, processed, summarized and reported and (b) include, without limitation, controls and procedures designed to ensure that information required to be disclosed by us in reports filed or submitted under the Exchange Act is accumulated and communicated to our management, including our Chief Executive Officer and Chief Financial Officer, as appropriate to allow timely decisions regarding required disclosure., 605749=        CH2M HILL is party to two lease agreements related to the corporate headquarters and two adjacent buildings. These lease agreements were recently restructured and the new lessors are not VIEs as the lessors are considered a business per the definition of FIN 46R. These leases remain operating leases. One of the lease agreements calls for monthly lease payments of approximately $400 through March 3, 2013 and requires that CH2M HILL guarantee a residual value of the facilities for approximately $42,000. Upon completion of the lease term, CH2M HILL has the option to purchase the facilities for $53,000. The other lease agreement calls for monthly lease payments at a variable interest rate, estimated to be approximately $100 per month, based on current interest rates. The lease agreement requires that CH2M HILL guarantee a residual value of this building of approximately $17,600. Upon completion of the lease term, CH2M HILL has the option to purchase the additional building from the lessor for $20,800. The lease matures on September 28, 2008 and provides for five one year renewal option., 727581=        At December 31, 2004, the estimated future benefit payments to be paid out in the next ten years for the medical benefit plan are as follows:, 222622=        The earnings from Kaiser-Hill are reported as equity in earnings of joint ventures and affiliated companies, along with other joint ventures that are individually insignificant. For the years ended December 31, 2004, 2003 and 2002 we reported total equity in earnings of joint ventures and affiliated companies of $29.9 million, $26.9 million and $44.0 million, respectively. The earnings from the Kaiser-Hill joint venture for the years ended December 31, 2004, 2003 and 2002 were $20.3 million, $20.0 million and $36.8 million, respectively. The increase in earnings for 2002 is primarily attributable to the portion of the fee that is impacted by cost estimate reductions as a result of favorable performance on the Rocky Flats project for the DOE. Effectively, Kaiser-Hill's performance to date has increased the likelihood of receiving a larger performance fee upon completion. Therefore, the 2002 financial results were adjusted to reflect this positive performance and we recorded $17.0 million of additional earnings ($6.7 million net of incentive accruals and related tax expense) from Kaiser-Hill., 280956=        In January 2003, the FASB issued FIN No. 46, \"Consolidation of Variable Interest Entities,\" which provides guidance on when to consolidate VIEs. In December 2003, the FASB revised FIN 46 with FIN 46R. In addition to conforming to previously issued FASB Staff Positions, FIN 46R deferred the implementation date for certain VIEs. We adopted the provisions of FIN 46R immediately for entities created after December 31, 2003. For entities created before December 31, 2003, we will adopt FIN 46R in the first quarter of 2005, as required., 691815=        Expenses related to common stock awards under the STIP amounted to $12,069, $9,261 and $10,721 in 2004, 2003 and 2002, respectively., 562141=        In 2002, CH2M HILL acquired interests in the following entities for a total cost of $21,404, which was paid for by a combination of cash and the issuance and assumption of notes payable as follows:, 692690=        During the years ended December 31, 2004 and 2003, a total of 208,667 shares and 641,936 shares, respectively, were issued under the LTIP at a fair value of $12.07 and $11.89, respectively., 474802=        CH2M HILL Companies, Ltd. and subsidiaries (CH2M HILL) is a project delivery firm that was founded in 1946. CH2M HILL provides engineering, consulting, design, construction, procurement, operations and maintenance, and program and project management services to federal, state, municipal and local government entities and U.S. federal government agencies, as well as private industry, in the U.S. and internationally. CH2M HILL is an employee-owned Oregon corporation. A substantial portion of professional fees arises from projects that are funded directly or indirectly by government entities., 228987=        The decrease in the effective tax rate for the year ended December 31, 2004 compared to 2003 was primarily due to an increase in tax benefits realized under the Extraterritorial Income Exclusion (EIE) rules, an increase in the utilization of our foreign tax credits for U.S. income tax purposes and the realization of previously deferred foreign losses. Under the EIE rules, taxpayers may elect to exclude from taxable income certain foreign-related income. Our effective tax rate continues to be higher than the U.S. statutory income tax rate of 35.0% due to the effect of state income taxes, non-deductible foreign net operating losses and disallowed portions of meals and entertainment expenses., 794184=        In accordance with the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, this report has been signed by the following persons in the capacities and on the dates stated, through their attorney-in-fact as appointed in the power of attorney of February 23, 2005 included as Exhibit 24 filed herewith., 662119=2004 Stock Option Plan, 687840=        During the years ended December 31, 2004, 2003 and 2002, a total of 36,069, 87,342 and 148,894 phantom stock units, respectively, were granted under the Phantom Stock Plan. At December 31, 2004, there were 189,624 units that remained outstanding., 659681=        The Deferred Compensation Retirement Plan (DCRP) provides that CH2M HILL will pay an additional retirement benefit to certain of its senior executives, if they retire from CH2M HILL on or after age 65. The amount of the DCRP benefit, which may change from time-to-time based on the decision of the Board of Directors of CH2M HILL, currently is equal to 50% of the participant's base salary in effect as of January 1, 2003 minus the value of the offsetting retirement benefits paid by CH2M HILL under other plans. Prior to 2003, the DCRP benefit was funded through the cash surrender value of the then existing split dollar life insurance policies. The method of funding the DCRP benefit changed effective January 1, 2003 to ensure our compliance with the regulatory requirements of the Sarbanes-Oxley Act (SOX). The split dollar life insurance policies and any premium payments thereunder have been frozen in 2002, pursuant to the requirements of SOX. For the year ended December 31, 2004, CH2M HILL expensed $278 for the anticipated DCRP benefit obligations. Because the previously anticipated funding mechanism for the DCRP is no longer, 556255=        The depreciation expense reflected in the accompanying consolidated statements of income totaled $7,170 in 2004, $5,832 in 2003 and $6,834 in 2002., 595088=        During December 2003, CH2M HILL amended its unsecured revolving line of credit to increase the maximum borrowing capacity from $125,000 to $160,000. During June 2004, CH2M HILL amended its unsecured revolving line of credit and extended the expiration date. The credit facility may be used for general corporate purposes, permitted acquisitions and to support letters of credit. During the year ended December 31, 2004, CH2M HILL's average daily borrowing was $13,794 under this credit facility for general corporate purposes. There were no amounts outstanding under the line of credit at December 31, 2004 or 2003., 521634=        CH2M HILL routinely enters into joint ventures to service the needs of its clients. Such arrangements are customary in the engineering and construction industry and generally are project specific. CH2M HILL accounts for its investments in affiliated unconsolidated companies using the equity method of accounting. As of December 31, 2004 and 2003, the investments in unconsolidated affiliates were approximately $58,697 and $53,492, respectively. CH2M HILL's proportionate share of net income or loss is included as equity in earnings of joint ventures and affiliated companies on the accompanying consolidated statements of income. CH2M HILL has the following significant investments in affiliated unconsolidated companies accounted for under the equity method of accounting:, 663067=        CH2M HILL's 1999 Stock Option Plan was approved by the Board of Directors on November 6, 1998 to reserve 8,000,000 shares of CH2M HILL common stock for issuance upon exercise of stock options granted under this plan. Stock options are granted at an exercise price equal to the fair market value of CH2M HILL's common stock at the date of grant. Stock options granted generally become exercisable 25%, 25% and 50% after one, two and three years, respectively, and have a term of five years from date of grant., 834411=KAISER-HILL COMPANY, LLC AND SUBSIDIARY Consolidated Statements of Members' Equity Years ended December 31, 2004, 2003, and 2002 (Amounts in thousands of dollars), 607043=        Rental expense charged to operations was $69,668, $60,560 and $56,949 during 2004, 2003 and 2002, respectively. Certain of CH2M HILL's operating leases contain provisions for a specific rent-free period. CH2M HILL accrues rental expense during the rent-free period based on total expected rent payments to be made over the life of the related lease., 135281=        Profit After Tax (\"P\").    \"P\" is profit after tax, otherwise referred to as net income, for the four fiscal quarters immediately preceding the Trade Date. Our Board of Directors at its discretion may exclude from the calculation nonrecurring or unusual transactions. Nonrecurring or unusual transactions are developments that the market would not generally take into account in valuing an equity security. A change in accounting rules, for example, could increase or decrease net income without changing the fair market value of our common stock. Similarly, such a change could fail to have an immediate impact on the value of our common stock, but still have an impact on the value of our common stock over time. As a result, our Board of Directors believes that in order to determine the fair market value of our common stock, it needs the ability to review unusual events that affect net income. In the past, our Board of Directors has excluded unusual items from the calculation of \"P\", including nonrecurring revenue from the Rocky Flats project and a write off of an investment in an international telecommunications company. Because \"P\" is calculated on a four quarter basis, an exclusion impacts the calculation of fair market value for four consecutive quarters. There were no such nonrecurring or unusual transactions affecting \"P\" during 2004. Consequently, no exclusions are currently being taken into account in calculating the value of \"P\". It is possible, however, that our Board of Directors will determine to exclude future unusual or non-recurring items from the calculation of \"P\". For example, substantial incentive fees could be earned upon closure of the Rocky Flats facility in 2006. Such a non-recurring payment would likely be disregarded by the marketplace in evaluating our profitability on a go forward basis and therefore could be appropriate for exclusion by our Board of Directors, although no final decision has been reached at this time., 337209=Denver, Colorado February 23, 2005, 691206=        During the years ended December 31, 2004, 2003 and 2002, a total of 869,109 shares, 943,907 shares and 1,170,676 shares, respectively, were issued under the STIP., 581566=        The contracts-in-place are being amortized on a straight-line basis over the total life of the contracts of one to seven years. The other intangible assets are being amortized over their expected useful lives of one to six years. The amortization expense reflected in the accompanying consolidated statements of income totaled $8,599 in 2004, $5,260 in 2003 and $4,527 in 2002. These intangible assets are expected to be fully amortized in 2010. The estimated amortization expense related to these intangible assets is:, 866469=KAISER-HILL COMPANY, LLC AND SUBSIDIARY Notes to Consolidated Financial Statements December 31, 2004 and 2003, 214863=Results of Operations for the Year Ended December 31, 2003 Compared to 2002, 560881=        In December 2003, CH2M HILL acquired substantially all of the assets and assumed certain liabilities of Lockwood Greene Engineers, Inc., (Lockwood Greene). Lockwood Greene is an engineering and construction firm focused on national and multi-national industrial clients throughout the U.S. and certain countries in Europe, Latin America and Asia. CH2M HILL completed the acquisition for total consideration of approximately $100,191. The purchase price, net of cash acquired,, 694667=        The weighted-average fair values of the shares issued under the Restricted Stock Plan during 2004, 2003 and 2002 were $12.22, $11.92 and $11.43, respectively., 345357=        We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the consolidated balance sheets of CH2M HILL Companies, Ltd. and subsidiaries as of December 31, 2004 and 2003, and the related consolidated statements of income, shareholders' equity and comprehensive income, and cash flows for each of the years in the three-year period ended December 31, 2004, and our report dated February 23, 2005 expressed an unqualified opinion on those consolidated financial statements., 683298=        During the years ended December 31, 2004, 2003 and 2002, a total of 817,358 shares, 904,476 shares and 870,531 shares, respectively, were issued under the PDSPP, for total proceeds of $9,503, $9,714 and $8,921, respectively., 878865=        In addition, the Company performed approximately $3,999,000 and $4,892,000 of services on behalf of CH2M HILL during 2004 and 2003, respectively., 187842=        We are one of the largest engineering services firms worldwide and are employee-owned. Our business provides engineering, construction, operation, major project management and related technical services to municipal, state, federal and private sector clients worldwide. Founded in 1946, we have nearly 14,000 employees worldwide., 189964=        We provide services to our clients through three operating segments: Federal, Civil Infrastructure and Industrial. In 2004, we reorganized such that our operating segments are more closely aligned with the types of clients we serve. The structure is intended to provide for better decision making on an enterprise-wide basis. For example, while our Federal segment generally provides a comprehensive range of services to the U.S. federal government, it also provides services to international governments. Our Civil Infrastructure segment generally provides a comprehensive range of services to various state and local governments. Our Industrial segment generally provides a comprehensive range of services to various private sector clients., 730412=        During the years ended December 31, 2004 and 2003, CH2M HILL recorded a minimum pension liability adjustment of $2,552 (net of taxes of $1,618) and $811 (net of taxes of $514), respectively. The adjustments are reflected in other comprehensive income and are required when the accumulated benefit obligation exceeds the fair value of the underlying pension plan assets. The non-cash charges to shareholders' equity are reviewed annually in connection with the actuarial valuation of the pension plans and are subject to adjustment at that time., 88708=        In 2004, we derived approximately 11% of our revenues from operations outside of the U.S. Such operations are subject to a variety of risks associated with conducting business internationally. These risks include:, 599309=        At December 31, 2004, future minimum principal payments on notes payable are as follows:, 275076=The amount by which the ABO exceeds the fair value of plan assets, after adjusting for previously recorded accrued or prepaid pension cost for the plan, must be recorded as a minimum pension liability adjustment, with a corresponding increase in an intangible asset, if appropriate, and a reduction to shareholders' equity. The non-cash after-tax adjustment related to our recording of a minimum pension liability adjustment in 2003 did not impact earnings, but reduced our shareholders' equity by $15.5 million, net of tax., 217094=        Revenues increased for the year ended December 31, 2003 compared to 2002 by $74.5 million, or 9.1%. The increase was primarily attributable to significant growth in our water, wastewater and water resources business, as well as operations and maintenance business. These increases were achieved primarily from the strong performance of both our traditional and design/build North American operations. Market conditions continued to improve domestically as utilities invested in water related facilities. These investments domestically and abroad are driven by population and economic growth in certain regions, and capacity shortfalls and regulatory requirements in other regions. Further, our transportation business has seen some increases in business due to solid federal funding that remains intact, although state and local funding was down., 172279=        The following data has been derived from our consolidated financial statements. In 2004, 2003 and 2002, the financial statements from which this data was derived were reported on by KPMG LLP, an independent registered public accounting firm. Previously, the financial statements from which this data was derived were reported on by other independent auditors who have ceased operations. During the periods presented, we paid no cash dividends on our common stock. The following information should be read in conjunction with \"Management's Discussion and Analysis of Financial Condition and Results of Operations\" and the consolidated financial statements and related notes thereto, included in this Annual Report on Form 10-K., 336284=        We also have audited, in accordance with the standards of the Public Company Accounting Oversight Board (United States), the effectiveness of CH2M HILL Companies, Ltd. and subsidiaries internal control over financial reporting as of December 31, 2004, based on criteria established in Internal Control—Integrated Framework issued by the Committee of Sponsoring Organizations of the Treadway Commission (COSO), and our report dated February 23, 2005 expressed an unqualified opinion on management's assessment of, and the effective operation of, internal control over financial reporting., 662188=        CH2M HILL's 2004 Stock Option Plan was approved by the Board of Directors on February 13, 2004 to reserve 5,000,000 shares of CH2M HILL common stock for issuance upon exercise of stock options granted under this plan. Stock options are granted at an exercise price equal to the fair market value of CH2M HILL's common stock at the date of grant. Stock options granted generally become exercisable 25%, 25% and 50% after one, two and three years, respectively, and have a term of five years from date of grant. There were no grants of options under the 2004 Stock Option Plan during the year ended December 31, 2004., 881889=        As of December 31, 2004 and 2003, the Company has $131.8 million and $113.8 million, respectively, of long-term unbilled receivables that represent incentive fee under the Contract. These can be billed at the completion of the Contract. In addition, the Company has current unbilled receivables of $101.3 million and $100.0 million as of December 31, 2004 and 2003, respectively. This is comprised of $8.1 million and $7.9 million, respectively, of incentive fees and $93.2 million and $92.1 million, respectively, of direct reimbursable costs under the Contract. All of these amounts are expected to be billed in early 2005., 694119=        During the years ended December 31, 2004, 2003 and 2002, a total of 186,161 shares, 27,498 shares and 33,062 shares, respectively, were issued under the Restricted Stock Plan. At December 31, 2004, there were 205,755 shares that remained restricted., 67045=        The following table provides backlog revenues by operating segment and the consolidated totals for the year ended December 31, 2004 and 2003:, 338705=        Based on our evaluation under the framework in Internal Control—Integrated Framework, our management concluded that our internal control over financial reporting was effective as of December 31, 2004., 209627=        Pre-tax profit decreased by $4.1 million, or 13.0%, for the year ended December 31, 2004 compared to 2003. The decrease is primarily attributable to increased costs on certain projects that were greater than anticipated due to project delivery issues in addition to project overruns on several smaller projects in our transportation business. Additionally, the transportation business incurred increased overhead spending and significantly increased business development expenditures compared to 2003. While the business development expenditures did reduce pre-tax profit for 2004, we anticipate that, with the recent win of a major highway/bridge project and several other major design/build projects being pursued or awaiting award, our pre-tax profit will improve in 2005. Our operations and maintenance business incurred increased costs on projects and a deterioration of project margins driven by competition for market share. However, we began showing slight improvement in pre-tax profit late in 2004 indicating that we are beginning to improve as we move into 2005 due to increased project controls, risk management processes and cost containment efforts. These decreases in pre-tax profit were offset by improvements in our water, wastewater and water resources business, as a result of higher overall margins and controlled overhead spending., 877443=        In 2004 and 2003, the Members were subcontracted by the Company to perform certain tasks under the Contract. The \"Payable to Members\" in the accompanying consolidated balance sheets as of December 31, 2004 and 2003 consists of $-0- and $250,000, respectively, to Kaiser and $2,564,000 and $398,000, respectively, to CH2M HILL for these subcontracted tasks. These payables are noninterest bearing., 774568=        CH2M HILL is party to various contractual guarantees and legal actions arising in the normal course of business. From time to time, agencies of the U.S. government investigate whether CH2M HILL's operations are being conducted in accordance with applicable regulatory requirements. Because a large portion of CH2M HILL's business comes from federal, state and municipal sources, CH2M HILL's procurement practices at times are also subject to review and occasional investigations by U.S. and state attorneys offices. Such state and U.S. government investigations, whether relating to government contracts or conducted for other reasons, could result in administrative, civil or criminal liabilities, including repayments, fines or penalties or could lead to suspension or debarment from future U.S. government contracting. These investigations often take years to complete and many result in no adverse action. Damages assessed in connection with and the cost of defending any such actions could be substantial. While the outcome of pending proceedings are often difficult to predict, as of February 23, 2005 management believes that no ongoing litigation or investigation is likely to result in a material adverse impact on CH2M HILL's consolidated financial statements., 274245=        An actual example of how changes in these assumptions can affect our financial statements occurred in 2003. Based on our review of market trends and other factors, we lowered the discount rate assumption to 6.25% for 2003, from 6.95% for 2002. This change, together with other factors such as the effects of the actual return on plan assets, resulted in an adjustment in the shareholders' equity section of our balance sheet to reflect a minimum pension liability adjustment. This adjustment is determined by comparing the accumulated benefit obligation (ABO) to the fair value of plan assets., 534298=Management concluded that the fair market value of the investment had declined materially and that this decline was not temporary due to the deteriorating market conditions in the telecommunications industry and CAI's inability to secure timely financing for projects. The impact of the write-off is included in general and administrative expenses in the accompanying consolidated statements of income for the year ended December 31, 2002., 278125=        The American Jobs Creation Act created a temporary incentive for U.S. multinationals to repatriate accumulated earnings outside of the U.S. by providing an 85% dividend received deductions from controlled foreign corporations. In December 2004, the FASB issued FASB Staff Position No. 109-2, \"Accounting and Disclosure Guidance for the Foreign Earnings Repatriation Provision within the American Jobs Creation Act of 2004,\" which provides accounting and disclosure guidance for this repatriation provision. We have not completed our evaluation of the new repatriation provisions and we do not expect to complete our evaluation until after Congress or the Treasury Department provides additional guidance clarifying key elements of the provision. We expect to complete our evaluation of the effects of these provisions within a reasonable period of time following the publication of additional clarifying language. The range of possible amounts that we are currently considering eligible for repatriation is between zero and $20.0 million, as of December 31, 2004. The related potential range of income tax cannot be reasonably estimated. While we are currently studying the impact of the one-time favorable repatriation provision, it is our intention to continue to indefinitely reinvest our undistributed foreign earnings., 776961=        CH2M HILL's quarterly financial information for the year ended December 31, 2004 and 2003 is as follows:, 644027=        At December 31, 2004, CH2M HILL had a net operating loss (NOL) for federal and state income tax purposes of $1,537, which may be available to offset future taxable income and expires in 2024. This NOL is solely attributable to one of CH2M HILL's consolidated subsidiaries. Management believes that based on the subsidiary's earnings and projected future earnings, no valuation allowance is necessary at December 31, 2004., 645379=Creation Act of 2004,\" which provides accounting and disclosure guidance for this repatriation provision. CH2M HILL has not completed its evaluation of the new repatriation provisions and does not expect to complete its evaluation until after Congress or the Treasury Department provides additional guidance clarifying key elements of the provision. CH2M HILL expects to complete its evaluation of the effects of these provisions within a reasonable period of time following the publication of additional clarifying language. The range of possible amounts that management is currently considering eligible for repatriation is between zero and $20,000, as of December 31, 2004. The related potential range of income tax cannot be reasonably estimated. While management is currently studying the impact of the one-time favorable repatriation provision, it is management's intention to continue to indefinitely reinvest our undistributed foreign earnings., 559751=        During 2004, CH2M HILL acquired certain assets and liabilities of the following entities for a total cost of $5,174, which was paid for in cash:, 98516=        In 2004, we derived approximately 27% of our revenues from \"fixed price\" contracts and approximately 18% of our revenues from time-and-materials contracts, some of which had \"not to exceed\" price limits. Under \"fixed price\" contracts, we agree to deliver projects for a definite, predetermined price regardless of our actual costs incurred over the life of the project. Under time-and-materials contracts with \"not to exceed\" provisions, we are compensated for the labor hours expended at agreed-upon hourly rates plus cost of materials used; however, there is a stated maximum compensation for the services to be provided under the contract. Many fixed price and \"not to exceed\" contracts involve large industrial facilities and public infrastructure projects and present the risk that our costs to complete a project may exceed the fixed price or \"not to exceed\" price agreed upon with the client. The fixed or maximum fees negotiated for such projects may not cover our actual costs and desired profit margins. If our actual costs for a fixed or \"not to exceed\" price project are higher than we expect, our profit margins on the project will be reduced or we could suffer a loss., 116284=        Our corporate headquarters is located in Englewood, Colorado, where we lease approximately 155,000 square feet of space. The lease on the corporate headquarters expires in 2013. In addition, we lease office space around the world on commercially available terms. We believe that our existing facilities are adequate for the present needs of our business and that suitable additional or substitute space will be available as needed to accommodate any expansion of operations., 889131=        The Agreement also contains various financial covenants, including tangible net worth, fixed charge ratio, and minimum cash balances requirements, among other restrictions. The Company was in compliance with all restrictive covenants at December 31, 2004., 690419=        Expenses related to the SAR Plan amounted to $242, $333 and $611 in 2004, 2003 and 2002, respectively., 275638=        In 2004 we lowered the discount rate assumption to 5.90%. The non-cash after-tax adjustment in 2004 was $2.6 million and is reflected in accumulated other comprehensive loss in the consolidated statements of shareholders' equity and comprehensive income. This adjustment is computed each year and may reverse in the future if financial markets improve and interest rates increase, or may increase if financial market performance is less than expected and/or interest rates decline., 867025=        Kaiser-Hill Company, LLC and subsidiary (the Company) was formed on October 24, 1994. The principal business of the Company is to procure, execute, deliver, and perform under a contract with the Department of Energy (DOE) to manage the programs and facilities at Rocky Flats Environmental Technology Site (RFETS) in Golden, Colorado. The mission of the RFETS is directed toward cleanup, deactivation, and preparation for decontamination and disposition of these DOE facilities., 165529=        We have never declared or paid any cash dividends on our capital stock and no cash dividends are contemplated in the foreseeable future. We intend to retain any future earnings to finance the growth and development of our business. Under our existing unsecured revolving line of credit, which expires in July 2008, payment of dividends would represent a violation of our covenants., 37835=        We provide services to our clients through three operating segments: Federal, Civil Infrastructure and Industrial. In 2004, we reorganized such that our operating segments are more closely aligned with the types of clients we serve. The structure is intended to provide for better decision making on an enterprise-wide basis. For example, while our Federal segment generally provides a comprehensive, 810092=KAISER-HILL COMPANY, LLC AND SUBSIDIARY Consolidated Balance Sheets December 31, 2004 and 2003 (Amounts in thousands of dollars), 219894=        Pre-tax loss improved by $1.8 million, or 11.7%, for the year ended December 31, 2003 compared to 2002, of which $0.5 million was related to Lockwood Greene. Pre-tax profit for the year ended December 31, 2002 was negatively impacted by the one time write-off of a $10.0 million equity investment (which is estimated to be $3.6 million, net of incentive compensation accrual reductions and tax benefits). These improvements in the pre-tax loss for the Industrial segment were offset by a decline in our industrial business due to low workload volumes and a competitive market which forced reductions in project margins. Indirect labor costs, which consist of salaries and benefits of all administrative personnel, plus salaries and benefits of technical personnel for hours not spent working on billable client services, decreased as a percent of total labor costs. This decrease in non-billable labor was primarily due to labor reductions related to the decline in the microelectronics industry., 693507=        In January 2000, CH2M HILL established the Restricted Stock Plan which provides eligible individuals with added incentives to continue in the long-term service of CH2M HILL. The awards are made for no consideration and generally vest over a three-year period. Compensation expense is measured by the market value of the shares on the grant date and is generally spread over the three-year vesting period. The unamortized compensation expense is included in shareholders' equity on the accompanying consolidated balance sheets., 92544=        In 2004, we derived approximately 37% of our total revenues from contracts with the U.S. federal government and international governments. In addition, we own equity interests in joint ventures with revenues attributable primarily or entirely to contracts with U.S. federal government clients. The following risks are inherent in U.S. federal government contracts:, 282686=        We have classified entities identified as VIEs into two groups, the first of which includes those entities that we will be required to consolidate under the guidance of FIN 46R in the first quarter of 2005 and the second group which includes those entities which we will not be required to consolidate. At December 31, 2004, the assets and liabilities, including minority interest balances, of the identified VIEs that will be consolidated are $43.1 million and $35.7 million, respectively, of which we currently consolidate $5.4 million and $4.2 million, respectively. At December 31, 2004, the assets and liabilities of the identified VIEs that will not be consolidated are $36.0 million and $31.7 million, respectively., 890186=        In accordance with the Contract, the Company participates in several multiple employer benefit plans covering substantially all employees who meet length of service requirements. These plans include a defined benefit pension plan and two defined contribution plans, the latter of which provide for Company matching contributions. Additionally, in 2004 the Company assumed responsibility for a second defined benefit pension plan for the Security Police Officers previously provided by subcontract. The Company contribution amounts for the defined contribution plans were approximately $1,070,000 and $1,227,000 for 2004 and 2003, respectively. During 2004, the Company made combined contributions to the defined benefit pension plans of $4,842,000. No amounts were contributed to the defined pension benefit plan during 2003 because the current level of funding did not require contributions to be made., 872273=        Under the Contract, revenue is recognized using the percentage-of-completion method whereby revenue is accrued in an amount equal to cost plus management's best estimate of incentive fees. Incentive fees are estimated based on projected total Contract costs and site closure date. The Company continually monitors its progress toward the completion dates and its estimated costs at completion and will modify its estimates of fees to be earned as needed. Changes in these estimates could have a significant effect on future earnings of the Company. During 2004, management revised, 533877=        During 2002, CH2M HILL recorded an asset impairment charge for $10,000 for a minority interest in an international telecommunications investment company, CAI Investments, LLC (CAI)., 206275=        Pre-tax profit increased for the year ended December 31, 2004, compared to 2003 by $2.0 million, or 6.2%. Our earnings on certain nuclear projects (primarily with the DOE) have increased compared to 2003 and the reconstruction projects in the Middle East in our CH2M HILL services business positively impacted our pre-tax profits. Additionally, we continue to be successful in our administrative cost containment efforts., 724381=        At December 31, 2004, the estimated future benefit payments to be paid out in the next ten years for the noncontributory defined benefit pension plans are as follows:, 825205=KAISER-HILL COMPANY, LLC AND SUBSIDIARY Consolidated Statements of Income Years ended December 31, 2004, 2003, and 2002 (Amounts in thousands of dollars), 719148=        For measurement purposes, a 7.96% annual rate of increase in the per capita cost of covered health care benefits was assumed for 2004. The rate was assumed to decrease gradually to 4.15% for 2011 and to remain at that level thereafter., 204295=Results of Operations for the Year Ended December 31, 2004 Compared to 2003, 515572=        The U.S. federal government accounted for 27% of CH2M HILL's net receivables at December 31, 2004 and 22% at December 31, 2003. Receivables are stated at net realizable values. The changes in the allowance for uncollectible accounts consist of the following:, 598815=        As part of the Gee & Jensen acquisition, CH2M HILL issued a $1,000 note payable to a former shareholder, which was paid in January 2005. In addition, CH2M HILL assumed a mortgage note on a building, which matures in 2010 and bears interest at a fixed rate of 9.4%. The principal balance of the mortgage note as of December 31, 2004 is $2,803., 761859=        CH2M HILL derived approximately 37%, 41% and 40% of its total revenues from contracts with the U.S. federal government and international governments in 2004, 2003 and 2002, respectively., 224172=        During the years ended December 31, 2004, 2003 and 2002, we recognized undistributed earnings from Kaiser-Hill of $2.8 million, $3.6 million and $21.1 million, respectively. Kaiser-Hill's ability to distribute cash is based on pre-negotiated payment terms in accordance with its contract with the DOE and can be different from the earnings recognized for accounting purposes. As the cleanup of the site, 689722=        During the years ended December 31, 2004, 2003 and 2002, a total of 114,625, 118,387 and 113,100 SARs, respectively, were granted. At December 31, 2004, there were 338,878 SARs that remained outstanding., 792707=        Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned, thereunto duly authorized, in the City of Englewood, Douglas County, State of Colorado, on the 23rd day of February, 2005., 693069=        Expenses related to common stock awards under the LTIP amounted to $4,667, $3,606 and $5,185 in 2004, 2003 and 2002, respectively., 208742=        Offsetting the decline in revenue in our water, wastewater and water resources business was continued growth from successful pursuits in design/build services with key cruise terminal and highway bridge projects, an increase in transportation consulting and an increase in transportation projects in Canada. Our operations and maintenance business reported a slight improvement in revenues over last year. The relatively flat growth in the operations and maintenance business was attributable to the reduction in scope of certain active projects resulting in lower service fees and lost revenue derived from non-renewed projects which were offset by newly acquired projects, as targeted projects with negative margins were exited during 2004 as part of our strategy to improve overall margin performance.}",
    "lastModified": "Sat, 06 Dec 2014 00:39:47 GMT",
    "textBeforeTable": "Form 10-K UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, DC 20549 Use these links to rapidly review the document TABLE OF CONTENTS //-->",
    "textAfterTable": "  Selected Financial Data Item 7.   Management's Discussion and Analysis of Financial Condition and Results of Operations Item 7A.   Quantitative and Qualitative Disclosures About Market Risk Item 8.   Financial Statements and Supplementary Data Item 9.   Changes in and Disagreements With Accountants on Accounting and Financial Disclosure Item 9A.   Controls and Procedures Item 9B.   Other Information PART III.     Item 10.   Directors and Executive Officers of the Registrant Item 11.   Executive Compensation",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}