{
    "relation": [
        [
            "Author",
            "m0ns00n",
            "Joined: 2005/7/8 From: Norway Comments: 413",
            ""
        ],
        [
            "Thread",
            "Published: 2012/5/27 11:43 Updated: 2012/5/27 11:43",
            "First fix the gui Many features of AROS doesn't work right yet. But it is getting close. But because basic functions are still buggy, I would still call AROS a toy OS. Some things needs to be done before it can be called a serious end-user OS: 1. Fix Zune (it's very broken) 2. Fix Wanderer or replace it with something complete (Wanderer coughs if there are a couple of hundred files in a folder). 3. Fix public screen management 4. Fix intuition, so we don't need hacky \"decor\" type patches to make it pretty Basically, just make it complete for the end user. Core devs could know that there were lots of libs not finished etc, but make it complete in use.. DOS didn't require much to be a complete OS, but AROS promises a bit more. Once it has stabilized and at least implemented the four above, I think it is time to move out of the alpha/toy state. ABI v1 is a little hinder.. But perceivably it is easily overcome, as long as the distributions move along with it and devs update / recompile their software.",
            ""
        ]
    ],
    "pageTitle": "Polls - AROS-Exec",
    "title": "",
    "url": "http://aros-exec.org/modules/xoopspoll/pollresults.php?poll_id=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00310-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 15776951,
    "recordOffset": 15758315,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The comments are owned by the author. We aren't responsible for their content. FlatThreadedNested Oldest FirstNewest First Total Votes: 167 Total Voters: 155 9 % (16) Say What? 19 % (33) False 70 % (118) True Ended at 2012/6/20 12:40 As of now AROS is no longer a toy OS more... Guests: 1 Members: 0",
    "textAfterTable": "It's just a matter of time before AROS is taking over the world \\o/\\o/ just 2 cents, Author Thread Manu Published: 2012/3/19 5:11   Updated: 2012/3/19 5:11 Joined: 2004/3/30 From: Comments: 1265  Re: As of now AROS is no longer a toy OS I agree that AROS is not a toy OS anymore. If we in the future get enough open source software ported over to it I see no reason why it couldn't be my preferred OS even when working on my hobbies. Author Thread f40 Published: 2012/3/21 5:52  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}