{
    "relation": [
        [
            "Patent application number",
            "20110050900",
            "20110131088"
        ],
        [
            "Description",
            "IMAGE PROCESSING APPARATUS, WEARABLE IMAGE PROCESSING APPARATUS, AND METHOD OF CONTROLLING IMAGE PROCESSING APPARATUS - According to one embodiment, an image processing apparatus includes an imaging unit, a selecting unit, a receiving unit, and a delivering unit. The imaging unit picks up a video of a cooking scene. The selecting unit selects, out of order items received from a customer, an order item to be delivered. The receiving unit receives, from a user, a delivery instruction for a video of a cooking scene related to the selected order item. The delivering unit delivers the picked-up video of the cooking scene according to the received delivery instruction.",
            "SHOPPING SUPPORTING APPARATUS AND METHOD - According to one embodiment, a purchase file stores, by commodity, as information concerning purchase-desired commodities specified by a specifying unit, at least the numbers of purchase-planned items and purchase-planned amounts of the commodities. A privilege granting unit grants a privilege to the purchase of the purchase-desired commodities when a total of a total number of purchased items of the purchase-desired commodities obtained from a purchase-results storing unit, which stores information concerning commodities already purchased by a customer, and the numbers of purchase-planned items of the same commodities stored in the purchase file or a total of a total amount of purchased items of the purchase-desired commodities obtained from the purchase-results storing unit and purchase-planned amounts of the same commodities stored in the purchase file is equal to or larger than a threshold. A privilege display unit displays information concerning the privilege granted by the privilege granting unit."
        ],
        [
            "Published",
            "03-03-2011",
            "06-02-2011"
        ]
    ],
    "pageTitle": "Sato, Shizuoka - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/sato-shizuoka-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432844798,
    "recordOffset": 432828837,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Yoshimi Sato, Shizuoka JP 05-14-2009 Intake port of internal combustion engine - An internal combustion engine wherein the top wall surface of the intake air inflow passage part of the intake port is formed by a first top wall surface and a second top wall surface lower than the first top wall surface and wherein a lower layer flow passage and an upper layer flow passage are formed at the height position of the second top wall surface as a boundary. When the intake valve opens, a lower layer flow flowing through the inside of the lower layer flow passage passes through the intake valve opening region, flows to the circumferential direction of the combustion chamber, and generates a swirl, while an upper layer flow flowing through the inside of the upper layer flow passage passes through the helical part and flows into the combustion chamber. 20090120399 Published Description Patent application number Yasuo Sato, Shizuoka JP 02-03-2011 IMAGE FORMATION APPARATUS - According to one embodiment, an image formation apparatus includes storage, an image formation unit, an attribute change acceptance unit, and an image converter. The storage stores image data of multiple pages of document. The image formation unit reads the image data from the storage, and forms an image of the read image data on a recording medium. The attribute change acceptance unit accepts a change in attribute information for forming images of continued pages",
    "textAfterTable": "Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}