{
    "relation": [
        [
            "Team",
            "Prime Time",
            "LMG",
            "Black & Blue",
            "808 Beatdown",
            "Bad Intensions",
            "Top Prospects",
            "The Heights",
            "Nellis",
            "VGR",
            "Da Klick",
            "MP"
        ],
        [
            "W",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1",
            "0",
            "0",
            "0"
        ],
        [
            "L",
            "0",
            "0",
            "0",
            "1",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "2"
        ],
        [
            "T",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Community Sports - 2/25/09 | Las Vegas Review-Journal",
    "title": "",
    "url": "http://www.reviewjournal.com/sports/community-sports-22509",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00079-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 676335227,
    "recordOffset": 676309948,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80383=Adult coed and men's softball teams ages 21 and older are invited to register for evening and Saturday leagues beginning March 9., 78942=The WSNGA will host its amateur championship on April 4 and 5 at Palm Valley Golf Club in Sun City Summerlin., 82892=The final camp is the \"College Prep Camp,\" which will run from July 30 through Aug. 2., 81943=The camps are specialized for either individual or team teaching and will run during a two-week time period beginning on July 20 and ending on Aug. 2., 77322=The city of Las Vegas Department of Leisure Services invites boys and girls ages 6 to 14 to participate in spring Saturday flag football leagues that begin March 14 and 21., 77085=For more information on the Wolverines, call Coach Kelly at 834-2025., 76965=For more information on the Renegades, call Coach Joe at (773)406-0278 or Coach Brandon at 278-2502., 74961=The league runs through April 4., 83267=For more information, visit the program's Web site at unlvvolleyballcamps.com or call assistant coach Elaini Kollias at 895-1897., 75176=Teams will be drafted on Feb. 20 and 21 and games will begin on Feb. 26., 78668=Robison Community School--229-2542, 74176=A coaches meeting will be held at 6 p.m. on March 11., 78722=Veteran's Memorial Leisure Services Center--229-1100, 80600=Registration will remain open until leagues are filled or March 20., 82429=UNLV will then host its \"High School Camp\" from 9:30 a.m. until 3:30 p.m. on July 23 through 26. The camp will emphasize skill instruction, team drills and competitive play and will be divided by skill level., 78331=Brinley Community School--229-2642, 82667=An \"All Skill Camp\" will run from 9:30 a.m. until 3:30 p.m. on July 27 through 29. It is for boys and girls between grades 7 and 9. It features the same setup and premise as the high school camp., 81220=Teams are now forming for the Junior Team Tennis league, which begins on March 2., 81080=For more information, call (702) 229-1527., 82113=The \"Youth Camp\" will run from 10 a.m. until 3 p.m. from July 20 through 22, while the \"Team Camp\" will go from 5 to 9 p.m. on July 20 through 24., 44195=Division Standings through Feb. 23, 80532=The leagues will begin play the week of April 6., 74371=For more information contact Roger at 229-1736., 74249=The league begins on March 19 and costs $250 per team, plus officials' fees of $25 per team, per game.}",
    "lastModified": "Mon, 03 Aug 2015 04:47:14 GMT",
    "textBeforeTable": "Rookies Division Youth Basketball Standings National Junior Basketball Northwest Chapter BASKETBALL Community Sports - 2/25/09 Posted February 25, 2009 - 9:41am CLARK TOPS WESTERN IN GIRLS... Today at Santa Anita   Print           Sports Home » You are here   App Best of LV Nifty Nickel Shopping Holiday directory Service Directory Deals Coupons Legals Classifieds Homes Autos Marketplace Job Fairs Post",
    "textAfterTable": "3 Celtics 4 5 Bulldogs 3 6 Nets 0 9 Scores Rockets 39, Celtics 34 Lakers 42, Bulldogs 24 Suns 45, Nets 28 Division 2 Boys Team W L Irish 8 1 Rebels 7 2 Suns 6 3 NJB Ballers 4 5 Dolphins 2 7 Fire 0 9 Scores Rebels 47, Fire 40 Suns 31, Dolphins 18 Irish 40, NJB Ballers 24 Division 3 Boys Team W L Bobcats 8 1 Tarheels 8 1 Wildcats 8 1 Rebels 4 5 Celtics 3 6 Thunder 3 6 Bearcats 1 8 Cougars 1 8 Scores Rebels 31, Cougars 25 Wildcats 31, Thunder 23 Bobcats 30, Bearcats 13 Tarheels 39, Celtics 20 Division 1 Girls Team W L Polynation 7 1 Mini Gaels 6 1 Rebels 5 3 Hoopsters 4 4 Hoyas 2 6 AND 1 0 9 Scores Polynation 22, Rebels 10 Mini Gaels 40, AND1 8 Hoopsters 27, Hoyas 14 Division 3 Girls Team W L Wolfpack 8 1 Sparks 7 2 Rockers 6 3 Bulldogs 3 6 Comets 2 7",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}