{
    "relation": [
        [
            "Level",
            "1",
            "1",
            "6",
            "16"
        ],
        [
            "Name",
            "Growl",
            "Bide",
            "Struggle Bug",
            "Bug Bite"
        ],
        [
            "Type",
            "",
            "",
            "",
            ""
        ],
        [
            "Class",
            "",
            "",
            "",
            ""
        ],
        [
            "Power",
            "--",
            "1",
            "30",
            "60"
        ],
        [
            "Accuracy",
            "100%",
            "--",
            "100%",
            "100%"
        ],
        [
            "PP",
            "40",
            "10",
            "20",
            "20"
        ],
        [
            "Effect",
            "Lowers the target's Attack by one stage.",
            "User waits for 2-3 turns, then hits back for twice the damage it took.",
            "Has a 100% chance to lower the target's Special Attack by one stage.",
            "If target has a berry, inflicts double damage and uses the berry."
        ]
    ],
    "pageTitle": "#401 - Kricketot || PokeDS - Pokemon Fansite Redefined",
    "title": "",
    "url": "http://pokeds.com/dex/pokemon/kricketot",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 188571259,
    "recordOffset": 188539286,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Level Up Moves Tutor Level Up Show/Hide Kricketot's Moves Download All Pokemon Cries Kricketot's Cry Cry Footprint Bodyshape FireRed/LeafGreen Only Habitat 2.2 kg or 4.85 lb Weight 0.3 m or 0' 11\" Height Red Color Cricket Species Flavor Data It shakes its head back to front, causing its antennae to hit each other and sound like a xylophone. Diamond It chats with others using the sounds of its colliding antennae. These sounds are fall hallmarks. Pearl",
    "textAfterTable": "Tutor Moves Games Name Type Class Power Accuracy PP Effect Pt Snore 40 100% 15 Has a 30% chance to make the target flinch. Only works if the user is sleeping. Pt Mud-Slap 20 100% 10 Has a 100% chance to lower the target's accuracy by one stage. Pt Uproar 90 100% 10 Forced to use this move for several turns. Pokémon cannot fall asleep in that time. Pt Endeavor 1 100% 5 Lowers the target's HP to equal the user's. HGSS String Shot -- 95% 40 Lowers the target's Speed by one stage. HGSS Snore 40 100% 15 Has a 30% chance to make the target flinch. Only works if the user is sleeping. HGSS Mud-Slap",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}