{
    "relation": [
        [
            "s",
            "c32",
            "ps"
        ],
        [
            "-",
            "-",
            "-"
        ],
        [
            "puntatore ad array di caratteri ristretto in cui il carattere multibyte verrà memorizzato Original: pointer to narrow character array where the multibyte character will be stored The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions.",
            "a 32-bit del carattere da convertire Original: the 32-bit character to convert The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions.",
            "puntatore all'oggetto stato di conversione quando si interpreta la stringa multibyte Original: pointer to the conversion state object used when interpreting the multibyte string The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions."
        ]
    ],
    "pageTitle": "c32rtomb - cppreference.com",
    "title": "",
    "url": "http://it.cppreference.com/w/c/string/multibyte/c32rtomb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 121189126,
    "recordOffset": 121173168,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 11 Sep 2013 08:09:13 GMT",
    "textBeforeTable": "[modifica] Parametri here for instructions. You can help to correct and verify the translation. Click Google Translate. The text has been machine-translated via __STDC_UTF_32__ is defined, the 32-bit encoding used by this function is UTF-32, otherwise it is implementation-defined. In any case, the multibyte encoding used by this function is specified by the currently active C locale. If the macro Original: __STDC_UTF_32__ macro viene definita, a 32 bit di codifica utilizzato da questa funzione è UTF-32, altrimenti è definito dall'implementazione. In ogni caso, la codifica multibyte utilizzata da questa funzione è specificata dal locale attivo C. Se il here for instructions. You can help to correct and verify the translation. Click Google Translate. The text has been machine-translated via *ps is updated to represent the initial shift state. U'\\0', a null byte is stored, preceded by any shift sequence necessary to restore the initial shift state and the conversion state parameter c32 is the null wide character If Original:",
    "textAfterTable": "[modifica] Valore di ritorno In caso di successo, restituisce il numero di byte (comprese le sequenze di trasferimento) scritte per l'array di caratteri il cui primo elemento è puntato da s. Questo valore può essere ​0​, ad esempio durante l'elaborazione del char32_t primo multi- char32_t sequenza di caratteri (non si verifica in UTF-32). Original: On success, returns the number of bytes (including any shift sequences) written to the character array whose first element is pointed to by s. This value may be ​0​, e.g. when processing the first char32_t in multi- char32_t-character sequence (does not occur in UTF-32). The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions. In caso di fallimento (se c32 non è un valido 32 bit del carattere), restituisce -1, negozi EILSEQ in errno e lascia *ps in stato specificato. Original: On failure",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}