{
    "relation": [
        [
            "Game Title",
            "Rainbow Six: Lockdown",
            "Operation 7",
            "7.62 High Calibre",
            "SOCOM 4: US Navy SEALs",
            "Ghost Recon: Future Soldier",
            "Splinter Cell: Blacklist",
            "Payday 2"
        ],
        [
            "Appears As",
            "",
            "",
            "",
            "FDO-11",
            "SA58 OSW",
            "SA58 OSW",
            "Falcon"
        ],
        [
            "Note",
            "",
            "",
            "w/ various attachments",
            "w/ custom cheek rest",
            "w/ various attachments",
            "w/ various attachments",
            "w/ Extended Magazine, CQB Foregrip, and CQB Stock; Big Bank DLC"
        ],
        [
            "Release Date",
            "2005",
            "2006",
            "2008",
            "2011",
            "2012",
            "2013",
            "2014"
        ]
    ],
    "pageTitle": "FN FAL - Internet Movie Firearms Database - Guns in Movies, TV and Video Games",
    "title": "",
    "url": "http://www.imfdb.org/wiki/FN_FAL",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00190-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 512537935,
    "recordOffset": 512508399,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1029=The FN FAL (Fusil Automatique Léger) was designed by Dieudonné Saive and Ernest Vervier from 1947 to 1951. It is also called the FN LAR (Light Automatic Rifle), the English translation of its Belgian French name. The fact that there are so many variants, made by different countries and different names for the same models, causes a lot of confusion regarding what particular FAL is in what movie. For the most part, only the major variants of the gun will have been seen in movies with wide distribution, (the original Belgian version, U.S. versions, the Israeli Versions and British/Commonwealth Version). The early FAL prototypes were chambered in intermediate cartridges like 7.92x33mm and .280 British, in an attempt to create an assault rifle along the lines of the German Sturmgewehr 44, but after 7.62x51mm NATO was adopted as the standard NATO rifle cartridge, the FAL design was altered to accommodate the more powerful round.}",
    "TableContextTimeStampAfterTable": "{8095=(1953 - Present)}",
    "lastModified": "Wed, 08 Jul 2015 22:04:24 GMT",
    "textBeforeTable": "Film Original FN LAR (Light Automatic Rifle) - full auto rifle with Wooden buttstock - 7.62x51mm NATO. Note the folded bipod. Many of these rifles were issued with wooden buttstocks by FN Belgium and are seen in wars all over the world in this configuration. Original FN LAR (Light Automatic Rifle) - full auto rifle - 7.62x51mm NATO. Note the folded bipod. FN LAR The FN FAL and variants are used by the following actors in the following movies: Fire Modes: Safe/Semi-Auto/Full-Auto; Safe/Semi-Auto on inch-pattern FALs. Capacity: 20, 30-round box magazine. (Argentine FALMP III Type 2 variant uses Steyr AUG magazines, Brazilian IMBEL variants use STANAG Magazines) Caliber: 7.92x33mm (prototype), .280 British (prototype), 7.62x51mm NATO, 5.56x45mm NATO (Argentine FALMP III and Brazilian IMBEL variants) Type: Battle Rifle, Assault Rifle (1953 - Present) Specifications 18 See Also 17.2 Television 17.1 Film 17",
    "textAfterTable": "Columbian soldier With telescopic sight and FN FAL flash-hider 2006 The Unit Dennis Haysbert CSM Jonas Blane 2006 - 2009 FN FAL FN FAL 50.00 - 7.62x51mm NATO FN FAL 50.61 Paratrooper with 21\" barrel - 7.62x51mm NATO FN FAL 50.63 Paratrooper with 18\" barrel - 7.62x51mm NATO FN FAL \"G Series\" - 7.62x51mm NATO Film Title Actor",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}