{
    "relation": [
        [
            "Keyword",
            "enable",
            "line",
            "local",
            "local-case",
            "none",
            "group radius",
            "group tacacs+",
            "group group-name"
        ],
        [
            "Description",
            "Uses the enable password for authentication.",
            "Uses the line password for authentication.",
            "Uses the local username database for authentication.",
            "Uses case-sensitive local username authentication.",
            "Uses no authentication.",
            "Uses the list of all RADIUS servers for authentication.",
            "Uses the list of all TACACS+ servers for authentication.",
            "Uses a subset of RADIUS or TACACS+ servers for authentication as defined by the aaa group server radius or aaa group server tacacs+ command."
        ]
    ],
    "pageTitle": "Authentication, Authorization, and Accounting Configuration Guide, Cisco IOS Release 15SY - Configuring Authentication [Support] - Cisco",
    "title": "Table 7 AAA Authentication NASI Methods",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/sec_usr_aaa/configuration/15-sy/sec-usr-aaa-15-sy-book/sec-cfg-authentifcn.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00044-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 368054239,
    "recordOffset": 367985239,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{356814=In Cisco IOS XE Release 2.3, this feature was introduced on the Cisco ASR 1000 Series Aggregation Services Routers., 116039=This command specifies RADIUS servers 172.16.2.3, 172.16.2.17, and 172.16.2.32 as members of the group araprad., 349940=RFC 2903, 350792=RFC 2989, 297731=The radius-server host 172.16.71.146 auth-port 1645 acct-port 1646 command specifies the IP address of the RADIUS server host, the UDP destination port for authentication requests, and the UDP destination port for accounting requests., 364696=In Cisco IOS XE Release 2.4, this feature was introduced on the Cisco ASR 1000 Series Aggregation Services Routers., 350221=RFC 2904, 361958=Microsoft Challenge Handshake Authentication Protocol (MS-CHAP) is the Microsoft version of CHAP and is an extension of RFC 1994. Like the standard version of CHAP, MS-CHAP is used for PPP authentication; in this case, authentication occurs between a PC using Microsoft Windows NT or Microsoft Windows 95 and a Cisco router or access server acting as a network access server., 66991=This command specifies RADIUS servers 172.16.2.3, 172.16.2.17, and 172.16.2.32 as members of the group loginrad., 252114=PPP currently supports two authentication protocols: Password Authentication Protocol (PAP) and Challenge Handshake Authentication Protocol (CHAP). Both are specified in RFC 1334 and are supported on synchronous and asynchronous interfaces. Authentication via PAP or CHAP is equivalent to typing in a username and password when prompted by the server. CHAP is considered to be more secure because the remote user’s password is never sent across the connection., 278714=Microsoft Challenge Handshake Authentication Protocol (MS-CHAP) is the Microsoft version of CHAP and is an extension of RFC 1994. Like the standard version of CHAP, MS-CHAP is used for PPP authentication; in this case, authentication occurs between a PC using Microsoft Windows NT or Microsoft Windows 95 and a Cisco device or access server acting as a network access server., 355751=In Cisco IOS XE Release 2.1, this feature was introduced on the Cisco ASR 1000 Series Aggregation Services Routers., 350505=RFC 2906, 349663=RFC 2433, 136040=This command specifies RADIUS servers 172.16.2.3, 172.16.2.17, and 172.16.2.32 as members of the group nasirad., 89062=This command specifies RADIUS servers 172.16.2.3, 172.16.2.17, and 172.16.2.32 as members of the group ppprad., 349387=RFC 1334}",
    "textBeforeTable": "The following table shows the IETF attributes that are supported for the RADIUS Change of Authorization (CoA) feature. The Disconnect Request message, which is also referred to as Packet of Disconnect (POD), is supported by the device for a session termination. RFC 5176 Compliance RFC 5176 Compliance The request is initiated from a CoA client (typically a RADIUS or policy server) and directed to the device that acts as a listener. CoA non-acknowledgment (NAK) [CoA-NAK] CoA acknowledgment (ACK) [CoA-ACK] CoA requests, as described in RFC 5176, are used in a pushed model to allow for session identification, host reauthentication, and session termination. The model comprises one request (CoA-Request) and two possible response codes: CoA Requests CoA Request Commands CoA Request Response Code CoA Requests Accounting Security and Password Session termination with port bounce Session termination with port shutdown Session termination",
    "textAfterTable": "Value Explanation 201 Residual Session Context Removed 202 Invalid EAP Packet (Ignored) 401 Unsupported Attribute 402 Missing Attribute 403 NAS Identification Mismatch 404 Invalid Request 405 Unsupported Service 406 Unsupported Extension 407 Invalid Attribute Value 501 Administratively Prohibited 502",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}