{
    "relation": [
        [
            "Payment method",
            "",
            "Cash on pickup",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Other - See seller's payment instructions",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Iphone 4 Full Screw SET INC Bottom Pentalobe Screws Original Genuine NEW | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/iPhone-4-FULL-SCREW-SET-inc-Bottom-Pentalobe-Screws-Original-Genuine-New-/281191025029",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00271-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418256099,
    "recordOffset": 418206414,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at We will happily accept returns where goods are found to be faulty or significantly not as described. We do not accept returns for change-of-mind, items not fitting etc. We do not accept returns for items that are sold AS-IS or the auction description states WITHOUT WARRANTY or the defect is described in the auction description. Return policy details The buyer is responsible for return postage costs. Money Back 30 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions All items must be paid for within 3 days of the end of the auction. If paying directly into our bank account please ensure you put YOUR EBAY ID as the reference NOT THE ITEM NUMBER and inform us via email when payment has been made. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}