{
    "relation": [
        [
            "First Name",
            "Joel",
            "Hilary",
            "Damon"
        ],
        [
            "Last Name",
            "Brandenberger",
            "Thesmar",
            "Wells"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=4CB93F87-94D2-4F1B-BEF0-9884FC14465B&filingTypeID=57",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00003-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 220128139,
    "recordOffset": 220119937,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12259=FY 2011 Budget FY 2012 Agriculture Appropriations Preservation of Antibiotics for Medical Treatment Act (PAMTA; H.R. 965) Proposed GIPSA Rule; Economic Analysis Public Comment Request Phosphorus Standard Revision, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 29895=No Bill or Docket # - Possible tax incentives for producing energy from animal by-products Volumetric Ethanol Excise Tax Credit and Import Tariff Amendments User Fees- Food Safety Volumetric Ethanol Excise Tax Credit Repeal Act (S. 520) Volumetric Ethanol Excise Tax Credit Repeal Act (H.R. 1075) Repeal Ethanol Subsidies Today Act of 2011 (H.R. 1188), 41718=EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15% EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program Volumetric Ethanol Excise Tax Credit (VEETC) and Import Tariff Amendments Volumetric Ethanol Excise Tax Credit Repeal Act (S. 520) Volumetric Ethanol Excise Tax Credit Repeal Act (H.R. 1075) Repeal Ethanol Subsidies Today Act of 2011 (H.R. 1188), 35367=FY 2011 Budget USDA/FDA User Fees Market Access Program/Foreign Market Development Program Avian Influenza Program Animal Disease Traceability Program FY 2012 Agriculture Appropriations, 18001=OAR-2004-0237 - Animal Feed Operations Consent Agreement and Final Order Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 Greenhouse Gas Emissions Reporting Rule (EPA-HQ-OAR-2008-0508) EPA TMDL for the Chesapeake Bay, 26939=No Bill or Docket # - Implementation of the Supreme Court \"Donning and Doffing\" Decision Docket- OSHA 2009-0044 - \"Occupational Illness & Injury Reporting Proposed GIPSA Rule; Economic Analysis Public Comment Period Request, 38234=Poultry Petition: EPA - HQ-SFUND-2005-013 Poultry Exemption Petition: EPA - HQ-SFUND-2007-0469 EPA Feed Mill Rule: EPA - HQ-OAR-2008-0080; FRL-9095-2 House Agriculture Committee - Chesapeake Bay Hearing, 20950=Volumetric Ethanol Excise Tax Credit (VEETC) and Import Tariff Amendments Volumetric Ethanol Excise Tax Credit Repeal Act (S.520) EPA-HQ-OAR-2009-0211 Clean Air Act Waiver Application to Increase the Allowable Ethanol Content in Gasoline to 15 Percent EPA-HQ-OAR-2005-0161; FRL-8903-1 Changes to the Renewable Fuels Standard Program Volumetric Ethanol Excise Tax Credit Repeal Act (H.R. 1075) Repeal Ethanol Subsidies Today Act of 2011 (H.R. 1188)}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20005 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  JOEL BRANDENBERGER  2028980100  jbrandenberger@turkeyfed.org 5. Senate ID#  28732-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}