{
    "relation": [
        [
            "Postage and handling",
            "Free postage",
            "US $4.00",
            "US $17.95"
        ],
        [
            "Each additional item",
            "Free",
            "Free",
            "US $17.95"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Postage (USPS First Class Package®)",
            "Express Postage (USPS Priority Mail®)",
            "Express Postage (USPS Priority Mail Express Flat Rate Envelope®)"
        ],
        [
            "Delivery*",
            "On or before Tue. 04 Aug. to 07095 per eBay FAST 'N FREE",
            "On or before Mon. 03 Aug. to 07095",
            "Estimated by Sat. 1 Aug."
        ]
    ],
    "pageTitle": "6pc Iphone 3GS 4s 5 Precision Magnetic Screwdrivers Smartphone Repair Tools KIT | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/6pc-iPhone-3GS-4S-5-Precision-Magnetic-Screwdrivers-Smartphone-Repair-Tools-Kit-/281251649869?pt=US_Cell_Phone_Replacement_Parts_Tools&hash=item417be7994d",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00098-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412494171,
    "recordOffset": 412441989,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72960=• Torx T5 Screwdriver (2010-12 MacBook Air, 2012 Retina Macbook Pro internal components screws - battery, logic board, fan, etc., Black berry smartphone screws)}",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 20 items available. Please enter a number less than or equal to 20. -Select- Argentina Australia Austria Bahamas Belgium Belize Brazil British Virgin Islands Canada Costa Rica Czech Republic Denmark Finland France Germany Ireland Israel Japan Korea, South Mexico Monaco Netherlands New Zealand Norway Poland Puerto Rico Romania Russian Federation South Africa Sweden Switzerland United Kingdom United States Virgin Islands (U.S.) Change country: Quantity:",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Return policy Item must be returned within Refund will be given as 14 days after the buyer receives it Money back or item exchange (buyer's choice) The buyer is responsible for return postage costs. Return policy details Please email for compatibility questions. Returns for incorrect fit due to buyer error or lack of research will be charged a",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}