{
    "relation": [
        [
            "Categories",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The food and dining is great they have the best food and it is available almost everywhere. Some local companies have even complained because their loosing business to the Umass dining. Their is a diverse menu that ranges from every type of cuisine, and as a result the students will probably never starve unless they run out of swipes.",
            "I Never lived on campus, so as a result i only can tell the prospective student that it is much like other colleges. Umass does have a large choices of areas to dorm and they all have their pros and cons. Some are more quiet for those who like to work and others a can be more enjoyable.",
            "As an Architecture major, the amount of work we complete through out a semester is more than most other majors. Through designing a building creating all the plans, section, elevations, study models, and final models for a single project, we learn quite a bit about the design process, and the steps to create a working design.",
            "Prospective students should realize this school will give them an great education, and if they graduate from here they will have great opportunities because the school is well known. The campus is a city in itself and if they choose to come here they will have no problem finding food and activities after classes.",
            "Umass has a great campus and huge selection of extracurricular activities to choose. The Professors are very helpful for my particular major, and a lot of the work can be done online, so off campus students like myself can get work done. Other students are extremely nice, and made my transition as a transfer student smooth and simple."
        ]
    ],
    "pageTitle": "University of Massachusetts-Amherst (UMass Amherst) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Massachusetts-Amherst/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891433831,
    "recordOffset": 891273896,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{216737=Work hard and try to do the best you can in high school. I got in with a 1630 on the SATs and a B average grade. As long as other parts of your application are strong, you should be fine. I had strong recommendation letters and work experience/volunteer work so that helped., 28612=The campus security is very thorough, making sure all students that are non residents of a dorm on campus are signed in from 8:00 PM - 12:00 PM on weekdays and 8:00 PM - 2:00 AM on weekends. There are student cadets, as well as police officers at every corner on the weekend to control crime and prevent fighting, but it is not as heavily guarded during the week., 235631=We like breaking food world records. In 2010 we broke the world record for worlds longest California Sushi Roll and in 2011 we broke the record for worlds largest Stir Fry., 186689=Do a lot of research about the different kinds of activities and resources on campus. It'll definitely come in handy; I ended up being able to get an awesome on campus job in September of my freshman year because I found out about the place the previous August. Also, don't be afraid to step out of your comfort zone, take advantage of everything going on. Try new things, talk to all different kinds of people!, 263849=Tons of clubs on campus and even through the town. Go running or to the park and play frisbee. Go dancing at Lit. Ride the B43 to Northampton and go eat or shop. Take the bus to Boston or NYC for the weekend (MegaBus is sometimes $1 for inconvenient times). The farmer's market sets up sometime in March and runs through October, weather permitting., 252005=Don't take 8 o'clock classes, just don't. If a class is full and you're waitlisted, talk to the teacher, they might be able to let you in., 869330=© 2015, Cappex.com, LLC, 647506=A lot of parents want to make sure their child is getting the best possible education that they can afford. Our business school was rated number 46 out of 100 for 2013 in Business Weekly. We beat out many other business schools that are twice the tuition of Umass., 672108=When I went to UMASS in 2006 I lived in Southwest and it was a blast! You create lifelong friendships and you can even take classes in your dorms., 149699=This is dependent on where you live, but I still recommend staying on campus, at least for a year. That way you get to see how Umass operates up close. After that, if you live in Amherst or Northampton, take the bus, you'll save time and money. Otherwise, stay on campus, since many required classes for graduation start at 8:00 AM., 852650=Here are two University of Massachusetts traditions from the umassalumni website http://umassalumni.com/s/1640/alumni/index.aspx?sid=1640&gid=2&pgid=627 Did you know that the very first colors associated with Massachusetts Agricultural College in 1863 were red and blue? The school colors of maroon and white made their first appearance sometime in the 1870s when the college premiered its first football uniforms. Weâ??ve maintained this time-honored tradition ever since. Sam the Minuteman is the #1 UMass fan! He holds the record for most athletic events attended in one year, showing up for all home football, hockey, menâ??s basketball and womenâ??s basketball games and occasionally checking out our soccer, field hockey, lacrosse, baseball and softball as well. See Sam in his ESPN commercial and become one of his Facebook fans., 760563=There are many residential zones on campus, and the one that stands out for its unique characteristic in the schools is the Southwest residential area. This is one of the two residential zones that doesn't look like a large town of condominiums and grass fields. Basically the party zone of UMass Amherst, it tends to get quite rowdy on weekend nights, especially when the weather is nice out, but, generally, the noise remains indoors otherwise and isn't really as bad as a zoo. Rather, just think of your local shopping mall on the first week of December. For other dorms, expect a little more silence, just as well as your usual college party or dorm get together,, 334934=The freshman dorms are pretty great, and you are guaranteed housing your first year, most of the dorms available being freshman only. The dorm in which I lived, Van Meter (In central) had just been renovated when I went, and was really sweet. The entire basement was renovated the summer of 2011, so we had a new kitchen, swanky couches, and flat-screen televisions. Housing in other parts of the campus was usually atleast acceptable, but varied. There were social events hosted by the RA's during finals week that were pretty cool, and some free tickets offered for local plays and movies. Overall, the people in my dorm were great and I came to befriend a bunch of them.}",
    "textBeforeTable": "07/17/2009 Reviewer is A current student here. 26 out of 29 people found this review useful. 1 of 188 Naja from Millville, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students Even if you don't like to (or want to) party, don't rule out UMass. There's all kinds of options at UMass in every area - academics, housing, food, extracurriculars, and (most of all) people. However, if you're a homebody and can't handle a little noise once in a while or are uncomfortable being amongst lots of people, then this might not be the best option for you. Tips for prospective students Definitely tour the campus. It can seem big and overwhelming, but once you get comfortable, it's not bad at all. Some things to check out on campus: - Newman Center Cafe - University Gallery (at the Fine Arts Center) - The campus pond - The Bluewall - Berkshire Dining Commons - Studio Arts Building - W.E.B Dubois Library - Antonio's in Downtown Amherst - Central / Orchard Hill Residential Area Bang for the buck Most of the dorms are surprisingly nice, and if you don't have too much more than the essentials, there's plenty of space. The food is decent, plus you get meal exchanges that you can use at most of the restaurants on campus. One hidden gem at UMass: the Newman Center Cafe. They have very good cheap food, and they serve it up very fast. Another excellent thing about UMass is that",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}