{
    "relation": [
        [
            "Team",
            "Deep",
            "Aguilas",
            "Dis Located",
            "Damaged Goods",
            "Batters",
            "GVUMC",
            "Like A Boss",
            "Neighborhood Church"
        ],
        [
            "W",
            "14",
            "11",
            "10",
            "7",
            "6",
            "4",
            "2",
            "1"
        ],
        [
            "L",
            "0",
            "3",
            "3",
            "7",
            "7",
            "10",
            "12",
            "13"
        ],
        [
            "T",
            "0",
            "0",
            "1",
            "0",
            "1",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "COMMUNITY SPORTS -- 11/25/09 | Las Vegas Review-Journal",
    "title": "",
    "url": "http://www.reviewjournal.com/sports/community-sports-112509",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 675294339,
    "recordOffset": 675266357,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{73303=SIGNUPS BASEBALL Rocky Mountain School of Baseball The Rocky Mountain School of Baseball will hold its Turkey Trot Tournament in Mesquite and St. George on Nov. 27 and 28. The tournament has divisions for teams from 8u through 18u. Registered teams will play a minimum of four games. For more information, or for team registration, visit the RMSB Web site at rmsb.com, or call 1-877-272-0862. Peccole Phantoms Baseball Club The Peccole Phantoms competitive baseball club will be holding tryouts for its U8 division winter team. The boundaries for the program are consistent with Peccole Little League and will play Peccole Spring and Fall seasons, as well as club winter season. The Peccole Phantoms are seeking serious 7 and 8 year old players to add to its competitive little league baseball club team. For more information on tryout dates, schedules and locations, or club dues, contact Coach Warren at 885-8121. Las Vegas Adult Baseball League The Las Vegas Adult Baseball League is currently seeking players, managers, and teams to fill its ranks for the upcoming season, which will begin in March. The league will be holding an open tryout and draft at Paul Meyer Field at 9 a.m. on Dec. 5. The league is also looking for individuals with extensive experience in scorekeeping. All interested persons, who must be at least 18 years of age, are encouraged to contact Kelly Nunes at 237-6660. Private Hitting Instruction with UNLV coaches The UNLV baseball coaching staff is offering private hitting lessons to local players. For more information, call 895-2475. Las Vegas Sky Wolves Adult Baseball Program An 18+ adult wood bat team is currently looking for pitchers for the 2010 spring season. If you are interested in playing, please e-mail your information to wolves_baseball@yahoo.com. BASKETBALL Tarkanian Basketball Academy The Tarkanian Basketball Academy is accepting registrations for its winter basketball league which runs from Dec. 5 through Jan. 30. The league is open for boys and girls in kindergarten through high school. The league consists of team practices and skills mid-week and games on Friday nights and Saturdays. Teams will be drafted at the jamboree on Saturday, Dec. 5. For more information or to register, visit TBA’s website at tarkbball.com or call 871-0096. Southern Nevada Basketball Association The SNBA is accepting registrations for its upcoming adult basketball leagues. The leagues are open to men, women, and high school-aged players. You may register as an individual or as part of a team. There are morning leagues on Saturdays and evening leagues on Tuesdays and Thursdays. Leagues are starting now and registration is ongoing. For more information, call Hank at 521-4638. CROSS COUNTRY Southwest Stallions Coach Walter Huertas of the Southwest Stallions is heading up a cross country team for Midgets and up. The Midget division consists of runners born in 1997 and 1998. The cost for the team will be about $100. Practices will be held at Desert Breeze Park. For more information, call 683-5085. FOOTBALL Arena Football League The Tri-Cities Fever of the Arena Football League will be holding tryouts at Ed Fountain Park on Dec. 13. The tryouts will run from 10 a.m. until 3 p.m. For more information, call Coach Mike at 624-9004. Wild West Football League Adult Tackle Football Several teams in the WWFL are looking for players. The league is an adult tackle football league that plays games at Fountain Park. For more information on the Cobras, call Coach Mike at 624-9004. For more information on the Henderson Wolverines, call Coach Kelly at 834-2025. TENNIS Bryan Brothers Fantasy Camp The Bryan brothers, one of the most successful doubles teams on the ATP tour, will host a camp at the Las Vegas Hilton and the Stirling Club in Las Vegas on Dec. 12 and 13. For more information, call 807-7349. International Tennis Center The newly opened $15 million indoor facility offers tennis enthusiasts a chance to play even on the hottest days of the year. The facility offers locals court time for just $20 per person for singles and $10 per person for doubles players. Cardio tennis is also offered at the ITC. The group activity features drills that give players or all abilities a high energy workout. The first class is free to locals. The facility is located at the corner of Topaz and Oquendo, just a block east of Eastern. For more information, call 685-6038. TRACK AND FIELD Southwest Stallions The youth track and field club is looking for participants to join its cross country team. Runners should be between 11 and 18 years old. Practices are held at 6 p.m. at Desert Breeze Park on Tuesdays and Thursdays. For more information, call Coach O’Neal at 683-5085.}",
    "lastModified": "Mon, 03 Aug 2015 04:42:40 GMT",
    "textBeforeTable": "BASKETBALL Southern Nevada Basketball Association Men’s Fall League At City Impact Center Western Conference Superleague COMMUNITY SPORTS -- 11/25/09 Posted November 25, 2009 - 2:00am CLARK TOPS WESTERN IN GIRLS... Today at Santa Anita   Print           Sports Home » You are here   App Best of LV Nifty Nickel Shopping Holiday directory Service Directory Deals Coupons Legals Classifieds Homes Autos Marketplace",
    "textAfterTable": "Central Conference Team W L Mayas (Angel) 9 1 Primetime (Quinton) 6 4 Hbk (Byron) 6 4 And-1 (Keith) 5 5 Throw Down (Kevin) 3 7 Hoopla (Marisa) 3 7 Midnight (Willie) 2 8 Sunset (Jay) 0 10 Scores D-up 64, No Mercy 45 Playmakers 71, Free Agents 56 No Mercy 57, Keep It Real 45 Mayas 64, Mob 62 Game Changers 59, Outlaws 55 Playoffs HBK 48, Throw Down 32 And-1 45, Midnight 41 Primetime 43, HBK 41 And-1 48, Mayas 46 Championship Primetime 56, And-1 43 Individual Scores D-Up 64, No Mercy 45 D-UP (64) K. Johnson 9, W. Green 5, C. Hartney 8, D. Moody 5, S. Kelly 7, D. Edwards 7, L. Mingo 8, J. Smith 15. NO MERCY (43) G. Anderson 7, V. Esannason 14, G. Burton 0, L. Lewis 10, J. Anderson 14, M. Pollard 0. Playmakers 71, Free Agents 56 PLAYMAKERS (71) R. Heidelberg 13, C. Jordan 18, A. Babero 25, P. Cole 11, J. Smith 0. FREE AGENTS (56) N. Liberatore 14, S. Harper 0, Ja. Gray 7, C. Harris 11, JJ Gray 17, C. Winn 7. No Mercy 57, Keep It Real 45 NO MERCY (57) G.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}