{
    "relation": [
        [
            "Patent application number",
            "20090004194",
            "20100291109",
            "20100317111",
            "20110182847",
            "20110286968",
            "20120251494"
        ],
        [
            "Description",
            "TLR AGONIST (FLAGELLIN)/CD40 AGONIST/ANTIGEN PROTEIN AND DNA CONJUGATES AND USE THEREOF FOR INDUCING SYNERGISTIC ENHANCEMENT IN IMMUNITY - Fusion proteins and DNA conjugates are disclosed which contain a TLR/CD40/agonist and optional antigen combination. The use of these protein and DNA conjugates as immune adjuvants and as vaccines for treatment of various chronic diseases such as HIV infection is also provided.",
            "TLR AGONIST (FLAGELLIN)/CD40 AGONIST/ANTIGEN PROTEIN AND DNA CONJUGATES AND USE THEREOF FOR INDUCING SYNERGISTIC ENHANCEMENT IN IMMUNITY - Fusion proteins and DNA conjugates are disclosed which contain a TLR/CD40/agonist and optional antigen combination. The use of these protein and DNA conjugates as immune adjuvants and as vaccines for treatment of various chronic diseases such as HIV infection is also provided.",
            "CD40 AGONIST ANTIBODY/TYPE 1 INTERFERON SYNERGISTIC ADJUVANT COMBINATION, CONJUGATES CONTAINING AND USE THEREOF AS A THERAPEUTIC TO ENHANCE CELLULAR IMMUNITY - A synergistic adjuvant is provided comprising synergistically effective amounts of at least one type 1 interferon and at least one CD40 agonist, wherein these moieties may be in the same or separate compositions. In addition, fusion proteins and DNA conjugates which contain a type 1 interferon/CD40 agonist/antigen combination are provided. The use of these compositions, protein and DNA conjugates as immune adjuvants for treatment of various chronic diseases such as HIV infection and for enhancing the efficacy of vaccines (prophylactic and therapeutic) is also provided.",
            "USE OF TLR AGONISTS AND/OR TYPE 1 INTERFERONS TO ALLEVIATE TOXICITY OF TNF-R AGONIST THERAPEUTIC REGIMENS - Improved (safer and more effective) methods of therapy using TNF-R agonists, e.g., CD40 agonists are provided. These methods provide for the addition of an amount of a type 1 interferon and/or a TLR agonist that is effective to prevent or reduce the toxicity (liver toxicity) that may otherwise result in some patients of the TNF-R agonist is used as a monotherapy (without the type 1 interferon and/r TLR agonist).",
            "CD40 AGONIST ANTIBODY /TYPE 1 INTERFERON SYNERGISTIC ADJUVANT COMBINATION, CONJUGATES CONTAINING AND USE THEREOF AS A THERAPEUTIC TO ENHANCE CELLULAR IMMUNITY - A synergistic adjuvant is provided comprising synergistically effective amounts of at least one type 1 interferon and at least one CD40 agonist, wherein these moieties may be in the same or separate compositions. In addition, fusion proteins and DNA conjugates which contain a type 1 interferon/CD40 agonist/antigen combination are provided. The use of these compositions, protein and DNA conjugates as immune adjuvants for treatment of various chronic diseases such as HIV infection and for enhancing the efficacy of vaccines (prophylactic and therapeutic) is also provided.",
            "CD40 AGONIST ANTIBODY /TYPE 1 INTERFERON SYNERGISTIC ADJUVANT COMBINATION, CONJUGATES CONTAINING AND USE THEREOF AS A THERAPEUTIC TO ENHANCE CELLULAR IMMUNITY - A synergistic adjuvant is provided comprising synergistically effective amounts of at least one type 1 interferon and at least one CD40 agonist, wherein these moieties may be in the same or separate compositions. In addition, fusion proteins and DNA conjugates which contain a type 1 interferon/CD40 agonist/antigen combination are provided. The use of these compositions, protein and DNA conjugates as immune adjuvants for treatment of various chronic diseases such as HIV infection and for enhancing the efficacy of vaccines (prophylactic and therapeutic) is also provided."
        ],
        [
            "Published",
            "01-01-2009",
            "11-18-2010",
            "12-16-2010",
            "07-28-2011",
            "11-24-2011",
            "10-04-2012"
        ]
    ],
    "pageTitle": "Ross - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ross-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426690787,
    "recordOffset": 426651401,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ross Kedl, Centennial, CO US 01-05-2012 PROCESS FOR UPGRADING HEAVY OIL AND BITUMEN PRODUCTS - A process for upgrading bitumen recovered from an oil reservoir without hydrogen production is particularly useful in field upgrading applications. In this process, recovered bitumen enters a fractionator and is contacted with heated gases from a fluidized bed reactor. The bitumen and heated gases are fractionated into segregated products including at least a liquid pitch, unstable fractions, and an upgraded liquid product. The liquid pitch is introduced into the reactor to produce a vapor phase liquid product; the reactor comprises solid particles moving through the reactor and a fluidizing gas fluidizing the solid particles at a conversion temperature which is suitable for facilitating the conversion of at least some of the liquid pitch into the vapor phase liquid product. The heated gases comprising the vapor phase liquid product and fluidizing gas are directed from the reactor to the fractionator to contact the bitumen stream. In this process, enough of the segregated unstable fractions are burned that the liquid product and any remaining unstable fractions meets pipeline specifications without hydrogen treatment of any of the remaining unstable fractions. 20120000830 Published Description Patent application number Ross Holuk, Calgary CA //]]> BarDraw('3624005',['Patent applications by Ross Hoggatt, Waukesha, WI US'],[[1,1,1]],['2006','2008','2012'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3624005\" align=\"center\"></div> </div> <canvas id=\"bg3624005\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Ross Hoggatt, Waukesha, WI",
    "textAfterTable": "Patent applications by Ross Kedl, Centennial, CO US Ross Koningstein, Atherton, CA US Patent application number Description Published 20110120448 HELIOSTAT CONTROL SCHEME USING CAMERAS - A heliostat control system includes a receiver located within a receiver volume and a view port located proximate to the receiver volume. The receiver is configured to receive sunlight reflected from a mirror of a heliostat. The view port is optically connected to a camera, and the camera is configured to generate an image including pixels having a brightness dependent on an orientation of the mirror. 05-26-2011 20120176694 Heliostat System - A heliostat system includes a base member adapted to be secured to a fixed surface, a transitional member that is formed as a substantially unitary member and a mirror member. The transitional member is coupled to the base member and to the mirror member. The mirror member includes a support portion coupled to the transitional member and a mirror portion. A first bearing coupling the base member and the transitional member provides relative changes in azimuth between the base member and the transitional member. A second bearing coupling the transitional member and the mirror member provides relative changes in elevation between",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}