{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I always feel safe on campus. We have officers on campus, and have emergancy buttons that can be pressed for assistance all over campus. We have a program called KatSafe that helps the students know what is going on.",
            "I am not in the Greek life, but I have many friends who are. They are always doing something fun and seem as to be one big family. They have something fun to do and really help out the school.",
            "There are tons of clubs and activites. There is something for everyone and all the clubs are alot of fun and you can meet many new people. I",
            "Sam Houston is great for anyone.",
            "Lots of school spirt.",
            "I am very happy with my choice to attend Sam Houston. It is a smaller campus and everyone feels at home and welcomed.",
            "It is pretty hot in Huntsville and there are many places to swim. If you like to dance there are a couple dance halls very close by. Huntsville has a state park and is filled with History.",
            "There are many plcaes to dine of campus and they are all very nice and the food is great.",
            "All of the dorms are very nice and very clean. They are also close to campus.",
            "I love Sam Houston and the academic level is great.",
            "If you are a prospective suddent for Sam Houston I have a couple tips for you 1. To get involved in something. 2. Bring and umbrella 3. Buy a parking pass.",
            "Sam Houston State University is a beautiful campus in Huntsville Texas. The campus is very nice and all the staff has been very helpful. All of the students are very friendly and there are many things the campus offers to do."
        ]
    ],
    "pageTitle": "Sam Houston State University (SHSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Sam-Houston-State-University/reviews?_escaped_fragment_=/show/96256",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00112-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891279983,
    "recordOffset": 891105508,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{17454=It's definitely worth the price. While some universities are charging upwards of 10,000 a semester, I usually end up with $2800 - $3000 a semeseter, and With the grants and scholarships they offer, I never even spend close to that, 742558=If you want to have fun like on the weekends then go to Sorority Hill around 7 or 8 o'clock and find out what party they are hosting. If you don't like the party atmosphere then there is always the gym, the local park off of Sam Avenue, and at Hastings which is our local bookstore they have something going on every weekend., 812643=By all means, tour the campus when you are a junior or senior in highschool. Be sure to attend the 3 day Bear Kat Camp in early August, it will pump up your school spirit. Recognized campus for several fields of study. Law Enforcement & Teaching come to mind., 270442=Sam Houston State University is a very welcoming and fun filled campus. Since being here I have enjoyed all the facilities and amenities offered for being a student. Even better the professor to student ratio is 3:1 and they really work hard to help the best way they can., 527035=Dorm life at SHSU is anything but typical. I personally have stayed in two different dorms, both of which were a pleasant experience. This past 2011-2012 school year, we celebrated the opening of brand new, semi-private dorm by the name of Lonestar Hall. This makes 26 halls, houses and on-campus apartments available for students to choose from. Some perks of staying in a dorm are a sense of community and safe living, along with all of the fun activities that residence life sets up. These activities vary from volley ball tournaments to movie nights to haunted houses., 1011764=Orientation on July 10-11, was quite informative; as a result my transition will be less frustrating. My advisor assisted me greatly, my scheduling wasn't as overwhelming as it could have been for a freshman. The campus is rich in diversity., 419152=Tuition runs about $1200 - 1500 a semester depending on how many classes you take and any additional fees for labs, etc. Very reasonable freshman to graduate level college., 211716=Even though I was on campus for a short while I really liked the different kinds of food offered and was impressed with how Old Main was. I know I'll be a fat kid when I start in August since I'll frequent Old Main a lot, also I'm content with the other food services offered in the LSC, 559376=If possible, try to get into the newer dorms because the older small house are small and cramped. Your best bet would be Sam Houston Village which was remodeled Summer 2012., 526012=Along with the addition of Lonestar residence hall, Old Main Market opened its doors for the 2011-2012 school year. All the food served by Old Main is provided by the Fresh Foods company, so Sam Houston is able to ensure safe, healthy food choices on campus. Beside Old Main Market, their are four more dining locations which house several eateries. Paw print is located in the heart of campus and houses a Quiznos, Burger King, and Chic-fil-a along with other random assortments of salads sandwiches and snacks. South Paw is at the South end of campus and houses a Starbucks, Tortilla Fresca, and Subway. We also have a Java City, and Einsteins Bagels on campus. Overall. dining experience on SHSU campus is fantastic and full of choices., 109203=SHSU has undergone many transformations from when I first was a freshmen in 2007. No longer will you walk campus and see a ton of other university t-shirts. You'll see our SHSU Orange. The traditions and spirit of campus are a growing fashion now., 56627=There is the ring ceremony for seniors that happens in April. They also light up a huge Christmas tree every January. Probably the coolest tradition is the Battle of the Piney Woods football game between Sam Houston and Stephen F. Austin. The past three year the game has been held at Reliant Stadium where the Texans play., 70375=Food and Dining is pretty good! We have a new facility, Old Main Market that was built in the summer of 2011 which has a great variety of food. We also have other fast food places on campus, like Paw Print and South Paw. What ever your fix or crave, you can get it at Sam!, 1092731=© 2015, Cappex.com, LLC, 506586=The battle of the Piney Woods is an old school rivalry between SHSU and SFA that has been going on since the 1920's. Both schools compete in different athletic sports to try to win the Piney Woods Trophy. In 1982 the Old Main Building on the North side of campus burned down. This Building was a beautiful gothic style mansion, it was the first permanent building constructed by the state for teacher training. Now known as the Old Main Pit it hosts many social gatherings., 1010225=I have not yet attended, I'm sharing what I have observed prior to August 26, 2013., 1082061=Hi, my name is Ashlee, and I've been accepted to Sam Houston for the Fall 2015 semester. I like to be very active in school and I have a wide variety of things I enjoy doing, and was planning on taking a tour of the school some time during January or February. Does anyone have any advice for me about the tour, regarding what kinds of questions to ask, what to request seeing and what I should pay close attention to, or just any other advice?}",
    "textBeforeTable": "07/23/2009 Reviewer is A current student here. 58 out of 61 people found this review useful. 1 person found it offensive. 1 person found this inaccurate. 1 of 256 Katrina from Austin, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. Sam Houston State University Reviews Sam Houston State University › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create',",
    "textAfterTable": "Am learning a lot College is a time to expand the knowledge you already have and pursue new knowledge for use through the rest of your life. Sam Houston has allowed me to do both. In just the two semesters I have been here, I have learned more than I ever did in High School. The college atmosphere and college teachers teach you not only about what ever subject you are learning but how it applies to life as well. Login to rate or flag the reviews Amethyst from Dallas, TX 08/16/2009 Reviewer is A current student here. 21 out of 23 people found this review useful. 3 of 256 Categories Comments Great for these types of students Students who like scenic locations. Students who aren't sure about specific majors (there is a variety of major options available) Students who like agriculture, criminal justice, business, theater, music, art, and sciences. Tips for prospective students -Apply early and apply for housing early, more likely to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}