{
    "relation": [
        [
            "",
            "Apixaban",
            "Warfarin"
        ],
        [
            "Description",
            "Participants received apixaban and warfarin-placebo following randomization during a titration phase using a dosing algorithm for warfarin- placebo; apixaban was dosed at 5 mg twice daily (BID) [or 2.5 mg BID in select subjects]. Subsequent warfarin placebo doses were recommended based upon an algorithm using an encrypted, shammed International Normalized Ratio (INR) procedure to preserve the double blind; however, the final dosing decision rested with the investigator.",
            "Participants received apixaban-placebo and warfarin following randomization during a titration phase using a dosing algorithm for warfarin; apixaban-placebo was dosed at 5 mg twice daily (BID) [or 2.5 mg BID in select subjects]. Subsequent warfarin doses were recommended based upon an algorithm and encrypted INR testing to preserve the double blind; however, the final dosing decision rested with the investigator."
        ]
    ],
    "pageTitle": "Apixaban for the Prevention of Stroke in Subjects With Atrial Fibrillation - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00412984?sect=Xbf015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873557740,
    "recordOffset": 873541802,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Reporting Groups 20998 participants were enrolled, and 18201 were randomized. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details No text entered. Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: warfarin Drug: apixaban Interventions: Atrial Fibrillation Atrial Flutter Conditions: Allocation: Randomized;   Endpoint Classification: Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Prevention Study Design: Interventional Study Type: Results First Received: January 25, 2013  ",
    "textAfterTable": "Participant Flow:   Overall Study     Apixaban     Warfarin   STARTED     9120 [1]   9081 [1] COMPLETED     6810     6588   NOT COMPLETED     2310     2493   Death                 331                 349   Adverse Event                 679                 738   Withdrawal by Subject                 921  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}