{
    "relation": [
        [
            "Shipping and handling",
            "Free shipping",
            "US $15.00",
            "US $30.00"
        ],
        [
            "Each additional item",
            "Free",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Economy Shipping",
            "Expedited Shipping (UPS 2nd Day Air®)",
            "Express Shipping (UPS Next Day Air Saver®)"
        ],
        [
            "Delivery*",
            "Estimated within 2-11 business days",
            "Estimated within 3-4 business days",
            "Estimated within 2 business days"
        ]
    ],
    "pageTitle": "85 Tungsten Professional 26 Gram Dart SET With 2 Sets OF Shafts AND Case | eBay",
    "title": "",
    "url": "http://www.ebay.ca/itm/Tungsten-Dart-Set-85-Tungsten-Pro-Style-Darts/291135698333?hash=item43c90a359d",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428253351,
    "recordOffset": 428204385,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{61552=SKU: 15-2061}",
    "textBeforeTable": "Please enter 6 digits for the Postal Code. Please enter a valid Postal Code. Postal Code: Select a valid country. There are 2,295 items available. Please enter a number less than or equal to 2,295. -Select- United States Change country: Quantity: Item location: Shipping cost cannot be calculated. Please enter a valid Postal Code. Excludes: Alaska/Hawaii, APO/FPO, US Protectorates, PO Box Shipping to: United States Lorain, Ohio, United States",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin Postal Code, destination Postal Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Domestic handling time Will usually ship within 1 business day of receiving cleared payment - opens in a new window or tab. Return policy Item must be returned within Refund will be given as 30 days after the buyer receives it Money Back The buyer is responsible for return shipping costs.",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}