{
    "relation": [
        [
            "Audit Committee",
            "W. Scott Davis*",
            "Norman E. Harned",
            "Daniel C. Sullivan"
        ],
        [
            "Compensation Committee",
            "Daniel H. Cushman",
            "Matthew T. Moroun*",
            ""
        ],
        [
            "Executive Committee",
            "Daniel H. Cushman",
            "Matthew T. Moroun*",
            ""
        ]
    ],
    "pageTitle": "ptsi20140423_def14a.htm",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/798287/000143774914006999/ptsi20140423_def14a.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 673398979,
    "recordOffset": 673307581,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1444=Securities Exchange Act of 1934 (Amendment No.      )}",
    "TableContextTimeStampAfterTable": "{323426=Messrs. Cushman and West each holds options to acquire shares of our common stock that were granted under our 2006 Stock Option Plan. In general, stock options granted under the 2006 Stock Option Plan that are vested may be exercised within three months after termination of employment without cause. However, if the executive’s employment terminates due to death or disability, earned shares and vested shares may be exercised within one year after the date of termination, but not later than the expiration date of the option., 408787=Based upon a Schedule 13G amendment, dated February 10, 2014, filed by Dimensional Fund Advisors LP, a Delaware Limited Partnership, which indicates that as of December 31, 2013, Dimensional Fund Advisors LP had the sole power to dispose of 629,283 shares as an investment advisor or manager to investment companies, trusts and separate accounts that own the 629,283 shares. The address of Dimensional Fund Advisors LP is Palisades West, Building One, 6300 Bee Cave Road, Austin, Texas 78746. We make no representation as to the accuracy or completeness of the information reported., 234040=2012, 434086=“RESOLVED, that the stockholders of P.A.M. Transportation Services, Inc. approve, on an advisory basis, the compensation of the executive officers as disclosed pursuant to Item 402 of Regulation S-K in the Compensation Discussion and Analysis, compensation tables and related narrative discussion in the Company’s proxy statement for the 2014 Annual Meeting of Stockholders.”, 602360=(h)     Termination of Continuous Service. Unless the Option Agreement otherwise provides, in the event an Optionholder’s Continuous Service terminates, the Optionholder’s Options that have not vested or were not exercisable as of the date of termination shall automatically and without notice terminate and become null and void at 5:00 p.m. Eastern Time on the date of termination. With regard to those Options that have vested, the Optionholder may exercise his or her Option (to the extent that the Optionholder was entitled to exercise such Option as of the date of termination) but (i) for Incentive Stock Options, only within such period of time ending on the earlier of (A) the date three (3) months following the termination of the Optionholder’s Continuous Service, or (B) the expiration of the term of the Option as set forth in the Option Agreement, and (ii) for Nonstatutory Stock Options, only within such period of time ending on the earlier of (A) the date specified in the Option Agreement, or (B) the expiration of the term of the Option as set forth in the Option Agreement. If, after termination of Continuous Service, the Optionholder does not exercise his or her Option within such time period, the Option shall terminate. Nothing in this Section 6(h) shall restrict the Committee from amending an Incentive Stock Option in order to cause it to be treated as a Nonstatutory Stock Option., 503272=We made payments to subsidiaries of Oakland Financial Corporation during 2013 in the amount of $245,917 for insurance premiums paid pursuant to agreements to provide insurance coverage to certain of our independent contractors. The underlying agreements are made directly with the independent contractors. The full amount of these payments to the subsidiaries of Oakland Financial Corporation is recouped by us from the independent contractors., 374130=Our 2006 Stock Option Plan provides for an annual grant of a stock option to each of our non-employee directors through 2016. In 2013, each non-employee director received an option to purchase 5,000 shares of our common stock at an exercise price equal to the fair market value of our common stock on the date of grant. Each option is exercisable from its date of grant through the fifth anniversary of that date, unless terminated earlier in accordance with the plan. The exercise price for the options granted to our non-employee directors in 2013 was $10.44 per share., 206621=Section 162(m) of the Internal Revenue Code, as amended, imposes a $1 million limit on the amount that a public company may deduct for compensation paid to the company’s chief executive officer or certain of the company’s other most highly compensated executive officers. This limitation does not apply to compensation that meets the requirements under Section 162(m) for “qualifying performance-based” compensation (compensation paid only if the individual’s or the company’s performance meets pre-established objective goals based on performance criteria approved by the stockholders). We periodically review the potential consequences of Section 162(m) and may structure some or all of the compensation for our executive officers so that it will not be subject to the deduction limitations of Section 162(m). None of the compensation paid to our executive officers for 2013 was structured to be “qualifying performance-based” compensation. For 2013, we were not precluded by Section 162(m) from deducting any compensation that we paid to any of our executive officers., 475854=Our consolidated financial statements as of and for the fiscal year ended December 31, 2013, were audited by Grant Thornton LLP, an independent registered public accounting firm. In 2013, the Audit Committee selected Grant Thornton LLP as our principal independent auditor for the year ending December 31, 2014., 371622=Amounts paid to Mr. Manuel Moroun for 2013 represented payments under his Consulting Agreement with PTSI. The Consulting Agreement was entered into on December 6, 2007, with an initial term of one year and automatic renewals for four additional one-year periods. Pursuant to the agreement, Mr. Manuel Moroun provided us with consultation and advice as to the management and operation of PTSI, and such other consulting activities as we requested. For the services that Mr. Manuel Moroun rendered pursuant to the agreement, we paid him a consulting fee of $100,000 per year, in quarterly installments. During 2013, the Company renewed this agreement under the same terms and conditions for an additional five-year period., 435557=Although this is an advisory vote which will not be binding on the Compensation and Stock Option Committee or the Board, we will carefully review the results of the vote. The Compensation Committee will consider stockholders’ concerns and take them into account when designing future executive compensation programs. The Board therefore recommends that you indicate your support of the Company’s executive compensation in fiscal year 2013, as outlined in the above resolution., 101833=Norman E. Harned, age 73, retired as Vice President, Treasurer and Secretary of CenTra, Inc. in 2007, after 35 years of service to CenTra and its predecessor companies. Prior to joining CenTra, Mr. Harned was a senior on the audit and tax staff of Haskins & Sells, Certified Public Accountants (later Deloitte, Haskins & Sells and now Deloitte & Touche LLP). Mr. Harned is a certified public accountant. He has served on the board of directors of Durarock Reinsurance, Ltd., a reinsurance company, since 1985. Mr. Harned became a director of PTSI in March 2014. He currently serves on the Audit Committee. His extensive experience as an executive in the transportation industry and his experience and certification as a professional accountant qualify him to serve on the Board and as a member of the Audit Committee of PTSI., 251075=We have not established a proportion that salary and bonus should be of our executive officers’ total compensation. As indicated in the Summary Compensation Table, the proportion for 2013 that salary and bonus were of total compensation ranged from 87% to 89% for our executive officers., 143452=Our Board of Directors has a policy of encouraging our directors to attend the annual meetings of the stockholders. In 2013, all but one of our then current directors attended the Annual Meeting., 249439=Lance K. Stewart. The Company did not have a written employment agreement with Mr. Stewart during his service as CFO. At the time Mr. Stewart’s resignation became effective, he earned an annual salary of $280,000. Prior to June 3, 2013, Mr. Stewart earned an annual salary of $200,000., 413184=Includes 1,625,877 shares owned directly, 14,000 options available for exercise, and 3,092,000 shares held in a trust of which Mr. Matthew Moroun is a co-trustee and a beneficiary (the “Moroun Trust”). Mr. Hal M. Briand is co-trustee with Mr. Matthew Moroun of the Moroun Trust and may therefore also be deemed to beneficially own the shares held by the Moroun Trust. The business address of each of Messrs. Moroun and Briand is 12225 Stephens Road, Warren, Michigan 48091., 196354=During April 2012, the Compensation Committee awarded a discretionary cash bonus to Mr. Cushman in the amount of $150,000 and to Mr. Stewart in the amount $50,000. The terms of these bonuses provided that one-half of the bonus amount awarded was paid during April 2012, while the remaining one-half is to be paid at the rate of 12.5% of the bonus amount awarded during each of the next four succeeding years, subject to the executive’s continued employment with the Company., 169810=Daniel H. Cushman. Mr. Cushman, age 59, has served as President and CEO since July 2009. Prior to his employment with the Company, Mr. Cushman served as Vice President of Sales and Marketing for CRST International, Inc. in Cedar Rapids, Iowa (“CRST”) from July 2008 to July 2009, and as Vice President and General Manager of Dedicated Services for CRST from March 2008 to July 2008. From January 2007 to March 2008, Mr. Cushman was Senior Executive Vice President and Chief Marketing Officer for Werner Enterprises in Omaha, Nebraska. From January 2002 to December 2006, he served as Executive Vice President Chief Marketing and Operations Officer for Werner Enterprises., 244209=Mr. West was appointed as Vice President of Finance, Chief Financial Officer, Secretary and Treasurer on June 3, 2013, upon the resignation of Mr. Stewart. Accordingly, the table reflects only Mr. West’s 2013 compensation. Mr. Stewart’s resignation from the Company became effective on September 3, 2013., 155224=The Audit Committee discussed with PTSI’s independent registered public accounting firm, Grant Thornton LLP (“Grant Thornton”), who is responsible for expressing an opinion on the conformity of our audited financial statements with generally accepted accounting principles, its judgments as to the quality and the acceptability of our financial reporting and such other matters as are required to be discussed with the Audit Committee under standards of the Public Company Accounting Oversight Board (PCAOB), including the matters required to be discussed pursuant to Auditing Standard No. 16 (Communications with Audit Committees). The Audit Committee and Grant Thornton also reviewed management’s assessment, which was included in management’s report on internal control over financial reporting and Grant Thornton’s opinion on the effectiveness of the company’s internal control over financial reporting as of December 31, 2013., 378286=The following table sets forth certain information as of March 31, 2014, regarding beneficial ownership of our Common Stock by: (i) each person who is known to us to own beneficially more than 5% of our Common Stock; (ii) each of our directors; (iii) each of the named executive officers in the Summary Compensation Table of this annual report; and (iv) the total for our current directors and named executive officers as a group., 522178=(e)     History. This Plan is an amendment and restatement of P.A.M. Transportation Services, Inc. 2006 Stock Option Plan, which was adopted by the Board in March 2006 and approved by the Company’s shareholders in May 2006. Should any material provision of this Plan be determined to impair the rights of a Participant under an award granted prior to the Effective Date of this Plan, the award agreement covering the Stock Award shall instead be treated as including the provision as stated in the 2006 Stock Option Plan as an explicit term., 147076=Each current member of the Audit Committee is independent, as independence for audit committee members is defined in the NASDAQ listing standards and the rules of the SEC. From May 2013 to March 2014, as permitted by Rule 5605(c)(2) of the NASDAQ listing standards, the Committee temporarily included one director, Frederick P. Calderone, who is not an independent director as defined by the NASDAQ listing standards. Because Mr. Calderone is employed by CenTra, Inc., a company owned by Matthew T. Moroun, our Chairman of the Board and controlling stockholder, and his father, Manuel J. Moroun, who is also a director of the Company, our Board of Directors has determined that Mr. Calderone is not an independent director as defined by the NASDAQ listing standards. Mr. Calderone otherwise meets the criteria for audit committee members under the NASDAQ listing standards and the rules of the SEC. Based on his extensive financial and accounting experience and in order to maintain at least three members on the Audit Committee as required by the NASDAQ listing standards, the Board of Directors determined that it was in the best interests of the Company for Mr. Calderone to serve on the Audit Committee following the retirement of two previous members of the Audit Committee effective at our Annual Meeting in 2013 until an additional independent director was elected to our Board of Directors. Mr. Calderone served on the Audit Committee until the appointment of Norman E. Harned to the Committee on March 13, 2014., 402762=Total Outstanding Shares as of March 31, 2014, 194201=During January 2014, as authorized by the Board, the Compensation Committee awarded a discretionary cash bonus to Daniel H. Cushman, our CEO, in the amount of $224,500 and to Allen W. West, our Vice President of Finance, Chief Financial Officer, Secretary and Treasurer (“CFO”), in the amount of $75,000. The terms of Mr. Cushman’s bonus provided that 30% of the bonus was paid immediately, while the remaining 70% will be paid in equal installments of 17.5% of the bonus amount awarded during each of the next four succeeding years, subject to his continued employment with the Company. The terms of Mr. West’s bonus provided that 46.8% of the bonus was paid immediately, while the remaining 53.2% of the bonus will be paid in equal installments of 13.3% of the bonus amount awarded during each of the next four succeeding years, subject to his continued employment with the Company., 211199=At our 2011 Annual Meeting of Stockholders, we held our first advisory vote on executive compensation, commonly referred to as “say on pay.” Our stockholders overwhelmingly approved the “say on pay” resolution presented with more than 99% of the votes cast (excludes abstentions and broker non-votes) voting to approve our executive compensation. The Compensation Committee reviewed these voting results and given the strong level of support, did not make any changes to our executive compensation program or principles in response to the vote. In addition, at our 2011 Annual Meeting of Stockholders, over 70% of the shares voted (excludes abstentions and broker non-votes) were in favor of our recommendation to hold the “say on pay” vote every three years. As such, we have included a “say on pay” in this Proxy Statement for consideration and approval at the 2014 Annual Meeting. While the vote is an advisory and non-binding vote, the Compensation Committee and the Board will review the voting results to determine the cause or causes of any significant negative voting results., 225514=2011, 96577=Director Since 2009, 368013=Our CEO and President, Mr. Cushman, who is also a director, has been omitted from this table because he receives no additional compensation for serving on our Board of Directors. Mr. Cushman’s compensation is included in the Summary Compensation Table. Our current director Mr. Norman E. Harned has also been omitted from this table as he was elected to the Board of Directors in March 2014. Messrs. Conner and Wilkins each retired from the Board of Directors effective May 23, 2013., 407373=The percentages shown are based on the 7,991,613 shares of our common stock outstanding as of March 31, 2014, plus the number of shares that the named person or group has the right to acquire within 60 days of March 31, 2014. For purposes of computing the percentage of outstanding shares of common stock held by each person or group, any shares the person or group has the right to acquire within 60 days of March 31, 2014 are deemed to be outstanding with respect to such person or group, but are not deemed to be outstanding for the purpose of computing the percentage of ownership of any other person or group., 517326=2014 AMENDED AND RESTATED STOCK OPTION AND INCENTIVE PLAN, 197158=Upon his resignation in 2013, Mr. Stewart forfeited the remaining $54,750 in unpaid amounts from his 2013 and 2012 bonus awards., 195416=During April 2013, the Compensation Committee awarded a discretionary cash bonus to Mr. Cushman in the amount of $180,000, and to Lance K. Stewart, our then CFO, in the amount of $60,000. The terms of the bonuses provided that 40% of the bonus amount awarded was paid immediately, while the remaining 60% is to be paid at the rate of 15% of the bonus amount awarded during each of the next four succeeding years, subject to the executive’s continued employment with the Company. The Compensation Committee also paid Mr. West, in his prior role with the Company, a one-time discretionary cash bonus of $5,000., 510276=In order for a proposal by a stockholder to be included in the proxy statement at the 2015 annual meeting of stockholders, the proposal must be received at our principal executive office not later than December 18, 2014, the date that is 120 days before the first anniversary of the date of this Proxy Statement. The proposal should be directed to the attention of the Secretary, for consideration for inclusion in our proxy statement and form of proxy relating to that meeting. Any such proposals must comply in all respects with the rules and regulations of the SEC., 324287=In November 2013, Messrs. Cushman and West each received restricted shares of our common stock, which vest in equal installments of 20% per year beginning on the first anniversary grant date. In general, the unvested shares are forfeited at the time of termination., 94950=Frederick P. Calderone, age 63, has served as a Vice President of CenTra, Inc. for the past 23 years. CenTra is a transportation holding company headquartered in Warren, Michigan. Prior to joining CenTra, Mr. Calderone was a partner with Deloitte, Haskins, & Sells, Certified Public Accountants (now Deloitte & Touche LLP). Mr. Calderone is a certified public accountant and an attorney. He has served as a director of PTSI since May 1998. He has extensive experience in finance and accounting. Because he has served as director of PTSI for over fifteen years, he has an enhanced knowledge of PTSI’s corporate governance, personnel matters and growth strategy. These experiences qualify him for service on the Board of PTSI., 202097=On November 15, 2013, the Board approved the issuance of restricted shares of our common stock to our executive officers in the amount of 5,000 shares to Mr. Cushman and 1,250 shares to Mr. West. These restricted shares will vest in five equal annual installments beginning on the first anniversary of the grant date., 103499=Director Since 2002, 532883=(e)     “Code” means the Internal Revenue Code of 1986, as amended. References in the Plan to any section of the Code shall be deemed to include any amendments or successor provisions to such section and any rules and regulations promulgated thereunder., 125484=Compensation Committee. Following the retirement of two of our independent directors effective as of our Annual Meeting in 2013, our Board of Directors elected to appoint our Chairman of the Board and our CEO as the two members of our Compensation Committee based on our status as a “controlled company” under the NASDAQ Listing Rules. The Compensation Committee met one time in 2013. The Compensation Committee assists our Board of Directors in carrying out its responsibilities relating to compensation and benefits for our executive officers. The Compensation Committee’s responsibilities and authority include:, 502749=Payments in the amount of $22,888 for parts and labor charges incurred to repair our equipment and payments of $42,737 for management services were made to a subsidiary of CenTra during 2013., 108393=Daniel C. Sullivan, age 73, has been a practicing attorney, specializing in transportation law for more than 40 years. Mr. Sullivan has been a principal with the firm of Sullivan, Hincks & Conway, or its predecessor, presently located in Oak Brook, Illinois, since 1972. Mr. Sullivan has served as a director of PTSI since June 1986. Mr. Sullivan has also served as a member of the Board of Directors of Universal Truckload Services, Inc. (NASDAQ: UACL) since November 2004. He currently serves on the Audit Committee of PTSI. He has extensive knowledge in the field of transportation law. His long history on the Board and experience in the transportation industry give him an in-depth understanding of PTSI’s customer base, industry structure, operating history, growth strategy and corporate governance. This knowledge and experience qualifies him for service on the Board and as a member of the Audit Committee of PTSI., 53967=May 29, 2014, 236270=2011, 375771=For 2014, each of our non-employee directors, except our Chairman on the Board, will receive an annual retainer of $30,000 to be paid in quarterly installments. Our Chairman of the Board will continue to receive an annual retainer of $100,000, and the chairmen of our Audit Committee and our Compensation Committee will receive an additional annual retainer of $10,000 and $5,000, respectively. In addition to these cash retainers, our non-employee directors, including the Chairman, have received a stock retainer valued at $10,000 based on the closing price of our common stock on the date of the award. We will continue to reimburse the directors for expenses that they incur in attending Board and committee meetings, including expenses for food, lodging and transportation., 504696=Since September 2009, we have secured coverage for commercial auto and general liability insurance through an unaffiliated insurance broker, which is written by a subsidiary of Oakland Financial Corporation. In 2013 we made premium payments of $10,384,757 for commercial auto liability and general liability coverage under these policies., 758510=THIS RESTRICTED STOCK BONUS AWARD AGREEMENT (the “Agreement”) contains the terms and conditions of the restricted stock bonus award granted to you by PAM Transportation Services, Inc., a Delaware corporation (the “Company”) under PAM Transportation Services, Inc.’s 2014 Amended and Restated Stock Option and Incentive Plan, adopted by the Company’s Board of Directors on March 13, 2014 (the “Plan”)., 223294=2012, 517553=TERMINATION DATE: MARCH 13, 2024, 369525=The amounts shown represent the compensation expense that we recognized in 2013 for option awards for our non-employee directors, determined in accordance with FASB ASC Topic 718. Information regarding assumptions made for purposes of determining these amounts is in Note 12 “Stock-Based Compensation” to our 2013 consolidated financial statements included in Item 8 \"Financial Statements and Supplementary Data\" of our Annual Report to the SEC on Form 10-K for the year ended December 31, 2013. On March 2, 2013, each of our non-employee directors was awarded an option for 5,000 shares of our common stock under our 2006 Stock Option Plan. The grant date fair value of each of these options, determined in accordance with FASB ASC Topic 718 was $5.13 per share. As of December 31, 2013, our non-employee directors held the following option awards to acquire our common stock: Messrs. Manuel Moroun and Matthew Moroun, options for 16,000 shares; Messrs. Calderone and Sullivan, options for 14,000 shares; Mr. Davis, options for 10,000 shares., 326005=The following table provides information regarding amounts payable to Mr. Cushman under his employment agreement in connection with a termination of his employment. The amounts shown assume that termination of employment was effective as of December 31, 2013, the last business day of our 2013 fiscal year, and include estimates of the amounts that would be paid. Amounts payable under these provisions would be paid in equal installments pursuant to the Company’s regularly scheduled payrolls. The actual amounts would only be determined upon an officer’s termination of employment. No amounts would have been payable to Mr. West upon a termination of his employment as of December 31, 2013, other than salary earned through the date of termination and payable pursuant to the Company’s regularly scheduled payrolls., 495079=Includes the aggregate fees billed for professional services rendered for 2013 and 2012 for the audit of our annual financial statements and review of financial statements included in our quarterly reports on Form 10-Q., 123565=Audit Committee. We have a separately designated standing Audit Committee established in accordance with Section 3(a)(58)(A) of the Securities Exchange Act of 1934. The Audit Committee has three members. Each of the members of the Audit Committee is an independent director as independence for audit committee members is defined in the NASDAQ listing standards and the rules of the SEC. The Audit Committee has a charter that has been approved by our Board of Directors and is available on our website, at www.pamtransport.com under the caption of “Investors.”, 36510=To Be Held on May 29, 2014, 105610=Director Since 1992, 310001=Options granted on 5/24/2012 and vest at a rate of 20% annually beginning on the first anniversary of the grant date., 54681=This proxy statement and form of proxy are furnished in connection with the solicitation of proxies on behalf of the Board of Directors of P.A.M. Transportation Services, Inc. (“PTSI” or the “Company”) for use at our annual meeting of stockholders (the “Annual Meeting”) to be held at the corporate office of CenTra, Inc. located at 12225 Stephens Road, Warren, Michigan 48089, on Thursday, May 29, 2014, at 9:00 a.m. local time, and at any or all adjournments or postponements of the meeting. The telephone number for our principal executive office is (479) 361-9111. This proxy statement and form of proxy are being mailed to stockholders on or about April 24, 2014., 22853=Tontitown, Arkansas 72770, 441765=The Plan will replace our 2006 Stock Option Plan. Stock options currently outstanding under the 2006 Stock Option Plan will remain outstanding in accordance with the terms of that plan and the stock option agreements entered into under that plan., 56160=Our combined Proxy Statement and 2013 Annual Report to Stockholders, which includes our Annual Report on Form 10-K, are available at www.envisionreports.com/PTSI., 32609=April 18, 2014, 415437=Section 16(a) of the Securities Exchange Act of 1934 requires our directors, executive officers and persons who own more than 10% of our outstanding common stock to file with the SEC initial reports of ownership and reports of changes in ownership of our common stock. Executive officers, directors and greater than 10% stockholders are also required to furnish us with copies of the reports that they file. To our knowledge, based solely on a review of the copies of the reports furnished to us and representations received from our directors and executive officers, we believe that all reports required to be filed under Section 16(a) for 2013 were timely filed., 471164=RESOLVED, that the stockholders of P.A.M. Transportation Services, Inc. approve the 2014 Amended and Restated Stock Option and Incentive Plan, including the material terms of the performance goals under such plan., 506099=We purchase workers compensation insurance coverage through an unaffiliated insurance broker, which is written by a subsidiary of Oakland Financial Corporation. In 2013, we made payments of $254,552 for workers compensation coverage under this policy., 65396=If you hold shares in “street name” through a broker or other nominee, your broker or nominee may not be permitted to exercise voting discretion with respect to some of the matters to be acted upon. Under current stock exchange rules, brokers who do not have instructions from their customers may not use their discretion in voting their customers’ shares on certain specific matters that are not considered to be “routine” matters, including the election of directors, executive compensation and other significant matters. The proposals in this Proxy Statement to elect directors, to approve on an advisory basis the Company’s executive compensation and to approve the Company’s 2014 Amended and Restated Stock Option and Incentive Plan, including the material terms of the performance goals under such plan, are not considered to be routine matters. Therefore, without your specific instructions, your shares will not be voted on these matters and will not be counted in determining the number of shares necessary for approval. Shares represented by such “broker non-votes,” however, will be counted in determining whether there is a quorum. You should follow the directions provided by your nominee regarding instructions on how to vote your shares., 117343=During 2013, our Board of Directors held four meetings. All directors, except Mr. Manuel J. Moroun, attended at least 75% of the meetings of our Board, including committees on which they then served, during the period that they served., 459024=New Plan Benefits. Following approval of the Restated Plan by the stockholders, shares of restricted stock will be award under the Restated Plan to Daniel H. Cushman in the amount of 5,000 shares, to Allen W. West in the amount of 1,250 shares, and to certain other employees of the Company in the aggregate amount of 3,250 shares. These awards will replace the restricted stock awards previously granted in 2013. In addition, each of our non-employee directors has received a $10,000 retainer in shares of our common stock for 2014, and we anticipate that the non-employee directors may receive similar stock retainers in future years. No determination has been made with respect to the recipients of other future awards under the Restated Plan, and it is not possible to specify the names or positions of persons to whom such awards will be granted, or the number of shares, within the limitations of the Restated Plan, to be covered by such awards., 433046=We believe that the Company’s executive compensation programs have provided an effective incentive, which has led to the achievement of our positive results. We are asking our stockholders to indicate their support for our executive compensation as described in this proxy statement. This proposal, commonly referred to as a “say on pay” proposal, gives you as a stockholder the opportunity to express your views of our fiscal year 2013 executive compensation policies and procedures. The vote is not intended to address any specific item of compensation, but rather the overall compensation of our executive officers and the policies and procedures described in the proxy statement. Therefore, we ask our stockholders to vote in favor of the following resolution at the Annual Meeting:, 508848=Additional information concerning us, including our financial statements, is provided in our 2013 Annual Report to Stockholders that accompanies this proxy statement. Our Annual Report on Form 10-K for the year ended December 31, 2013, as filed with the SEC, is available to stockholders who make a written request for it to our Secretary, Allen West, at our principal executive office, Post Office Box 188, Tontitown, Arkansas 72770. Copies of exhibits filed with that report or referenced in it will be furnished to stockholders of record upon request and payment of our expenses in furnishing such documents. The Annual Report is also available on our website at www.pamtransport.com under the caption of “Investors.”, 118991=Our Board of Directors has, and appoints members to, three standing committees: the Audit Committee, the Compensation and Stock Option Committee (the “Compensation Committee”), and the Executive Committee. The membership of these committees, as of April 15, 2014, was as follows:, 138685=Our Board will consider as potential nominees persons recommended by stockholders. Recommendations should be submitted to our Board of Directors in care of our Secretary, Allen W. West, at Post Office Box 188, Tontitown, Arkansas 72770. Each recommendation should include a personal biography of the suggested nominee, a description of the background or experience that qualifies the person for consideration, and a statement that the person has agreed to serve if nominated and elected., 373158=Director compensation is determined by our Board of Directors. For 2013, we paid our non-employee directors an annual retainer of $20,000, and a fee of $1,800 for each meeting of the Board or its committees that they attended in person, and $600 for each meeting that they attended by telephone. The Chairman of the Board, which is a non-officer position, is paid an annual retainer of $100,000; and the Chairman of the Audit Committee is paid an additional annual retainer of $5,000. We reimburse our directors for expenses that they incur in attending Board and committee meetings, including expenses for food, lodging and transportation., 506682=On December 6, 2007, we entered into a Consulting Agreement with Mr. Manuel Moroun. The agreement had an initial term of one year, and automatically renewed for four additional one-year periods. Pursuant to the agreement, Mr. Manuel Moroun provided consultation and advice as to the management and operation of PTSI, and such other consulting activities as we requested. For the services that Mr. Manuel Moroun rendered pursuant to the agreement, we paid him a consulting fee of $100,000 per year, which was paid in quarterly installments. During 2013, the Company renewed this agreement under the same terms and conditions for an additional five-year period., 649557=In the event a Participant’s Continuous Service terminates (including upon death or Disability), Phantom Stock Units that have not vested as of the date of termination shall automatically and without notice terminate and become null and void at 5:00 p.m. Eastern Time on the date of termination. With regard to those Phantom Stock Units that have vested, unless the document evidencing the grant states otherwise, the Participant or Participant’s designee may redeem a Phantom Stock Unit (to the extent that the Participant was entitled to redeem such Phantom Stock Unit as of the date of termination) but only within such period of time ending on the earlier of (i) the date three (3) months following the termination of the Participant’s Continuous Service, or (ii) the expiration of the term of the Phantom Stock Unit, if any. If, after termination of Continuous Service, the Participant does not redeem his Phantom Stock Units within such time period, the Phantom Stock Units shall terminate., 171637=Mr. West was appointed our Vice President of Finance, Chief Financial Officer, Secretary and Treasurer upon the resignation of Lance K. Stewart, our former Vice President of Finance, Chief Financial Officer, Secretary and Treasurer. Information regarding Mr. Stewart’s compensation for 2013 is included in this Compensation Discussion and Analysis and the executive compensation tables that follow., 76814=“FOR” the approval of the Company’s 2014 Amended and Restated Stock Option and Incentive Plan, including the material terms of the performance goals under such plan; and, 124470=The Audit Committee met four times in 2013. The Audit Committee assists our Board of Directors in overseeing our accounting and financial reporting process, internal controls and audit functions, and is directly responsible for the appointment, retention and compensation of our registered public accounting firm. Our Board of Directors has determined that Mr. Davis and Mr. Harned, who are members of the Audit Committee, are each qualified as an audit committee financial expert, as that term is defined in the rules of the Securities and Exchange Commission (“SEC”). More information about the Audit Committee is included below under the heading “Audit Committee Report.”, 214380=The following table provides information regarding the compensation earned by the executive officers for the three years ended December 31, 2013., 472525=the Approval of the 2014 Amended and Restated, 479130=for the 2014 Calendar Year, 141675=Stockholders may communicate directly with our Board of Directors as a group by writing to our Board of Directors, care of the Secretary of PTSI, Post Office Box 188, Tontitown, Arkansas 72770. Our Secretary will review all of the correspondence and regularly forward to our Board of Directors a summary of the correspondence, and copies of all of the correspondence that, in his opinion, deals with the functions of our Board of Directors or any of its committees or that our Secretary otherwise determines requires the attention of our Board of Directors. Directors may at any time review a log of all of the correspondence that is addressed to our Board, and request copies of any and all of the correspondence., 518323=(a)     Adoption. P.A.M. Transportation Services, Inc., a Delaware corporation (the “Company”) hereby adopts the P.A.M. Transportation Services, Inc. 2014 Amended and Restated Stock Option and Incentive Plan (the “Plan”). The Plan shall become effective on March 13, 2014 (the “Effective Date”), the date it was adopted by the Company’s Board of Directors, subject to the approval of the Company’s shareholders at the 2014 Annual Meeting. After the Effective Date, Stock Awards may be made as provided herein and may be made pursuant to and in accordance with agreements for the issuance thereof entered into prior to the Effective Date. This Plan or any subsequent plan may be amended and readopted by the Board and the shareholders from time to time.  Each re-adoption shall constitute a new plan.  Participants may hold awards under more than one plan., 642687=(B)     In the event a Participant’s Continuous Service terminates (including upon death or Disability), SARs that have not vested as of the date of termination shall automatically and without notice terminate and become null and void at 5:00 p.m. Eastern Time on the date of termination. With regard to those SARs that have vested, unless the document evidencing the grant states otherwise, the Participant or Participant’s designee may exercise a SAR (to the extent that the Participant was entitled to exercise the SAR as of the date of termination) but only within such period of time ending on the earlier of (i) the date three (3) months following the termination of the Participant’s Continuous Service, or (ii) the expiration of the term of the SAR or tandem Option, if any. If, after termination of Continuous Service, the Participant does not exercise his or her SAR within such time period, the SAR shall terminate., 276516=The following table provides information as of December 31, 2013, regarding equity awards, including unexercised stock options, for each of the executive officers., 198705=Long-Term Equity Incentives. Long-term equity incentives are awarded to our named executive officers as part of our overall compensation package, and have historically been provided through stock options granted under our 2006 Stock Option Plan, which was adopted by the Board of Directors in March 2006 and approved by our stockholders in May 2006. The plan provides for the issuance of stock options for up to 750,000 shares of our common stock, subject to adjustments, to our officers, directors, key employees and consultants. On March 13, 2014, our Board of Directors adopted an Amended and Restated Stock Option and Incentive Plan, which authorizes grants of additional types of awards, including restricted stock, restricted stock units, stock appreciation rights, phantom stock units, and unrestricted common stock. This amended and restated incentive plan is subject to approval by our stockholders at this Annual Meeting. More information regarding the plan, including a summary of the material terms of the plan, is provided in “Proposal Three: Approval of Amended and Restated Stock Option and Incentive Plan” on page 27 of this Proxy Statement., 553684=(bb)     “Plan” means this P.A.M. Transportation Services, Inc. 2014 Amended and Restated Stock Option and Incentive Plan., 96984=Daniel H. Cushman, age 59, has served as President and Chief Executive Officer since July 2009. Prior to his employment with the Company, Mr. Cushman served as Vice President of Sales and Marketing for CRST International, Inc. in Cedar Rapids, Iowa (“CRST”), from July 2008 to July 2009, and as Vice President and General Manager of Dedicated Services for CRST from March 2008 to July 2008. From January 2007 to March 2008, Mr. Cushman was Senior Executive Vice President and Chief Marketing Officer for Werner Enterprises in Omaha, Nebraska. From January 2002 to December 2006, he served as Executive Vice President Chief Marketing and Operations Officer for Werner Enterprises. These experiences qualify him to serve on the Board of PTSI., 445400=Shares Available. A total of 750,000 shares of common stock have been reserved for issuance under the Restated Plan. Shares of common stock covered by awards that expire, terminate, lapse, are reacquired by us prior to vesting or are redeemed for cash will revert to and again become available for grant under the Plan. No employee will be eligible to be granted options or stock appreciation rights covering more than 100,000 shares during any fiscal year. As of April 18, 2014, approximately 363,000 shares of common stock are available for issuance under the 2006 Stock Option Plan., 170805=Allen W. West. Mr. West, age 46, has served as Vice President of Finance, Chief Financial Officer, Secretary and Treasurer since June 2013. Mr. West served as Vice President of Tax and Financial Reporting of PTSI from 2007 to June 2013 and as Director of Tax from 1997 to 2007. Prior to joining PTSI, Mr. West served in various capacities within the trucking industry and within public accounting. He is a Certified Public Accountant and a Chartered Global Management Accountant., 57424=At the Annual Meeting, stockholders will act upon the matters outlined in the accompanying notice of the Annual Meeting, including the election of directors; a non-binding advisory vote regarding compensation of the named executive officers; the approval of the Company’s 2014 Amended and Restated Stock Option and Incentive Plan, including the material terms of the performance goals under such plan; ratification of the appointment of our independent public accounting firm, and consideration of such other business as may properly come before the Annual Meeting., 502293=Payments in the amount of $4,070 were made to certain subsidiaries of CenTra for freight transportation charges during 2013., 540824=(o)     “Exchange Act” means the Securities Exchange Act of 1934, as amended, and the rules and regulations promulgated thereunder., 103922=Manuel J. Moroun, age 86, is a principal shareholder of CenTra, Inc., a holding company based in Warren, Michigan and has served as Chief Executive Officer of CenTra since 1970. Mr. Moroun is a principal shareholder in other family owned businesses engaged in providing logistics and transportation services. Mr. Moroun has served as a director of PTSI since 2002. Mr. Moroun also has served as a director of Universal Truckload Services, Inc. (NASDAQ: UACL) since 2004. Manuel J. Moroun is the father of Matthew T. Moroun. With over 50 years experience in starting and managing transportation businesses, Mr. Moroun brings the perspective and insight of a successful transportation entrepreneur to the Board’s role in evaluating the Company’s business planning and performance. These experiences qualify him for service on the Board of PTSI., 252056=The following table shows all plan-based awards granted to the named executive officers during fiscal year 2013. No stock options were granted to our executive officers during 2013. As of April 18, 2014, 363,000 shares of our common stock remain available for issuance under the 2006 Stock Option Plan., 501712=Payments of $408,616 were made for real estate leases during 2013 which include maintenance facilities in two states and trailer drop yards in thirteen states. The leases are generally month to month leases with automatic monthly renewal provisions., 480261=The following table shows the fees for professional services of Grant Thornton for audit and other services they provided to us for 2013 and 2012, 58677=Only stockholders of record at the close of business on the record date, April 9, 2014 (the “Record Date”), are entitled to receive notice of the Annual Meeting and to vote their shares at the meeting. Holders of our common stock are entitled to one vote per share., 136095=Executive Committee. The Executive Committee exercises the authority of our Board of Directors in accordance with the Bylaws between regular meetings of our Board. The Executive Committee did not meet during 2013., 145524=In 2013, Messrs. Davis, Sullivan, and Frank L. Conner served on the Compensation Committee until the 2013 Annual Meeting. On May 23, 2013, the Board appointed Mr. Matthew Moroun and Mr. Cushman to the Compensation Committee in accordance with NASDAQ Rule 5615(c)(1). Mr. Cushman is currently President and CEO of PTSI. Mr. Moroun is Chairman of the Board of Directors and our largest stockholder. Information regarding certain transactions between PTSI and entities controlled by Mr. Moroun is provided in the section entitled “Transactions With Related Persons” on page 33 of this proxy statement. None of our executive officers serves or served as a director or member of the compensation committee of another entity in a case where an executive officer of such other entity serves or served as a director or member of our Compensation Committee., 246331=On June 29, 2009, we entered into an employment agreement with our President and CEO, Mr. Cushman. Pursuant to the agreement, the Company agreed to pay Mr. Cushman an initial annual salary of $400,000. In addition, at the beginning of his employment, he received a bonus of $55,000 to be used at his discretion toward expenses for his relocation to Tontitown, Arkansas, and the sale of his home in Nebraska. The Company also agreed to reimburse Mr. Cushman for up to $1,800 per month for up to eighteen months for temporary living expenses. The employment agreement includes provisions regarding termination of employment and his non-compete, non-solicitation and confidentiality obligations to the Company. Additional information regarding these provisions is discussed below under the heading “Potential Payments Upon Termination or Change in Control.”, 228786=2013, 30525=All stockholders of record as of the close of business on April 9, 2014, will be entitled to notice of and to vote at the meeting or any adjournment or postponement of the meeting., 201123=We did not grant any stock options to our executive officers in 2013. On May 24, 2012, we granted stock options to our executive officers pursuant to the 2006 Stock Option Plan with an exercise price of $10.90 per share based on the average of the high and low sales prices of the Company’s stock on the date of the grant. Mr. Cushman received an option for 49,000 shares and Mr. Stewart received an option for 15,000 shares. The stock option grants vest in five equal annual installments beginning on the first anniversary of the grant date. We did not issue any options to our executive officers or other employees under the plan during 2011., 343926=The following table provides information about the compensation of our directors for the year ended December 31, 2013., 55692=IMPORTANT NOTICE REGARDING THE AVAILABILITY OF PROXY MATERIALS FOR THE STOCKHOLDERS’ MEETING TO BE HELD ON MAY 29, 2014, 98974=W. Scott Davis, age 51, is Vice Chairman and Chief Financial Officer of Clearview International, LLC, a data center business headquartered in Dallas, Texas. He has been an investor in Clearview since June 2009. He was a Partner and Senior Managing Director of Rock Financial Partners, LLC from April 2009 to December 2013. From August 2006 to April 2009, he served as the President and sole owner of WS Davis, Inc., the company through which he performed his consulting work. From 1987 to 2006, Mr. Davis worked for Stephens Inc., an investment banking firm, including serving as an Executive Vice President of Stephens Inc. from 2002 to 2006. Mr. Davis has served as a director of PTSI since August 2007. He has extensive experience in the investment banking industry. He currently serves as Chairman of our Audit Committee. His extensive experience in financial statement analysis and review qualifies him to serve on the Board and as a member of the Audit Committee of PTSI., 28318=To approve the 2014 Amended and Restated Stock Option and Incentive Plan, including the material terms of the performance goals under such plan (the Board of Directors recommends a vote “FOR” this proposal);, 310907=Options granted on 11/30/2010 and vest at a rate of 20% annually beginning on the first anniversary of the grant date., 515493=April 18, 2014, 231807=2013, 714224=2014 AMENDED AND RESTATED STOCK OPTION AND INCENTIVE PLAN, 440255=On March 13, 2014, our Board of Directors adopted the Company’s 2014 Amended and Restated Stock Option and Incentive Plan (the “Restated Plan”) for employees, directors and consultants of PTSI and its subsidiaries and recommends that the stockholders vote for approval of the Restated Plan. This Restated Plan is an amendment and restatement of the P.A.M. Transportation Services, Inc. 2006 Stock Option Plan, which was adopted by the Board in March 2006 and approved by the Company’s stockholders in May 2006. The amendment and restatement of the 2006 plan relates primarily to the inclusion of additional types of awards under the Restated Plan, the removal of the automatic annual stock option grants to our non-employee directors and the extension of the term of the plan. The 2006 plan provided only for the grant of incentive and non-qualified stock options. The Restated Plan authorizes the grant of stock options, restricted stock bonuses, restricted stock purchase rights, stock appreciation rights, phantom stock units, restricted stock units, and unrestricted common stock, to our employees, directors and consultants. The Restated Plan will expire on March 13, 2024., 209293=The elements of executive compensation are discussed at meetings of the Compensation Committee and the Board, with significant input from our Chairman of the Board and our CEO. Annual base salary is generally determined annually but may be determined for a multi-year period at the time that employment agreements are negotiated with our executive officers, if applicable. Cash incentive compensation and other bonuses and forms of stock-based compensation are discussed from time to time, but there is no set schedule for making determinations regarding these types of compensation. The committee and the Board retain considerable flexibility in deciding when to address these matters. In making its compensation decisions, the Board members will usually seek input from the executive officers. However, the Board makes the final decisions on compensation of our CEO and on equity awards to our executive officers, and the committee makes the final decisions on other compensation to our executive officers. The committee is authorized to utilize compensation consultants. Neither the committee nor the Board utilized a compensation consultant regarding 2013 executive compensation., 157252=In fulfilling its oversight responsibilities, the Audit Committee has reviewed and discussed the audited financial statements in the Annual Report on Form 10-K for the year ended December 31, 2013, with both management and our independent registered public accounting firm. The Audit Committee’s review included a discussion of the quality and integrity of the accounting principles, the reasonableness of significant estimates and judgments, and the clarity of disclosures in the financial statements., 94508=Director Since 1998, 107970=Director Since 1986, 500207=During 2013, certain subsidiaries of CenTra and other companies owned or controlled by our directors, Mr. Manuel Moroun and Mr. Matthew Moroun, paid us a total of $9,908,726. These payments represent freight transportation charges of $7,678,804, maintenance services performed in our maintenance facilities of $197,415, charges paid by us to third parties on behalf of the subsidiaries and affiliates of CenTra and then charged back at the amount paid of $105,265, real estate rent and upkeep of $344,442, leases of revenue equipment of $2,800, and proceeds on sales of revenue equipment of $1,580,000., 343557=Director Compensation for 2013, 559308=(jj)     “Securities Act” means the Securities Act of 1933, as amended., 405963=The number of shares beneficially owned includes any shares over which the person has sole or shared voting power or investment power and also any shares that the person can acquire within 60 days of March 31, 2014, through the exercise of any stock option or other right. Unless otherwise indicated, each person has sole investment and voting power (or shares such power with his spouse) over the shares set forth in the table. Includes shares that may be acquired pursuant to stock options granted under our stock option plans that are currently exercisable or become exercisable within 60 days of March 31, 2014., 67676=If, as of the Record Date, you are a stockholder of record and you attend the meeting, you may vote in person at the meeting. The authorized capital stock of PTSI consists of 40,000,000 shares of common stock, par value $0.01 per share and 10,000,000 shares of preferred stock, par value $0.01 per share. As of the close of business on April 9, 2014, there were 7,991,613 shares eligible to vote., 419591=The Dodd-Frank Wall Street Reform and Consumer Protection Act of 2010 (the “Dodd-Frank Act”) enables our stockholders to vote to approve, on an advisory non-binding basis, the compensation of our executive officers as disclosed in the proxy statement in accordance with the SEC’s rules. Accordingly, we are providing a vote on the resolution set forth below as required by the Dodd-Frank Act and Section 14A of the Securities Exchange Act of 1934., 717186=The Company, pursuant to the terms of the 2014 Amended and Restated Stock Option and Incentive Plan adopted by the Company’s Board of Directors on March 13, 2014 (the “Plan”), hereby grants an option to purchase the aforementioned number of shares of common stock of the Company (“Common Stock”) to the Optionholder at the aforementioned price and in all respects subject to the terms, definitions and provisions of this Agreement. The Option is intended to be a non-qualified stock option, and is not intended to be treated as an option that complies with Section 422 of the Internal Revenue Code of 1986, as amended., 98551=Director Since 2007, 240445=Amounts shown for 2013 represent a discretionary cash bonus that was awarded and paid at the rate of 40% during 2013 with the remaining 60% being paid at the rate of 15% of the bonus amount awarded during each of the next four years. Amounts shown for 2012 represent a discretionary cash bonus that was awarded and paid at the rate of 50% during 2012 with the remaining 50% being paid at the rate of 12.5% of the bonus amount awarded during each of the next four succeeding years. Amounts shown for 2011 represent a discretionary cash bonus paid during that year. Mr. Stewart forfeited the unpaid portion of his bonuses for 2012 and 2013 in the amounts of $18,750 and $36,000, respectively, upon his resignation from the Company., 504048=We purchase physical damage insurance coverage on our tractors and trailers through an unaffiliated insurance broker, which is written by a subsidiary of Oakland Financial Corporation. During 2013, we made payments for these policies in the amount of $2,200,992, and received $2,693,564 in payments for claims filed., 483283=2012, 511176=In connection with our annual meeting of stockholders to be held in 2015, if we do not receive notice of a matter or proposal to be considered by March 3, 2015, then the persons appointed by our Board of Directors to act as the proxies for such annual meeting (named in the form of proxy) will be allowed to use their discretionary voting authority with respect to any such matter or proposal at the annual meeting, if such matter or proposal is properly raised at the annual meeting and put to a vote., 470297=Stockholder approval of this proposal is required. We urge you to read the text of the 2014 Amended and Restated Stock Option and Incentive Plan, which is attached to this Proxy Statement as Appendix A and incorporated by reference into this proposal. We believe the Restated Plan will result in additional benefit to the Company while continuing our practice of compensating our executives through programs that emphasize performance. Accordingly, we ask our stockholders to vote “FOR” the following resolution at the Annual Meeting:, 507673=We believe that substantially all of the above transactions were entered into on terms at least as favorable to us as could have been obtained from persons who were not related to us, and each of the transactions was in our best interest. We expect to continue transactions with subsidiaries of CenTra and other companies owned or controlled by our directors, Mr. Manuel Moroun and Mr. Matthew Moroun, in 2014 that are similar to those described above., 311814=Performance-based options granted on 11/30/2010 which were earned during the second quarter of 2011 as a result of meeting specified performance criteria during the second quarter of 2011. Performance-based options vest at a rate of 20% annually from the date the option was earned., 101426=Director Since 2014, 174909=Historically, the compensation of our executive officers has been based primarily on the judgment of the Compensation Committee of our Board of Directors. Following the retirement of two of our former independent directors effective at our Annual Meeting on May 23, 2013, the Board of Directors appointed our Chairman, Mr. Matthew Moroun, and our CEO, Mr. Daniel Cushman, to the Compensation Committee in accordance with the exemption from the compensation committee independence requirements for controlled companies under NASDAQ Rule 5615(c)(1). Currently, the Compensation Committee determines the compensation for our officers and key employees other than the CEO, while the Board of Directors determines the CEO’s compensation and approves the equity awards to the named executive officers., 51427=Appendix A – 2014 Amended and Restated Stock Option and Incentive Plan, 312916=No options were exercised by our executive officers and no stock vested during 2013. On August 22, 2013, upon mutual agreement between the Company and Lance K. Stewart, we cancelled a total of 6,167 options then held by Mr. Stewart in exchange for a cash payment to Mr. Stewart in the aggregate amount of $8,854, which represented the difference between the fair market value of the underlying shares, determined based on the trading price of our common stock as reported by NASDAQ at the time of cancellation, and the respective exercise prices of the options., 106033=Matthew T. Moroun, age 41, has served as Vice Chairman and as a director of CenTra, Inc., a holding company based in Warren, Michigan, since 1993. Mr. Moroun is the principal shareholder and has served as Chairman of Oakland Financial Corporation, an insurance and real estate holding company based in Sterling Heights, Michigan, and its subsidiaries, since 1996. Mr. Moroun is a principal shareholder in other family owned businesses engaged in providing logistics and transportation services. Mr. Moroun has served as a director of PTSI since 1992 and as Chairman of the Board since 2007. Mr. Moroun has served as a director and as Chairman of the Board of Universal Truckload Services, Inc. (NASDAQ: UACL) since 2004. Matthew T. Moroun is the son of Manuel J. Moroun. Mr. Moroun’s extensive leadership experience with businesses providing transportation and logistics services brings invaluable perspective and insight to the Board’s role of evaluating the Company’s business planning and performance. This experience and insight qualify him for service as Chairman of the Board of PTSI., 757678=2014 AMENDED AND RESTATED STOCK OPTION AND INCENTIVE PLAN, 158100=In reliance on the reviews and discussions referred to above, the Audit Committee recommended to the Board of Directors that the audited financial statements be included in the Annual Report on Form 10-K for the year ended December 31, 2013, for filing with the SEC., 501141=During 2013, we made payments to certain subsidiaries of CenTra and other companies owned or controlled by our directors, Mr. Manuel Moroun and Mr. Matthew Moroun, in the aggregate amount of $13,564,529. These payments are described below., 410950=Based upon a Schedule 13G amendment, dated February 13, 2014, filed by Franklin Resources, Inc., a Delaware Corporation, and related parties, which indicates that as of December 31, 2013, Franklin Advisory Services, LLC had the sole power to vote and dispose of 565,000 shares as an investment advisor or manager to investment companies, trusts and separate accounts that own the 565,000 shares. The address of Franklin Resources, Inc. is One Franklin Parkway, San Mateo, California 94403. We make no representation as to the accuracy or completeness of the information reported., 25355=The 2014 annual meeting of stockholders of P.A.M. Transportation Services, Inc., a Delaware corporation (“PTSI” or the “Company”), will be held at the corporate office of CenTra, Inc. located at 12225 Stephens Road, Warren, Michigan 48089, on Thursday, May 29, 2014, at 9:00 a.m. local time. The meeting is being held for the purpose of considering and voting on the following proposals:, 482559=2013, 476497=Stockholders’ ratification of the selection of Grant Thornton LLP to be our independent registered public accounting firm for fiscal year 2014 is not required by our Bylaws or otherwise. However, the Board is submitting the selection of the independent registered public accounting firm to the stockholders for ratification as a matter of good corporate practice. Even if the selection is ratified, the Audit Committee may, at its discretion, direct the appointment of a different independent registered accounting firm at any time during the year if it determines that such change is in the best interests of PTSI and our stockholders., 221070=2013, 24237=To Be Held on May 29, 2014}",
    "lastModified": "Wed, 23 Apr 2014 18:27:34 GMT",
    "textBeforeTable": "  Our Board of Directors has, and appoints members to, three standing committees: the Audit Committee, the Compensation and Stock Option Committee (the “Compensation Committee”), and the Executive Committee. The membership of these committees, as of April 15, 2014, was as follows:   Board Committees     7     During 2013, our Board of Directors held four meetings. All directors, except Mr. Manuel J. Moroun, attended at least 75% of the meetings of our Board, including committees on which they then served, during the period that they served.  ",
    "textAfterTable": "* Committee chairman     Audit Committee. We have a separately designated standing Audit Committee established in accordance with Section 3(a)(58)(A) of the Securities Exchange Act of 1934. The Audit Committee has three members. Each of the members of the Audit Committee is an independent director as independence for audit committee members is defined in the NASDAQ listing standards and the rules of the SEC. The Audit Committee has a charter that has been approved by our Board of Directors and is available on our website, at www.pamtransport.com under the caption of “Investors.”   The Audit Committee met four times in 2013. The Audit Committee assists our Board of Directors in overseeing our accounting and financial reporting process, internal controls",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}