{
    "relation": [
        [
            "Name",
            "Rainbow Anklet",
            "Moonbow Anklet"
        ],
        [
            "Max Level",
            "6",
            "11"
        ],
        [
            "Special Property",
            "Daze Resistance +30%",
            "Daze Resistance +40%"
        ],
        [
            "Synthesis",
            "Daze Resistance",
            "Daze Resistance"
        ],
        [
            "Treasure Location",
            "Fifth Ark",
            "-"
        ],
        [
            "Catalysts",
            "Perovskite",
            "-"
        ]
    ],
    "pageTitle": "FFXIII Accessories",
    "title": "",
    "url": "http://www.ffexodus.com/ff13/access.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435797897,
    "recordOffset": 435789695,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The following tables are all the accessories, their level required to reach * or max level, any catalysts required to upgrate it, what synthesis group it is a part of and location it is found if it is a treasure. Accessories that are purchasable at a shop will be in the Shop section of the FF13 content. Any ability that starts with \"Auto\" does not mean it is constantly engaged. This simply means that at the start of every battle the attribute is added to the character until it wears off. All accessories in the same table transform into the accessory below it via the catalyst. Accessories     Home News Archive Community Forums Chatroom Mailbag Philosopher's Guild Conventions Disclaimer Site Staff Staff Openings Affiliates  ",
    "textAfterTable": "Tungsten Bangle 11 HP +150 Low HP PalumPolum Cobaltite Titanium Bangle 11 HP +200 Damage Reduction - Perovskite Gold Bangle 11 HP +250 Magic Defense Palamecia Uraninite Mythril Bangle 16 HP +300 High HP Yaschas Massif Mnar Stone Platinum Bangle 21 HP +400 Physical Defense Mah'Habara Scarletite Diamond Bangle 26 HP +500 Magic Defense Mission 26 Adamantite Adamant Bangle 36 HP +800 Damage rReduction Tesseracts Dark Matter Wurtzie Bangle 51 HP +1500 Independent - - Name Max Level Special Property Synthesis Treasure Location Catalysts Power Wristband 6 Strength +20 Physical Defense Pulse Vestige Cobaltite Brawler's Wristband 11 Strength +50 Physical Defense PalumPolum Uraninite Warrior's Wristband 11 Strength +100 Physical Defense Mission 23 Scarletite Power Glove 11 Strength +150 Physical Defense Eden Dark Matter Kaiser Knuckles 11 Strength +200 Ultimate Physic - - Name Max Level Special Property Synthesis Treasure Location Catalysts Magician's Mark 6 Magic +20 Magic Defense Lake Bresha Cobaltite Shaman's Mark 11 Magic +50 Magic Defense PalumPolum Uraninite Sorceror's Mark 11 Magic +100 Magic Defense Mission 05 Scarletite Weirding Glyph 11 Magic +150 Magic Defense Tesseracts Dark Matter Magistral Crest 11 Magic +200 Ultimate Magic - -",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}