{
    "relation": [
        [
            "School Code",
            "6418",
            "6422"
        ],
        [
            "School Name",
            "NORWOOD ELEMENTARY SCHOOL",
            "NORWOOD HIGH SCHOOL"
        ],
        [
            "Principal Name",
            "JAMES H HOFFMAN",
            "JAMES H HOFFMAN"
        ]
    ],
    "pageTitle": "CDE - Automated Data Exchange Project",
    "title": "",
    "url": "https://cdeapps.cde.state.co.us/principal.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00276-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 882440527,
    "recordOffset": 882395902,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{409=If a principal's name must be changed, fill out the Principal Exception Form for the Fall 2008 School Accountability Reports. The form may include multiple schools and must include the corrected principal data, and the name and signature of the person requesting the change and the date of the request. Fax the Principal Exception Form to Annette Severson at 303 866-6888 by Friday August 8th. Any Principal Exception Form received after that date will not be reflected in the Fall 2008 school accountabilty reports.}",
    "lastModified": "Thu, 05 Sep 2013 23:28:49 GMT",
    "textBeforeTable": "To locate the schools and their principals for your district, click on your districts' name on the list below. If a principal's name must be changed, fill out the Principal Exception Form for the Fall 2008 School Accountability Reports. The form may include multiple schools and must include the corrected principal data, and the name and signature of the person requesting the change and the date of the request. Fax the Principal Exception Form to Annette Severson at 303 866-6888 by Friday August 8th. Any Principal Exception Form received after that date will not be reflected in the Fall 2008 school accountabilty reports. Principal List for School Accountability Reports Automated Data Exchange Project",
    "textAfterTable": "AGATE 300 AGUILAR REORGANIZED 6 AKRON R-1 ALAMOSA RE-11J ARCHULETA COUNTY 50 JT ARICKAREE R-2 ARRIBA-FLAGLER C-20 ASPEN 1 AULT-HIGHLAND RE-9 BAYFIELD 10 JT-R BENNETT 29J BETHUNE R-5 BIG SANDY 100J BOULDER VALLEY RE 2 BRANSON REORGANIZED 82 BRIGGSDALE RE-10 BRIGHTON 27J BRUSH RE-2(J) BUENA VISTA R-31 BUFFALO RE-4 BURLINGTON RE-6J BYERS 32J CALHAN RJ-1 CAMPO RE-6 CANON CITY RE-1 CENTENNIAL BOCES CENTENNIAL R-1 CENTER 26 JT CHARTER SCHOOL INSTITUTE CHERAW 31 CHERRY CREEK 5 CHEYENNE COUNTY RE-5 CHEYENNE MOUNTAIN 12 CLEAR CREEK RE-1 COLORADO SPRINGS 11 COTOPAXI RE-3",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}