{
    "relation": [
        [
            "",
            "Department of Human Services",
            "Department of Health",
            "Total — Expense",
            "Related capital ($m)",
            "Department of Human Services"
        ],
        [
            "2013-14",
            "0.2",
            "‑",
            "0.2",
            "",
            "‑"
        ],
        [
            "2014-15",
            "7.4",
            "1.4",
            "8.8",
            "",
            "5.4"
        ],
        [
            "2015-16",
            "34.2",
            "‑1,164.4",
            "‑1,130.2",
            "",
            "2.4"
        ],
        [
            "2016-17",
            "28.6",
            "‑1,181.6",
            "‑1,153.0",
            "",
            "‑"
        ],
        [
            "2017-18",
            "26.0",
            "‑1,226.8",
            "‑1,200.8",
            "",
            "‑"
        ]
    ],
    "pageTitle": "Budget Paper No. 2: Budget Measures - Part 2: Expense Measures - Health",
    "title": "Expense ($m)",
    "url": "http://www.budget.gov.au/2014-15/content/bp2/html/bp2_expense-14.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00219-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 349095031,
    "recordOffset": 349074359,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76462=Co‑payments will increase for general patients by $5.00 (from $37.70 to $42.70) and for concessional patients by $0.80 (from $6.10 to $6.90) in 2015., 76627=PBS safety net thresholds will increase each year for four years from 1 January 2015, with general safety net thresholds to increase by 10 per cent each year and concessional safety nets to increase by the cost of two prescriptions each year., 53164=The Government will achieve savings of $89.6 million over four years by reducing the Medicare Benefits Schedule rebate for all optometry services from 85 per cent to 80 per cent commencing from 1 January 2015. This measure will also remove the charging cap that currently applies to optometrists accessing the Medicare Benefits Schedule, enabling them, in the future, to set their own fees in a similar manner to other health providers., 76250=The Government will achieve savings of $1.3 billion over four years from 1 January 2015 by increasing the Pharmaceutical Benefits Scheme (PBS) co‑payments and safety net thresholds., 104964=The Government will provide funding to defend international legal proceedings initiated by tobacco companies against the Tobacco Plain Packaging Act 2011., 86651=The Government will support training for up to 300 extra General Practitioners (GPs) a year by boosting GP training places from 1200 to 1500 places in 2015. This will be achieved by increasing the number of fully funded Commonwealth GP training places under the Australian General Practice Training Programme (AGPT), reducing AGPT funding for training registrars employed by State Governments and introducing new training places co‑funded by GP practices., 103574=The Government will achieve savings of $9.9 million over four years by ceasing funding for the nursing and allied health scholarships support scheme under the Tasmanian Health Assistance Package. The nursing scholarships will cease from 1 July 2014 and the allied health scholarships from 1 July 2015., 101170=The Government will achieve savings of $0.2 million over four years through the listing of three new items and amendments to the prices of three current items on the Stoma Appliance Scheme from 1 July 2014., 21491=The Government will provide $2.0 million in 2014‑15 to the Australian Sports Anti‑Doping Authority (ASADA) to align Australia's anti‑doping arrangements with the revised World Anti‑Doping Code that takes effect on 1 January 2015 under the UNESCO International Convention Against Doping in Sport. Funding will be used to enhance current detection and testing capabilities as well as intelligence gathering processes., 85292=Further information can be found in the press release of 18 March 2014 issued by the Minister for Health., 20198=The Government will achieve savings of $1.8 billion over four years from 2014‑15 by ceasing the funding guarantees under the National Health Reform Agreement 2011, and revising Commonwealth Public Hospital funding arrangements from 1 July 2017. From 2017‑18, the Commonwealth will index its contribution to hospitals funding by a combination of the Consumer Price Index and population growth., 48022=The Government will achieve savings of $3.5 billion over five years by reducing Medicare Benefits Schedule (MBS) rebates from 1 July 2015 by $5 for standard general practitioner consultations and out‑of‑hospital pathology and diagnostic imaging services and allowing the providers of these services to collect a patient contribution of $7 per service., 71973=The Government will achieve savings of $1.7 billion over five years by pausing the indexation of some Medicare Benefits Schedule (MBS) fees for two years from 1 July 2014 and the income thresholds for the Medicare Levy Surcharge and Private Health Insurance Rebate for three years from 1 July 2015. General practice MBS fees will be excluded. MBS fees which are not currently indexed, such as pathology and diagnostic imaging services, will not be affected., 29672=The Government will refocus primary care funding by replacing Medicare Locals with Primary Health Networks from 1 July 2015. The Primary Health Networks will establish Clinical Councils, with a significant GP presence, and local Consumer Advisory Committees that are aligned to Local Hospital Networks, to ensure primary health care and acute care sectors work together to improve patient care., 18571=The Government will achieve savings of $15.2 million over three years by not proceeding with the Charles Sturt University — dental and oral health clinic developments in New South Wales measure which was announced in the 2013 Economic Statement., 43891=The Government will provide $276.2 million over three years from 1 July 2015 in net earnings from the Medical Research Future Fund (MRFF) to fund critical medical research in the medium to long term. The MRFF will provide a sustained funding stream for medical research, with payments from the MRFF expected to reach around $1.0 billion per year from 2022‑23., 58318=The Government will provide an additional $13.6 million in 2014‑15 to the Mersey Community Hospital to extend the existing Heads of Agreement for one year until 1 July 2015, and for the costs of upgrading essential fire safety systems., 40552=This funding will continue activities currently funded under the National Partnership Agreement on Indigenous Early Childhood Development which ceases on 30 June 2014., 55668=From 1 January 2015, capital sensitivity provisions will be extended to all angiography services and the period for which the full MBS fee applies for computed tomography and Magnetic Resonance Imaging services will be extended., 93472=The Government will achieve savings of $266.7 million over five years by simplifying Medicare safety net arrangements. From 1 January 2016, the existing Original Medicare Safety Net, Extended Medicare Safety Net and Greatest Permissible Gap will be replaced by the new Medicare Safety Net. There will be new safety net thresholds of $400 for concessional singles and concessional families, $700 for non‑concessional FTB‑A families and non‑concessional singles, and $1,000 for non‑concessional families who do not receive FTB‑A., 83044=Further information can be found in the press releases of 27 February 2014, 18 March 2014 and 24 April 2014 issued by the Minister for Health.}",
    "lastModified": "Mon, 01 Jun 2015 02:04:52 GMT",
    "textBeforeTable": "2018 Gold Coast Commonwealth Games — operational support Health Part 2: Expense Measures (continued) Next Page > Table of contents < Previous Page Health Part 2: Expense Measures Budget Paper No. 2 2014‑15 budget.gov.au Health Foreign Affairs and Trade Finance Environment Education Defence Attorney-General’s Part 3: Capital Measures Veterans' Affairs Treasury Social Services Prime Minister and Cabinet Parliament Infrastructure and Regional Development Industry Immigration and Border Protection Human Services Health Foreign Affairs and Trade Finance Environment Employment Education Defence Cross portfolio Communications Attorney-General's Agriculture Part 2: Expense Measures Treasury Infrastructure and Regional Development Immigration and Border Protection Attorney-General's Agriculture Part 1: Revenue Measures Preliminaries and Foreword Section navigation Budget Paper No. 2: Budget Measures",
    "textAfterTable": "  2013-14 2014-15 2015-16 2016-17 2017-18 Department of Health ‑ nfp ‑ ‑ ‑ Related capital ($m) Department of Health ‑ nfp ‑ ‑ ‑ The Government will provide funding in 2014‑15 to continue the harmonisation and alignment of schemes for the regulation of therapeutic products between Australia and New Zealand. The expenditure for this measure is not for publication due to ongoing negotiations with the New Zealand Government. Australian Government Commonwealth Games Funding Commitment Expense ($m)   2013-14 2014-15 2015-16 2016-17 2017-18 Department of Health ‑ ‑ ‑ ‑ ‑ Department of the Treasury 156.0 ‑ ‑ ‑ ‑ Total — Expense 156.0 ‑ ‑ ‑ ‑ The Government will provide $156.0 million to the Queensland Government in 2013‑14 as the Australian Government's contribution to permanent infrastructure for the 2018 Gold Coast Commonwealth Games. See also related expense measure 2018 Gold Coast Commonwealth Games — Operational Support in the Health Portfolio. Australian Sports Commission — redirection Expense ($m)   2013-14 2014-15 2015-16 2016-17 2017-18 Department of Health ‑ 3.6 0.9 0.9 0.9",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}