{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Russ Plush Teddy Bear Medium Brown Called Dixon Soft Medium | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/RUSS-Plush-Teddy-Bear-Medium-Brown-Called-Dixon-Soft-Medium/251228564089?hash=item3a7e63aa79",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428836815,
    "recordOffset": 428786541,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at Property in the product passes to you upon receipt of the product by you. Refunds or Exchange If the product does not fulfill any of the descriptions that were available on purchase then, provided the claim is made within a 14 days after delivery, you may be entitled, to a refund, or replacement of the product. We at Cosy Burrow must be informed within this time and then the product must be returned to us in original packaging. If however, it is deemed by us that the product is as described and is at a full priced saleable level the product is to be returned at the customers expense and only the product amount will be refunded as it will be viewed as a change of mind by the customer. For more information about your rights as a consumer, see the ACCC website at www.accc.gov.au or download a free copy of the",
    "textAfterTable": "Seller's payment instructions Please leave ebay ID as reference for Bank Deposits Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}