{
    "relation": [
        [
            "Patent application number",
            "20090079814",
            "20090079851",
            "20110019097"
        ],
        [
            "Description",
            "Video conference video signal switching - A video conference video signal switching system is disclosed to include a local signal-transmitting side comprised of a video signal transmitter receiver unit and a selection control and power converter unit for allowing the user to switch 8 different input video signals for output, a remote signal-receiving side comprised of a 1˜8 channels video signal selector unit, a 1˜8 channels detection and local power supply unit, a microprocessor, and a video signal output unit, and a category-5 or category-6 network cable connected between the local signal-transmitting side and the remote signal-receiving side. By means of the control of the microprocessor, the user can selectively switch 8 different input video signals received from the local signal-transmitting side for output to an external display monitor via the video signal output unit.",
            "Video signal compensation circuit assembly - A video signal compensation circuit assembly is disclosed to include a video signal compensator electrically connected to a computer through a standard VGA cable to compensate for the video signal outputted from the computer, a video signal amplifier electrically connected in series between the video signal compensator and a display monitor for amplifying the compensated video signal outputted from the video signal compensator for display through the display monitor, and a synchronous signal processor electrically connected in parallel to the output end of the video signal compensator to make correction of the video signal outputted from the computer into the video signal compensator.",
            "Video pattern generating device - A video pattern generating device includes a housing, a set of buttons mounted on the housing, a display mounted on the housing, and a circuit board consisting of a keyboard circuit, a control circuit, a display circuit, a video pattern generating circuit, an video pattern encoder circuit, an output port, a power circuit and an image amplifier circuit and mounted in the housing and controllable by the buttons to generate video pattern signals and to encode video pattern signals for outputting to an external video output device for horizontal, vertical and pattern field inspection and correction."
        ],
        [
            "Published",
            "03-26-2009",
            "03-26-2009",
            "01-27-2011"
        ]
    ],
    "pageTitle": "Hsu, Taipei Hsien - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/hsu-taipei-hsien-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 438032503,
    "recordOffset": 438007958,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "David Hsu, Taipei Hsien TW 06-11-2009 TWO-IN-ONE MEMORY CARD - Two independent terminal areas and a memory unit are contained in a single casing and provided for users to use a memory card separately. A terminal area is disposed separately on two corresponding sides of the memory card, and a control circuit and two memories are installed in the memory card, and the control circuit controls the two memories, and each of the two memories is connected to one of the terminal areas to form an independent data access path, so as to achieve the effect of using a casing of a single memory card to provide an application mode and a capacity of a double memory card. 20090150610 Published Description Patent application number Chun-Wei Hsu, Taipei Hsien TW 01-27-2011 High Efficiency Audio Amplifier and Method thereof - A high efficiency audio amplifier is disclosed. The high efficiency audio amplifier includes an input end for receiving an input audio signal, an output end for outputting an output audio signal, a signal generator coupled to the input end for determining a frequency of an oscillating signal according to the distribution of the input audio signal and a reference voltage, and generating the oscillating signal accordingly, a waveform transformer coupled to the input end and the signal generator for comparing the input audio signal with the oscillating signal to generate a pulse width modulation (PWM) signal, a",
    "textAfterTable": "Patent applications by David Hsu, Taipei Hsien TW Fong-Chi Hsu, Taipei Hsien TW Patent application number Description Published 20080230362 MEMBRANE SWITCH - A membrane switch including a first film, a second film and an insulating layer is provided. The first film has a first circuit, a first outlet cable and a second outlet cable. The first circuit is electrically connected with the first outlet cable, and the second outlet cable is disposed adjacent to the first outlet cable. A single outlet joint is formed from the first and second outlet cables. The second film has a second circuit and an outlet terminal, wherein the outlet terminal is electrically connected to the second circuit. The insulating layer is disposed between the first film and the second film so that the first film and the second film are electrically insulated. The outlet terminal is electrically connected to the second outlet cable. The membrane switch is economical and meets the needs of customers. 09-25-2008 Fu Yi Hsu, Taipei Hsien TW Patent application number Description Published 20080196804 Protective cover for electronic device - A protective cover of an electronic device includes a leather",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}