{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Lots of sports and many, many clubs.",
            "Coffee shop is really yummy but their isn't an actual lunch room.",
            "There are no dorms. It's a community college.",
            "Slightly higher than high school but not too bad I hear.",
            "Get to class early, it shows that you are interested in the course.",
            "Easy to navigate campus. They have very friendly advisors who are very helpful in choosing courses that are best for you. They have a very wide variety of low cost products in their book store."
        ]
    ],
    "pageTitle": "Metropolitan Community College-Kansas City Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Metropolitan-Community-College-Longview/reviews?_escaped_fragment_=/show/15875",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893473403,
    "recordOffset": 893434370,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{137492=© 2015, Cappex.com, LLC, 9516=Not really sure yet because I start August 18, 2009., 8891=looking forward to starting in August., 8321=I start in August and am looking forward to attending Longview community college}",
    "textBeforeTable": "01/15/2010 Reviewer is A current student here. 3 out of 3 people found this review useful. 1 of 30 james from Kansas City, MO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Amy from Belton, MO 12/05/2009 Reviewer is A current student here. 2 out of 3 people found this review useful. 2 of 30 Categories Comments Great for these types of students Great for students who want an education at a lower price, have weird hours because of work or other obligations and those who want an easy commute. Bang for the buck I have an A+ scholarship from high school but even if I didn't their fees aren't high and tuition is cheap at $82 per credit hour. Am enjoying being here For the most part I like going there. I took some classes there while in high school and taking classes here another year. It's convenient to where I live and I know some people from high school. Am learning a lot Each teacher is different and there are many to choose from. Ask around campus from other students to see what they",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}