{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Share any unusual traditions or locations on campus",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The campus is incredibly safe. Honestly, I think the only thing I've heard of getting stolen was like a bike. I always feel safe walking around campus, even at night. It's pretty well monitored and there are usually a few security guards roaming around. You'll see them driving around on their golf carts, and they might even offer you a ride to class.",
            "Greek life is huge around campus. Even if you don't join a sorority or fraternity, you'll still know everyone in them. They're always doing something around campus.",
            "September 19th is International Talk Like A Pirate Day, and some professors take this day very seriously. Also, every year around the beginning of October you'll see a bunch of people running around scared and throwing socks at people. Don't worry, they're not crazy. They're just trying to survive Humans vs. Zombies.",
            "The food in the cafeteria is okay. Some days are better than others. But, the staff in the cafeteria is always incredibly friendly. The food in the Buc is made to order and is always pretty good, but it can get really crowded around lunch time. I've heard the Canale Cafe is pretty good, but it never seems to be open. I haven't been able to try it yet.",
            "Dorm life is pretty good here. Some dorms are better than others. Try to avoid Rozier if you ever want to sleep or get studying done. There's usually always some kind of party going on over there, and it can get hard to focus sometimes.",
            "Obviously, this depends on the classes your taking and which professors you're taking. But generally, the professors I've taken like to give enough work to make sure you understand the material, but not enough to drown you. But there are some exceptions.",
            "Don't stress too much. Most of the professors here are super understanding and genuinely want to help you pass. But, that doesn't mean slack off and party every night. Find your balance; have fun while you're here, but make sure you do your work.",
            "Christian Brothers University is a great school all around. They have great academics. And because of the small number, you really get the opportunity to develop a relationship with your professors."
        ]
    ],
    "pageTitle": "Christian Brothers University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Christian-Brothers-University/reviews?_escaped_fragment_=/show/97167",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 896423887,
    "recordOffset": 896394062,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{100822=September 19th is International Talk Like A Pirate Day, and some professors take this day very seriously. Also, every year around the beginning of October you'll see a bunch of people running around scared and throwing socks at people. Don't worry, they're not crazy. They're just trying to survive Humans vs. Zombies., 73247=It was this really fun thing they started this year, the September of Services. It's basically the whole month of September and you volunteer all over the city of Memphis, and it's amazing. I swear you'll love it!, 109402=© 2015, Cappex.com, LLC, 47076=You cannot stay anonymous on this campus; all your professors will know you and call you out. If you don't want small classes with teachers that work one-on-one then you need a bigger school. However, if you like being able to get to know everyone on campus and want the extra attention from your professor than CBU would be a great place for you. The food isn't perfect and right now we don't have a fitness center but in the spring of 2013 the Kroc Center (an all-purpose sport facility with a pool, water-slide, and indoor and outdoor sports fields among other things) will be opening across the street. Students will have memberships to while they attend CBU.}",
    "textBeforeTable": "10/12/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 26 Erika from LA Vergne, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Great for these types of students Pretty much everyone in my opinion, but particularly anyone majoring in any liberal arts field, seeing as though this college is a liberal arts college. Tips for prospective students Make sure you stay on your work, log in ALL contact information from your professors into your phones, emails, and calendars, and set up meetings with your adviser whenever you feel you need a little encouragement with classes or whenever you need to decide what classes are right for you. I would also suggest having meetings with your professors if you are struggling a little in class and you need a little help. Bang for the buck Yes, the tuition may be a little high, but for the small class sizes, great staff and faculty, and a beautiful campus to learn and study, I'll pay that much for school. CBU has a very comfortable environment and fits my learning styles and preferences perfectly. Am enjoying being here Here at CBU, there is enough going on for the residents and commuters to interact and hang out. There is usually a community Mass on campus where everyone of different faiths can come and get a little prayer if they need it. The Greek life",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}