{
    "relation": [
        [
            "Sample size",
            "2",
            "4",
            "6",
            "10",
            "12",
            "20",
            "50",
            "100",
            "200",
            "500",
            "1000"
        ],
        [
            "Interval",
            "[0, 2]",
            "[0, 4]",
            "[1, 5]",
            "[2, 8]",
            "[3, 9]",
            "[6, 14]",
            "[18, 32]",
            "[40, 60]",
            "[86, 114]",
            "[228, 272]",
            "[469, 531]"
        ],
        [
            "Maximum relative width",
            "2/2 (1)",
            "4/4 (1)",
            "4/6 (0.667)",
            "6/10 (0.6)",
            "6/12 (0.5)",
            "8/20 (0.4)",
            "14/50 (0.28)",
            "20/100 (0.2)",
            "28/200 (0.14)",
            "44/500 (0.088)",
            "62/1000 (0.062)"
        ]
    ],
    "pageTitle": "Analysis of Textual Variation",
    "title": "Table 3.6. Maximum relative width of 95% confidence interval vs sample size (p = 1/2)",
    "url": "http://www.tfinney.net/ATV/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00060-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 745028623,
    "recordOffset": 744926118,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{43519=Copyright © 2011, 1573=Whereas biblical textual criticism speaks of witnesses, variation units, and readings, multivariate analysis (MVA) employs a different vocabulary. According to [Venables and Ripley] (2002 301),, 21067=Originally, I intended to include chapters on simulation of the copying process and on applying information theory to the problem of understanding the textual tradition. However, I have now decided to treat those topics separately at a future time, if it pleases God. This book is therefore restricted to exploring the application of multivariate analysis techniques alone. Being based on a sample of one part of the biblical textual tradition, all of the results have a provisional nature. Furthermore, the strategy employed to interpret results in chapter five reflects my thinking at the time it was written, which was 2009. Since that time I've been given the opportunity to explore comprehensive data for the General Letters thanks to the Institute for New Testament Textual Research (INTF) in Münster, Germany. New insights gained through this exploration have further influenced my interpretation of the results.[1]}",
    "TableContextTimeStampAfterTable": "{276316=This rather astonishing result was long ago anticipated by Streeter with his theory of local texts. Citing graduated levels of agreement between witnesses, he gave an interpretation of the evidence which associates groupings with localities ([Streeter] 1930 106):, 249338=The other maps presented above relate to witnesses that have the required minimum number of variation units yet do not appear in the principal map. The map for P13 places it in an isolated location between P46 on one hand and witnesses such as L (Angelicus), U44, and U150 on the other. The second corrector of Claromontanus, D-2, did a thorough job of conforming the text to a Byzantine model similar to K (Mosquensis). U243 lies near witnesses such as M1739 and M1881 while M1175 is near M424. Surprisingly, the Old Latin it-v is nearer to Greek texts such as A (Alexandrinus) and M1881 than to Old Latins it-ar, it-b, it-comp, and it-z. The Palestinian Syriac syr-pal lies near U150 and syr-h. The Fayyumic cop-fay is in the vicinity of the Sahidic (cop-sa) and Bohairic (cop-bo) Coptic texts. The location of quotations by Cyril suggests he used a text similar to the ones preserved in witnesses such as M436, M1912, M2464, and P (Porphyrianus). Theodoret seems to have used a text like that preserved in M1319. The point corresponding to citations by Ambrose is in a remote location beyond witnesses such as it-b and M1739., 279142=Strict geographical correspondence would require the Ethiopic version, here represented by the Pell Platt (eth-pp) and Takla Haymanot (eth-TH) editions, to be located far from its actual location in textual space. Some hold that the Ethiopic version was influenced by Syrian Monophysites who fled to Egypt after being condemned at the Council of Chalcedon in 451 A.D. [Zuurmond] (1995 148) agrees that there is a Syrian influence, but regards it as having occurred at a much later time. Whenever the date of the influence, the Ethiopic version's textual location does suggest that it conforms to a text associated with Syria., 377040=[Cox and Cox] Cox, Trevor F. and Michael A. A. 2001. Multidimensional Scaling. 2d ed. Florida: Chapman and Hall., 218866=group 4: K, L, U75, M6, M256, M263, M424, M1241, M1319, M1573, M1852, M1881, M1962, M2200, Byz, Lect, syr-p, syr-h, geo-2, Chrysostom, 199786=A confidence region is the multidimensional analogue of the confidence interval for the estimated value of a parameter. In the case of a three-dimensional MDS map, the confidence region associated with a plotted witness location is an ellipsoid. There is more than one way to define such a confidence region ([Cox and Cox] 2001 110-3). As an alternative to the formal analysis required to obtain confidence regions as ellipsoids, this study estimates a margin of error for every plotted point. The result is a spherical confidence region which has a high probability of containing the actual location of the relevant witness. While only an approximation of the confidence region that would be obtained by a formal analysis, it is still a useful indication of the uncertainty associated with a plotted location in an MDS map., 387208=[Venables and Ripley] Venables, William N., and Brian D. Ripley. 2002. Modern Applied Statistics with S. 4th ed. New York: Springer., 216575=group 3: K, L, M1852, Byz, Lect, M1241, M424, M2200, M1962, Chrysostom, M1319, geo-2, slav, M104, M459, M256, M1573, M2127, M263, M365, M1912, U75, eth-pp, eth-TH, P, U150, syr-h, U44, M6, M1881, M1739, syr-p, 378427=[Epp 1999] ———. 1999. “The Multivalence of the Term 'Original Text' in New Testament Textual Criticism.” Harvard Theological Review 92, 245-281., 375574=[Aland and Aland] Aland, Kurt and Barbara. 1989. The Text of the New Testament: An Introduction to the Critical Editions and to the Theory and Practice of Modern Textual Criticism. 2d rev. ed. Trans. Erroll F. Rhodes. Grand Rapids: Eerdmans., 87540=Another requirement is for the sample of variation units to be randomly drawn. This would not seem to be the case for the UBS apparatus, where the selection of variation units is anything but random. As the editors say ([UBS] 1993 2*),, 386248=[Thorpe] Thorpe, J. C. 2002. “ Multivariate Statistical Analysis for Manuscript Classification. ” TC: A Journal of Biblical Textual Criticism 7. http://rosetta.reltech.org/TC/vol07/Thorpe2002.html., 76780=Sampling error is the difference between the actual value of a parameter and the value of the corresponding statistic calculated from a sample of the population. If many samples are taken from a population and a statistic is calculated from each sample then the values of the statistic will form a distribution in which some values occur more frequently than others. The distribution of values of a statistic obtained for all possible samples of a given size is called the sampling distribution of the statistic ([Moore and McCabe] 1993 260). If the sampling distribution is known then inferences can be made about the population parameter that corresponds to the statistic. In particular, it is possible to specify a confidence level then to obtain a corresponding range of values called a confidence interval within which the parameter is expected to lie. The confidence interval itself is often expressed in terms of a central estimate, which is the statistic, and a margin of error that specifies how far the interval extends on either side of the estimate ([Moore and McCabe] 1993 431-3)., 381989=[Lyon] Lyon, Robert W. 1958. “A Re-examination of Codex Ephraemi Rescriptus.” Ph.D. dissertation. University of St Andrews., 375200=[ECM] Aland, Barbara, Kurt Aland†, Gerd Mink, Holger Strutwolf, and Klaus Wachtel, eds. 1997-. Novum Testamentum Graecum: Editio Critica Maior. Stuttgart: Deutsche Bibelgesellschaft., 278363=[Streeter] (1930 102-5) suggested that the fifty Bibles ordered by Emperor Constantine from Eusebius of Caesarea around 331 A.D. were eventually displaced by copies of the standard Byzantine text later preferred in Constantinople. Desiring clean copies, richer churches would give or sell their deluxe yet deprecated volumes to provincial churches and monasteries. In this way, so Streeter speculated, one of the fifty may have come into the hands of Mesrop and Sahak who then used it to revise their translation. If the revised Armenian indeed reflects the text of the fifty Bibles commissioned by Constantinople then the third cluster preserves a text that would have been familiar to Eusebius., 388012=[Zuurmond] Zuurmond, Rochus. 1995. “The Ethiopic Version of the New Testament.” In The Text of the New Testament in Contemporary Research: Essays on the Status Quaestionis. Ed. Bart D. Ehrman and Michael W. Holmes. Studies and Documents 46. Grand Rapids: Eerdmans, 142-56., 381506=[Lake] Lake, Helen and Kirsopp. 1911. Codex Sinaiticvs Petropolitanvs: The New Testament: The Epistle of Barnabas and the Shepherd of Hermas. Photographic facsimile with an introduction by Kirsopp Lake. Oxford: Clarendon Press., 360258=Finally, there is the phenomenon of textual divergence. Each of the clusters identified above has a notional centre, and the locations of these centres differ. Thus, for example, the “Byz/M2127/vg-st” cluster, whose origin presumably goes back to the first Latin translation, lies in a different part of textual space to the “Byz/D-2/B” cluster, whose origin may go back to a European or Egyptian production of the Greek text. Divergence, which is movement of one textual centre away from one or more others, is caused by a set of witnesses developing a distinct set of readings. Instead of favouring readings that another cluster already possesses, and thereby moving towards it, a divergent cluster prefers a combination of readings not held by other clusters, thus moving away from them all., 218720=group 3: U1, A, C, P, U44, U150, M33, M81, M104, M365, M436, M459, M1912, M2127, M2464, cop-sa, arm, slav, 216423=group 2: U1, M33, A, C, M81, M436, M2464, arm, cop-sa, it-ar, vg-ww, vg-st, it-comp, vg-cl, it-b, cop-bo, geo-1, 195038=Lower right: K, U150, M365, M424, M1241, M1319, M1852, M1881, M1962, 382746=[Metzger 1992] ———. 1992. The Text of the New Testament: Its Transmission, Corruption, and Restoration. 3d enlarged ed. New York: Oxford University Press., 379202=[Finney 1999] Finney, Timothy J. 1999. “ The Ancient Witnesses of the Epistle to the Hebrews: A Computer-Assisted Analysis of the Papyrus and Uncial Manuscripts of ΠΡΟΣ ΕΒΡΑΙΟΥΣ. ” PhD dissertation, Murdoch University. http://purl.org/tfinney/PhD/., 384779=[R Project] R Development Core Team. 2005. R: A Language and Environment for Statistical Computing. Vienna: R Foundation for Statistical Computing. http://www.R-project.org/., 85858=The third condition is not exactly satisfied because the result of one trial affects the probabilities of the two outcomes in another trial. To illustrate, consider two witnesses whose readings are defined for a population of one thousand variation units, and whose readings disagree at 500 of those. Before the first trial, the probability of disagreement is 500/1000. If a variation unit where the two witnesses disagree is drawn from the population, the probability of obtaining a disagreement in the next variation unit that is drawn has changed, being 499/999. Nevertheless, provided that the population is much larger than the sample size, this violation of the conditions has negligible consequences., 194803=Upper right: P, M104, M256, M263, M436, M459, M1573, M1912, M2127, 86578=Does the UBS apparatus consist of a sample whose size is much smaller than the population of all known variation units for the books in question? Taking Hebrews as an example, there are 44 variation units in the UBS apparatus. A rough estimate of the population size can be obtained by reference to the Editio Critica Maior [ECM], which presents 3061 variation units in the Catholic Epistles. (I thank Klaus Wachtel of the Institute for New Testament Textual Research for providing this number.) Based on respective word counts of 7591 and 4953 for the Catholic Epistles and Hebrews, this extrapolates to about 2000 variation units for Hebrews. It is therefore safe to assume that the sample size is much smaller than the population size for the variation units in the UBS apparatus of Hebrews, and that the third condition is approximately satisfied., 328272=Stable clusters with a characteristic set of members emerge as the set of witnesses is divided into larger numbers of groups. At the same time, new clusters form. In some cases the ancestry of a cluster which forms at a particular level is clear because it draws more than half of its members from a parent cluster in the preceding level. In other cases, members of a newly formed cluster are drawn from a number of clusters in the preceding level, making its ancestry ambiguous. A viable naming scheme needs to be able to cope with both of these cases. One possibility is to name a cluster by reference to all of the medoids in its line of descent. Thus, the cluster which begins at the first level with medoid Byz then changes to medoid M2127 and ends with medoid M436 would be named “Byz/M2127/M436”. A cluster that forms at a lower level and does not have a clear prior ancestry need only include medoids from its formation onwards. Thus, the cluster comprised of D and it-d which forms at the seventh level would be named “D/it-d”., 383443=[Moore and McCabe] Moore, David S. and George P. McCabe. 1993. Introduction to the Practice of Statistics. 2d ed. New York: W. H. Freeman., 206915=Cluster analysis partitions a set of objects into a number of groups where members of groups are similar to each other but dissimilar to members of other groups. This is not always a straightforward exercise, as indicated by [Chatfield and Collins] (1980 215-6):, 376702=[Chatfield and Collins] Chatfield, Christopher and Alexander J. Collins. 1980. Introduction to Multivariate Analysis. London: Chapman and Hall., 385211=[Ropes] Ropes, James Hardy. 1926. The Text of Acts. London: Macmillan., 84493=The binomial distribution is a well known probability distribution that describes the outcome of a series of trials which obey the following conditions ([Moore and McCabe] 1993 372):, 380070=[Finney 2002] ———. 2002. “ What Agreement Is Not. ” In “What Does the Text Actually Say?” A Festschrift in Honour of Dr Richard K. Moore. http://www.halotype.com/RKM/., 279850=Historical circumstances could also account for the locations of a number of other witnesses whose supposed places of origin do not coincide with their positions in textual space. Two representatives of the Georgian version are included in the maps, with the text preserved in the first (geo-1) thought to predate that of the second (geo-2), which was supposedly revised against Greek manuscripts. Referring to the specific map orientation mentioned above, geo-1 might then be expected to lie to the “east” (i.e. right) of Chrysostom. If not an artifact caused by sampling error, the actual location of this text may be due to the source from which it was translated, possibly the initial Armenian version. If the initial Armenian was in turn translated from the Old Syriac then the position of geo-1 is a clue to where the initial Armenian and Old Syriac were located in textual space. The other representative of the Georgian version (geo-2) included in these maps lies in a place that indicates it was edited to conform to the standard Byzantine text preserved in Greek witnesses such as K and M424. The location of the Old Church Slavonic (slav) indicates that it was translated from a text of the kind preserved in M1912., 190929=The three maps based on the binary data matrix turn out to be quite similar when compared in this way. Taking as a reference the one produced with the simple matching distance, the Jaccard distance map need only have its first axis inverted to show that both maps have similar configurations: witnesses D-2 (i.e. the second corrector of Codex Claromontanus), M1175, and U75 (i.e. majuscule 75) are near the top; B, P46, and P13 are in the lower left quadrant; and the Old Latins and Vulgate are in the lower right quadrant. In a similar fashion, the map based on the Euclidean distance can be made comparable with the simple matching distance map by inverting the first axis then applying a clockwise rotation of about 45 degrees. Whereas the choice of dissimilarity coefficient causes many minor differences, the overall configuration remains the same, apart from rotations and reflections., 181470=Multidimensional scaling (MDS) seeks to produce a map in which distances between plotted points approximate the corresponding dissimilarities. Starting with a data matrix, a distance is calculated for each pair of witnesses. Witness coordinates are extracted by minimizing a stress function which calculates the overall difference between the actual distances and those calculated from the resulting coordinates. A variety of stress functions can be used, each leading to a different, but often similar, final configuration. This study uses a popular method called “classical” or “metric” multidimensional scaling, which minimizes the sum of differences between squared values of actual distances and those implied by the resulting coordinates ([Venables and Ripley] 2002 308)., 383840=[Petzer] Petzer, Jacobus H. 1995. “The Latin Version of the New Testament.” In The Text of the New Testament in Contemporary Research: Essays on the Status Quaestionis. Ed. Bart D. Ehrman and Michael W. Holmes. Studies and Documents 46. Grand Rapids: Eerdmans, 113-30., 248069=Most of the remaining witnesses are concentrated in a cluster which itself seems to have regions of higher density. However, the magnitude of the sampling error associated with the number of variation units from which the map is constructed makes any assertions about the internal structure of this region highly questionable. Some witnesses, such as M1739, geo-1 (Georgian), cop-bo (Bohairic Coptic), syr-p (Peshitta Syriac), and M436, lie between this cluster and other places of higher density. These witnesses may represent transitional forms, influenced by the texts that lie on either side., 385466=[Souter] Souter, Alexander. 1954. The Text and Canon of the New Testament. 2d ed. revised by C. S. C. Williams. London: Gerald Duckworth., 374805=[UBS] Aland, Barbara, Kurt Aland, Johannes Karavidopoulos, Carlo M. Martini, and Bruce M. Metzger, eds. 1993. The Greek New Testament. United Bible Societies, 4th rev. ed. Stuttgart: Deutsche Bibelgesellschaft., 335108=The process of subdivision is quite enlightening as it shows where various classes of witnesses fit into the overall scheme of things. To illustrate, the Ethiopic version turns out to be a distinct entity which separates at the ninth level. Prior to that, it resides in the “Byz/M2127/U243” cluster which includes U243, M365, M1739, and M1881. The supposed Syriac influence may therefore be illusory, the Ethiopic instead being founded on Greek texts which have numerous points of contact with the Peshitta., 370647=The high level and large scale efforts required to produce the fifty Bibles commissioned by Constantine for his new capital may have been what made Church authorities aware of the existing diversity of texts among its various geographical centres and prompted them to strive for a standard text. (The circumstances surrounding Jerome's recension of Old Latin manuscripts to produce the Vulgate tell us that this kind of thinking was current in the fourth century.) This is not to say that the fifty were the first examples of the Byzantine standard text. Instead, they probably would have been copied from exemplars available in or near Caesarea. One might expect these fifty to have left their mark on surviving evidence. While only a very tenuous indication, the presence of the Armenian version points to the “Byz/M2127/M436” cluster being their descendants., 358667=The three-dimensional principal MDS map for binary data displays a number of these kinds of textual development. The second corrector of Codex Claromontanus (D-2) did a thorough job of conforming the text to a Byzantine model. However, the result seems to have overshot the mark. Possibly, the model used by the corrector was in the vicinity of the result, although the difference may also be due to sampling error. Another example is the Armenian version, which through editorial action moved from its presumed place of origin near the first Georgian (geo-1) to the “Byz/M2127/M436” cluster., 353168=Finally, including a tight cluster of witnesses can cause an islanding effect in MDS maps which isolates the cluster and distorts the entire point cloud relative to the configuration it would have if only one member of the cluster were included. To illustrate, the data matrix presented here is a copy of the random data matrix with three copies of pseudo-witness R7. The first, R7a, is an exact copy of R7 while the other two, R7b and R7c, have been changed to have a different reading to the original in the first variation unit alone. A three-dimensional MDS map based on this data matrix is shown here. Comparing it with the corresponding map derived from the original random data matrix shows the islanding effect. The introduced pseudo-witnesses R7a, R7b, and R7c form a tight cluster while R7b and R7c displace the rest of the witnesses from the locations they would have had if these two had not been included. (Being an exact copy of R7, R7a does not displace the others.) This islanding effect acts to exaggerate the appearance of clustering if a few very similar witnesses are present. Clusters in the MDS maps produced from the UBS data are affected by the islanding effect. To give a particular example, the “Western” cluster containing Old Latin and Vulgate witnesses would not be as distinct from the “secondary Alexandrian” cluster containing witnesses such as C, M81, and M2464 if the former did not contain as many very similar witnesses., 333916=At the fifth partition, the “Byz/M2127/U243” cluster forms and what remains of its parent cluster adopts a new medoid to become the “Byz/M2127/M436” cluster. At the sixth partition, a new cluster forms with M2127 as its medoid, drawing members from all but one of the clusters found in the preceding level. Nevertheless, it has much in common with the “Byz/M2127” cluster which split at the fifth level of partitioning so its top-most node has been placed directly beneath this ancestral cluster. The “D/it-d” and “M33” clusters are other orphans with a measure of connection with the ancestral clusters located directly above them. As the four members of the “syr-pal” cluster come from as many different ancestral clusters, this cluster is not placed beneath any others., 234873=Given enough dimensions, it is possible to obtain a set of coordinates for each witness such that every distance between witnesses is perfectly represented. However, our faculty for simultaneously comprehending multiple dimensions is limited. While we have no trouble with a two- or three-dimensional representation, perceiving a space with more than three dimensions is more challenging. Devices such as Andrews curves, Chernoff faces, glyphs, and weathervane plots can be employed to convey more information ([Chatfield and Collins] 1980 49-50). Another possibility is to colour plotted points so that red, green, and blue components correspond to coordinate values in the fourth, fifth, and sixth dimensions. However, none of these methods will be pursued here. Instead, the reader should bear in mind that the maps used in this study convey only a part of the full picture., 102813=Given a binomial probability distribution where the probability of a “success” is p and the sample size is n, the mean and standard deviation of the counts of successes and the proportions of successes are as follows ([Moore and McCabe] 1993 380-1). (In the present context, a success is a disagreement between two witnesses at a variation unit where both are defined.), 220995=If the script is configured to classify witnesses into four groups using the binary data matrix of Hebrews and the UBS text as a reference witness then M2127, M436, D, and M1852 are extracted as medoids. These are used to train the classifier which then outputs its classification of the 24 witnesses in the reduced data matrix. In this case, the trained classifier assigns all witnesses except U150 to the same groups as the initial partition. This is a remarkable achievement given that only four witnesses are used to train the classifier., 213727=group 2: M81, M436, M2464, P, M365, M1912, slav, M104, M459, M263, M2127, M256, M1573, arm, A, C, UBS, U1, M33, M1739, M6, M1881, U75, U44, U150, syr-h, eth-pp, eth-TH, geo-1, geo-2, syr-p, cop-sa, cop-bo, 104204=As the sample size increases, the normal distribution becomes a better approximation of the binomial one provided that the probability of success is not too close to zero or one. One way to decide whether these conditions are met is to calculate np and n(1 - p). If both are greater than 10, then the normal approximation may be used ([Moore and McCabe] 1993 383)., 331834=This series of partitions has some remarkable features. The first level, containing all of the witnesses, is a reminder of the unity of the text. The second level is surprising because it groups “Byzantine” (e.g. K, L) and “proto-Alexandrian” (e.g. P46, B) witnesses in the “Byz/D-2” cluster, while placing “secondary Alexandrian” (e.g. A, C) and “Western” (e.g. Old Latin) witnesses in the “Byz/M2127” cluster. The “Byz/D-2/B” and “Byz/D-2” clusters do not separate until the fourth partition, after the “Byz/M2127” and “Byz/M2127/vg-st” clusters split at the third partition. That is, the “Byz/D-2/B” (“proto-Alexandrian”) and “Byz/D-2” (“Byzantine”) clusters have more in common with each other than they do with either the “Byz/M2127/vg-st” (“Western”) or “Byz/M2127” (“secondary Alexandrian”) clusters!, 385788=[Streeter] Streeter, Burnett Hillman. 1930. The Four Gospels: A Study of Origins Treating of the Manuscript Tradition, Sources, Authorship, and Dates. Rev. ed. (8th impression, 1953). London: Macmillan., 335695=Some clusters do not emerge until late in the process, but when they do they are intriguing. Previously unsuspected associations appear, such as the “syr-pal” cluster, including U44, U150, and syr-p. Could this represent a Syro-Palestinian text? The “M33” cluster is another interesting one, including Alexandrinus and Sinaiticus but nothing else apart from the modern construct which is the UBS text. Finally, the “M2127” cluster deserves a mention. Along with M6, M256, M263, and M1573, it includes the Coptic and Harclean Syriac. This could be an Egyptian constellation, but distinct from other clusters with a possible Egyptian provenance such as “M33”, “Byz/D-2/B”, and “Byz/M2127/M436”., 1595=The elements of a data matrix may be classified according to the scale against which they are measured. Four types of scale are often distinguished [Everitt] (2005 2):, 75798=Before launching into the analysis, certain statistical terms and concepts need to be introduced. A population is the entire number of some class of items and a sample is a selection from the population. A parameter is a characteristic of the population that can only be calculated from the entire population. A statistic, by contrast, is an estimate of the parameter calculated from a sample. That is, a parameter is associated with a population and a statistic is associated with a sample ([Moore and McCabe] 1993 258)., 337443=To generate random data, a number of “pseudo-witnesses” can be manufactured using probabilities obtained from the data matrix of actual witnesses. If the variation units are independent of one another then the probability of a particular reading of a particular variation unit is best estimated by that reading's relative frequency within the variation unit. If they are not independent then it is necessary to consider other variation units and their readings when calculating a probability. It seems reasonable to assume that the variation units given in the UBS apparatus are independent with respect to internal considerations such as grammar or theology. That is, one does not expect the reading in one variation unit to play a determining role in the reading of another. It may be that there is a characteristic set of readings for a witness of a particular type which can be attributed to common ancestry. However, this is an external factor that is not based on any inherent property of the variation units. By contrast, it is not safe to assume independence of binary variation units extracted from multistate ones. Instead, internal correlations between the readings in such a binary set should be expected. Consequently, only the multistate data matrix will be used to obtain probabilities for this investigation, and only multistate pseudo-witnesses will be generated., 194972=Lower left: D, M1739, UBS, 179399=The third principal component accounts for another 10.9% of the total variation. It enables certain witnesses that appear to be close together in the plot of the first two principal components to be differentiated. To illustrate, the “PC2” vs “PC3” panel (second row, third column) plots witness scores on the second and third principal components. It shows that M1739 and D, which appear to be close together in the “PC2” vs “PC1” panel, are actually quite far apart. An analogous situation occurs when two stars that are separated by a great distance appear to be close together because they lie in approximately the same direction from our perspective., 387535=[Zuntz] Zuntz, Günther. 1953. The Text of the Epistles: A Disquisition upon the Corpus Paulinum. Schweich Lectures, 1946. London: Oxford University Press., 218521=group 1: UBS, D, M1739, it-ar, it-b, it-comp, it-d, vg-cl, vg-ww, vg-st, cop-bo, eth-pp, eth-TH, geo-1, 377735=[Epp 1991] Epp, Eldon J. 1991. “New Testament Papyrus Manuscripts and Letter Carrying in Greco-Roman Times.” In The Future of Early Christianity. Ed. B. A. Pearson. Minneapolis: Fortress Press, 35-56., 380753=[Finney 2003] ———. 2003. Manuscript Copying Simulation. Online resource. http://rosetta.reltech.org/TC/downloads/simulation/., 46003=If a dissimilarity coefficient also satisfies the fourth condition, which is known as the metric inequality, then the coefficient is a metric or distance ([Chatfield and Collins] 1980 191-2)., 383111=[Milne and Skeat] Milne, H. J. M. and T. C. Skeat. 1938. Scribes and Correctors of the Codex Sinaiticus. Oxford: Oxford University Press., 172705=The general hope of principal components analysis is that the first few components will account for a substantial proportion of the variation in the original variables ... and can, consequently, be used to provide a convenient lower-dimensional summary of these variables ([Everitt] 2005 41)., 184820=Those familiar with Australian geography will recognise that the result of the analysis, shown below, locates every city in the correct relative place. Due to the fact that the original distances are taken from a flat map, the two-dimensional result accurately reproduces them if measured according to the axis scales. However, the map is rotated with respect to the conventional orientation. As [Venables and Ripley] (2002 307) say, “a configuration can be determined only up to translation, rotation and reflection, since Euclidean distance is invariant under the group of rigid motions and reflections”. For this reason, it is legitimate to perform a combination of translation, rotation, and reflection upon one classical MDS map in order to compare it with another., 266054=While late second century Latin translations of parts of the New Testament existed, the first evidence of an identifiable Latin text-type is found in mid-third century quotations by Cyprian of Carthage. This “African” version, which may in fact have come from Italy, was revised to produce a “European” tradition, evidence of which is found in a number of fourth century writers. ([Petzer] 1995 120-1), 382407=[Metzger 1977] Metzger, Bruce M. 1977. The Early Versions of the New Testament: Their Origin, Transmission, and Limitations. Oxford: Clarendon Press., 359427=Besides migrations that shift a text from one cluster to another, there are those that end in a location between two or more clusters. To give a few examples, M1739, syr-pal, and geo-1 all lie between the “Byz/D-2/B” cluster on one hand, and “Byz/M2127/vg-st” cluster on the other, but are also pulled towards other regions of higher density. These may represent transitional forms: mixtures of readings selected from two or more families of texts known in the physical locations where they were produced. If M1739 is similar to Origen's text then its textual location indicates that Origen used a text which reflected aspects of a number of the textual families current in his time., 381184=[Friberg and Friberg] Friberg, Barbara and Timothy (eds). 1981. Analytical Greek New Testament. Grand Rapids: Baker Book House., 107027=As the maximum interval width occurs when the probability of disagreement is one half, it is possible to use the normal approximation to estimate the minimum sample size required to achieve a desired margin of error ([Moore and McCabe] 1993 582-3):, 247597=P46 and B (Vaticanus) are near each other but far removed from the rest. D (Claromontanus) and it-d (the Latin side of Claromontanus) reside in another locality. Witnesses U1 (Sinaiticus), A (Alexandrinus), C (Ephraemi Rescriptus), M33, M81, M2464, arm (Armenian), and cop-sa (Sahidic Coptic) seem to form yet another cluster. Old Latins it-ar, it-b, and it-comp are in a distinct region that includes editions of the Vulgate (vg-cl, vg-st, and vg-ww) as well., 49753=Agreements in absence are not always meaningful. As [Chatfield and Collins] write (1980 195),, 261243=The following table brings together opinions on dates and provenances of a number of witnesses included in the maps. Apart from the Old Latin version and M1739, dates are as given in the fourth edition of the [UBS] Greek New Testament, with cardinal numerals referring to centuries. For M1739, the date and provenance relate to the exemplar from which it is thought to have been copied. Unless otherwise indicated, the provenance of a versional witness is taken to be the main locality where its language was spoken., 376077=[Alexanian] Alexanian, Joseph M. 1995. “The Armenian Version of the New Testament.” In The Text of the New Testament in Contemporary Research: Essays on the Status Quaestionis. Ed. Bart D. Ehrman and Michael W. Holmes. Studies and Documents 46. Grand Rapids: Eerdmans, 157-72., 384454=[Pierce] Pierce, John R. 1980. An Introduction to Information Theory: Symbols, Signals, and Noise. 2d rev. ed. New York: Dover Publications., 315412=The third cluster is a mixed bag in terms of date and provenance. Due to the small number of Origen's quotations covered by the UBS apparatus of Hebrews, it may be that minuscule 1739 better represents his text. Along with Clement, the possible association with Origen hints at an Egyptian text spreading to Palestine and beyond, still exercising an influence in Caesarea at the time the correctors represented by U1-2 were working on Codex Sinaiticus. Perhaps this cluster shows a branch of the text preserved by the early church because of its connection to Origen? The principal three-dimensional MDS map based on binary data places M1739 between P46 and it-ar, near geo-1. If P46, it-ar, and geo-1 reflect the locations of late second century Egyptian, “Western”, and Old Syriac texts, respectively, then the location of M1739 is a hint that Origen's text combined elements of these three., 213609=group 1: Chrysostom, M1962, M424, M2200, M1319, M1241, K, Lect, L, M1852, Byz, 377347=[Everitt] Everitt, Brian S. 2005. An R and S-PLUS Companion to Multivariate Analysis. London: Springer.}",
    "lastModified": "Wed, 10 Apr 2013 05:01:26 GMT",
    "textBeforeTable": "The relative width of an interval (i.e. width divided by sample size) decreases as the sample size increases, and the maximum relative width occurs when the probability of disagreement is as close as possible to one half. The following table shows how the maximum relative interval width changes with sample size: 11 [84, 95] 90/100 (0.9) 16 [72, 88] 80/100 (0.8) 20 [40, 60] 50/100 (0.5) 16 [12, 28] 20/100 (0.2) 11 [5, 16] 10/100 (0.1) Width (counts) Interval p(disagreement) Table 3.5. 95% confidence interval width vs probability of disagreement (n = 100) 3 [7, 10] 9/10 (0.9) 5 [5, 10] 8/10 (0.8) 6 [2, 8] 5/10 (0.5) 5 [0, 5] 2/10 (0.2) 3 [0, 3] 1/10 (0.1) Width (counts) Interval p(disagreement) Table 3.4. 95% confidence interval width vs probability of disagreement (n = 10) As the estimated probability of disagreement (i.e. number of disagreements divided by number of variation units where both witnesses are defined) increases from zero to one half (0.5), the estimated confidence interval width increases as well. The relationship over the range of all probabilities of disagreement from zero to one is symmetrical so that the width associated with a probability p is equal to the width associated with the probability 1 - p. The width varies quite slowly over",
    "textAfterTable": "3.4.4. Minimum acceptable sample size The relative interval width reaches a maximum as the probability of disagreement approaches one half, and decreases quite slowly as the probability moves away from that value. As a result, using an estimated probability of disagreement as close as possible to one half produces a conservative estimate for the interval width that will be close or equal to the actual value provided that the probability is not too close to zero or one. Every relative interval width estimated in this manner has an associated sample size. To decrease the width it is necessary to increase the sample size. Consequently, a minimum acceptable sample size can be obtained by first specifying a maximum acceptable relative interval width. Any estimate based on a relative width of one is equivalent to asserting that the estimated value lies somewhere in the range of all possible values, making it worthless. The 95% confidence intervals for a sample size of five are [0, 4] for probability 2/5 and [1,5] for 3/5, making five the smallest sample size that can produce an estimate that is not entirely worthless. For this reason, it is a waste of time to calculate a statistic from the number of agreements or disagreements between two witnesses unless it is based on a sample size of five or more. Narrower relative widths produce more useful statistics. One possibility is to set the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}