{
    "relation": [
        [
            "Course ID",
            "AA S 510",
            "AFRS 312",
            "AIS 410",
            "HIST 450",
            "LTNS 660",
            "PLSI 473"
        ],
        [
            "Course Title",
            "Asian Americans in California [CESD]",
            "Kalifia: The Black Heritage of California [CESD]",
            "Perspectives of Native California Indians",
            "History of California [CESD]",
            "Latina/o Politics [CESD]",
            "California Politics and Government (4)"
        ]
    ],
    "pageTitle": "General Education: Segment III - San Francisco State University Bulletin 2012 - 2013",
    "title": "",
    "url": "http://www.sfsu.edu/~bulletin/previous_bulletins/1213/ge2.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00337-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 701915183,
    "recordOffset": 701892102,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=site archived June 03, 2013}",
    "TableContextTimeStampAfterTable": "{866=Search 2012-2013 SF State Bulletin, 5418=Please note: In order to facilitate graduation, beginning Fall 2012 students may complete any 3 courses in Segment III (item 2 in the General Requirements below) while also satisfying the other components of this requirement. In the past, students had to take a minimum of 2 courses in a single cluster.}",
    "textBeforeTable": "Category B: California Social Landscapes San Francisco [CESD] HUM 376 Food, Wine, and Culture in California [CESD] HTM 421 California Culture [CESD] AMST 410/ HUM 450  Course Title Course ID Category A: Artistic and Cultural Landscapes Recommended Pattern: Select one course from each category. At least one course must be CESD. General Requirements: Consult the requirements at the beginning of this Segment III section. Students must complete three courses in Segment III. One course must be designated CESD. California Cultures and Environments   Ecotourism Principles and Practices [CESD] RPT 605 International Entrepreneurship [CESD] MGMT 435 Cross-cultural Creativity in Business [CESD] IBUS 331 The Business of International Tourism [CESD] HTM 425 Information Technology for International Hospitality and Tourism [CESD] HTM 339/ ISYS 339  Course Title Course ID Business, Tourism and Technology in a Global Society Recommended Pattern: Select three courses. General Requirements: Consult the requirements at the beginning of",
    "textAfterTable": "Category C: California Environmental Landscapes Course ID Course Title BIOL 300 Nature Study GEOG 552 Geography of California GEOG 651/ USP 651  SF Bay Area Environmental Issues (4) GEOL 350 Geology of National Parks GEOL 356 Geology of California METR 356 California Weather Events   Challenges to Health Care Policy (This cluster has been renamed. See Health Care Policy and Practice.)   Chemicals: Enticing, Dangerous, and Essential General Requirements: Consult the requirements at the beginning of this Segment III section. Students must complete three courses in Segment III. One course must be designated CESD. Recommended Pattern: Select one course from each category. Category A: Chemicals in Us and Around Us Course ID Course Title CHEM 380/ ENVS 380  Chemistry Behind Environmental Pollution Category B: Contributions from All Cultures",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}