{
    "relation": [
        [
            "",
            "SUMMARY",
            "QUESTIONS AND ANSWERS ABOUT THE SPECIAL MEETING AND THE MERGER",
            "CAUTIONARY STATEMENT CONCERNING FORWARD-LOOKING INFORMATION",
            "PARTIES TO THE MERGER",
            "The Company",
            "Parent",
            "Merger Sub",
            "THE SPECIAL MEETING",
            "Time, Place and Purpose of the Special Meeting",
            "Record Date and Quorum",
            "Attendance",
            "Vote Required",
            "Proxies and Revocation",
            "Adjournments and Postponements",
            "Anticipated Date of Completion of the Merger",
            "Rights of Stockholders Who Seek Appraisal",
            "Solicitation of Proxies; Payment of Solicitation Expenses",
            "Questions and Additional Information",
            "THE MERGER",
            "Merger Consideration",
            "Background of the Merger",
            "Reasons for the Merger; Recommendation of the Board of Directors",
            "Opinions of Financial Advisors",
            "Certain Company Forecasts",
            "Financing of the Merger",
            "Limited Guarantee",
            "Effective Time of Merger",
            "Payment of Merger Consideration and Surrender of Stock Certificates",
            "Interests of Certain Persons in the Merger",
            "Accounting Treatment",
            "Material U.S. Federal Income Tax Consequences of the Merger",
            "Regulatory Approvals",
            "Litigation Relating to the Merger",
            "THE MERGER AGREEMENT",
            "Explanatory Note Regarding the Merger Agreement",
            "Effects of the Merger; Directors and Officers; Certificate of Incorporation; Bylaws",
            "Closing and Effective Time of the Merger; Marketing Period",
            "Treatment of Common Stock, Options and Other Equity Awards",
            "Exchange and Payment Procedures",
            "Financing Covenant; Company Cooperation",
            "Representations and Warranties",
            "Conduct of Our Business Pending the Merger",
            "Solicitation of Acquisition Proposals",
            "Stockholders Meeting",
            "Filings; Other Actions; Notification",
            "Employee Benefit Matters",
            "Conditions to the Merger",
            "Termination",
            "Termination Fees",
            "Expenses"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "",
            "1",
            "13",
            "20",
            "21",
            "21",
            "21",
            "22",
            "23",
            "23",
            "23",
            "23",
            "23",
            "25",
            "26",
            "26",
            "26",
            "26",
            "27",
            "28",
            "28",
            "28",
            "35",
            "40",
            "60",
            "62",
            "65",
            "65",
            "66",
            "66",
            "71",
            "71",
            "73",
            "74",
            "75",
            "75",
            "75",
            "76",
            "77",
            "78",
            "79",
            "80",
            "83",
            "84",
            "86",
            "87",
            "88",
            "89",
            "90",
            "92",
            "93"
        ]
    ],
    "pageTitle": "Preliminary Proxy Statement",
    "title": "",
    "url": "http://www.sec.gov/Archives/edgar/data/1058083/000119312509242621/0001193125-09-242621.txt",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00148-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 694468955,
    "recordOffset": 694318632,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{329278=The merger agreement provides that, until 12:01 a.m., New York time, on December 21, 2009, the Company may initiate, solicit and encourage any alternative acquisition proposals from third parties, provide non-public information and participate in discussions and negotiate with third parties with respect to acquisition proposals. At the direction of the transaction committee, Foros has conducted this \u0093go-shop\u0094 process on behalf of the Company. As of the date of this proxy statement, representatives of Foros have solicited interest from 20 potential acquirors, none of whom have expressed an interest in a potential transaction with the Company., 978885=The closing price of the common stock on the NYSE on October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives, was $14.67 per share of common stock and on November 4, 2009, the last trading day prior to the public announcement of the execution of the merger agreement, was $16.81 per share of common stock. On             ,             , the most recent practicable date before this proxy statement was mailed to our stockholders, the closing price for the common stock on the NYSE was $             per share of common stock. You are encouraged to obtain current market quotations for common stock in connection with voting your shares of common stock., 595904=the ratio of common equity market prices per share to estimated 2010 earnings per share, which we refer to as Price Per Share to 2010E EPS; and, 977796=Quarter ending December 31 (through November 24, 2009), 352946=the Company\u0092s ability, under certain circumstances, to terminate the merger agreement in order to enter into an agreement providing for a superior proposal, provided that the Company complies with its obligations relating to the entering into of any such agreement and immediately prior to or concurrently with the termination of the merger agreement pays a termination fee of $80 million, if the termination fee becomes payable in connection with an agreement entered into prior to 12:01 a.m., New York time, on December 21, 2009, or $115 million in all other circumstances, and up to $5 million in documented expenses, to Parent, each of which the transaction committee concluded was reasonable in the context of termination fees and expenses payable in comparable transactions and in light of the overall terms of the merger agreement including the per share merger consideration;, 389767=reviewed the draft of the merger agreement dated as of November 4, 2009, the draft limited guarantee of the guarantors dated as of November 3, 2009 and a draft of each of the equity commitment letter and debt commitment letter, each dated November 3, 2009; and, 902975=establish 2010 bonus targets, maximums and performance goals under the Executive Annual Incentive Plan (excluding the Performance Restricted Stock Incentive Plan thereunder), subject to prior consultation with Parent;, 874983=From and after 12:01 a.m., New York time, on December 21, 2009, we are required to immediately cease any discussions or negotiations with any persons that may be ongoing with respect to any acquisition proposals, and must notify Parent of any proposals or offers with respect to an acquisition proposal, any requests for non-public information, or requests to initiate or continue discussions or negotiations and any status updates with respect to the same promptly, and, in any event, within 48 hours. At any time from and after 12:01 a.m., New York time, on December 21, 2009 and until the effective time of the merger or, if earlier, the termination of the merger agreement, we, our subsidiaries and our representatives may not:, 340754=the presentation at the November 5, 2009 meeting of the transaction committee at which all members of the board of directors were present, and financial analyses reviewed therewith, of Deutsche Bank, and the opinion, dated November 6, 2009, of Deutsche Bank delivered to the board of directors (upon which the transaction committee was permitted to rely) as to the fairness, from a financial point of view as of November 5, 2009 and subject to various assumptions and limitations described therein, to stockholders (other than Parent, Merger Sub or their affiliates) of the per share merger consideration to be received by such stockholders in the merger, as more fully described below under the caption \u0093The Merger\u0097Opinion of Financial Advisors\u0097Opinion of Deutsche Bank Securities Inc.\u0094 beginning on page [\u0097];, 973952=2009, 93211=In connection with the merger, Lazard Frères & Co. LLC, or Lazard, financial advisor to the transaction committee, delivered to the transaction committee an oral opinion, subsequently confirmed in writing, to the effect that, as of November 5, 2009, and based upon and subject to the various assumptions and limitations described in Lazard\u0092s opinion, the per share merger consideration to be paid to holders of the Company\u0092s common stock (other than Parent, Merger Sub and any other direct or indirect wholly owned subsidiary of Parent) in the merger was fair, from a financial point of view, to such holders. The full text of the written opinion, dated November 5, 2009, of Lazard, which describes, among other things, the assumptions made, procedures followed, factors considered and qualifications and limitations on the review undertaken, is attached as Annex C to this proxy statement and is incorporated by reference herein in its entirety., 567201=Based on the foregoing, Lazard applied a premium reference range of 35% to 45% to the closing price of the common stock as of October 16, 2009, the last trading day prior to the date of a Wall Street Journal article speculating on a potential sale of the Company. Based on the foregoing, Lazard calculated a range of implied per share prices for the common stock from $19.80 to $21.27. The per share merger consideration fell above this range. Lazard also applied a premium reference range of 35% to 45% to the implied price per share range for the common stock based on Lazard\u0092s comparable public company analysis. Based on the foregoing, Lazard calculated a range of implied per share prices for the common stock from $17.52 to $29.84., 248580=The Company is a Delaware corporation with its headquarters in Norwalk, Connecticut. Operating in more than 100 countries, the Company is the world\u0092s leading provider of market intelligence to the pharmaceutical and healthcare industries. With $2.3 billion in 2008 revenue and more than 50 years of industry experience, the Company offers leading-edge market intelligence products and services that are integral to clients\u0092 day-to-day operations, including product and portfolio management capabilities; commercial effectiveness innovations; managed care and consumer health offerings; and consulting and services solutions that improve productivity and the delivery of quality healthcare worldwide. For more information about the Company, please visit our website at http://www.imshealth.com. Our website address is provided as an inactive textual reference only. The information contained on our website is not incorporated into, and does not form a part of, this proxy statement or any other report or document on file with or furnished to the SEC. See also \u0093Where You Can Find More Information\u0094 beginning on page [\u0097]. Our common stock is publicly traded on the NYSE under the symbol \u0093RX\u0094., 297977=On October 19, 2009, the board of directors held a meeting to discuss the indications of interest received from the TPG/CPPIB Group and Bidder A. Members of senior management and representatives of Deutsche Bank, Foros and Sullivan & Cromwell also participated in this meeting. Earlier that same day, the on-line edition of The Wall Street Journal published a story reporting that the Company was engaged in discussions with several private equity firms regarding a potential transaction. Several parties called to express their interest in acquiring the Company., 169542=If the merger is completed, the common stock will be delisted from the NYSE and deregistered under the Securities Exchange Act of 1934, as amended, or the Exchange Act. As such, we would no longer file periodic reports with the Securities and Exchange Commission, or the SEC, on account of the common stock., 325660=Later that same morning, the transaction committee held a meeting with representatives from Foros, Lazard, Deutsche Bank, Sullivan & Cromwell and Morris Nichols, which meeting was also attended by all of the members of the board of directors not on the transaction committee. At this meeting, representatives of Sullivan & Cromwell reviewed with the transaction committee and board of directors the fiduciary obligations of the directors under applicable law and the terms of the draft merger agreement and related transaction documents, including the financing commitment documents. At this meeting, each of Foros and Lazard delivered its oral opinion to the transaction committee, and Deutsche Bank delivered its oral opinion to the board of directors, in each case that, as of November 5, 2009 and based upon and subject to the various assumptions and qualifications described in such opinion, the per share merger consideration to be received by holders (other than Parent, Merger Sub and their affiliates) of the common stock in the merger is fair, from a financial point of view, to such holders., 339174=the presentation to the transaction committee on November 5, 2009, and financial analyses reviewed therewith, of each of Foros and Lazard, and the opinion, dated November 5, 2009, of each of Foros and Lazard as to the fairness, from a financial point of view, as of the date thereof and subject to various assumptions and limitations described therein, to stockholders (other than Parent, Merger Sub or any other direct or indirect wholly owned subsidiary of Parent) of the per share merger consideration to be received by such stockholders in the merger, as more fully described below under the caption \u0093The Merger\u0097Opinion of Financial Advisors\u0097Opinion of Foros Securities LLC\u0094 beginning on page [\u0097] and \u0093The Merger\u0097Opinion of Financial Advisors\u0097Opinion of Lazard Frères & Co. LLC\u0094 beginning on page [\u0097];, 439875=The Company (as of October 16, 2009), 297452=On October 17, 2009, the TPG/CPPIB Group submitted an indication of interest at $21.50 per share and Bidder A submitted an indication of interest at $19.50 per share, in each case with draft debt financing commitment letters. Members of senior management discussed these indications of interest with representatives of Deutsche Bank, Foros and Sullivan & Cromwell over the next two days., 316147=On October 28, 2009, representatives of Ropes & Gray sent a revised draft of the merger agreement to representatives of Sullivan & Cromwell, and the following day representatives of Sullivan & Cromwell sent representatives of Ropes & Gray revised drafts of the merger agreement, the limited guarantee and the equity commitment letter., 1062447=Current Reports filed on Form 8-K filed with the SEC on March 10, 2009, April 23, 2009 (with disclosure under item 5.02), May 5, 2009, May 12, 2009, July 1, 2009, July 23, 2009 (as to Item 2.05 only), on July 28, 2009, October 1, 2009, November 5, 2009 and November 9, 2009; and, 1061475=Quarterly Reports filed on Form 10-Q for the fiscal quarter ended March 31, 2009 (filed with the SEC on May 1, 2009); for the fiscal quarter ended June 30, 2009 (filed with the SEC on July 31, 2009); and for the fiscal quarter ended September 30, 2009 (filed with the SEC on October 30, 2009);, 573735=The full text of Deutsche Bank\u0092s written opinion, dated November 6, 2009, which we refer to as the Deutsche Bank opinion, which sets forth, among other things, the assumptions made, matters considered and limitations, qualifications and conditions of the review undertaken by Deutsche Bank in connection with the opinion, is attached as Annex D to this proxy statement and is incorporated herein by reference in its entirety. The Deutsche Bank opinion is addressed to, and for the use and benefit of, the board of directors (including any members thereof who are also members of the transaction committee in their capacities as members of the transaction committee). The Deutsche Bank opinion is not a recommendation to the holders of the common stock to adopt the merger agreement. The Deutsche Bank opinion is limited to the fairness, from a financial point of view, of the per share merger consideration to the holders of the common stock (excluding Parent, Merger Sub and their affiliates). Deutsche Bank was not asked to, and the Deutsche Bank opinion did not, address the fairness of the merger, or any consideration received in connection therewith, to the holders of any other class of securities, creditors or other constituencies, nor did it address the fairness of the contemplated benefits of the merger. Deutsche Bank expressed no opinion as to the merits of the underlying decision by the Company to engage in the merger or the relative merits of the merger as compared to alternative business strategies, nor did it express any opinion as to how any holders of the common stock should vote with respect to the merger. Deutsche Bank did not express any view or opinion as to the fairness, financial or otherwise, of the amount or nature of any compensation payable to or to be received by any of the Company\u0092s officers, directors, or employees, or any class of such persons, in connection with the merger relative to the merger consideration to be received by the holders of the common stock. The holders of the common stock are urged to read the Deutsche Bank opinion in its entirety. The summary of the Deutsche Bank opinion set forth in this proxy statement is qualified in its entirety by reference to the full text of the Deutsche Bank opinion set forth as Annex D., 312266=That same day, representatives of Deutsche Bank, Foros, Sullivan & Cromwell and Morris Nichols had a discussion with representatives of the TPG/CPPIB Group and its outside legal counsel, Ropes & Gray, regarding the draft merger agreement and financing commitment documents included with the revised proposal. From that day until the merger agreement and related documents were executed on November 5, the parties and their respective representatives negotiated the terms of the definitive documents. Significant issues discussed included price, the right of the Company to affirmatively seek higher offers after entering into the merger agreement, the nature and amount of the financial commitment the guarantors were prepared to make to the Company through the Parent fee and limited guarantee, the requirements for commencement of the debt marketing period and limitations on the availability of specific performance against Parent and Merger Sub., 350146=the Company\u0092s ability, under the merger agreement, during the period beginning on the date of the merger agreement and continuing until 12:01 a.m., New York time, on December 21, 2009 to initiate, solicit and encourage alternative acquisition proposals from third parties and negotiate with third parties with respect to such proposals;, 624979=July 2008, 1055911=Under our bylaws, and as permitted by SEC rules, certain procedures are provided that a stockholder must follow to nominate persons for election as directors or to introduce an item of business at an annual meeting of stockholders. These procedures provide that nominations for director nominees and/or an item of business to be introduced at an annual meeting of stockholders must be submitted in writing to the Corporate Secretary of IMS at 901 Main Avenue, Norwalk, Connecticut 06851. We must receive the notice of your intention to introduce a nomination or proposed item of business at our 2010 annual meeting no earlier than January 31, 2010, and no later than February 20, 2010., 31008=1.      To consider and vote on a proposal to adopt the Agreement and Plan of Merger, dated as of November 5, 2009, as it may be amended from time to time, which we refer to as the merger agreement, by and among the Company, Healthcare Technology Holdings, Inc., a Delaware corporation, which we refer to as Parent, and Healthcare Technology Acquisition, Inc., a Delaware corporation and a wholly owned subsidiary of Parent. A copy of the merger agreement is attached as Annex A to the accompanying proxy statement., 759484=Under the HSR Act, and the rules promulgated thereunder by the FTC, the merger cannot be completed until each of the Company and Parent file a notification and report form with the FTC and the Antitrust Division of the DOJ under the HSR Act and the applicable waiting period has expired or been terminated. The Company and Parent have filed such notification and report forms on November 19, 2009 and each has requested early termination of the waiting period. The FTC has not yet notified the parties whether their request for early termination of the applicable waiting period has been granted. At any time before or after consummation of the merger, notwithstanding the termination or expiration of the waiting period under the HSR Act, the Antitrust Division of the DOJ or the FTC could take such action under the antitrust laws as it deems necessary or desirable in the public interest, including seeking to enjoin the completion of the merger or seeking divestiture of substantial assets of the Company or Parent. At any time before or after the completion of the merger, and notwithstanding the termination or expiration of the waiting period under the HSR Act, any state could take such action under the antitrust laws as it deems necessary or desirable in the public interest. Such action could include seeking to enjoin the completion of the merger or seeking divestiture of substantial assets of the Company or Parent. Private parties may also seek to take legal action under the antitrust laws under certain circumstances., 1124743=Information that are available to Parent and Merger Sub on the first day of any such 35-day period would be required to be updated pursuant to Rule 3-12 of Regulation S-X on any day during such 35-day period if a registration statement using such financial statements were to be filed with the SEC on such date, then a new 35-day period shall commence; it being understood and agreed that on and after February 12, 2010, the Marketing Period shall be deemed not to commence unless the Company has delivered to Parent and Merger Sub audited consolidated financial statements of the Company and its Subsidiaries as at and for the fiscal year ended on December 31, 2009 of the type otherwise required in the Required Bank Information., 620363=Deutsche Bank also determined an estimated Price Per Share to 2010E EPS reference range of 10.0x to 14.0x and applied such range to the Company\u0092s estimated 2010 earnings per share, which we refer to as 2010E EPS, resulting in a range of implied Price Per Share for the Company from $14.63 to $20.49; and, 627875=December 2006, 632277=December 2000, 640829=Deutsche Bank applied the Price to Forward EPS reference range of 10.0x to 14.0x to the Company\u0092s estimated 2012 earnings per share at a two year forward future value date. Deutsche Bank then discounted to the present the range of implied per share values for the common stock from the future value date using Deutsche Bank\u0092s estimated cost of equity capital for the Company of 13%. Based on the foregoing, Deutsche Bank calculated a range of implied current Price Per Share for the Company from $13.93 to $19.50., 287476=From time to time over the last few years, a number of parties, including TPG and a consortium consisting of two other private equity firms, which we refer to collectively as Bidder A, have approached David R. Carlucci, Chairman, Chief Executive and President of the Company, and other members of management about possible transactions involving the Company. Until the September and October discussions described below, none of those approaches proceeded past preliminary conversations or involved the sharing of any nonpublic information., 411361=Foros calculated and compared various financial multiples and ratios based on closing market share prices and other publicly available historical financial data for the selected companies, as of November 3, 2009, and for the Company, as of October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives, and consensus estimates from Factset. With respect to the selected companies and the Company, Foros compared:, 315521=On October 28, 2009, the transaction committee held another meeting with representatives from Foros, Deutsche Bank, Sullivan & Cromwell and Morris Nichols. At this meeting, the transaction committee discussed the desirability of the transaction committee engaging another financial advisor for the purposes of rendering a fairness opinion with respect to a potential transaction, a possibility that had initially been discussed at the October 23, 2009 meeting of the transaction committee., 257905=We have fixed the close of business on                     , 2010 as the record date for the special meeting, and only holders of record of common stock on the record date are entitled to vote at the special meeting. You are entitled to receive notice of, and to vote at, the special meeting if you owned shares of common stock at the close of business on the record date. On the record date, there were             shares of common stock outstanding and entitled to vote. Each share of common stock entitles its holder to one vote on all matters properly coming before the special meeting., 319998=On November 3, 2009, the transaction committee held a special meeting to discuss the proposals received that day. Certain members of senior management and representatives of Foros, Deutsche Bank, Lazard, Sullivan & Cromwell and Morris Nichols also participated in the meeting. The transaction committee discussed among other things the terms of the proposals, the time the bidders other than the TPG/CPPIB Group would require to complete diligence, the likelihood that such bidders would submit a viable proposal with a price higher than the price offered by TPG/CPPIB Group\u0092s proposal following such diligence, the risk that the TPG/CPPIB Group would not agree to a transaction if the Company did not move promptly towards execution of an agreement and the fact that the TPG/CPPIB bid continued to include a \u0093go-shop\u0094 provision. Following that discussion, the transaction committee determined that moving forward with the terms contained in the TPG/CPPIB Group\u0092s offer at a price of $22.00 per share would be in the best interests of the Company\u0092s stockholders. The transaction, 644658=Fifty-Two Week Trading Range. Deutsche Bank reviewed the historical trading price for the common stock during the 12-month period ended October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives. The range of closing share prices for the common stock during this period was $9.87 to $16.25., 1057550=We file annual, quarterly and current reports, proxy statements and other information with the SEC. You may read and copy any document we file at the SEC public reference room located at 100 F Street, N.E., Room 1580, Washington, D.C. 20549. Please call the SEC at 1-800-SEC-0330 for further information on the public reference room. Our SEC filings are also available to the public at the SEC website at www.sec.gov. You also may obtain free copies of the documents we file with the SEC, including this proxy statement, by going to the Investors page of our corporate website at www.imshealth.com. Our website address is provided as an inactive textual reference only. The information provided on our website, other than copies of the documents listed below that have been filed with the SEC, is not part of this proxy statement, and therefore is not incorporated herein by reference., 91865=In connection with the merger, Foros Securities LLC, or Foros, financial advisor to the transaction committee, delivered to the transaction committee an oral opinion, subsequently confirmed in writing, to the effect that, as of November 5, 2009, and based upon and subject to the various assumptions and limitations described in Foros\u0092s opinion, the per share merger consideration to be received by holders of the Company\u0092s common stock (other than Parent, Merger Sub or any other direct or indirect wholly owned subsidiary of Parent) in the merger was fair, from a financial point of view, to such holders. The full text of the written opinion, dated November 5, 2009, of Foros, which describes, among other things, the assumptions made, procedures followed, matters considered and limitations on the review undertaken, is attached as Annex B to this proxy statement and is incorporated by reference herein in its entirety., 649647=The board of directors selected Deutsche Bank as financial advisor in connection with the merger based on Deutsche Bank\u0092s qualifications, expertise, reputation and experience in mergers and acquisitions. The Company has retained Deutsche Bank pursuant to a letter agreement dated November 3, 2009, which we refer to as the engagement letter. As compensation for Deutsche Bank\u0092s services in connection with the merger, the Company has agreed to pay a transaction fee of approximately $24 million contingent on the consummation of the merger and reduced by the amount of any opinion fees paid by the Company to Deutsche Bank. In addition, the Company has agreed to pay an opinion fee of $2 million upon delivery of a fairness opinion (or upon Deutsche Bank advising the board it would be unable to deliver an opinion), and additional opinion fees of $2.5 million upon delivery of any additional opinions (or upon Deutsche Bank advising the board it would be unable to deliver such additional opinion). Regardless of whether the merger is consummated, the Company has agreed to reimburse Deutsche Bank for reasonable fees, expenses and disbursements of Deutsche Bank\u0092s counsel and all of Deutsche Bank\u0092s reasonable travel and other out-of-pocket expenses incurred in connection with the merger or otherwise arising out of the engagement of Deutsche Bank under the engagement letter. The Company has also agreed to indemnify Deutsche Bank and certain related persons to the full extent lawful against certain liabilities, including certain liabilities under the federal securities laws arising out of its engagement or the merger., 305650=Of the parties contacted by representatives of Foros and Deutsche Bank, 14 parties were sent a form of confidentiality agreement prepared by representatives of Sullivan & Cromwell. Eight of the interested private equity firms (and no potential strategic acquirors) executed confidentiality agreements. Those confidentiality agreements, among other things, prohibited the firms from forming consortia without the Company\u0092s consent. Following execution of the confidentiality agreements, the interested parties were provided the same level of access to non-public information that had been provided to the TPG/CPPIB Group and Bidder A. Representatives of Foros, at the direction of the independent directors, delivered a bid instruction letter to each of these eight interested parties. Based on feedback that many of the interested parties could provide bids within ten days to two weeks, the bid instruction letter requested final proposals from these parties on November 3, 2009., 289346=In late August 2009, representatives of Bidder A contacted a representative of Deutsche Bank and expressed an interest in the Company. The representative of Deutsche Bank informed Mr. Walsh, Mr. Carlucci and representatives of Foros of this expression of interest., 690087=In connection with the entry into the merger agreement, Parent received a debt commitment letter, dated November 5, 2009, from Goldman Sachs to provide, severally but not jointly, in the aggregate up to $3.275 billion in debt financing to Parent and Merger Sub, consisting of (i) a senior secured term loan facility in an aggregate principal amount of $2 billion, (ii) a senior secured revolving credit facility with a maximum availability of $275 million (no more than $100 million of which may be drawn at closing), and (iii) up to $1 billion of senior unsecured term loans in the event some or all of the senior unsecured notes referred to in the next sentence are unable to be issued at the closing. It is expected that at the closing $1 billion principal amount of senior unsecured notes will be issued pursuant to Rule 144A of the Securities Act of 1933, as amended, or another private placement exemption in lieu of the senior unsecured term loans. Goldman Sachs may invite other institutional lenders to participate in the debt financing described in the debt commitment letter and to undertake a portion of the commitment to provide such financing., 581281=In preparing its opinion, Deutsche Bank did not assume responsibility for the independent verification of, and did not independently verify, any information, whether publicly available or furnished to it, concerning the Company, including, without limitation, any financial information, forecasts or projections, considered in connection with the rendering of its opinion. Accordingly, for purposes of its opinion, with the board of directors\u0092 permission, Deutsche Bank assumed and relied upon the accuracy and completeness of all such information. Deutsche Bank did not conduct a physical inspection of any of the properties or assets, and did not prepare or obtain any independent evaluation or appraisal of any of the assets or liabilities (including any contingent, derivative or off-balance sheet assets and liabilities), of the Company or Parent or any of their respective subsidiaries, nor did Deutsche Bank evaluate the solvency or fair value of the Company under any state or federal law relating to bankruptcy, insolvency or similar matters. With respect to the Company forecasts, Deutsche Bank assumed, with the board of directors\u0092 permission, that they had been reasonably prepared on bases reflecting the best currently available estimates and judgments of the management of the Company as to the matters covered thereby. In rendering its opinion, Deutsche Bank expressed no view as to the reasonableness of such Company forecasts or the assumptions on which they are based. The Deutsche Bank opinion was necessarily based upon the economic, market and other conditions as in effect on, and the information made available to Deutsche Bank, as of November 5, 2009. Deutsche Bank expressly disclaimed any undertaking or obligation to advise any person of any change in any fact or matter affecting the Deutsche Bank opinion of which it becomes aware after the date of the opinion., 629361=March 2006, 704078=Pursuant to a limited guarantee delivered by the guarantors in favor of the Company, dated November 5, 2009, the guarantors have agreed, among other things, to guarantee, severally but not jointly, the direct expenses incurred by Parent or Merger Sub in connection with the arrangement of the financing of the merger, which direct expenses and reimbursement obligations, along with certain other reimbursement and payment obligations of Parent and Merger Sub, shall not in the aggregate exceed $6 million. See \u0093The Merger Agreement\u0097Limited Guarantee\u0094 beginning on page [\u0097]., 725489=Based on the executives\u0092 compensation levels as of December 31, 2009, and assuming that the merger is completed on February 26 , 2010, and the executive experiences a qualifying termination immediately thereafter, the amount of the cash severance payment (including the pro rata target annual bonus payment in (3) above) that would be payable to Mr. Carlucci and Mr. Pajot is approximately $6,705,592 and $4,319,083 (of which, upon a voluntary termination for any reason, Mr. Pajot is currently entitled to $2,879,389) and the estimated value of the health and disability insurance benefits they would receive is $544,413 and $252,562. Assuming these payments are made, Mr. Carlucci and Mr. Pajot will be eligible to receive a full 280G gross-up of approximately $             and $            . Receipt of the cash severance payment and other benefits upon such a qualifying termination is subject to the executive\u0092s execution of a general release of claims in favor of the Company., 295693=On September 29, 2009, representatives of Deutsche Bank and Foros, at the direction of the board of directors, informed the TPG/CPPIB Group and Bidder A that they would receive non-public information concerning the Company that would allow them to submit refined valuations and provide documentation showing their ability to secure the necessary debt financing., 441984=year period ended October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives, and consensus estimates from Factset. For each of the Company, the selected pharmaceutical services companies and the selected U.S. pharmaceutical companies, Foros compared:, 324344=In the early morning of November 5, 2009, representatives of the TPG/CPPIB Group had discussions with representatives of Deutsche Bank, Sullivan & Cromwell, and Morris Nichols regarding the remaining open issues, including the size of the Parent fee and the amount of an additional equity commitment from the guarantors. Several hours later, representatives of the TPG/CPPIB Group informed representatives of Deutsche Bank that the TPG/CPPIB Group was willing to increase the amount of the Parent fee to $275 million (approximately 6.9 percent of the aggregate consideration to be paid to holders of common stock based on the $22.00 per share offer price), and to increase its equity commitment by $50 million. Representatives of Deutsche Bank, Sullivan & Cromwell and Morris Nichols then briefed representatives of Foros regarding the discussions held with the TPG/CPPIB Group earlier that morning. Representatives of Foros then contacted representatives of the TPG/CPPIB Group to again request an increase in the Parent fee to $300 million. Representatives of the TPG/CPPIB Group reiterated that the TPG/CPPIB Group was only willing to accept a Parent fee of $275 million., 316631=On October 30, 2009, the transaction committee held a meeting to discuss the strategic review process. Representatives from Foros, Deutsche Bank, Sullivan & Cromwell, Morris Nichols and Lazard participated in this meeting. At this meeting, the transaction committee determined to engage Lazard as a financial advisor to the transaction committee for purposes of rendering a fairness opinion to the extent requested by the transaction committee. The transaction committee was informed that Bidder E had dropped out of the process., 403653=a premium of 122.9%, based on a price of $9.87 per share of the common stock, the low closing market price for the 52-week period ended October 16, 2009., 765797=In connection with the merger, five putative stockholder class action lawsuits have been filed in the Delaware Court of Chancery and in the Superior Court of Connecticut, Judicial District of Stamford. On November 6, 2009, a putative stockholder class action, styled Trust for the Benefit of Sylvia B. Piven v. IMS Health Incorporated, et al, CV09-5013110-S, was filed in the Superior Court of Connecticut against the Company, the members of its board of directors, TPG and CPPIB, asserting the directors breached their fiduciary duties, and asserting that TPG and CPPIB aided and abetted those alleged breaches of duty. On November 9, 2009, a putative stockholder class action lawsuit was filed in the Delaware Court of Chancery against the Company, the members of the board of directors, Parent, Merger Sub, TPG and CPPIB. The lawsuit, styled as United Union of Roofers, Waterproofers and Allied Workers Local Union No. 8 Pension Fund v. IMS Health Incorporated, et al, C.A. No. 5057-CC, alleges breaches of fiduciary duty by the Company\u0092s directors in connection with the merger. Parent, Merger Sub, TPG and CPPIB are also named as defendants and are charged with aiding and abetting the Company\u0092s directors\u0092 alleged breaches of fiduciary duty. On November 10, 2009, a putative stockholder class action, styled John Felhaber v. David R. Carlucci, et al, CV09-5013139-S, was filed in the Superior Court of Connecticut, against the Company, its directors, TPG, Parent and Merger Sub, also asserting claims for breaches of fiduciary duties and aiding and abetting. On November 19, 2009, a putative stockholder class action was filed in the Delaware Court of Chancery against the members of the board of directors. The lawsuit, styled City of Ann Arbor Employees\u0092 Retirement System v. Carlucci, et al, C.A. No. 5093-CC, alleges breaches of fiduciary duty by the Company\u0092s directors in connection with the merger. On November 24, 2009, a putative stockholder class action was filed in the Delaware Court of Chancery against the members of the board of directors. The lawsuit, styled International Union of Operating Engineers Pension Fund of Eastern Pennsylvania and Delaware v. Carlucci, et al, C.A. No. 5097-CC, alleges breaches of fiduciary duty by the Company\u0092s directors in connection with the merger. Among other remedies, the complaints in the five actions seek to enjoin the merger., 686411=Parent has entered into an equity commitment letter with the guarantors, dated November 5, 2009 pursuant to which the guarantors have committed, severally but not jointly, to make or secure capital contributions to Parent for an aggregate of $2.793 billion. The guarantors may assign a portion of equity to other investors, although such assignment will not affect the guarantors\u0092 commitments to make or secure capital contributions pursuant to the equity commitment letter. Each guarantor may allocate all or a portion of its investment in Parent to other persons or entities, and its commitment under the equity commitment letter will be reduced by any amounts actually contributed to Parent by such persons or entities on or before the effective time. The funding of financing contemplated by the equity commitment is generally subject to the satisfaction of the conditions to Parent\u0092s and Merger Sub\u0092s obligations to consummate the transactions contemplated by the merger agreement and the substantially contemporaneous funding of the debt financing pursuant to its terms and conditions or any alternative financing that Parent and Merger Sub are required to accept pursuant to the merger agreement. The Company is a third party beneficiary of the equity commitment letter to the extent that the Company seeks specific performance of Parent\u0092s obligation to cause the guarantors to fund their equity commitments in certain limited circumstances in accordance with the terms of the merger agreement., 317681=On November 3, 2009, which was the deadline for the receipt of indications of interest provided for by the bid instruction letter previously disseminated to all the potentially interested parties, the TPG/CPPIB Group submitted a further revised proposal. The revised proposal increased the TPG/CPPIB Group\u0092s offer price to $21.80 per share and provided for a termination fee of $250 million that would be paid by Parent and Merger Sub (and guaranteed by the guarantors) under certain circumstances, or the Parent fee. See \u0093The Merger Agreement\u0097Termination Fees\u0094 beginning on page [\u0097] for more information about the circumstances under which Parent and Merger Sub are obligated to pay the Parent fee to the Company. The TPG/CPPIB Group also submitted revised drafts of the merger agreement, the limited guarantee, the equity commitment letter and financing commitment documents with its revised proposal. The revised offer from the TPG/CPPIB Group was not subject to any additional diligence review., 524841=Illustrative Leveraged Buyout Analysis. Foros performed an illustrative leveraged buyout analysis for the Company using the Company forecasts. In performing the illustrative leveraged buyout analysis, Foros assumed a range of hypothetical financial buyer purchase prices per share of the common stock of $20.00 to $23.00 and assumed leverage equal to 5.0x estimated EBITDA for calendar year 2009. This analysis was based on an assumed exit at the end of 2014 and a range of illustrative one year forward exit EBITDA multiples of 7.0x to 9.0x, which reflect illustrative implied prices at which a hypothetical financial buyer might exit its investment through a sale transaction. This analysis resulted in illustrative internal rates of equity returns to a hypothetical financial buyer ranging from 6.3% to 18.5%. Using the Company forecasts, Foros also performed a sensitivity analysis on the illustrative leveraged buyout analysis to analyze the effect of hypothetical Company annual operating expense reductions ranging from $50 million to $100 million. This sensitivity analysis resulted in illustrative internal rates of equity returns to a hypothetical financial buyer ranging from 8.7% to 22.9%., 469510=the median of the selected U.S. pharmaceutical companies\u0092 P/E ratios, as adjusted to exclude one-time expenses, for calendar year 2010 (as calculated in the selected companies analysis, described above)., 580120=reviewed the terms of the merger agreement and certain related documents, including the equity commitment letter dated November 5, 2009, the limited guarantee dated November 5, 2009 and the debt commitment letter dated November 5, 2009; and, 428871=P/E ratio to estimated earnings annual long-term growth rate (P/E/G) ratios, as adjusted to exclude one-time expenses, for calendar years 2009 and 2010., 717538=Based on the Company\u0092s equity compensation holdings as of December 31, 2009, and assuming that the merger is completed on February 26, 2010, upon completion of the merger, (1) the number of unvested stock appreciation rights of the Company (at exercise prices ranging from $13.43 to $22.58) held by each of Messrs. Carlucci, Pajot and Knightly, Ms. Katz, the seven other executive officers (as a group) and the eight non-employee directors (as a group) that would vest are 349,636, 201,228, 99,419, 94,979, 504,654 and zero, respectively (with such unvested stock appreciation rights having a total \u0093in the money\u0094 value of approximately $2,001,232, $1,177,192, $588,596, $588,596, $3,019,477, and $0, respectively, based upon a $22.00 stock price); (2) the target number of unvested performance restricted stock units granted in connection with the 2009 Company Performance Restricted Stock Incentive Plan, which we refer to as PERS, granted under the LTIP for the 2008-2009 performance period and granted under the LTIP for the 2009-2010 performance period held by each of Messrs. Carlucci, Pajot and Knightly, Ms. Katz, the seven other executive officers (as a group) and the eight non-employee directors (as a group) that would vest and become free of restrictions and entitle the holder to a cash payment equal to $22.00 per share are 156,451, 87,732, 28,712, 39,263, 145,534 and zero, respectively (with such unvested performance restricted stock units having a total value of approximately $3,441,929, $1,930,100, $631,662, $863,780, $3,201,746 and $0, respectively, based upon a $22.00 stock price) (in addition, the executive officers will have the right to earn additional cash amounts, up to the maximum payout level authorized under the LTIP, as explained above; the approximate value of the payout for the PERS and restricted stock units for the 2008-2009 performance period are calculated at target achievement, but will be paid out based upon actual achievement levels, which will be known only after completion of the performance period); (3) the number of unvested restricted stock units held by each of Messrs. Carlucci, Pajot and Knightly, Ms. Katz, the seven other executive officers (as a group) and the eight non-employee directors (as a group) that would vest and become free of restrictions and entitle the holder to cash payment equal to $22.00 per share are 100,060, 56,247, 29,391, 19,857, 78,127 and 117,399, respectively (with such unvested restricted stock units having a total value of approximately $2,201,320, $1,237,434, $646,602, $436,854, $1,718,794 and $2,582,778, respectively, based upon a $22.00 stock price); and (4) no other unvested Company equity awards not previously described in this paragraph were held by each of Messrs. Carlucci, Pajot and Knightly, Ms. Katz, the seven other executive officers (as a group) and the eight non-employee directors (as a group). In addition, although Messrs. Carlucci, Pajot and Knightly, Ms. Katz, the seven other executive officers and the eight non-employee directors hold options to purchase the common stock, all such options are already fully vested., 332281=The transaction committee, at a meeting held on November 5, 2009, unanimously determined that the merger agreement is fair to and in the best interests of the Company and its stockholders, declared advisable the merger, the merger agreement and the transactions contemplated thereby, and recommended that the board of directors approve (including for the purposes of Section 203 of the DGCL) the merger, the merger agreement and the transactions contemplated thereby, that the board of directors recommend to our stockholders that they vote to approve the proposal to adopt the merger agreement, and that our stockholders vote to approve the proposal to adopt the merger agreement. In reaching its determination, the transaction committee consulted with and received the advice of its independent financial and legal advisors, members of the board of directors not on the transaction committee, our senior management team, as well as our outside legal and financial advisors and considered a number of factors, including the following material factors:, 20197=On November 5, 2009, the Company entered into a merger agreement providing for the acquisition of the Company by Healthcare Technology Holdings, Inc., an entity created by certain affiliates of TPG Capital, L.P. and the Canada Pension Plan Investment Board. At the special meeting, you will be asked to consider and vote upon a proposal to adopt the merger agreement., 676769=In addition to those financial forecasts, the Company provided its board of directors, the transaction committee and their respective advisors with a set of financial forecasts it called a \u0091downside case\u0092 (a sensitivity case which reflects slower growth of the Company\u0092s core products and services in the period beyond 2010 and lower growth than the financial forecasts summarized above in terms of revenue from planned new products and services and therefore lower Gross Profit, EBITDA and Total Operating Income) and another set of financial forecasts it called an \u0091upside case\u0092 (a sensitivity case which reflects faster growth of the Company\u0092s core products and services in the period beyond 2010 and incremental growth above the financial forecasts summarized above in terms of revenue from planned new products and services and therefore higher Gross Profit, EBITDA and Total Operating Income). Those financial forecasts were not furnished to the TPG/CPPIB Group or other interested bidders and are accordingly not included herein., 910267=if the effective time occurs in 2010, provide pro rata payout of 2010 bonuses and maintain an annual bonus plan for the remainder of the year on the same terms and conditions as applied before the effective time, providing for the payment of bonuses following the end of 2010 according to the same targets and performance measures, but reduced by the earlier pro rata payout; and, 551528=Based on the Company forecasts provided to Lazard by the Company\u0092s management, Lazard performed a discounted cash flow analysis of the Company based on the present value of forecasted unlevered free cash flows for fiscal years ending December 31, 2010 through 2013 and the present value of a terminal value, discounted to December 31, 2009. Lazard calculated the estimated terminal values for the Company by applying a range of one-year forward EBITDA (earnings before interest, taxes, depreciation and amortization) terminal value multiples of 6.0x to 8.0x to the Company\u0092s 2014 estimated EBITDA. The unlevered free cash flows and terminal values were discounted to present value using discount rates ranging from 9.0% to 11.0%, which were based on estimates relating to the weighted average cost of capital of selected peer companies that Lazard viewed as reasonably comparable to the Company. Based on the foregoing, Lazard calculated an implied value per share range for the common stock of $17.08 to $24.77., 1067392=Dated as of November 5, 2009, 622387=Analysis of Selected Precedent Transactions. Deutsche Bank reviewed the financial terms, to the extent publicly available, of 11 selected transactions completed since December 2000 involving companies in the pharmaceutical services, market intelligence, and sales and marketing services sectors, which we refer to as the, 1054720=If the merger is completed, we will not have public stockholders and there will be no public participation in any future meeting of stockholders. However, if the merger is not completed or if we are otherwise required to do so under applicable law, we would hold a 2010 annual meeting of stockholders. If the merger is not consummated, any stockholder nominations or proposals for other business intended to be presented at our next annual meeting must be submitted to us as set forth below., 401162=a premium of 31.4%, based on a price of $16.74 per share of the common stock, the volume-weighted average closing market price for the period started October 16, 2009 and ended November 3, 2009;, 74933=Healthcare Technology Holdings, Inc., or Parent, was formed solely for the purpose of entering into the merger agreement and completing the transactions contemplated by the merger agreement by affiliates of TPG Capital, L.P., which we refer to as TPG, and the Canada Pension Plan Investment Board, which we refer to as CPPIB. TPG Capital, L.P. is the global buyout group of TPG, a leading private investment firm with approximately $45 billion of assets under management. CPPIB is a professional investment management organization that invests funds not needed by the Canada Pension Plan to pay current benefits. At September 30, 2009, the Canada Pension Plan Fund totaled CAD$123.8 billion of which CAD$20 billion represents private investments. Upon completion of the merger, the Company will be a direct wholly owned subsidiary of Parent., 969025=2008, 372563=On November 5, 2009, the board of directors met to consider the merger and the recommendation of the transaction committee. On the basis of the transaction committee\u0092s recommendation and the other factors described below, the board of directors unanimously determined that the merger is fair to, and in the best interests of, the Company and its stockholders and approved and declared advisable the merger agreement and the merger and the other transactions contemplated by the merger agreement and resolved that the merger agreement be submitted for consideration by the stockholders of the Company at a special meeting of stockholders, and recommended that the stockholders of the Company vote to adopt the merger agreement., 116558=the payment to our executive officers of pro-rated 2010 annual bonuses as of the date of the completion of the merger under our Executive Annual Incentive Plan;, 164254=The closing price of the common stock on the New York Stock Exchange, or NYSE, on October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives, was $14.67 per share of common stock, and on November 4, 2009, the last trading day prior to the public announcement of the execution of the merger agreement, was $16.81 per share of common stock. On             ,             , the most recent practicable date before this proxy statement was mailed to our stockholders, the closing price for the common stock on the NYSE was $         per share of common stock. You are encouraged to obtain current market quotations for common stock in connection with voting your shares of common stock., 354488=the Company\u0092s ability, under the merger agreement, to withhold, withdraw, qualify or modify its recommendation that its stockholders vote to adopt the merger agreement under certain circumstances, subject to Parent\u0092s subsequent right to terminate the merger agreement and, in such case, to pay to Parent up to $5 million in documented expenses plus a termination fee of $80 million, if the termination fee becomes payable in connection with an agreement entered into prior to 12:01 a.m., New York time, on December 21, 2009, or a termination fee of $115 million, in all other circumstances, in the event that Parent elects to terminate the merger agreement;, 313843=From October 26 to October 30, Bidder B, Bidder C, Bidder D and Bidder E, held discussions with members of senior management of the Company and had several conversations with representatives of Deutsche Bank and Foros regarding the Company\u0092s business and prospects. No nonpublic information of the Company was shared with the strategic acquiror forming a part of Bidder E due to competitive and regulatory concerns., 400222=a premium of 13.5%, based on a price of $19.38 per share of the common stock, the average of Wall Street research analyst price targets for a hypothetical leveraged buyout of the Company made publicly available during the period started October 16, 2009 and ended November 3, 2009;, 1140481=(iii) Special Payment Procedures for DTC. Prior to the Effective Time, Parent and the Company shall cooperate to establish procedures with the Paying Agent and the Depository Trust Company (\u0093DTC\u0094) to ensure that (x) if the Closing occurs at or prior to 11:30 am (New York time) on the Closing Date, the Paying Agent will transmit to DTC or its nominee on the Closing Date an amount in cash in immediately available funds equal to number of Shares held of record by DTC or such nominee immediately prior to the Effective Time multiplied by the Per Share Merger Consideration (such amount, the \u0093DTC Payment\u0094), and (y) if the Closing occurs after 11:30 am (New York time) on the Closing Date, the Paying Agent will transmit to DTC or its nominee on the first business day after the Closing Date an amount in cash in immediately available funds equal to the DTC Payment., 473391=\u0095     July 25, 2007, 1020010=200 E. Randolph Drive, Suite 2900, 470103=Hypothetical Leveraged Recapitalization Case. Foros performed an illustrative analysis of the implied present value of the future price per share of the common stock, assuming a hypothetical leveraged recapitalization of the Company. For this analysis, Foros used publicly available historical financial information for the Company, financial information for the Company provided in the Company forecasts and consensus estimates from Factset. Foros also assumed a hypothetical leveraged recapitalization of the Company based on a post-recapitalization ratio of debt to estimated EBITDA for calendar year 2009 of 3.5x and the declaration of a hypothetical $817.4 million special dividend to the Company\u0092s stockholders on December 31, 2009. Foros calculated the implied values per share of the common stock as of November 3, 2010, by applying the same set of P/E multiples utilized in the \u0093Stand-Alone Case\u0094 to estimated EPS, as adjusted to reflect the leveraged capital structure and special dividend assumed in the hypothetical leveraged recapitalization, for calendar year 2011, per the Company forecasts. Foros then discounted such implied values to November 3, 2009 using a discount rate of 12.7%., 279076=We are working towards completing the merger as soon as possible. Assuming timely satisfaction of necessary closing conditions, we anticipate that the merger will be completed by the end of the first quarter of 2010. If our stockholders vote to approve the proposal to adopt the merger agreement, the merger will become effective as promptly as practicable following the satisfaction or waiver of the other conditions to the merger., 19197=                    , 2009, 788625=At the effective time, Parent will deposit, or will cause to be deposited, with the paying agent a cash amount in immediately available funds necessary for the paying agent to make payment of the aggregate per share merger consideration to the holders of shares of our common stock and any additional amounts necessary to make payments to such stockholders who withdraw or otherwise lose their demand for appraisal rights pursuant to the DGCL. With respect to the deposit of funds regarding shares held by the Depository Trust Company, or DTC, if the closing of the merger occurs at or prior to 11:30 a.m., New York time, on the date of closing of the merger, and if the closing of the merger occurs after 11:30 a.m., New York time, on the first business day after the date of the closing of the merger, the paying agent will transmit to DTC an amount in cash in immediately available funds equal to the number of shares of common stock held of record by DTC immediately prior to the effective time multiplied by the per share merger consideration., 467673=the P/E ratio, as adjusted to exclude one-time expenses, for the Company for calendar year 2010, based on the closing price for shares of the common stock on October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives, and consensus estimates from Factset;, 142941=the merger has not been consummated by May 26, 2010, which we refer to as the termination date (but, the right to terminate will not be available to a party if the failure to consummate the merger prior to the termination date was primarily due to the failure of such party to perform any of its obligations under the merger agreement);, 619399=Deutsche Bank determined an estimated Enterprise Value to 2009E EBITDA reference range of 6.25x to 8.00x and applied such range to the Company\u0092s estimated 2009 EBITDA, resulting in a range of implied common equity market prices per share, which we refer to as Price Per Share, for the Company from $13.22 to $18.41;, 76335=In this proxy, we refer to the Agreement and Plan of Merger, dated November 5, 2009, as it may be amended from time to time, among the Company, Parent and Merger Sub, as the merger agreement, and the merger of Merger Sub with and into the Company as the merger., 1146590=(g) Withholding Rights. Each of Parent, the Surviving Corporation and the Paying Agent shall be entitled to deduct and withhold from the consideration otherwise payable in respect of Shares cancelled in the Merger such amounts as it reasonably believes it is required to deduct and withhold with respect to the making of such payment under the Internal Revenue Code of 1986, as amended (the \u0093Code\u0094), or any other applicable state, local or foreign Tax Law. To the extent that amounts are so withheld by the Surviving Corporation, Parent or the Paying Agent, as the case may be, such withheld amounts (i) shall be remitted by Parent, the Surviving Corporation or the Paying Agent, as applicable, to the applicable Governmental Entity, and (ii) shall be treated for all purposes of this Agreement as having been paid to the Record Holder of Shares in respect of which such deduction and withholding was made by the Surviving Corporation or Parent, as the case may be., 328924=On the morning of November 5, 2009, Parent, Merger Sub and the Company executed the merger agreement, and the Company and the TPG/CPPIB Group issued a joint press release announcing the execution of the merger agreement., 555297=Based on the foregoing, Lazard applied EBITDA multiples of 6.5x to 8.5x to the Company\u0092s calendar year 2009 estimated EBITDA provided by the Company\u0092s management, and applied EBITDA multiples of 6.0x to 8.0x to the Company\u0092s calendar year 2010 estimated EBITDA provided by the Company\u0092s management. Lazard also applied price per share/EPS multiples of 10.0x to 14.0x to the Company\u0092s 2010 estimated earnings per share provided by the Company\u0092s management. Based on the foregoing, Lazard determined an implied price per share range for the common stock of $12.98 to $20.58 per share., 511469=Premiums Paid. Using publicly available historical financial data, Foros reviewed the premiums to be paid in acquisitions of United States companies announced since January 1, 2009 with transaction values exceeding $500 million and cash as a portion of the consideration. Premiums paid were calculated as the consideration to be paid in each such transaction over the closing market share price one day and 30 days, as well as the high and low closing market share prices of the target companies in the 52 weeks, prior to transaction announcement. The results of this review are summarized as follows:, 307447=On October 23, 2009, the TPG/CPPIB Group submitted a revised proposal with a price of $21.50 per share. The proposal included improved terms for the debt financing commitment and contemplated that Goldman Credit Partners L.P. and its affiliates would be the source of debt financing. The proposal also included a draft merger agreement, a limited guarantee from the guarantors and an equity commitment letter between Parent and the guarantors, and imposed a deadline for the Company to agree on definitive documentation with respect to a transaction with the TPG/CPPIB Group by October 25, 2009. The TPG/CPPIB Group strongly pressed the Company to use an accelerated timetable coupled with a post-signing \u0093go shop\u0094 mechanism to permit the Company to solicit and consider alternative transactions for a period after signing a merger agreement., 125866=Under Council Regulation (EC) No 139/2004 on the control of concentrations between undertakings, the merger may not be completed until a notification has been filed with the Commission of the European Communities, or the EC, and clearance has been received or the applicable waiting period has expired. Parent expects to file a notification under the EC Merger Regulation and will await clearance or the expiration of the applicable waiting period., 81993=As of                     , 2010, the record date, the directors and executive officers of the Company beneficially owned and were entitled to vote, in the aggregate,             shares of common stock, representing     % of the outstanding shares of common stock. The directors and executive officers have informed the Company that they currently intend to vote all of their shares of common stock \u0093FOR\u0094 the proposal to adopt the merger agreement and \u0093FOR\u0094 the proposal to adjourn the special meeting, if necessary or appropriate, to solicit additional proxies., 911295=if the effective time occurs in 2010, to the extent LTIP awards with respect to the 2009-2010 performance cycle pay out at a level which is less than the maximum amount available with respect to such awards, work with the Company to implement a mechanism to permit employees to earn up to the maximum amount based on the Company\u0092s actual performance over the remainder of the existing performance period., 621315=Deutsche Bank also determined an estimated Price Per Share to 2011E EPS reference range of 9.5x to 12.0x and applied such range to the Company\u0092s estimated 2011 earnings per share, which we refer to as 2011E EPS, resulting in a range of implied Price Per Share for the Company from $14.90 to $18.82., 466786=the average of the NTM P/E ratio, as adjusted to exclude one-time expenses, for the one year period ended October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives;, 19595=We cordially invite you to attend a special meeting of stockholders of IMS Health Incorporated, a Delaware corporation, which we refer to as the Company, to be held on                     , 2010 at             a.m. local time, at             ., 786997=withholding taxes. Any restricted stock units that are granted after the date the merger agreement was executed and before the effective time generally will vest pro rata based on the number of months that have elapsed from January 1, 2010 through and including the month in which the effective time occurs relative to 48 months., 1063459=Definitive Proxy Statement for our 2009 Annual Meeting filed with the SEC on March 27, 2009., 1060703=Annual Report on Form 10-K for the fiscal year ended December 31, 2008 (filed with the SEC on February 27, 2009);, 532388=The Company retained Foros to act as the transaction committee\u0092s financial advisor because Foros is an investment banking firm whose personnel have substantial experience in transactions similar to the merger and because of Foros\u0092s familiarity with the Company and its business. Pursuant to a letter agreement dated October 20, 2009, Foros was engaged to act as financial advisor to the transaction committee. Pursuant to the terms of such engagement letter, the Company agreed to pay Foros an opinion fee of $2.5 million payable upon Foros rendering its opinion (or advising the transaction committee that Foros would be unable to deliver an opinion), an additional fee of $2.5 million upon the delivery of any additional opinions (or advising the transaction committee that Foros would be unable to deliver such additional opinion) and a transaction fee of up to $16.5 million contingent upon the completion of the merger. Such transaction fee, if any, will be reduced by the amount of any previously paid opinion fee or fees. In addition, the Company agreed to reimburse Foros for its expenses, including attorneys\u0092 fees and disbursements, and to indemnify Foros and related persons against certain liabilities arising out of Foros\u0092s engagement, including liabilities under the federal securities laws., 732353=If the effective time occurs in 2010, immediately prior to the effective time of the merger, we may pay each participant (including our executive officers) in the Company Executive Annual Incentive Plan (excluding the Company Performance Restricted Stock Incentive Plan thereunder) who remains employed through the effective time a pro-rated annual cash bonus award, based on the number of days elapsed in 2010 through the effective time and target performance., 651411=Deutsche Bank is an internationally recognized investment banking firm experienced in providing advice in connection with mergers and acquisitions and related transactions. Deutsche Bank is an affiliate of Deutsche Bank AG, which, together with its affiliates, we refer to as the DB Group. In the past two years, one or more members of the DB Group provided, from time to time, investment banking, commercial banking (including extension of credit) and other financial services to the Company and affiliates of Parent for which it received compensation, including the provision of debt financing to Aleris International Inc., an affiliate of TPG, in 2009 and services in connection with the acquisition of Harrah\u0092s Entertainment Inc. by an affiliate of TPG in 2008. In these two years, the DB Group has received no compensation in connection with a material transaction from the Company or its affiliates other than in connection with the merger as described above. DB Group may also, 399323=a premium of 50.0%, based on a price of $14.67 per share of the common stock, the undisturbed closing market price on October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives;, 1055345=Under SEC rules, if a stockholder wants us to include a proposal in our proxy statement (and form of proxy) for presentation at our 2010 annual meeting of stockholders, the proposal must be received by us, marked to the attention of Harvey A. Ashman, Corporate Secretary, at our principal executive offices by November 27, 2009. As the rules of the SEC make clear, merely submitting a proposal does not guarantee its inclusion., 964120=2007, 672922=In preparing the summary financial forecasts, the Company made the following assumptions for the period from 2010 to 2013:, 251397=TPG is a leading private investment firm with approximately $45 billion of assets under management as of September 30, 2009. The firm was founded in 1992 and is led by David Bonderman and James G. Coulter. Through its global buyout platform, TPG Capital, L.P., the firm generally makes significant investments in companies through acquisitions and restructurings across a broad range of industries throughout North America, Europe, Asia and Australia. TPG\u0092s healthcare investments have included Axcan Pharma, Biomet, Fenwal, IASIS Healthcare, Quintiles Transnational, and Surgical Care Affiliates, among others. TPG\u0092s technology investments have included SunGard, Fidelity National Information Services, Sabre Holdings, Aptina, Avaya, and Intergraph, among others., 468650=the median of the selected pharmaceutical services companies\u0092 P/E ratios, as adjusted to exclude one-time expenses, for calendar year 2010 (as calculated in the selected companies analysis, described above); and, 351136=the Company\u0092s ability, under the merger agreement, under certain circumstances, at any time from and after 12:01 a.m., New York time, on December 21, 2009 and prior to the time the Company stockholders adopt the merger agreement, to consider and respond to an unsolicited bona fide acquisition proposal or engage in discussions or negotiations with the person making such a proposal if the board of directors, prior to taking any such actions, determines in good faith after consultation with outside legal counsel that failure to take such actions could be inconsistent with the board of directors\u0092 fiduciary duties, and if, after consultation with its financial advisor, the board of directors determines in good faith that such acquisition proposal either constitutes a superior proposal or could reasonably be expected to result in a superior proposal, and to, or propose to, adopt, approve or recommend such acquisition proposal if the board complies with its obligations relating to such action and determines in good faith after consultation with its financial advisor and outside legal counsel that such acquisition proposal is a superior proposal;, 732947=If the effective time occurs in 2010, we may grant Mr. Carlucci, Mr. Pajot and Ms. Katz 2010 PERS awards, consistent with past practice (subject to an aggregate cap of 104,545 shares). PERS awards may vest in full at the effective time. We may also grant executive officers 2010-2011 LTIP performance restricted stock units in amounts consistent with past practice (subject to an aggregate cap of 590,909 shares). Subject to continued employment, at the effective time, and based on target levels of achievement, an executive will vest in a portion of his or her 2010-2011 LTIP performance restricted stock unit award, where such vesting will be pro-rated to reflect the number of months that have elapsed from January 1, 2010 through and including the month in which the effective time occurs relative to 24 months. Any portion of the performance restricted stock unit award (other than PERS) that is unvested at the effective time shall terminate without any consideration due to the executive officer., 412485=annual percentage growth rate of estimated total revenue from calendar year 2009 to calendar year 2010;, 298685=On October 20, 2009, the board of directors held another meeting. Members of senior management of the Company and representatives of Deutsche Bank, Foros, Sullivan & Cromwell and Morris, Nichols, Arsht & Tunnell LLP, which we refer to as Morris Nichols, also participated in this meeting. At this meeting, the board of directors determined to undertake a review of the Company\u0092s strategic alternatives, including, if appropriate, a possible sale of the Company. It did so because the indications of interest received from the TPG/CPPIB Group and Bidder A, including their respective draft debt financing commitment letters, indicated that a sale of the Company at an attractive price might be a viable possibility. The board of directors further determined that it was advisable and in the best interests of the Company and its stockholders to form the transaction committee, consisting of five independent, outside members of the board of directors for the purpose of directing this review process. The board of directors appointed each of Constantine Clemente, James D. Edwards, H. Eugene Lockhart, M. Bernard Puckett, and William C. Van Faasen as members of the transaction committee. The transaction committee was delegated full power and authority to direct the strategic review process, including the full power and authority to (i) explore and take such actions as it may deem necessary or appropriate in connection with effecting potential transactions, (ii) initiate and participate in discussions with, or otherwise assist or facilitate proposals from, potential parties to a potential transaction, (iii) review, evaluate and negotiate the terms of any potential transaction, including negotiating a definitive agreement or agreements, (iv) reject any potential transaction, and (v) determine whether any potential transaction was advisable, fair to and in the best interests of the Company\u0092s stockholders. In connection with the formation of the transaction committee, the board of directors resolved that it would not recommend any potential transaction for approval by the Company\u0092s stockholders or otherwise approve any potential transaction without a prior favorable recommendation of such potential transaction by the transaction committee. At this same meeting, the board of directors retained Deutsche Bank as its financial advisor., 314392=On October 27, 2009, the transaction committee held a meeting with representatives from Foros, Deutsche Bank, Sullivan & Cromwell and Morris Nichols. At this meeting, representatives of Foros and Morris Nichols provided the transaction committee with an update of the strategic review process. The transaction committee instructed a representative from Morris Nichols to reiterate to Company management the prohibition on conducting any discussions related to management retention or compensation at this time, which the representative of Morris Nichols did promptly thereafter., 631540=May 2002, 381416=Foros delivered to the transaction committee an oral opinion, subsequently confirmed in writing, to the effect that, as of November 5, 2009 and based upon and subject to various assumptions and limitations described in Foros\u0092s opinion, the per share merger consideration to be received by holders of the common stock (other than Parent, Merger Sub or any other direct or indirect wholly owned subsidiary of Parent) in the merger, was fair, from a financial point of view, to such holders. The full text of the Foros written opinion to the transaction committee, which describes, among other things, the assumptions made, procedures followed, matters considered and limitations on the review undertaken, is attached as Annex B to this proxy statement and is incorporated by reference herein in its entirety. Foros provided its opinion to the transaction committee for the information and assistance of the transaction committee in connection with and for purposes of the transaction committee\u0092s evaluation of the per share merger consideration from a financial point of view. Foros\u0092s opinion does not address any other aspect of the merger and does not constitute a recommendation to any stockholder as to how to vote or act in connection with the merger or any other matter., 902156=calculate and pay annual bonuses for 2009 under the Executive Annual Incentive Plan and the Performance Restricted Stock Incentive Plan based on performance through 2009;, 95393=In connection with the merger, Deutsche Bank Securities Inc., or Deutsche Bank, financial advisor to the board of directors, delivered to the board of directors an oral opinion on November 5, 2009, subsequently confirmed in writing on November 6, 2009 (upon which the transaction committee was permitted to rely), to the effect that, as of November 5, 2009, and based upon and subject to the various assumptions, limitations, qualifications and conditions described in Deutsche Bank\u0092s opinion, the per share merger consideration to be paid to holders of the Company\u0092s common stock (other than Parent, Merger Sub and their affiliates) in the merger was fair, from a financial point of view, to such holders. The full text of the written opinion, dated November 6, 2009, of Deutsche Bank, which describes, among other things, the assumptions made, matters considered and limitations, qualifications and conditions of the review undertaken in rendering its opinion, is attached as Annex D to this proxy statement and is incorporated by reference herein in its entirety., 534442=During the period of time that several consortia were preparing bids, the transaction committee determined to retain Lazard to render an opinion to the transaction committee as to the fairness from a financial point of view, to holders of the common stock (other than Parent, Merger Sub and any other direct or indirect wholly owned subsidiary of Parent) of the per share merger consideration to be paid to such holders in the merger. On November 5, 2009, Lazard rendered its oral opinion to the transaction committee, subsequently confirmed in writing, that, as of such date, and based upon and subject to the assumptions, procedures, factors, qualifications and limitations set forth therein, the per share merger consideration to be paid to holders of the common stock (other than Parent, Merger Sub and any other direct or indirect wholly owned subsidiary of Parent) in the merger was fair, from a financial point of view, to such holders., 236997=This proxy statement, and the documents to which we refer you in this proxy statement, as well as information included in oral statements or other written statements made or to be made by us, contain statements that, in our opinion, may constitute \u0093forward-looking statements\u0094 within the meaning of the Private Securities Litigation Reform Act of 1995. The words such as \u0093believe,\u0094 \u0093expect,\u0094 \u0093anticipate,\u0094 \u0093intend,\u0094 \u0093plan,\u0094 \u0093foresee,\u0094 \u0093likely,\u0094 \u0093project,\u0094 \u0093estimate,\u0094 \u0093will,\u0094 \u0093may,\u0094 \u0093should,\u0094 \u0093future,\u0094 \u0093predicts,\u0094 \u0093potential,\u0094 \u0093continue\u0094 and similar expressions identify these forward-looking statements, which appear in a number of places in this proxy statement (and the documents to which we refer you in this proxy statement) and include, but are not limited to, all statements relating directly or indirectly to the timing or likelihood of completing the merger to which this proxy statement relates, plans for future growth and other business development activities as well as capital expenditures, financing sources, dividends and the effects of regulation and competition, foreign currency conversion and all other statements regarding our intent, plans, beliefs or expectations or those of our directors or officers. Investors are cautioned that such forward-looking statements are not assurances for future performance or events and involve risks and uncertainties that could cause actual results and developments to differ materially from those covered in such forward-looking statements. These risks and uncertainties include, but are not limited to, the risks detailed in our filings with the SEC, including our most recent filings on Forms 10-Q and 10-K, factors and matters contained or incorporated by reference in this document, and the following factors:, 288747=On July 30, 2009, a TPG representative contacted Jack Walsh, Senior Vice President of the Company, and expressed TPG\u0092s interest in the Company and its belief that a transaction involving the Company was possible. Mr. Walsh subsequently informed Mr. Carlucci and representatives of Deutsche Bank and Foros of this expression of interest. Over the next two months, TPG representatives continued to express interest to Mr. Walsh and representatives from Deutsche Bank., 761157=Under Council Regulation (EC) No 139/2004 on the control of concentrations between undertakings, the merger may not be completed until a notification has been filed with the EC and clearance has been received or the applicable waiting period has expired. Parent expects to file a notification under the EC Merger Regulation and will await clearance or the expiration of the applicable waiting period. The EC could prohibit the completion of the merger or seek divestiture of substantial assets of the Company or Parent as a condition for allowing the completion of the merger., 107528=Parent has entered into an equity commitment letter with TPG Partners V, L.P., TPG Partners VI, L.P. and CPP Investment Board Private Holdings Inc., which we refer to collectively as the guarantors, dated November 5, 2009, pursuant to which the guarantors have committed, severally but not jointly, to make or secure capital contributions to Parent for an aggregate of $2.793 billion. The guarantors may assign a portion of equity to other investors, although such assignment will not affect the guarantors\u0092 commitments to make or secure capital contributions pursuant to the equity commitment letter. The funding of financing contemplated by the equity commitment is generally subject to the satisfaction of the conditions to Parent\u0092s and Merger Sub\u0092s obligations to consummate the transactions contemplated by the merger agreement and the substantially contemporaneous funding of the debt financing pursuant to its terms and conditions or any alternative financing that Parent and Merger Sub are required to accept pursuant to the merger agreement. The Company is a third party beneficiary of the equity commitment letter to the extent that the Company seeks specific performance of Parent\u0092s obligation to cause the guarantors to fund their equity commitment in certain limited circumstances in accordance with the terms of the merger agreement., 904888=calculate performance under the LTIP for the period ending in 2009 based on performance through 2009., 337777=the fact that the per share merger consideration represents a premium of approximately 50% to the closing share price of the common stock on October 16, 2009, the last trading day prior to the public speculation that the Company was considering its strategic alternatives; a premium of approximately 31% to the closing price of the common stock on November 4, 2009, the last trading day prior to the public announcement of the merger agreement; a premium of approximately 45% to the volume-weighted average price for the 30 trading days prior to October 16, 2009; a premium of approximately 35% to the 52-week high prior to October 16, 2009; and a premium of approximately 123% to the 52-week low prior to October 16, 2009;, 109254=In connection with the entry into the merger agreement, Parent received a debt commitment letter, dated November 5, 2009, from Goldman Sachs Credit Partners L.P., Goldman Sachs Lending Partners LLC, GSLP I Offshore Holdings Fund A, L.P., GSLP I Offshore Holdings Fund B, L.P., GSLP I Offshore Holdings Fund C, L.P., and GSLP I Onshore Holdings Fund, L.L.C., which we refer to collectively as Goldman Sachs, to provide, severally but not jointly, in the aggregate up to $3.275 billion in debt financing to Parent and Merger Sub, consisting of (i) a senior secured term loan facility in an aggregate principal amount of $2 billion, (ii) a senior secured revolving credit facility with a maximum availability of $275 million (no more than $100 million of which may be drawn at closing), and (iii) up to $1 billion of senior unsecured term loans in the event some or all of the senior unsecured notes referred to in the next sentence are unable to be issued at the closing. It is expected that at the closing $1 billion principal amount of senior unsecured notes will be issued pursuant to Rule 144A of the Securities Act of 1933, as amended, or another private placement exemption in lieu of the senior unsecured term loans. Goldman Sachs may invite other institutional lenders to participate in the debt financing described in the debt commitment letter and to undertake a portion of the commitment to provide such financing., 730499=Based on the executives\u0092 compensation levels as of December 31, 2009, and assuming that the merger is completed on February 26, 2010, and the executive experiences a qualifying termination immediately thereafter, the amount of the cash severance payment (including the pro rata target annual bonus payment in (1) above) that would be payable to Ms. Katz, Mr. Knightly and the seven other executive officers (as a group) is approximately $2,083,726, $1,342,313 and $7,580,968, respectively, the estimated value of the health and life insurance benefits they would receive is $656,554, $762,772 and $4,703,357, respectively and the estimated value of the outplacement benefits they would receive is $100,000, $100,000 and $671,720, respectively. Assuming these payments are made, Ms. Katz , Mr. Knightly and the seven other executive officers (as a group) will be eligible to receive a full 280G gross-up of approximately $            , $             and $            , respectively. Receipt of the cash severance payment and other benefits upon such a qualifying termination is subject to forfeiture if the executive materially breaches his or her confidentiality and non-disparagement agreements and is further subject to the executive\u0092s execution of a general release of claims in favor of the Company, 465607=financial information for the Company and the financial information for the Company provided in the Company forecasts and consensus estimates from Factset. Foros calculated implied values per share of the common stock as of November 3, 2010, by applying various P/E multiples to estimated EPS of the Company for calendar year 2011, per the Company forecasts, and then discounted such implied per share of the common stock values to November 3, 2009 using a discount rate of 12.7%. Foros utilized the following P/E multiples for this analysis:, 309645=On October 24, 2009, the transaction committee held a meeting to continue its discussion of the status of the strategic review process and the revised proposal from the TPG/CPPIB Group. Representatives of Deutsche Bank, Foros, Sullivan & Cromwell and Morris Nichols also participated in this meeting. The transaction committee was informed that Foros, at the direction of the transaction committee, had continued its outreach to potential strategic transaction partners and other private equity groups. The transaction committee discussed at length the TPG/CPPIB Group\u0092s revised proposal, including the improved certainty regarding the funding of the debt financing contemplated by financing commitment documents as compared to the TPG/CPPIB Group\u0092s prior proposal, and the potential impact of the deadline imposed by the TPG/CPPIB Group on the strategic review process. In particular, the transaction committee discussed the importance of continuing the strategic review process that was underway, the risk that the TPG/CPPIB Group would not agree to a transaction if the Company ignored the TPG/CPPIB Group deadline and did not move more promptly towards execution of an agreement, and ways to strike an appropriate balance between these two countervailing issues., 158979=the Company may be obligated to pay a termination fee of $115 million (or $80 million, if the merger agreement is terminated in connection with an alternative acquisition agreement entered into prior to 12:01 a.m., New York time, on December 21, 2009) and reimburse the out-of-pocket fees and expenses of Parent and Merger Sub up to $5 million; or, 1056740=If, however, the date of our 2010 annual meeting is advanced more than 20 days, or delayed more than 70 days, from May 1, 2010, we must receive notice no earlier than 90 days prior to the 2010 annual meeting date and no later than the close of business (i) 70 days prior to the 2010 annual meeting date, or (ii) the tenth day following the day on which public announcement of the date of such meeting is first made, whichever is later., 322664=On November 4, 2009, the transaction committee held a special meeting to continue its consideration of the proposals received the prior day. Certain members of senior management and representatives of Foros, Deutsche Bank, Lazard, Sullivan & Cromwell and Morris Nichols also participated in the meeting. At this meeting, representatives of Foros and Deutsche Bank reviewed certain preliminary financial analyses with the transaction committee. Following these presentations, the transaction committee reiterated its previous instructions to management of the Company not to discuss any equity participation or compensation arrangements with the TPG/CPPIB Group until permitted to do so by the transaction committee. The transaction committee also instructed representatives from Foros to prepare to make contacts with potential transaction partners during the \u0093go-shop\u0094 period if a merger agreement with the TPG/CPPIB Group was executed., 701868=The debt commitments will terminate upon the first to occur of (i) the consummation of the merger, (ii) the termination by Parent of the merger agreement, (iii) a material breach by Parent of its obligations with respect to the syndication or the payment of fees owed by Parent, and (iv) midnight New York City time on May 26, 2010, provided that under certain circumstances described in the merger agreement such date shall be automatically extended by up to two business days, unless the closing of the facilities, on the terms and subject to the conditions set forth in the debt commitment letter, has been consummated on or before such date. In addition, the commitment to provide and arrange unsecured term loans will terminate upon the issuance of the senior unsecured notes., 630074=August 2005, 288149=At a regularly scheduled meeting of the board of directors on July 20, 2009, representatives of Deutsche Bank and Foros reviewed with the board of directors the full range of strategic alternatives available to the Company and discussed current debt and equity market conditions, including the debt market for acquisition financing and the difficulty any potential acquiror would have in securing the necessary financing to complete a transaction with the Company., 879604=However, at any time from and after 12:01 a.m., New York time, on December 21, 2009 and prior to the time our stockholders adopt the merger agreement, if the Company receives an unsolicited bona fide acquisition proposal from any person, we may:, 1114727=AGREEMENT AND PLAN OF MERGER (hereinafter called this \u0093Agreement\u0094), dated as of November 5, 2009, among IMS Health Incorporated, a Delaware corporation (the \u0093Company\u0094), Healthcare Technology Holdings, Inc., a Delaware corporation (\u0093Parent\u0094), and Healthcare Technology Acquisition, Inc., a Delaware corporation and a wholly owned subsidiary of Parent (\u0093Merger Sub,\u0094 with the Company and Merger Sub sometimes being hereinafter collectively referred to as the \u0093Constituent Corporations\u0094)., 554572=Using publicly available information and the share price for the selected comparable companies as of November 3, 2009, Lazard\u0092s analysis included comparing enterprise value (i.e., market value of common equity-based on a diluted number of shares outstanding plus total debt plus minority interests less cash and equivalents) as a multiple of each selected company\u0092s estimated EBITDA for calendar years 2009 and 2010, and each company\u0092s closing stock price on November 3, 2009, as a multiple of such comparable company\u0092s estimated earnings per share, or EPS, for calendar year 2010., 556754=Lazard performed a premiums paid analysis based on premiums paid in U.S. public merger and acquisition transactions since January 1, 2009 with transaction values larger than $500 million, excluding transactions where the consideration was paid solely in stock. The implied premiums in this analysis were calculated by comparing the per share transaction price to the closing price of the target company\u0092s stock as of one day, five days and 20 days prior to the announcement of the merger, as well as the 52-week high and the 52-week low price of the target company\u0092s stock prior to the announcement of the merger. The results of these calculations are set forth in the following table:, 2496=the Securities Exchange Act of 1934, 776648=The marketing period is the first period of 35 consecutive days following the date of the merger agreement beginning on the later of (i) delivery by the Company to Parent and Merger Sub and their financing sources of certain financial statements specified by the debt commitment letter and any other information relating to the Company and its subsidiaries to the extent reasonably requested by Parent to prepare a confidential information memorandum and lender presentation that are contemplated by the debt commitment letter (which information we refer to as the required bank information), and (ii) 14 days after the date of the later of the meetings with certain rating agencies with respect to the debt facilities contemplated by the debt commitment letter, throughout which 35-day period (a) Parent has received the required bank information and (b) the closing conditions relating to the adoption of the merger agreement by our stockholders, receipt of required antitrust approvals or expiration or early termination of applicable antitrust waiting periods and absence of any law prohibiting the consummation of the merger or otherwise making consummation of the merger illegal have been satisfied and nothing has occurred and no condition exists that would prevent any of the conditions to the obligations of Parent and Merger Sub from being satisfied if the closing of the merger were to occur at any time during such 35-day period. Certain days around Thanksgiving, Christmas and New Year\u0092s Day will not be included in determining such 35-day requirement and if the marketing period has not ended prior to December 18, 2009 it will not commence earlier than January 5, 2010. If the Company in good faith reasonably believes it has delivered the required bank information, it may deliver to Parent a written notice to that effect (stating when it believes it completed such delivery), in which case the marketing period will be deemed to have commenced on the date of such notice unless Parent in good faith reasonably believes the Company has not completed delivery of the required bank information and, within four business days after the delivery of such notice by the Company, delivers a written notice to the Company to that effect. In addition, the marketing period will not be deemed to have commenced if before the completion of the marketing period, (i) PricewaterhouseCoopers LLP withdraws its audit opinion with respect to any of the financial statements contained in our filings with the SEC since January 1, 2007, (ii) we publicly announce any intention to restate any material financial information included in the required bank information or that any such restatement is under consideration, in which case the marketing period will be deemed not to commence at the earliest unless and until such restatement has been completed and the relevant reports have been amended or the Company has determined that no restatement is required, or (iii) we are delinquent in filing any material report with the SEC required under the Exchange Act, in which case the marketing period will be deemed not to commence at the earliest unless and until such delinquency is cured. Further, in certain cases if the financial statements included in the required bank information would be required to be updated under the SEC rules if a registration statement using such financial statements were to be filed with the SEC on any day during such 35-day period, then a new 35-day period will commence. On and after February 12, 2010, the marketing period will be deemed not to commence unless we deliver to Parent and Merger Sub audited consolidated financial statements as at and for the fiscal year ended on December 31, 2009., 313357=On October 25, 2009, representatives of Sullivan & Cromwell sent representatives of the TPG/CPPIB Group and Ropes & Gray written comments on the proposed debt financing commitment documents. On October 26, 2009 representatives of Sullivan & Cromwell sent representatives of the TPG/CPPIB Group and Ropes & Gray a draft merger agreement., 273811=If you hold shares of our common stock through the plan, you may give voting instructions by completing and returning the enclosed proxy card in the accompanying prepaid reply envelope prior to                     , 2010. If a participant\u0092s proxy card is not received by                     , 2010 or if such participant signs and returns his or her proxy card without instructions marked in the boxes, the trustee will vote the participant\u0092s shares of common stock in the same proportion as other shares of common stock held in the plan for which the trustee received timely instructions. Plan participants must vote through the trustee and may not vote in person at the special meeting., 628624=November 2006, 181907=The transaction committee, at a meeting held on November 5, 2009, unanimously determined that the merger agreement is fair to and in the best interests of the Company and its stockholders, declared advisable the merger, the merger agreement and the transactions contemplated thereby, and recommended that the board of directors approve the merger, the merger agreement and the transactions contemplated thereby, that the board of directors recommend our stockholders that they vote to adopt the merger agreement, and that our stockholders vote to adopt the merger agreement., 376973=the presentation at the November 5, 2009 meeting of the transaction committee at which all members of the board of directors were present, and financial analyses reviewed therewith, of Deutsche Bank, and the opinion, dated November 6, 2009, of Deutsche Bank delivered to the board of directors (upon which the transaction committee was permitted to rely) as to the fairness, from a financial point of view as of November 5, 2009 and subject to various assumptions and limitations described therein, to stockholders (other than Parent, Merger Sub or their affiliates) of the per share merger consideration to be received by such stockholders in the merger, as more fully described below under the caption \u0093The Merger\u0097Opinion of Financial Advisors\u0097Opinion of Deutsche Bank Securities Inc.\u0094 beginning on page [\u0097]., 587103=Set forth below is a brief summary of certain financial analyses performed by Deutsche Bank in connection with its opinion and reviewed with the board of directors at its meeting on November 5, 2009., 625697=July 2007, 1154187=(f) Corporate Actions. At or prior to the Effective Time, the Company, the Company Board and the human resources committee of the Company Board, as applicable, shall adopt resolutions to implement the provisions of Sections 4.3(a)-(e). As of the Effective Time, the Company shall take all actions necessary and appropriate to terminate all Stock Plans and to ensure that all equity and equity-based awards granted under any Stock Plan shall be cancelled or terminated and that, except as otherwise agreed by Parent and the holder of any such award, such holder shall have the right only to receive a cash payment based on the Per Share Merger Consideration and determined and calculated as provided for in this Section 4.3; it being understood that nothing in this Section 4.3(f) shall affect Section 6.9(g) of this Agreement with respect to permitting participants in the Company\u0092s Long Term Incentive Program to earn cash awards up to the maximum amount under such program. Provided further that, if Company Options granted under the Rules of the IMS Health Incorporated 2001 Inland Revenue Approved Sub-Plan for United Kingdom Employees (Amendments adopted by the Company on 14 July 2003) cannot be terminated in accordance with their terms at the Effective Time, the Company shall, prior to the Effective Time, take all actions reasonably required so that each such Company Option shall only entitle the holder thereof to receive an amount in cash equal to the product of (x) the total number of Shares subject to the Company Option immediately prior to the Effective Time, times (y) the excess, if any, of the Per Share Merger Consideration over the exercise price per Share under such Company Option, less applicable taxes required to be withheld with respect to such payment., 462881=Discounted Cash Flow Analysis. Foros performed a discounted cash flow analysis on the Company using the Company forecasts. Foros calculated the net present value of unlevered free cash flows for the Company for calendar years 2010 through 2014 using a discount rate of 11% and discounted to December 31, 2009. Foros also calculated illustrative terminal values as of December 31, 2014 based on an assumed perpetuity growth rate ranging from 3.0% to 5.0% and assumed terminal year unlevered free cash flows of $463.7 million based on 7% growth in revenue and constant EBITDA margins. These illustrative terminal values were then discounted to December 31, 2009 to calculate the implied present value using a discount rate of 11%. Foros then added the implied present values of the unlevered free cash flows for calendar years 2010 through 2014 to the range of implied present values of the illustrative terminal values to arrive at an implied per share equity reference range of $19.41 to $26.07 for the common stock., 20703=If the merger contemplated by the merger agreement is completed, you will be entitled to receive $22.00 in cash, without interest, less any applicable withholding taxes, for each share of our common stock owned by you (unless you have properly exercised your appraisal rights with respect to such shares), which represents a premium of approximately 50% to the closing price of the Company\u0092s common stock on October 16, 2009, the last trading day prior to public speculation that the Company was considering its strategic alternatives and a premium of approximately 31% to the closing price of the Company\u0092s common stock on November 4, 2009, the last trading day prior to the public announcement of the execution of the merger agreement., 872463=Until 12:01 a.m., New York time, on December 21, 2009 we are permitted to:, 627155=March 2007, 595077=the ratio of common equity market capitalization plus total debt and minority interests less cash to estimated 2009 EBITDA, which we refer to as Enterprise Value to 2009E EBITDA;, 137441=The merger agreement allows us to solicit any inquiry or the making of any acquisition proposals from third parties and to participate in any negotiations or discussions with third parties with respect to any acquisition proposals until 12:01 a.m., New York time, on December 21, 2009. From and after 12:01 a.m., New York time, on December 21, 2009 and until the effective time of the merger, we are not permitted to solicit any inquiry or the making of any acquisition proposals or engage in any negotiations or discussions with any person relating to an acquisition proposal. Notwithstanding these restrictions, under certain circumstances, we may, from and after 12:01 a.m., New York time, on December 21, 2009 and prior to the time our stockholders adopt the merger agreement, respond to an unsolicited bona fide acquisition proposal or engage in discussions or negotiations with the person making such an acquisition proposal. At any time before the merger agreement is adopted by our stockholders, if our board of directors determines that an acquisition proposal is a superior proposal, we may terminate the merger agreement and enter into any acquisition, merger or similar agreement, which we refer to as an alternative acquisition agreement, with respect to such superior proposal, so long as we comply with certain terms of the merger agreement, including paying a termination fee to Parent. See \u0093The Merger Agreement\u0097Termination Fees\u0094 beginning on page [\u0097]., 966889=Quarter ended September 30, 535533=The full text of Lazard\u0092s written opinion, dated November 5, 2009, which sets forth the assumptions made, procedures followed, factors considered, and qualifications and limitations on the review undertaken by Lazard in connection with its opinion is attached to this proxy statement as Annex C and is incorporated in its entirety into this proxy statement by reference. The description of the Lazard opinion set forth in this proxy statement is qualified in its entirety by reference to the full text of the Lazard opinion set forth as Annex C. We encourage you to read Lazard\u0092s opinion and this section carefully in their entirety., 447340=October 16, 2009, 626421=April 2007, 252300=CPPIB is a professional investment management organization that invests the funds not needed by the Canada Pension Plan to pay current benefits on behalf of 17 million Canadian contributors and beneficiaries. In order to build a diversified portfolio of Canada Pension Plan assets, CPPIB invests in public equities, private equities, real estate, inflation-linked bonds, infrastructure and fixed income instruments. Headquartered in Toronto, with offices in London and Hong Kong, CPPIB is governed and managed independently of the Canada Pension Plan and at arm\u0092s length from governments. At September 30, 2009, the Canada Pension Plan Fund totaled CAD$123.8 billion of which CAD$20 billion represents private investments., 473657=\u0095     August 29, 2005, 981279=The following table shows information regarding the number of shares of common stock \u0093beneficially owned\u0094 by each of our directors, each nominee for director and each of our named executive officers, consisting of David R. Carlucci, Leslye G. Katz, Kevin C. Knightly and Gilles V.J. Pajot, all of our current directors and executive officers as a group, and each person known to be a beneficial owner of more than five percent of our outstanding stock. \u0093Beneficial ownership\u0094 includes shares of common stock that a stockholder has the power to vote or the power to transfer, and also includes common stock options and appreciation rights that were either exercisable at the specified date or will become exercisable within 60 days thereafter and shares of common stock deliverable in connection with stock units. The number of shares deemed to be beneficially owned with respect to a stock appreciation right is the aggregate number of shares subject to such right. Unless otherwise indicated in the footnotes, this information is presented as of November 20, 2009. Percentages are based upon the number of shares of common stock outstanding at November 20, 2009, plus the number of shares of common stock that the indicated person or group had a right to acquire within 60 days after such date and shares of common stock deliverable in connection with stock units., 41178=Dated:                     , 2009, 812480=compliance with the Sarbanes-Oxley Act of 2002 and the listing and corporate governance rules and regulations of the NYSE;, 293029=On September 29, 2009, the board of directors held a meeting to discuss these indications of interest. Several members of senior management and representatives from Deutsche Bank, Foros and Sullivan & Cromwell LLP, the Company\u0092s outside legal counsel, which we refer to as Sullivan & Cromwell, participated in this meeting. Mr. Carlucci reviewed the terms of the indications of interest from the TPG/CPPIB Group and Bidder A with the board of directors and discussed an update on the Company\u0092s performance and latest long-range plan based on the budgeting work performed during the time since the July 20, 2009 meeting of the board of directors. Representatives of Deutsche Bank and Foros also discussed the improvements in the debt and equity capital markets since the July 20, 2009 meeting of the board of directors. A representative from Sullivan & Cromwell also reviewed with the board of directors their fiduciary duties under applicable law. The board of directors and their advisers then discussed the viability of these indications of interest in light of the extreme volatility of the debt and equity capital markets over the past 12 months and the more recent improvements in both the debt and equity capital markets. Following these discussions, the board of directors authorized management of the Company to explore the viability of the transactions proposed by the TPG/CPPIB Group and Bidder A, and to seek to better understand the assumptions underlying the range of prices indicated by the TPG/CPPIB Group and Bidder A and the ability of the TPG/CPPIB Group and Bidder A to secure the necessary debt financing. In connection with such exploration, the board of directors authorized management to provide the TPG/CPPIB Group and Bidder A access to confidential information concerning the Company under appropriate confidentiality agreements in order to help them refine their respective valuations of the Company and confirm the availability of sufficient financing. The board of directors also discussed whether the Company should seek indications of interest from potential acquirors other than the TPG/CPPIB Group and Bidder A. The board of directors determined not to seek indications of interest from other potential acquirors prior to determining whether the indications of interest received from the TPG/CPPIB Group and Bidder A were viable, including whether the TPG/CPPIB Group or Bidder A would be able to secure the necessary debt financing in light of the uncertain state of the debt markets., 811407=our SEC filings since January 1, 2007 and the financial statements included therein;, 572802=Deutsche Bank acted as financial advisor to the board of directors in connection with the merger. At the November 5, 2009 meeting of the transaction committee at which all members of the board of directors were present, Deutsche Bank delivered to the board of directors its oral opinion, subsequently confirmed in writing on November 6, 2009 (upon which the transaction committee was permitted to rely), to the effect that, as of November 5, 2009, based upon and subject to the assumptions made, matters considered and limitations, qualifications and conditions set forth in the opinion, the per share merger consideration to be paid to holders of the common stock (other than Parent, Merger Sub and their affiliates) in the merger was fair, from a financial point of view, to such holders., 305208=On October 20 and October 21, 2009, representatives of Foros, at the direction of the independent directors, along with representatives of Deutsche Bank, contacted seven potential strategic acquirors and 17 additional private equity firms to assess their interest in a potential transaction with the Company., 471709=Selected Transactions Analysis. Foros analyzed certain information relating to the following transactions since 2005 selected based on the involvement of target companies in the pharmaceutical services industry, the size of the involved target companies and the availability of such information:, 732150=2010 Bonuses and Equity Awards if Merger Closes in 2010, 901369=If the effective time occurs in 2010, Parent has agreed that prior to the completion of the merger, we shall be allowed to take the following actions:, 291907=On September 18, 2009, representatives from Bidder A contacted representatives of Deutsche Bank and indicated Bidder A was completing an analysis of the Company, based on publicly available information, related to a possible proposal to acquire the Company. During the period between September 18, 2009 and September 27, 2009, representatives of Bidder A communicated with representatives of Deutsche Bank that Bidder A was working with potential financing sources to evaluate financing options related to its potential proposal. On September 27, 2009, representatives of Bidder A contacted representatives of Deutsche Bank and indicated that Bidder A might be willing to offer to acquire the Company at a price between $19.00 and $21.00 in cash per share. Later on the same day, representatives of Deutsche Bank and Foros contacted representatives of Bidder A to further clarify and understand Bidder A\u0092s offer price range, including the material assumptions underlying such price range., 18876=PRELIMINARY COPIES\u0097SUBJECT TO COMPLETION, DATED NOVEMBER 25, 2009, 1021726=Boston, Massachusetts 02109, 78986=You are entitled to receive notice of, and to vote at, the special meeting if you owned shares of common stock at the close of business on                     , 2010, which the Company has set as the record date for the special, 942479=We must pay Parent a termination fee equal to $80 million, if the merger agreement is terminated in connection with an alternative acquisition agreement entered into prior to 12:01 a.m., New York time, on December 21, 2009, or $115 million in all other circumstances, and pay Parent all out-of-pocket fees and expenses incurred by Parent or Merger Sub in connection with the merger agreement or the transactions contemplated therein up to $5 million, if:, 427240=enterprise value, which is the market value of fully diluted common equity plus the estimated book value of debt less cash, as a multiple of estimated EBITDA for calendar years 2009 and 2010;, 123987=Under the terms of the merger agreement, the merger cannot be completed until certain approvals, consents and consultations required to consummate the merger pursuant to applicable U.S. and foreign antitrust laws, including the Hart-Scott-Rodino Antitrust Improvements Act of 1976, or the HSR Act, and Council Regulation (EC) No 139/2004, have been obtained or any applicable waiting period thereunder has been terminated or has expired. Notwithstanding the foregoing, the merger may be consummated if failure to obtain certain of the approvals, consents or consultations (or failure of the applicable waiting periods to terminate or expire) under certain of the foreign antitrust laws would not reasonably be likely to have a material adverse effect on Parent and its subsidiaries following the closing and would not subject the parties, any of their subsidiaries or any of their directors, officers or employees to risk of criminal liability., 77689=The special meeting will be held on                     , 2010, starting at                     local time, at         ., 256163=This proxy statement is being furnished to our stockholders as part of the solicitation of proxies by the board of directors for use at the special meeting to be held on                     , 2010, starting at             local time, at                     , or at any postponement or adjournment thereof. At the special meeting, holders of our common stock will be asked to approve the proposal to adopt the merger agreement and to approve the proposal to adjourn the special meeting, if necessary or appropriate, for the purpose of soliciting additional proxies if there are insufficient votes at the time of the special meeting to approve the proposal to adopt the merger agreement., 311048=Following this discussion, the transaction committee determined that it was in the best interests of the Company and its stockholders to continue the strategic review process that was already underway while at the same time continuing to work with\u0097but not acceding to the deadline imposed by\u0097the TPG/CPPIB Group, and it instructed representatives of Deutsche Bank, Foros, Sullivan & Cromwell and Morris Nichols to do so, including by continuing discussions with representatives of the TPG/CPPIB Group and Ropes & Gray LLP, which we refer to as Ropes & Gray, in order to improve the terms of the merger agreement and related documents, including the financing commitment documents. The transaction committee also instructed representatives of Foros to inform the TPG/CPPIB Group that the Company would not accede to the TPG/CPPIB Group deadline, and representatives of Foros did that following the meeting. The TPG/CPPIB Group was further informed that they should be prepared to submit an improved proposal on November 3, 2009 at the same time as other interested parties., 642592=the estimated future cash flow that the Company will generate for the years 2010 through 2013; and, 713961=Except as otherwise agreed to by Parent and a holder of an option, at the effective time each outstanding option to purchase shares of the common stock will vest and be cancelled and converted into the right to receive a cash payment equal to the number of shares of common stock subject to such option multiplied by the amount (if any) by which $22.00 exceeds the exercise price per share of such option, less any applicable withholding taxes. Except as otherwise agreed to by Parent and a holder of a stock appreciation right, at the effective time, each outstanding stock appreciation right will vest and be cancelled and converted into the right to receive a cash payment equal to the number of shares of common stock subject to such stock appreciation right multiplied by the amount (if any) by which $22.00 exceeds the exercise price per share of stock appreciation right, less any applicable withholding taxes. Except as otherwise provided below, at the effective time each performance restricted stock unit will vest and be converted at the effective time into the right to receive a cash payment equal to the total number of shares subject to such performance restricted stock unit immediately prior to the effective time assuming target levels of performance multiplied by $22.00, less any applicable withholding taxes. To the extent the payment with respect to performance restricted stock unit awards granted under the Company\u0092s Long Term Incentive Program, or LTIP, for the 2009-2010 performance period is less than the maximum amount available with respect to such awards, the Company will be permitted (subject to Parent\u0092s consent which may not be unreasonably withheld) to implement a mechanism to permit the executives to earn up to the maximum amount based on the Company\u0092s actual performance over the remainder of the performance period, with any such amounts only payable in cash. Except as provided below, at the effective time each restricted stock unit will vest and be cancelled and converted at the effective time into the right to receive a cash payment equal to the number of shares subject to such restricted stock unit immediately prior to the effective time of the merger multiplied by $22.00, less any applicable withholding taxes. Each equity-based award (other than options, stock appreciation rights, performance restricted stock units and restricted stock units) will vest and be converted into the right to receive a cash payment equal to the total number of shares subject to such award immediately prior to the effective time (assuming target levels of achievement, where applicable) multiplied by $22.00 (or the excess, if any, of $22.00 minus the exercise price per share of such award, where applicable), less any applicable withholding taxes. Certain stock units (performance and time-vested) granted between the date the merger agreement was signed and the effective date of the merger will vest on a pro-rated basis at the effective time (with the unvested portion to be then forfeited)., 125066=Under the HSR Act and the rules promulgated thereunder by the Federal Trade Commission, or the FTC, the merger cannot be completed until each of the Company and Parent file a notification and report form with the FTC and the Antitrust Division of the Department of Justice, or the DOJ, under the HSR Act and the applicable waiting period has expired or been terminated. The Company and Parent have filed such notification and report forms on November 19, 2009 and each has requested early termination of the waiting period. The FTC has not yet notified the parties whether their request for early termination of the applicable waiting period has been granted., 428080=closing market share price to estimated earnings (P/E) ratios, as adjusted to exclude one-time expenses, for calendar years 2009 and 2010; and, 738721=Based on the executives\u0092 compensation levels as of December 31, 2009 and reasonable actuarial assumptions and assuming that the merger is completed on February 26, 2010 and the executive experiences a qualifying termination immediately thereafter, the actuarial present value of the increased benefits under the above retirement plans for each Messrs. Carlucci, Pajot, Knightly, Ms. Katz and six other executive officers (as a group) is $4,372,183, $1,713,180, $846,949, $717,173 and $2,553,808, respectively., 643558=The estimated future cash flow for each of the scenarios was based on the financial forecasts for the Company for the years 2010 through 2013 as prepared by the Company\u0092s management. For its calculations, Deutsche Bank used discount rates ranging from 9.5% to 10.5%. The discount rates applicable to the Company were based on Deutsche Bank\u0092s judgment of the estimated weighted average cost of the Company\u0092s capital. The terminal value of the Company was calculated using perpetuity growth rates ranging from 2.5% to 3.5%., 112939=Pursuant to a limited guarantee delivered by the guarantors in favor of the Company, dated November 5, 2009, the guarantors have agreed to guarantee the performance and discharge of certain obligations of Parent and Merger Sub under the merger agreement, including the obligation to pay a termination fee of $275 million to the Company, as and when due. See \u0093The Merger Agreement\u0097Termination Fees\u0094 beginning on page [\u0097]., 706202=Pursuant to a limited guarantee delivered by the guarantors in favor of the Company, dated November 5, 2009, the guarantors have agreed to guarantee, severally but not jointly, the due and punctual performance and discharge of (a) the obligations of Parent and Merger Sub under the merger agreement to pay a termination fee of $275 million to the Company, as and when due and (b) (i) the direct expenses incurred by Parent or Merger Sub in connection with the arrangement of the financing of the merger and (ii) the obligations of Parent and Merger Sub under the merger agreement to reimburse the Company for expenses incurred by the Company or its subsidiaries, including half of the expenses in connection with the filing, printing and mailing of this proxy statement, and the cooperation of the Company and its subsidiaries with respect to the arrangement of the financing of the merger, which direct expenses and reimbursement obligations shall not in the aggregate exceed $6 million. See \u0093The Merger Agreement\u0097Termination Fees\u0094 beginning on page [\u0097]., 596696=the ratio of common equity market prices per share to estimated 2011 earnings per share, which we refer to as Price Per Share to 2011E EPS., 961711=The common stock is listed for trading on the NYSE under the symbol \u0093RX\u0094. The table below shows, for the periods indicated, the price range of the common stock, as reported by Bloomberg L.P., and the dividends per share declared during each of the calendar quarters of 2007, 2008 and 2009., 1119660=satisfied or waived of the conditions set forth in Article VII (other than those conditions that by their nature are to be satisfied at the Closing, but subject to the fulfillment or waiver of those conditions) shall be satisfied or waived in accordance with this Agreement. Notwithstanding the immediately preceding sentence, if the Marketing Period has not ended at the time of the satisfaction or waiver of the conditions set forth in Article VII (other than those conditions that by their nature cannot be satisfied until the Closing, but subject to the fulfillment or waiver of those conditions), then the Closing shall occur instead on the date following the satisfaction or waiver of such conditions that is the earliest to occur of (a) any business day before or during the Marketing Period as may be specified by Parent on no less than three business days\u0092 prior notice to the Company and (b) the final day of the Marketing Period, or such other date, time, or place as agreed to in writing by the parties hereto. For purposes of this Agreement, (a) the term \u0093business day\u0094 shall mean any day other than a Saturday or Sunday or a day on which banks are required or authorized to close in the City of New York, (b) the term \u0093Marketing Period\u0094 shall mean the first period of 35 consecutive days after the date of this Agreement, beginning on the later of (i) delivery of the Required Bank Information (together with the authorization letter referred to in Section 6.14(b)(viii)) and (ii) 14 days after the date of the later of the meetings with Moody\u0092s Investor Services and Standard & Poor\u0092s Ratings Group, a division of The McGraw Hill Corporation with respect to the debt facilities contemplated by the Debt Commitment Letter, throughout which (i) Parent shall have the Required Bank Information and (ii) the conditions set forth in Section 7.1 have been satisfied (other than conditions that by their nature can only be satisfied at Closing) and nothing has occurred and no condition exists that would cause any of the conditions set forth in Section 7.2 to fail to be satisfied assuming the Closing were to be scheduled for any time during such 35-day period; provided that the days from and including November 23, 2009 to and including November 27, 2009 shall not be included in determining such 35-day requirement; provided, further, that if the Marketing Period has not ended on or prior to December 18, 2009, the Marketing Period shall commence no earlier than January 5, 2010; provided, further, that if the Company shall in good faith reasonably believe it has delivered the Required Bank Information, it may deliver to Parent a written notice to that effect (stating when it believes it completed such delivery), in which case the Marketing Period shall be deemed to have commenced on the date of such notice unless Parent in good faith reasonably believes the Company has not completed delivery of the Required Bank Information and, within four business days after the delivery of such notice by the Company, delivers a written notice to the Company to that effect (stating with specificity which Required Bank Information the Company has not delivered); and provided, further, that the \u0093Marketing Period\u0094 shall be deemed not to have commenced if, prior to the completion of such 35-day period, any of the following events shall have occurred: (i) PricewaterhouseCoopers LLP shall have withdrawn its audit opinion with respect to any of the financial statements contained in the Company Reports, (ii) the Company shall have publicly announced any intention to restate any material financial information included in the Required Bank Information or that any such restatement is under consideration, in which case the Marketing Period shall be deemed not to commence at the earliest unless and until such restatement has been completed and the Company Reports have been amended or the Company has determined that no restatement shall be required, or (iii) the Company shall have been delinquent in filing any material report with the SEC required under the Exchange Act, in which case the Marketing Period shall be deemed not to commence at the earliest unless and until such delinquency is cured; and provided, further, however, that, notwithstanding any of the foregoing, if the financial statements included in the Required Bank, 317298=On October 31, 2009, representatives of Sullivan & Cromwell sent a draft merger agreement to Bidder B. That same day, representatives of Ropes & Gray sent a revised draft of the merger agreement to representatives of Sullivan & Cromwell., 250703=fax: (415) 743-1503, 784335=Except as provided below, at the effective time, each outstanding performance restricted stock unit will vest and be converted into the right to receive cash equal to the product of (x) the total number of shares of common stock subject to such performance restricted stock unit immediately prior to the effective time assuming target levels of achievement under the respective award agreement and plan and (y) the per share merger consideration, less any applicable withholding taxes. To the extent the payment with respect to performance restricted stock unit awards granted under the LTIP for the 2009-2010 performance cycle payout at a level which is less than the maximum amount available with respect to such awards, the Company will be permitted (subject to Parent\u0092s consent which may not be unreasonably withheld) to implement a mechanism to permit employees to earn up to the maximum amount based on the Company\u0092s actual performance over the remainder of the applicable performance period, with any such amounts only payable in cash. Any performance restricted stock units that are granted after the date the merger agreement was executed and before the effective time will vest pro rata based on the number of months that have elapsed from January 1, 2010 and including the month in which the effective time occurs relative to 24 months., 795963=Pursuant to a limited guarantee delivered by the guarantors in favor of the Company, dated November 5, 2009, the guarantors have agreed, among other things, to guarantee, severally but not jointly, the direct expenses incurred by Parent or Merger Sub in connection with the arrangement of the financing of the merger, which direct expenses and reimbursement obligations, along with certain other reimbursement and payment obligations of Parent and Merger Sub, shall not in the aggregate exceed $6 million. See \u0093The Merger\u0097Limited Guarantee\u0094 beginning on page [\u0097]., 28681=                    , 2010, 397181=Historical Stock Trading Analysis. Foros reviewed the historical trading prices for shares of the common stock for the period started October 17, 2008 and ended November 3, 2009. In addition, Foros analyzed the per share merger consideration to be received pursuant to the merger by holders of shares of the common stock in relation to market prices of shares of the common stock over selected dates and selected periods., 630820=April 2005, 296188=Following negotiations regarding the terms of a form of confidentiality agreement, TPG executed a confidentiality agreement with the Company on October 2, 2009 and Bidder A executed a confidentiality agreement with the Company on October 6, 2009., 291446=On September 18, 2009, a representative of TPG called a representative of Deutsche Bank to indicate that TPG planned to explore with CPPIB its potential participation with TPG as an additional equity investor in any acquisition of the Company that it proposed, and we refer to TPG and CPPIB collectively as the TPG/CPPIB Group., 289744=On September 9, 2009, Mr. Carlucci and Mr. Walsh attended a meeting with TPG representatives to discuss in more detail TPG\u0092s possible interest in a transaction. At this meeting, the TPG representatives indicated that TPG might be willing to offer to acquire the Company at a price between $18.50 and $20.00 in cash per share. This indication was based solely on public information about the Company. The TPG representatives also stated}",
    "lastModified": "Wed, 25 Nov 2009 22:08:21 GMT",
    "textBeforeTable": "  Check the appropriate box: Filed by a Party other than the Registrant  ¨ Filed by the Registrant  x (Rule 14a-101) the Securities Exchange Act of 1934 Proxy Statement Pursuant to Section 14(a) of SCHEDULE 14A Washington, D.C. 20549 SECURITIES AND EXCHANGE COMMISSION UNITED STATES Table of Contents Preliminary Proxy Statement PRELIMINARY PROXY STATEMENT dprem14a.htm 1 PREM14A 20091125170908 ACCESSION NUMBER: 0001193125-09-242621 CONFORMED SUBMISSION TYPE: PREM14A PUBLIC DOCUMENT COUNT: 6 CONFORMED PERIOD OF REPORT: 20100115 FILED AS OF DATE: 20091125 DATE AS OF CHANGE: 20091125 FILER: COMPANY DATA: COMPANY CONFORMED NAME: IMS HEALTH INC CENTRAL INDEX KEY: 0001058083 STANDARD INDUSTRIAL CLASSIFICATION: SERVICES-COMPUTER PROCESSING & DATA PREPARATION [7374] IRS NUMBER: 061506026 STATE OF INCORPORATION: DE FISCAL YEAR END: 1231 FILING VALUES: FORM TYPE: PREM14A SEC ACT: 1934 Act SEC FILE NUMBER: 001-14049 FILM NUMBER: 091209010 BUSINESS ADDRESS: STREET 1: 901 MAIN AVENUE STREET 2: SUITE 612 CITY: NORWALK STATE: CT ZIP: 06851 BUSINESS PHONE: 2038455200 MAIL ADDRESS: STREET 1: 901 MAIN AVENUE STREET 2: SUITE 612 CITY: NORWALK STATE: CT ZIP: 06851 0001193125-09-242621.hdr.sgml : 20091125",
    "textAfterTable": "Table of Contents IMS HEALTH INCORPORATED 901 Main Avenue Norwalk, CT 06851     NOTICE OF SPECIAL MEETING OF STOCKHOLDERS                     , 2010       DATE:                        , 2010 TIME:    PLACE:    ITEMS OF BUSINESS:    1.      To consider and vote on a proposal to adopt the Agreement and Plan of Merger, dated as of November 5, 2009, as it may be amended from time to time, which we refer to as the merger agreement, by and among the Company, Healthcare Technology Holdings, Inc., a Delaware corporation, which we refer to as Parent, and Healthcare Technology Acquisition,",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}