{
    "relation": [
        [
            "Patent application number",
            "20100188294",
            "20110181474",
            "20130069826",
            "20130099974",
            "20140184459",
            "20140210673"
        ],
        [
            "Description",
            "PLANAR ANTENNA - The present invention discloses a planar antenna including a substrate, a ground plane and a feed line. The ground plane is disposed on one side of the substrate. The ground plane includes a hollow portion. The feed line disposed on another side of the substrate and corresponding to the hollow portion for feeding a signal. The present invention also discloses a planar antenna including a substrate, a ground plane and a feed line. The ground plane is disposed on one side of the substrate. The ground plane includes a first hollow portion and a second hollow portion. The feed line is disposed on another side of the substrate and having a first branch feed portion and a second branch feed portion for feeding a signal, and the first branch feed portion and the second branch feed portion are aligned with the first hollow portion and the second hollow portion respectively.",
            "MINIATURE THREE-DIMENSIONAL ANTENNA - Provided is a miniature three-dimensional antenna. The subject matter is particularly a miniature, low-height, and three-dimensional structure single-frequency antenna. In accordance with the preferred embodiment, the antenna includes a radiation member with extended structure, and the radiation member has a first radiation plane and a non-coplanar second radiation plane. One end extended from the first radiation plane forms a radiation bent member by a bending process. Furthermore, the antenna includes a feed member and a ground member which are the structure extended from the radiation member. In particularly, the first radiation plane, the second radiation plane, the radiation bent member, the feed member, and ground member are not coplanar. The three-dimensional structure is featured to provide the low-height structure, and fortify the antenna structure. Moreover, it is easy to apply to significant number of applications through adjustment of members.",
            "SWITCHED BEAM SMART ANTENNA APPARATUS AND RELATED WIRELESS COMMUNICATION CIRCUIT - A switched beam smart antenna apparatus is disclosed including: a first, a second, a third, a fourth, a fifth, a sixth, a seventh, and an eighth beam adjusting elements; a first, a second, a third, and a fourth beam control modules; a first, a second, a third, and a fourth radiation strips positioned within an area surrounded by the first to eighth beam adjusting elements; and a radiation strip control module for selecting either the first and second radiation strips or the third and fourth radiation strips to transmit signals. When the first beam control module conducts the first and second beam adjusting elements, the third beam control module does not conduct the fifth and sixth beam adjusting elements. When the second beam control module conducts the third and fourth beam adjusting elements, the fourth beam control module does not conduct the seventh and eighth beam adjusting elements.",
            "SWITCHED BEAM SMART ANTENNA APPARATUS AND RELATED WIRELESS COMMUNICATION CIRCUIT - A switched beam smart antenna apparatus is disclosed including: a first, a second, a third, and a fourth beam adjusting elements substantially perpendicular to a substrate; a radiation strip positioned within an area surrounded by the first to fourth beam adjusting elements and substantially perpendicular to the substrate; a first beam control module positioned between the first beam adjusting element and the substrate; a second beam control module positioned between the second beam adjusting element and the substrate; a third beam control module positioned between the third beam adjusting element and the substrate; and a fourth beam control module positioned between the fourth beam adjusting element and the substrate. When the first beam control module turns on the first beam adjusting element, at least one of the second through the fourth beam control modules turns off corresponding beam adjusting element.",
            "DUAL BAND ANTENNA - A dual-band antenna, disposed in a substrate, is provided. The dual-band antenna includes: a feeding part and a slot antenna. The feeding part, disposed on a first side of the substrate, is used for feeding electromagnetic signals with a first resonance frequency and a second resonance frequency, wherein the second resonance frequency is substantially equal to twice the first resonance frequency. The slot antenna includes: a rectangular part with two long edges and two short edges, and a funnel part with a bottom edge, a top edge, and two side edges, wherein the bottom edge is shorter than the top edge, and the two side edges are equal in length substantially, the bottom edge of the funnel part is next to a short edge of the rectangular part, and a center line of the slot antenna corresponds to wavelength of the first frequency.",
            "DUAL-BAND ANTENNA OF WIRELESS COMMUNICATION APPARATUS - A dual-band antenna of a wireless communication apparatus includes a first radiation part for receiving or transmitting signals at a first frequency band; a second radiation part for generating a coupling effect together with the first radiation part to receive or transmit signals at a second frequency band having a center frequency lower than a center frequency of the first frequency band, wherein the second radiation part comprises multiple radiation sections, and at least one of the multiple radiation sections is positioned on a first plane; a feeding element for coupling with a signal receiving terminal of the wireless communication apparatus; and a shorting element for coupling with a fixed-voltage region of the wireless communication apparatus. The first radiation part does not physically contact with the second radiation part, and at least a portion of the first radiation part is not positioned on the first plane."
        ],
        [
            "Published",
            "07-29-2010",
            "07-28-2011",
            "03-21-2013",
            "04-25-2013",
            "07-03-2014",
            "07-31-2014"
        ]
    ],
    "pageTitle": "Wang, Zhubei City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/wang-zhubei-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442305991,
    "recordOffset": 442283242,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sy-Been Wang, Zhubei City TW 04-23-2015 CONTROL MODULE OF MULTIMEDIA DEVICE AND METHOD FOR CONTROLLING MULTIMEDIA DEVICE TO GENERATE IMAGE DATA REQUIRED BY DISPLAY MODULE - A control module of a multimedia device for generating display data required by a display module is provided. The control module includes: a signal receiving and analyzing unit, configured to receive a first signal to accordingly generate a pre-boot command, and to receive a second signal to accordingly generate a boot command; and a processor, configured to perform a pre-boot process according to the pre-boot signal to generate the image data, to enter a waiting mode when the pre-boot process is complete, and to exit the waiting mode according to the boot command. The image data is not used to display an image by the display module when the processor remains in the waiting mode. 20150109535 Published Description Patent application number Sung-Wen Wang, Zhubei City TW 05-21-2015 Contact Structure of Semiconductor Device - The invention relates to a contact structure of a semiconductor device. An exemplary structure for a contact structure for a semiconductor device comprises a substrate comprising a major surface and a trench below the major surface; a strained material filling the trench, wherein a lattice constant of the strained material is different from a lattice constant of the substrate; an inter-layer dielectric (ILD) layer having an opening over the strained material, wherein the opening comprises dielectric",
    "textAfterTable": "Patent applications by Sy-Been Wang, Zhubei City TW Te-Chuan Wang, Zhubei City TW Patent application number Description Published 20150143109 Data Decryption Circuit and Associated Method - A data decryption circuit for decrypting a current encrypted data packet is provided. The current encrypted data packet includes a header and a payload. The data decryption circuit includes an operation unit and a decryption calculation unit. The operation unit generates first data according to the header and a pseudo-random number, second data according to a session key and a constant, and length information and start position information of the payload according to the header. The operation unit generates the first data, the second data, the length information and the start position information by executing a program code. The decryption calculation circuit, coupled to the operation unit, generates a decryption key according to the first and second data, retrieves the payload from the current encrypted data packet according to the start position information and the length information, and decrypts the payload by the decryption key. 05-21-2015 Tien-Yen Wang, Zhubei City TW Patent application number Description Published 20140254257 Memory And Memory Managing Method -",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}