{
    "relation": [
        [
            "Payment method",
            "Money order/Cashiers cheque",
            "Loan cheque",
            "Cash in person"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Land-Rover-Range-Rover-NO-RESERVE-/161309685947?pt=US_Cars_Trucks&hash=item258ece78bb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 413652087,
    "recordOffset": 413609160,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45147=2-Year / Unlimited Miles = $ 1095, 45245=3-Year / Unlimited Miles = $ 1295, 40934=This is a super nice 2003 Range Rover Hse with 69,964 Original miles. This Range Rover is equipped with power windows, power mirrors, power sunroof, aftermarket navigation, DVD, Iphone/Ipod connector with video output to the screen. 22” Stormer wheels, Towing package,cold weather package..Heated seats, heated steering wheel, Back up cam..; everything in this car is working properly. The Title is clean and clear as well.  The Autocheck report has been provided for free, scroll down for details.    }",
    "textBeforeTable": "Full Payment Payment details Go to the Gigamoves website Want a personalized quote from one of these transport companies?  Sign in to get free shipping quotes. Shipping Quotes Shipping to: United States, Canada Item Location:Exton, Pennsylvania, United States If your vehicle is near you, just make arrangements with the seller to pick it up. If it's further away, you can either fly or drive to the car's location, or you can hire a shipping service to get it delivered to your door. The seller may have additional options available, so check their description for more information Shipping and handling Seller assumes all responsibility for this listing. AutoCheck Sign In  please sign in now for access to your remaining",
    "textAfterTable": "Full payment is required within 7 days of auction close Vehicle Purchase Protection This vehicle is eligible for up to $50,000 in Vehicle Purchase Protection in the event that you never receive after you have paid for it or sent a refundable deposit. To qualify for Vehicle Purchase Protection you must be the winning bidder or an auction or click the Buy It Now button directly on the eBay site. Additional eligibility may apply. Please refer to the full terms, conditions and restrictions Financing Get Low Monthly Payments on the Vehicle You Always Wanted! Get Pre-approved at RoadLoans.com | Estimate monthly payment Monthly Payment Calculator",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}