{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Personal cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "PayPal Preferred",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Elvis Presley GI Blues NEW Sealed Musical VHS Video Tape | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/ELVIS-PRESLEY-GI-BLUES-NEW-SEALED-MUSICAL-VHS-VIDEO-TAPE-/281331812746?pt=AU_VHS_Tapes&hash=item4180aec98a",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00252-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 418568003,
    "recordOffset": 418527139,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at Hi, All my items are thoroughly checked before being put up for sale. If you are unlucky enough to receive a faulty item you can return it within 30 days of you receiving it. I will refund your purchase costs and also the cost of the return postage. Please notify me before returning your item. Sometimes in the case of a video tape it is simply a matter of adjusting your tracking or rewinding and fast forwarding the tape. I do not want unhappy customers so I am only too happy to refund your money if your purchase is faulty. Please note that I do not refund for items damaged in the mail or change of mind purchases after they have been mailed. Please be 100% sure that what you are buying is what you want. I will answer any questions you may have with complete honesty and as thoroughly as I",
    "textAfterTable": "Seller's payment instructions Hi, Thankyou for shopping at Bills Video World. I am happy to combine your purchases to save on your postage costs. Should you purchase more than one item please wait for an invoice before paying and I will send you an invoice with your items combined at the reduced postage cost. You will pay for the actual postage only with no added extra's. Thankyou Bill Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}