{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "They have many fun outdoor clubs like sailing, hiking, camping, and fishing. These are always great if you love the outdoors!",
            "CSU Channel Islands has many events that take place throughout the week whether its a concert or a movie night. There is always something going on. I love Channel Islands because you can go hiking and the beach is not too far so you can go have a beach day after classes too.",
            "CSUCI has one of my favorite hangouts known as the Freudian Sip which is a nice, little cafe and bakery for coffee in the mornings. They have two Freudian Sips on campus and students always enjoy grabbing a bite before class. There are plenty other hangouts on campus as well.",
            "Dorm life is always a must do. It's always nice meeting new friends and having the dorm life experience. Everyone has a blast living together, learning together, eating together, and studying together.",
            "Channel Islands has an extremely rigorous learning course in every major. One of the hardest courses at Channel Islands is their nursing program. The teachers are great and the student ration is phenomenal because it allows students more one on one time with their professors.",
            "Incoming students should be ready to stay on top of their work and should be able to meet important deadlines. These deadlines must be met in order to participate in certain academic activities. Be prepared and ready to learn!",
            "California State University Channel Islands is very welcoming and introduces their school to be one of the best Universities in California. I would rate it as one of the top colleges because of their brand new library and their small student ratio which helps students engage in learning. CSUCI is calm, peaceful, relaxing, and has a beautiful campus for a great experience."
        ]
    ],
    "pageTitle": "California State University-Channel Islands Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/California-State-University-Channel-Islands/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 893736519,
    "recordOffset": 893680336,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{273226=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 23 out of 25 people found this review useful. 1 person found this inaccurate. 1 of 59 Sarah from Claremont, CA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Financially many of the students do get a lot of help with the fees for the school. In my opinion most of which get most of the help are the local students. Am enjoying being here I could just say it is a dream come true and end with this statement. I mean the staff are just super friendly and the classes are small so you get this feeling that your professor are close. The campus is growing and coming along to be wonderful place. Am learning a lot Professors here tend to give you a feeling of knowing the next day will not be the same. Your learning something new everyday, and it also includes the beginning of the school. It is wonderful that it could be mixed with the material that you are trying to learn. Login to rate or flag the reviews Areli from Oxnard, CA 02/23/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 59",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}