{
    "relation": [
        [
            "Patent application number",
            "20090203627",
            "20120208768",
            "20130150300"
        ],
        [
            "Description",
            "Specific binding sites in collagen for integrins and use thereof - The present invention identified a high affinity binding sequence in collagen type III for the collagen-binding integrin I domains. Provided herein are the methods used to characterize the sequence, the peptides comprising this novel sequence and the use of the peptides in enabling cell adhesion. Also provided herein are methods to identify specific integrin inhibitors, sequences of these inhibitors and their use in inhibiting pathophysiological conditions that may arise due to integrin-collagen interaction.",
            "SPECIFIC BINDING SITES IN COLLAGEN FOR INTEGRINS AND USE THEREOF - The present invention identified a high affinity binding sequence in collagen type III for the collagen-binding integrin I domains. Provided herein are the methods used to characterize the sequence, the peptides comprising this novel sequence and the use of the peptides in enabling cell adhesion. Also provided herein are methods to identify specific integrin inhibitors, sequences of these inhibitors and their use in inhibiting pathophysiological conditions that may arise due to integrin-collagen interaction.",
            "SPECIFIC BINDING SITES IN COLLAGEN FOR INTEGRINS AND USE THEREOF - The present invention identified a high affinity binding sequence in collagen type III for the collagen-binding integrin I domains. Provided herein are the methods used to characterize the sequence, the peptides comprising this novel sequence and the use of the peptides in enabling cell adhesion. Also provided herein are methods to identify specific integrin inhibitors, sequences of these inhibitors and their use in inhibiting pathophysiological conditions that may arise due to integrin-collagen interaction."
        ],
        [
            "Published",
            "08-13-2009",
            "08-16-2012",
            "06-13-2013"
        ]
    ],
    "pageTitle": "Kim, San Francisco - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kim-san-francisco-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 440116607,
    "recordOffset": 440094254,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Jiyeun Kim, San Francisco, CA US 07-09-2015 COMBINATION THERAPY COMPRISING OX40 BINDING AGONISTS AND PD-1 AXIS BINDING ANTAGONISTS - The invention provides compositions and methods for treating cancers. The method comprises administering a PD-1 axis binding antagonist and an OX40 binding agonist. 20150190506 Published Description Patent application number Jeong Kim, San Francisco, CA US 07-16-2015 SECURITY SYSTEM AND METHOD OF PROVIDING SECURITY SERVICE BY USING THE SAME - A security system and a method of providing a security service are provided. The method includes receiving, by a mobile terminal, sensor data from a plurality of sensors included in a first plug-in type sensor module; integrating, by the mobile terminal, the sensor data based on a correlation between pieces of sensor data of the plurality of sensors to generate integrated information; analyzing, based on the integration information, a security situation of a place into which the first plug-in type sensor module is plugged; and providing, by the mobile terminal, a result of the analysis to a user. 20150199894 Published Description Patent application number Jennifer J. Kim, San Francisco, CA US 08-21-2008 Self supporting pet toy - A pet activity toy which includes an attachment, extender and base. The attachment is in the form of, for example, a pet toy for attracting and engaging a pet. The extender is in the form of a flexible wand",
    "textAfterTable": "Patent applications by Jiyeun Kim, San Francisco, CA US Lickteig Kim, San Francisco, CA US Patent application number Description Published 20110059066 PAKs as Modifiers of the CHK Pathway and Methods of Use - Human PAK genes are identified as modulators of the CHK pathway, and thus are therapeutic targets for disorders associated with defective CHK function. Methods for identifying modulators of CHK, comprising screening for agents that modulate the activity of PAK are provided. 03-10-2011 Melissa Kim, San Francisco, CA US Patent application number Description Published 20120297285 Computer-Implemented Systems And Methods For High Resolution Design Template Generation - Systems and methods are provided for generating a high resolution template in response to user controls provided over a network. An edit to a particular template is received over a network, and a template edit record associated with the particular template is stored in a data store. A preview of the particular template is provided using the network, the preview being an approximation of a high resolution version of the particular template that incorporates the received edit. Additional edits to the particular template are received and stored as additional template",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}