{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus are very safe. They have security on the campus for 24 hour.",
            "They have a lot of fun clubs and activities.",
            "Students are friendly and fun to be around",
            "School is expensive. Make sure apply financial aid and lots of scholarships",
            "Go to beach, late night club, movies. Shopping center is right around the corner.",
            "they have chic a fila near the gym which is amazing.",
            "I wont be living in dorm",
            "Not Yet I havent start yet",
            "Read review before you attend PBA because the rule are little strict.",
            "People are very nice and they know who you are. The classroom is small and professor care about you and your work."
        ]
    ],
    "pageTitle": "Palm Beach Atlantic University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Palm-Beach-Atlantic-University-West-Palm-Beach/reviews?_escaped_fragment_=/show/20602",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 889452143,
    "recordOffset": 889393481,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{58543=the dorm life at palm beach atlantic is okay. freshman are required to be in there rooms no later than 11:30 for there room checks. some students do not like the idea of curfew, however, it helped me tremendously. it allowed me to complete more work and gain more sleeping hours. curfew only last for the first semester, but you must achieve over a 2.0 to be exempt from curfew. the people in the dormitories are great, and i mad a lot of new friends my first year., 160824=You will learn from outstanding scholars who also happen to be outstanding men and women of faith. Beyond learning in classrooms with a 13:1 student-to-faculty ratio, your learning will spill out into the world Â? through internships, research and study abroad opportunities., 40633=Because of the size of the classrooms, and the ratio being like 12:1 or 14:1, it creates a more one-on-one experience and the teacher can challenge students individually. So, even if the material being studied isn't rigorous, the teachers will challenge each student to a different capacity that they can handle., 112129=Usually you are only allowed to miss three classes sessions per class before they withdraw you from the class, but certain professors allow more. Also, if your more than five minutes late it counts as an absence. Most professors do offer extra credit but not always. Last, there is workship hours you have to complete which are basically community service hours, 45 hours are due every year in May., 255820=© 2015, Cappex.com, LLC, 222145=Because of the small classes (13:1 teacher to student ratio), the rigor of many of the classes is very challenging. It is doable, but you have to put time and effort into it, just as you would anywhere you go. Make sure you have your priorities right and develop time management. If you get those two things together, you will be able to accomplish anything.}",
    "textBeforeTable": "06/18/2009 Reviewer is A current student here. 34 out of 35 people found this review useful. 1 of 57 Brittany from Saint Cloud, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Bang for the buck The teachers and there willingness to help makes PBAU worth it, you couldn't find a better school. Am enjoying being here The atmosphere here is unlike any other. There are so many activities to participate in and volunteer opportunities. Not only is the school great, there are plenty of fun areas around West Palm Beach that are right next to the school! Am learning a lot The classes are great, they're set up in a way that is easy for you to learn and get the full hands-on experience. I'm learning more than I did in high school and every teacher is out to help. Don't be afraid to ask any questions! Login to rate or flag the reviews Student from West Palm Beach, FL 07/19/2011 Reviewer is A current student here. 6 out of 6 people found this review useful. 3 of 57 Categories Comments Great",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}