{
    "relation": [
        [
            "Item",
            "[Hard Khorium Battlefists]",
            "[Sunblessed Gauntlets]"
        ],
        [
            "Alliance",
            "Darkrimson, Delmore, Mandorallen",
            "Mandorallen"
        ],
        [
            "Horde",
            "Nail",
            "Nail"
        ]
    ],
    "pageTitle": "Server:Silvermoon US/Master Crafters - WoWWiki - Your guide to the World of Warcraft",
    "title": "",
    "url": "http://wowwiki.wikia.com/Server:Silvermoon_US/Master_Crafters",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00280-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 262257307,
    "recordOffset": 262221508,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Tue, 24 Mar 2015 19:17:36 GMT",
    "textBeforeTable": "BootsEdit EnchantingEdit For purpose of size, recipes which can be obtained by faction reward, bought by vendor, and Uncommon quality have not been listed. All patterns which create Bind on Equip items from Burning Crusade have been listed. Sunwell crafted items are listed separately at the very bottom. Feel free to add yourself to the list and try to keep your name in alphabetical order. The following is a listing of High End Crafting for the server Silvermoon US (PvE). This is a community maintained page and does not represent official World of Warcraft history or occurrences. Information and events here are for community documentation of server particulars, history, or opinion. This article is a realm page for the Silvermoon US realm (server) [show] Contents",
    "textAfterTable": "[Fortitude] Andii, Celine, Coro, Myrael, Rossa, Rozzel, Selica, Snipeshot, Snowfallen Blackbully, Ehapah, Eletrik, Gaumata, Infarction, Meleria, Naranjar, Sumatran, Tsain, Walrustipper, Gahage [Surefooted] Bulger, Rozzel, Sagena Blackbully, Tsain, Grundar, Ehapah, Gahage [Vitality] Aurie, Rossa, Selica, Snipeshot Ehapah, Esta, Genmata, Eletrik, Drazen, Sumatran, Twysted [Greater Assault] Rossa Eyera, Gahage [Tuskarr's Vitality] Rossa Eyera, Gahage BracerEdit Item",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}