{
    "relation": [
        [
            "NPC",
            "Alpin",
            "Arzhela",
            "Briana",
            "Buchanan",
            "Glewyas",
            "Sinead",
            "Lennox",
            "Armory Manager",
            "Aineah"
        ],
        [
            "Occupation",
            "Gardener",
            "Librarian",
            "Music Seller",
            "Bookstore Keeper",
            "Chef/Kitchen Dungeon Keeper",
            "Secretary",
            "Senior Royal Alchemist",
            "Armory Manager",
            "Maid"
        ],
        [
            "Location",
            "Tara Rath Castle Garden",
            "Library, Great Hall",
            "Music Room",
            "Tara Rath Castle",
            "Kitchen, Basement",
            "Reception Room",
            "First room to the right on floor 1 (basement)",
            "Armory Room, Basement",
            "Great Hall"
        ]
    ],
    "pageTitle": "NPCs - Mabinogi World Wiki",
    "title": "",
    "url": "http://wiki.mabinogiworld.com/index.php?title=NPCs",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 266557191,
    "recordOffset": 266521953,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 13 May 2015 05:53:33 GMT",
    "textBeforeTable": "Soul Stream Some mainstream NPCs can be met by a player who has not yet done or has completed the appropriate mainstream story. This is usually done with the assistance of another player who has already gained access to these NPCs or joining the party of a player doing a mainstream quest. However, this does not make them generally accessible NPCs, they are still considered mainstream NPCs as someone had to do the appropriate mainstream story to initially gain access and these NPCs main function is to be part of that mainstream story. This page does not list NPCs that only appear during events, see Category:Event NPCs instead. These are generally accessible NPCs a player can meet without having to do the mainstream story or associated side quests. General NPCs By developing greater intimacy with NPCs, meeting specific requirements, or progressing through the Mainstream Quests, players can obtain these RP items. Some NPCs have retained memorable moments in their lives in the form of treasured commonplace objects, like a locket or a dagger. These RP (role-play) items are activated once dropped on the altar of specific dungeons, allowing a player to relive the past in the NPC's viewpoint. Some accounts of NPCs' memories will differ from the viewpoint of others. Role-Playing Intimacy Chart",
    "textAfterTable": "Deian Shepherd Grassland Dilys Healer Healer's House Duncan Chief of Tir Chonaill Chief's House (Outside) Endelyon Priestess Church (Outside) Ferghus Blacksmith and Weapons Dealer Blacksmith Shop Goro Arena Keeper Alby Arena Foyer Lassar Magic Teacher School (Inside) Malcolm Storekeeper General Shop Meven Tir Chonaill's Head Priest Church",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}