{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "1,077,287",
            "741,896",
            "278,855",
            "213,212",
            "65,641",
            "12,884",
            "1,702,684"
        ],
        [
            "Congregations",
            "2,102",
            "109",
            "288",
            "296",
            "211",
            "25",
            "-"
        ]
    ],
    "pageTitle": "Taylor Lake Village, Texas (TX 77586) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Taylor-Lake-Village-Texas.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00215-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 366342107,
    "recordOffset": 366218050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{164579=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!, 5280=Educational Attainment (%) in 2013, 1185=2008 Presidential Elections Results, 4882=School Enrollment by Level of School (%) in 2013, 13507=Sulfur Dioxide (SO2) [ppb] level in 2012 was 0.706. This is significantly better than average. Closest monitor was 2.3 miles away from the city center., 615=Graphs represent county-level data. Detailed 2008 Election Results, 12760=Ozone [ppb] level in 2012 was 26.5. This is better than average. Closest monitor was 2.3 miles away from the city center., 15631=Air Quality Index (AQI) level in 2012 was 133. This is significantly worse than average., 27163=On 11/21/1992, a category F4 (max. wind speeds 207-260 mph) tornado 17.3 miles away from the Taylor Lake Village city center injured 16 people and caused between $50,000,000 and $500,000,000 in damages., 14970=Carbon Monoxide (CO) [ppm] level in 2012 was 0.147. This is significantly better than average. Closest monitor was 2.3 miles away from the city center., 2043=1996 Presidential Elections Results, 43031=According to our research of Texas and other state lists there was 1 registered sex offender living in Taylor Lake Village, Texas as of August 04, 2015. The ratio of number of residents in Taylor Lake Village to the number of sex offenders is 3,621 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 14234=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 7.15. This is about average. Closest monitor was 2.3 miles away from the city center., 1471=2004 Presidential Elections Results, 10550=Lead (Pb) [µg/m3] level in 2008 was 0.00590. This is significantly better than average. Closest monitor was 2.3 miles away from the city center., 26863=On 9/12/1961, a category F4 tornado 24.2 miles away from the city center killed 8 people and injured 200 people., 12055=Particulate Matter (PM10) [µg/m3] level in 2012 was 26.0. This is worse than average. Closest monitor was 13.3 miles away from the city center., 11300=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 9.92. This is about average. Closest monitor was 5.7 miles away from the city center., 899=2012 Presidential Elections Results, 1757=2000 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{70224=Total of 3 patent applications in 2008-2015., 71587=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 10602=5.04% of this county's 2011 resident taxpayers lived in other counties in 2010 ($48,713 average adjusted gross income), 12825=4.85% of this county's 2010 resident taxpayers moved to other counties in 2011 ($55,200 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Taylor Lake Village city (based on Harris County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (2%) Electricity (18%) Utility gas (80%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 737 Harris County: 1.88 / 10,000 pop. Texas: 1.47 / 10,000 pop. Number of supercenters and club stores: 41 This county: 0.10 / 10,000 pop. State: 0.14 / 10,000 pop. Number of convenience stores (no gas): 530 Harris County: 1.35 / 10,000 pop. Texas: 1.11 / 10,000 pop. Number of convenience stores (with gas): 1,321 Harris County: 3.38 / 10,000 pop. State: 3.95 / 10,000 pop. Number of full-service restaurants: 2,302 Here: 5.88 / 10,000 pop. State: 6.13 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}