{
    "relation": [
        [
            "Skier",
            "Mandeville, Joshua",
            "Gibson, Kyle"
        ],
        [
            "Team",
            "UCD",
            "UCD"
        ],
        [
            "Score",
            "480.00",
            "60.00"
        ],
        [
            "Points",
            "20.00",
            "10.00"
        ],
        [
            "Plcmt",
            "1",
            "2"
        ]
    ],
    "pageTitle": "UC Davis Spring Opener - National Collegiate Water Ski Association",
    "title": "",
    "url": "http://ncwsa.com/index.php/19-results/34-uc-davis-spring-opener.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00288-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 161475655,
    "recordOffset": 161464331,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1065=Men's Individual were swept by Robert Morris of San Diego State University with a score of 3 at 38 off, 3360 in Tricks, and a jump score of 120 feet.  On the women's side, Western Washington's Jayne Morris swept women's events with a s core of 2 at 32 off, 1690 in tricks, and a jump of 105 feet., 1333=The Western Region opened its Spring 2014 season with a tournament at Bell Acqua in Rio Linda, CA hosted by the Bell Acqua Homeowner's Association.   UC Davis managed to pull out the overall team victory, followed by Cal State Chico and UCLA.  }",
    "lastModified": "Tue, 04 Aug 2015 21:52:26 GMT",
    "textBeforeTable": "Index of Scoring Results Scored with WSTIMS For Windows Version 2.0.1.2 3/15/2014 Master Scorebook Results as of April 6, 2014 18:04 14U046C UC DAVIS SPRING OPENER 14U046C UC DAVIS SPRING OPENER   Congratulations to all skiers for a great tournament.  A special thanks to our tournament officials, parents, alumni, UC Davis Water Ski Team and the Bell Acqua Homeowner's Association whom made this tournament possible.  For a full score book, please click Read More... Men's Individual were swept by Robert Morris of San Diego State University with a score of 3 at 38 off, 3360 in Tricks, and a jump score of 120 feet.  On the women's side, Western Washington's Jayne Morris swept women's events with a s core of 2 at 32 off, 1690 in tricks, and a jump of 105 feet. The Western Region opened its Spring 2014 season with a tournament at Bell Acqua in Rio Linda, CA hosted by the Bell Acqua Homeowner's Association.   UC Davis managed to pull out the overall team victory, followed by Cal State Chico and UCLA.   Western UC Davis Spring Opener National Collegiate Water Ski Association UC Davis Spring Opener Results Home",
    "textAfterTable": "Overall Women A Team Slalom Tricks Jump Overall Men B Team Slalom Tricks Jump Overall Women B Team Slalom Tricks Jump Overall Non Team Skiers   Slalom Tricks Jump Overall Combined Team Results Plcmt Team Name Slalom Plcmt Trick Plcmt Jump Plcmt Total 1 UCD UC Davis 935.0 2 1,000.0 1 640.0 1 2,575.0 2 CSC Cal State Univ Chico 1,120.0 1 710.0 2 225.0 6 2,055.0 3 CLA UCLA 605.0 4 675.0 3 525.0 2 1,805.0 4 ASU Arizona State University 620.0 3 470.0 5 300.0 5 1,390.0 5 SDS San Diego State Univ 410.0 5 545.0 4 390.0 3 1,345.0 6 WWU Western Washington Univ 350.0 6 360.0 6 310.0 4 1,020.0 Return to Index Men A Team Results Plcmt Team Name Slalom Plcmt Trick Plcmt Jump Plcmt Total 1 UCD UC Davis 455.0 2 415.0 1 390.0 2 1,260.0 2 CLA UCLA 385.0 4 410.0 2 415.0 1 1,210.0 3",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}