{
    "relation": [
        [
            "Condition:",
            "Dexterity:",
            "Wood Type:",
            "Neck:"
        ],
        [
            "New: A brand-new, unused, unopened, undamaged item in its original packaging (where packaging is applicable). Packaging should be the same as what is found in a retail store, unless the item is handmade or was packaged by the manufacturer in non-retail packaging, such as an unprinted box or plastic bag. See the seller's listing for full details. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Right Handed",
            "Solid Spruce Top, Spalted Flame Maple Back & Sides",
            "Fretted"
        ],
        [
            "Brand:",
            "MPN:",
            "Style:",
            "String Configuration:"
        ],
        [
            "Kala Ukulele",
            "KA-FMT",
            "Acoustic Tenor Size",
            "4 String"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/KALA-Spalted-Flame-Maple-TENOR-UKULELE-Satin-Solid-Spruce-Top-KA-FMT-NEW-/400295109108?pt=LH_DefaultDomain_0&hash=item5d3372a1f4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417725451,
    "recordOffset": 417678605,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{76585=Thank You for Supporting eBay's #1 REAL Music Store Check us out: http://www.youtube.com/GrassRootsMusicTV GrassRootsMusicStore 1045 Asbury Avenue Ocean City, NJ 08226 (Phone: 609-398-6500)}",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Jun 15, 2012 09:50:15 EDT  Seller assumes all responsibility for this listing. 400295109108 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "                                                               Kala Tenor Ukulele, Acoustic, Solid Spruce Top/Spalted Flame Maple Back and Sides, High Satin Finish,  Model # KA-FMT Includes KALA LOGO TENOR DELUXE HEAVY PADDED UKULELE GIG BAG (pictured)! Ukulele condition: Brand New *At GrassRoots Music Store we like to show you exactly what you are bidding on or buying. The instrument shown in the main listing photo is the exact item that will be shipped to you! Ships new from your Authorized Kala Dealer!       \"A marvelous twist of fate brought us this wonderful batch of spalted, flamed, maple wood for these beautiful ukulele. The amazing spalt patterns in this wood are incredibly intricate. We have paired it",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}