{
    "relation": [
        [
            "Categories",
            "Greek Life",
            "Great for these types of students",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "The greek life has about 30% of the student population in it.",
            "Great school for those interested in dram, or sciences or english.",
            "The dinning hall offers a variety of food choices from meatarian to vegan.",
            "The dorms are all very old most being built over a century ago, so the dorms are small. The social life of dorms seems to be very close.",
            "This school is very small but intensive, you have to be prepared.",
            "Washington is an interesting school that is very small but full of life. The atmosphere there is unique as there are science majors with minors and art and vice versa. The people all know each-other on campus creating a close knit community."
        ]
    ],
    "pageTitle": "Washington College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Washington-College/reviews?_escaped_fragment_=/show/41766",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 902743207,
    "recordOffset": 902692158,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{152710=I am not going to lie, WC is not cheap. When including the tuition, room and board, books, supplies and other things that college needs, it is no joke. However, WC has a very generous financial package just waiting for its top students which covers more than half of tuition! This to me was perfect and totally won me over! What most people do not realize at WC, is that the reason why the tuition is so high is because you pay for something that is truly invaluable at any other College or University. YOU CONTROL YOUR EDUCATION! You get one-on-one time with your Professors, and the Professors know you by first and last name! The student-to-faculty ratio is 12:1. That is priceless. Honestly, you will NEVER see the type of education Washington College students get at any other College in the world. WC is only one of a kind place., 60471=May day is a VERY unusual tradition where students on campus get naked and congregate on midnight of May1st and the following night., 53959=Due to the fact that George Washington gave the college money and the college was named after him, we celebrate his birthday by having a Birthday Ball in February. It is very formal and elegant. Professors and students participate and new students should experience this tradition. It is the biggest event of the year., 83727=At Washington College, to celebrate the last day of classes before Spring finals all the students gather on the hill; when the clock strikes midnight, everyone takes off their clothing and takes a naked lap around the science building. This event is called May Day as it is celebrated on May 1st., 191549=© 2015, Cappex.com, LLC, 148434=May Day. The night of May 1st, people gather around the flag pole, naked, at midnight., 77013=Every year, the college hosts Birthday Ball a themed dance in honor of George Washington's birthday in February. The athletic center is richly decorated and the dance is popular among students and alumni. Past themes include Alice in Wonderland, The Great Gatsby, and the Wizard of Oz., 31971=We celebrate George Washington's birthday ever February with our Birthday Ball; a huge dance., 179987=One unusual tradition is that at Washington College, George Washington's birthday is celebrated. And Washington College goes all out for his birthday. The college also holds a homecoming dance in September. The students at Washington College also participate in May Day. The goose nest and godson dining hall are fun locations on campus. Although it is not on campus, walking to the Chester River is relaxing after a day of classes., 126921=May Day...on the first of May the campus strips down and parades around the campous green, 41168=Every May first we have a mayday celebration on the campus green...but I don't want to give too much away., 70132=May Day... you'll just have to see it for yourself., 54569=We have two events that are very important for all the students: War on the Shore and May Day. When attending the college the students will learn more about them, but these are two events that you would not want to miss., 121881=May Day. That is all that has to be said., 117852=There is a tradition on May 1. The students call it may day and a t eleven o'clock at night some of the students run around the grass naked., 90030=One unusual tradition is May Day where the students take off their clothes and run around the flag pole on the campus green.}",
    "textBeforeTable": "01/08/2010 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 37 Sara from Myersville, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. Washington College Reviews Washington College › Maryland › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Arlvin from Forest Hill, MD 03/31/2011 Reviewer is A current student here. 1 out of 1 people found this review useful. 2 of 37 Categories Comments Great for these types of students Washington College is really great for students who are looking for a small school in a rural area. It is great for students looking to really study in anything. WC has a vast majority of majors that might interest you. Tips for prospective students If you are looking for a small school that has great a great student/teacher ratio Washington College is a great school for that. WC being a liberal arts college are able not only take classes for you intended major, but also classes that you are interested in. Also, who knows you might find something that you are more interested in and decided to study that. I am sure you will not only love the scenery and the school; the people here are very friendly and easy to get along with. If you are interested in looking at Washington College do not just take my word for it. I highly recommend that you",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}