{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There has actually been some assaults the semester I write this, and CSUPD has been very responsive, and is always great about contacting students immediately with any information they have gathered. There are emergency phones all around campus, and a police station on campus as well.",
            "Each your there is a an 'Undie Run', where students jog across campus stripping until they are just in their underwear! There is also Tour de Fat, during which students dress in costume and ride bikes to different restaurants and bars around town.",
            "With access to the rec center, which contains a full gym, pool (with steam room) and rock climbing wall, events on and off campus, and the bus system, your tuition gets you a lot here. Make sure you take advantage of it!",
            "There is always something happening. Concerts on campus, we recently had Mackelmore, learning events, such as financial classes and yoga, and dances are just a few of the programs you can attend here on campus. Each dorm has at least one movie room too, so you can chill out and watch movies even if you can't afford your own television.",
            "CSU tries to offer a lot of diverse options for dining. There are great all you can eat facilities, with different stations such as sandwiches and pasta bowls made to order. There is a Spoons dining hall adaptation as well as express locations where you can grab snack items and pizza slices. The food can range from delicious to sub-par, depending on the day and time you go. Right next to campus there are tons of options as well, including Pizza Casbah and TCBY.",
            "The dorms are a great way to immerse yourself in campus community and each holds tons of events to get rid of stress and have fun. However, each has its own issues! There are party dorms, where loud techno music plays late into the night far past quiet hours. There are invasions of wildlife, including bugs and mice. And then some dorms are just far away from the center of campus, making you slightly socially ostracized.",
            "Colorado State University loves its parties-although it is a dry campus, something is happening every night. However, most students take their work and grades seriously. We are all here for our degrees! As a general rule of thumb, freshmen here party the most then as students mature and take on harder classes they prioritize their GPA.",
            "Don't be afraid to ask for help-if someone does not understand your problem, they can direct you to someone who can. Go to the events you see advertised either in your hall or around campus, they are a great way to meet people. Show your ram pride, if you are living in the dorms, get involved in your hall council or become a dining hall representative, and definitely go to the sports games! You also get access to the recreational center and bus system with your student ID, take advantage of it! Don't be afraid to call your RA for a noise complaint, the dorms here can get a bit rowdy.",
            "Colorado State University has a great community, and often works to provide its students with deals or even freebies for concerts, movies and more so that it's easy to escape the drudgery of homework. The dining halls are great, with tons of options. The only downsides are that advisers (academic/financial/etc.) can sometimes be unhelpful and the dorms can get spiders and mice."
        ]
    ],
    "pageTitle": "Colorado State University-Fort Collins (CSU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Colorado-State-University-Fort-Collins/reviews?_escaped_fragment_=/show/21588",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 225,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00296-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 909820203,
    "recordOffset": 909622187,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{824726=This is my dreaming place to study. I have been there at the beginning of Fall, 2011 as a visitor. I was very interested in the Music Therapy courses and practice there., 54611=*A good time to start classes is 10:00 am. This way the latest you usually stay is 3:00pm and you can sleep in! *Do not take the easiest math course out there. Surprisingly, it is the lowest level math that is more challenging because it is math that was not used in high school. *If big classes aren't your thing, just sit in the front of the class. I came to this school knowing I would be in classes of 200+ students. I found that sitting in the front feels no different than a normal class size. *Be social in your classes. It is vital to have a study group (or at least a study partner), especially when it comes to take-home finals. *Bring a bike and a lock. Although you could walk around campus, a bike makes it 10 times faster (really helpful for procrastinators waiting 'til the last minute to leave for class). Just keep an eye out for those bike cops! *Use your meal swipes! Every week your unused swipes are thrown away and you can usually get by with the smallest plan. *Make friends with your hall mates. They come in handy when boredom strikes or when you need a ride. Getting to know them will also help you out later when picking roommates for your apartment., 436776=At the foothills of the Rockies, 3 miles from campus, is a giant, white letter A on the hillside. This dates back to when CSU was an agricultural school. Each August, there is a tradition where students hike up to the A to repaint it., 1073373=You definitely should apply for scholarships (the more money the better) but as an out-of-state student who's flight costs $1000 round trip every year, the price is tight but not undoable. And if you put a lot of effort into your classes, the price is worth what you learn, as well., 86168=Being a student here has many positives. As a freshman living in Braiden Hall on campus, it is nice being in a central location near a majority of my classes. This allows for more sleeping in and more motivation to go to class. Also as a student there are perks such as getting into sporting events free, riding the bus for free, use of the amazing student recreational center which is brand new as of 2010 and with the addition of a new pool which will be ready in the spring (2011) chance to join any of the diverse clubs and organizations, networking with other college students, many job opportunities, free t-shirts and other small things available on campus, lots of help in anything a person does not understand or wants to learn more about. Also Being located in Fort Collins allows for many fun activities to do outside of school work such as going to Old Town for free concerts, many good restaurants, dance clubs, movie theaters and much more!, 643552=Fantastic. Almost all the dorms have been renovated this year (2012-2013) and they have done a fantastic job. Everyone is nice and all together experiencing the same experiences as you. Staff is friendly, rooms are well made and it is a good experience for all., 216833=Do not wait on filling out fafsa and getting your financial aid stuff in asap! march 1 is the deadline and make it!!! Do not settle on one major you might find something you really like that didn't interest you before. people are friendly but Greek life is not for everyone., 41216=In college most instructors do not take attendance, because the classes are so big; but you should still go to class. I know from experience that sleeping through your 8 am class on Monday morning is very easy and tempting, but I soon learned that it is very hard to catch up on work in college compared to high school. If you miss a class you can’t just go up to your professor and ask what you missed on a certain day, because by the next class you are usually about a chapter behind already. The way some people look at is: if you don’t go to class you are wasting $1000 each semester on just one class. So if you skip all of your classes and party every night your aren’t going to do well in you classes, and will end up dropping out and wasting thousands of dollars. Another tip I have is to study. In most classes your grades come from tests, and there is usually no homework. So if you fail one test, the highest grade you can get will be a B. In you classes your professors just highlight the material that you need to know. They leave it up to you to learn everything that you need to know for the test. I know this from experience, so I have started recommending that people start studying right away, and not wait until the week of your tests to start reviewing what you learned in and out of your classes., 1133186=© 2015, Cappex.com, LLC, 803500=I live in Academic Village so I get most of my meals at RamsHorn. I had to adjust my eating schedule a little bit to fit the open times of the upstairs of the hall, unless you fried food or express you have to eat before 7. This was a little different for someone like me used to dinnertime being 7:30 and beyond. But never fear, Braiden, my favorite dining hall on campus, is open later and a great place for lunch since it is close to classes. Sure dinning hall food gets old after awhile and there is no comparing to home cooked meals but compared to many other schools in the nation we have very little to complain about.}",
    "textBeforeTable": "07/19/2009 Reviewer is A current student here. 47 out of 48 people found this review useful. 1 of 252 Gianna from Pueblo West, CO Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code",
    "textAfterTable": "Tips for prospective students My first tip would be to take college visit. See the campus and the city. This is definitely help make your decision because the campus is so beautiful. Also, look into every major they have. They do have a wide variety of majors, however, they are specialized in certain ones so if you are thinking about one of these then CSU is a great choice. If you decide to come, come with an open mind and an outgoing spirit. Weather you are coming from a near by city or out of state, it is always nice to meet new people. Be open to all types of people and be the one to start a conversation with a stranger. Get involved. Colorado State University has tons of clubs and activities. There is a club for every type of person, Join these. This way, you will meet people that have the same interest as you. Pick to live with someone you have never met before. This way, you are not just hanging out with the same people from high school. Overall, when coming to Colorado State, come with the an accepting attitude and be ready to have a great college experience. Bang for the buck Colorado State is worth every penny. Compared to other colleges, it's tuition is normal as far as price goes. While that can be",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}