{
    "relation": [
        [
            "Job Title",
            "Noetix Lead Consultant",
            "Facilities Coordinator",
            "Corporate Marketing Assistant",
            "Guest Relations Manager",
            "Marketing Program Manager"
        ],
        [
            "Location",
            "United States",
            "Arlington, VA",
            "Los Angeles, CA",
            "Miami, FL",
            "Carrollton, TX"
        ]
    ],
    "pageTitle": "Strategy - Entry Level Jobs, Internships, and Career Overview",
    "title": "",
    "url": "http://www.onedayonejob.com/jobs-internships/strategy/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00214-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 623370875,
    "recordOffset": 623242282,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{316483=Copyright © 2007-2015 One Day, One Job. All rights reserved., 162121=Leo Burnett - Leo Burnett is a Chicago, IL based advertising agency that was founded in 1935 and has one of the most impressive client lists of any agency out there.}",
    "textBeforeTable": "writing video strategy social media sales recruiting promotions product management planner online marketing New York media planner media marketing interactive media human resources food entertainment editorial community management blogging beauty Arizona analyst all employers advertising accounting account management See the complete SheKnows profile SheKnows - SheKnows is a Scottsdale, AZ based “women’s lifestyle media platform” that “allows brands to distribute authentic content and integrated advertising at scale.” Companies with Entry Level Jobs and Internships in Strategy A lot of jobs in marketing strategy are in marketing and advertising agencies, while jobs in business and marketing strategy are in the business management and marketing departments of large businesses. If you’re interested in working in strategy, you need to be a creative thinker and great communicator. You also need a bachelor’s degree in a related field for most positions. Business strategy involves creating and executing plans that are designed to achieve a",
    "textAfterTable": "See all 22 job postings Haberman - Haberman is a Minneapolis, MN based agency of “modern storytellers for pioneers.” They work with \"the leading entrepreneurs, innovators, healers and heroes of our day.\" See the complete Haberman profile account management advertising all employers interactive media marketing media Minnesota strategy Job Title Location Design Intern Minneapolis, MN Public Relations Strategist Minneapolis, MN ELD/SOCIAL STUDIES Colorado Springs, CO INTERVENTIONIST-SPRING CREEK YOUTH SERVICE CENTER Colorado Springs, CO MATH TEACHER-SPRING CREEK YOUTH SERVICES CENTER Colorado Springs, CO See all 28 job postings",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}