{
    "relation": [
        [
            "ID",
            "BO",
            "MPA",
            "STI",
            "ONO",
            "MUO",
            "LIA",
            "BOI",
            "BOI"
        ],
        [
            "Type",
            "NDB",
            "NDB",
            "NDB",
            "NDB",
            "TACAN",
            "VOR",
            "VORTAC",
            "VOT"
        ],
        [
            "Name",
            "Ustik",
            "Meridian",
            "Sturgeon",
            "Ontario",
            "Mountain Home",
            "Liberator",
            "Boise",
            "Boise"
        ],
        [
            "Ch",
            "",
            "",
            "",
            "",
            "087X",
            "",
            "080X",
            ""
        ],
        [
            "Freq",
            "359.00",
            "238.00",
            "333.00",
            "305.00",
            "",
            "114.90",
            "113.30",
            "116.70"
        ],
        [
            "Var",
            "17E",
            "16E",
            "17E",
            "17E",
            "18E",
            "18E",
            "17E",
            ""
        ],
        [
            "Dist",
            "4.5 nm",
            "14.0 nm",
            "36.7 nm",
            "43.7 nm",
            "35.0 nm",
            "40.1 nm",
            "1.5 nm",
            "0.5 nm"
        ]
    ],
    "pageTitle": "Boise Air Terminal / Gowen Field Airport",
    "title": "",
    "url": "http://www.airports-worldwide.com/usa/idaho/boise_air_terminal-gowen_field_idaho.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00196-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 285551567,
    "recordOffset": 285534004,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1083=Gowen Field ANGB primarily refers to the military facilities on the south side of the runways, which includes Air National Guard, Army National Guard, and reserve units of the Army, Navy, and Marine Corps. The field is home to the 124th Wing (124 WG), Idaho Air National Guard, which is made up of two flying squadrons operationally-gained by the Air Combat Command (ACC) and Air Mobility Command (AMC), respectively, and 12 additional support units. The aircraft based at Gowen Field ANGB are the A-10 Thunderbolt II close air support attack aircraft of the 190th Fighter Squadron (190 FS) and C-130 Hercules transport aircraft of the 189th Airlift Squadron (189 AS). The 124 WG is composed of over 1000 military personnel, ranging from full-time Active Guard and Reserve (AGR) and Air Reserve Technicians (ART) to traditional part-time air national guardsmen., 6329=The field was named Gowen Field on July 23, 1941 after 1st Lt Paul R. Gowen (1909â\u0080\u00931938), who was born and raised in Caldwell, attended the University of Idaho, and graduated ninth in his class at West Point in 1933. Gowen was killed instantly in a crash in Panama in July 1938 while piloting a twin-engine B-10 bomber for the Army Air Corps. The right engine failed shortly after take-off from Albrook Field, near Panama City. The other two crew members, navigator and radio operator, survived and crawled from the wreckage with burns., 2202=On January 4, 2008, city officials broke ground for Boise Air Terminal's latest improvement, a new air traffic control tower. As of today the tower is complete and stands 295 feet (90 m) tall, being Idaho's tallest structure and the Pacific Northwest's tallest control tower. It has also been relocated to the south side of the airport in order to control an existing Guard assault strip and a possible new runway south of Gowen Field. The tower will not be in operation for possibly several years however, as the city is waiting for more advanced controlling equipment., 7890=3,185,006 passengers transited Boise Airport in 2008, a 5% decrease over 2007 year's total, ranking 75th among US airports in total passengers., 5570=Between 2003 and 2005, the Boise Airport was remodeled. The airport now features a brand new terminal and an elevated roadway for departures., 7703=In 1926, the first municipal airport in Boise was built on a gravel bed where the Boise State University campus now stands. The first commercial airmail flight in the United States passed through this airfield on April 26, 1926, carried by Varney Airlines. Varney Airlines began operating out of Boise in 1933, later merging with National Air Transport to become United Airlines. With United Airlines able to trace its roots to Varney, United is recognized as the airline that has operated the longest out of Boise, 83 years as of 2009. This airfield also played host to Charles Lindbergh's Spirit of St. Louis on September 4, 1927., 3278=In 2005, over 3 million passengers passed through the Boise airport., 4503=The Boise Airport was ranked fourth in passenger satisfaction in the J.D. Power and Associates 2004 Global Airport Satisfaction Index Study., 3616=For the 12-month period ending April 30, 2007, the airport had 184,023 aircraft operations, an average of 504 per day: 52% general aviation, 23% scheduled commercial, 18% air taxi, 7% military. At that time there were 286 aircraft based at this airport: 58% single-engine, 10% multi-engine, 7% jet, 9% helicopter and 16% military., 7056=The current airport has its origins in 1936 when Boise began buying and leasing land for the airport. By 1938, Boise had the longest runway in the United States at that time, 8,800 feet (2,680 m). The steel hangar for Varney Airlines was moved to the present field in 1939. As the size of aircraft grew, the hangar was no longer able to hold aircraft and was converted into a passenger terminal. It was part of the modern terminal facility until the completion of a new terminal in 2004.}",
    "TableContextTimeStampAfterTable": "{25226=43-34-12.7560N, 31148=, 52.0 ft from runway, 50:1 slope to clear, 25949=2871.00 ft, 34879=116-12-33.3942W, 34714=116-14-33.4152W, 30904=16 ft ant, 600.0 ft from runway, 300 ft right of centerline, 50:1 slope to clear, 35442=43-33-31.1616N, 31900=9763 x 150 ft / 2975.8 x 45.7 m, 4988=116-13-22.3000W/43-33-51.7000N -116.222861/43.564361 (Estimated), 24658=116-14-12.8815W, 73036=    Time Period: 2005-05-02 - 2006-05-01, 9942=3201 Airport Way Suite 1000 Boise, ID 83705, 17433=I B S 05/1973, 5450=2871 ft / 875.08 m (Surveyed), 35280=43-34-12.1213N, 35847=2824.00 ft, 3759=2007-07-05, 16506=1-800-WX-BRIEF LOCAL CALL TO FSS 343-2525., 25791=2830.00 ft, 36007=2858.00 ft, 25390=43-33-30.7952N, 24821=116-12-09.9530W}",
    "textBeforeTable": "Location & QuickFacts The above content comes from Wikipedia and is published under free licenses – click here to read more. On 9 December 1996, Douglas C-47A N75142 of Emery Worldwide crashed on approach to Boise Airport killing both crew. The aircraft was on a cargo flight to Salt Lake City International Airport when the starboard engine caught fire shortly after take-off and the decision was made to return to Boise. Accidents and incidents B Phoenix US Airways B Chicago-Oâ\u0080\u0099Hare, Denver, Los Angeles, San Francisco United Express operated by SkyWest Airlines B Chicago-Oâ\u0080\u0099Hare, Denver United Airlines B Denver, Las Vegas, Oakland, Portland (OR), Phoenix [begins March 12], Reno/Tahoe, Salt Lake City, Seattle/Tacoma, Spokane Southwest Airlines B McCall, Salmon Salmon Air C Lewiston, Portland (OR), Sacramento, San Jose (CA), Seattle/Tacoma, Sun Valley Horizon Air B Denver [seasonal] Frontier Airlines operated by Republic Airlines B Denver [seasonal] Frontier Airlines B Salt Lake City Delta Connection operated by SkyWest Airlines B Minneapolis/St. Paul, Salt Lake City Delta",
    "textAfterTable": "No Control Tower: Yes Lighting Schedule: DUSK-DAWN Beacon Color: Clear-Green (lighted land airport) Landing fee charge: No Sectional chart: Salt Lake City Region: ANM - Northwest Mountain Boundary ARTCC: ZLC - Salt Lake City Tie-in FSS:",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}