{
    "relation": [
        [
            "Timestamp",
            "2009-08-31",
            "2008-05-13",
            "2008-05-12",
            "2007-08-09",
            "2007-08-09",
            "2007-02-16",
            "2007-02-12",
            "2004-08-13",
            "2004-02-24",
            "2002-11-27"
        ],
        [
            "Action",
            "Deleted",
            "Added",
            "Deleted",
            "Added",
            "Deleted",
            "Updated",
            "Added",
            "Updated",
            "Updated",
            "Added"
        ],
        [
            "Category",
            "SYNONYM",
            "DEFINITION",
            "DEFINITION",
            "SYNONYM",
            "SYNONYM",
            "DEFINITION",
            "SYNONYM",
            "DEFINITION",
            "DEFINITION",
            "DEFINITION"
        ],
        [
            "Detail",
            "succinate dehydrogenase complex (ubiquinone) (sensu Bacteria)",
            "The enzyme, located in the plasma membrane, that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration.",
            "The enzyme, located in the plasma membrane, that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration.",
            "succinate dehydrogenase complex (ubiquinone) (sensu Bacteria)",
            "succinate dehydrogenase complex (ubiquinone) (sensu Bacteria)",
            "The enzyme, located in the plasma membrane, that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration.",
            "succinate dehydrogenase complex (ubiquinone) (sensu Bacteria)",
            "The enzyme that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration. As in, but not restricted to, the taxon Bacteria (Bacteria, ncbi_taxonomy_id:2).",
            "The enzyme that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration. As in, but not restricted to, the taxon Eubacteria (Bacteria, ncbi_taxonomy_id:2).",
            "The enzyme that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration. Found in bacteria."
        ]
    ],
    "pageTitle": "GO:0045258 plasma membrane succinate dehydrogenase complex (ubiquinone)",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0045258",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00109-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 415183991,
    "recordOffset": 415160440,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130834=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 130701=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "The use of this term should conform to the following taxon constraints: Taxon Constraints GO:0045258 Wiki Page GONUTS The enzyme, located in the plasma membrane, that catalyzes the oxidation of succinate and ubiquinone to fumarate and ubiquinol; involved in aerobic respiration, repressed in anaerobic respiration. Definition Cellular Component Ontology plasma membrane succinate dehydrogenase complex (ubiquinone) Name GO:0045258 ID Term Information Dataset Web Services P06727 tropomyosin Search for proteins by name or accession: GO:0006915 apoptosis Search for terms by keyword or ID: Term Basket",
    "textAfterTable": "Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels. Child Terms This table lists all terms that are direct descendants (child terms) of GO:0045258: Term has no children Protein Annotation Display ID Mapping",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}