{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Very safe campus. The campus security is constantly patrolling campus, and as a result it's relatively safe for students.",
            "There are a variety of clubs on the university. For example, there is a board game club that goes on every week, and a LAN gaming club that meets once a month. These are fairly enjoyable, and provide opportunities to play games that were harder to play during high school.",
            "Tulsa is an expensive school, but it does offer a $10000 scholarship for many students. This is a good motivator to keep students focusing on getting good grades, which provides a good environment as well.",
            "The University offers a free bike service, which is very helpful when getting to class but it also is fun to take bike rides around campus for fun. Performances on campus are also cheap for students, at $6 per ticket.",
            "The cafeteria isn't especially great, but in comparison to the usual cafeteria food, it's all right. The biggest problem is the price of the meal plan (required for 1st and 2nd year undergrads) which is way too high for the food they are offering. The food around campus is pretty good, though, with most restaurants being in Utica Square or on Cherry Street.",
            "Dorms aren't great, but they are better than normal. The best dorm is clearly LaFortune. John Mabee is all right, and there is a nice commons area that's fun to hang around. Fischer dorms are next to the cafeteria, while the other dorms require about a 5 minute walk.",
            "Everyone I've seen at the university is very focused on getting good grades. There are many opportunities for students to expand inside their area of study; as a computer scientist, there are many programs available to students to allow them to learn specialties inside their area of study.",
            "Make full use of the library while on campus. There are computers and printers that students may use in a large computer lab, which is helpful for saving money on a printer. The books that the library provides are also very helpful, and it's likely that you can find a copy of a textbook for class or electronic materials that can help with subjects through the library's website.",
            "The University of Tulsa is a great university. It offers many opportunities for students outside of class, and the smaller class sizes makes it easier to form relationships with other students and the professors that teach there. Extracurricular programs are also very important and helpful for students at Tulsa, some, like TURC, provide a lot of experience for students and allows then to specialize in something inside their area of study."
        ]
    ],
    "pageTitle": "University of Tulsa (TU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Tulsa/reviews?_escaped_fragment_=/show/56859",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912276171,
    "recordOffset": 912225974,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55182=The dining hall was redone in 2010 and is very chic looking. The food leaves some to be desired though. Options are often limited, though the food is usually pretty good. Chick-fil-A, Subway, Benvenutos, and the Hut offer some different options on the other side of campus and all have delicious food., 190018=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/18/2009 Reviewer is A current student here. 11 out of 12 people found this review useful. 1 person found this inaccurate. 1 of 40 Jacklyn from Tulsa, OK Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else",
    "textAfterTable": "Tips for prospective students Try to talk to people from all over the world! You have a unique opportunity because you will be with people from, in particular, the biggest oil production nations in the world. I learned so much about this industry while I attended TU. Did learn a lot For the program I was in, I learned a lot, but I felt that my education was not well-rounded enough. I liked that I had to take many different subjects, but I felt that my computer science courses were too focused on security and not enough on theory. Login to rate or flag the reviews Faith from Tulsa, OK 01/24/2011 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 40 Categories Comments Great for these types of students TU is really rigorous academically, but its definitely doable. You just have to be able to study. But one of the things I love most about TU is how",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}