{
    "relation": [
        [
            "First Name",
            "Daniel Brendan",
            "Charles Webster",
            "George Winthrop",
            "James",
            "Joseph Garvin",
            "Morris",
            "Charles Thomas",
            "John",
            "William",
            "John T.",
            "John Clarence",
            "Cornelius Erwin",
            "Rudolph John",
            "Colby Edward",
            "Robert Lyman",
            "Charles Lee",
            "James Duarte",
            "Heaton Luse"
        ],
        [
            "Surname",
            "Carroll",
            "Doe",
            "Fish",
            "Fitzpatrick",
            "Hunter",
            "Kirksey",
            "Mehan",
            "Muldoon",
            "Muldoon",
            "O'Neil",
            "Patrick",
            "Righter",
            "Scholz",
            "Slater",
            "Templeton",
            "Tilden",
            "Winston",
            "Wrenn"
        ],
        [
            "College",
            "Stanford University, (also won gold with Australia 12 years earlier)",
            "Stanford University",
            "",
            "Stanford University",
            "",
            "Stanford University, (also won silver in the 100 yard dash & gold in the 4x100 relay)",
            "",
            "",
            "",
            "Santa Clara University",
            "Stanford University",
            "Stanford University",
            "Santa Clara University",
            "",
            "Stanford University, (later became a famous track coach)",
            "",
            "",
            "Stanford University"
        ]
    ],
    "pageTitle": "Rugby Football History",
    "title": "",
    "url": "http://rugbyfootballhistory.com/olympics.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00237-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 193458067,
    "recordOffset": 193430533,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26884=In 1900 the Olympics was a much smaller event than we see today and only three countries entered a rugby team, France, Britain and Germany. Britain sent the Moseley Wanderers to represent them; Germany, was represented by players from FC Frankfurt 1880, and host France entered the Paris club side., 7653=The final was played at Colombes stadium, Paris on 18 May 1924 before 50,000 screeching, drunken Frenchmen who were oblivious to the FOC's public appeal for calm. Paris bookmakers set the odds at twenty to one; the points spread was twenty and no wonder: The French national rugby team was one of the greatest ever assembled, and included on its roster the legendary Adolphe Juarraguy, said to be the fastest rugby player alive. By comparison, most of the American players hadn't touched a rugby ball until six months earlier. The mob packing Colombes Stadium fully expected an easy gold medal for France to open the Paris Olympic Games., 14932=The USA Olympic rugby team arrived in Paris, via England on April 27, 1924, after a 6,000 mile journey by train, bus, ship, and ferry from Oakland, California., 20356=Notable players included Stanford’s Dan Carroll, an Australian gold medallist center who had scored two tries in the 1908 Games. Carroll, now a naturalized US citizen, was the player/coach of the 1920 US team and destined to win another rugby gold in Antwerp., 10454=On Sunday, May 11th , the US pounded Romania 39 to 0 at Colombes Stadium. With Norman at flyhalf, Richard \"Tricky Dick\" Hyland at center, and Jack Patrick at flanker, the US ran rampant through the Romanians, scoring nine tries., 16302=The French Olympic Committee (FOC) had scheduled the rugby event to kick off the 1924 Paris Games, and lowly Romania and the USA were to provide only token opposition for the European Champions, France the team was picked to win the gold medal in grand style., 18125=Later on the forwards dribbled the ball to within 5 yards of the French goal line and when the French forwards fumbled the ball Hunter picked it up and fell over the line for a try which was converted. The shocked onlookers were numbed by an 8 – 0 victory for the United States. The Americans had won the gold medal. The stunned French suggested that the US team tour France, which they did although only sixteen players stayed on. On Sept 19th Lyon: a team representing the SE of France was beaten 26-0. On September 22nd Toulouse a Southern France team was beaten 14-3, On September 25th Bordeaux a SW French team was beaten 6-3 and finally in Paris on Oct 10th a French national team defeated the US 14-5. A gold medal and winning three out of the four follow-up matches, not bad!, 33754=That very same year, 1892, de Coubertin made the first public call to restitute the Olympic Games. The first 'modern' games were held in Athens in 1896 but did not include Rugby. Rugby was added to the Olympic program for the second Olympiad and featured in the games held at Paris in 1900, London in 1908, Antwerp in 1920, and Paris again in 1924., 16029=\"They were looking for a punching bag,\" says 87-year-old Norman Cleaveland, a Stanford All-American halfback of the twenties who was one of the first athletes to respond to the call putout through the press in the Fall of 1923. \"We were told to go to Paris and take our beatings like gentlemen.\" Nevertheless, seven players of the 1920 team together with a host of large American football players making up a 22 man squad, raised $20,000 and headed for England to prepare where they were beaten four times in practice sessions. The coach Charlie Austin was relying on his team's size, speed, stamina, and raw athletic ability to compensate for its technical deficiencies., 38505=The olympics was resurrected in modern times by Baron Pierre de Coubertin, a French educator. He formed the international Olympic committee (IOC) in 1894 and introduced rugby to the second games in 1900., 16459=In September 1923, the U.S. Olympic Committee once again agreed to send an American rugby team to the 1924 Paris Olympics to defend their title., 32170=Rugby Sevens will be included at the 2016 Olympic Games in Rio de Janeiro. An overwhelming vote in favour of inclusion by the International Olympic Committee members at the 121st Session in Copenhagen - Rugby Sevens received 81 'yes' votes to only eight 'no' votes - means that the world's top men's and women's Rugby players will have the opportunity to compete for an Olympic Gold medal, the pinnacle of sporting achievement. Read more on re-instating Rugby to the Olympics, 29648=Morris Kirksey, gold medalist in the sprint relay and silver medallist in the 100 metres on the track in 1920, was a member of the gold medal rugby team in 1920. Kirksey failed by 18 inches (46cm) to beat Charlie Paddock for the sprint gold., 22772=Few Americans know that rugby was played in the early years of modern Olympic competition, let alone that the USA won the last two Olympic rugby gold medals up for grabs. But if the news that an American rugby team brought home Olympic gold medals in 1920 & 1924 comes as a surprise today, it was nothing less than astounding when it last happened eighty years ago. It is all the more astounding knowing that rugby hadn't been played competitively in the U.S. for more than a decade prior to the events. Rugby had been all the rage in California high at the turn of the century, but the sport had died out by the outbreak of World War I. It's no surprise then that the US Olympic committee refused to even fund the trips., 25900=The French national team then played Great Britain represented by Mosley Wanderers RFC beating them 27 - 8. 6000 watched the game, 4,389 of them paying for entry. This was the largest crowd of the 1900 Olympic games., 29785=Daniel Carroll was a member of the Australian gold medal team in 1908, and won another gold for the USA in 1920., 20077=Stanford rugger, Robert L \"Dink\" Templeton, was an Olympic high jumper. Morris Kirksey, another Stanford man, lost the 1920 Olympic gold in the 100 meters by 18 inches to fellow American and world record holder Charles Paddock. Kirksey then added a gold in the 4x100 relay to his silver in the 100. Cal-Berkeley’s Charles L Tilden, Jr was selected captain of the first US Olympic rugby team and served as manager as well., 37249=The Baron was 25 when he visited Rugby School for the first time in 1888. The visit was part of a wider tour of English public schools and the universities of Oxford and Cambridge to learn from the revolutionary Victorians who put sport at the heart of education. His research from the playing fields of England was compiled in LÉducation en Angleterre (1888), in which he noted how “organised sport can create moral and social strength”., 868=The Rugby heroes returned to the Bay Area without much fanfare. Despite the USA's spectacular 1924 Olympic rugby victory, rugby again slipped back into obscurity in the U.S. That astonishes modern observers, but as Charlie Doe points out, the Olympics were \"not such a big deal\" before the advent of television coverage, which today can propel an obscure sport like Olympic hockey into the public consciousness., 13492=The Olympic games of 1924 opened on May 4th with a match between France and Romania. Playing its first fifteen, the French notched a 61 to 3 victory (some say 59-3) over the smaller eastern European team, scoring 13 tries including four by the fine Stade Francais winger Adolphe Jaureguy., 24904=Cornwall, the champion county of the previous season, was chosen by the RFU Committee to represent the United Kingdom and play the Australians who were making their first tour of the UK during 1908/9. The Australians would end the tour with a 25-5-1 record. The decision to choose Cornwall was somewhat controversial, as the Australians had beaten Cornwall 18 - 5 on a previous occasion when ten of the same men were playing; and only three of their fifteen had ever represented England before. As expected, the Cornishmen were defeated even worse than they had been at Camborne some three weeks before, and the Australians took the gold medals, by 32 points to 3., 35054=After his return from his first visit to England, de Coubertin became an active promoter of physical education in general and Rugby Football in particular, which he managed to introduce into several school establishments in Paris, securing the long term future of the Game in the country and as one of the founders of the game in France, he set up the first French schools championship in 1890. He went on playing with his friends in Bois de Boulogne and although there is no information about his Rugby prowess, his knowledge of the Game was well respected by his peers, who elected him to referee the 1892 match between Stade Française and Racing Club de France – now regarded as the inaugural French championship. In April of that year, he was instrumental in bringing Rosslyn Park FC to Paris, to play Stade Français. This was the first time an English Club had played in continental Europe. The French educationalist became one of France's leading promoters of sport in general and Rugby in particular, and as such he played a significant role in the formation of the Union des Sociétés Français de Sports Athlétiques (USFSA) and the development of Rugby in France. He was elected to the IRB Hall of Fame in 2007., 36120=Lord Coe unveiled a plaque at Rugby School in May 2009 commemorating its legendary Head Master, Thomas Arnold, as an important inspiration behind Baron Pierre de Coubertin, the Frenchman who established the modern Olympic Games in Athens in 1896., 33392=In 1925, Baron de Coubertin stepped down as the President of the IOC and his successor, Count Baillet-Latour, did not share the enthusiasm of the founder for Rugby Football. The 1925 Olympic Congress, at which Baillet-Latour was elected as the second IOC President, signalled the beginning of a drive against team sports and despite the vigorous protestations of the Dutch students keen to have Rugby in the programme of the 9th Olympic Games in Amsterdam, Rugby was dropped from the Olympic programme - even though rugby had sold more tickets than the track and field events celebrated in the movie about the 1924 Olympics, \"Chariots of Fire.\" Rugby was never again part of the Olympic Games, though its American Football cousin appeared as a demonstration sport at the 1932 Olympics in Los Angeles. It was the last time an oval ball featured in the Olympic Games, though a Pre-Olympic Rugby tournament involving France, Germany, Italy and Romania was held in Berlin before the 1936 Olympics., 23474=Note the name D.B.Carroll from Sidney who played for Australia, he later immigrated to the US following a tour in 1912 and then played for them as the captain/coach in the 1920 Olympics and therefore won two gold medals for two different countries. he also coached the 1924 USA side., 21355=A movement to send an Olympic rugby team to represent the US in Antwerp started after an undefeated Cal-Berkeley tour to British Columbia in 1920. The US Olympic committee (USOC) sanctioned an All American side, on condition that the enterprise be underwritten by the California Rugby Union (CRU) and the chosen players. Selection to the team was left to the California RU and its president, W Harry Maloney since US rugby was heavily concentrated in the California area.}",
    "TableContextTimeStampAfterTable": "{5170=Note: The team included two guest players namely Hugo Betting, FV Stuttgart and August Schmierer, Cannstatter-Fussball-Club., 27715=Like on 18 May 1924, the American team wore white V-neck jerseys with the shield of All American Student Rugby, white shorts and white socks with red and blue hoops, while France wore the traditional blue jerseys with white shorts and blue socks., 28228=The sport had previously been played at three Olympic Games; at the second Olympiads in Paris in 1900 where France won the gold, in 1908 in London where the touring Wallabies became Olympic Champions and in 1920 in Antwerp, where the USA managed to defeat France 8-0 to win the first of their Olympic golds., 27104=To mark the 80th anniversary of when rugby was last played in the Olympic Games in front of 50,000 spectators at the Stade Colombes, Paris on 18 May 1924, the International Rugby Board and the Fédération Francaise de Rugby, organisers of the IRB Sevens' Bordeaux event, commemorated the occasion in Bordeaux with an exhibition match., 27975=Rugby was one of 17 sports in the 1924 Olympics, which brought together 3,092 athletes from 44 countries.  The rugby competition started on 4 May 1924, the opening day of the eighth Olympiad, which went on to last nearly three months.}",
    "lastModified": "Sat, 24 May 2014 02:48:46 GMT",
    "textBeforeTable": "USA 1920 Berrurier Raymond Thierry Robert Thiercelin Raoul Soulie Eugène Petiteau (not listed on Olympic website) Pierre Levassuer Robert Lamaigniere Constant Labeyrie Maurice Grenet Forestier Jacques Eluere Alfred Curtet Crabos René Chilo André Castex (not listed on Olympic website) Bruneval (not listed on Olympic website) Jean Bousquet Adolphe René Bordes François Bader Edouard Surname First Name France 1920 Wilson Arthur James Willcocks A. Wedge Thomas Greenfeld Trevaskis J. Tregurtha Nicholas Solomon Bertram Solomon Barney Marshall C.R. Lawrey A. Jose J.T. Jones E.J. Jackett Richard Jackett Edward John",
    "textAfterTable": "James Duarte Winston (did not play) George E. W. Davis (did not play) Matthew Hazeltine (did not play) Colby Slater (did not play) Harold von Schmidt (did not play) Davis M. Wallace (did not play) William Muldoon (did not play) Note: There is some debate as to whether Fitzpatrick actually played or not. USA 1924 First Name Surname C. AUSTIN R. BROWN J. CASHEL P. CLARK Norman CLEAVELAND H. CUNNINGHAM Dudley DE GROOT Robert DEVEREAUX Georges DIXON Charles Webster DOE Linn Markley FARRISH Edward GRAFF C. GRONDONA Joseph Garvin HUNTER Richard Frank HYLAND Caesar MANELLI Charles Thomas MEHAN J. MULDOON William John MULDOON John T. O'NEIL John Clarence PATRICK William Lister ROGERS Rudolph John SCHOLZ Colby Edward SLATER Norman Bernard",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}