{
    "relation": [
        [
            "Published Date",
            "May 5, 2015",
            "Jan 29, 2013",
            "Mar 19, 2008",
            "Apr 6, 2007",
            "Jul 31, 2006"
        ],
        [
            "Version",
            "6 (current)",
            "5",
            "3",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - OMNIPAQUE- iohexol injection, solution",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=442aed6e-6242-4a96-90aa-d988b62d55e8",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 58106479,
    "recordOffset": 58049056,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{99857=Approximately 90% or more of the injected dose is excreted within the first 24 hours, with the peak urine concentrations occurring in the first hour after administration. Plasma and urine iohexol levels indicate that the iohexol body clearance is due primarily to renal clearance. An increase in the dose from 500 mgI/kg to 1500 mgI/kg does not significantly alter the clearance of the drug. The following pharmacokinetic values were observed following the intravenous administration of iohexol (between 500 mgI/kg to 1500 mgI/kg) to 16 adult human subjects: renal clearance—120 (86-162) mL/min; total body clearance—131 (98-165) mL/min; and volume of distribution—165 (108-219) mL/kg., 121549=Transient alterations in vital signs may occur and their significance must be assessed on an individual basis. Those reactions reported in clinical studies with OMNIPAQUE are listed below in decreasing order of occurrence, based on clinical studies of 1531 patients., 72692=Cardiovascular System: Ventricular tachycardia (0.5%), 2:1 heart block (0.5%), hypertension (0.3%), and anemia (0.3%)., 74834=Cardiovascular System: Arrhythmias including PVCs and PACs (2%), angina/chest pain (1%), and hypotension (0.7%). Others including cardiac failure, asystole, bradycardia, tachycardia, and vasovagal reaction were reported with an individual incidence of 0.3% or less. In controlled clinical trials involving 1485 patients, one fatality occurred. A cause and effect relationship between this death and iohexol has not been established., 15653=The recommended oral dosage of OMNIPAQUE diluted to concentrations of 6 mgI/mL to 9 mgI/mL for contrast enhanced computed tomography of the abdomen in adults is 500 mL to 1000 mL. Smaller administered volumes are needed as the concentration of the final solution is increased (see Table below). In conjunction with dilute oral administration, the recommended dosage of OMNIPAQUE 300 administered intravenously is 100 mL to 150 mL. The oral dose is administered about 20 to 40 minutes prior to the intravenous dose and image acquisition.}",
    "TableContextTimeStampAfterTable": "{6845=OMNIPAQUE 350   500 mL in +PLUSPAK™ (polymer bottle), boxes of 10 Pharmacy Bulk Packages   (NDC 0407-1414-25), 6283=OMNIPAQUE 350   500 mL in +PLUSPAK™ (polymer bottle), boxes of 10 Pharmacy Bulk Packages   (NDC 0407-1414-98), 6081=OMNIPAQUE 300   500 mL in +PLUSPAK™ (polymer bottle), boxes of 10 Pharmacy Bulk Packages   (NDC 0407-1413-68), 10475=GE Healthcare NDC 0407-1413-98, 8989=GE Healthcare NDC 0407-1413-68, 8592=© 2015 General Electric Company - All rights reserved., 8537=Revised March 2015 ONC-4J-CORK, 6642=OMNIPAQUE 300   500 mL in +PLUSPAK™ (polymer bottle), boxes of 10 Pharmacy Bulk Packages   (NDC 0407-1413-94)}",
    "textBeforeTable": "Number of versions: 5 OMNIPAQUE- iohexol injection, solution View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(0407-1413, 0407-1414) , RELABEL(0407-1413, 0407-1414) , REPACK(0407-1413, 0407-1414) 545292716 GE Healthcare Shanghai Co., Ltd. Business Operations ID/FEI Address Name Establishment MANUFACTURE(0407-1413, 0407-1414) , RELABEL(0407-1413, 0407-1414) , REPACK(0407-1413, 0407-1414) 988006565 GE Healthcare Ireland Business Operations ID/FEI Address Name Establishment Labeler",
    "textAfterTable": "RxNorm OMNIPAQUE- iohexol injection, solution Out of scope - Out of scope for RxNorm and will not receive RxNorm normal forms. Out of scope information includes radiopharmaceuticals, contrast media, herbals, homeopathics, and food. Drug names that are ambiguous or not compatible with the RxNorm system, such as multivitamins with more than 4,000 characters in their names, are also out of scope. Get Label RSS Feed for this Drug OMNIPAQUE- iohexol injection, solution To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=442aed6e-6242-4a96-90aa-d988b62d55e8 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates and additions to Drug Label information currently shown on this site through its RSS feed. DailyMed will deliver this notification to your desktop, Web browser, or e-mail depending on the RSS Reader you select to use. To view updated drug label links, paste the RSS feed address (URL) shown below into a RSS reader, or use a browser which supports RSS feeds, such as Safari for Mac OS",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}