{
    "relation": [
        [
            "Payment method",
            "",
            "Money Order/Bank cheque",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Ctek M300 25 AMP Marine Battery Charger Pack Deep Cycle 12V 12 Volt Boat | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/CTEK-M300-25-AMP-MARINE-BATTERY-CHARGER-PACK-DEEP-CYCLE-12V-12-VOLT-BOAT-/400347224853",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00123-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416937595,
    "recordOffset": 416888672,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at If an item is considered by the buyer to be faulty by manufacture we suggest first troubleshooting the fault with us in case it is not the item itself but other factors such as installation , or other components not supplied in the purchase but directly related, from there warranty will be honoured as per the manufacturer’s warranty policy , this will vary from manufacturer to manufacturer ( see the manufacturers Australian website for their warranty policy ) , alternatively if inside 30 days of purchase the item can be returned to Autoelecau and once the fault is confirmed will be refunded or replaced ( whichever the buyer prefers ) after 30 days the item can still be sent back to Autoelecau and will be supported by the manufacturers Australian warranty policy only. If the item is wrong sent or not as described a prepaid return label will be sent and ,",
    "textAfterTable": "Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count Current Max Bid:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}