{
    "relation": [
        [
            "Size",
            "Up to 6 in. dia.",
            "6 to 12 in. dia.",
            "12 to 18 in. dia.",
            "18 to 24 in. dia.",
            "24 to 30 in. dia.",
            "30 to 36 in. dia."
        ],
        [
            "Control No.",
            "PPM-001",
            "PPM-002",
            "PPM-003",
            "PPM-004",
            "PPM-005",
            "PPM-006"
        ],
        [
            "Drive Type",
            "Hyd/Pne/Ele",
            "Hyd/Pne/Ele",
            "Hyd/Pne/Ele",
            "Hyd/Pne/Ele",
            "Hyd/Pne/Ele",
            "Hyd/Pne/Ele"
        ],
        [
            "Mount Type",
            "Int/Ext",
            "Int/Exe",
            "Int/Exe",
            "Int/Exe",
            "Int/Exe",
            "Int/Exe"
        ],
        [
            "Qty. Avail.",
            "1",
            "1",
            "1",
            "1",
            "1",
            "1"
        ]
    ],
    "pageTitle": "Portable Machining & Field Machining Equipment List",
    "title": "",
    "url": "http://www.fieldsystems.com/equip",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 447393403,
    "recordOffset": 447376634,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72557=© 2014 Field System Machining Inc, all rights reserved. 720 Schneider Drive, South Elgin IL 60177 TollFree: 800-789-2814 International Telephone: +1-847-468-1313 Fax: 847-468-1847 See Field System Machining Inc, South Elgin, IL on MacRae's Blue Book}",
    "textBeforeTable": "Bottle Boring Machine Applications include deep hole bottle boring to Turbine Rotors and Generator Rotors. Diameters range from 3\" to 18. Lengths are unlimited. 2 Sta Hyd/Ele MM-008 3 ft 5 Sta Hyd/Ele MM-007 5 ft 2 Sta Hyd/Ele MM-006 6 ft 2 Sta Hyd/Ele MM-005 7 ft 5 Sta Hyd/Ele MM-004 8 ft 2 Sta Hyd/Ele MM-003 10 ft 2 Sta Hyd/Ele MM-002 12 ft 2 Sta Hyd/Ele MM-001 17.5 ft Qty. Avail. Mount Type Drive Type Control No. Size 3 Axis (\"X\", \"Y\", \"Z\") Milling Equipment Applications include milling of turbine, generator, and pump casing horizontal joints, sole plates, machinery foundations, and motor bases. Capable of precise milling of surfaces flat & level, and/or drilling over large areas. Also utilized to achieve flatness and parallelism in steel mill applications. Window machining, Bottom Pad machining, Load Cell Seat machining, Feed Roll Nest Seat machining, Table Roll Pocket machining, Shear Knife Block Seat machining, and Mae West Machining.",
    "textAfterTable": "All sizes DHD-01 Deep Hole Drilling Machines Sta 1 All sizes TPM-001 BTA Trepanning System Sta 1 7.5 dia. TPH-001 Trepanning Head 7.5\" diameter Sta 1 Electric Drill Units, Magnetic Base Capable of driving a wide variety of rotary tool bits in any direction. Applications include all types of drilling, reaming, and/or tapping. All drilling equipment is capable of some degree of boring. Size Control No. Drive Type Mount Type Qty. Avail. Large PPPDM-001 Large Lamina boring drilling machines. Ext. 2 Medium PDM-002 Large Lamina boring drilling machine Ext. 2 Small PDM-003 Medium Lamina boring drilling. Ext. 2 3 H.P. PDM-004 Medium Size magnetic base drilling Ext. 8 Electrical Discharge Machine Applications include removal of metal using electrical pulses to disintegrate and flush material from a specified area (hole). Can be performed on broken bolts, sheared keys, etc?. These machines are specially designed for quick, precision excavation of most types of metal, in any position.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}