{
    "relation": [
        [
            "Patent application number",
            "20090007157",
            "20090222480",
            "20090222833",
            "20090222834",
            "20100306376",
            "20110196956"
        ],
        [
            "Description",
            "Mapping Data Sources to a Procedural API - Described are embodiments directed to use of workflows for developing management agents that connect operations of a data source to a procedural API of an application. The management agents include a workflow that corresponds to an operation of a data source. The workflow includes a number of activities that make calls to the procedural API in order to perform the operation of the data source with respect to an object of the application. The use of workflows makes the development of management agents easier and more efficient.",
            "LOCALIZING OBJECTS IN A PROPERTY STORE - Managing data for an object, including managing data in the object itself and alternative data applicable to an object dependent on one or more locales. Locales may refer to languages, geographic locations or other user preferences. A first object is stored. The first object includes a first identifier for the first object and a first plurality of properties. The first plurality of properties includes locale invariant values for the first plurality of properties. One or more localized objects are stored. The localized objects are unique from the first object. The localized objects each include a specification of a locale, a related identifier related to the first identifier, and one or more related properties related to one or more of the properties in the first plurality of properties. The related properties store localized values, including one or more alternatives to the locale invariant values particular to the specified locale.",
            "CODELESS PROVISIONING SYNC RULES - Managing resources. A computing environment may include a resource manager. The resource manager includes programmatic code for managing resources. Expected rule entries are added to an expected rules list. Each of the expected rule entries includes: an indicator used to identify a synchronization rule, a definition of flow type, a specification of an object type in the resource manager to which the synchronization rule applies, a specification of a downstream resource system, a specification of an object type in the downstream resource system to which the synchronization rule applies, a specification of relationship criteria including one or more conditions for linking objects in the resource manager and the downstream resource system, and a specification of attribute flow information. Objects in downstream resource systems can be synchronized with objects in the resource manager based on the expected rule entries in the expected rules list.",
            "CODELESS PROVISIONING - Managing resources. A resource manager includes programmatic code for managing resources in the computing environment. Resources available from resource systems within the computing environment are managed. Methods may include receiving user input indicating one or more of that a new entity should be added to the resource manager, that an entity represented by an entity object of the resource manager should have permissions removed at the resource manager, or that an entity represented by an entity object of the resource manager should have permissions added at the resource manager. In response to receiving user input, events may be generated and objects created or removed from the resource manager for from downstream resource systems. The events may specify workflows that should be executed to perform synchronization between objects at the resource manager and objects at a downstream resource system by adding or changing rules in an expected rules list.",
            "MANAGING USER ACCOUNTS AND GROUPS IN MULTIPLE FORESTS - Methods, systems, and computer program products are provided for managing contact proxies and security proxies in networks that are organized as forests. For instance, contact proxies may be generated to represent user accounts and groups in forests other than the home forests of the user accounts and groups. Security proxy objects may be generated to represent group members (e.g., security principals and groups) in groups in forests other than the home forests of the group members. Furthermore, when both a contact object and a security proxy object exist for a member added to a group, one of the contact object or the security proxy object may be selected to represent the member in the group.",
            "MANAGING USER ACCOUNTS AND GROUPS IN MULTIPLE FORESTS - Methods, systems, and computer program products are provided for managing contact proxies and security proxies in networks that are organized as forests. For instance, contact proxies may be generated to represent user accounts and groups in forests other than the home forests of the user accounts and groups. Security proxy objects may be generated to represent group members (e.g., security principals and groups) in groups in forests other than the home forests of the group members. Furthermore, when both a contact object and a security proxy object exist for a member added to a group, one of the contact object or the security proxy object may be selected to represent the member in the group."
        ],
        [
            "Published",
            "01-01-2009",
            "09-03-2009",
            "09-03-2009",
            "09-03-2009",
            "12-02-2010",
            "08-11-2011"
        ]
    ],
    "pageTitle": "Ward, WA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ward-wa-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00316-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 442258024,
    "recordOffset": 442235875,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Robert D. Ward, Redmond, WA US 08-06-2009 COEXISTENCE TOOLS FOR SYNCHRONIZING PROPERTIES BETWEEN ON-PREMISES CUSTOMER LOCATIONS AND REMOTE HOSTING SERVICES - Coexistence tools are described for synchronizing properties between on-premises customer locations and remote hosting services. These tools may provide methods that send the tools for installation onto on-premises infrastructure located at customer sites, execute the tools to manage the customer infrastructure remotely via a hosted service, and synchronize properties at the customer site with the hosted service. Other methods may include receiving the tools from the hosted service, communicating configuration parameters related to operating the tools, and executing the tools in response to the configuration parameters. The tools may also provide systems that include on-premises servers associated with the customer infrastructure, with the on-premises servers including on-premises coexistence components for maintaining the property at the customer site. These systems may also include administrative servers associated with the hosted service. The administrative servers may include hosted-side coexistence components for maintaining and synchronizing counterparts of the on-premises properties. 20090198835 Published Description Patent application number Robert Charles Ward, Seattle, WA US //]]> BarDraw('2742262',['Patent applications by Richard B. Ward, Redmond, WA US'],[[1,6,2,1,2,1,1]],['2005','2006','2007','2008','2009','2010','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2742262\" align=\"center\"></div> </div> <canvas id=\"bg2742262\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Richard B. Ward, Redmond, WA US</p> <div class=\"bar2742262\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-14-2013</td> <td><a href=\"/patents/app/20130305239\">Catalog-Based Software Component Management</a>",
    "textAfterTable": "Patent applications by Robert D. Ward, Redmond, WA US Simon Ward, Camas, WA US Patent application number Description Published 20090044134 DYNAMIC INTERFACES FOR PRODUCTIVITY APPLICATIONS - Systems, methods, and computer readable media for providing improved user interfaces for productivity applications are provided. In some embodiments, when a user inputs data into a document, the interface can determine what the format is for that data, such as a text format or an image format. The interface can then remove any presented icons, which can be in the form of a toolbar, not useful for the selected data format and provide icons that are useful for the selected data format. The icons provided can be a predetermined set of icons selected by the designer of the user interface or can be a custom set of icons preselected by a user of the interface. 02-12-2009 Simon A. Ward, Camas, WA US Patent application number Description Published 20130073998 AUTHORING CONTENT FOR DIGITAL BOOKS - This disclosure describes systems, methods, and computer program products for authoring content for digital books. In some implementations, a single graphical user interface (GUI) is presented that allows",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}