{
    "relation": [
        [
            "Age",
            "24",
            "25"
        ],
        [
            "Year",
            "1984",
            "1985"
        ],
        [
            "Team",
            "Knoxville-AA",
            "Syracuse-AAA"
        ],
        [
            "W",
            "3",
            "8"
        ],
        [
            "L",
            "2",
            "5"
        ],
        [
            "ERA",
            "1.79",
            "2.07"
        ],
        [
            "G",
            "27",
            "51"
        ],
        [
            "GS",
            "1",
            "0"
        ],
        [
            "IP",
            "55.1",
            "113"
        ],
        [
            "H",
            "37",
            "93"
        ],
        [
            "HR",
            "0",
            "4"
        ],
        [
            "BB",
            "15",
            "21"
        ],
        [
            "SO",
            "30",
            "43"
        ],
        [
            "Notes",
            "4.97 ERA in Det organization",
            "that's a lot of innings"
        ]
    ],
    "pageTitle": "Batter's Box Interactive Magazine - Blue Jays Minor League Register - Pitchers, A-K",
    "title": "",
    "url": "http://www.battersbox.ca/article.php?story=20040125031506999",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 307028303,
    "recordOffset": 307006919,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Gritty left-hander who liked to challenge hitters; unfortunately, at higher levels, the hitters could more than meet the challenge. Briefly called up in 2000 when the Jays had a desperate case of the pitching shorts. Was traded to Cincinnati after the season as part of the deal that brought Steve Parris to Toronto. (You winced just now, didn't you?) Buzz Factor: 4 Clayton Andrews Hitters L-Z. Hitters A-K, Links to Part I: As before, I've divided this into two parts to keep Da Box's server from imploding. Hi. Here, finally, is the second part of what I loftily call the Blue Jays Minor League Register. Here is info on every Blue Jays pitching prospect I could think of, and had data for. Blue Jays Minor League Register - Pitchers, A-K advanced search Search the Box You Be The Manager Trivia Challenge This Day in Baseball Rule 5 Recycled Photo",
    "textAfterTable": "Luis Aquino Buzz Factor: 3 Converted to the bullpen in 1984, Aquino was traded for Juan Beniquez in 1987. He went on to have an eight-year career as a long reliever and spot starter. K/IP ratios much better in the minors than they were in the majors. Age Year Team W L ERA G GS IP H HR BB SO Notes 20 1985 Knoxville-AA 5 7 2.60 50 0 83 58 4 32 82 20 SV Jason Arnold Buzz Factor: 7 To be fair: comparing Arnold to the other Jays' pitching prospects is a bit like comparing apples and oranges, as the other prospects haven't reached Triple-A yet - and, in a small sample size, Arnold's AA numbers are better than anyone else's. But there's nothing good about Arnold's 2003 numbers in Syracuse: his ERA is up, his HR allowed is up, and his K/IP is way down. He could bounce back - with pitchers, you never can tell - but at this point, it looks like he'll have trouble making it to the big league level. Age Year Team W L ERA G GS IP H HR BB SO Notes 24 2003 NewHaven-AA 3 1 1.53 6 6 35.1 18 2 11 33 24 2003 Syracuse-AAA 4 8",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}