{
    "relation": [
        [
            "Patent application number",
            "20120294013",
            "20120300463"
        ],
        [
            "Description",
            "LIGHT MODULE AND OPTICAL LENS FOR THE LIGHT MODULE - A light module includes a light source and an optical lens. The light source emits light to the optical lens. The light source is a single unit and has a parallelizing surface, a first plane, a wave surface, and a second plane in sequence. The light source emits light to the optical lens and through the parallelizing surface, the first plane, the wave surface, and the second plane in sequence to form a parallel linear light.",
            "Miniaturized Laser Emitting Module - A miniaturized laser emitting module includes a substrate, a laser diode and a lens element. The substrate includes an installation channel, the laser diode is installed in the installation channel of the substrate, and the lens element is installed in the installation channel of the substrate in a light-emitting direction of the laser diode. The lens element includes a collimating lens portion being adjacent to the laser diode and an undulating lens portion being distant from the laser diode. The collimating lens portion and the undulating lens portion are mutually connected to form as type of one piece."
        ],
        [
            "Published",
            "11-22-2012",
            "11-29-2012"
        ]
    ],
    "pageTitle": "Liu, Taichung City - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/liu-taichung-city-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443685839,
    "recordOffset": 443650032,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hua-Tang Liu, Taichung City TW 12-06-2012 CROSSED-ROLLER BEARING - A crossed-roller bearing includes an inner ring having a first periphery and a first raceway groove formed on the first periphery, the first raceway groove being provided with a complete first raceway surface and a complete second raceway surface; an outer ring sleeved onto the inner ring and having a second periphery, an insertion hole, and a second raceway groove formed on the second periphery and corresponding to the first raceway groove, the second raceway groove being provided with a third raceway surface and a fourth raceway surface, a receiving space being jointly defined by the first, second, third, and fourth raceway surfaces; and a gasket, the insertion hole running through one of the third and fourth raceway surface to form a breakage therearound; a plurality of rollers mounted in the receiving space to fill the breakge; a gasket mounted in the insertion hole and fills the breakage. 20120308169 Published Description Patent application number Huang-Sheng Liu, Taichung City TW 11-01-2012 BLUE PHASE LIQUID CRYSTAL COMPOSITION AND METHOD FOR FORMING BLUE PHASE LIQUID CRYSTAL - A blue phase liquid crystal composition includes a chiral dopant, a positive liquid crystal component and a negative liquid crystal component. The positive liquid crystal component includes at least one positive liquid crystal material, has a positive dielectric anisotropy and has no blue phase properties with respect to the chiral dopant. In",
    "textAfterTable": "Ivan Liu, Taichung City TW Patent application number Description Published 20100006582 CONTAINER ASSEMBLY - A container assembly includes a first container, a second container, and a connecting unit. The first container has an opening and a rim that defines the opening. The second container has a wall formed with a slit unit. The connecting unit includes an upper hook section hooked removably onto the rim of the first container, a lower hook section extended removably through the slit unit for hooking the wall of the second container onto the lower hook section, and an intermediate section interconnecting the upper hook section and the lower hook section. 01-14-2010 20140022803 SPOTLIGHT DEVICE - A spotlight device includes a support member, a pivot joint mechanism, and a lighting member. The pivot joint mechanism includes a first pivot connection part provided on the support member, and a second pivot connection part connected rotatably to the first pivot connection part. The lighting member includes a base plate on which the second pivot connection part is mounted, a light emitting component mounted on the base plate, and a light directing cap extending from a periphery of the base plate and cooperating with the base plate to define a receiving space. The light emitting component is disposed in the receiving space. 01-23-2014 20140140060 LED BULB - An LED bulb includes a heat dissipating seat, a circuit board, a plurality of LEDs mounted",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}