{
    "relation": [
        [
            "Scott Mimnaugh",
            "Chris Frank",
            "Andy Miller",
            "John Miller",
            "Greg Pearce",
            "Rich Cometta"
        ],
        [
            "TE",
            "DL",
            "QB",
            "DL",
            "OL",
            "OL"
        ],
        [
            "Wyoming",
            "Washington State University",
            "Butler University (IN)",
            "Washburn, Kansas",
            "Western Illinois University",
            "UC Davis"
        ]
    ],
    "pageTitle": "College of the Siskiyous - Football - Eagles Fly On",
    "title": "",
    "url": "http://www.siskiyous.edu/athletics/football/eaglesfly.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00091-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 691269366,
    "recordOffset": 691253736,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9829=College of the Siskiyous, a public community college with one of the most beautiful campuses in California, is recognized for its excellent academic, vocational and athletic programs. Please send any comments or questions about this site to Hostmaster. 800 COLLEGE AVENUE WEED, CALIFORNIA 96094 USA | Phone (530) 938-5555 | Toll Free 1 (888) 397-4339 Copyright © 2015 College of the Siskiyous. All rights reserved. Disclaimer.}",
    "textBeforeTable": "2014 Football - 4 Year College Transfers Be an Eagle Contact Us First Contact Track & Field Softball Baseball Spring Sports Women's Basketball Men's Basketball Winter Sports women's soccer Men's Soccer Cross Country Volleyball Football Fall Sports Athletics Home Athletics Football ALUMNI RECRUITING QUESTIONNAIRE ARCHIVES Records 4 year transfers Current Statistics Coaches schedule / results Roster Football Home Football //--> P7_PMMop('p7PMM_1',1,2,0,-1,0,0,0,1,0,3,1,1,0,0,0);",
    "textAfterTable": "Diamond Pedro OL Montana State University Northern Marcus McCoy DB Upper Iowa University Elias Mensah DL Chadron State University Terrence Bailey DB Henderson State University Michael Everett DB Henderson State University Sam Williams WR Northwest Missouri State Josh Cline DL Southern Oregon University Leroy Arnold FB McPherson College 2013 Jerett Olson OL University of Idaho Donovan Marshall K Southern Utah University Brendan Slaight OL University of North Dakota Kirt Terry-Springs WR New Mexico Highlands University Derek Hurschman DL Upper Iowa University Taylor Palade LB Minot State University Nate Sandstrom OL Chadron State University Philly Cotrell DL",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}