{
    "relation": [
        [
            "Categories",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Do your homework on what you want to major in. I am in the process of changing my major. I am in my second semester there. I should have done my course work first without a major selected.",
            "Wallace is a great school with wonderful teachers. The campus is nice, it is a small college, with a big college feel."
        ]
    ],
    "pageTitle": "George C Wallace State Community College-Dothan Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/George-C-Wallace-State-Community-College-Dothan/reviews?_escaped_fragment_=/show/20994",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 899041827,
    "recordOffset": 899010127,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{40054=Wallace Cafeteria offers a well lit Cafeteria with several vending machines. The atmosphere is more of a social one during the day, but at night it's a great place to do homework. There is also a SubWay that closes at 15:00., 103821=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/11/2009 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 25 Rachael from Dothan, AL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Bang for the buck WCC is definitely worth your money, is you're willing to sacrifice a little bit of course difficulty as compared to a university. The tuition, fees and books total less than half the cost of most universities in Alabama when you consider their tuition, fees, books, housing and meal plans. Some students may shirk away from continuing to live at home for a while after graduation, but if you can cope with it you will save so much money as opposed to going straight to a university. Scholarships are fairly easy to come by; I was awarded two from the college when I first started here. (These two scholarships combined cover ALL of my full time tuition and fees costs and they are not big scholarships. That's how reasonable the cost is!) If you are good at writing essays and score above a 24 or so on the ACT, you can probably get a scholarship or two. Considering the available student activities and social events, free math tutoring, and other features of the college, it is a very good deal and very easy on your wallet. The cost of books is also greatly lessened by the plethora of event boards around campus where students post their used books for sale. Am enjoying being here Despite some cons, I am really enjoying being",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}