{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Its hard to get around without a car, but there are free buses during the weekend that will take you to Port Jefferson (the substitute college town, well quiet port downtown actually) 5 miles away or Smithhaven Mall 3 miles away. As for me, I find myself working in a research lab during the weekends or taking bike trips. Keep in mind, this is a commuter school, so 50% of the people are gone by Friday night.",
            "Campus food is good quality, but my compliments end there. The lines are always too long, food servers are too slow, and most importantly, too expensive. Also, there are not many good options for quality ethnic foods, and Stony Brook lacks a college town to make up for that. Sadly, most people go to 7-11 or Dunkin Donuts nearby to take a break from campus food.",
            "It really depends on where you are. Although most of the dorms are a bit order, they are renovating them. I live in one of the oldest dorms (1970), but I enjoy it because of the community there. Its really what you make of it",
            "Most of my MEC Engineering courses are difficult, but at the same time, they are very useful and applicable. Expect to work hard if you are doing an engineering major.",
            "Decide on your major early and commit to school. Don't think you are going to party and finish (with a good major) in 4 years. Many people come in undecided, take pointless classes, and end up staying additional semesters. Especially engineering, there is no budge for a failed class, as every class builds on top of each other.",
            "I enjoy my time here as a mechanical engineering junior at Stony Brook University. As an out of state student, this was one of the few universities with a low out of state tuition and a great engineering program. I would recommend this college to those who are interested in Math, Physics, Health, and Engineering."
        ]
    ],
    "pageTitle": "Stony Brook University (SBU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Stony-Brook-University/reviews?_escaped_fragment_=/show/104230",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 892193391,
    "recordOffset": 892056971,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23745=Between the middle of July, the Summer before you attend, and the first two weeks of school, you will likely make the mistake of accepting Facebook requests from the presidents of the sororities and fraternities. They will then bombard you with opening weekend party invitations, which at first will seem like fun. Then you will attend one. One of two things will happen: 1. You will enjoy your time, and then be recruited to join one of the sororities/frats. or 2. You will realize what a complete waste of time it is to stand around drinking, wearing revealing clothing, and being hit on by members of the opposite sex (because the Greek system is incredibly heterosexual-not a criticism, just an observation-) who will most likely not remember your name in the morning. The Greek system here is heavily funded by the Undergraduate Student Government, since it attracts a lot of people. Very little of that funding, however, is put to good use. The frats and sororities, which are all off campus and require a cab ride to get to, throw parties in an attempt to create a scandelous image, though the result is merely a stuffy, low-class house party with techno beats and beer tap-stained furniture. These students involved have an obnoxious sense of entitlement to USG funds, and an inflated self-image. College is supposed to be a transitional time from child to adulthood, a time in which you become a responsible adult. What actually happens here is that children go crazy without limitations and take no responsibility for their actions. I don't mean for my review to read like the outline for an after school special. I am not condemning the choices people make, but rather the lack of responsibility that is assumed when making those choices. About once a month, I will go wine tasting in the city, buy my two drink minimum at a comedy club, or go to some of the clubs in the city. However, I am always in good company, I am networking, I am doing things relevant to my major, and still manage to have fun. I subscribe to peoples that will contribute to a positive reputation, as opposed to joining the Greek system which, at Stony Brook, will do very little in contributing to a positive future. The Greek system at SBU provides minimal, temporary escapism. Their events' impermanence and lack of passion for anything specific so transparent that even the students involved with the Greek system will admit to this lack of direction, they just don't care., 688933=Food was extremely overpriced for average food. It's a meal point system where you pay more dollars than the points you get. Also, a california roll can range from 8-13 points/dollars. The system is basically dollars, but they take away about $600 to cover late night dining hours, theft, etc. BUUUT, they just changed the dining system as of Fall 2015., 107223=The academics here are pretty intense, especially as you take higher classes/honors courses. If you want to tackle the higher and especially honors courses from the start (freshman year), you better make sure you have had rigorous training in high school! The science and math courses are especially vigorous. Even the honors chem LAB class was vigorous! If you have an evil TA for 8:30 a.m. chem lab (like I did), you are in for quite a treat. But if you manage your time and make use of the resources on campus (free tutors, quiet study rooms in building, quiet areas of library, office hours, etc.) you will certainly be successful., 67386=Getting together with friends for dinner, participating in game nights, dance classes, going to concerts or the shows of comedians that visit the school and taking trips to the city every opportunity you get will make your college years at Stony fulfilling. After studying long and hard for a midterm, take a day to unwind and enjoy your roommates or friends. Specifically, I enjoy attending the division one basketball games especially as March approaches and games are intense!, 625358=Roth Rogetta is an event on May that students makes boats with only cardboards and duct tapes. It is really fun to enjoy; smaller events happens every day! You will love if you are a party animal., 690957=Stony Brook is filled with friendly students and a 50:50 chance of getting a nice professor. A popular college choice for asian students and commuters. Pretty quite on the weekend if you're the type of person who doesn't make friends and won't have small suite/dorm parties., 564483=The Roth Regatta is an annual event in April where clubs construct boats out of cardboard and duct tape and attempt to sail across Roth Pond. I have participated in this event, and although the lake can be messy it was a lot of fun! Lots of students and faculty go and all clubs can be involved., 528222=There is no traditional meal plan. Everything is priced in the dining hall (pizza, $3.29, soda, $2, etc.) each meal plan also includes a $564 operating expense which further inflates costs. You can expect to pay up to double for meals at SBU as other schools. Selection is moderate, with most items offered most day, lacking sufficient variety. A new dining hall near Roosevelt and Kelly Quads should be open for Fall 2013, hopefully reducing lines and wait times. Food service is available at some locations until 3am., 560898=Wait until September 21st to visit so that you can go on an actual guided tour of the campus., 47024=I completed my first semester here as a transfer student in Spring 2011. The adjustment was quite difficult, especially with over 20,000 students. My class sizes were mainly 250+ students. You need to reach out to your professors and TAs for individualized attention. They are very friendly. Even though the class sizes were huge, I learned a lot., 695238=© 2015, Cappex.com, LLC, 103992=There's a Strawberry Festival every spring where you can buy as many strawberry-related things as you want (jams, pies, cakes, fresh strawberries, etc.) for only $5-$6! Everyone looks forward to this event in April/May.}",
    "textBeforeTable": "12/29/2009 Reviewer is A current student here. 36 out of 37 people found this review useful. 1 of 144 Amamah from Huntington, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. Stony Brook University Reviews Stony Brook University › New York › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Petey 12/29/2009 Reviewer is A current student here. 21 out of 21 people found this review useful. 2 of 144 Categories Comments Great for these types of students Self motivating, relaxed, and unpretentious. SBU isn't a party school, and students do have to work hard to do well, but the campus is a place to have fun as well. Tips for prospective students Don't come to Stony Brook with expectations of a state school experience. The campus is diverse and edifying beyond the limits of the state its in, and will be most rewarding to students who come in with an open mind and who are willing to work with the resources and students on campus. Bang for the buck The resources and experiences available to SBU students are incredible considering how affordable the school is, especially for in-state students. Aside from the classes, there are such places to explore as the Staller Arts Center, which offers a variety of professional and student performances for those on campus to enjoy. Am",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}