{
    "relation": [
        [
            "Patent application number",
            "20120286538",
            "20120286539"
        ],
        [
            "Description",
            "BACK DOOR FOR AUTOMOBILE - The present invention provides a back door for an automobile including an inner panel and an outer panel made of resin. A pair of reinforcement metal plates is disposed on an inner wall of the inner panel at end portions in a left-to-right direction of a space formed between the inner panel and the outer panel integrated together. The reinforcement metal plates each include a damper attachment portion to which a damper-connecting member connected to a damper is attached, and a hinge attachment portion to which a hinge extending toward a car body is fixed.",
            "OUTER PANEL FOR BACK DOOR - The present invention provides an outer panel for a back door that includes a glass-fitted opening and a plurality of guide grooves provided on an outer peripheral edge of the glass-fitted opening. Each of the guide grooves is arranged on opposing left and right sides on the outer peripheral edge and has a shallow groove and either a deep groove or a through hole."
        ],
        [
            "Published",
            "11-15-2012",
            "11-15-2012"
        ]
    ],
    "pageTitle": "Iwabuchi, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/iwabuchi-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436005735,
    "recordOffset": 435978272,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masayoshi Iwabuchi, Chikusei-Shi JP //]]> BarDraw('2559126',['Patent applications by Masaru Iwabuchi, Tokyo JP'],[[1,1,1]],['2008','2010','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2559126\" align=\"center\"></div> </div> <canvas id=\"bg2559126\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Masaru Iwabuchi, Tokyo JP</p> <div class=\"bar2559126\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-31-2011</td> <td><a href=\"/patents/app/20110073914\">SEMICONDUCTOR INTEGRATED CIRCUIT DEVICE</a> - To provide a semiconductor integrated circuit device advantageous against EM and ESD. A plurality of I/O cells; a power wire formed of a plurality of interconnect layers over the above-described I/O cells; a bonding pad formed in an upper layer of the power wire and in a position corresponding to the I/O cell; and lead-out areas capable of electrically coupling the I/O cell to the bonding pad are provided. The above-described power wire includes a first power wire and a second power wire, and the above-described I/O cell includes first elements coupled to the first power wire and second elements coupled to the second power wire. The first element is placed on the first power wire side, and the second element is placed on the second power wire side. The first power wire and the second power wire can allow for a high current due to the interconnect layers over the I/O cells, thus having robustness against EM and ESD.</td> <td>20110073914</td> <tr> </tr> <td>04-15-2010</td> <td><a href=\"/patents/app/20100090252\">SEMICONDUCTOR INTEGRATED CIRCUIT DEVICE</a> - To provide a semiconductor integrated circuit device advantageous against EM and ESD. A plurality of I/O cells; a power",
    "textAfterTable": "Motoaki Iwabuchi, Joetsu-Shi JP Patent application number Description Published 20080290472 SEMICONDUCTOR INTERLAYER-INSULATING FILM FORMING COMPOSITION, PREPARATION METHOD THEREOF, FILM FORMING METHOD, AND SEMICONDUCTOR DEVICE - Provided is a porous-film-forming composition containing silicon-oxide-based fine particles and a polysiloxane compound obtained by hydrolysis and condensation reactions, in the presence of an acid catalyst, of a hydrolyzable silane compound containing at least one tetrafunctional alkoxysilane compound represented by the following formula (1): 11-27-2008 20080292863 SILOXANE POLYMER, PREPARATION METHOD THEREOF, POROUS-FILM FORMING COATING SOLUTION CONTAINING THE POLYMER, POROUS FILM, AND SEMICONDUCTOR DEVICE USING THE POROUS FILM - Provided is a method for preparing a siloxane polymer by hydrolysis and condensation reactions of a hydrolyzable silane compound, which has a step of preparing a salt of a silsesquioxane cage compound represented by the following formula (1): 11-27-2008 Patent applications by Motoaki Iwabuchi, Joetsu-Shi JP Noriyuki Iwabuchi, Miyagi-Gun JP Patent application number Description Published 20110000883 PLASMA PROCESSING APPARATUS, FOCUS RING, AND SUSCEPTOR - A plasma processing apparatus having a focus ring, enables the efficiency of cooling of the focus ring to be greatly improved, while preventing an increase in cost thereof. The plasma",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}