{
    "relation": [
        [
            "",
            "Model Better",
            "RW Better"
        ],
        [
            "h=1",
            "8",
            "2"
        ],
        [
            "h=3",
            "8",
            "1"
        ],
        [
            "h=6",
            "8",
            "0"
        ],
        [
            "h=9",
            "8",
            "0"
        ],
        [
            "h=12",
            "10",
            "0"
        ]
    ],
    "pageTitle": "FRB: The Taylor Rule and Forecast Intervals for Exchange Rates",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/ifdp/2009/963/revision/ifdp963r.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00107-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 433770127,
    "recordOffset": 433716014,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1=Molodtsova and Papell (2009) find strong out-of-sample exchange rate predictability for Taylor rule models even at the short horizon. In our paper, the evidence for exchange rate predictability at short horizons is not very strong. This finding may be a result of some assumptions we have used to simplify our computation. For instance, an -coverage forecast interval in our paper is always constructed using the and quantiles. Alternatively, we can choose quantiles that minimize the length of intervals, given the nominal coverage.22 In addition, the development of more powerful testing methods may also be helpful. The evidence of exchange rate predictability in Molodtsova and Papell (2009) is partly driven by the testing method recently developed by Clark and West (2006, 2007). We acknowledge that whether or not short-horizon results can be improved remains an interesting question, but do not pursue this in the current paper. The purpose of this paper is to show the connection between the exchange rate and economic fundamentals from an interval forecasting perspective. Predictability either at short- or long-horizons will serve this purpose.}",
    "TableContextTimeStampAfterTable": "{310040=West, K. D. (1996) \"Asymptotic Inference About Predictive Ability,\" Econometrica 64, 1067-1084., 305180=Engel, C. and K. D. West (2006) \"Taylor Rules and the Deutschmark-Dollar Real Exchange Rate,\" Journal of Money, Credit and Banking 38(5), 1175-1194., 305844=Giacomini, R. and H. White (2006) \"Tests of Conditional Predictive Ability,\" Econometrica 74, 1545-1578., 302913=Clarida, R., Gali, J. and M. Gertler (1998) \"Monetary Rules in Practice: Some International Evidence,\" European Economic Review 42, 1033-1067., 90718=We believe other issues, such as parameter instability (Rossi, 2005), nonlinearity (Kilian and Taylor, 2003), real time data (Faust, Rogers, and Wright, 2003, Molodtsova, Nikolsko-Rzhevskyy, and Papell, 2008a, 2008b), and model selection (Sarno and Valente, forthcoming) are all contributing to the Meese-Rogoff puzzle. Panel data are also found helpful in detecting exchange rate predictability, especially at long horizons. For instance, see Mark and Sul (2001), Engel, Mark, and West (2007), and Rogoff and Stavrakeva (2008). It would be interesting to incorporate these studies into interval forecasting. We leave these extensions for future research., 301993=Cheung, Y., M. D. Chinn, and A. Pascual (2005) \"Empirical Exchange Rate Models of the Nineties: Are Any Fit to Survive?\" Journal of International Money and Finance 24, 1150-1175., 341029=2.  Email: jian.wang@dal.frb.org Address: Research Department, Federal Reserve Bank of Dallas, 2200 N. Pearl Street, Dallas, TX 75201 Phone: (214) 922-6471. Return to text, 341301=3.  Email: jason.j.wu@frb.gov Address: Board of Governors of the Federal Reserve System, 20th and C Streets, Washington, D.C. 20551 Phone: (202) 452-2556. Return to text, 314=Board of Governors of the Federal Reserve System International Finance Discussion Papers Number 963, March 2009 --- Screen Reader Version*, 5803=Recently, there is a growing strand of literature that uses Taylor rules to model exchange rate determination. Engel and West (2005) derive the exchange rate as a present-value asset price from a Taylor rule model. They also find a positive correlation between the model-based exchange rate and the actual real exchange rate between the US dollar and the Deutschmark (Engel and West, 2006). Mark (2007) examines the role of Taylor-rule fundamentals for exchange rate determination in a model with learning. In his model, agents use least-square learning rules to acquire information about the numerical values of the model's coefficients. He finds that the model is able to capture six major swings of the real Deutschmark-Dollar exchange rate from 1973 to 2005. Molodtsova and Papell (2009) find significant short-term out-of-sample predictability of exchange rates with Taylor-rule fundamentals for 11 out of 12 currencies vis-á-vis the U.S. dollar over the post-Bretton Woods period. Molodtsova, Nikolsko-Rzhevskyy, and Papell (2008a, 2008b) find evidence of out-of-sample predictability for the dollar/mark nominal exchange rate with forecasts based on Taylor rule fundamentals using real-time data, but not revised data. Chinn (forthcoming) also finds that Taylor rule fundamentals do better than other models at the one year horizon. With a present-value asset pricing model as discussed in Engel and West (2005), Chen and Tsang (2009) find that information contained in the cross-country yield curves are useful in predicting exchange rates.}",
    "lastModified": "Mon, 14 Jul 2014 19:25:17 GMT",
    "textBeforeTable": "Table 1.-Panel 2:  Results of Benchmark Taylor Rule Model, Coverage Test Note: –h denotes forecast horizons for monthly data. –For each horizon (h), the first column (Cov.) reports empirical coverages given a nominal coverage of 90%. The second column (Leng.) reports the length of forecast intervals in terms of percentage change of the exchange rate. Empirical coverages and lengths are averages across N(h) out-of-sample trials. –Superscripts a, b, c in the column of Cov. (Leng.) denote rejections of equal coverage accuracy (equal length) in favor of the economic model at a 10%, 5% and 1% confidence level respectively. Superscripts x, y, z are defined analogously for rejections in favor of the random walk  25.905c  0.855   26.942c  0.900   23.317c  0.912   16.592c  0.923   8.413a  0.919  British Pound  35.008c  0.899   30.780c  0.963   26.553c  0.963   19.655   0.916   9.358c  0.947  Swiss Franc  37.432c  0.834   28.090c  0.820   23.930c  0.874   15.413c  0.860   7.360c  0.839  Swedish Krona  32.092c  0.867   27.086   0.825   23.552c  0.894c  18.758z  0.928   8.580z  0.901  Portuguese Escudo  40.177c  0.959a  30.902c  0.941b  27.458c  0.933   18.615c  0.907   8.726c  0.917  Dutch Guilder  37.728c  0.883   33.793c  0.932   28.451c  0.892   19.762   0.909   9.633z  0.915  Japanese Yen  37.151c  0.874   32.545c  0.846   26.788c  0.910   18.305   0.875   8.291c  0.899  Italian Lira  39.618c  0.969   33.734c  0.960a  27.923c  0.894   18.634c  0.879   8.327c  0.927  Deutschmark  36.883c  0.934   29.924c  0.957   26.007c  0.928c  15.728c",
    "textAfterTable": "Note: In this panel, a better model is the one with more accurate empirical coverages. RW is the abbreviation of Random Walk. Table 1.-Panel 3:  Results of Benchmark Taylor Rule Model, Length Test Given Equal Coverage Accuracy   h=1 h=3 h=6 h=9 h=12 Model Better 8 8 8 8 10 RW Better 2 1 0 0 0 Note: In this panel, a better model is the one with tighter forecast intervals given equal coverage accuracy. Table 1.-Panel 4:  Results of Benchmark Taylor Rule Model, Coverage Test and Length Test Given Equal Coverage Accuracy   h=1 h=3 h=6 h=9 h=12 Model Better 8 8 10 10 11 RW Better 2 1 0 0 1 Note: In this panel, a better model is the one with either more accurate coverages or tighter forecast intervals given equal coverage accuracy. Table 2.-Panel 1:  Results of Benchmark Taylor Rule Model Two   Cov. h=1 Leng. h=1 Cov. h=3 Leng. h=3 Cov. h=6 Leng. h=6 Cov. h=9 Leng. h=9 Cov. h=12 Leng. h=12 Australian Dollar  0.884   7.146y  0.899   15.086c",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}