{
    "relation": [
        [
            "Patent application number",
            "20100288652",
            "20130168244"
        ],
        [
            "Description",
            "APPARATUS AND METHOD OF REGENERATING ELECTROCHEMICAL GAS SENSORS - A method of improving performance of electrochemical gas sensors includes cycling potentials applied to one or more of the electrodes of the respective sensor(s) to improve performance of a different electrode. In a process for treating a reference electrode, potentials can be applied to working and, or counter electrodes so as to modify the environment in the vicinity of the reference electrode. An apparatus can carry out the method automatically.",
            "Carbon Monoxide Sensor with Reduced Hydrogen Cross Sensitivity - A gas sensor in one form comprises a housing including a base and a top defining an interior space. The housing includes a gas entry hole and first and second electrical terminals. First and second electrodes in the housing interior space each comprise a membrane having a layer of platinum black catalyst on one side. The second electrode includes a lower amount of platinum black catalyst than the first electrode. A separator is placed between the first and second electrodes. Current collectors electrically connect the first and second electrodes to the respective first and second electrical terminals whereby sensor current represents concentration of gas while minimizing cross sensitivity."
        ],
        [
            "Published",
            "11-18-2010",
            "07-04-2013"
        ]
    ],
    "pageTitle": "Moran, GB - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/moran-gb-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439014707,
    "recordOffset": 438999052,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Terence Nicholas Moran, Portsmouth GB 05-21-2009 Gas Sample Analysis - A method of determining information about a gas sample includes: 20090127134 Published Description Patent application number Terence N. Moran, Drayton GB 08-21-2008 Instruments Including Tools - A tool has a flange attached to an engine housing. A primary cam is rotated to advance segments into the housing and a second rotational cam causes the segments to turn relative to each other as they are being inserted into the housing. This causes the segments to follow a predetermined path as they extend into the housing to bring a sensor at the end of the segments into a sensing position. 20080199304 Published Description Patent application number Stuart S. Moran, Leeds GB 01-28-2010 CANNULA SEALING APPARATUS - A cannula sealing apparatus includes a housing having a central axially facing aperture. A surgical instrument of 10.5 mm may seal with that aperture. Alternatively, a sealing member having an aperture that will seal with a 12 mm surgical instrument can be swung up to be aligned with the aperture. If a 10.5 mm instrument is required then a seal member can be swung up to have its seal aperture located over the central aperture. Each seal member is pivotal about a common axis. 20100022959 Published Description Patent application number Stuart Moran,",
    "textAfterTable": "Timothy Andrew Moran, Winchester GB Patent application number Description Published 20120005330 Organizing Individual Java Client Request Flows into a Single Server Transaction - An information handling device detects that multiple flows each include a common transaction-specific identifier. The transaction-specific identifier corresponds to a transaction and is generated in response to receiving a request over a computer network. The information handling device, in turn, logs data pertaining to each of the detected plurality of flows in a storage area. When the information handling device identifies a completion of the transaction, the information handling device calculates a total cost of the transaction using the logged data pertaining to each of the plurality of flows. 01-05-2012 20120173721 Organizing Individual Java Client Request Flows Into A Single Server Transaction - Multiple flows each include a common transaction-specific identifier. The transaction-specific identifier corresponds to a transaction and is generated in response to receiving a request over a computer network. In turn, data is logged pertaining to each of the detected plurality of flows in a storage area. Upon identifying a completion of the transaction, a total cost of the transaction is calculated using the logged data pertaining to each of the plurality of flows. 07-05-2012 Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}