{
    "relation": [
        [
            "Project Details",
            "Translation Volume: 2149 words Completed: Sep 2012 Languages: English to Tamil",
            "Translation Volume: 648 words Completed: Sep 2012 Languages: English to Tamil",
            "Translation Volume: 4542 words Completed: Sep 2012 Languages: English to Tamil",
            "Translation Volume: 3748 words Completed: Sep 2012 Languages: English to Tamil",
            "Translation Volume: 780 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1484 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1214 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1690 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 645 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 3149 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1317 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1584 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1279 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1250 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 3933 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 3233 words Completed: Aug 2012 Languages: English to Tamil",
            "Translation Volume: 1250 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 2 hours Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 856 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 1229 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 0 days Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 2007 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 1859 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 881 days Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 5900 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 3467 words Completed: Jul 2012 Languages: English to Tamil",
            "Translation Volume: 369 words Completed: Jun 2012 Languages: English to Tamil",
            "Translation Volume: 1018 words Completed: Jun 2012 Languages: English to Tamil",
            "Translation Volume: 500 words Completed: Jun 2012 Languages: English to Tamil",
            "Translation Volume: 9248 words Completed: May 2012 Languages: English to Tamil",
            "Translation Volume: 1920 words Completed: May 2012 Languages: English to Tamil",
            "Translation Volume: 653 words Completed: May 2012 Languages: English to Tamil",
            "Translation Volume: 1176 words Completed: May 2012 Languages: English to Tamil",
            "Translation Volume: 6388 words Completed: May 2012 Languages: English to Tamil",
            "Translation Volume: 1595 words Completed: May 2012 Languages: English to Tamil",
            "Translation Volume: 1897 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 841 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 650 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 1959 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 2083 words Completed: Apr 2012 Languages:",
            "Translation Volume: 1001 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 14579 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 4904 words Completed: Apr 2012 Languages: English to Tamil",
            "Translation Volume: 2926 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 3672 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 8664 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 10514 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 913 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 3435 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 469 words Completed: Mar 2012 Languages: English to Tamil",
            "Translation Volume: 3491 words Completed: Feb 2012 Languages: English to Tamil",
            "Translation Volume: 7497 words Completed: Feb 2012 Languages: English to Tamil",
            "Translation Volume: 19999 words Completed: Feb 2012 Languages: English to Tamil",
            "Translation Volume: 1000 words Completed: Feb 2012 Languages: English to Tamil",
            "Translation Volume: 745 words Completed: Feb 2012 Languages: English to Tamil",
            "Translation Volume: 1419 words Completed: Feb 2012 Languages: English to Tamil",
            "Translation Volume: 2483 words Completed: Jan 2012 Languages: English to Tamil",
            "Translation Volume: 3150 words Completed: Jan 2012 Languages: English to Tamil",
            "Translation Volume: 764 words Completed: Jan 2012 Languages: English to Tamil",
            "Translation Volume: 4161 words Completed: Jan 2012 Languages: English to Tamil",
            "Translation Volume: 3058 words Completed: Jan 2012 Languages: English to Tamil",
            "Translation Volume: 4417 words Completed: Jan 2012 Languages: English to Tamil",
            "Translation Volume: 1586 words Completed: Dec 2011 Languages: English to Tamil",
            "Translation Volume: 3977 words Completed: Dec 2011 Languages: English to Tamil",
            "Translation Volume: 1063 words Completed: Dec 2011 Languages: English to Tamil",
            "Translation Volume: 4576 words Completed: Dec 2011 Languages: English to Tamil",
            "Translation Volume: 442 words Completed: Dec 2011 Languages: English to Tamil",
            "Translation Volume: 23754 words Completed: Dec 2011 Languages: English to Tamil",
            "Translation Volume: 731 words Completed: Nov 2011 Languages: English to Tamil",
            "Translation Volume: 3013 words Completed: Nov 2011 Languages: English to Tamil",
            "Translation Volume: 7343 words Completed: Nov 2011 Languages: English to Tamil",
            "Translation Volume: 361 words Completed: Oct 2011 Languages: English to Tamil",
            "Translation Volume: 283 words Completed: Oct 2011 Languages: English to Tamil",
            "Translation Volume: 294 words Completed: Oct 2011 Languages: English to Tamil",
            "Translation Volume: 2611 words Completed: Oct 2011 Languages: English to Tamil",
            "Translation Volume: 759 words Completed: Sep 2011 Languages: English to Tamil",
            "Translation Volume: 14268 words Completed: Sep 2011 Languages: English to Tamil",
            "Translation Volume: 1998 words Completed: Sep 2011 Languages: English to Tamil",
            "Translation Volume: 3100 words Completed: Sep 2011 Languages: English to Tamil",
            "Translation Volume: 100801 words Completed: Sep 2011 Languages: English to Tamil",
            "Translation Volume: 146 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 1325 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 729 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 2574 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 7596 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 1637 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 2969 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 667 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 2984 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 727 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 2324 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 24089 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 7237 words Completed: Aug 2011 Languages: English to Tamil",
            "Translation Volume: 147 words Completed: Apr 2011 Languages: English to Tamil",
            "Translation Volume: 85 words Completed: Apr 2011 Languages: English to Tamil",
            "Translation Volume: 75 words Completed: Apr 2011 Languages: English to Tamil",
            "Translation Volume: 84 words Completed: Apr 2011 Languages: English to Tamil",
            "Translation Volume: 5084 words Completed: Apr 2011 Languages: English to Tamil",
            "Translation Volume: 8242 words Completed: Apr 2011 Languages: English to Tamil",
            "Translation Volume: 11027 words Completed: Mar 2011 Languages: English to Tamil",
            "Translation Volume: 2626 words Completed: Mar 2011 Languages: English to Tamil",
            "Translation Volume: 10577 words Completed: Mar 2011 Languages: English to Tamil",
            "Translation Volume: 891 words Completed: Mar 2011 Languages: English to Tamil",
            "Translation Volume: 1382 days Completed: Mar 2011 Languages: English to Tamil",
            "Translation Volume: 21574 words Completed: Feb 2011 Languages: English to Tamil",
            "Translation Volume: 14889 words Completed: Feb 2011 Languages: English to Tamil",
            "Translation Volume: 13215 words Completed: Feb 2011 Languages: English to Tamil",
            "Translation Volume: 55 words Completed: Feb 2011 Languages: English to Tamil",
            "Translation Volume: 162 words Completed: Feb 2011 Languages: English to Tamil",
            "Translation Volume: 1346 words Completed: Feb 2011 Languages: English to Tamil",
            "Translation Volume: 23733 words Completed: Jan 2011 Languages: English to Tamil",
            "Translation Volume: 4844 words Completed: Jan 2011 Languages: English to Tamil"
        ],
        [
            "Project Summary",
            "INFORMED CONSENT TEMPLATE-Protocol Name: AMD PHENOTYPE AND GENOTYPE STUDY AMD PHENOTYPE AND GENOTYPE STUDY Medical: Pharmaceuticals",
            "Testing materials for Tamil / ENGLISH Testing materials for Tamil / ENGLISH Other",
            "Carpentry manual Doors, Locks - Parts, Types, Installation Construction / Civil Engineering",
            "Informed Consent Support Book The study is looking at the effect of an investigational medication on the risk of having a cardiovascular emergency such as a heart attack or stroke in the future. Medical: Pharmaceuticals",
            "Salary, Vehicle Allowance - Instructions Salary, Vehicle Allowance - Instructions Business/Commerce (general)",
            "ANNEXURE 3 - FORCE FIELD ANALYSIS Force Field Analysis (FFA) is useful to develop an analysis and assessment process, which includes the identification of community needs/perceptions, to move from a “real present” situation to a “desirable future” situation. Business/Commerce (general)",
            "ANNEXURE 6 - PLANNING FOR INTERPERSONAL COMMUNICATION ACTIVITIES At the beginning of the Village Planning exercise you would have conducted a survey that would have given you some data on the following areas: • No. of households in the village and the population data – demographic profile. • No. of households with under five children. • No. of households with pregnant women. • No. of households where babies have been delivered within the last three months. • No. of births registered in the village last year and this year. • No. of households with under one “Child Information about Immunization” session in the village. • Immunisation status of the babies in the village. • Information on Pulse Polio activities in the village. • Information on water sources in the village. • No. of children over the age of five going to school – boys/girls. • Whether the village has a primary school, middle school, high school. • How many children have dropped out of primary school – boys/girls. • Whether the village has an anganwadi and whether all the children go to the AWC. • No.of households using iodised salt. • Status of sanitation – whether any households have latrines and if so how many are functional. • How many young people are at present living in the village and their activities – if there are any youth centres, mandals etc. Whether both boys and girls participate in these mandals. • What knowledge do young people have about HIV/AIDs? • Are there any HIV positive people in the village and how does the village treat them? • What is the picture of the minority community in the village and their profile. Surveying",
            "ANNEX 2-STEPS OF “GATHER” AND 6 PRINCIPLES OF EFFECTIVE INTERPERSONAL COMMUNICAT ANNEX 2-STEPS OF “GATHER” AND 6 PRINCIPLES OF EFFECTIVE INTERPERSONAL COMMUNICATION: 1. Greet the community, participants. 2. Ask people about themselves (Haal chaal poochna). 3. Tell people why you have come and what you can offer. 4. Help people in decision-making – do they want to accept what you are offering. If there are choices help them to make a decision. 5. Explain fully the information on their decision. 6. Return to the community to see how things are going and whether anyone has any problems or need any support. Advertising / Public Relations",
            "SESSION 3-Behaviour Change Model – Case Studies. By the end of the session, participants will be able to use the Behaviour Change model in analysing cases and deciding what the most appropriate actions are. Advertising / Public Relations",
            "Facilitators Guidebook-Child Development VIDEO 1 Facilitators Guidebook-Child Development VIDEO 1: Facilitators Guidebook-Child Development VIDEO 1: 1) Know that children's minds develop rapidly when they are interacted with, touched and cuddled, and stimulated. 2) Discussion Questions in Video a) What can we do to ensure children's healthy mental and physical development? b) What factors are important for a child's development? 3) Understand the importance of formal learning, playing, and exploring in the overall development of the child- including intellectual and behavioral. 4) Discussion Questions in Video a) Who can help in a child's successful transition to school? b) How does playing contribute to children's development? 5) HOW TO USE THE GROUP DISCUSSION VIDEOS 6) DURATION AND STRUCTURE 7) RUNNING A SESSION 8) KEY QUESTIONS TO ASK AFTER THE VIDEO: 9) Be able to address the barriers that inhibit equal treatment of those infected with HIV. 10) Discussion Questions in Video a) What prevents us from meeting with, talking to or interacting with people infected with HIV? b) What can we do to support people infected with HIV? Poetry & Literature",
            "Take Away Messages 1) Timing Births 2) Safe Motherhood Poetry & Literature",
            "Areva-Technical Translation SI_Assembly, SI_Compressor, SI_Drilling, SI_EOT Crane, SI_MIG Welding, SI_Plasma_Oxyfuel, SI_Power Hacksaw, SI_Pressbrake, SI_Shearing, WI_Arc Welding, WI_Bandsaw, WI_Drilling, WI_MIG Welding Engineering: Industrial",
            "LabourNet - Self Learning Cards 1) Units of measurements used in Carpentry work 2) Dimensions of Wood 3) Marking Tools 4) Types of Marking Gauge 5) Safety Tools 6) Cutting & Chiseling Tools 7) Finishing Tools 8) Wood Type-Description 9) Woodworking Joints 10) Consumables Furniture / Household Appliances",
            "User-focused research: Case study of sanitation systems in Tamil Nadu, India User-focused research: Case study of sanitation systems in Tamil Nadu, India Social Science, Sociology, Ethics, etc.",
            "Bios Life-Product Information & Compensation Plan Bios Life-Product Information & Compensation Plan Marketing / Market Research",
            "Guy Holden video message to employees & PM Tool Communication Guy Holden video message to employees & PM Tool Communication Human Resources",
            "Cellulite and circumferential reduction by Endermologie It is used for lipolysis and ender- molift. Endermolift offers imme¬diate results, including a healthy glow and a natural, soothing lifting effect. The results are visible in the first sitting itself. It fills up wrin¬kles, refines & redefines contours, regenerate and rejuvenate the cells, removes toxins, restores col¬lagen and youthfulness and clarify the complexion. Cosmetics, Beauty",
            "Consumer Questionairre Review Surveying",
            "ICF A LONG-TERM, OPEN LABEL FOLLOW-UP STUDY OF XXX (CP-690,550) FOR TREATMENT OF RHEUMATOID ARTHRITIS Medical: Pharmaceuticals",
            "Consumer Questionairre Household Survey-Business General Marketing / Market Research",
            "Consumer Questionairre Household Survey-Business General Marketing / Market Research",
            "Product Knowledge-Gifts & Toys 1.Basics of toys 2.Age-wise guide to buying toys 3.Toys:caution required 4.Basics of gifts 5.Classification of gifts Advertising / Public Relations",
            "Associate Handbook 1.Expenses/Assets/Mandatory records/Financial statements/-Documents needed 2.Warehouse Inspection 3.Post site visit 4.Management discussion 5.Report submission 6.Guidelines to complete data capture sheets 7.Do's and Dont's Accounting",
            "Product profile Super Chlorophyll-Product information/Features & benefits/References/Instructions for use/FAQs Marketing / Market Research",
            "Vendor Code of Conduct Introduction/Legal and Regulatory Compliance Practices/Business Practices/Employment Practices/Environmental Sustainability Practices/Compliance with the Jones Lang LaSalle Code of Ethics/Compliance with Client Codes of Conduct/Business Continuity and Crisis Management/Audits of Internal Controls and Operating Effectiveness of Service Pr/Cooperation with Investigations/No Creation of Third-Party Rights/Reporting Of Questionable Behavior or Possible Violations Law: Contract(s)",
            "Consumer Questionairre Understanding naming convention for razors in India Marketing / Market Research",
            "RESTRICTED USE PESTICIDE-PRECAUTIONARY STATEMENTS HAZARDS TO HUMANS AND DOMESTIC ANIMALS / WARNING / ENVIRONMENTAL HAZARDS / GROUND WATER ADVISORY STATEMENT / SURFACE WATER ADVISORY STATEMENT Agriculture",
            "WHISTLE BLOWER POLICY-For a leading Dairy MNC APPLICABILITY / GENERAL POLICY STATEMENT / REPORTING VIOLATIONS / NON-RETALIATION Law (general)",
            "Global Demographics Survey Business General - Surveying the details of a family Surveying",
            "SOP Plant In Charge(IV) - For a leading Dairy Company 1.Reception (1405 words) 2.sop wet process (2984 words) 3. ghee SOP-new.doc (3000 words) 4.Butter Bulk packing SOP(2) (1859 words) Food & Drink",
            "Printing Company-SOP-I Printing Machine & Production Process - SOP Printing & Publishing",
            "ICF-Addendum A Randomized, Double-Blind, Placebo-Controlled, Multi-Center Phase 3 Study of ........ as Adjuvant Treatment for Women with Early-Stage Breast Cancer at High Risk of Recurrence (D-CARE) Medical: Pharmaceuticals",
            "ICF INFORMATION AND ASSENT FORM (Ages 12–17) - An Open-Label Extension Study to Evaluate the Long-Term Safety and Efficacy of ..... (3.0 mg/kg) as Treatment for Patients With Eosinophilic Asthma Who Completed a Prior ......-Sponsored Study in Eosinophilic Asthma Medical: Pharmaceuticals",
            "ICF INFORMATION AND CONSENT FORM (For Parents/Guardians/Participants 18+) - An Open-Label Extension Study to Evaluate the Long-Term Safety and Efficacy of ...... (3.0 mg/kg) as Treatment for Patients With Eosinophilic Asthma Who Completed a Prior ......-Sponsored Study in Eosinophilic Asthma Medical: Pharmaceuticals",
            "Legal - ANTI-BRIBERY AND ANTI-CORRUPTION POLICY Legal - ANTI-BRIBERY AND ANTI-CORRUPTION POLICY - For an MNC dairy company Law (general)",
            "Training module for a leading Medical Surgical Clothing Company Training module for the employees of a leading Manufacturer, Exporter of Medical Surgical Clothing Medical (general)",
            "Participant Information Form Participant Information Form - Discussion with Professionals working with HIV/AIDS issues for a doctoral research Medical (general)",
            "Global Operations Leadership meeting - Hourly Rollout MS Power Point Presentation for a meeting by a Top MNC in efficient power conveyance and energy management solutions Energy / Power Generation",
            "Panchayat related Project - II phase Government / Politics",
            "MNC company's Compensation Plan - II set MNC company's Compensation Plan [ Health products MLM ] Business/Commerce (general)",
            "Press Release Inter-College Science Festival Report Printing & Publishing",
            "SOP Plant In Charge(III) - For a leading Dairy Company 5.Document Generation & Management (Folder).1. Requirements for Record Generation & Management (230 words).2. Specification Management - LIMS specs (647 words).3. Maintaining External Lab Reports.(417 words).4. Maintaining External Calibration Reports (208 words).5. FG Stock Report Generation.(261 words).6. Lab KPI.(337 words).7. Monthly report. (681 words).8.Stock & Material Management. (Folder).1.Stock verification,list updation and maintenance.(161 words).2. Raising PRs and Follow up with purchase Dept.(408 words).3. Lab material collection from stores.(208 words).4.LPG Tank Maintenance.(162 words).5.Disposible of Expired Chemical.(173 words).7.Sample Handling. (Folder).1. Sample collection-chem (552 words).2. sample collection for RM & PM (371 words).3. Sample collection - Micro testing (563 words).4. Hygiene samples (241 words).5. Control Sample Preparation (173 words).6. Pathogen Sample Preparation & despatch (External Lab) (272 words).7. Customer Request & HO samples Dispatch (194 words).8. External lab schedule preparation (386 words)9. External lab testing RMP, RM, PM, PFA (179 words).10. Report review (71 words).11. Management of external invoice for testing.(285 words).12. Sample Discarding- Chemical (220 words).13. Sample discarding -Micro (184 words).14. Retention Sample discarding (175 words).12.Testing (Folder).Reagent Preparation (570 words). Media preparation & Sterilization(559 words). Zonal studies & feed reports.(398 words). Raw & Packing Material Testing.(355 words). SAP Data Entry RM (308 words). RM Deviation Process.(360 words). SAP Data Entry PM (305 words). PM deviation process (360 words). Reference Material & Proficiency Testing planning (126 words). Preparation and review of interlab and interanalysis comparison report (106 words). Comparison Testing (Other Lab Samples) (286 words). Competitor Sample (279 words) Statistical Quality Control Chart (356 words) Testing contingency planning (233 words) Audit of external testing labs (176 words) Testing As Per Agmark Requirement (266 words) Management & Monitoring of Agmark Replicas 2012 (242 words). Agmark document management (190 words) Artwork Development process (515 words) New Product Development (701 words) New Specification for Product (129 words) Food & Drink",
            "Executive Speech among employees Regarding Health and Safety & Environmental incidents. Engineering: Industrial",
            "ICF (Prospective & Retrospective) xxxxxx (xxxxxx into Nephrotic Syndrome: Investigating Genes, Health and Therapeutics. (The purpose of this study is to determine characteristics that increase the risk of developing nephrotic syndrome and also how you are doing in your everyday life) Medical (general)",
            "MNC company's Corporate Profile - I set MNC company's Corporate Profile [ Health products MLM ] Business/Commerce (general)",
            "ICF for Pregnant Women MULTI-OCTAVE (Management Using Latest Technologies to Optimize Combination Therapy After Viral Failure) + Attachments A & B Medical (general)",
            "SOP Plant In Charge(II) - For a leading Dairy Company PRP Audit check list (3237 words), IA checklist (6802 words), Validation format (475 words) PRP Audit check list :(1) Equipment Planning (62 words) (2)b.Steam (Boiler) (67 words) (3) a. Energy (Electrical) (69 words) (4) Supply of Air (70 words) (5) ETP (72 words) (6) a.Solid waste disposal (76 words) (7) a. Raw milk transportation (77 words) (8) a. Storage of Purchased Materials (80 words) (9) 1.b.Layout check points (81 words) (10) c.Chilling (Refrigeration) (83 words) (11) Finished Products Storage (88 words) (12) Purchase (90 words) (13) Equipment planning & maintenance (92 words) (14) Employee facilities (101 words) (15) Material management (101 words) (16) b2.Handling of Products (106 words) (17) c. Labeling, storage and use of toxic compounds (109 words) (18) Pest Control (110 words) (19) Packing (Milk,Powder, Butter, Ghee) (113 words) (20) Water management (116 words) (21) Employee health (117 words) (22) Prevention of cross contamination (119 words) (23) Animal Husbandry (123 words) (24) a&b. Cleaning and Sanitation (149 words) (25) Calibration (150 words) (26) Procurement (161 words) (27) b1.Finished Products Storage and Transportation (166 words) (28) 1.a.Construction & layout of buildings (190 words) (29) Management Representative (299 words) IA checklist :1. BP 6. Accounting Process (90 words) 2. BP 10 b. Ghee Production (129 words) 3. BP 5 a. Process for Cattle Feed supply service (142 words) 4. BP 3. Milk Procurement (152 words) 5. BP 3 milk procure (153 words) 6. BP 10 c. Butter Production (160 words) 7. BP 10 f. Process for Juice water Preparation (162 words) 8. BP 10 e. Process for Mix Preparation (178 words) 9. BP 7. Purchase (186 words) 10. BP 8. Storage (186 words) 11. BP 14. ETP (192 words) 12. BP 10 i. Cake Process area (194 words) 13. BP 10 d. Procedure for Production , Hygiene maintenance, Ice-cream storage process (195 words) 14. QSP 1. Control of Documents & Records (195 words) 15. BP 4. SYSTEM (EDP) (201 words) 16. BP 10 g. Chocolate Paste Process (222 words) 17. BP 15. Outsourced Services (229 words) 18. BP 2. Infrastructure and Work Environment (245 words) 19. BP 12 . Process for Dispatch of Ice Cream (248 words) 20. BP 13 . Commercial & Warehouse (253 words) 21. BP 10 h. Cone biscuit Process (255 words) 22. BP 11. Maintenance (260 words) 23. QSP 5. Control of Monitoring and Measuring Devices (274 words) 24. BP 10 a. Milk Powder Production (278 words) 25. BP 11 a. Electrical (301 words) 26. BP 1. Human Resource Management (345 words) 27. BP 5. Animal Husbandry Service (403 words) 28. BP 3 a. Chilling Center Process (437 words) 29. BP 9. Process for verification of procured milk, other raw and pack materials & monitoring & measurement of product (537 words) Validation format (475 words) Food & Drink",
            "Assisted Voluntary Return Programme for refugees - Confidentiality Consent Forms Forms Law: Contract(s)",
            "MEDIMMUNE LUPUS 1) WEB BANNER AD COPY 2) APPT REMINDER CARD COPY 3) FLYER COPY 4) PATIENT RECRUITMENT POSTER COPY 5) DOCTOR TO PATIENT LETTER 6) FLOWCHART COPY 7) BROCHURE COPY 8) WEBSITE COPY Medical: Pharmaceuticals",
            "Newsletter-Environment Management Programme For a Leading Cellphone Manufacturing Company in India Printing & Publishing",
            "SOP Plant In Charge(I) - For a leading Dairy Company 1)Daily Planning Meeting 2)Housekeeping 3) GMP & GHP 4) Plant Visits 5) Verify the departmental activities 6) Monitor the Inventory levels of all materials 7) Verify the SAP updating of the batches 8) Replies for market complaint in SAP 9) PR/PO and SES (Service Entry Sheet) approvals in SAP 10) verify the manufacturing expenses 11) Verify and sign the Vouchers 12) Monthly Plant review meetings 13) Monitoring Non-moving materials / Idle equipments and Inventory 14) Sending the monthly requirements of Ingredients (SMP /Butter) to HO 15) Facilitate External Auditors / Visitors 16) ISO activities as MR 17) Preparing the annual expenses (CAPEX) 18) Follow-Up of HSE meeting 19) Follow-Up the training Calender 20) Appraisal 21) Festival Celebrations 22) CIP 23) Documentation & MIS reports 24) Preventive & Breakdown monitoring 25) Health & safety awareness 26) Training & development 27) Update Manufacturing, Management, Food & Drink",
            "India level Engineering Chemistry Content - Objective type 1)solid state 2) Organic Carbon Compound 3) Organic Ether 4) Organic Isomerism 5) Org. chem. hydroxy. Chemistry; Chem Sci/Eng",
            "Basic Maintenance & Lubrication Manual - For a leading automobile company 1) General 2) Engine 3) Clutch 4) ZF Gear Boz 5) Propeller Shaft 6) Rear Axle 7) Front axle 8) Power Steering 9) Brake System 10) Suspension 11) Electrical System 12) Wheels and Tyres 13) General Maintenance Instruction for Tipping Gear 14) Tractor - Trailer arrangement 15) Cabin 16) Filling Capacities (in litres) 17) Recommended Lubricants. Automotive / Cars & Trucks",
            "Pocket Dictionary Project Miscellaneous Linguistics",
            "Website Localization - User Interface User Interface - Website Localization done via given inbuilt software Internet, e-Commerce",
            "Return Story of a refugee & Legal consequences of applying for Voluntary return Return Story of a refugee 1) Personal Background 2) Taking the decision to return 3) Preparing to return 4) Arrival in Home-land 5) Plans and hopes for the future. Legal consequences of applying for Voluntary return 1) Re-entry ban 2) Breaching immigration rules 3) Two year or five year re-entry ban? 4) When will you not get a re-entry ban? 5) Re-entry bans for people who do not return with .... 6) Other refusals of visa applications 7) Withdrawal of asylum and other claims 8) Effect on current or future application for protection Law (general)",
            "Search Engine - Tamil Version Translation Search Engine - Tamil Version Translation Internet, e-Commerce",
            "Medical questionnaire (....... CLINICAL TRIALS GROUP) 1) ACTIVITIES OF DAILY LIVING INTERVIEW 2) INTERNATIONAL ..... SCALE (I...S) 3) QUALITY OF LIFE/PSYCHOSOCIAL INTERVIEW Medical (general)",
            "Private Organisation's social responsibility activities report Private Organisation's social responsibility activities report Social Science, Sociology, Ethics, etc.",
            "Chapter :Waterproofing - College book translation Topic 1 — General knowledge of waterproofing and application principle Topic 2:- Concrete admixture and crystalline systems Topic 3:- Sheet membrane systems Topic 4:- Cementitious systems Topic 5:- Liquid-applied membrane systems Construction / Civil Engineering",
            "Unaccompanied Employment Agreement Index of Articles Article 1 - Terms of Employment and Compensation Article 2 - Acknowledgements/ Representations Article 3 - General Terms of Employment Article A - Compensation and Benefits Article 5 - Working Hours and Paid Time Off (PTO) Article 6 - Travel/Relocation/Housing Article 7 - Termination of Employment Law: Contract(s)",
            "Computer Books Publisher's Magazine article translation Sculpteo iOS app, Samsung DV300F, iPhone 4S, WarpiaTV, iPad3, WiFi, eSATA, Jailbreaking, Difference Between Mbps and MBps, Android Phone etc., IT (Information Technology)",
            "TELEVISION PRIZE COMPETITION PROGRAM - CONTESTANT RELEASE FORM TELEVISION PRIZE COMPETITION PROGRAM - CONTESTANT RELEASE FORM Cinema, Film, TV, Drama",
            "Brand Track Questionnaire - Cellphone market Questions to be asked by the Interviewer to the Respondent in the (Mobile phone) market survey. Surveying",
            "Energy Control Coordinator - Manual 1)Who should be an ECC? 2) ECC Training Engineering: Industrial",
            "All India School Survey Aim of the survey : To improve the health and well-being of students in schools throughout India. Surveying",
            "Newsletter POLLUTION OF COMMON WATER BODIES IN VILLAGE, IMPACTS AND MEASURES Science (general)",
            "Panchayat related Project - I phase Panchayat related Project Government / Politics",
            "ICF A clinical study to evaluate the safety and efficacy of herbal health drink in growth, health and cognition of children. Medical: Health Care",
            "ICF Reducing Early Mortality and Early Morbidity by ...... Treatment Regimens Medical: Pharmaceuticals",
            "Private Finance Company - Compensation Policy & Security Repossession Private Finance Company - Compensation Policy & Security Repossession Finance (general)",
            "Letter from School to Parents regarding Students Attendance Letter from School to Parents regarding Students Attendance Education / Pedagogy",
            "Jewellery Saving Scheme - Brochure Jewellery Saving Scheme - Brochure - of a leading Jewellery Shop Marketing / Market Research",
            "Coated Metal Tiles - Product Brochure Coated Metal Tiles - Product Brochure Advertising / Public Relations",
            "Industrial Cleaning Products - User Manual Industrial Cleaning Products - User Manual Engineering: Industrial",
            "Legal Notice Land / Real Estate Law (general)",
            "Maths subject of class 9th & 10th sets and functions / spheres & shells / statistics / VARIABLES / Algebra Linear equation / AREA - rectangle with curved edge / Area Circle - Rhombus / AREA combinations / Area of Circle / AREA segment circle / areas / arithemetic progression / comparison of areas / cones / constructions / Co-ordinate Geometry / Co-ordinate Geometry / heights and distances / Heron's Formula Measure of central tendency / Number systems / polynomials / polynomials / probability / Problems on circles / problems on progression / pythagoras theorem / Mathematics & Statistics",
            "Private Bank Savings Account Brochure & T and C Multi-National Bank's Savings Account Brochure & Terms and Conditions Finance (general)",
            "Tariff Schedules for Asset Products Details about various credit cards Business/Commerce (general)",
            "'As a peace loving global citizen' - Book Translation 'As a peace loving global citizen' - Book Translation : Author - Reverend Sun Myung Moon / 350+ pages in English source book Religion",
            "Ganesh Chaturthi Mailer Ganesh Chaturthi Festival Invitation Religion",
            "ICF Immunological correlates of Lack of Disease progression in .... infected Long Term Non-Progressors from India Medical: Pharmaceuticals",
            "ICF 1) ICF - ----------- & ---------- bilateral collaboration on ---------- 2) ICF - -----------group #--------- submitted to ----- (1) Medical: Pharmaceuticals",
            "ICF Reducing Early Mortality and Early Morbidity by ---------- Tuberculosis Treatment Regimens for ------- infected patients. Medical: Pharmaceuticals",
            "ICF 1) Prospective observational long-term safety registry of --------- patients who have participated in -------- clinical trials Medical: Pharmaceuticals",
            "Chemistry Polyhalogen compounds, Reactions of Haloalkanes Chemistry; Chem Sci/Eng",
            "Magazine for Old People - News Letter Magazine for Old People - News Letter Printing & Publishing",
            "Autobiography of a cereal Advertisement Content Advertising / Public Relations",
            "Survey Report : Public toilets in ..... (City Name) Survey conducted by a social service organisation. Surveying",
            "MNC's Vehicle Finance - Leaflets of various schemes MNC's Vehicle Finance - Leaflets of various schemes Advertising / Public Relations",
            "Participant Workbook - Training Module Participant Workbook - Execution for Sales Targets Marketing / Market Research",
            "Foundry - Training Manual Dust Extraction System (334 words) DG set (620 words) Forklift Operation (457 words) LPG Unloading (699 words) Vechile Safety (626 words) Preblending Process (671 words) Product Labelling Process (241 words) Slurry Transfer (264 words) Filter Packing (576 words) ETP operation.doc (805 words) Racking and Storage Check (354 words) FG Inspection (296 words) WIP monitoring (174 words) Work Order Closing (363 words) RM Inspection (287 words) Waste Disposal Matrix (453 words) Disposal of waste (294 words) HK & Gardening (197 words) Preventive Maintenance (216 words) Datapaq Operation (374 words) Manual Material Handling (256 words) PPE Policy (663 words) Checklist for Vehicle Transporting FG (203 words) Pulping Process (707 words) PSM Operation (616 words) Kalpur Packing (498 words) Batching (522 words) Handling & Storage (632 words) RM Unloading & FG Loading (993 words) Shrinkwrap & Stretchwrap (959 words) Checklist for Vehicle Transporting FG (144 words) Natural Resource Management (641 words) Work permit (4454 words) Mini PSM Operation (410 words) MT Operation (523 words) BC Gluing-Machine (597 words) Invoicing & Despatching (391 words) Compressed gas cylinder (520 words) Gas Cutting Welding (2059 words) Engineering: Industrial",
            "MOU between Management & Employees For a leading 2 wheeler company Law: Contract(s)",
            "EMPLOYEE'S SELF APPRAISAL FORM EMPLOYEE'S SELF APPRAISAL FORM Human Resources",
            "TIPS FOR A SAFE SUMMER TIPS FOR A SAFE SUMMER Advertising / Public Relations",
            "Visit Postponed Letter Visit Postponed Letter General / Conversation / Greetings / Letters",
            "Visit Proposing Letter Visit Proposing Letter General / Conversation / Greetings / Letters",
            "Level of Assessment for various activities - NGO project 1) Agriculture (709 words) 2) Backyard poultry[1] (338 words) 3) charcoal[1] (307 words) 4) Coir rope making[1] (182 words) 5) Handcrafts and toy making[1] (205 words) 6) Hollow bricks manufacture[1] (254 words) 7) Leaf plate making[1] (188 words) 8) lime kiln[1] (254 words) 9) Mat weaving[1] (134 words) 10) Paper cup making[1] (153 words) 11) Pottery[1] (354 words) 12) rabbit+rearing[1] (829 words) 13) Rice mill+oil+mill+floor+mill[1] (211 words) 14) Sheep and goat rearing[1] (412 words) 15) Tatches weaving[1] (169 words) 16) Vermicompost[1] (154 words) 17) Weaving[1] (232 words) Agriculture, Livestock / Animal Husbandry, Food & Drink",
            "Application Tags for a Internet Search Engine Company 1) ToDoListApp 2)...Updater 3) CheckDiskApp 4) CalculatorApp 5) WorldClockApp 6) WiFiApp 7) VoiceMemoApp 8) VideoTelephonyApp 9) VendorApp 10) UssdApp 11) UnitConverterApp 12) TestApp 13) SmsSettingApp 14) ShortcutsApp 15) SettingApp 16) SendViaApp 17) SecApp 18) ProfileApp 19) PicViewerApp 20) PhbApp 21) OnApp 22) OffApp 23) NotepadApp 24) MplayerApp 25) MmsSettingApp 26) MessageViewerApp 27) MessageEditorApp 28) MessageCenterApp 29) MapApp 30) MainMenuApp 31) KingMovieApp 32) KeyGuardApp 33) JavaAmsApp 34) IdleApp 35) GTRDoggyStar 36) FmRadioApp 37) FileMgrApp 38) FdnApp 39) EvtCenterApp 40) EmailApp 41) EmApp 42) EbookApp 43) DnesApp 44) DictApp 45) DialerApp 46) DesktopWidget 47) CountdownTimerApp 48) ConSettingApp 49) CheckDiskApp 50) CdWapApp 51) CcMtaApp 52) CcApp 53) CbSettingApp 54) CamApp 55) CallSettingApp 56) CallLogApp 57) CalibrationApp 58) BtNotifyApp 59) BtApp 60) BmiApp 61) BjxApp 62) AutotestApp 63) AtvApp 64) AntiStealApp 65) AndroidMainmenu 66) AndroidKeyGuardApp 67) AndroidIdleApp 68) AlarmApp 69) Common Internet, e-Commerce",
            "Indoor Cranes This module describes the different types of cranes and the dangers of having a poorly-maintained crane. This course will teach how to inspect a crane, and rig and lift a load safely. Engineering: Industrial",
            "Medical Questionnaire 1) Alcohol and Recreational Drug Use Questionnaire 2) Transmission Risk Behavior Questionnaire - Men 3) Transmission Risk Behavior Questionnaire - Women Medical: Health Care",
            "ICF 1) Arterial Elasticity Substudy Consent 2) CONSENT FOR THE STORAGE OF SPECIMENS OBTAINED WHILE PARTICIPATING IN AN ..... RESEARCH TRIAL 3) CONSENT FOR THE STORAGE OF BIOPSY TISSUE OBTAINED AT DIAGNOSIS OF NEW MALIGNANCY WHILE PARTICIPATING IN ... RESEARCH TRIAL Medical: Pharmaceuticals",
            "Phd.Thesis - English Language Phd.Thesis - English Language Linguistics",
            "ICF A Phase 3 double-blind, randomized, placebo-controlled, safety and efficacy study of once daily controlled release ..... in the treatment of patients with ..... Medical: Pharmaceuticals",
            "Fecilitator Guide Fecilitator Guide Advertising / Public Relations",
            "Manual for Outreach Workers Manual for Outreach Workers Advertising / Public Relations",
            "Computer hardware Troubleshooting Computer hardware Troubleshooting Computers: Hardware",
            "Cell Phone Safety - Advertisement content Cell Phone Safety - Advertisement content Advertising / Public Relations",
            "Industrial Magazine Industrial Magazine Journalism",
            "STAINLESS STEEL OVERHEAD WATER TANK - INSTRUCTIONS MANUAL Table of Contents : 1) Disposal Information 2) General Safety Instructions 3) Your New Stainless Steel Water Tank 4) Before Using Your Tank for the First Time 5) Check the Accessories 6) Technical Specification 7) Installation 8) Cleaning & Care 9) Customer Service 10) Warranty 11) Warranty Card Construction / Civil Engineering",
            "Training module for Counsellors Counselling High Risk Groups Advertising / Public Relations",
            "E-learning Training Project of a Multi-national finance company Covering topics like Debt Management, Importance of Savings, Budgeting and Financial Planning for home and business,business development and expansion… And much more! Finance (general)"
        ],
        [
            "Corroboration",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment.",
            "No comment."
        ]
    ],
    "pageTitle": "English to Tamil Translation/100% friendly, flexible, reliable, quality guaranteed",
    "title": "",
    "url": "http://www.proz.com/translator/1122026",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 652738159,
    "recordOffset": 652672472,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "112 projects entered Project History PRO-level points: 28, Questions answered: 25, Questions asked: 40 KudoZ activity (PRO) INR Preferred currency Less More Certificates, Diplomas, Licenses, CVs Poetry & Literature Names (personal, company) Retail Energy / Power Generation Patents Livestock / Animal Husbandry Folklore Manufacturing Architecture Internet, e-Commerce General / Conversation / Greetings / Letters Art, Arts & Crafts, Painting Journalism Printing & Publishing Agriculture Philosophy Psychology Science (general) Human Resources Geography",
    "textAfterTable": "More Less Payment methods accepted Check, Money order, Skrill, Wire transfer, PayPal, Money Gram, Western Union Portfolio Sample translations submitted: 7 English to Tamil: Welding and Fabrication General field: Tech/Engineering Detailed field: Engineering: Industrial Source text - English Manufacturing and construction are never ending processes in this competitive world. As long as these processes exist there will be welding and fabrication. The quality of welding and fabrication work entirely depends on the skill of the professional. With the huge increase in demand for welding and fabrication technology professionals, getting trained in this technology will boost your career growth. In this training module, you will learn about the basics of fabrication and welding and the tools used in this technology. To begin with, let us know what is fabrication and welding? Fabrication is a process that involves the construction of machines and",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}