{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Catholic",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "216,980",
            "145,082",
            "57,086",
            "41,245",
            "17,240",
            "4,620",
            "663,703"
        ],
        [
            "Congregations",
            "575",
            "21",
            "93",
            "85",
            "41",
            "9",
            "-"
        ]
    ],
    "pageTitle": "Orlando, Florida (FL) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Orlando-Florida.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00147-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 365257267,
    "recordOffset": 365090478,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{121166=Recent home sales, real estate maps, and home value estimator for zip codes: 32801, 32803, 32804, 32805, 32806, 32811, 32812, 32814, 32819, 32822, 32827, 32829, 32832, 32835, 32839, 32897., 134366=Orlando: SeaWorld 2006, 7676=According to our research of Florida and other state lists there were 1,875 registered sex offenders living in Orlando, Florida as of August 04, 2015. The ratio of number of residents in Orlando to the number of sex offenders is 133 to 1., 135667=Orlando: Sunset in Orlando, FL July 4, 2004, 123388=Zip codes: 32801, 32803, 32808, 32811, 32814, 32827, 32835.}",
    "TableContextTimeStampAfterTable": "{74899=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 7.23. This is better than average. Closest monitor was 2.2 miles away from the city center., 72712=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 5.35. This is better than average. Closest monitor was 2.2 miles away from the city center., 103886=2004 Presidential Elections Results, 57325=Tourist attractions: Emerge Talent Agency LLC (Cultural Attractions- Events- & Facilities; 2295 S. Hiawassee Road) (1), Gatorland (Cultural Attractions- Events- & Facilities; 14501 South Orange Blossom Trail) (2), Artworks (Cultural Attractions- Events- & Facilities; 609 Vassar Street) (3), Central Florida Destination Station (Cultural Attractions- Events- & Facilities; 7600 Colebrook Drive) (4), Orlando Science Center and Dr Phillips Cinedome (Planetariums; 777 East Princeton Street) (5), Critter Control (Recreation Areas; 2538 Silver Star Road) (6), Aaanimal Control (Recreation Areas; 722 S Mills Ave) (7), Bear Creek Park (Amusement & Theme Parks; 1600 Bear Crossing Dr) (8), Amusement & Vending Service CO (Amusement & Theme Parks; 4472 35th Street) (9). Display/hide their approximate locations on the map, 104458=2012 Presidential Elections Results, 289471=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 162996=9.39% of this county's 2011 resident taxpayers lived in other counties in 2010 ($35,330 average adjusted gross income), 73445=Ozone [ppb] level in 2012 was 27.4. This is about average. Closest monitor was 4.6 miles away from the city center., 165203=9.16% of this county's 2010 resident taxpayers moved to other counties in 2011 ($32,939 average adjusted gross income), 71990=Carbon Monoxide (CO) [ppm] level in 2012 was 0.382. This is worse than average. Closest monitor was 0.6 miles away from the city center., 103600=2000 Presidential Elections Results, 74144=Particulate Matter (PM10) [µg/m3] level in 2012 was 15.4. This is better than average. Closest monitor was 1.0 miles away from the city center., 22111=On 2/22/1998, a category F3 tornado 8.1 miles away from the city center killed 3 people and injured 70 people and caused $15 million in damages., 58522=Hotels: Blue Nile Hotel Liquidators (5320 Silver Star Road) (1), Clarion Hotel Universal (7299 Universal Boulevard) (2), Buena Vista Suites (8203 World Center Drive) (3), AmeriSuites Orlando / Universal (5895 Caravan Court) (4), Best Western Motel (5565 West Space Coast Parkway) (5), All Guest Services Inc (4303 Vineland Road Suite F5) (6), Balmers Court Motel (8623 East Colonial Drive Ofc) (7), Best Western Orlando West (2014 West Colonial Drive) (8), Adams Mark Orlando (1500 Sand Lake Road) (9). Display/hide their approximate locations on the map, 103314=1996 Presidential Elections Results, 288165=Total of 2413 patent applications in 2008-2015., 104172=2008 Presidential Elections Results, 71343=Air Quality Index (AQI) level in 2012 was 74.6. This is about average., 100006=Educational Attainment (%) in 2013, 59428=Courts: Orange County - Judges- Circuit Court (2000 East Michigan Street) (1), Secret Service U S (80 North Hughey Avenue) (2), Florida State - Highway Safety & Motor Vehicles Department- Judicial- Circuit Court Ninth Judi (425 North Orange Avenue) (3), Florida State - Judicial- County Court Orange- Judges (425 North Orange Avenue) (4), U S Government - Immigration Court- Executive Office For Immigration Re (5449 South Semoran Boulevard) (5), Florida State - Highway Safety & Motor Vehicles Department- Judicial- County Court Orange- Ju (425 North Orange Avenue) (6). Display/hide their approximate locations on the map, 21829=On 3/19/1981, a category F3 (max. wind speeds 158-206 mph) tornado 3.5 miles away from the Orlando city center injured one person and caused between $500,000 and $5,000,000 in damages., 100404=School Enrollment by Level of School (%) in 2013, 104742=Graphs represent county-level data. Detailed 2008 Election Results}",
    "textBeforeTable": "Religion statistics for Orlando city (based on Orange County data) Winegard Road South neighborhood Windsor Services Office Building neighborhood Windhover neighborhood Windermere Village Centre neighborhood Windermere Ridge neighborhood Willow Creek neighborhood Williamsburg neighborhood Wilderness Creek neighborhood Wetherbee Acres neighborhood Westwood neighborhood Westridge Executive Park neighborhood Westland Terrace neighborhood Westfield neighborhood West Side Plaza neighborhood West Orange Center neighborhood West Oaks Square neighborhood West Colonial neighborhood Wesco Square neighborhood Wellesley neighborhood Wedgewood Groves neighborhood Weber Lakes neighborhood Watson Center neighborhood Wateroods neighborhood Waterford Trails neighborhood Waterford Park neighborhood Waterford Lakes Office Park neighborhood Waterford Commons neighborhood Waterford Chase neighborhood Washington Shores neighborhood Walker Estates neighborhood Walker Cove neighborhood Wadeview Park neighborhood Voa-Nerbonne neighborhood Voa Nerbonne neighborhood Vistana neighborhood Vista Way neighborhood Vista Palms neighborhood Vista Lakes (Warwick at Vista Lakes) neighborhood Vista East neighborhood Vinings at Cypress Point neighborhood Vineland Pointe neighborhood Villas at Bay Hill neighborhood Villages of Southport neighborhood Villages at Moss Park neighborhood Village Townhomes neighborhood Ventura neighborhood Valencia Community College neighborhood Valencia College Lane neighborhood University Terrace neighborhood",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 230 Orange County: 2.16 / 10,000 pop. Florida: 2.04 / 10,000 pop. Number of supercenters and club stores: 16 This county: 0.15 / 10,000 pop. State: 0.11 / 10,000 pop. Number of convenience stores (no gas): 122 Orange County: 1.15 / 10,000 pop. Florida: 1.28 / 10,000 pop. Number of convenience stores (with gas): 365 Orange County: 3.43 / 10,000 pop. State: 3.04 / 10,000 pop. Number of full-service restaurants: 881 Here: 8.28 / 10,000 pop. State: 7.45 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}