{
    "relation": [
        [
            "Patent application number",
            "20100063816",
            "20100324900"
        ],
        [
            "Description",
            "Method and System for Parsing of a Speech Signal - A method for processing an analog speech signal for speech recognition. The analog speech signal is sampled to produced a sampled speech signal. The sampled speech signal is framed into multiple frames of the sampled speech signal. The absolute value of the sampled speech signal is integrated within the frames and respective integrated-absolute values of the frames are determined. Based on the integrated-absolute values, the sampled speech signal is cut into segments of non-uniform duration. The segments are not as yet identified as parts of speech prior to and during the cutting.",
            "Searching in Audio Speech - A computerized method of detecting a target word in a speech signal. A speech recognition engine and a previously constructed phoneme model is provided. The speech signal is input into the speech recognition engine. Based on the phoneme model, the input speech signal is indexed. A time-ordered list is stored representing n-best phoneme candidates of the input speech signal and phonemes of the input speech signal in multiple phoneme frames. The target word is transcribed into a transcription of target phonemes. The time-ordered list of n-best phoneme candidates is searched for a locus of said target phonemes. While searching, scoring is based on the ranking of the phoneme candidates among the n-best phoneme candidates and based on the number of the target phonemes found. A composite score of the probability of an occurrence of the target word is produced. When the composite score is higher than a threshold, start and finish times are output which bound the locus. The start and finish times are input into an algorithm adapted for sequence alignment based on dynamic programming for aligning a portion of the phoneme frames with the target phonemes."
        ],
        [
            "Published",
            "03-11-2010",
            "12-23-2010"
        ]
    ],
    "pageTitle": "Ronen - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ronen-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00177-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 446096683,
    "recordOffset": 446062440,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Ronen Faifkov, Rehovot IL 03-15-2012 Aircraft Engine Exhaust Nozzle System for Jet Noise Reduction - The aircraft exhaust engine nozzle system includes a fan nozzle to receive a fan flow from a fan disposed adjacent to an engine disposed above an airframe surface of the aircraft, a core nozzle disposed within the fan nozzle and receiving an engine core flow, and a pylon structure connected to the core nozzle and structurally attached with the airframe surface to secure the engine to the aircraft. 20120061510 10-30-2008 JET NOZZLE HAVING NOISE ATTENUATING SHIELD AND METHOD THEREFOR - An arcuate or semi-circumferential shield in the shape of a visor that is adapted to be secured to an external surface of a nozzle housing of a jet nozzle to attenuate jet noise generated by the jet nozzle. The shield may be fixedly secured to the nozzle housing or movably supported so that it can be moved between retracted and deployed positions. When used as a fixedly mounted component, or when positioned in its deployed position, a downstream edge of the shield extends past a downstream edge of the nozzle housing and the shield is spaced apart from an outer surface of the nozzle housing to form a channel therebetween. The shield is preferably orientated at approximately a bottom dead center of the nozzle housing. The shield operates to attenuate jet installation noise, and particularly jet installation noise experienced during the takeoff phase of flight of a jet",
    "textAfterTable": "Ronen Hamias, Holon IL Patent application number Description Published 20090055466 GRID-BASED SYSTEM FOR PROVIDING BUSINESS SERVICES IN DATA NETWORKS - A system for exposing and extending existing IT capabilities as standard business services, while providing infrastructure services to an organization over a data network, has a group of configured agents. Each agent runs services that represent a certain entity on the organization's network and is responsible for controlling the functionality of the represented IT resource on the organization's network, while being a runtime engine for services that represent IT resources of the organization and a Peer-to-Peer topology layer for connecting between the agents, while exploiting the existing physical data channels of the data network. 02-26-2009 Ronen Hareuveny, Rehovot IL Patent application number Description Published 20100280382 BONE FRACTURE DETECTION - Apparatus for detecting a fracture in a bone, the apparatus comprising: an electric field generator, configured to generate an electric field in proximity of the bone, at a predefined frequency range, the generated electric field being substantially parallel to longitudinal axis of the bone; an electric field measurer, associated with the electric field generator, and configured to measure intensity values of the generated electric field over the predefined frequency range, and an analyzer, associated with the electric field measurer, and configured to analyze the intensity values measured over the predefined frequency range, thereby to detect the fracture in the bone. 11-04-2010",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}