{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Join some clubs and organizations.",
            "Don't be afraid to reach out and meet new people. Everyone is friendly.",
            "I really loved Mount Union when I went to visit. I loved the small town/rural atmosphere where it is quiet and isolated from a lot of commotion. I also liked the people that worked or attended there."
        ]
    ],
    "pageTitle": "University of Mount Union Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Mount-Union/reviews",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00171-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895910863,
    "recordOffset": 895878558,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{130411=© 2015, Cappex.com, LLC, 104400=The food is good as a whole. They have a large amount of healthy food to choose from. They need to change up the selections, they seem to have the same meals alot. It would be nice if the cafeteria was open later. There are many athletes on campus and sometimes I am at practice longer and the cafeteria closes at 7:00 before I get home. I miss out on dinner. And on Sunday they close at 5:00 so we have to eat dinner at 4:00. Way to early., 106129=Sheets is a great place to eat late night and Chipotle is just down the street if you're hungry. Sunday the cafeteria is only open until 5:00 so don't forget to get there in the late afternoon or you have to buy your dinner somewhere else.}",
    "textBeforeTable": "06/08/2009 Reviewer is A current student here. 7 out of 7 people found this review useful. 1 of 30 Steven from Massillon, OH Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Sean from Mentor, OH 12/28/2010 Reviewer is A current student here. 5 out of 5 people found this review useful. 2 of 30 Categories Comments Great for these types of students Mount Union has especially great education, music, business, athletics, and science departments. However, no department lacks. You will find what you want at Mount Union. Tips for prospective students Check out all of the scholarships you can receive. If you have any experience with music at all, audition for a music scholarship. The University of Mount Union is very generous, and musicians at all different levels receive good scholarships just to participate in one ensemble. Bang for the buck The University of Mount Union may be expensive, but there is not a school more generous with scholarships. By the time you receive your scholarships, you will be paying a great price for an even better education. Am enjoying being here The facilities are great. Everything you'll ever want is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}