{
    "relation": [
        [
            "Code or Value",
            "1",
            "2",
            "7",
            "9",
            "."
        ],
        [
            "Value Description",
            "Yes",
            "No",
            "Refused",
            "Don't know",
            "Missing"
        ],
        [
            "Count",
            "282",
            "5642",
            "0",
            "11",
            "3731"
        ],
        [
            "Cumulative",
            "282",
            "5924",
            "5924",
            "5935",
            "9666"
        ],
        [
            "Skip to Item",
            "",
            "MCQ160F",
            "MCQ160F",
            "MCQ160F",
            ""
        ]
    ],
    "pageTitle": "NHANES 2007 - 2008: Medical Conditions Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/MCQ_E.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00244-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359841687,
    "recordOffset": 359816992,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{5881=Title: Medical Conditions (MCQ_E ) Contact Number: 1-866-441-NCHS Years of Content: 2007 - 2008 First Published: September, 2009 Revised: NA Access Constraints: None Use Constraints: None Geographic Coverage: National Subject:Self-reported personal interview data on a broad range of health conditions for both children and adults Record Source: NHANES 2007 - 2008 Survey Methodology: NHANES 2007 - 2008 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 1796=Changes Since 2005-2006:, 5060=The medical conditions section (prefix MCQ) provides self-reported personal interview data on a broad range of health conditions for both children and adults. The NHANES MCQ questionnaire section is generally modeled on the “Medical Conditions” questionnaire section of the U.S. National Health Interview Survey. A number of questions on health conditions are identical to those used in the redesigned National Health Interview Survey adult and child core sections that started in 1997.}",
    "lastModified": "Fri, 09 May 2014 20:24:49 GMT",
    "textBeforeTable": "Both males and females 1 YEARS - 150 YEARS Target: CAPI INSTRUCTION: IF SP AGE >= 12, DISPLAY SP NAME AND \"S/HE\": IF SP AGE < 12, DISPLAY \"YOU\" AND SP NAME. English Instructions: Has a doctor or other health professional ever told {you/SP} that {you have/s/he/SP has} asthma? English Text: Ever been told you have asthma SAS Label: MCQ010 Variable Name: MCQ010 - Ever been told you have asthma Both males and females 1 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies N/A. References None Discontinued Questions: MCQ180n MCQ160n MCQ051 New Questions: Changes Since 2005-2006: Please refer to the Analytic Guidelines for further details on the use of sample weights and other analytic issues. The Analytic Guidelines are available on the NHANES website. Although these data were collected as part of the household questionnaire, if they are merged with the MEC exam data, exam sample weights should be used for the analyses. A number of additional questions occur in MCQ that",
    "textAfterTable": "MCQ025 - Age when first had asthma Variable Name: MCQ025 SAS Label: Age when first had asthma English Text: How old {were you/was SP} when {you were/s/he was} first told {he/she} had asthma? English Instructions: IF LESS THAN 1 YEAR, ENTER 1. CAPI INSTRUCTION: IF SP AGE >= 16, DISPLAY \"WERE YOU\" AND \"YOU WERE\". IF SP AGE = 12-15, DISPLAY \"WAS {SP}\" AND \"S/HE WAS\". IF SP AGE < 12, DISPLAY \"WAS {SP}\" AND \"YOU WERE\". ENTER AGE IN YEARS. Target: Both males and females 1 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 to 79 Range of Values 1358 1358 80 80 years or older 6 1364 77777 Refused 0 1364 99999 Don't know 19 1383 . Missing 8283 9666 MCQ035 - Still have asthma Variable Name: MCQ035 SAS Label:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}