{
    "relation": [
        [
            "Debit/Credit Account Name",
            "Cr. Receivables",
            "Dr. Adjustment"
        ],
        [
            "Debit Description",
            "",
            "$1,000 Account - 02.000.1260"
        ],
        [
            "Credit Description",
            "$1,000 Account - 02.000.1210",
            ""
        ]
    ],
    "pageTitle": "Oracle Receivables User Guide",
    "title": "Multi-Fund Accounts Receivable Line Type Adjustment to Single Line Accounting Example",
    "url": "http://docs.oracle.com/cd/E18727_01/doc.121/e13522/T355475T479603.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00102-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 72287411,
    "recordOffset": 72279209,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{8411=The multi-fund accounts receivable accounting method lets you perform line-level cash receipt applications to invoices and to track cash balances in separate funds as shown in the table below, using check number 12345 as an example., 4408=If the Account accounting method of multi-fund accounts receivable is assigned to the Big Think Tank ledger, Big Think Tank can debit the natural receivables account, 1210, for all three funds: 100, 200, and 300. Big Think Tank can now track the outstanding receivables for each balancing segment other than the account segment., 2695=If the Balancing accounting method of multi-fund accounts receivable is assigned to the Big Think Tank ledger, Big Think Tank can debit the natural receivables account, 1210, for all three funds: 100, 200, and 300. Big Think Tank can now track the outstanding receivables for each balancing segment fund., 40964=Copyright © 1988, 2010, Oracle and/or its affiliates. All rights reserved.}",
    "lastModified": "Tue, 23 Jun 2015 15:16:42 GMT",
    "textBeforeTable": "The invoice accounting for NSF using the Balancing method appears as shown in the table below. For the Receivables accounts, the balancing segment values are copied from the revenue credit lines and all other segments from the receivables account. If the Balancing accounting method of multi-fund accounts receivable is assigned to the Big Think Tank ledger, Big Think Tank can debit the natural receivables account, 1210, for all three funds: 100, 200, and 300. Big Think Tank can now track the outstanding receivables for each balancing segment fund. Balancing Method Multi-Fund Accounts Receivable Related Topics NSF wants to receive the invoice for their funding dollars in a single invoice. In the Big Think ledger, the General, Operating, and the Trust funds are represented by the balancing fund segment values 100, 200, and 300. NSF provides funding for the General Fund, Operating Fund, and Trust Fund of Big Think Tank. The following conditions exist in this example: For example, a non-profit research group, Big Think Tank Institute, must issue approximately 30 invoices per week to various foundations, endowments, and government agency grants for funding of its continued operations. Typically, one funding agency, such as the National Science Foundation (NSF), provides money for several operational funds operated by Big Think Tank. Account Method Balancing Method Multi-Fund Accounts Receivable accounting methods are predefined in Oracle Applications and have two accounting options:",
    "textAfterTable": "Operating Funds 2,500 200 - 35 - 5600 200 - 00 - 1210 3 Trust Funds 3,000 300 - 35 - 5700 300 - 00 - 1210 Account Method If the Account accounting method of multi-fund accounts receivable is assigned to the Big Think Tank ledger, Big Think Tank can debit the natural receivables account, 1210, for all three funds: 100, 200, and 300. Big Think Tank can now track the outstanding receivables for each balancing segment other than the account segment. The invoice accounting for NSF using the Account method appears as shown in the table below. For the Receivables accounts, all the segments other than the account segment value are copied from the revenue credit lines. The account segment value comes from the receivables account. Invoice with Multi-Fund Accounts Receivable, Account Method Line Description $ Amount Revenue Account (Fund-Cost Center-Natural Account) Receivables Account (Fund-Cost Center-Natural Account) 1 General Funds 1,000 100 - 35 - 5500 100 - 35 - 1210 2 Operating Funds 2,500 200 - 35 - 5600 200 - 35 - 1210 3 Trust Funds 3,000 300 - 35",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}