{
    "relation": [
        [
            "Date",
            "Aug 30, 1999",
            "Apr 24, 2001",
            "Jun 22, 2001",
            "Aug 6, 2002",
            "Apr 6, 2005",
            "May 23, 2005",
            "May 23, 2005",
            "Nov 30, 2005",
            "Feb 9, 2006",
            "Feb 18, 2009",
            "Feb 19, 2009",
            "Feb 20, 2013"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "CC",
            "REMI",
            "SULP",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: NOVA MOLECULAR, INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SEVIGNY, PIERRE;SCHAPPERT, KEITH;WIEBUSCH, HEIKO;REEL/FRAME:010200/0082;SIGNING DATES FROM 19990729 TO 19990810",
            "",
            "",
            "",
            "",
            "",
            "Year of fee payment: 4",
            "Owner name: MCGILL UNIVERSITY, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:NUVELO, INC.;REEL/FRAME:017251/0150 Effective date: 20050507 Owner name: NUVELO, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:VARIAGENICS, INC.;HYSEQ, INC.;REEL/FRAME:017240/0652 Effective date: 20030131",
            "Owner name: POIRIER, JUDES, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCGILL UNIVERSITY;REEL/FRAME:017240/0778 Effective date: 20041028",
            "Year of fee payment: 8",
            "Owner name: HYSEQ, INC. UNDER THE NAME OF NUVELO, INC., CALIFO Free format text: MERGER;ASSIGNOR:VARIAGENICS, INC.;REEL/FRAME:022277/0167 Effective date: 20030131 Owner name: POIRIER, JUDES, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MCGILL UNIVERSITY;REEL/FRAME:022277/0174 Effective date: 20041028 Owner name: SPECTRAL NEUROSCIENCE INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:TECHNO-SYNAPSE INC.;REEL/FRAME:022277/0214 Effective date: 20070628 Owner name: NOVARTIS INTERNATIONAL PHARMACEUTICALS LTD., BERMU Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SPECTRAL NEUROSCIENCE INC.;REEL/FRAME:022277/0222 Effective date: 20070628 Owner name: TECHNO-SYNAPSE INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:POIRIER, JUDES;REEL/FRAME:022277/0189 Effective date: 20050115",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6291175 - Methods for treating a neurological disease by determining BCHE genotype - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6291175?dq=6,219,045",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00007-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487783771,
    "recordOffset": 487743971,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5981=8 1 2416 DNA Homo sapiens 1 tactgaatgt cagtgcagtc caatttacag gctggagcag cagctgcatc ctgcatttcc 60 ccgaagtatt acatgatttt cactccttgc aaactttacc atctttgttg cagagaatcg 120 gaaatcaata tgcatagcaa agtcacaatc atatgcatca gatttctctt ttggtttctt 180 ttgctctgca tgcttattgg gaagtcacat actgaagatg acatcataat tgcaacaaag 240 aatggaaaag tcagagggat gaacttgaca gtttttggtg gcacggtaac agcctttctt 300 ggaattccct atgcacagcc acctcttggt agacttcgat tcaaaaagcc acagtctctg 360 accaagtggt ctgatatttg gaatgccaca aaatatgcaa attcttgctg tcagaacata 420 gatcaaagtt ttccaggctt ccatggatca gagatgtgga acccaaacac tgacctcagt 480 gaagactgtt tatatctaaa tgtatggatt ccagcaccta aaccaaaaaa tgccactgta 540 ttgatatgga tttatggtgg tggttttcaa actggaacat catctttaca tgtttatgat 600 ggcaagtttc tggctcgggt tgaaagagtt attgtagtgt caatgaacta tagggtgggt 660 gccctaggat tcttagcttt gccaggaaat cctgaggctc cagggaacat gggtttattt 720 gatcaacagt tggctcttca gtgggttcaa aaaaatatag cagcctttgg tggaaatcct 780 aaaagtgtaa ctctctttgg agaaagtgca ggagcagctt cagttagcct gcatttgctt 840 tctcctggaa gccattcatt gttcaccaga gccattctgc aaagtggatc ctttaatgct 900 ccttgggcgg taacatctct ttatgaagct aggaacagaa cgttgaactt agctaaattg 960 actggttgct ctagagagaa tgagactgaa ataatcaagt gtcttagaaa taaagatccc 1020 caagaaattc ttctgaatga agcatttgtt gtcccctatg ggactccttt gtcagtaaac 1080 tttggtccga ccgtggatgg tgattttctc actgacatgc cagacatatt acttgaactt 1140 ggacaattta aaaaaaccca gattttggtg ggtgttaata aagatgaagg gacagctttt 1200 ttagtctatg gtgctcctgg cttcagcaaa gataacaata gtatcataac tagaaaagaa 1260 tttcaggaag gtttaaaaat attttttcca ggagtgagtg agtttggaaa ggaatccatc 1320 ctttttcatt acacagactg ggtagatgat cagagacctg aaaactaccg tgaggccttg 1380 ggtgatgttg ttggggatta taatttcata tgccctgcct tggagttcac caagaagttc 1440 tcagaatggg gaaataatgc ctttttctac tattttgaac accgatcctc caaacttccg 1500 tggccagaat ggatgggagt gatgcatggc tatgaaattg aatttgtctt tggtttacct 1560 ctggaaagaa gagataatta cacaaaagcc gaggaaattt tgagtagatc catagtgaaa 1620 cggtgggcaa attttgcaaa atatgggaat ccaaatgaga ctcagaacaa tagcacaagc 1680 tggcctgtct tcaaaagcac tgaacaaaaa tatctaacct tgaatacaga gtcaacaaga 1740 ataatgacga aactacgtgc tcaacaatgt cgattctgga catcattttt tccaaaagtc 1800 ttggaaatga caggaaatat tgatgaagca gaatgggagt ggaaagcagg attccatcgc 1860 tggaacaatt acatgatgga ctggaaaaat caatttaacg attacactag caagaaagaa 1920 agttgtgtgg gtctctaatt aatagattta ccctttatag aacatatttt cctttagatc 1980 aaggcaaaaa tatcaggagc ttttttacac acctactaaa aaagttatta tgtagctgaa 2040 acaaaaatgc cagaaggata atattgattc ctcacatctt taacttagta ttttacctag 2100 catttcaaaa cccaaatggc tagaacatgt ttaattaaat ttcacaatat aaagttctac 2160 agttaattat gtgcatatta aaacaatggc ctggttcaat ttctttcttt ccttaataaa 2220 tttaagtttt ttccccccaa aattatcagt gctctgcttt tagtcacgtg tattttcatt 2280 accactcgta aaaaggtatc ttttttaaat gaattaaata ttgaaacact gtacaccata 2340 gtttacaata ttatgtttcc taattaaaat aagaattgaa tgtcaatatg agatattaaa 2400 ataagcacag aaaatc 2416 2 2416 DNA Homo sapiens 2 tactgaatgt cagtgcagtc caatttacag gctggagcag cagctgcatc ctgcatttcc 60 ccgaagtatt acatgatttt cactccttgc aaactttacc atctttgttg cagagaatcg 120 gaaatcaata tgcatagcaa agtcacaatc atatgcatca gatttctctt ttggtttctt 180 ttgctctgca tgcttattgg gaagtcacat actgaagatg acatcataat tgcaacaaag 240 aatggaaaag tcagagggat gaacttgaca gtttttggtg gcacggtaac agcctttctt 300 ggaattccct atgcacagcc acctcttggt agacttcgat tcaaaaagcc acagtctctg 360 accaagtggt ctgatatttg gaatgccaca aaatatgcaa attcttgctg tcagaacata 420 gatcaaagtt ttccaggctt ccatggatca gagatgtgga acccaaacac tgacctcagt 480 gaagactgtt tatatctaaa tgtatggatt ccagcaccta aaccaaaaaa tgccactgta 540 ttgatatgga tttatggtgg tggttttcaa actggaacat catctttaca tgtttatgat 600 ggcaagtttc tggctcgggt tgaaagagtt attgtagtgt caatgaacta tagggtgggt 660 gccctaggat tcttagcttt gccaggaaat cctgaggctc cagggaacat gggtttattt 720 gatcaacagt tggctcttca gtgggttcaa aaaaatatag cagcctttgg tggaaatcct 780 aaaagtgtaa ctctctttgg agaaagtgca ggagcagctt cagttagcct gcatttgctt 840 tctcctggaa gccattcatt gttcaccaga gccattctgc aaagtggatc ctttaatgct 900 ccttgggcgg taacatctct ttatgaagct aggaacagaa cgttgaactt agctaaattg 960 actggttgct ctagagagaa tgagactgaa ataatcaagt gtcttagaaa taaagatccc 1020 caagaaattc ttctgaatga agcatttgtt gtcccctatg ggactccttt gtcagtaaac 1080 tttggtccga ccgtggatgg tgattttctc actgacatgc cagacatatt acttgaactt 1140 ggacaattta aaaaaaccca gattttggtg ggtgttaata aagatgaagg gacagctttt 1200 ttagtctatg gtgctcctgg cttcagcaaa gataacaata gtatcataac tagaaaagaa 1260 tttcaggaag gtttaaaaat attttttcca ggagtgagtg agtttggaaa ggaatccatc 1320 ctttttcatt acacagactg ggtagatgat cagagacctg aaaactaccg tgaggccttg 1380 ggtgatgttg ttggggatta taatttcata tgccctgcct tggagttcac caagaagttc 1440 tcagaatggg gaaataatgc ctttttctac tattttgaac accgatcctc caaacttccg 1500 tggccagaat ggatgggagt gatgcatggc tatgaaattg aatttgtctt tggtttacct 1560 ctggaaagaa gagataatta cacaaaagcc gaggaaattt tgagtagatc catagtgaaa 1620 cggtgggcaa attttgcaaa atatgggaat ccaaatgaga ctcagaacaa tagcacaagc 1680 tggcctgtct tcaaaagcac tgaacaaaaa tatctaacct tgaatacaga gtcaacaaga 1740 ataatgacga aactacgtgc tcaacaatgt cgattctgga catcattttt tccaaaagtc 1800 ttggaaatga caggaaatat tgatgaaaca gaatgggagt ggaaagcagg attccatcgc 1860 tggaacaatt acatgatgga ctggaaaaat caatttaacg attacactag caagaaagaa 1920 agttgtgtgg gtctctaatt aatagattta ccctttatag aacatatttt cctttagatc 1980 aaggcaaaaa tatcaggagc ttttttacac acctactaaa aaagttatta tgtagctgaa 2040 acaaaaatgc cagaaggata atattgattc ctcacatctt taacttagta ttttacctag 2100 catttcaaaa cccaaatggc tagaacatgt ttaattaaat ttcacaatat aaagttctac 2160 agttaattat gtgcatatta aaacaatggc ctggttcaat ttctttcttt ccttaataaa 2220 tttaagtttt ttccccccaa aattatcagt gctctgcttt tagtcacgtg tattttcatt 2280 accactcgta aaaaggtatc ttttttaaat gaattaaata ttgaaacact gtacaccata 2340 gtttacaata ttatgtttcc taattaaaat aagaattgaa tgtcaatatg agatattaaa 2400 ataagcacag aaaatc 2416 3 602 PRT Homo sapiens 3 Met His Ser Lys Val Thr Ile Ile Cys Ile Arg Phe Leu Phe Trp Phe 1 5 10 15 Leu Leu Leu Cys Met Leu Ile Gly Lys Ser His Thr Glu Asp Asp Ile 20 25 30 Ile Ile Ala Thr Lys Asn Gly Lys Val Arg Gly Met Asn Leu Thr Val 35 40 45 Phe Gly Gly Thr Val Thr Ala Phe Leu Gly Ile Pro Tyr Ala Gln Pro 50 55 60 Pro Leu Gly Arg Leu Arg Phe Lys Lys Pro Gln Ser Leu Thr Lys Trp 65 70 75 80 Ser Asp Ile Trp Asn Ala Thr Lys Tyr Ala Asn Ser Cys Cys Gln Asn 85 90 95 Ile Asp Gln Ser Phe Pro Gly Phe His Gly Ser Glu Met Trp Asn Pro 100 105 110 Asn Thr Asp Leu Ser Glu Asp Cys Leu Tyr Leu Asn Val Trp Ile Pro 115 120 125 Ala Pro Lys Pro Lys Asn Ala Thr Val Leu Ile Trp Ile Tyr Gly Gly 130 135 140 Gly Phe Gln Thr Gly Thr Ser Ser Leu His Val Tyr Asp Gly Lys Phe 145 150 155 160 Leu Ala Arg Val Glu Arg Val Ile Val Val Ser Met Asn Tyr Arg Val 165 170 175 Gly Ala Leu Gly Phe Leu Ala Leu Pro Gly Asn Pro Glu Ala Pro Gly 180 185 190 Asn Met Gly Leu Phe Asp Gln Gln Leu Ala Leu Gln Trp Val Gln Lys 195 200 205 Asn Ile Ala Ala Phe Gly Gly Asn Pro Lys Ser Val Thr Leu Phe Gly 210 215 220 Glu Ser Ala Gly Ala Ala Ser Val Ser Leu His Leu Leu Ser Pro Gly 225 230 235 240 Ser His Ser Leu Phe Thr Arg Ala Ile Leu Gln Ser Gly Ser Phe Asn 245 250 255 Ala Pro Trp Ala Val Thr Ser Leu Tyr Glu Ala Arg Asn Arg Thr Leu 260 265 270 Asn Leu Ala Lys Leu Thr Gly Cys Ser Arg Glu Asn Glu Thr Glu Ile 275 280 285 Ile Lys Cys Leu Arg Asn Lys Asp Pro Gln Glu Ile Leu Leu Asn Glu 290 295 300 Ala Phe Val Val Pro Tyr Gly Thr Pro Leu Ser Val Asn Phe Gly Pro 305 310 315 320 Thr Val Asp Gly Asp Phe Leu Thr Asp Met Pro Asp Ile Leu Leu Glu 325 330 335 Leu Gly Gln Phe Lys Lys Thr Gln Ile Leu Val Gly Val Asn Lys Asp 340 345 350 Glu Gly Thr Ala Phe Leu Val Tyr Gly Ala Pro Gly Phe Ser Lys Asp 355 360 365 Asn Asn Ser Ile Ile Thr Arg Lys Glu Phe Gln Glu Gly Leu Lys Ile 370 375 380 Phe Phe Pro Gly Val Ser Glu Phe Gly Lys Glu Ser Ile Leu Phe His 385 390 395 400 Tyr Thr Asp Trp Val Asp Asp Gln Arg Pro Glu Asn Tyr Arg Glu Ala 405 410 415 Leu Gly Asp Val Val Gly Asp Tyr Asn Phe Ile Cys Pro Ala Leu Glu 420 425 430 Phe Thr Lys Lys Phe Ser Glu Trp Gly Asn Asn Ala Phe Phe Tyr Tyr 435 440 445 Phe Glu His Arg Ser Ser Lys Leu Pro Trp Pro Glu Trp Met Gly Val 450 455 460 Met His Gly Tyr Glu Ile Glu Phe Val Phe Gly Leu Pro Leu Glu Arg 465 470 475 480 Arg Asp Asn Tyr Thr Lys Ala Glu Glu Ile Leu Ser Arg Ser Ile Val 485 490 495 Lys Arg Trp Ala Asn Phe Ala Lys Tyr Gly Asn Pro Asn Glu Thr Gln 500 505 510 Asn Asn Ser Thr Ser Trp Pro Val Phe Lys Ser Thr Glu Gln Lys Tyr 515 520 525 Leu Thr Leu Asn Thr Glu Ser Thr Arg Ile Met Thr Lys Leu Arg Ala 530 535 540 Gln Gln Cys Arg Phe Trp Thr Ser Phe Phe Pro Lys Val Leu Glu Met 545 550 555 560 Thr Gly Asn Ile Asp Glu Ala Glu Trp Glu Trp Lys Ala Gly Phe His 565 570 575 Arg Trp Asn Asn Tyr Met Met Asp Trp Lys Asn Gln Phe Asn Asp Tyr 580 585 590 Thr Ser Lys Lys Glu Ser Cys Val Gly Leu 595 600 4 602 PRT Homo sapiens 4 Met His Ser Lys Val Thr Ile Ile Cys Ile Arg Phe Leu Phe Trp Phe 1 5 10 15 Leu Leu Leu Cys Met Leu Ile Gly Lys Ser His Thr Glu Asp Asp Ile 20 25 30 Ile Ile Ala Thr Lys Asn Gly Lys Val Arg Gly Met Asn Leu Thr Val 35 40 45 Phe Gly Gly Thr Val Thr Ala Phe Leu Gly Ile Pro Tyr Ala Gln Pro 50 55 60 Pro Leu Gly Arg Leu Arg Phe Lys Lys Pro Gln Ser Leu Thr Lys Trp 65 70 75 80 Ser Asp Ile Trp Asn Ala Thr Lys Tyr Ala Asn Ser Cys Cys Gln Asn 85 90 95 Ile Asp Gln Ser Phe Pro Gly Phe His Gly Ser Glu Met Trp Asn Pro 100 105 110 Asn Thr Asp Leu Ser Glu Asp Cys Leu Tyr Leu Asn Val Trp Ile Pro 115 120 125 Ala Pro Lys Pro Lys Asn Ala Thr Val Leu Ile Trp Ile Tyr Gly Gly 130 135 140 Gly Phe Gln Thr Gly Thr Ser Ser Leu His Val Tyr Asp Gly Lys Phe 145 150 155 160 Leu Ala Arg Val Glu Arg Val Ile Val Val Ser Met Asn Tyr Arg Val 165 170 175 Gly Ala Leu Gly Phe Leu Ala Leu Pro Gly Asn Pro Glu Ala Pro Gly 180 185 190 Asn Met Gly Leu Phe Asp Gln Gln Leu Ala Leu Gln Trp Val Gln Lys 195 200 205 Asn Ile Ala Ala Phe Gly Gly Asn Pro Lys Ser Val Thr Leu Phe Gly 210 215 220 Glu Ser Ala Gly Ala Ala Ser Val Ser Leu His Leu Leu Ser Pro Gly 225 230 235 240 Ser His Ser Leu Phe Thr Arg Ala Ile Leu Gln Ser Gly Ser Phe Asn 245 250 255 Ala Pro Trp Ala Val Thr Ser Leu Tyr Glu Ala Arg Asn Arg Thr Leu 260 265 270 Asn Leu Ala Lys Leu Thr Gly Cys Ser Arg Glu Asn Glu Thr Glu Ile 275 280 285 Ile Lys Cys Leu Arg Asn Lys Asp Pro Gln Glu Ile Leu Leu Asn Glu 290 295 300 Ala Phe Val Val Pro Tyr Gly Thr Pro Leu Ser Val Asn Phe Gly Pro 305 310 315 320 Thr Val Asp Gly Asp Phe Leu Thr Asp Met Pro Asp Ile Leu Leu Glu 325 330 335 Leu Gly Gln Phe Lys Lys Thr Gln Ile Leu Val Gly Val Asn Lys Asp 340 345 350 Glu Gly Thr Ala Phe Leu Val Tyr Gly Ala Pro Gly Phe Ser Lys Asp 355 360 365 Asn Asn Ser Ile Ile Thr Arg Lys Glu Phe Gln Glu Gly Leu Lys Ile 370 375 380 Phe Phe Pro Gly Val Ser Glu Phe Gly Lys Glu Ser Ile Leu Phe His 385 390 395 400 Tyr Thr Asp Trp Val Asp Asp Gln Arg Pro Glu Asn Tyr Arg Glu Ala 405 410 415 Leu Gly Asp Val Val Gly Asp Tyr Asn Phe Ile Cys Pro Ala Leu Glu 420 425 430 Phe Thr Lys Lys Phe Ser Glu Trp Gly Asn Asn Ala Phe Phe Tyr Tyr 435 440 445 Phe Glu His Arg Ser Ser Lys Leu Pro Trp Pro Glu Trp Met Gly Val 450 455 460 Met His Gly Tyr Glu Ile Glu Phe Val Phe Gly Leu Pro Leu Glu Arg 465 470 475 480 Arg Asp Asn Tyr Thr Lys Ala Glu Glu Ile Leu Ser Arg Ser Ile Val 485 490 495 Lys Arg Trp Ala Asn Phe Ala Lys Tyr Gly Asn Pro Asn Glu Thr Gln 500 505 510 Asn Asn Ser Thr Ser Trp Pro Val Phe Lys Ser Thr Glu Gln Lys Tyr 515 520 525 Leu Thr Leu Asn Thr Glu Ser Thr Arg Ile Met Thr Lys Leu Arg Ala 530 535 540 Gln Gln Cys Arg Phe Trp Thr Ser Phe Phe Pro Lys Val Leu Glu Met 545 550 555 560 Thr Gly Asn Ile Asp Glu Thr Glu Trp Glu Trp Lys Ala Gly Phe His 565 570 575 Arg Trp Asn Asn Tyr Met Met Asp Trp Lys Asn Gln Phe Asn Asp Tyr 580 585 590 Thr Ser Lys Lys Glu Ser Cys Val Gly Leu 595 600 5 27 DNA Homo sapiens 5 ctgtactgtg tagttagaga aaatggc 27 6 30 DNA Homo sapiens 6 tttttacgag tggtaatgaa aatacacgtg 30 7 26 DNA Homo sapiens 7 ccacacaact ttctttcttg ctagtg 26 8 26 DNA Homo sapiens 8 gccttttgta ttcgaaatta tttttc 26}",
    "TableContextTimeStampAfterTable": "{26496=By “non-cholinomimetic vasopressinergic therapy” is meant a therapy that utilizes a vasopressinergic modulator such as, for example, S12024 (provided by Servier, Les Laboratoires Servier, 22 rue Gamier, 92200 Neuilly sur Seine, France)., 43290=However, when the treated group was stratified using the k-allele genotype, a statistically significant difference (p<0.05) in drug-mediated improvement was observed in the non-k-allele subgroup (n=30) as compared to the k-allele subgroup (n=61) (Table 2). The non-k-allele group had the highest MMSE score, indicating an improvement in cognitive ability, while the k-allele group had the lowest MMSE score, indicating a deterioration in cognitive ability. Thus, the k-allele genotyping distinguished two genetically different groups within the treatment group that responded differently to non-cholinomimetic therapy. Stated another way, the k-allele genotyping revealed that there was indeed a patient subgroup that can favorably respond to the non-cholinomimetic therapy S12024 for AD., 40350=In addition to the above-mentioned methods, the methods provided in any of the pending applications (U. S. Pat. Nos. 5,935,781 and 6,022,683, and U. S. Application Ser. Nos. 97/22699, 08/991,850, and 09/160,462) and following references (Brindle N. et al., Hum. Mol. Genet. 7:933-935 (1998); Singleton et al., Hum Mol Genet 7:937-939 (1998); Lehmann et al., Hum. Mol. Genet. 6:1933-1936 (1997); Richard et al., Lancet 349:539 (1997); and Gustincich S, et al., Biotechniques 11(3):298-300 (1998)) may also be used., 33207=FIG. 2 is a depiction of the cDNA sequence of the human butyrylcholinesterase K-allele (BCHE-K) with the single nucleotide polymorphism at base 1828 indicated in bold (SEQ ID NO: 2)., 42751=When the total number of patients administered a placebo (n=108) versus the total number of patients administered the non-cholinomimetic therapy S12024 (n=91), were analyzed for an improvement in their MMSE score irrespective of their k-allele genotype, no statistically significant difference was observed between the two groups (p>0.05). Analyzed in this way, the data would suggest that the non-cholinomimetic vasopressinergic therapy was ineffective for improving Alzheimer's disease in these patients (Table 1)., 150758=In addition, while determining the presence or absence of the butyrylcholinesterase K allele is a clear predictor for determining the efficacy of a drug in a given patient, other BCHE allelic variants of reduced catalytic activity are envisioned as predicting drug efficacy using the methods described herein. In particular, the methods of the invention may be used to treat patients with any of the following known BCHE mutations (e.g., deletions (BCHE*FS4), missense mutations (BCHE*24 M, *1005, *250P, *267R, *330I, *365R, *418S, *515C), and nonsense mutations (BCHE*119STOP, *465STOP))., 29585=By “BCHE-K allele (k-allele)” is meant a polymorphism of the butyrylcholinesterase (BCHE) gene which involves a point mutation at nucleotide 1828 that changes amino acid residue 539 from alanine to threonine and can result in an enzyme with reduced catalytic activity., 35650=The butyrylcholinesterase (BCHE) gene product is expressed in most human tissues, but its precise metabolic function in the body is still unknown. We have found that the polymorphic gene variant BCHE-K, consisting of a point mutation at nucleotide 1828 (GCA to ACA) which changes alanine 539 to threonine and can result in reduced catalytic activity (see FIGS. 1-4), has strong predictive value for determining if cholinomimetic (e.g., tacrine) or non-cholinomimetic (e.g., vasopressinergics) therapies will help a patient at risk for a neurological disease., 18475=This Application claims benefit of Provisional application Ser. No 60/089,406 filed Jun. 16, 1998., 53756=First, we analyzed the relationship between an AD patient's response to a non-cholinomimetic therapy (S12024 from Servier; administered at a dose of 100 mg per day) as a function of apoE4 genotype and these results are presented in Table 3., 41116=To demonstrate the effectiveness of the BCHE-K allele as a predictor of non-cholinomimetic drug efficacy in patients at risk for a neurological disease, we analyzed the genomic DNA and cognitive scores of the AD patient group of Richard et al. (Lancet 349:539 (1997)). In this study, 199 patients diagnosed with Alzheimer's disease were divided into two groups and one group (n=91) was administered a non-cholinomimetic therapy (the vasopressinergic drug, S12024, from Servier; administered at 100 mg per day) and the other group (n=108) was administered a placebo.}",
    "textBeforeTable": "Patent Citations 8 gccttttgta ttcgaaatta tttttc 26 Homo sapiens DNA 26 8 7 ccacacaact ttctttcttg ctagtg 26 Homo sapiens DNA 26 7 6 tttttacgag tggtaatgaa aatacacgtg 30 Homo sapiens DNA 30 6 5 ctgtactgtg tagttagaga aaatggc 27 Homo sapiens DNA 27 5 4 Met His Ser Lys Val Thr Ile Ile Cys Ile Arg Phe Leu Phe Trp Phe 1 5 10 15 Leu Leu Leu Cys Met Leu Ile Gly Lys Ser His Thr Glu Asp Asp Ile 20 25 30 Ile Ile Ala Thr Lys Asn Gly Lys Val Arg Gly Met Asn Leu Thr Val 35 40 45 Phe Gly Gly Thr Val Thr Ala Phe Leu Gly Ile Pro Tyr Ala Gln Pro 50 55 60 Pro Leu Gly Arg Leu Arg Phe Lys Lys Pro Gln Ser Leu Thr Lys Trp 65 70 75 80 Ser Asp Ile Trp Asn Ala Thr Lys Tyr Ala Asn Ser Cys Cys Gln Asn 85 90 95 Ile Asp Gln Ser Phe Pro Gly Phe His Gly Ser Glu Met Trp Asn Pro 100 105 110 Asn Thr Asp Leu Ser Glu Asp Cys",
    "textAfterTable": "Classifications U.S. Classification 435/6.11, 536/23.1, 424/9.2, 514/18.1, 514/15.1, 514/17.8, 514/11.1, 514/10.9, 514/17.7, 514/12.2, 514/8.4, 514/10.8, 435/6.16 International Classification A61P25/28, A61K45/00, A61P25/00, A61K31/435, C12N15/09, A61K48/00, C12Q1/68 Cooperative Classification C12Q2600/172, C12Q2600/106, C12Q2600/156, C12Q1/6883 European Classification C12Q1/68M6 Legal Events Date Code Event Description Aug 30, 1999 AS Assignment Owner name: NOVA MOLECULAR, INC., CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SEVIGNY, PIERRE;SCHAPPERT, KEITH;WIEBUSCH, HEIKO;REEL/FRAME:010200/0082;SIGNING DATES FROM 19990729 TO 19990810 Apr 24, 2001 AS Assignment Jun 22, 2001 AS Assignment",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}