{
    "relation": [
        [
            "Patent application number",
            "20130269916",
            "20140328667"
        ],
        [
            "Description",
            "VAPOR COMPRESSION SYSTEM - A distributor for use in a vapor compression system includes an enclosure configured to be positioned in a heat exchanger having a tube bundle including a plurality of tubes extending substantially horizontally in the heat exchanger. At least one distribution device formed in an end of the enclosure positioned to face the tube bundle, the at least one distribution device configured to apply a fluid entering the distributor onto the tube bundle. The enclosure has an aspect ratio between about 1/2:1 and about 10:1.",
            "VARIABLE GEOMETRY DIFFUSER HAVING EXTENDED TRAVEL AND CONTROL METHOD THEREOF - An improved variable geometry diffuser (VGD) mechanism for use with a centrifugal compressor. This VGD mechanism extends substantially completely into the diffuser gap so that the VGD mechanism may be used more fully to control other operational functions. The VGD mechanism may be used to minimize compressor backspin and associated transient loads during compressor shut down by preventing a reverse flow of refrigerant gas through the diffuser gap during compressor shutdown, which is prevented because the diffuser gap is substantially blocked by the full extension of the diffuser ring. During start-up, transient surge and stall also can be effectively eliminated as gas flow through the diffuser gap can be impeded as load and impeller speed increase, thereby alleviating the problems caused by startup loads at low speeds. The VGD mechanism can be used for capacity control as well so as to achieve more effective turndown at low loads."
        ],
        [
            "Published",
            "10-17-2013",
            "11-06-2014"
        ]
    ],
    "pageTitle": "Kauffman, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/kauffman-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 429958527,
    "recordOffset": 429924536,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Justin P. Kauffman, York, PA US 08-02-2012 Heat Recovery System Series Arrangements - The present disclosure is directed to heat recovery systems that employ two or more organic Rankine cycle (ORC) units disposed in series. According to certain embodiments, each ORC unit includes an evaporator that heats an organic working fluid, a turbine generator set that expands the working fluid to generate electricity, a condenser that cools the working fluid, and a pump that returns the working fluid to the evaporator. The heating fluid is directed through each evaporator to heat the working fluid circulating within each ORC unit, and the cooling fluid is directed through each condenser to cool the working fluid circulating within each ORC unit. The heating fluid and the cooling fluid flow through the ORC units in series in the same or opposite directions. 20120192563 05-17-2012 METHOD AND APPARATUS FOR VARIABLE REFRIGERANT CHILLER OPERATION - A refrigeration system includes a compressor, a condenser, an expansion device, an evaporator, and an additional refrigerant vessel connected in a closed refrigerant loop. The additional refrigerant vessel is connected to the condenser at the high pressure side by a first valve and to the evaporator at a low pressure side by a second valve. A controller controls operation of the first valve and the second valve. Only one of the first valve and the second valve may be open at the same time. Refrigerant from the additional refrigerant vessel may be added to",
    "textAfterTable": "Kathleen M. Kauffman, Olney, MD US Patent application number Description Published 20130254831 METHOD AND APPARATUS FOR CONTEXT AWARE MOBILE SECURITY - An approach is provided for causing a change in a security policy of a device based on contextual information. The approach involves determining context information associated with a device. The approach also involves determining a security policy of the device. The approach further involves determining a change of the context information. The approach additionally involves processing the determined change of the context information to cause, at least in part, a revision of the security policy of the device. 09-26-2013 Keith Kauffman, Wichita, KS US Patent application number Description Published 20100138626 Use of reservation concepts in managing maintenance actions in a storage control system - A computationally implemented method, system, and product for managing maintenance activities in a storage control system are disclosed. A disk drive has a reservation status that is monitored. A reservation ID is assigned to a successful reservation request. The reservation ID of a drive request is compared to the reservation ID of a disk drive. 06-03-2010 Keith L. Kauffman, Ann Arbor, MI US Patent application number Description Published 20110121628 VEHICULAR SEAT BACK ASSEMBLY - A molded plastic seat back assembly for a vehicle including at least two polymeric vertical support members including a top",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}