{
    "relation": [
        [
            "RDF Property:",
            "Definition:",
            "Range:",
            "Usage note:",
            "See also:"
        ],
        [
            "dct:modified",
            "Most recent date on which the dataset was changed, updated or modified.",
            "rdfs:Literal encoded using the relevant ISO 8601 Date and Time compliant string and typed using the appropriate XML Schema datatype [xmlschema-2]",
            "The value of this property indicates a change to the actual dataset, not a change to the catalog record. An absent value may indicate that the dataset has never changed after its initial publication, or that the date of last modification is not known, or that the dataset is continuously updated.",
            "frequency"
        ]
    ],
    "pageTitle": "Data Catalog Vocabulary (DCAT)",
    "title": "",
    "url": "http://www.w3.org/TR/2013/CR-vocab-dcat-20131105/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 828820079,
    "recordOffset": 828797462,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7344=This document was published by the Government Linked Data Working Group as a Candidate Recommendation. This document is intended to become a W3C Recommendation. If you wish to make comments regarding this document, please send them to public-gld-comments@w3.org (subscribe, archives). W3C publishes a Candidate Recommendation to indicate that the document is believed to be stable and to encourage implementation by the developer community. This Candidate Recommendation is expected to advance to Proposed Recommendation no earlier than 26 November 2013. All comments are welcome., 10338=Copyright © 2012-2013 W3C® (MIT, ERCIM, Keio, Beihang), All Rights Reserved. W3C liability, trademark and document use rules apply., 5984=This document was produced by a group operating under the 5 February 2004 W3C Patent Policy. W3C maintains a public list of any patent disclosures made in connection with the deliverables of the group; that page also includes instructions for disclosing a patent. An individual who has actual knowledge of a patent which the individual believes contains Essential Claim(s) must disclose the information in accordance with section 6 of the W3C Patent Policy.}",
    "TableContextTimeStampAfterTable": "{71301=Changes since W3C Last Call working Draft 12 March 2013:, 70407=Changes since the second W3C Last Call working Draft 01 August 2013:, 10836=If the catalog publisher decides to keep metadata describing its records (i.e. the records containing metadata describing the datasets), dcat:CatalogRecord can be used. For example, while  :dataset-001 was issued on 2011-12-05, its description on Imaginary Catalog was added on 2011-12-11. This can be represented by DCAT as in the following:}",
    "lastModified": "Tue, 05 Nov 2013 15:30:33 GMT",
    "textBeforeTable": "The following properties are recommended for use on this class: catalog record, dataset, description, homepage, language, license, publisher, release date, rights, spatial, themes, title, update date 5.1 Class: Catalog 5. Vocabulary specification Notice that we used dcat:downloadURL with the downloadable distribution and that the other distribution through the landing page does not have to be defined as a separate dcat:Distribution instance. . dcat:mediaType \"text/csv\" ; dcat:downloadURL <http://example.org/dataset-003.csv> . a dcat:Distribution ;  :dataset-003-csv . dcat:distribution :dataset-003-csv ; dcat:landingPage <http://example.org/dataset-003.html> ; a dcat:Dataset ;   :dataset-003 On the other hand, :dataset-003 can be obtained through some landing page but also can be downloaded from a known URL.  4.5 A dataset available as download and behind some Web page   Notice the use of dcat:landingPage and the definition of the dcat:Distribution instance. . dcat:mediaType \"text/csv\" ; dcat:accessURL <http://example.org/dataset-002.html> ; a dcat:Distribution ;  :dataset-002-csv . dcat:distribution :dataset-002-csv ; dcat:landingPage <http://example.org/dataset-002.html> ; a dcat:Dataset ;   :dataset-002 :dataset-002 is available as a CSV file. However :dataset-002 can only be obtained through some Web page where the user needs to click some links, provide some information and check some boxes before accessing the data 4.4 A dataset available only behind some Web page",
    "textAfterTable": "RDF Property: dct:title Definition: A name given to the catalog. Range: rdfs:Literal Property: description RDF Property: dct:description Definition: A free-text account of the catalog. Range: rdfs:Literal Property: release date RDF Property: dct:issued Definition: Date of formal issuance (e.g., publication) of the catalog. Range: rdfs:Literal encoded using the relevant ISO 8601 Date and Time compliant string and typed using the appropriate XML Schema datatype [xmlschema-2] See also: dataset release date, catalog record listing date and distribution release date Property: update/modification date RDF Property: dct:modified Definition: Most recent date on which the catalog was changed, updated or modified. Range: rdfs:Literal encoded using the relevant ISO 8601 Date and Time compliant string and typed using the appropriate XML Schema datatype [xmlschema-2] See also: dataset modification date, catalog record modification date and distribution modification date",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}