{
    "relation": [
        [
            "Reason Code",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8"
        ],
        [
            "Condition",
            "Occurs when a TC 30X with DLN blocking series of 790-799 or 900-999, priority code other than 2/3 the settlement amount field on the TC 30X does not equal ≡ ≡ ≡ ≡ ≡ ≡ ) the net of posted TC 150, 29X and 30X.",
            "Occurs when a TC 290 or 291 attempting to post to a credit balance module frozen by TC 570 with Doc Code 54.",
            "Occurs when a TC 290 with Priority Code 6 with significant amount attempts to post to a module where the posted return (TC 150) has a Math Status Code of other than \"3\" and TC 29X blocking series 770-789 is not posted.",
            "Occurs when a TC 290 with Priority Code 6 attempts to post to a module with an unreversed TC 470 Closing Code 094 posted.",
            "Occurs when a TC 291 (Blocking Series 150-199) with Priority Code 7 attempts to post to a module with an unreversed TC 470 Closing Code 094 not posted.",
            "Occurs when a TC 470 with Closing Code 094 attempts to post to a module which is not under the Math Error (-G) Freeze.",
            "Occurs when an input TC 29X record contains blocking series 770-789 and there is a posted unreversed TC 470 CC 094 in the module.",
            "Occurs when a TC 290 for zero with Priority Code 4 attempts to post with a secondary transaction."
        ],
        [
            "Resolution",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator.",
            "GUF Auto-Closed URC 2 to originator."
        ]
    ],
    "pageTitle": "Internal Revenue Manual - 3.12.279 BMF/CAWR/PMF Unpostable Resolution (Cont. 1)",
    "title": "",
    "url": "http://www.irs.gov/irm/part3/irm_03-012-279r-cont01.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 517329519,
    "recordOffset": 517286671,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{15067=Form 1120-FSC, Foreign Sales Corporation, with Form 8279 attached., 345301=Form 1065, U.S. Return of Partnership Income, 113020=TC 150, Form 1120-FSC, U.S. Income Tax Return of a Foreign Sales Corporation, Doc Code 07, with a TC 060 posted to the MF., 176595=Reason Code 2 occurs when an input TC 971 AC 745 through the use of REQ77 (previously TC 400) attempts to post to a tax module and the Status is 29., 179898=TC 971 AC 745 will unpost if there is no return in the module., 154959=Rev Procedure 2002-38, 106325=Background Entity information-The Entity function processes Form 1128, Application to Adopt, Change or Retain a Tax Year, which are filed in accordance with specific Revenue Procedures and Internal Revenue Code Regulations. If unable to resolve the unpostable case and Command Code (CC) ENMOD contains a posted TC 053, 054, 055, 090 or 091 then reassign to Entity Unpostables., 155011=Grandfather Fiscal Year (for 1987 only), 14294=The following procedures are for a Form 1120-FSC, Foreign Sales Corporation, processed at the Ogden Campus only., 345106=Form 1041, U.S. Income Tax Return for Estates and Trusts, 126629=If the tax period ending date is not more than 6 days before the end of the month, enter the month shown (i.e., October 25, use the numeric designation for October, YY10)., 162664=Reason Code 8 occurs when the input fiscal month of the TC 150 for MFT 02, Doc Code 07 (Form 1120-FSC, U.S. Income Tax Return of a Foreign Sales Corporation) did not match entity FYM, TC 060 is posted but its effective date is greater than the tax period on input., 87631=Reason Code 4 occurs when a TC 150 for Form 941 series (MFT 01), Form 1120 series (MFT 02), Form 720, Quarterly Federal Excise Tax Return, (MFT 03), Form 940, Employer's Annual Federal Unemployment (FUTA) Tax Return, 0 (MFT 10), Form 944 series ( MFT 14), or Form 945, Annual Return of Withheld Federal Income Tax, (MFT 16) which is not a corrected UPC 305 attempts to post to a module where the credits claimed on the return exceed credits posted (not including TCs 610 or TCs 840) by ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ≡ ., 157089=Reason Code 2 occurs when any transaction except TC 421 or 424 with SPC 039, source code 60 and Employee Group Code is 1000/2000 and is attempting to open a module whose period ending is greater than 23C date plus 18 months., 155180=Form 1065 (Common Trust Fund), 159697=Reason Code 3 occurs when a TC 660 (estimated tax payment) for MFT 05, Form 1041, U.S. Fiduciary Income Tax Return (for Estates and Trusts) which is not establishing the first MFT 05 tax module, has a tax period month of other than 12, and does not match the Entity Fiscal Month., 154547=Returns and Extensions affected by the Tax Reform Act of 1986 (TRA) - Correct any Code and Edit or transcription errors, release using URC 6 or 8, as appropriate., 21136=An electronic filed Form 1041, U.S. Income Tax Return for Estates and Trusts, with an incorrect Employer Identification Number (EIN) must also address the Name Control when sending the Letter 147C., 276121=Reason Code 8 occurs when a TC 971 AC 747 is attempting to post to a Form 1120-F, U.S. Income Tax Return of a Foreign Corporation, module that does not contain an unreversed TC 971 AC 746., 121087=A copy of an approved Form 1128, Application to Adopt, Change, or Retain a Tax Year, with permission to change accounting period, or Form 8716, Election To Have a Tax Year Other Than a Required Tax Year, or a notice/letter stating they are allowed to file with an approved FYM is attached., 78320=The RTR Detail Screen can be researched for remittance information. See IRM 3.5.10 , Remittance Transaction Research (RTR) System. This screen contains the detailed information of each payment processed., 344792=Form 1120-C, U.S. Income Tax Return for Cooperative Associations, 179248=TC 971 AC 745 will unpost if the AIMS indicator (-L Freeze) is on., 14495=Form 8279 is an election filed by the taxpayer prior to October 1, 2000, to request approval to file as a Form 1120-FSC, Foreign Sales Corporation. A copy of the approved election must be submitted when the taxpayer files his Form 1120-FSC, Foreign Sales Corporation. Once the election is made, it remains in effect until terminated or revoked. Form 8279 must be processed with an International EIN and can be identified as a TC 060 on CC ENMOD., 120960=Form 1120, U.S. Corporation Income Tax Return, consolidated return., 17720=Form 1120-FSC, Foreign Sales Corporation, without Form 8279 attached - If the Form 8279 is not attached and research fails to provide a posted TC 060, coordinate with Entity., 265997=If Doc Code 87 (Form 2287 - Dishonored Check Posting Voucher) – research to determine if the transaction is addressing the correct module, then use the following table to resolve the unpostable condition:, 345376=Form 1120, U.S. Corporation Income Tax Return, 182671=This unpostable condition occurs when a TC 530 is attempting to post with a Form 1120, U.S. Corporation Income Tax Return, filing requirement of 02 or a Form 1065, U.S. Return of Partnership Income, filing requirement of 06. The following table provides instructions for resolving this unpostable:, 114339=Ensure that MFT 05, Form 1041, U.S. Income Tax Return for Estates and Trusts, are one of the three types of trusts eligible for a fiscal year end before updating the MF FYM., 155123=Section 806 of TRA of 1986, 291986=TC 651/652/661/662 can reverse a merged TC 650/660 with document code 24 or 34 respectively (containing 3 high-order zeroes in TUS Number field) if the date falls within the respective date parameters for the merged transaction as shown in Parameter Chart per PRP 160-4.02 (36). Merged transactions carry ″TO″ date of respective date limits per parameters., 132548=If the unpostable return is a Form 1041-QFT (located in the United States can only be processed at CSPC or a foreign Country or U.S. Possession processed at OSPC only) or a grantor trust and research indicates the FYM on the Entity tax module and the return do not match coordinate with Entity Unpostables., 67476=No Form 1128, Application To Adopt, Change, or Retain a Tax Year, or approval is needed if the taxpayer states he filed under IRC Section 1.442.1 (b) or (c). IRC 1.1502-76, is the last return of a subsidiary prior to its inclusion in a consolidated return. A Computer Condition Code Y should be edited by Code and Edit to change the fiscal year ending. See IRM 3.12.251.27.1, Y-Coded IRC Section 1.1502 Return., 112785=TC 150, Form 1120-S, U.S. Income Tax Return for an S Corporation, Doc Code 16, will not post and update the MF FYM., 180983=TC 971 AC 745 will unpost if the module is in credit balance., 115068=An Estate can choose to file an initial return for any FYM. In order to change their FYM they must file a Form 1128 ,Application to Adopt, Change, or Retain a Tax Year. This includes even if the Estate is changing to a Fiscal Year Month of December (12)., 345193=Form 1041-A, U.S. Information Return Trust Accumulation of Charitable Amounts, 155614=Once the fiscal month is determined (return filed), the taxpayer can only change it, if they meet certain criteria or on a Form 1128, Application to Adopt, Change, or Retain a Tax Year, or Form 8716, Election To Have a Tax Year Other Than a Required Tax Year, (Section 444 only allows the FY to be Sept., Oct., or Nov.)., 126319=If the tax period ending date is not more than 3 days after the beginning of the month, enter the previous month (i.e., October 3, use the numeric designation for September, YY09)., 155277=Corporate returns are filed on a fiscal year (months 01-12) which the taxpayer determines. A small business corporation, a personal service corporation and a life insurance company, must use a December 31 tax year unless certain requirements are met.}",
    "textBeforeTable": "UPC 301 Resolution RC 3 - A Profit Sharing or Pension Plan Trust may have a different number from the corporation. Reason Code 3 occurs when a TC 650 (Doc Code 19 (EFTPS)) for MFT 01, 03, 14, or 16 does not match on TIN and has re-sequenced for 4 cycles, or the 23C Date is equal to or later than the end of the tax period. 3.12.279.53  (01-01-2015) UPC 301 RC 3 3.12.279.108   UPC 320 RC 9 Uncollectable Account - Auto Closed 3.12.279.107   UPC 320 RC 8 Uncollectable Account - Auto Closed 3.12.279.106   UPC 320 RC 7 Uncollectable Account - Auto Closed 3.12.279.105   UPC 320 RC 6 Uncollectable Account - Auto Closed 3.12.279.104   UPC 320 RC 5 Uncollectable Account - Auto Closed 3.12.279.103   UPC 320 RC 4 Uncollectable Account - Auto Closed 3.12.279.102   UPC 320 RC 3 Uncollectable Account - Auto Closed 3.12.279.101   UPC 320 RC 2 Uncollectable Account - Auto Closed 3.12.279.100   UPC 320 RC 1 Uncollectable Account - Auto Closed 3.12.279.99   UPC 319 RC 1 Check Digit/Major City Code Mismatch 3.12.279.98   UPC 318 Invalid Credit Transfer 3.12.279.97   UPC 317 Extension Transaction is Inconsistent 3.12.279.96   UPC 316 RC 9 3.12.279.95   UPC 316",
    "textAfterTable": "3.12.279.54  (01-01-2015) UPC 301 RC 4 (CSPC Only) UPC 301 Reason Code 4 condition occurs when a TC 150 for MFT 52 ( Form 706, U.S. Estate Tax Return) with (name and address) entity information attempting to post and: The Date of Death is zeros; or The Date of Death is greater than the current 23C (assessment) date. Note: If the Date of Death is not available use the tentative Date of Death which is 15 months prior to the return received date. Refer to IRM 3.12.279.51, UPC 301 Reason Code (RC) 1 Account Not Present, for instructions on how to establish MFT 52. UPC 301 Resolution RC 4 - Release using URC 8 and request Rejects to correct the Date of Death. 3.12.279.55  (01-01-2015) UPC 301 International All Resolutions - (Ogden) The following procedures are for a Form 1120-FSC, Foreign Sales Corporation, processed at the Ogden Campus only. Note: Form 8279 is an election filed by the taxpayer prior to October 1, 2000, to request approval to file as a Form 1120-FSC, Foreign Sales Corporation.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}