{
    "relation": [
        [
            "First Name",
            "Christopher",
            "Adrienne",
            "Dana",
            "PJ"
        ],
        [
            "Last Name",
            "Padilla",
            "Rhone",
            "Gray",
            "Edington"
        ],
        [
            "Suffix",
            "",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "DOC: Under Sec. Intl Trade; Asst Sec. Export",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=9C36F07D-FB16-4FD2-9DB6-9F10A93B0738&filingTypeID=55",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 234810492,
    "recordOffset": 234794098,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33792=Supply Chain Security Critical Infrastructure Protection Cybersecurity Policy CIS Modernization Automated Commerical Environment (ACE) FY2011 Budget, 48662=H.R. 1/S. 1, The American Recovery and Reinvestment Act (ARRA) - Broadband Investment; Additional funding for DTV Transition H.R. 3101, 21st Century Communications and Video Accessibility Act of 2009 National Broadband Plan for Our Future - FCC GN Docket No. 09-51 - accessibility, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 15182=S. 971, U.S. Information and Communications Enhancement Act of 2009 S. 139, Data Breach Notification Act S. 773, Cybersecurity Act of 2009 S. 778, Office of National Cyber Security Advisor Issues relating to the creation of a consistent national framework for protecting personal and financial information and for disclosures and remedies in the event of data breaches or loss of information Issues related to reforming the Federal Information Security Management Act (FISMA) HHS Guidance on Securing Health Information FTC proposed Breach Notification Rule on Electronic Health Information S.1490, Data Security and Privacy Act of 2009 S.1438, Fostering a Global Response to Cyber Attacks Act S. 3155, International Cybercrime Reporting and Cooperation Act H.R. 4061, Cybersecurity Enhancement Act of 2009 H.R. 4900, Federal Information Security Amendments Act of 2010, 27274=S. 773 Cybersecurity Act of 2009, 67664=Fair Labor Standards Act Workforce Flexibility Workforce Skills Development and Training Benefits Employment Non-Discrimination HR 2460/S 1152 - Healthy Families Act COBRA Extension HR 4213 - Tax Extenders of 2009 HR 4851 - Continuing Extension Act of 2010 Immigration Reform HR 2981 - Employment Non-Discrimination Act of 2009 Workforce Investment and Reauthorizatin Act, 64921=FY 2011 DoD Appropriations, Trusted Foundry Programs, 37344=H.R. 4061, Cybersecurity Research & Development Amendments Act of 2009 National cybersecurity research and development agenda High Performance Computing America Competes Act Reauthorization - Nanotechnology - R&D funding - STEM H.R. 554, National Nanotechnology Initiative Amendments Act of 2009 S.1482, National Nanotechnology Initiative Amendments Act of 2009 Draft Bill, \"The Surface Transportation Authorization Act of 2009 Innovation (R&D funding) H.R. 1145, National Water Research and Development Initiative Act of 2009, 29960=P.L. 111-5, American Recovery & Reinvestment Act of 2009 Inclusion of medical home language and health information technology HHS Guidance on Securing Health Information FTC Proposed Breach Notification Rule on Electronic Health Information H.R. 1/S. 1, The American Recovery and Reinvestment Act (ARRA) - Health IT H.R. 3200, America's Affordable Health Choices Act of 2009 H.R. 3590, Patient Protection & Affordable Care Act H.R. 3962, Affordable Health Care for America Act H.R. 4872, Reconciliation Act of 2010, 43054=Deferral, foreign tax credit rules and H.R. 3970 Tax Reduction and Reform act of 2007 H.R. 4213 American workers, state and business relief act of 2010 - tax extenders H.R. 2098 to extend look-through for payments between CFCs under 954 (c ) 6 Treasury \"Check-the-Box\" Regulations Contract manufacturing in 954(d) and Treasury regs 1.954-3 Economic substance codification H.R. 2110 Mobile Workforce and State Taxation Fairness Act Lifelong Learning Accounts Act of 2008 H.R. 4297 to repeal S. 511 of the Tax Increase and Prevention Act and related IRS notice 2008-38 H.R. 422, Increase and make permanent the alternative simplified credit S. 1203, Increase and make permanent the alternative simplified credit H.R. 1083 Business Activity Tax Simplification Act of 2009 and P.L. 86-272 Treasury cost-sharing regulations under 1.482-7T (g) Bilateral treaties for Spain, Singapore, Korea, China, India and Brazil S. 1934, \"Foreign Account Tax Compliance Act of 2009\" and H.R. 3933 S.__ - Restoring American Financial Stability Act of 2010 (Executive Compensation/Proxy Access), 52833=Emerging Markets Asia Pacific Economic Cooperation Ministerial and Heads of State Meetings U.S.-Colombia Free Trade Agreement U.S.-Korea Free Trade Agreement U.S.-Panama Free Trade Agreement WTO-Doha Development Agenda WTO GATS Negotiations Trade Facilitation China Strategic and Economic Dialogue (S&ED) Joint Commission on Commerce & Trade (JCCT) WTO Accession Implementation WTO Government Procurement Agreement (GPA) Accession Bilateral Investment Treaty Encryption Standards/Information Security Internet Filtering Software Russian Cryptography with USTR Export Regulation U.S Department of Commerce - Issues - Encryption Reform - Reform of Encryption Regulations - Computer Hardware Controls Weighted Teraflops on Systems and Technology - Intra-Company Transfer (ICT) Digital Economy Trade Agreements Russia Encryption Imports Comprehensive Iran Sanctions Accountability and Divestment Act of 2009 - HR 2194/S2799 - Definitions/List of Sanctions Trans-Pacific Partnership (TPP) - Digital Economy Asia Pacific Economic Cooperation (APEC) - Innovation - Digital Economy - Standards and Compliance Certification China - Indigenous Innovation - Currency - Internet Freedom Trade and Innovation, 12312=Basic Research funding for DOE, Office of Science Science, Technology, Engineering and Mathematics (STEM) education grants and funding FY2011 Defense Appropriations - Focus Center Research Program, 61525=S. 1074, \"Shareholders Bill of Rights\" H.R. 4173, The Wall Street Reform and Consumer Protection Act, scope of the systemic risk legislation, 20005=S. 515/H.R. 1260, Patent Reform Act of 2009}",
    "textBeforeTable": "",
    "textAfterTable": "3. Principal place of business (if different than line 2) City  Armonk State  NY Zip Code  10504 Country  USA 4a. Contact Name b. Telephone Number c. E-mail  Mrs.  LISA PALLUCONI  2025154381  pallucon@us.ibm.com 5. Senate ID#  19877-12 7. Client Name Self Check if client is a state or local government or instrumentality  INTERNATIONAL BUSINESS MACHINES CORPORATION (IBM) 6. House ID#  311230000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}