{
    "relation": [
        [
            "Element",
            "context-root",
            "security-role-mapping",
            "servlet",
            "idempotent-url-pattern",
            "session-config",
            "ejb-ref",
            "resource-ref",
            "resource-env-ref",
            "service-ref",
            "message-destination-ref",
            "cache",
            "class-loader",
            "jsp-config",
            "locale-charset-info",
            "parameter-encoding",
            "property (with attributes)",
            "message-destination",
            "webservice-description"
        ],
        [
            "Required",
            "zero or one",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or one",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or more",
            "zero or one",
            "zero or one",
            "zero or one",
            "zero or one",
            "zero or one",
            "zero or more",
            "zero or more",
            "zero or more"
        ],
        [
            "Description",
            "Contains the web context root for the web application.",
            "Maps roles to users or groups in the currently active realm.",
            "Specifies a principal name for a servlet, which is used for the run-as role defined in web.xml.",
            "Specifies a URL pattern for idempotent requests.",
            "Specifies session manager, session cookie, and other session-related information.",
            "Maps the absolute JNDI name to the ejb-ref in the corresponding Java EE XML file.",
            "Maps the absolute JNDI name to the resource-ref in the corresponding Java EE XML file.",
            "Maps the absolute JNDI name to the resource-env-ref in the corresponding Java EE XML file.",
            "Specifies runtime settings for a web service reference.",
            "Specifies the name of a physical message destination.",
            "Configures caching for web application components.",
            "Specifies class loader configuration information.",
            "Specifies JSP configuration information.",
            "Deprecated. Use the parameter-encoding subelement of sun-web-app instead.",
            "Determines the default request character encoding and how the web container decodes parameters from forms according to a hidden field value.",
            "Specifies a property, which has a name and a value.",
            "Specifies the name of a logical message destination.",
            "Specifies a name and optional publish location for a web service."
        ]
    ],
    "pageTitle": "S (Sun GlassFish Enterprise Server v2.1.1 Application Deployment Guide)",
    "title": "",
    "url": "http://docs.oracle.com/cd/E19879-01/821-0184/beaxa/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73686637,
    "recordOffset": 73670680,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33303=1800}",
    "lastModified": "Wed, 26 Jan 2011 23:38:08 GMT",
    "textBeforeTable": "sas-context Subelements Table A–99 The following table describes subelements for the sas-context element. Subelements ior-security-config (sun-ejb-jar.xml) Superelements Describes the sas-context fields. sas-context S Next: T Previous: R Sun GlassFish Enterprise Server v2.1.1 Application Deployment Guide Appendix A Deployment Descriptor Files  > S Sun GlassFish Enterprise Server v2.1.1 Application Deployment Guide  > Documentation Home  >",
    "textAfterTable": "Attribute  Description  jdbc-type Specifies the JDBC type of the column created for the CMP field. The actual SQL type generated is based on this JDBC type but is database vendor specific.  jdbc-maximum-length Specifies the maximum number of characters stored in the column corresponding to the CMP field. Applies only when the actual SQL that is generated for the column requires a length.  For example, a jdbc-maximum-length of 32 on a CMP String field such as firstName normally results in a column definition such as VARCHAR(32). But if the jdbc-type is CLOB and you are deploying on Oracle, the resulting column definition is CLOB. No length is given, because in an Oracle database, a CLOB has no length. jdbc-precision Specifies the maximum number of digits stored in a column which represents a numeric type.  jdbc-scale Specifies the number of digits stored to the right of the decimal point in a column that represents a floating point number.  jdbc-nullable Specifies whether the column generated for the CMP field allows null values. ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}