{
    "relation": [
        [
            "Topic",
            "Dam - Points and Surfaces",
            "Dam - Grading",
            "Dam - Stage-Storage",
            "Dam - Profiles",
            "Dam - Pipe Network",
            "Dam - Drafting",
            "Dam - Exporting an Alignment",
            "Grassed Waterway",
            "Animal Waste Management System",
            "Feature Code Library"
        ],
        [
            "Description",
            "Creating a ground surface from a GPS topographic survey. Points file to use with the Dam tutorial.",
            "Creating a dam embankment and the auxiliary spillway using Grading. (see revised tutorial for Civil 3D 2012)",
            "The storage volume of the pool area upstream of a dam is evaluated and a report is created with the elevation , area, and volume of storage.",
            "The profile along the centerline of the dam and the profile of the pipe are created.",
            "A pipe network is created to draw and display a principal spillway pipe.",
            "In this example, updating text fields, working with viewports and annotating objects are discussed.",
            "An alignment is exported from AutoCAD Civil 3D to a Trimble TSC2 survey controller with Trimble Access software with the Roads module installed.",
            "The discusses the design of a waterway using a Corridor within AutoCAD Civil 3D 2010. Points file to use with the grassed waterway tutorial. Civil 3D file to use with the grassed waterway tutorial.",
            "This drafting note will proceed through the steps of developing a set of plans for an agricultural waste management system. Points file to use with the Animal Waste Management System tutorial. Civil 3D file to use with the Animal Waste Management System tutorial.",
            "This is the process to add a feature code library to the data collector. The feature code library file is located here (FAL;7 KB)."
        ],
        [
            "Revision Date",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012",
            "May 2012"
        ]
    ],
    "pageTitle": "CAD Resources | NRCS",
    "title": "",
    "url": "http://www.nrcs.usda.gov/wps/portal/nrcs/detail/sd/technical/engineering/?cid=nrcs141p2_036583",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00308-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 626841241,
    "recordOffset": 626825648,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{42702=Civil 3D 2012 CAD Training Tutorials, 43576=Civil 3D 2012 CAD Drawing Templates, 46862=South Dakota Civil 3D Training Sessions Held in 2013}",
    "textBeforeTable": "Civil 3D 2010 CAD Training Tutorials           Session 3 Agenda and Participants.pdf   August/September 2013 Grading Training (Dams) Session 3 - Grading   Session 2 Agenda and Participants.pdf   August 2013 Corridor Training (Grassed Waterways) Session 2 - Corridors   Points file for Class 1 examples.csv     Class 1 example.pdf     Introduction to Autocad and Civil 3D     Session 1 Agenda and Participants.pdf   July 2013 Basic of Autocad Civil 3D Session 1 - Introduction to Autocad Civil 3D Training Date Description Topic South Dakota Civil 3D Training Sessions Held in 2013 May 2015 Creating a Surface in Civil 3D from a DEM LiDar DEM Revision Date Description Topic Importing LiDar to Civil 3D   July 2015 Create an export file for HecRAS RAS Flipper, Ver. 1.0 September 2014 Flipping Coordinates, Method 1 Civil 3D HEC-RAS fix July 2015 Exporting a Civil 3D surface to HEC-RAS HEC RAS Design Note 1 ver. 1.1 Revision Date Description Topic Exporting Civil 3D to HEC-RAS   September 2013 Drawing Template for a Grassed Waterway. Grassed Waterway",
    "textAfterTable": "Civil 3D 2010 CAD Drawing Templates Topic Description Revision Date Animal Waste Management System Drawing Template for Animal Waste Management System. May 2012 Grassed Waterway Drawing Template for a Grassed Waterway. (See revised tutorial for Civil 3D 2012) May 2012 Dam-Pipe Drawing Template for a Dam with a principal spillway pipe. May 2012 Dam-No-Pipe Drawing Template for a Dam without a principal spillway pipe. May 2012 General Template General Drawing Template. May 2012 Additional training and resources can be found at: Minnesota NRCS: www.nrcs.usda.gov/wps/portal/nrcs/detail/mn/technical/engineering/?cid=nrcs142p2_023720 Wisconsin NRCS: www.nrcs.usda.gov/wps/portal/nrcs/main/wi/technical/engineering/ Iowa NRCS:  www.nrcs.usda.gov/wps/portal/nrcs/main/ia/technical/engineering/ NRCS Cad forum: http://www.nrcsknowledge.com/nrcsforum/. National NRCS CAD Support SharePoint  https://ems-team.usda.gov/sites/NRCS_ST/ndcsmc/CAD/default.aspx NRCS Autocad and Civil 3D training:  http://www.nrcsknowledge.com.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}