{
    "relation": [
        [
            "Firearm",
            "Browning Hi-Power",
            "Jericho 941"
        ],
        [
            "Type",
            "Semi-automatic",
            "Semi-automatic"
        ],
        [
            "Calibre",
            "9×19mm Parabellum",
            "9×19mm Parabellum"
        ],
        [
            "Service",
            "1948-1990s",
            "1990s-Present"
        ]
    ],
    "pageTitle": "Service pistol - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/Service_pistol",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00172-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 858537459,
    "recordOffset": 858504409,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16097=The British Army was the last major military service to adopt a Semi-automatic service pistol as a standard sidearm, phasing out their Webley Mk IV, Enfield No 2 Mk I, and Smith & Wesson Victory revolvers in 1969,[1] after which the Browning Hi-Power became the Army's official service pistol., 14639=The invention of the revolver in 1836 finally made a service pistol practical, as prior to this pistols had largely been single-shot weapons usually of no particular standardized pattern.}",
    "lastModified": "Sat, 04 Jul 2015 18:28:06 GMT",
    "textBeforeTable": "Angola[edit] Issue by nation[edit] The tradition of issuing pistols to officers as a primary weapon is being phased out by many nations. The United States Marine Corps, for example, recently began requiring all enlisted personnel and all officers below the rank of Lieutenant Colonel to carry the M4 Carbine as their primary weapon. British officers on combat duty are also normally issued with the standard rifle but are not required to carry it with them at all times, for example while operating as support staff the rifle would be stored in the base armory though this is the same for most support staff. Special operations soldiers often carry a handgun as a secondary weapon to serve in a supplementary capacity to their primary weapon (a rifle, carbine, submachine gun, or shotgun); this practice is not as prevalent among conventional soldiers. Soldiers who do not serve in a direct combat role are often issued a pistol (such as officers, artillery crews, and other rear-echelon personnel), but conventional riflemen are not generally issued a pistol as part of their standard kit. However, drivers are often issued a handgun since while driving, their rifle will be stowed on a rack and thus difficult to make ready quickly in an emergency whereas a handgun is more easily accessible.",
    "textAfterTable": "Ballester-Molina Firearm Type Calibre Service Steyr Mannlicher M1901 Semi-automatic and Fully 7.65mm Mannlicher 1905–1916 M1916/M1927 Semi-automatic .45 ACP 1916–1980 Ballester-Molina Semi-automatic .45 ACP 1938–1985 Browning Hi-Power Semi-automatic 9×19mm Parabellum 1960–1998 Bersa Thunder 9 Semi-automatic 9×19mm Parabellum 1998–present Austria[edit] Glock 17 Firearm Type Calibre Service M1870/M1870-74/M1882 Gasser Revolver 11.25x36R, 11.2×29.5 mm (Montenegrin) 1870–1898 Gasser-Kropatschek M1876 Revolver 9×26R 1876–1898 M1878 Gasser Revolver 9×26R 1878–1898 Rast & Gasser M1898 Revolver 8mm Gasser 1898–1945 Roth–Steyr M1907 Semi-automatic 8mm Roth–Steyr 1907–1945 Steyr M1912 Semi-automatic 9mm Steyr, 9×19mm Parabellum 1912–1945 Dienstpistole 11,43mm (M1911 pistol) Semi-automatic 11,43mm Dienstpistole (.45 ACP) 1950-?",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}