{
    "relation": [
        [
            "Round",
            "1",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40",
            "41",
            "42",
            "43",
            "44",
            "45",
            "46",
            "47",
            "48",
            "49",
            "50",
            "51",
            "52",
            "53",
            "54",
            "55",
            "56",
            "57",
            "58",
            "59",
            "60",
            "61",
            "62"
        ],
        [
            "Name",
            "Bill Bene",
            "Billy Ashley",
            "Anthony Collier",
            "Paul Branconier",
            "Eric Karros",
            "Jeff Hartsock",
            "Scott Erwin",
            "Jim Poole",
            "Eddie Pye",
            "Brock McMurray",
            "Jerry Brooks",
            "Christian Morrow",
            "Dana Allison",
            "Larry Rice",
            "Brian Traxler",
            "Michael Chiusano",
            "Coleman Smith",
            "James Wray",
            "Sean McKamie",
            "Steven Finken",
            "Michael St. Esteben",
            "William Wengert",
            "Roderick Harvell",
            "Michael Sampson",
            "Ernest Carr",
            "Mike Munson",
            "Eric Ganino",
            "John Braase",
            "Sean Snedeker",
            "Clayton Enno",
            "Bryan Beals",
            "Cameron Biberdorf",
            "Napoleon Robinson",
            "Héctor Ortiz",
            "Jeff Castillo",
            "Bradley Boggetto",
            "Wendell Zink",
            "K. G. White",
            "Felix Rios",
            "Todd Reische",
            "Eric Blackwell",
            "Garey Ingram",
            "Brent Miller",
            "Bradley Cohen",
            "Wilfred Brown",
            "Garrett Beard",
            "Terry Miller",
            "Deon Montgomery",
            "Jose Fernandez",
            "Daniel Hancock",
            "Gaither Bagsby",
            "Michael Emmons",
            "Shannon Zerlang",
            "Craig Thomas",
            "Dan Frye",
            "Dennis Frye",
            "Mike Vdovkin",
            "Chris Harding",
            "Robert Hoffman",
            "Eric Boddie",
            "Mike Piazza"
        ],
        [
            "Position",
            "RHP",
            "OF",
            "OF",
            "RHP",
            "1B",
            "RHP",
            "RHP",
            "LHP",
            "SS",
            "OF",
            "OF",
            "OF",
            "LHP",
            "C",
            "1B",
            "C",
            "OF",
            "LHP",
            "SS",
            "SS",
            "LHP",
            "RHP",
            "OF",
            "RHP",
            "3B",
            "RHP",
            "C",
            "RHP",
            "RHP",
            "LHP",
            "2B",
            "RHP",
            "RHP",
            "C",
            "RHP",
            "RHP",
            "3B",
            "OF",
            "3B",
            "C",
            "OF",
            "C",
            "3B",
            "OF",
            "SS",
            "OF",
            "OF",
            "SS",
            "OF",
            "RHP",
            "RHP",
            "RHP",
            "OF",
            "OF",
            "SS",
            "1B",
            "RHP",
            "OF",
            "C",
            "OF",
            "1B"
        ],
        [
            "School",
            "California State University, Los Angeles",
            "Belleville High School",
            "Muir High School",
            "Covina High School",
            "University of California, Los Angeles",
            "North Carolina State University",
            "Georgia Institute of Technology",
            "Georgia Institute of Technology",
            "Middle Tennessee State University",
            "Southeastern Louisiana University",
            "Clemson University",
            "Skyline Junior College",
            "James Madison University",
            "Oregon State University",
            "University of New Orleans",
            "Nazareth High School",
            "Conestoga Valley High School",
            "Troy University",
            "St. Paul Central High School",
            "University of Michigan",
            "Chino High School",
            "Iowa State University",
            "Fairfield High School",
            "Holyoke Community College",
            "Jacksonville University",
            "University of Illinois at Urbana–Champaign",
            "Fontana High School",
            "College of Idaho",
            "Texas A&M University",
            "Des Moines Area Community College",
            "Chapman University",
            "Mayville State University",
            "Columbus State University",
            "Ranger College",
            "Mesa State College",
            "Parkland College",
            "Dixie State College of Utah",
            "Georgia Institute of Technology",
            "George Fox University",
            "Minooka High School",
            "Spartanburg Methodist College",
            "Columbus High School",
            "Jordan High School",
            "Starkville High School",
            "Lurleen B. Wallace Community College",
            "Spartanburg Methodist College",
            "Compton Community College",
            "Compton Community College",
            "City College of San Francisco",
            "Bremen High School",
            "Dickson County High School",
            "Pensacola Junior College",
            "College of the Redwoods",
            "Northside High School",
            "Logansport High School",
            "Logansport High School",
            "Merced High School",
            "Louisburg College",
            "J. F. Kennedy High School",
            "Creighton University",
            "Miami Dade College"
        ],
        [
            "Signed",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "No Athletics-1989",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "No Athletics-1989",
            "Yes",
            "Yes",
            "Yes",
            "No Cubs-1992",
            "Yes",
            "Yes",
            "Yes",
            "No",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "No",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "No",
            "No",
            "Yes",
            "No Dodgers-1989",
            "No Orioles-1990",
            "No",
            "No",
            "Yes",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No Reds-1992",
            "No",
            "No",
            "No",
            "No Dodgers-1989",
            "Yes",
            "Yes"
        ],
        [
            "Career span",
            "1988-1997",
            "1988-2001",
            "1988-1993",
            "1988-1991",
            "1988-2004",
            "1988-1994",
            "1989-1994",
            "1988-2000",
            "1988-1997",
            "1988-1992",
            "1988-1990",
            "1988-1995",
            "1989-1994",
            "1988-1996",
            "1988-2000",
            "1988-1989",
            "1992-1994",
            "1988-1996",
            "1989-1997",
            "1988-1992",
            "",
            "1988-1995",
            "1988-1989",
            "1988-1991",
            "1988-1990",
            "",
            "1988-1989",
            "1988-1990",
            "1988-1993",
            "1988-1990",
            "1988-1990",
            "1988-1991",
            "1988-1993",
            "1988-2005",
            "1988",
            "1989-1991",
            "1988",
            "1988-1989",
            "",
            "",
            "1989-1991",
            "1990-2002",
            "1990-1994",
            "",
            "",
            "1989-1995",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "1992-1995",
            "",
            "",
            "",
            "1990",
            "1988-1990",
            "1989-2007"
        ],
        [
            "Highest level",
            "AAA",
            "MLB",
            "AA",
            "A",
            "MLB",
            "MLB",
            "AA",
            "MLB",
            "MLB",
            "A+",
            "MLB",
            "AAA",
            "MLB",
            "AAA",
            "MLB",
            "Rookie",
            "A",
            "AA",
            "AA",
            "AAA",
            "",
            "AAA",
            "Rookie",
            "A+",
            "A",
            "",
            "Rookie",
            "A+",
            "AA",
            "A+",
            "A+",
            "AA",
            "AAA",
            "MLB",
            "Rookie",
            "A-",
            "A-",
            "A",
            "",
            "",
            "A+",
            "MLB",
            "AAA",
            "",
            "",
            "AAA",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "A+",
            "",
            "",
            "",
            "Rookie",
            "A+",
            "MLB"
        ]
    ],
    "pageTitle": "1988 Los Angeles Dodgers season - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/1988_Los_Angeles_Dodgers_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00083-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 870985955,
    "recordOffset": 870939472,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53686=The Dodgers started the 1988 season at home against the San Francisco Giants. The Dodgers opening day pitcher was Valenzuela. The opening day lineup featured Sax, Griffin, Gibson, Marshall, Shelby, Davis, Scioscia and Third Baseman Pedro Guerrero. The first pitch of the season, to Sax by Giants pitcher Dave Dravecky, was hit into the Left Field seats at Dodger Stadium. However, Valenzuela would then give up the lead and the Dodgers would eventually lose the game 5-1. The team would go onto win their next five games and finish April with a 13-7 record which included a four game sweep of the Atlanta Braves. Hershiser finished the month of April with a 5-0 record., 85270=October 5: Dodger Stadium, Los Angeles, California, 62225=Hershiser would begin a scoreless inning streak in September that he would eventually take to over 59 innings and pass Dodger legend Don Drysdale for the record for most consecutive scoreless innings. Hershiser would throw complete game shutouts against the Braves on September 5, the Reds on September 10, the Braves again on September 14, the Astros on September 19 and the Giants on September 23 to take him within 9 innings of Drysdale's record. Before Hershiser would get a chance to break the record the Dodgers needed to clinch the National League West Championship. Their chance came in San Diego on September 26. The San Diego Padres would take a 2-0 lead in the first inning. But the Dodgers would get 3 runs back and win the game 3-2, clinching the division. Hershiser would get his next start on September 28 and he would pitch 10 scoreless innings against the Padres to break Drysdale's record., 131777=In the 62nd round with their last pick of the draft the Dodgers selected Mike Piazza from Miami Dade College as a favor to his god-father, manager Tommy Lasorda. Piazza would win the 1993 Rookie of the Year Award and was a 12 time All-Star and 10 time Silver Slugger Award winner in his 16 seasons (mostly with the Dodgers and New York Mets). He hit .308 with 427 home runs and 1,335 RBI., 108210=October 16: Dodger Stadium, Los Angeles, California, 14276=With the sub-par 1987 performance fresh in their minds, General Manager Fred Claire and Field Manager Tom Lasorda knew what needed to be fixed. They started the off-season by allowing poor performers such as Glenn Hoffman, Ken Landreaux and Phil Garner explore the free agent market. On December 11, 1987, Claire pulled the trigger on a trade that helped solidify the Dodgers’ defense and bullpen, despite giving up one of the top pitchers of the National League in 1987 in Bob Welch. The Dodgers acquired shortstop Alfredo Griffin and relief pitchers Jay Howell and Jesse Orosco in a three-team trade ironically with the Athletics and Mets, the two teams they would eventually defeat in the ’88 postseason. In an attempt to boost the offense for the upcoming season, the Dodgers signed Mike Davis on December 15, 1987. The biggest move of the off-season was still to come., 15858=On January 29, 1988, the Dodgers signed free agent slugger Kirk Gibson from the Detroit Tigers. Gibson, who was a 9 year veteran at the time of the signing, was known for his power at the plate and speed on the basepaths, but was also brought in to be a clubhouse leader. To help solidify their roster the Dodgers went on to sign 21-year veteran pitcher Don Sutton and 20-year veteran catcher Rick Dempsey. Dempsey, known for his fiery personality, joined Gibson as the veteran clubhouse leaders., 94731=October 10: Shea Stadium, Flushing, New York, 56753=The Dodgers had a solid month of June compiling a record of 17-9 over the month. Hershiser continued his successful year by finishing the month of June with a record of 12-3. Much of the Dodgers’ success to this point in the season could be attributed to solid starting pitching from Hershiser, Leary and the emerging rookie Tim Belcher. However, the best pitchers of the Dodgers’ pitching staff were those who came out of the bullpen. Orosco, Howell, Brian Holton and Alejandro Peña were all enjoying successful seasons. In addition, Right Fielder Marshall was in the midst of a career year. He had a batting average of .327 with three home runs in the month of June., 104976=October 15: Dodger Stadium, Los Angeles, California This game is known to be the decisive game and it is famous for Gibson's walkoff homerun off Dennis Eckersly., 97832=October 11: Dodger Stadium, Los Angeles, California, 114064=October 19: Oakland-Alameda County Coliseum, Oakland, California, 34317=1988 Los Angeles Dodgers, 58413=Many[who?] who have followed the Dodgers have pointed to a few moments during the months of July and August the got the season going in the right direction, keep the successes going and exemplified what the 1988 Dodgers were all about., 91189=October 9: Shea Stadium, Flushing, New York, 88349=October 8: Shea Stadium, Flushing, New York, 130664=The top pick in the draft was Pitcher Bill Bene out of California State University, Los Angeles. In nine seasons in the Minors he had a record of 18-34 with a 5.45 ERA in 252 games (49 starts). In 2012 he was arrested and sentenced to six months in prison for operating a counterfeit karaoke business and failing to pay federal taxes.[6], 117108=October 20: Oakland-Alameda County Coliseum, Oakland, California, 131266=This draft produced two of the Dodgers top players of the 1990s. In the sixth round they selected first baseman Eric Karros from UCLA. The 1992 Rookie of the Year and a 1995 Silver Slugger Award winner, Karros hit .268 with 284 homers and 1,027 RBI in 14 seasons (12 of them with the Dodgers) and is the L.A. Dodgers all-time home run leader., 55008=The Dodgers went 14-13 during the month of May. As it had always been, May was one of the toughest months for the Dodgers. On May 21, 1988, Griffin was hit by a pitch from Mets pitcher Dwight Gooden on the hand. Griffin would miss over two months with a broken hand. This heated up the Dodger-Met rivalry which would last the remainder of the season. In fact, the next day, May 22, 1988, Mets starting pitcher David Cone hit Pedro Guerrero in the head in the 6th inning. As a show of disgust at what the Dodgers felt was headhunting by the Mets pitchers, Guerrero proceeded to stand up, throw his bat in Cone's direction and charge the mound. A benches clearing mêlée ensued and Guerrero and Lasorda were ejected from the game. Because Griffin had to be placed on the disabled list with a broken hand the Dodgers were left with a hole at shortstop, though they had a solid replacement in the form of veteran Dave Anderson. At times during May, the lead over the Astros neared five games. By the end of the month the Dodgers’ lead in the NL West Division was only a half of a game over the Houston Astros., 18531=Key player from the 1987 team were also brought back. These players included right fielder Mike Marshall, center fielder John Shelby, catcher Mike Scioscia, Second Baseman Steve Sax, Utilityman Mickey Hatcher, and pitchers Orel Hershiser, Fernando Valenzuela, and Tim Leary., 111150=October 18: Oakland-Alameda County Coliseum, Oakland, California, 4657=The 1988 season was a memorable one for the Dodgers as a squad that was picked to finish fourth wound up winning the World Series, beating the heavily favored New York Mets and Oakland Athletics on the way. Kirk Gibson carried the Dodger offense, winning the National League Most Valuable Player Award. Orel Hershiser dominated on the mound, throwing a record 59 consecutive scoreless innings on his way to winning the Cy Young Award., 82440=October 4: Dodger Stadium, Los Angeles, California, 100778=October 12: Dodger Stadium, Los Angeles, California, 57938=The summer success continued for the Dodgers as they completed August with a 17-12 record.}",
    "lastModified": "Sun, 02 Aug 2015 16:09:23 GMT",
    "textBeforeTable": "Farm system[edit] Orel Hershiser (Sep. 26-Oct.2) Tim Leary (July 18–24) Kal Daniels (Apr. 4–10) NL Player of the Week Orel Hershiser (September 1988) Orel Hershiser (April 1988) NL Pitcher of the Month Orel Hershiser TSN National League All-Star Orel Hershiser TSN Major League Player of the Year Award Kirk Gibson Tim Leary Silver Slugger Award Orel Hershiser TSN Pitcher of the Year Award Tim Belcher TSN Rookie Pitcher of the Year Award Fred Claire TSN Executive of the Year Award Tommy Lasorda TSN Manager of the Year Award Tim Belcher",
    "textAfterTable": "Northside High School No 56 Dan Frye SS Logansport High School No Reds-1992 1992-1995 A+ 57 Dennis Frye 1B Logansport High School No 58 Mike Vdovkin RHP Merced High School No 59 Chris Harding OF Louisburg College No 60 Robert Hoffman C J. F. Kennedy High School No Dodgers-1989 1990 Rookie 61 Eric Boddie OF Creighton University Yes 1988-1990 A+ 62 Mike Piazza 1B Miami Dade College Yes 1989-2007 MLB See also[edit] Orel Hershiser's scoreless innings streak References[edit] ^ http://www.baseball-reference.com/g/gibsoki01.shtml ^ Raúl Mondesí page at Baseball Reference ^ Mario Soto page at Baseball Reference ^ Don Sutton page at Baseball Reference ^",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}