{
    "relation": [
        [
            "",
            "Income, log",
            "(Income, log)",
            "Age of head: 35-44",
            "Age of head: 45-54",
            "Age of head: 55-64",
            "Age of head: 65-74",
            "Age of head: 75 and over",
            "Education: High school",
            "Education: Some college",
            "Education: College degree",
            "No. of children",
            "Unmarried",
            "Female",
            "Nonwhite",
            "Self-employed",
            "Retired",
            "Years with employer",
            "(less than one)",
            "Does not own home",
            "Intercept",
            "Intercept2",
            "Intercept3",
            "Intercept4"
        ],
        [
            "Estimate",
            "0.871",
            "0.033",
            "0.129",
            "0.143",
            "0.288",
            "0.264",
            "0.516",
            "0.344",
            "0.666",
            "0.767",
            "0.013",
            "0.126",
            "0.024",
            "0.237",
            "0.176",
            "0.169",
            "0.004",
            "0.052",
            "0.319",
            "6.857",
            "1.124",
            "2.188",
            "3.146"
        ],
        [
            "Std. error",
            "0.102",
            "0.004",
            "0.057",
            "0.060",
            "0.069",
            "0.082",
            "0.094",
            "0.064",
            "0.070",
            "0.066",
            "0.017",
            "0.053",
            "0.059",
            "0.048",
            "0.046",
            "0.070",
            "0.002",
            "0.081",
            "0.046",
            "0.620",
            "0.027",
            "0.034",
            "0.046"
        ],
        [
            "T-stat",
            "8.516",
            "7.983",
            "2.251",
            "2.370",
            "4.167",
            "3.221",
            "5.467",
            "5.332",
            "9.536",
            "11.587",
            "0.768",
            "2.364",
            "0.407",
            "4.923",
            "3.854",
            "2.427",
            "1.913",
            "0.640",
            "6.872",
            "11.056",
            "41.965",
            "65.030",
            "68.290"
        ]
    ],
    "pageTitle": "FRB: Finance and Economics Discussion Series: Families' Use of Payment Instruments During a Decade of Change in the U.S. Payment System (Screen Reader Version)",
    "title": "",
    "url": "http://www.federalreserve.gov/pubs/feds/2006/200601/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00292-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445698667,
    "recordOffset": 445644155,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{19517=One caveat is that this paper addresses demand influences only. To be sure, supply-side factors also contributed to the shift from paper to electronic payments. Many of the networks and a large part of the technical infrastructure that supply electronic payments were established before 1995. But, although the backbones of these networks existed before 1995, access points increased substantially from 1995 to 2001. One notable increase was in the number of point of sale terminals for PIN debit cards. In 1995, there were approximately 530,000 terminals; in 2001, 3.64 million (BIS, various years). Whether this was a cause or an effect of increased adoption rates by families is difficult to determine, but it is not surprising that the two phenomena occurred during the same period. Although this paper focuses on demand factors at the consumer level, these supply-side influences should be noted., 25231=This paper investigates the link between aggregate changes in the use of different forms of payment to family level survey data on payment systems. Family level data from the 1995, 1998 and 2001 waves of the Survey of Consumer Finances (SCF) indicate that the share of families using or holding electronic forms of payment also increased over the same period. In addition, the proportion of families using more than one payment instrument also moved up, a practice called \"multihoming.\" The results in this paper document a significant change in the payment system, inform payment system policies, and provide evidence of technology adoption behavior more generally., 14105=Today, electronic payment networks are growing in importance in the U.S. economy. For some economic activity, electronic payment networks are critical, such as for e-commerce. Data from the U.S. Census Bureau show that retail e-commerce sales increased from $6.1 billion in the fourth quarter of 1999 to $15.5 billion in the first quarter of 2004, which represents an increase from 0.7 percent of total retail sales to 1.9 percent. It is likely that a large chunk of consumer Internet shopping goes through the Visa and MasterCard networks, and a good portion of business-to-business e-commerce eventually flows through the ACH network. 10, 11714=Table 1(b) shows the value and shares of constant-dollar noncash retail payments. Check and ACH payments represent relatively larger shares of the value of payments than the share of the number of payments. This is mainly because debit cards and credit cards are used primarily to purchase smaller value items at the point of sale, whereas checks and ACH may be used to pay mortgages, salaries, and other higher-dollar value payments. Consistent with this view, while debit card's share of the number of payments increased 8 percentage points from 1998 to 2001, its share of the value of payments increased only one percentage point.12, 5970=Indeed, many families use or hold more than one type of payment instrument, and the proportion of families using or holding more than one increased over time. Table 2 (b) gives summary statistics on the proportion of families that use or hold more than one of these instruments. As shown in the table, in 1995, 14.5 percent of families used a debit card and had a credit card. This share increased to 37.8 percent of families in 2001, a jump of 23.3 percentage points. Similarly, the share of families that used a debit card and direct payment also jumped, from 5.6 percent of families to 23.2 in 2001. The proportion of families using debit cards, holding credit cards, and using direct payment increased 15.2 percentage points, from 4.8 percent of families in 1995, to 20.0 percent of families in 2001., 12329=The right half of the table shows the share of the number of noncash retail payments of each payment type. The share of the number payments made by debit card increased 13 percentage points, from 3 percent in 1995 to 16 percent in 2001. The credit card share increased 5 percentage points, and the ACH share increased 5 percentage points. At the same time, the estimated check share fell from 75 percent in 1995, to 57 percent in 2000, to 52 percent in 2001. Overall, the share of payments made electronically increased 23 percentage points, from approximately 25 percent in 1995 to 48 percent in 2001., 16166=\"Plastic\" payment instruments developed in the second half of the twentieth century. The first general purpose charge card, Diners Club, was introduced in 1950. Before the 1950s, some retailers offered \"charga-plates\", but these were limited to a particular establishment. Credit cards were not widely used until the 1970s, and use grew across the income distribution through the 1980s and 1990s.6 The earliest forms of debit cards appeared in the 1970s.7 Although debit card use was relatively nonexistent before 1989, by 2001, almost one half of U.S. families used a debit card. An indication of debit card's current prominence is that Visa reported in 2002 that more transactions on their network were made with debit cards than with credit cards; this trend continues through today.8, 5153=However, evidence suggests that not all families multihome in the same way. Table 2 (c) reports cross-tabulations of credit card and debit card use in 2001. These statistics show that not only do families use more than one type of card, families use these cards differently. The data are broken up into four categories of credit card users: convenience users, or bank credit card holders who had new charges, but no balance owed after the last bill was paid on the account; borrowing users, or bank credit card holders who had new charges, and had a balance owed after the last bill was paid on the account; only holding, or bank credit card holders who had no new charges on the account, and borrowing nonusers, or bank credit card holders who had no new charges, and had a balance owed after the last bill was paid on the account., 6984=Direct payment use also increased over this period. From 1995 to 2001, direct payment use increased 18.5 percentage points, to 40.3 percent of families. Many industries that receive recurring payments from their consumers have adopted the use of the ACH. According to the survey data, families most frequently reported that they use direct payment for insurance premiums across all survey years., 13117=The history of the payment system offers a backdrop for better understanding data on the most common payment instruments in use today. Tables 1(a) and 1(b) show data on noncash retail payments from 1995 to 2001. Table 1(a) shows the total number of noncash retail payments; the left side shows number and the right side shows shares. The total number of noncash retail payments grew from approximately 65.7 billion in 1995 to 78.8 billion in 2001. Concurrently, the estimated number of checks paid fell from 49.5 billion in 1995 to 41.2 billion in 2001.11 With an assumed 3 percent annual decline, the number of checks paid fell to 41.2 billion in 2001., 3234=To summarize, from 1995 to 2001, the number of electronic payments increased by approximately 20 percent. The aggregate statistics show that the share of payments made with debit cards, credit cards and ACH payments steadily increased from 1995 to 2001, while the share of payments made by check fell. At the same time, the family-level data indicate that the proportion of families that used debit cards and direct payments increased, and the proportion of families that had credit cards or used checks stayed relatively constant. Means of the survey data suggest that use of these payments appear to differ by income, demographics and purpose of payment. These statistics motivate the model presented in the next section, which formalizes a consumer's choice of payment instrument based on personal characteristics and the nature of the transaction. The model then leads to the estimation procedure, which presents the assumptions needed in order to estimate the model accurately., 25929=In the 1950s, most consumers paid by either cash or check. Both of these are paper-based forms of payment. Financial innovation from the 1970s to today created new electronic ways for individuals to pay, such as debit cards, credit and charge cards, and direct payments from a bank account. Despite these innovations, many families continued to rely significantly on paper payments through the early 1990s. However, in the mid-1990s and early 2000s, a major shift in the U.S. payment system occurred. The share of consumer payments made with electronic devices such as credit cards, debit cards and direct payments jumped from 25 percent in 1995 to over 50 percent in 2002 (BIS, 2004)., 14986=Over the history of U.S. payment system, there have been few periods during which payment patterns changed as dramatically as over the past ten years. Through the 1960s, consumers relied heavily on cash, checks and store credit as the primary means of payment. Payment patterns started to shift in the 1960s through the 1970s, when credit cards and direct payments began to be used widely, although the share of noncash payments made by check remained high. At the end of this period, in 1979, checks represented 85.7 percent of noncash retail payments.9 In the sixteen years between 1979 and 1995, the share of noncash payments made electronically grew 9 percentage points. Since 1995, this share grew rapidly, almost tripling in only eight years., 8969=From 1995 to 2001, the fraction of households with credit cards increased 1.8 percentage points, to 76.2 percent of families. The relatively slight increase in total holdings masks a change in composition: \"Bank\" credit card holdings, or cards issued on the Visa, MasterCard, Discover networks, or American Express' Optima credit card, increased 6.3 percentage points while retailer card holdings decreased 12.4 percentage points and gas card holdings decreased 8.6 percentage points. In addition, the proportion of \"convenience users\" - families who had new charges on their last bill and had no balance after the last payment was made on the account - increased 4.1 percentage points from 1995 to 2001.15 This represents a growing proportion of bank credit card users overall. In 1995, convenience users were 36.8 percent of bank credit card holding families; in 1998, 37.2 percent, and in 2001, 39.3 percent. American Express, Diners Club, or Carte Blanche card holdings (commonly referred to as travel and entertainment charge cards), stayed relatively constant, at 11.0, 9.1 and 10.6 percent of families in 1995, 1998 and 2001, respectively., 23895=There are three important reasons to study payment system issues. First, payment systems are a huge, important component of a well-functioning market economy. In 2002, there were approximately 82 billion payments valued at $65 trillion dollars made with checks, credit cards, debit cards, and automated clearing house (ACH) payments.2 These payment flows were over six times the dollar value of GDP, and more than $225,000 per capita. Second, paper payments are more resource intensive than electronic payments, and these resource costs represent anywhere from 1/2 to 3 percent of GDP (Humphrey and Berger (1990), Wells (1996), Hahn (2004)). Thus, a change in the payment system that causes a shift away from paper to electronic payments could potentially save resource costs, thereby increasing economic efficiency. And third, payment systems have been the subject of multiple antitrust cases and policy initiatives. The results on the substitutability of different payment instruments could help inform policymakers on the potential effects of payment system policies on consumer behavior., 10828=The trend towards electronic payment evident in the aggregate are also in household data from the Survey of Consumer Finances.13 According to the SCF, families' use of debit cards, credit cards and ACH payments grew substantially from 1995 to 2001.14 Table 2(a) presents payment use and holdings statistics from the complete SCF samples. As shown in line 1 of the table, from 1995 to 2001, debit card use increased 29.4 percentage points, from 17.6 percent of families in 1995 to 47.0 percent of families in 2001. As shown in lines 3 and 4 of the table, there has also been a rise in debit card use among those who do not have a checking account, likely because government benefit programs increasingly use debit cards or similar payment instruments as a method for disbursing funds to program recipients. Thus, it appears that the use of debit cards have increased across the income distribution., 9674=The broad increase in debit card use across different income and age groups is shown clearly in figures 1(a) and 1(b). The x axis in each of these figures plots the group of families, and the y axis plots the use of debit cards as a percentage of that group. The three lines represent data from the 1995, 1998 and 2001 waves of the survey. As shown in figure 1(a), debit card use rises, then falls with income. In contrast, as shown in figure 1(b), debit card use steadily falls with age. However, in both cases, there was a level rise across all groups in debit card use. The aggregate rise in the number of debit card transactions may be able to be explained in part by these family trends.}",
    "TableContextTimeStampAfterTable": "{185817=Table 7(d): Debit vs. convenience user, 1995, 44733=While the debit card use, credit card holdings and direct payment use direct responses, the check use statistics use the indirect responses from the \"main ways\" question. The 1998 and 2001 waves of the Survey include check use in the provided responses, but not in the 1995 wave.31 Thus, although the data do not measure check writing directly, this measure may be correlated with check writing. The statistics reported in this paper should be interpreted with these differences in mind., 133714=Table 6(a): Ordered probit, 1995 Dependent variable: Payment instrument count (0,1,2,3,4), 143876=Table 6(c): Ordered probit, 2001 Dependent variable: Payment instrument count (0,1,2,3,4), 259186=Table 7(j): Debit vs. check, 1998, 197997=Table 7(e): Debit vs. convenience user, 1998, 54109=Table 1(b): Noncash retail payments: Value and share, 1995, 1998, 2001, 173636=Table 7(c): Debit vs. credit, 2001, 37844=The most striking difference in the multinomial results from the binomial results are the income results. In some cases, the multinomial income coefficients are negative, while they are positive in similar binomial results. There are a few potential explanations for this difference. As explained above, the SCF oversamples wealthy families. Interpreting income coefficients without sample weights can be difficult, but using sample weights in nonlinear estimation routines can be problematic. In addition, in some of the specifications, one of the choices - using a debit card, but not using the other instrument - has a small number of respondents in each survey year. For example, in the debit card, credit card choice results, in 2001, debit card only users represented 316 families, or an unweighted 7.48 percent of the sample; in 1998, 232 families or an unweighted 5.70 percent of the sample, and in 1995, 100 families, or an unweighted 2.48 percent of the sample. Thus, the coefficients may need to be interpreted with care. Moreover, there is significant multicollinearity in the data. Because there are many more parameters to estimate in the multinomial specification than in the binomial specification, the multicollinearity in the data may contribute to the sign changes for some of the parameters., 246936=Table 7(i): Debit vs. direct payment, 2001, 40420=Accordingly, as shown in Table 8, the results suggest that using debit cards and credit cards were viewed as an either-or decision in 1995, but then grew to a both decision in 2001. Dividing this result further suggests that families view debit card and convenience use of credit cards as an either-or decision. The debit and check use results suggest no regular pattern, as the nested multinomial logit model cannot be distinguished from a multinomial logit model. Together with the direct payment and check use result in the last line of the table, these results suggest that there may be less systematic variation in families' preferences for check writing, or more likely, it is difficult to uncover systematic preferences for check writing using these data. The debit card and direct payment results suggest that families view debit card use and direct payment use as an either-or decision; however, the standard errors on these estimates are fairly large and thus the results are not easily interpreted., 73045=Table 2 (c): 2001 SCF: Debit card use by bank credit card holding, 47324=Table 1(a): Noncash retail payments: Number and share, 1995, 1998, 2001, 138566=Table 6(b): Ordered probit, 1998 Dependent variable: Payment instrument count (0,1,2,3,4), 161038=Table 7(b): Debit vs. credit, 1998, 210201=Table 7(f): Debit vs. convenience user, 2001, 27779=The older age category dummies have negative coefficients, which implies that younger families are more likely to use a debit card than older families. In 2001, the coefficient on nonwhite is positive and significant. Except for the 1995 survey, self-employed, retired, and number of years with employer are negatively correlated with the probability of using a debit card. These could be isolating effects due to income and age that are not picked up by these other variables. Tests show that the data have significant multicollinearity; thus the results should be interpreted as broadly indicating that debit cards are generally used by higher income, younger, and more educated families.25, 222490=Table 7(g): Debit vs. direct payment, 1995, 23004=The subsample used in the estimation procedure eliminates families with no income, zero or negative assets, and no affiliated financial institutions. Table 4 presents summary statistics on the subsample used in the estimation procedure, which are roughly in line with the entire (table 2). In addition, the public use SCF data set contains five implicates of the data. The binomial probit results reflect the estimated results corrected for imputation variance. The ordered probit and multinomial logit results reflect results from the first data implicate only. Results from the other data implicates are qualitatively similar.20 Finally, the SCF oversamples relatively wealthy families.21 Although the data include weights that could control for this data feature in the estimation, the nonlinearities of the model prevent them from being used effectively. In order to check how the sample affects the results, the models were run on subsamples that eliminated families with greater than $3.25 million in assets or $400,000 in income in 2001 dollars.22 This subsample contained 3,260 families in 2001, 3,231 families in 1998, and 3,273 families in 1995. In what follows, the results for the subsample are qualitatively similar, but in some instances, significance of parameter estimates change. In order to aid comparability across time, all results are in 2001 dollars., 148964=Table 7(a): Debit vs. credit, 1995, 234670=Table 7(h): Debit vs. direct payment, 1998, 32153=Table 2 (b) presented summary statistics suggesting a rise in multihoming over the sample period. In order to investigate this phenomenon more thoroughly, tables 6(a), (b) and (c) present results from estimating an ordered probit for the number of payment instruments used in 1995, 1998, and 2001. The four payment instruments examined are debit cards, credit cards, direct payment, and checks in 1998 and 2001, and the three payment instruments examined in 1995 are debit cards, credit cards, and direct payment. The explanatory variables are the same as were used in section 4.1., 28607=The marginal effects reported in the last columns indicate that a one percent change in income and age lead to larger changes in the probability of using or holding these payment instruments than the other variables. The magnitude of the income effect decreases over time, while the magnitude of the age effect increases. The pseudo-R squared statistics indicate that these variables explain a modest amount of the variation in debit card use. However, this variation seems to be better explained in later years; in 2001, the level of this statistic reaches over ten percent. Supply factors may explain some of the variation in earlier years, but it is difficult to test this hypothesis with the available data., 271378=Table 7(k): Debit vs. check, 2001}",
    "lastModified": "Wed, 22 Mar 2006 16:50:43 GMT",
    "textBeforeTable": "Table 6(b): Ordered probit, 1998 Dependent variable: Payment instrument count (0,1,2,3,4) 67.377 0.043 2.903 Intercept 3 36.930 0.033 1.225 Intercept 2 12.571 0.735 9.239 Intercept 8.819 0.049 0.436 Does not own home 1.182 0.084 0.100 (less than one) 0.704 0.002 0.002 Years with employer 0.197 0.074 0.014 Retired 1.757 0.048 0.085 Self-employed 4.851 0.052 0.251 Nonwhite 1.134 0.066 0.075 Female 2.904 0.059 0.170 Unmarried 2.940 0.019 0.055 No. of children 12.408 0.068 0.849 Education:   College degree 9.688 0.073 0.704 Education:   Some college 5.770 0.068 0.391 Education:   High school 5.660 0.098 0.553 Age of head:   75 and over 2.631 0.084 0.220 Age of head:   65-74 2.799 0.073 0.203 Age of head:   55-64 1.311 0.062 0.081",
    "textAfterTable": "Table 6(c): Ordered probit, 2001 Dependent variable: Payment instrument count (0,1,2,3,4) Income, log 1.179 0.115 10.290 (Income, log) 0.046 0.005 9.954 Age of head:   35-44 0.090 0.058 1.557 Age of head:   45-54 0.154 0.059 2.608 Age of head:   55-64 0.377 0.069 5.489 Age of head:   65-74 0.504 0.083 6.103 Age of head:   75 and over 0.666 0.092 7.275 Education:   High school 0.335 0.063 5.275 Education:   Some college 0.644 0.069 9.341 Education:   College degree 0.710 0.065 10.919 No. of children 0.038 0.017 2.292 Unmarried 0.075 0.053 1.401 Female 0.014 0.059 0.242 Nonwhite 0.180 0.047 3.827 Self-employed 0.172 0.047 3.705 Retired 0.173 0.069 2.497 Years with employer 0.006 0.002 3.044",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}