{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Other",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "353,098",
            "62,139",
            "59,530",
            "28,611",
            "12,275",
            "2,350",
            "867,105"
        ],
        [
            "Congregations",
            "72",
            "83",
            "287",
            "123",
            "50",
            "4",
            "-"
        ]
    ],
    "pageTitle": "Bronx, New York (NY) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Bronx-New-York.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373466231,
    "recordOffset": 373347687,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{31348=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.08. This is about average. Closest monitor was 1.4 miles away from the city center., 77873=Birthplace of: Afrika Bambaataa - (born 1960), songwriter, Louis Farrakhan - (born 1933), leader of Nation of Islam, Chris Canty - 2005 NFL player (Dallas Cowboys, born: Nov 10, 1982), B.J. Surhoff - 2005 Major League Baseball player (Baltimore Orioles, born: Aug 4, 1964), Randal Williams - 2005 NFL player (Oakland Raiders, born: May 21, 1978), Ricky Proehl - 2005 NFL player (Carolina Panthers, born: Mar 7, 1968), Ronnie Belliard - 2005 Major League Baseball player (Cleveland Indians, born: Apr 7, 1975), Bernard Lowndes - College basketball player (Hartford Hawks), Bobby Santiago - College basketball player (Stony Brook Seawolves), Brian Laing - College basketball player (Seton Hall Pirates)., 80857=On 7/15/1970, a category F2 (max. wind speeds 113-157 mph) tornado 5.6 miles away from the borough center caused between $5000 and $50,000 in damages., 12525=School Enrollment by Level of School (%) in 2000, 9444=2004 Presidential Elections Results, 35656=Air Quality Index (AQI) level in 2012 was 104. This is worse than average., 8872=2012 Presidential Elections Results, 127121=Bronx: winter 2008-2009, 44127=Hotels: Bronx Hotel (101 East Tremont Avenue) (1), 1300 Aquino Bronx Corp (1300 Sedgwick Av) (2), Carver Hotel (980 Prospect Av) (3), Alps Hotel (1922 Boston Road) (4), Bronx Park Motel (2500 Crotona Avenue) (5), Concourse Residential Hotel (2327 Grand Conc) (6), Andrea Motel (2221 New England Thru) (7), Crown Motor Inn (3320 Boston Road) (8), Concourse Residential Hotel Inc (2327 Grand Concession) (9). Display/hide their approximate locations on the map, 81101=On 5/28/1973, a category F3 (max. wind speeds 158-206 mph) tornado 33.0 miles away from the Bronx borough center caused between $50,000 and $500,000 in damages., 45497=Tourist attractions: Bronx Council of the Arts Inc (Museums; 1738 Hone Avenue) (1), Abagail Kirsch at the NY Botanical Gardens (Botanical Gardens; 200 Southern Boulevard) (2), City Island Nautical Museum (Cultural Attractions- Events- & Facilities; 190 Fordham Street Frnt) (3), A To Z Services (Cultural Attractions- Events- & Facilities; 2811 Appointment 1 Morris Avenue) (4), Abigail Kirsch Culinary Productions - New York Botanical Gardens (Cultural Attractions- Events- & Facilities; New York Botanical G) (5), Baitul AMAN Islamic Center Inc (Cultural Attractions- Events- & Facilities; 2351 Newbold Avenue Frnt) (6), N Y City - Parks & Recreation Dept- Park Enforcement Patrol- Sub Stations- Pelham (Nature Centers; Bruckner Expressway) (7), N Y City - Parks & Recreation Dept- Nature Centers- Orchard Beach (Nature Centers; Pelham Bay Park) (8), Fun Zone Of Bruckner Shopping Plaza (Amusement & Theme Parks; 1967 Turnbull Ave) (9). Display/hide their approximate locations on the map, 9730=2000 Presidential Elections Results, 34289=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 17.6. This is significantly worse than average. Closest monitor was 1.4 miles away from the city center., 8588=Graphs represent county-level data. Detailed 2008 Election Results, 33547=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.80. This is about average. Closest monitor was 1.4 miles away from the city center., 30598=Lead (Pb) [µg/m3] level in 2008 was 0.0125. This is about average. Closest monitor was 4.6 miles away from the city center., 35010=Carbon Monoxide (CO) [ppm] level in 2012 was 0.241. This is better than average. Closest monitor was 1.4 miles away from the city center., 12923=Educational Attainment (%) in 2000, 32822=Ozone [ppb] level in 2012 was 26.0. This is better than average. Closest monitor was 1.4 miles away from the city center., 10016=1996 Presidential Elections Results, 93123=According to our research of New York and other state lists there were 1,222 registered sex offenders living in Bronx, New York as of August 04, 2015. The ratio of number of residents in Bronx to the number of sex offenders is 1,132 to 1. The number of registered sex offenders compared to the number of residents in this city is near the state average., 32117=Particulate Matter (PM10) [µg/m3] level in 2004 was 14.3. This is significantly better than average. Closest monitor was 1.8 miles away from the city center., 9158=2008 Presidential Elections Results}",
    "TableContextTimeStampAfterTable": "{42714=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 6995=6.43% of this county's 2010 resident taxpayers moved to other counties in 2011 ($34,651 average adjusted gross income), 41415=Total of 822 patent applications in 2008-2015., 4788=5.28% of this county's 2011 resident taxpayers lived in other counties in 2010 ($28,742 average adjusted gross income)}",
    "textBeforeTable": "Religion statistics for Bronx borough (based on Bronx County data) Woodstock neighborhood Woodlawn neighborhood Williamsbridge neighborhood Westchester Square neighborhood Westchester neighborhood West Farms neighborhood West Concourse neighborhood Wakefield neighborhood Van Nest neighborhood Van Cortlandt Pk neighborhood University Heights neighborhood Unionport neighborhood Throgs Neck neighborhood The Bronx neighborhood Spuyten Duyvil neighborhood Spencer Estates neighborhood South Riverdale neighborhood Soundview Bruckner neighborhood Soundview neighborhood Silver Beach neighborhood Schuylerville neighborhood Riverdale neighborhood Port Morris neighborhood Pelham Parkway neighborhood Pelham Gardens neighborhood Pelham Bay Park neighborhood Pelham Bay neighborhood Parkchester neighborhood Park Stratton neighborhood Ollinville neighborhood Norwood neighborhood North Riverdale neighborhood North Baychester neighborhood Mount Hope neighborhood Mount Eden neighborhood Mott Haven neighborhood Morrisania neighborhood Morris Park neighborhood Morris Heights neighborhood Melrose neighborhood Marble Hill neighborhood Longwood neighborhood Locust Point neighborhood Laconia neighborhood Kingsbridge Heights neighborhood Kings Bridge neighborhood Jerome Park neighborhood Hunt's Point neighborhood Historic Village neighborhood Highbridge neighborhood Harding Park neighborhood Fordham neighborhood Fishbay neighborhood Fieldston neighborhood Edgewater Park neighborhood",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 839 Bronx County: 6.06 / 10,000 pop. New York: 4.13 / 10,000 pop. Number of convenience stores (no gas): 89 Bronx County: 0.64 / 10,000 pop. New York: 0.92 / 10,000 pop. Number of convenience stores (with gas): 46 Bronx County: 0.33 / 10,000 pop. State: 1.68 / 10,000 pop. Number of full-service restaurants: 435 Here: 3.14 / 10,000 pop. State: 8.82 / 10,000 pop. Adult diabetes rate: This county: 8.8% New York: 8.2% Adult obesity rate: Bronx County: 25.4% New York:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}