{
    "relation": [
        [
            "Patent application number",
            "20100048502",
            "20140155362"
        ],
        [
            "Description",
            "BHQ-CAGED NUCLEOTIDE PROBES PHOTOLYSABLE BY TWO-PHOTON EXCITATION - The disclosure encompasses caged compounds such as caged nucleoside phosphoesters (caged nucleotides). In an embodiment, the caged nucleotides include compounds corresponding to those described by formula (I) that may be activated by two-photon excitation, and methods of synthesis of such compounds. 8-Bromo-7-hydroxyquinoline-caged ATP was synthesized and examined for its photochemistry as a biologically useful, temporally and spatially controlled ATP-releasing reagent. The combination of two-photon excitation hydrolysis and activation of caged ATP enables methods for finely focusing ATP activation at the sub-cellular level or to a greater depth of activation, thereby providing improved resolution of ATP-dependent processes at the cellular level.",
            "BHQ-CONJUGATES, AND RELATED COMPOUNDS, METHODS OF MAKING THE SAME, AND METHODS OF USE THEREOF - Embodiments of the present disclosure provide for BHQ-conjugates and protected BHQ-conjugate precursor compounds, methods of making BHQ-conjugates and protected BHQ-conjugate precursor compounds, methods of using BHQ-conjugates and protected BHQ-conjugate precursor compounds, and the like."
        ],
        [
            "Published",
            "02-25-2010",
            "06-05-2014"
        ]
    ],
    "pageTitle": "Dore - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/dore-6/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445927896,
    "recordOffset": 445911929,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Timothy M. Dore, Athens, GA US 05-06-2010 METHODS AND SYSTEMS FOR SCREENING OF PRODUCTS - Embodiments of the present invention provide methods and systems for screening of products, especially those with ingredients that may be toxic and/or otherwise harmful to people, animals and the environment in general. 20100114917 Published Description Patent application number Tim Dore, Wilsonville, OR US 09-30-2010 TREATMENT AND PREVENTION OF ISCHEMIC BRAIN INJURY - The invention provides methods of identifying agents for treating and preventing ischemic brain injury. 20100251394 Published Description Patent application number Sylvain Doré, Baltimore, MD US //]]> BarDraw('2855059',['Patent applications by Sylvain Doré, Baltimore, MD US'],[[1,3,1]],['2008','2010','2015'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2855059\" align=\"center\"></div> </div> <canvas id=\"bg2855059\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Sylvain Dor&eacute;, Baltimore, MD US</p> <div class=\"bar2855059\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>03-19-2015</td> <td><a href=\"/patents/app/20150080462\">COMPOSITIONS AND METHODS FOR THE TREATMENT OR PREVENTION OF DISORDERS RELATING TO OXIDATIVE STRESS</a> - The present invention features methods for treating or preventing conditions, diseases, or disorders related to oxidative stress. In one embodiment, the method increases Nrf2 biological activity or expression. In particular, the invention provides for the treatment or prevention of diseases relating to oxidative stress including emphysema, sepsis, septic shock, ischemic injury, cerebral ischemia and neurodegenerative disorders, meningitis, encephalitis, hemorrhage, cerebral ischemia, heart ischemia, cognitive deficits and neurodegenerative",
    "textAfterTable": "Vincent Dore, Heidelberg AU Patent application number Description Published 20140307936 METHOD AND APPARATUS FOR THE ASSESSMENT OF MEDICAL IMAGES - A method of determining the degree of uptake of a PET maker in an individual candidate PET scan, the method including the steps of: (a) calculating a series of representative matched controlled PET and MRI templates for a series of controlled sample scans of individuals; (b) computing a series of brain surfaces from the matched templates; (c) aligning the individual candidate PET scan with the candidate templates; (d) aligning the candidate PET images with the series of brain surfaces; (e) selecting a predetermined (M) best candidate templates for each surface location based on a similarity measure between the candidate PET values and the corresponding controlled PET scans; (f) computing M weights for each surface location, utilizing a corresponding MRI tissue map; (g) utilizing the M weights to combine a corresponding M template tissue indicators from corresponding MRI templates into an average brain surface indicator. 10-16-2014 Website © 2015 Advameg, Inc.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}