{
    "relation": [
        [
            "Patent application number",
            "20090183479",
            "20100139232",
            "20150066309"
        ],
        [
            "Description",
            "Mower frame with compact mounting for dual hydraulic pump/motor assemblies - A mower has a frame that supports a rotary cutting deck. The frame includes a pair of side rails that each extend from a front end in advance of the cutting deck to a rear end substantially behind the cutting deck. The front ends of the side rails support a pair of front caster wheels. The rear ends of the side rails have a raised, upwardly extending arch at which a hydraulic pump/motor assembly is mounted. The pump/motor assembly has an L-shaped configuration with the motor being located towards the bottom of the arch and outboard of the side rail and with the pump extending upwardly and inwardly from the motor to be located inboard of the side rail and within the vertical profile of the arch. The hydraulic motors drive a pair of rear drive wheels to propel the frame over the ground. A cross frame extends between the motors in the pump/motor assemblies to join the assemblies together. The deck is propelled from the frame by a plurality of struts extending between the cross frame and the deck.",
            "MOWER FRAME WITH COMPACT MOUNTING FOR DUAL HYDRAULIC PUMP/MOTOR ASSEMBLIES - A mower has a frame that supports a rotary cutting deck. The frame includes a pair of side rails that each extend from a front end in advance of the cutting deck to a rear end substantially behind the cutting deck. The front ends of the side rails support a pair of front caster wheels. The rear ends of the side rails have a raised, upwardly extending arch at which a hydraulic pump/motor assembly is mounted. The pump/motor assembly has an L-shaped configuration with the motor being located towards the bottom of the arch and outboard of the side rail and with the pump extending upwardly and inwardly from the motor to be located inboard of the side rail and within the vertical profile of the arch. The hydraulic motors drive a pair of rear drive wheels to propel the frame over the ground. A cross frame extends between the motors in the pump/motor assemblies to join the assemblies together. The deck is propelled from the frame by a plurality of struts extending between the cross frame and the deck.",
            "CONTROL SYSTEM FOR GROUNDS MAINTENANCE VEHICLE, AND GROUNDS MAINTENANCE VEHICLE INCLUDING SAME - A control system for electronically controlling engine speed and PTO clutch mechanism engagement of a grounds maintenance vehicle such as a lawn mower. In one embodiment, an electronic controller (electronic control unit or ECU) may receive operator inputs from a speed setting switch and an on/off PTO clutch engagement switch. The ECU may take these inputs and make intelligent decisions as to when to engage/disengage the clutch mechanism and may change engine speed automatically prior to, during, and/or after clutch mechanism engagement/disengagement. In one or more of these speed setting switch positions, the switch may set a speed of the engine to a first speed when the clutch mechanism is disengaged, and a second speed (different than the first speed) when the clutch mechanism is engaged."
        ],
        [
            "Published",
            "07-23-2009",
            "06-10-2010",
            "03-05-2015"
        ]
    ],
    "pageTitle": "Swanson, US - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/swanson-us-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00253-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445575991,
    "recordOffset": 445538054,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "John A. Swanson, Odell, NE US 04-21-2011 TORQUE ARM ASSEMBLY - A torque arm assembly for connecting first generally circular cylindrical and second rotatable concentric bodies, rotatable about a common axis of rotation and separated by a given radial distance defined between the inner surface of the first rotatable body and the outer surface of the second rotatable body. The assembly includes an axial assembly positioned along the radial axis between the rotatable bodies and having a first end coupled to the first rotatable body and a second end coupled to a transverse body. A transverse shaft is fixedly coupled to the second rotatable body via a pair of support members. The transverse body is adapted to translate along an axis, transverse to the radial axis and relative to the transverse shaft. The axial assembly has a length that is axially variable to compensate for variations in the given radial distance between the rotatable bodies during rotation of the rotatable bodies. 20110090127 Published Description Patent application number Jeffrey C. Swanson, Clay, NY US //]]> BarDraw('2692344',['Patent applications by Jeffrey Swanson, Erie, CO US'],[[2,3,1]],['2005','2006','2011'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend2692344\" align=\"center\"></div> </div> <canvas id=\"bg2692344\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jeffrey Swanson, Erie, CO US</p> <div class=\"bar2692344\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>01-13-2011</td> <td><a href=\"/patents/app/20110006994\">PORTABLE DEVICE WITH VERSATILE KEYBOARD</a> - An apparatus comprising: a display for",
    "textAfterTable": "Patent applications by John A. Swanson, Odell, NE US John H. Swanson, Rutherford, NJ US Patent application number Description Published 20110297274 APPARATUS AND METHOD FOR FILLING A CONTAINER WITH AT LEAST TWO COMPONENTS OF A COMPOSITION - A method for forming a diffuse visual pattern of two or more product components in a container. The method includes providing a filler/mixer having a mixing chamber with up to about 10 mixing elements. A container is positioned after the mixing chamber on a container support that is capable of rotating the container. The components are fed into the mixing chamber to form a mixture. The mixture is fed into the container while it is rotated and concurrently separated from the mixing chamber. 12-08-2011 20130105038 CONTAINER ORIENTING HOLDER WITH ROLLER SUPPORTS AND A CONTAINER ORIENTING METHOD 05-02-2013 John W. Swanson, Lake Oswego, OR US Patent application number Description Published 20110167631 METHOD FOR PRODUCING A MULTIELECTRODE LEAD - A wire wrapping device that includes a turntable assembly that is made up of a turntable and a driver adapted to rotate the turntable. Also, a set of payout carriers are",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}