{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "TD"
        ],
        [
            "regulations.gov",
            "2015-09712",
            "1545-BH31",
            "9715"
        ]
    ],
    "pageTitle": "26 CFR 1.170A-2 - Amounts paid to maintain certain students as members of the taxpayer's household. | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/26/1.170A-2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00224-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 926099803,
    "recordOffset": 925991493,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1019=Title 26 published on 2015-04-01.}",
    "TableContextTimeStampAfterTable": "{95662=§ 1471 - Withholdable payments to foreign financial institutions, 1190388=This document contains proposed regulations that create a new taxpayer identifying number known as an IRS truncated taxpayer identification number, a TTIN. As an alternative to using a social security number (SSN), IRS individual taxpayer identification number (ITIN), or IRS adoption taxpayer identification number (ATIN), the filer of certain information returns may use a TTIN on the corresponding payee statements to identify the individual being furnished a statement. The TTIN displays only the last four digits of an individual's identifying number and is shown in the format XXX-XX-1234 or ***-**-1234. These proposed regulations affect filers of certain information returns who will be permitted to identify an individual payee by use of a TTIN on the payee statement furnished to the individual, and those individuals who receive payee statements containing a TTIN., 1364943=This document corrects a notice of proposed rulemaking by cross-reference to temporary regulations (REG-107889-12) that was published in the Federal Register on Tuesday, June 12, 2012 (77 FR 34887) regarding whether a foreign corporation has substantial business activities in a foreign country., 102377=103 Stat. 2373, 716690=This document contains proposed regulations relating to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-173. These proposed regulations affect individual taxpayers who may be liable for the shared responsibility payment for not maintaining minimum essential coverage. This document also provides notice of a public hearing on these proposed regulations., 60695=This document contains a correction to final and temporary regulations (TD 9674) that were published in the Federal Register on Wednesday, July 2, 2014 (79 FR 37630). The final and temporary regulations provide guidance to eligible organizations seeking recognition of tax-exempt status under section 501(c)(3) of the Internal Revenue Code., 1147449=This document contains final regulations relating to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010. These final regulations provide guidance to individuals related to employees who may enroll in eligible employer-sponsored coverage and who wish to enroll in qualified health plans through Affordable Insurance Exchanges (Exchanges) and claim the premium tax credit., 1369289=This document contains proposed regulations that provide guidance regarding the requirements for charitable hospital organizations relating to financial assistance and emergency medical care policies, charges for certain care provided to individuals eligible for financial assistance, and billing and collections. The regulations reflect changes to the law made by the Patient Protection and Affordable Care Act of 2010. The regulations will affect charitable hospital organizations., 768092=This document withdraws a portion of a proposed rulemaking (INTL-656-87, REG-209054-87) published in the Federal Register on April 1, 1992. The withdrawn portion relates to the definitions of the terms pedigreed QEF, section 1291 fund, shareholder, and indirect shareholder, and to annual information reporting requirements applicable to certain shareholders of passive foreign investment companies (PFICs)., 92250=§ 1017 - Discharge of indebtedness, 441003=This document contains temporary regulations under section 382 of the Internal Revenue Code (Code) that modify the effective date provision of recently published regulations. These regulations affect corporations whose stock is or was acquired by the Department of the Treasury (Treasury) pursuant to certain programs under the Emergency Economic Stabilization Act of 2008 (EESA). The text of these temporary regulations also serves as the text of the proposed regulations set forth in the notice of proposed rulemaking on this subject in the Proposed Rules section in this issue of the Federal Register . This document also modifies the existing regulations to provide a cross-reference to this temporary regulation., 96154=§ 1503 - Computation and payment of tax, 536110=This document contains corrections to final and temporary regulations (TD 9657), which were published in the Federal Register on Thursday, March 6, 2014 (79 FR 12812). The regulations relate to information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities., 1185940=This document corrects the final regulations and removal of temporary regulations (TD 9608) that were published in the Federal Register on Friday, December 28, 2012 (77 FR 76400) relating to the disclosure or use of tax return information by tax return preparers., 93749=§ 1293 - Current taxation of income from qualified electing funds, 130104=This document contains corrections to a notice of proposed rulemaking (REG-132634-14) that was published in the Federal Register on Wednesday, May 6, 2015 (80 FR 25970). The proposed rules provide guidance on qualifying income from exploration, development, mining or production, processing, refining, transportation, and marketing of minerals or natural resources., 625428=This document contains corrections to final regulations (TD 9660) that were published in the Federal Register on Monday, March 10, 2014 (79 FR 13220). The final regulations provide guidance to providers of minimum essential health coverage that are subject to the information reporting requirements of section 6055 of the Internal Revenue Code., 485111=This document contains final regulations relating to section 1092 identified mixed straddles established after August 18, 2014. The final regulations explain how to account for unrealized gain or loss on a position held by a taxpayer prior to the time the taxpayer establishes a mixed straddle using straddle-by-straddle identification., 312279=This document contains corrections to a notice of proposed rulemaking(REG-151416-06) that was published in the Federal Register on Monday, November 3, 2014 (79 FR 65151), that prescribe how a partner should measure its interest in a partnership's unrealized receivables and inventory items, and that provide guidance regarding the tax consequences of a distribution that causes a reduction in that interest., 92737=§ 1092 - Straddles, 321826=This document contains corrections to final regulations (TD 9704) that were published in the Federal Register on Wednesday, November 19, 2014 (79 FR 68763) relating to the consequences to U.S. and foreign persons for failing to file gain recognition agreements (GRAs) or related documents, or to satisfy other reporting obligations, associated with certain transfers of property to foreign corporations in nonrecognition exchanges., 1119843=This document contains corrections to a notice of proposed rulemaking and notice of public hearing (REG-138006-12) that was published in the Federal Register on Wednesday, January 2, 2013 (78 FR 218). The proposed regulations provide guidance under section 4980H of the Internal Revenue Code with respect to the shared responsibility for employers regarding employee health coverage., 1568380=This document contains corrections to final regulations (TD 9567), which were published in the Federal Register on Monday, December 19, 2011, relating to reporting of specified foreign financial assets., 288830=This document contains proposed regulations that provide the method to be used to adjust the applicable Federal rates (AFRs) under section 1288 of the Internal Revenue Code (Code) (adjusted AFRs) for tax-exempt obligations and the method to be used to determine the long-term tax-exempt rate and the adjusted Federal long-term rate under section 382. For tax-exempt obligations, the proposed regulations affect the determination of original issue discount under section 1273 and of total unstated interest under section 483. In addition, the proposed regulations affect the determination of the limitations under sections 382 and 383 on the use of certain operating loss carryforwards, tax credits, and other attributes of corporations following ownership changes. This document also contains a request for comments and provides notice of a public hearing on these proposed regulations., 94687=§ 1374 - Tax imposed on certain built-in gains, 187983=In the Rules and Regulations section of this issue of the Federal Register, the IRS is issuing final and temporary regulations that amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. The regulations provide an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of these proposed regulations. This document withdraws the notice of proposed rulemaking (REG-107548-11; RIN 1545-BK10) published in the Federal Register on May 11, 2012 (77 FR 27669)., 808202=This document contains final regulations under section 1411 of the Internal Revenue Code (Code). These regulations provide guidance on the general application of the Net Investment Income Tax and the computation of Net Investment Income. The regulations affect individuals, estates, and trusts whose incomes meet certain income thresholds., 95220=§ 1402 - Definitions, 580810=This document cancels a public hearing on proposed regulations providing guidance under chapter 4 of Subtitle A (sections 1471 through 1474) of the Internal Revenue Code of 1986., 1352318=This document contains corrections to final regulations (TD 9590) that were published in the Federal Register on Wednesday, May 23, 2012 (77 FR 30377). The final regulations relate to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010., 450163=This document contains final and temporary regulations relating to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the Medicare and Medicaid Extenders Act of 2010, the Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act of 2011, and the Department of Defense and Full-Year Continuing Appropriations Act of 2011 and the 3% Withholding Repeal and Job Creation Act. These regulations affect individuals who enroll in qualified health plans through Affordable Insurance Exchanges (Exchanges) and claim the premium tax credit, and Exchanges that make qualified health plans available to individuals. The text of the temporary regulations in this document also serves as the text of proposed regulations set forth in a notice of proposed rulemaking (REG-104579-13) on this subject in the Proposed Rules section in this issue of the Federal Register ., 1564530=This document contains corrections to final regulations (TD 9567), which were published in the Federal Register on Monday, December 19, 2011, relating to the reporting of specified foreign financial assets., 772589=This document contains corrections to final regulations (TD 9632) that were published in the Federal Register on Friday, August 30, 2013. The final regulations provide guidance to individual taxpayers on the liability under section 5000A of the Internal Revenue Code for the shared responsibility payment for not maintaining minimum essential coverage., 1217822=This document withdraws portions of the notice of proposed rulemaking published on September 24, 2009, relating to the payout requirements for Type III supporting organizations that are not functionally integrated. The withdrawal affects Type III supporting organizations that are not functionally integrated. In the Rules and Regulations section of this issue of the Federal Register, the IRS is issuing temporary regulations regarding the requirements to qualify as a Type III supporting organization that is operated in connection with one or more supported organizations. Those regulations reflect changes to the law made by the Pension Protection Act of 2006 and will affect Type III supporting organizations and their supported organizations. The text of those temporary regulations published in this issue of the Federal Register also serves as the text of these proposed regulations., 93289=§ 1254 - Gain from disposition of interest in oil, gas, geothermal, or other mineral properties, 103441=94 Stat. 1208, 94603=§ 1368 - Distributions, 409012=This document contains final regulations providing guidance relating to applicable defined benefit plans. Applicable defined benefit plans are defined benefit plans that use a lump sum-based benefit formula, including cash balance plans and pension equity plans, as well as other hybrid retirement plans that have a similar effect. These regulations provide guidance relating to certain provisions that apply to applicable defined benefit plans that were added to the Internal Revenue Code (Code) by the Pension Protection Act of 2006, as amended by the Worker, Retiree, and Employer Recovery Act of 2008. These regulations affect sponsors, administrators, participants, and beneficiaries of these plans., 1213440=This document contains both final regulations and temporary regulations regarding the requirements to qualify as a Type III supporting organization that is operated in connection with one or more supported organizations. The regulations reflect changes to the law made by the Pension Protection Act of 2006. The regulations will affect Type III supporting organizations and their supported organizations. The text of the temporary regulations also serves as the text of the proposed regulations set forth in the Proposed Rules section in this issue of the Federal Register ., 866232=This document contains corrections to final regulations and removal of temporary regulations (TD 9630) that were published in the Federal Register on Tuesday, August 27, 2013 (78 FR 52854). The final regulations implement the use of the differential income stream as a consideration in assessing the best method in connection with a cost sharing arrangement and as a specified application of the income method., 1598232=This document contains corrections to final regulations (TD 9568), which were published in the Federal Register on Thursday, December 22, 2011 (76 FR 80082), relating to section 482 and methods to determine taxable income in connection with a cost sharing arrangement., 1556381=This document contains corrections to a notice of proposed rulemaking (REG-130302-10), which was published in the Federal Register on Monday, December 19, 2011 (76 FR 78594), relating to the reporting of specified foreign financial assets., 835116=This document contains amendments to regulations relating to certain cash or deferred arrangements under section 401(k) and matching contributions and employee contributions under section 401(m). These regulations provide guidance on permitted mid-year reductions or suspensions of safe harbor nonelective contributions in certain circumstances for amendments adopted after May 18, 2009. These regulations also revise the requirements for permitted mid-year reductions or suspensions of safe harbor matching contributions for plan years beginning on or after January 1, 2015. The regulations affect administrators of, employers maintaining, participants in, and beneficiaries of certain defined contribution plans that satisfy the nondiscrimination tests of section 401(k) and section 401(m) using one of the design-based safe harbors., 1576234=This document contains corrections to a notice of proposed rulemaking (REG-130302-10), which was published in the Federal Register on Monday, December 19, 2011, relating to the reporting of specified foreign financial assets., 96255=§ 1504 - Definitions, 1440082=This document contains final regulations relating to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the Medicare and Medicaid Extenders Act of 2010, the Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act of 2011, the Department of Defense and Full-Year Continuing Appropriations Act, 2011, and the 3% Withholding Repeal and Job Creation Act. These final regulations provide guidance to individuals who enroll in qualified health plans through Affordable Insurance Exchanges (Exchanges) and claim the premium tax credit, and to Exchanges that make qualified health plans available to individuals and employers., 114182=This document contains proposed regulations under section 529A of the Internal Revenue Code that provide guidance regarding programs under The Stephen Beck, Jr., Achieving a Better Life Experience Act of 2014. Section 529A provides rules under which States or State agencies or instrumentalities may establish and maintain a new type of tax-favored savings program through which contributions may be made to the account of an eligible disabled individual to meet qualified disability expenses. These accounts also receive favorable treatment for purposes of certain means-tested Federal programs. In addition, these proposed regulations provide corresponding amendments to regulations under sections 511 and 513, with respect to unrelated business taxable income, sections 2501, 2503, 2511, 2642 and 2652, with respect to gift and generation-skipping transfer taxes, and section 6011, with respect to reporting requirements. This document also provides notice of a public hearing on these proposed regulations., 1038945=This document contains proposed regulations relating to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the Medicare and Medicaid Extenders Act of 2010, the Comprehensive 1099 Taxpayer Protection and Repayment of Exchange Subsidy Overpayments Act of 2011, and the Department of Defense and Full-Year Continuing Appropriations Act, 2011. These proposed regulations affect individuals who enroll in qualified health plans through Affordable Insurance Exchanges (Exchanges) and claim the premium tax credit, and Exchanges that make qualified health plans available to individuals and employers. These proposed regulations also provide guidance on determining whether health coverage under an eligible employer-sponsored plan provides minimum value and affect employers that offer health coverage and their employees., 1272776=This document cancels a public hearing on proposed regulations under section 1366 of the Internal Revenue Code; relating to basis of indebtedness of S corporations to their shareholders., 1168158=This document contains corrections to a notice of proposed rulemaking and notice of public hearing (REG-130074-11) that was published in the Federal Register on Wednesday, December 5, 2012 (77 FR 72268). The proposed regulations are relating to Additional Hospital Insurance Tax on income above threshold amounts (“Additional Medicare Tax”), as added by the Affordable Care Act. Specifically, these proposed regulations provide guidance for employers and individuals relating to the implementation of Additional Medicare Tax., 1585076=This document contains proposed regulations under chapter 4 of Subtitle A (sections 1471 through 1474) of the Internal Revenue Code of 1986 (Code) regarding information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities. These regulations affect persons making certain U.S.-related payments to FFIs and other foreign entities and payments by FFIs to other persons. This document also provides a notice of a public hearing on these proposed regulations., 65171=This document contains corrections to final and temporary regulations (TD 9713) that were published in the Federal Register on March 13, 2015 (80 FR 13233). The final regulations are relating to information reporting by brokers for bond premium and acquisition premium., 138564=This document cancels a public hearing on proposed regulations that provide the method to be used to adjust the applicable Federal rates (AFRs) under section 1288 of the Internal Revenue Code (adjusted AFRs) for tax-exempt obligations and the method to be used to determine the long-term tax-exempt and the adjusted Federal long-term rate under section 382., 875835=This document contains final regulations that provide guidance on the application of sections 162(a) and 263(a) of the Internal Revenue Code (Code) to amounts paid to acquire, produce, or improve tangible property. The final regulations clarify and expand the standards in the current regulations under sections 162(a) and 263(a). These final regulations replace and remove temporary regulations under sections 162(a) and 263(a) and withdraw proposed regulations that cross referenced the text of those temporary regulations. This document also contains final regulations under section 167 regarding accounting for and retirement of depreciable property and final regulations under section 168 regarding accounting for property under the Modified Accelerated Cost Recovery System (MACRS) other than general asset accounts. The final regulations will affect all taxpayers that acquire, produce, or improve tangible property. These final regulations do not finalize or remove the 2011 temporary regulations under section 168 regarding general asset accounts and disposition of property subject to section 168, which are addressed in the notice of proposed rulemaking on this subject in the Proposed Rules section in this issue of the Federal Register ., 894821=This document contains proposed regulations under sections 334(b)(1)(B) and 362(e)(1) of the Internal Revenue Code of 1986 (Code). The proposed regulations apply to certain nonrecognition transfers of loss property to corporations that are subject to Federal income tax. The proposed regulations affect the corporations receiving the loss property. This document also invites comments from the public regarding these proposed regulations., 848038=This document contains final regulations relating to the transfer or assignment of certain derivative contracts. The final regulations provide guidance to the nonassigning counterparty to a derivative contract and an assignee on certain notional principal contracts that are derivative contracts. The final regulations provide that the nonassigning counterparty does not have an exchange for purposes of § 1.1001-1(a) when certain derivative contracts are transferred or assigned and clarify that the embedded loan rules of § 1.446-3(g)(4) do not apply to such transactions., 674943=This document contains final and temporary regulations under chapter 4 of Subtitle A (sections 1471 through 1474) of the Internal Revenue Code of 1986 (Code) regarding information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities. These regulations affect persons making certain U.S.-related payments to FFIs and other foreign entities and payments by FFIs to other persons. The text of the temporary regulations also serves as the text of the proposed regulations set forth in a cross-reference notice of proposed rulemaking (REG-130967-13) published in the Proposed Rules section in this issue of the Federal Register ., 598636=This document contains corrections to a notice of proposed rulemaking by cross-reference to temporary regulations (REG-140974-11) that was published in the Federal Register on Tuesday, December 31, 2013 (78 FR 79650). The proposed regulations provide guidance on determining the ownership of a passive foreign investment company (PFIC), the annual filing requirements for shareholders of PFICs, and an exclusion from certain filing requirements for shareholders that constructively own interests in certain foreign corporations., 93876=§ 1294 - Election to extend time for payment of tax on undistributed earnings, 432747=This document contains corrections to final regulations (TD 9673) that were published in the Federal Register on Wednesday, July 2, 2014 (79 FR 37633). The final regulations are relating to the use of longevity annuity contracts in tax qualified defined contribution plans., 3146=This document contains temporary regulations relating to multiemployer pension plans that are projected to have insufficient funds, at some point in the future, to pay the full benefits to which individuals will be entitled under the plans (referred to as plans in “critical and declining status”). The Multiemployer Pension Reform Act of 2014 (“MPRA”) amended the Internal Revenue Code to incorporate suspension of benefits provisions that permit these multiemployer plans to reduce pension benefits payable to participants and beneficiaries if certain conditions are satisfied. MPRA requires the Secretary of the Treasury, in consultation with the Pension Benefit Guaranty Corporation and the Secretary of Labor, to approve or deny applications by these plans to reduce benefits. As required by MPRA, these temporary regulations, together with proposed regulations being published at the same time, provide guidance implementing these statutory provisions. These temporary regulations affect active, retired, and deferred vested participants and beneficiaries of multiemployer plans that are in critical and declining status as well as employers contributing to, and sponsors and administrators of, those plans. The text of these temporary regulations also serves, in part, as the text of the proposed regulations (REG-102648-15) set forth in the notice of proposed rulemaking on this subject in the Proposed Rules section of this issue of the Federal Register ., 739863=The proposed regulations provide guidance on certain provisions of the American Jobs Creation Act of 2004 and conform the regulations to statutory changes in the Taxpayer Relief Act of 1997. The proposed regulations also modify the basis allocation rules to prevent certain unintended consequences of the current basis allocation rules for substituted basis transactions. Finally, the proposed regulations provide additional guidance on allocations resulting from revaluations of partnership property. The proposed regulations affect partnerships and their partners. This document also contains a notice of a public hearing on these proposed regulations., 1321775=This document corrects the final regulation (TD 9597) that was published in the Federal Register on Wednesday, August 1, 2012, (77 FR 45480), relating to the use of business aircraft for entertainment., 326321=This document contains corrections to final regulations (TD 9689) that were published in the Federal Register on Monday, August 18, 2014 (79 FR 48661). The final regulations are regarding dispositions of property subject to depreciation under section 168 of the Internal Revenue Code., 445418=In the Rules and Regulations section of this issue of the Federal Register , the IRS is issuing temporary regulations that modify the effective date provision of recently published final regulations under Section 382 of the Internal Revenue Code. The temporary regulations affect corporations whose stock is or was acquired by the Department of the Treasury (Treasury) pursuant to certain programs under the Emergency Economic Stabilization Act of 2008 (EESA). The text of those temporary regulations published in this issue of the Federal Register also serves as the text of these proposed regulations., 102553=103 Stat. 2413, 1177405=This document contains final regulations under chapter 4 of Subtitle A (sections 1471 through 1474) of the Internal Revenue Code of 1986 (Code) regarding information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities. These regulations affect persons making certain U.S.-related payments to FFIs and other foreign entities and payments by FFIs to other persons., 1454253=This document contains final regulations that explain how to allocate prepaid qualified mortgage insurance premiums to determine the amount of the prepaid premium that is treated as qualified residence interest each taxable year. The final regulations reflect changes to the law made by the Tax Relief and Health Care Act of 2006, the Mortgage Forgiveness Debt Relief Act of 2007, and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010. The regulations affect taxpayers who pay prepaid qualified mortgage insurance premiums., 95516=§ 1445 - Withholding of tax on dispositions of United States real property interests, 971006=This document contains corrections to final regulations and removal of temporary regulations (TD 9622) that were published in the Federal Register on Wednesday, July 3, 2013 (78 FR 39984). The final regulations provide necessary guidance regarding the accelerated inclusion of deferred discharge of indebtedness (also known as cancellation of debt (COD)) income (deferred COD income) and the accelerated deduction of deferred original issue discount (OID) (deferred OID deductions) under section 108(i)(5)(D) (acceleration rules), and the calculation of earnings and profits as a result of an election under section 108(i). In addition, these regulations provide rules applicable to all taxpayers regarding deferred OID deductions under section 108(i) as a result of a reacquisition of an applicable debt instrument by an issuer or related party., 984610=This document contains guidance for those taxpayers electing to establish a mixed straddle using straddle-by-straddle identification. These temporary regulations explain how to account for unrealized gain or loss on a position held by a taxpayer prior to the time the taxpayer establishes a mixed straddle using straddle-by-straddle identification. The text of these temporary regulations also serves as the text of the proposed regulations (REG-112815-12) set forth in the Proposed Rules section in this issue of the Federal Register ., 890401=This document contains corrections to final regulations (TD 9610), which were published in the Federal Register on Monday, January 28, 2013 (78 FR 5874). The regulations related to information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities., 418361=This document contains corrections to final regulations (TD 9676) that were published in the Federal Register on Wednesday, July 16, 2014 (79 FR 41424) providing guidance concerning the allocation and apportionment of interest expense by corporations owning a 10 percent or greater interest in a partnership, as well as the allocation and apportionment of interest expense using the fair market value method. These regulations also update the interest allocation regulations to conform to the statutory changes made by section 216 of the legislation commonly referred to as the Education Jobs and Medicaid Assistance Act (EJMAA), enacted on August 10, 2010, affecting the affiliation of certain foreign corporations for purposes of section 864(e). These regulations affect taxpayers that allocate and apportion interest expense., 96072=§ 1502 - Regulations, 589403=This document cancels a public hearing on proposed regulations relating to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law111-73., 103612=94 Stat. 1308, 94511=§ 1361 - S corporation defined, 870948=This document contains proposed regulations regarding dispositions of property subject to depreciation under section 168 of the Internal Revenue Code (Code) (Modified Accelerated Cost Recovery System (MACRS) property). The proposed regulations also amend the general asset account regulations under § 1.168(i)-1 and the accounting for MACRS property regulations under § 1.168(i)-7. The proposed regulations will affect all taxpayers that dispose of MACRS property. This document also provides notice of a public hearing on these proposed regulations and partially withdraws the proposed regulations published in the Federal Register on December 27, 2011 (76 FR 81128)., 1602202=This document contains corrections to a correcting amendment (TD 9568), which was published in the Federal Register on Wednesday, January 25, 2012 (77 FR 3606) relating to section 482 and methods to determine taxable income in connection with a cost sharing arrangement., 1049052=This document contains final regulations relating to reporting by brokers for transactions involving debt instruments and options. These final regulations reflect changes in the law made by the Energy Improvement and Extension Act of 2008 that require brokers when reporting the sale of securities to the IRS to include the customer's adjusted basis in the sold securities and to classify any gain or loss as long-term or short-term. These final regulations also implement the requirement that a broker report gross proceeds from a sale or closing transaction with respect to certain options. In addition, this document contains final regulations that implement reporting requirements for a transfer of a debt instrument or an option to another broker and for an organizational action that affects the basis of a debt instrument or an option. Moreover, this document contains final regulations relating to the filing of Form 8281, “Information Return for Publicly Offered Original Issue Discount Instruments,” for certain debt instruments with original issue discount and temporary regulations relating to information reporting for premium. The text of the temporary regulations in this document also serves as the text of the proposed regulations (REG-154563-12) set forth in the Proposed Rules section in this issue of the Federal Register ., 1024853=This document contains corrections to a notice of proposed rulemaking that was published in the Federal Register on Friday, April 5, 2013. The proposed regulations provide guidance to charitable hospital organizations on the community health needs assessment requirements, and related excise tax and reporting obligations, enacted as part of the Patient Protection and Affordable Care Act of 2010. These proposed regulations also clarify the consequences for failing to meet these and other requirements for charitable hospital organizations., 178186=This document contains proposed regulations that provide guidance regarding the application of the modified carryover basis rules of section 1022 of the Internal Revenue Code (Code). Specifically, the proposed regulations will modify provisions of the Treasury Regulations involving basis rules by including a reference to section 1022 where appropriate. The regulations will affect property transferred from certain decedents who died in 2010. The regulations reflect changes to the law made by the Economic Growth and Tax Relief Reconciliation Act of 2001 and the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010., 21803=This document contains final regulations under section 382 of the Internal Revenue Code (Code) that modify the effective date provision of recently published regulations. These regulations affect corporations whose stock is or was acquired by the Department of the Treasury (Treasury) pursuant to certain programs under the Emergency Economic Stabilization Act of 2008 (EESA)., 1477151=This document contains a correction to final regulations (TD 9562) that were published in the Federal Register on Friday, December 9, 2011 (76 FR 76895) providing guidance on conduit financing arrangements. The final regulations apply to multiple-party financing arrangements that are effected through disregarded entities, and are necessary in order to determine which of those arrangements should be recharacterized as a conduit financing arrangement., 803517=This document provides guidance to nonresident alien individuals and foreign corporations that hold certain financial products providing for payments that are contingent upon or determined by reference to U.S. source dividend payments and to withholding agents. It withdraws proposed regulations under section 871(m) that were published in the Federal Register on January 23, 2012 (77 FR 3202). This document also provides a notice of a public hearing on these proposed regulations., 1133552=This document contains corrections to final and temporary regulations (TD 9605) that were published in the Federal Register on Friday, December 28, 2012 (77 FR 76382). The final and temporary regulations provide guidance regarding the requirements to qualify as a Type III supporting organization that is operated in connection with one or more supported organizations. The regulations reflect changes to the law made by the Pension Protection Act of 2006., 44399=This document contains corrections to final regulations (TD 9717) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18096). The final regulations are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 1539736=This document corrects a correction to a notice of public hearing on an advance proposed rulemaking (REG-157714-06) that was published in the Federal Register on Thursday, March 1, 2012 (77 FR 12514) relating to the determination of governmental plans., 1531586=This document contains a correction to the notice of proposed rulemaking andnotice of public hearing (REG-110980-10) that was published in the Federal Register on Friday, February 3, 2012 (77 FR 5454), providing guidance relating to the minimum present value requirements applicable to certain defined benefit pension plans., 572608=This document contains corrections to a notice of proposed notice of proposed and notice of public hearing (REG-141036-13) that was published in the Federal Register on Monday, January 27, 2014 (79 FR 4302). The proposed regulations relate to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-73., 92346=§ 1032 - Exchange of stock for property, 472987=This document contains amendments to correct the final regulations (TD 9636) that provided guidance on the application of sections 162(a) and 263(a) of the Internal Revenue Code (Code) regarding the deduction and capitalization of expenditures related to tangible property. These regulations were published in the Federal Register on Thursday, September 19, 2013 (78 FR 57686)., 92817=§ 1202 - Partial exclusion for gain from certain small business stock, 1572278=This document contains final regulations that prescribe the source of income received on a qualified fails charge under section 863 of the Internal Revenue Code (Code). The regulations finalize proposed regulations and withdraw temporary regulations published on December 8, 2010, and affect persons that pay or are entitled to receive qualified fails charges, including withholding agents., 109315=This document partially withdraws the portion of the notice of proposed rulemaking published in the Federal Register on September 16, 2013 (78 FR 56842), relating to the definition of issue price for purposes of the arbitrage restrictions under section 148 of the Internal Revenue Code (Code). This document also contains a notice of proposed rulemaking that provides a revised definition of issue price for purposes of the arbitrage restrictions. In addition, this document provides notice of a public hearing on the proposed regulations in this document. The proposed regulations in this document affect issuers of tax-exempt and other tax-advantaged bonds., 95413=§ 1443 - Foreign tax-exempt organizations, 94015=§ 1295 - Qualified electing fund, 93040=§ 1244 - Losses on small business stock, 559132=This document contains proposed regulations concerning the manner of filing Form 5472, “Information Return of a 25% Foreign-Owned U.S. Corporation or a Foreign Corporation Engaged in a U.S. Trade or Business.” The proposed regulations would remove a current provision for timely filing of Form 5472 separately from an income tax return that is untimely filed. As a result, Form 5472 would be required to be filed in all cases only with the filer's income tax return for the taxable year by the due date (including extensions) of that return. The proposed regulations affect certain 25-percent foreign-owned domestic corporations and certain foreign corporations that are engaged in a trade or business in the United States that are required to file Form 5472. Regulations finalizing the temporary provisions of TD 9529 (76 FR 33997, 2011-30 IRB 57), also about requirements for taxpayers filing Form 5472, will be published in the same issue of the Federal Register as these proposed regulations., 1016053=This document contains corrections to final regulations (TD 9612) that were published in the Federal Register on Tuesday, February 5, 2013 (78 FR 7997) relating to the tax treatment of noncompensatory options and convertible instruments issued by a partnership. The final regulations generally provide that the exercise of a noncompensatory option does not cause the recognition of immediate income or loss by either the issuing partnership or the option holder. The final regulations also modify the regulations under section 704(b) regarding the maintenance of the partners' capital accounts and the determination of the partners' distributive shares of partnership items. The final regulations also contain a characterization rule providing that the holder of a noncompensatory option is treated as a partner under certain circumstances., 298130=The Department of the Treasury invites public comments with regard to future guidance required to implement provisions of the Multiemployer Pension Reform Act of 2014, Division O of the Consolidated and Further Continuing Appropriations Act, 2015, Public Law 113-235 (MPRA). MPRA generally permits a sponsor of a multiemployer defined benefit plan that is in critical and declining status to suspend certain benefits following the provision of specified notice, consideration of public comments, approval of an application for suspension, and satisfaction of other specified conditions (including a participant vote)., 1325972=This document contains corrections to a notice of proposed rulemaking (REG-130266-11) that was published in the Federal Register on Tuesday, June 26, 2012 (77 FR 38148). The proposed regulations provide guidance regarding the requirements for charitable hospital organizations relating to financial assistance and emergency medical care policies, charges for certain care provided to individuals eligible for financial assistance, and billing and collections., 1263648=This document contains corrections to a notice of proposed rulemaking (REG-140668-07) that was published in the Federal Register on Monday, September 17, 2012 (77 FR 57452). The proposed regulation provides guidance regarding the treatment of corporate equity reduction transactions (CERTs), including the treatment of multiple step plans for the acquisition of stock and CERTs involving members of a consolidated group., 1095933=This document contains corrections to a notice of proposed rulemaking and notice of public hearing (REG-148500-12) that was published in the Federal Register on Friday, February 1, 2013 (78 FR 7314). The proposed regulations relate to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-173. These proposed regulations provide guidance on the liability for the shared responsibility payment for not maintaining minimum essential coverage., 93446=§ 1275 - Other definitions and special rules, 943950=This document describes corrections to final regulations [TD 9619] that provide guidance under section 336(e) of the Internal Revenue Code (CODE), which authorizes the issuance of regulations under which an election may be made to treat sale, exchange or distribution of at least 80 percent of the voting power and value of the stock of a corporation (target) as a sale of all its underlying assets. These regulations were published in the Federal Register on Wednesday, May 15, 2013., 698022=This document contains corrections to a withdrawal of notice of proposed rulemaking and notice of proposed rulemaking (REG-130843-13) that was published in the Federal Register on Monday, December 2, 2013, providing guidance on the computation of net investment income., 1227456=This document contains correcting amendments to the temporary regulations (TD 9564), which were published in the Federal Register on Tuesday, December 27, 2011, relating to guidance regarding deduction and capitalization of expenditures related to tangible property. These amendments revise the general asset account regulations to provide the time and manner of making a general asset account election. The amendatory instructions of TD 9564 inadvertently redesignated paragraphs (m)(2) and (m)(3) for the general asset account regulations as in effect before TD 9564 as paragraphs (l)(2) and (l)(3) for the general asset account regulations as amended by TD 9564. These correcting amendments will affect all taxpayers that make a general asset account election., 1241333=This document contains final regulations relating to deductions for the cost of producing qualified film and television productions. These final regulations reflect changes to the law made by the Tax Extenders and Alternative Minimum Tax Relief Act of 2008 and affect taxpayers that produce films and television productions within the United States., 647155=This document contains corrections to a notice of proposed rulemaking and notice of public hearing (REG-144468-05) that was published in the Federal Register on Thursday, January 16, 2014. The proposed rules provide guidance on certain provisions of the American Jobs Creation Act of 2004 and conform the regulations to statutory changes in the Taxpayer Relief Act of 1997., 812401=This document contains proposed regulations under section 1411 of the Internal Revenue Code (Code). These regulations provide guidance on the computation of net investment income. The regulations affect individuals, estates, and trusts whose incomes meet certain income thresholds., 94416=§ 1301 - Averaging of farm income, 931041=This document contains final regulations on the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-173. These final regulations provide guidance to individual taxpayers on the liability under section 5000A of the Internal Revenue Code for the shared responsibility payment for not maintaining minimum essential coverage and largely finalize the rules in the notice of proposed rulemaking published in the Federal Register on February 1, 2013., 96337=§ 1561 - Limitations on certain multiple tax benefits in the case of certain controlled corporations, 95906=§ 1473 - Definitions, 616928=This document contains final regulations relating to requirements for Affordable Insurance Exchanges (Exchanges) to report information relating to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010. These final regulations apply to Exchanges that make qualified health plans available to individuals., 679619=In this issue of the Federal Register , the IRS and the Department of the Treasury (Treasury Department) are issuing final and temporary regulations that provide guidance under chapter 4 of Subtitle A (sections 1471 through 1474) of the Internal Revenue Code of 1986 (Code). These regulations address reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities. The text of the temporary regulations published in the Federal Register also serves as the text of these proposed regulations. This document also provides notice of a public hearing on these proposed regulations., 377524=This document contains corrections to final regulations (TD 9696) that were published in the Federal Register on October 1, 2014 (79 FR 59112). The final regulations are relating to the deductibility of expenses for lodging when an individual is not travelling away from home (local lodging)., 926672=This document contains final regulations under section 362(e)(2) of the Internal Revenue Code of 1986 (Code). The regulations apply to certain nonrecognition transfers of loss property to corporations. The regulations affect all parties to the transaction., 316916=This document contains proposed regulations concerning the application of section 41 of the Internal Revenue Code (Code), which provides a credit for increasing research activities. The proposed regulations provide guidance on computer software that is developed by (or for the benefit of) the taxpayer primarily for internal use by the taxpayer (internal use software) under section 41(d)(4)(E). These proposed regulations also include examples to illustrate the application of the process of experimentation requirement to computer software under section 41(d)(1)(C). The regulations will affect taxpayers engaged in research activities involving computer software. This document also provides notice of a public hearing on these proposed regulations and withdraws the advance notice of proposed rulemaking published on January 2, 2004., 92447=§ 1059 - Corporate shareholder’s basis in stock reduced by nontaxed portion of extraordinary dividends, 1011590=This document contains proposed regulations relating to requirements for Affordable Insurance Exchanges (Exchanges) to report information relating to the health insurance premium tax credit enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010. These proposed regulations affect Exchanges that make qualified health plans available to individuals and employers., 1109870=This document contains final and temporary regulations. These regulations eliminate one of two exceptions to the coordination rule between asset transfers and indirect stock transfers for certain outbound asset reorganizations. The regulations also modify the third exception to the coordination rule for certain outbound exchanges so that this exception is consistent with the remaining asset reorganization exception. In addition, the regulations modify, in various contexts, procedures for obtaining reasonable cause relief. Finally, the regulations implement certain changes with respect to transfers of stock or securities by a domestic corporation to a foreign corporation in a section 361 exchange. The regulations primarily affect domestic corporations that transfer property to foreign corporations in certain outbound nonrecognition exchanges. The text of these temporary regulations serves as the text of the proposed regulations (REG-132702-10) published in the notice of proposed rulemaking on this subject in the Proposed Rules section of this issue of the Federal Register ., 124641=This document contains proposed regulations relating to multiemployer pension plans that are projected to have insufficient funds, at some point in the future, to pay the full benefits to which individuals will be entitled under the plans (referred to as plans in “critical and declining status”). The Multiemployer Pension Reform Act of 2014 (“MPRA”) amended the Internal Revenue Code to incorporate suspension of benefits provisions that permit these multiemployer plans to reduce pension benefits payable to participants and beneficiaries if certain conditions are satisfied. MPRA requires the Secretary of the Treasury, in consultation with the Pension Benefit Guaranty Corporation and the Secretary of Labor, to approve or deny applications by these plans to reduce benefits. As required by MPRA, these proposed regulations, together with temporary regulations being published at the same time, provide guidance implementing these statutory provisions. These proposed regulations would affect active, retired, and deferred vested participants and beneficiaries of multiemployer plans that are in critical and declining status as well as employers contributing to, and sponsors and administrators of, those plans., 30763=This document contains final and temporary regulations amending the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts. These regulations provide that, subject to certain exceptions, a notional principal contract with a nonperiodic payment, regardless of whether it is significant, must be treated as two separate transactions consisting of one or more loans and an on-market, level payment swap. This document also contains temporary regulations regarding an exception from the definition of United States property. These regulations affect parties making and receiving payments under notional principal contracts, including United States shareholders of controlled foreign corporations and tax-exempt organizations. The text of the temporary regulations also serves as the text of the proposed regulations set forth in the notice of proposed rulemaking (REG-102656-15) on this subject in the Proposed Rules section in this issue of the Federal Register ., 95988=§ 1474 - Special rules, 92948=§ 1221 - Capital asset defined, 349394=This document contains final regulations relating to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-173 (collectively, the Affordable Care Act). These final regulations provide individual taxpayers with guidance under section 5000A of the Internal Revenue Code on the requirement to maintain minimum essential coverage and rules governing certain types of exemptions from that requirement., 404459=This document contains proposed amendments to the regulations that address the tax treatment of distributions from designated Roth accounts under tax-favored retirement plans. The proposed regulations would limit the applicability of the rule regarding the allocation of after-tax amounts when disbursements are made to multiple destinations so the allocation rule applies only to distributions made before the earlier of January 1, 2015 or a date chosen by the taxpayer that is on or after September 18, 2014. These regulations would affect administrators of, employers maintaining, participants in, and beneficiaries of designated Roth accounts under tax-favored retirement plans., 540278=This document contains corrections to final and temporary regulations (TD 9658), which were published in the Federal Register on Thursday, March 6, 2014 (79 FR 12726). The regulations relate to the withholding of tax on certain U.S. source income paid to foreign persons, information reporting and backup withholding with respect to payments made to certain U.S. persons, and portfolio interest paid to nonresident alien individuals and foreign corporations., 1543628=This document corrects a correction to a notice of public hearing on an advance proposed rulemaking (REG-133223-08) that was published in the Federal Register on Wednesday, February 29, 2012 (77 FR 12226) relating to Indian tribal government plans., 603350=This document contains corrections to final and temporary regulations (TD 9650) that were published in the Federal Register on Tuesday, December 31, 2013 (78 FR 79602). The regulations provide guidance on determining ownership of a passive foreign investment company (“PFIC”) and on the annual filing requirements for shareholders of PFICs., 93552=§ 1286 - Tax treatment of stripped bonds, 1181894=This document corrects final regulations (TD 9607) that was published in the Federal Register on Friday, December 28, 2012 (77 FR 76380) regarding the application of the substantiality de minimis rule. In the interest of sound tax administration, this rule is being made inapplicable. These final regulations affect partnerships and their partners., 517268=This document contains corrections to final regulations (TD 9665) that were published in the Federal Register on Monday, May 12, 2014 (79 FR 26838) clarifying the rules regarding the tax treatment of payments by qualified retirement plans for accident or health insurance. The final regulations set forth the general rule under section 402(a) that amounts held in a qualified plan that are used to pay accident or health insurance premiums are taxable distributions unless described in certain statutory exemptions. The final regulations do not extend this result to arrangements under which amounts are used to pay premiums for disability insurance that replaces retirement plan contributions in the event of a participant's disability. These regulations affect sponsors, administrators, participants, and beneficiaries of qualified retirement plans., 651530=This document contains corrections to final regulations (TD 9644) that were published in the Federal Register on Monday, December 2, 2013 (78 FR 72394). The final regulations provide guidance on the general application of the Net Investment Income Tax and the computation of Net Investment Income., 1058376=This document contains proposed regulations that provide guidance to charitable hospital organizations on the community health needs assessment (CHNA) requirements, and related excise tax and reporting obligations, enacted as part of the Patient Protection and Affordable Care Act of 2010. These proposed regulations also clarify the consequences for failing to meet these and other requirements for charitable hospital organizations. These regulations will affect charitable hospital organizations., 1606138=In the Rules and Regulations section in this issue of the Federal Register, the IRS is issuing temporary regulations that provide guidance relating to a new provision of the Internal Revenue Code (Code) that addresses situations in which foreign income taxes have been separated from the related income. Those regulations are necessary to provide guidance on applying the new statutory provision, which was enacted as part of legislation commonly referred to as the Education Jobs and Medicaid Assistance Act (EJMAA) on August 10, 2010. The text of those temporary regulations published in this issue of the Federal Register also serves as the text of these proposed regulations., 94894=§ 1378 - Taxable year of S corporation, 693679=This document contains corrections to a withdrawal of notice of proposed rulemaking, notice of proposed rulemaking and notice of public hearing (REG-120282-10) that was published in the Federal Register on Thursday, December 5, 2013 (78 FR 73128). The proposed rules provide guidance to nonresident alien individuals and foreign corporations that hold certain financial products providing for payments that are contingent upon or determined by reference to U.S. source dividend payments and to withholding agents., 826319=This document contains final regulations that require information reporting by persons who receive mortgage insurance premiums, including prepaid premiums, aggregating $600 or more during any calendar year. The final regulations implement reporting requirements that result from the extension of the treatment of mortgage insurance premiums made by the American Taxpayer Relief Act of 2012. These regulations will affect any person who, in the course of a trade or business, receives from an individual mortgage insurance premiums that in the aggregate total $600 or more during a calendar year., 1560654=This document contains corrections to the final regulations (TD 9571), which were published in the Federal Register on January 17, 2012 (77 FR 2225) that provide guidance regarding the allocation and apportionment of interest expense., 489613=This document amends final regulations (TD 9664) that were published in the Federal Register on May 9, 2014. The final regulations provide guidance on which costs incurred by estates or trusts other than grantor trusts (non-grantor trusts) are subject to the 2-percent floor for miscellaneous itemized deductions under section 67(a) of the Internal Revenue Code., 1002333=This document contains final regulations relating to the application of section 108(i) of the Internal Revenue Code (Code) to partnerships and S corporations and provides rules regarding the deferral of discharge of indebtedness income and original issue discount deductions by a partnership or an S corporation with respect to reacquisitions of applicable debt instruments after December 31, 2008, and before January 1, 2011. The regulations affect partnerships and S corporations with respect to reacquisitions of applicable debt instruments and their partners and shareholders., 1289511=This document contains proposed regulations under section 172(h) and section 1502 of the Internal Revenue Code. These proposed regulations provide guidance regarding the treatment of corporate equity reduction transactions (CERTs), including the treatment of multiple step plans for the acquisition of stock and CERTs involving members of a consolidated group. These proposed regulations also provide guidance regarding certain elections relating to the carryback of consolidated net operating losses (CNOLs) to separate return years. These proposed regulations will affect C corporations and corporations filing consolidated returns., 101990=§ 1001 note - Congressional findings and declaration of policy, 35934=This document contains corrections to final regulations (TD 9708) that were published in the Federal Register on December 31, 2014 (79 FR 78954). The final regulations provide guidance regarding the requirements for charitable hospital organizations added by the Patient Protection and Affordable Care Act of 2010., 94332=§ 1298 - Special rules, 1387041=This document contains final regulations with respect to a provision of the Internal Revenue Code (Code) relating to the recapture of overall domestic losses that was enacted as part of the American Jobs Creation Act of 2004 (AJCA). These regulations provide guidance regarding these changes, as well as updated guidance with respect to overall foreign losses and separate limitation losses, and affect individuals and corporations claiming foreign tax credits., 8651=This document contains corrections to final regulations (TD 9719) that were published in the Federal Register on May 8, 2015 (80 FR 26437). The final regulations amend the treatment of nonperiodic payments made or received pursuant to certain notional principal contracts., 92611=§ 1060 - Special allocation rules for certain asset acquisitions, 94795=§ 1377 - Definitions and special rule, 104741=Reorganization ... 1978 Plan No. 4, 93141=§ 1248 - Gain from certain sales or exchanges of stock in certain foreign corporations, 222063=This document contains corrections to notice of proposed rulemaking by cross-reference to temporary and notice of public hearing (REG-133489-13) that were published in the Federal Register on Friday, April 3, 2015 (80 FR 18171). The notice of proposed rulemaking by cross-reference to temporary and notice of public hearing are relating to the allocation of the credit for increasing research activities (research credit) to corporations and trades or businesses under common control (controlled groups)., 957382=This document contains corrections to final regulations and removal of temporary regulations (TD 9623) that were published in the Federal Register on Wednesday, July 3, 2013 (78 FR 39973). The final regulations are relating to the application of section 108(i) of the Internal Revenue Code to partnerships and S corporations and provides rules regarding the deferral of discharge of indebtedness income and original issue discount deductions by a partnership or an S corporation with respect to reacquisitions of applicable debt instruments after December 31, 2008, and before January 1, 2011., 94109=§ 1296 - Election of mark to market for marketable stock, 1172306=This document contains corrections to a notice of proposed rulemaking (REG-148873-09) and notice of public hearing that was published in the Federal Register on Monday, January 7, 2013 (78 FR 913). The proposed regulation provides guidance regarding creating a new taxpayer identifying number known as an IRS truncated taxpayer identification number, a TTIN., 634031=This document cancels a public hearing on proposed regulations that provide guidance on certain provisions of the American Jobs Creation Act of 2004 and conform the regulations to statutory changes in the Taxpayer Relief Act of 1997., 95788=§ 1472 - Withholdable payments to other foreign entities, 512860=This document contains corrections to a notice of proposed rulemaking and notice of public hearing (REG-150760-13) that was published in the Federal Register on Wednesday, May 14, 2014 (79 FR 27508), that clarify the definition of real property for purposes of the real estate investment trust provisions of the Internal Revenue Code., 1160350=This document contains corrections to a notice of proposed rulemaking and notice of public hearing (REG-130507-11) that was published in the Federal Register on Wednesday, December 5, 2012 (77 FR 72612). The proposed regulations provide guidance under section 1411 of the Internal Revenue Code., 1250299=This document contains proposed regulations that provide guidance under section 1411 of the Internal Revenue Code (Code). Section 1402(a)(1) of the Health Care and Education Reconciliation Act of 2010 added new section 1411 to the Code effective for taxable years beginning after December 31, 2012. The proposed regulations affect individuals, estates, and trusts. This document also contains a notice of a public hearing on these proposed regulations., 52377=This document contains corrections to final regulations (TD 9715) that were published in the Federal Register on April 1, 2015 (80 FR 17314). The final regulations are regarding the agent for an affiliated group of corporations that files a consolidated return (consolidated group)., 93654=§ 1291 - Interest on tax deferral, 638448=This document contains corrections to final and temporary regulations (TD 9658), which were published in the Federal Register on Thursday, March 6, 2014 (79 FR 12726). The regulations relate to the withholding of tax on certain U.S. source income paid to foreign persons, information reporting and backup withholding with respect to payments made to certain U.S. persons, portfolio interest paid to nonresident alien individuals and foreign corporations, and the associated requirements governing collection, refunds, and credits of withheld amounts under these rules., 344329=This document contains final regulations providing guidance relating to the provisions of the Hiring Incentives to Restore Employment (HIRE) Act that require specified foreign financial assets to be reported to the Internal Revenue Service for taxable years beginning after March 18, 2010. In particular, the final regulations provide guidance relating to the requirement that individuals attach a statement to their income tax return to provide required information regarding specified foreign financial assets in which they have an interest. The final regulations affect individuals required to file Form 1040, “U.S. Individual Income Tax Return,” or Form 1040-EZ, “Income Tax Return for Single and Joint Filers With No Dependents,” and certain individuals required to file Form 1040-NR, “Nonresident Alien Income Tax Return,” or Form 1040NR-EZ, “U.S. Income Tax Return for Certain Nonresident Aliens with No Dependents.”, 266883=This document contains corrections to final regulations (TD 9709) that were published in the Federal Register on January 29, 2015 (79 FR 4791). The final regulations authorize the IRS to prescribe the procedure by which certain entities may apply to the IRS for recognition of exemption from Federal income tax., 1547898=This document corrects a notice of public hearing on an advance proposed rulemaking (REG-157714-06) that was published in the Federal Register on Friday, February 3, 2012 (77 FR 5442) relating to the determination of governmental plans., 1593839=This document contains final and temporary Income Tax Regulations with respect to a new provision of the Internal Revenue Code (Code) that addresses situations in which foreign income taxes have been separated from the related income. These regulations are necessary to provide guidance on applying the new statutory provision, which was enacted as part of legislation commonly referred to as the Education Jobs and Medicaid Assistance Act (EJMAA) on August 10, 2010. These regulations affect taxpayers claiming foreign tax credits. The text of the temporary regulations also serves as the text of the proposed regulations (REG-132736-11) published in the Proposed Rules section of this issue of the Federal Register ., 1401881=This document contains final regulations under section 1502 of the Internal Revenue Code (Code). These final regulations modify the election under which a consolidated group can avoid immediately taking into account an intercompany item after the liquidation of a target corporation. These regulations apply to corporations filing consolidated income tax returns., 102901=114 Stat. 2763, 1552150=This document corrects a notice of public hearing on an advance proposed rulemaking (REG-133233-08) that was published in the Federal Register on Friday, February 3, 2012 (77 FR 5442) relating to Indian tribal government plans., 1343901=This document corrects a notice of proposed rulemaking (REG-153627-08) that was published in the Federal Register on Thursday, June 21, 2012 (77 FR 37352), that would provide guidance relating to automatic extensions of time for filing certain employee plan returns by adding the Form 8955-SSA, “Annual Registration Statement Identifying Separated Participants With Deferred Vested Benefits,” to the list of forms that are covered by the Income Tax Regulations on automatic extensions., 330541=This document contains final regulations that provide guidance regarding the requirements for charitable hospital organizations added by the Patient Protection and Affordable Care Act of 2010. The regulations will affect charitable hospital organizations., 1128767=This document contains final regulations under section 6654 of the Internal Revenue Code (Code) relating to reduced estimated income tax payments for qualified individuals with small business income for any taxable year beginning in 2009 and does not apply to any taxable years beginning before or after 2009. The final regulations implement changes to section 6654 made by the American Recovery and Reinvestment Act of 2009. The final regulations provide guidance for qualified individuals with small business income to certify that they satisfy the statutory gross income requirement for purposes of the reduction in their required 2009 estimated income tax payments., 939767=This document contains amendments to correct errors in final regulations [TD 9619] that provide guidance under section 336(e) of the Internal Revenue Code (CODE), which authorizes the issuance of regulations under which an election may be made to treat sale, exchange or distribution of at least 80 percent of the voting power and value of the stock of a corporation (target) as a sale of all its underlying assets. These regulations were published in the Federal Register on Wednesday, May 15, 2013., 302949=This document contains final Income Tax Regulations with respect to a provision of the Internal Revenue Code (Code) that addresses situations in which foreign income taxes have been separated from the related income. These regulations are necessary to provide guidance on applying the statutory provision, which was enacted as part of legislation commonly referred to as the Education Jobs and Medicaid Assistance Act (EJMAA) on August 10, 2010. These regulations affect taxpayers claiming foreign tax credits or deducting foreign income taxes., 494121=This document contains final regulations that provide guidance concerning the allocation and apportionment of interest expense by corporations owning a 10 percent or greater interest in a partnership, as well as the allocation and apportionment of interest expense using the fair market value method. These regulations also update the interest allocation regulations to conform to the statutory changes made by section 216 of the legislation commonly referred to as the Education Jobs and Medicaid Assistance Act (EJMAA), enacted on August 10, 2010, affecting the affiliation of certain foreign corporations for purposes of section 864(e). These regulations affect taxpayers that allocate and apportion interest expense., 94227=§ 1297 - Passive foreign investment company, 1151717=This document contains proposed regulations relating to the requirement to maintain minimum essential coverage enacted by the Patient Protection and Affordable Care Act and the Health Care and Education Reconciliation Act of 2010, as amended by the TRICARE Affirmation Act and Public Law 111-173. These proposed regulations provide guidance on the liability for the shared responsibility payment for not maintaining minimum essential coverage. This document also provides notice of a public hearing on these proposed regulations., 359150=This document contains a correction to final and temporary regulations (TD 9657), which were published in the Federal Register on Thursday, March 6, 2014 (79 FR 12812). The regulations relate to information reporting by foreign financial institutions (FFIs) with respect to U.S. accounts and withholding on certain payments to FFIs and other foreign entities., 1044004=This document contains corrections to final and temporary regulations (TD 9614) that were published in the Federal Register on Tuesday, March 19, 2013 (78 FR 17024). The final and temporary regulations apply to transfers of certain property by a domestic corporation to a foreign corporation in certain nonrecognition exchanges, or to distributions of stock of certain foreign corporations by a domestic corporation in certain nonrecognition distributions. The final regulations also establish reporting requirements for property transfers and stock distributions to which the final regulations apply., 386107=This document contains proposed regulations that will remove a rule that a deemed discharge of indebtedness for which a Form 1099-C, “Cancellation of Debt,” must be filed occurs at the expiration of a 36-month non-payment testing period. The Department of the Treasury and the IRS are concerned that the rule creates confusion for taxpayers and does not increase tax compliance by debtors or provide the IRS with valuable third-party information that may be used to ensure taxpayer compliance. The proposed regulations will affect certain financial institutions and governmental entities., 707599=This document contains a new proposed regulation providing guidance on how certain organizations that provide employee benefits must calculate unrelated business taxable income (UBTI). This document also withdraws the notice of proposed rulemaking relating to UBTI that was published on February 4, 1986., 1406221=This document withdraws a notice of proposed rulemaking relating to financial asset securitization trusts (FASITs). The FASIT provisions (sections 860H through 860L) of the Internal Revenue Code (Code) were repealed by Public Law 108-357, effective January 1, 2005, with a limited exception for existing FASITs., 244486=This document contains corrections to a notice of proposed rulemaking by cross-reference to temporary regulations (REG-143040-14) that was published in the Federal Register on Friday, March 13, 2015 (80 FR 13292). The IRS is issuing temporary regulations relating to information reporting by brokers for transactions involving debt instruments and options., 1360662=This document corrects a notice of proposed rulemaking and notice of public hearing (REG-134042-07) that was published in the Federal Register on Tuesday, June 12, 2012 (77 FR 34884) relating to basis of indebtedness of S corporations to their shareholders., 912917=This document contains final and temporary regulations relating to the application of the straddle rules to a debt instrument. The temporary regulations clarify that a taxpayer's obligation under a debt instrument can be a position in personal property that is part of a straddle. The temporary regulations primarily affect taxpayers that issue debt instruments that provide for one or more payments that reference the value of personal property or a position in personal property. The text of these temporary regulations also serves as the text of the proposed regulations (REG-111753-12) set forth in the Proposed Rules section in this issue of the Federal Register ., 95302=§ 1441 - Withholding of tax on nonresident aliens, 17696=This document contains amendments to temporary regulations relating to information reporting by brokers for transfers of debt instruments. The amendments change the applicability date of the temporary regulations for reporting certain information on a transfer statement from June 30, 2015, to January 1, 2016. The amendments to the temporary regulations will provide guidance to brokers and their customers., 1232259=This document contains amendments to temporary regulations relating to guidance regarding deduction and capitalization of expenditures related to tangible property. These amendments change the applicability dates of the temporary regulations to taxable years beginning on or after January 1, 2014, while permitting taxpayers to choose to apply the temporary regulations for taxable years beginning on or after January 1, 2012. The amendments to the temporary regulations will affect all taxpayers that acquire, produce, or improve tangible property., 1335401=This document contains final regulations relating to the use of business aircraft for entertainment. These final regulations affect taxpayers that deduct expenses for entertainment, amusement, or recreation provided to specified individuals. The final regulations reflect statutory amendments under the American Jobs Creation Act of 2004 (AJCA) and the Gulf Opportunity Zone Act of 2005 (GOZA).}",
    "lastModified": "Mon, 06 Jul 2015 18:51:02 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 35207 - Suspension of Benefits Under the Multiemployer Pension Reform Act of 2014 2015-06-19; vol. 80 # 118 - Friday, June 19, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 26. Title 26 published on 2015-04-01. [T.D. 7207, 37 FR 20774, Oct. 4, 1972] This section applies only to contributions paid in taxable years beginning after December 31, 1969. Effective date. (f) A taxpayer resides with his wife in a city in the eastern United States. He agrees, in writing, with a fraternal society described in section 170(c)(4) to accept a child selected by the society for maintenance by him as a member of his household during 1971 in order that the child may attend the",
    "textAfterTable": "DEPARTMENT OF THE TREASURY, Internal Revenue Service Temporary regulations. Effective Date: These regulations are effective on June 19, 2015. Applicability Date: For date of applicability, see § 1.432(e)(9)-1T(j). 26 CFR Parts 1 and 602 Summary This document contains temporary regulations relating to multiemployer pension plans that are projected to have insufficient funds, at some point in the future, to pay the full benefits to which individuals will be entitled under the plans (referred to as plans in “critical and declining status”). The Multiemployer Pension Reform Act of 2014 (“MPRA”) amended the Internal Revenue Code to incorporate suspension of benefits provisions that permit these multiemployer plans to reduce pension benefits payable to participants and beneficiaries if certain conditions are satisfied. MPRA requires the Secretary of the Treasury, in consultation with the Pension Benefit Guaranty Corporation and the Secretary of Labor, to approve or deny applications by these plans to reduce benefits. As required by MPRA, these temporary regulations, together with proposed regulations being published at the same time, provide guidance implementing these statutory provisions. These temporary regulations affect active, retired, and deferred vested participants and beneficiaries of multiemployer plans that are in critical and declining status as well as employers contributing to, and sponsors and administrators of, those plans. The text of these temporary regulations also serves, in part, as the text of the",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}