{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Non-traditional, self-directed, graduate (master and doctorate degrees are also offered), parents, full-time workers, innovators.",
            "Overall, I find WilmU to be the perfect fit for my hectic schedule. As a non-traditional student (28 years old), I didn't want to be in the middle of party central, and it was important to me to have flexible options that would allow me to earn my degree while attending to my other responsibilities.",
            "Again, being a commuter school, on-campus activities are somewhat limited. That being said, there are frequent student appreciation days, planned trips (local and bus trips), event nights (upcoming include salsa, game tournaments, playoff watching parties), and study/career related workshops.",
            "There is a cafeteria in one building, a small cafe in the library, and vending machines scattered through. I'm a strict vegan and find the options to be extremely limited (i.e., practically non-existent). The main cafeteria offers salads, sandwiches (hot and cold), pizza, and standard sides (fries, mozzarella sticks, onion rings, hot wings), and there are almost no vegetarian options, let alone vegan. New Castle isn't exactly a cultural mecca, so there aren't many options nearby either. If you don't take your classes online, you might want to pack lunch.",
            "Non-existent. Wilmington is a commuter school and doesn't offer on-campus accommodations.",
            "Coursework is challenging, but not unnecessarily so (of course this varies from class to class and instructor to instructor). The grading scale is ambitious and challenging; a 4.0 GPA requires all grades to be above 95%. An 'A' is 92-100%, 'B' is 83-91.9%, 'C' is 74-82.9%, and a 'D' is 65-73.9%. Anything under a 65% is a failing grade.",
            "If you are looking for the full college experience - frat parties, dorm rooms, 24/7 partying - WilmU is NOT for you. It's a commuter school, with courses available in a variety of formats (standard 15-week semester, 7 week accelerated blocks, weekend modules, day or evening, online or in person), making it the perfect choice for anyone with additional responsibilities outside of school, such as a career or a family.",
            "Wilmington University is a great small, private university in New Castle, DE. With tuition rates similar to University of Delaware at a fraction of the class sizes, I have found it to be a great school for the self-financed student. Class offerings are varied and flexible to allow you to tailor the right program for you."
        ]
    ],
    "pageTitle": "Wilmington University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Wilmington-University/reviews?_escaped_fragment_=/show/82933",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890461351,
    "recordOffset": 890427639,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{146996=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "01/12/2010 Reviewer is A current student here. 4 out of 4 people found this review useful. 1 of 40 Megan from New Castle, DE Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am learning a lot This University has some of the best teachers out there! They are really increasing my love and knowledge of Information Technology! Login to rate or flag the reviews Amanda from Dover, DE 01/04/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 40 Categories Comments Great for these types of students Any college could be a good school, the students make the school what it really is. Every student that tries their best and is willing to do the work is the best student for any college! Tips for prospective students Students who are choosing to go to Wilmington University, or any other college in that matter, must understand time management and self discipline. The college life isn't always about your room-mates or partying with friends, it's about setting yourself up for success. You have to have the drive to do well in college. Go to class, don't be afraid to ask",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}