{
    "relation": [
        [
            "Citing Patent",
            "US7574372 *",
            "US7921022",
            "US8005696",
            "US8090707",
            "US8121953",
            "US8185418",
            "US8185419",
            "US8265966",
            "US8265967",
            "US8306835",
            "US8589195",
            "US8595039",
            "US20120089406 *",
            "US20130041902 *"
        ],
        [
            "Filing date",
            "17 May 2001",
            "18 Jan 2006",
            "18 Jan 2006",
            "7 Jul 2005",
            "30 Dec 2004",
            "18 Jan 2006",
            "18 Jan 2006",
            "19 Aug 2011",
            "19 Aug 2011",
            "18 Jan 2006",
            "18 Jan 2006",
            "4 Apr 2011",
            "2 Jun 2011",
            ""
        ],
        [
            "Publication date",
            "11 Aug 2009",
            "5 Apr 2011",
            "23 Aug 2011",
            "3 Jan 2012",
            "21 Feb 2012",
            "22 May 2012",
            "22 May 2012",
            "11 Sep 2012",
            "11 Sep 2012",
            "6 Nov 2012",
            "19 Nov 2013",
            "26 Nov 2013",
            "12 Apr 2012",
            "14 Feb 2013"
        ],
        [
            "Applicant",
            "Pan Travel Company Llc",
            "Ita Software, Inc.",
            "Ita Software, Inc.",
            "Rearden Commerce Inc.",
            "Rearden Commerce Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Google Inc.",
            "Steven Ladd Huffman",
            "Rearden Commerce, Inc."
        ],
        [
            "Title",
            "Methods and apparatus for managing a tour product purchase",
            "Multi-passenger multi-route travel planning",
            "Incremental searching in multi-passenger multi-route travel planning",
            "Chance meeting addition to trip planner or meeting planner",
            "Intelligent meeting planner",
            "Multi-passenger multi-route travel planning",
            "Incremental searching with partial solutions for multi-passenger multi-route travel planning",
            "Multi-passenger multi-route travel planning through common locations",
            "Incremental searching in multi-passenger multi-route travel planning",
            "User interface for inputting multi-passenger multi-route travel planning query",
            "Multi-passenger multi-route travel planning",
            "Multi-passenger multi-route travel planning",
            "System and method for grouping trip itineraries",
            "Travel services search"
        ]
    ],
    "pageTitle": "Patent US7340402 - Generating a diverse set of travel options - Google Patents",
    "title": "",
    "url": "http://www.google.co.uk/patents/US7340402",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00150-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482883691,
    "recordOffset": 482838795,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5871=A pricing graph 38′ (FIG. 3) is produced containing logically combinable nodes that can be used to efficiently and compactly represent a set of pricing solutions 38 (FIG. 1). The pricing graph 38′ as used herein is a so-called directed acyclic graph although other types of representations could be used. For example, a grammar could be used.}",
    "TableContextTimeStampAfterTable": "{49588=The scheduler process 16 provides the itineraries to a faring process 18. The faring process 18 provides a set of pricing solutions 38 by finding valid fares corresponding to the itineraries produced by the scheduler process 16. The faring process 18 validates the fares for inclusion in the set of pricing solutions 38. A preferred faring process that places fares and itineraries in a compact data structure referred to herein in as a pricing graph is described in co-pending patent application entitled TRAVEL PLANNING SYSTEM, Ser. No. 09/109,327, filed on Jul. 2, 1998 by Carl G. deMarcken et al. and assigned to the assignee of the invention and incorporated herein by reference., 48693=This query 48 is fed to the scheduler process 16 that produces a large number of itineraries, that is, sequences of flight segments between the origin and destination for each slice of a journey. Examples of scheduler systems that may be used include the OAG Flight Desk (Official Airlines Guide, a division of Reed Travel Group) or schedule components of computer reservation systems (CRS=s) such as Sabre7, Apollo7, Amadeus7 and WorldSpan7. It is preferable in order to obtain the largest number of possible itineraries to use a scheduler with dynamic connection generation. Such a scheduler is described in co-pending patent application entitled SCHEDULER SYSTEM FOR TRAVEL PLANNING SYSTEM, Ser. No. 09/109,622, filed on Jul. 2, 1998 by Carl G. deMarcken et al. and assigned to the assignee of the invention and incorporated herein by reference.}",
    "textBeforeTable": "Patent Citations It is to be understood that while the invention has been described in conjunction with the detailed description thereof, the foregoing description is intended to illustrate and not limit the scope of the invention, which is defined by the scope of the appended claims. Other aspects, advantages, and modifications are within the scope of the following claims. OTHER EMBODIMENTS A computer travel planning system that outputs a diversity of travel options may be built by combining a travel planning system that transmits a larger set of solutions to a second computer system that reduces the set of travel options using diversity procedures as described above. The diversity process can be run more than once with different travel option preference functions (a set of F's). For example, a travel planning system may wish to output a diversity of travel options that include diverse options that are cheap and diverse options that are convenient, reflecting uncertainty in whether a traveler is cost-sensitive or convenience-sensitive. Given set of travel options Ts 401, a set of preference functions Fs, and a desired number of answers for each preference function Ns, the alternative diversity process 400 returns a reduced set of diverse travel options Rts. The alternative diversity process initializes 402 a list of result travel options RTs to be empty and for each preference function F in the set of preference functions Fs and",
    "textAfterTable": "US5832451 23 Jan 1996 3 Nov 1998 Electronic Data Systems Corporation Automated travel service management information system US5832453 * 22 Mar 1994 3 Nov 1998 Rosenbluth, Inc. Computer system and method for determining a travel scheme minimizing travel costs for an organization US5832454 24 Oct 1995 3 Nov 1998 Docunet, Inc. Reservation software employing multiple virtual agents US5838973 3 May 1996 17 Nov 1998 Andersen Consulting Llp System and method for interactively transforming a system or process into a visual representation US5897620 8 Jul 1997 27 Apr 1999 Priceline.Com Inc. Method and apparatus for the sale of airline-specified flight tickets US5948040 6 Feb 1997 7 Sep 1999 Delorme Publishing Co. Travel reservation information and planning system US6119094 * 29 Feb 1996 12 Sep 2000 Electronic Data Systems Corporation Automated system for identifying alternate low-cost travel arrangements US6295521 * 2 Jul 1998",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}