{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I feel safety is great they are there but not seen unless needed.",
            "Only on PTK for good grades.",
            "There are many different clubs and activities if you want to join. Most have a difficult time attending these due to being working adults or other family commitments.",
            "Working adults and unsure high school graduates.",
            "Many buildings but not all located near each other.",
            "I feel you get the most bang for your buck by attending locally due to no extra travel or living expense.",
            "Local college so most live at home with family. There are a few activities on campus but not a lot due to no campus living.",
            "Vending machines for snacks are here and for soda. They are very expensive so I pack my dinner or purchase it from a local drive thru.",
            "No dorms or campus living here.",
            "I feel that the academic here are Awesome! I have been challenged and assisted by the teachers to achieve more.",
            "Start with the basics and build from there. You have to have the general classes anyway so why pay more for the same thing else where.",
            "I enjoy attending classes here in Kokomo. I am with other student from different walking of life."
        ]
    ],
    "pageTitle": "Ivy Tech Community College-Kokomo Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ivy-Tech-Community-College-Kokomo/reviews?_escaped_fragment_=/show/94469",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00139-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 891628495,
    "recordOffset": 891595011,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{124828=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "03/21/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 28 Yavonne from Peru, IN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Campus Safety There is an on duty officer here at all times as well as off duty police officers to serve as security. Greek Life I donk know much about this. Clubs and Activities There is a culb for almost everything. Bang for the buck It is really cheap to attent this college the classes are cheap and you will enjoy them as well as learn a lot of things you will be able to use during your proffesion. What to do for fun We have mystery trips monthly here and its free to you. you will not know where you are going until the morning of the trip. There is always a trip for you to go on and depending on what organization you are involved in, the trips just get better & better. This year there is a trip to Paris! As for fun outside of school I dont know about to many things. There is a bowling alley, a theater & sksating rink near by. Food and Dining There is restaurants and convenient stores surrounding",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}