{
    "relation": [
        [
            "Timestamp",
            "2015-07-11",
            "2011-08-02",
            "2011-08-02"
        ],
        [
            "Action",
            "Added",
            "Added",
            "Added"
        ],
        [
            "Category",
            "SYNONYM",
            "SYNONYM",
            "DEFINITION"
        ],
        [
            "Detail",
            "N-methyl-D-aspartate receptor clustering",
            "NMDA receptor clustering",
            "The receptor clustering process in which N-methyl-D-aspartate (NMDA) receptors are localized to distinct domains in the cell membrane."
        ]
    ],
    "pageTitle": "GO:0097114 NMDA glutamate receptor clustering",
    "title": "",
    "url": "http://www.ebi.ac.uk/QuickGO/GTerm?id=GO:0097114",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417756703,
    "recordOffset": 417730131,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{122767=Copyright (c) EMBL-EBI 2013 | EBI is an Outstation of the European Molecular Biology Laboratory | Privacy | Cookies | Terms of use, 122634=EMBL-EBI, Wellcome Trust Genome Campus, Hinxton, Cambridgeshire, CB10 1SD, UK +44 (0)1223 49 44 44}",
    "textBeforeTable": "icon for more details. Synonyms are alternative words or phrases closely related in meaning to the term name, with indication of the relationship between the name and synonym given by the synonym scope. Click on the Synonyms This term was created by the GO Consortium with support from Acknowledgements GO:0097114 Wiki Page GONUTS The receptor clustering process in which N-methyl-D-aspartate (NMDA) receptors are localized to distinct domains in the cell membrane. PMID:15620359 Definition Biological Process Ontology NMDA glutamate receptor clustering Name GO:0097114 ID Term Information Dataset Web Services P06727 Term Basket",
    "textAfterTable": "Taxon ID Taxon Reference(s) GOTAX:0000299 GO:0032501 multicellular organismal process only_in_taxon 2759 Eukaryota GOTAX:0000537 GO:0032501 multicellular organismal process never_in_taxon 4932 Saccharomyces cerevisiae GOTAX:0000538 GO:0032501 multicellular organismal process never_in_taxon 4896 Schizosaccharomyces pombe More information on taxon constraints in GO is available here Ancestor Chart This chart is interactive; you can click on the term boxes and legend for more information. Display Key ShowHide GO IDs ShowHide Term box width Term box height Slim colours ShowHide Show children ShowHide Image size limit (in megapixels) Note that setting the limit too high may result in images being generated slowly; it may even cause the browser to crash. The maximum limit is 20 megapixels.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}