{
    "relation": [
        [
            "Value",
            "1",
            "5",
            "-9",
            "-8",
            "."
        ],
        [
            "Label",
            "YES",
            "NO",
            "REFUSED",
            "DONT KNOW",
            "Missing"
        ],
        [
            "Frequency",
            "2683",
            "2274",
            "1",
            "13",
            "15042"
        ],
        [
            "Valid Percent",
            "54.13%",
            "45.87%",
            "-",
            "-",
            "-"
        ],
        [
            "Total Percent",
            "13.41%",
            "11.36%",
            "00.00%",
            "00.06%",
            "75.16%"
        ]
    ],
    "pageTitle": "all",
    "title": "",
    "url": "http://www.icpsr.umich.edu/icpsrweb/CPES/files/cpes/sections/SECTION_C/variables/all",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 509570383,
    "recordOffset": 509540492,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "4 STRONGLY DISAGREE 3 SOMEWHAT DISAGREE 2 SOMEWHAT AGREE 1 STRONGLY AGREE C1a. Now I'd like to know how strongly you agree or disagree with these statements about yourself. I feel that I'm a person of worth, at least on an equal basis with others. Do you strongly agree, somewhat agree, somewhat disagree or strongly disagree? Variable Label: I am person of worth/equal to others NSAL C1A CPES V06641 Home > Interactive Codebook > CPES > Psychological Resources and Health > all How should I detect and handle the single PSU in a stratum for NLAAS or CPES Latino groups with Stata? CPES Variable Search Function is available now! Correction of the label of CPES V06442/NLAAS LI1 variable Are all NCS-R Screening Section questions asked of all respondents? How should I handle no subpopulation (Asian or Latino) members in a stratum for only NLAAS Asian or Latino groups with Stata?",
    "textAfterTable": "-8 DONT KNOW 11 - 00.05% . Missing 14118 - 70.54% Disclaimer: Frequencies displayed above are not weighted. Missing Data Codes: -9 (Refused), -8 (Don't know), . (Missing) Total Cases: 20013 You can also view this variable in SDA . CPES V06642 NSAL C1B Variable Label: I have # of good qualities C1b. I feel I have a number of good qualities. (Do you strongly agree, somewhat agree, somewhat disagree or strongly disagree?) 1 STRONGLY AGREE 2 SOMEWHAT AGREE 3 SOMEWHAT DISAGREE 4 STRONGLY DISAGREE Value Label Frequency Valid Percent Total Percent 1 STRONGLY AGREE 5314 90.25% 26.55% 2 SOMEWHAT AGREE 524 08.90% 02.62% 3 SOMEWHAT DISAGREE 28 00.48% 00.14% 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}