{
    "relation": [
        [
            "Condition:",
            "Year:",
            "Character Family:"
        ],
        [
            "Used: An item that has been used previously. See the seller’s listing for full details and description of any imperfections. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "1991",
            "Teenage Mutant Ninja Turtles"
        ],
        [
            "Type:",
            "Brand:",
            "Packaging:"
        ],
        [
            "Action Figure",
            "Playmates Toys",
            "Without Packaging"
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/TATTOO-Teenage-Mutant-Ninja-Turtles-100-complete-vintage-1991-TMNT-Listing-2-/171045207239?pt=US_Action_Figures&hash=item27d316bcc7",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00245-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 423883955,
    "recordOffset": 423841001,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Oct 04, 2014 02:36:05 EDT  Seller assumes all responsibility for this listing. 171045207239 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "This listing is for TATTOO Teenage Mutant Ninja Turtles 100% complete vintage 1991 TMNT (Listing #2) Welcome to one of Seibertron's listings from eBay seller chicagorhinox. This item is in-hand and will ship immediately once payment has been received after the listing has been completed. This item is used. If you have questions or concerns about this listing, please send me a question via eBay so that I may resolve your inquiry correctly. I am not responsible for any assumptions you make about this listing. The item in the photographs below is the actual item you will receive. A black sharpie marker was used to touch up some minor black paint wear on this figure. Please refer to the photographs for additional details about the item included with this listing. Make it yours today! This is an original vintage item. It is not a knock off or a reproduction item. Please refer to the pictures for additional details about this vintage item. Please check out my other listings - I am selling additional Teenage Mutant Ninja Turtles and Transformers items. International Buyers - Please Note: Import duties, taxes, and charges are not included in the item price or shipping cost. These charges are the buyer's responsibility. Please check with your country's customs office to determine what these additional costs will be prior to bidding or buying.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}