{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-11229",
            "1557-AD80",
            "ID OCC-2014-0007"
        ]
    ],
    "pageTitle": "12 CFR 335.612 - Statement of changes in beneficial ownership of securities (Form 4). | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/12/335.612",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00234-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 917765743,
    "recordOffset": 917727140,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1149=Title 12 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{123959=The Department of the Treasury is issuing a revised interim rule implementing the Bank Enterprise Award Program (BEA Program), administered by the Community Development Financial Institutions Fund (CDFI Fund), Department of the Treasury. This revised interim rule reflects requirements set forth in a final rule, published by the Department of the Treasury (Uniform Administrative Requirements, Cost Principles, and Audit Requirements for Federal Awards, December 19, 2014), hereafter referred to as the Uniform Administrative Requirements. The Uniform Administrative Requirements constitute a government-wide framework for grants management codified by the Office of Management and Budget (OMB); they combine several OMB guidance circulars aimed at reducing administrative burden for award Recipients and reducing the risk of waste, fraud and abuse of Federal financial assistance. The Uniform Administrative Requirements establish financial, administrative, procurement, and program management standards with which Federal award-making programs, including those administered by the CDFI Fund, and Recipients must comply. This revised BEA Program interim rule includes revisions necessary to implement the Uniform Administrative Requirements, as well as to make certain technical corrections and other updates to the current rule., 219060=Title 12 published on 2015-01-01, 199660=This final rule modifies the 2013 TILA-RESPA Final Rule. This rule extends the timing requirement for revised disclosures when consumers lock a rate or extend a rate lock after the Loan Estimate is provided and permits certain language related to construction loans for transactions involving new construction on the Loan Estimate. This rule also amends the 2013 Loan Originator Final Rule to provide for placement of the Nationwide Mortgage Licensing System and Registry ID (NMLSR ID) on the integrated disclosures. Additionally, the Bureau is making non-substantive corrections, including citation and cross-reference updates and wording changes for clarification purposes, to various provisions of Regulations X and Z as amended or adopted by the 2013 TILA-RESPA Final Rule., 335947=The NCUA Board (Board) proposes to exclude Central Liquidity Facility (CLF)-related bridge loans (CLF-related bridge loans) from the aggregate unsecured lending cap to one borrower applicable to a corporate credit union (Corporate). Specifically, a CLF-related bridge loan that is exempt from that cap is a bridge loan made by a Corporate to a natural person credit union when the natural person credit union has been approved for a loan by the CLF and is awaiting funding from the CLF. Additionally, the proposal excludes CLF-related bridge loans from the calculation of “net assets” and “net risk weighted assets” for determining minimum capital requirements. This proposal results largely from comments the Board received on the November 2014 proposed rule amending NCUA's Corporate regulations., 133164=The Federal Deposit Insurance Corporation (“FDIC”) published a final rule in the Federal Register on July 21, 2014 (79 FR 42183), regarding Transferred OTS Regulations Regarding Disclosure and Reporting of CRA-Related Agreements. This publication corrects a typographical error which caused the unintended deletion of §§ 346.2 through 346.10., 416724=The NCUA Board (Board) is issuing for public comment this proposed rule (2015 proposal) to amend its regulation governing federal credit union (FCU) ownership of fixed assets. To provide regulatory relief to FCUs, the 2015 proposal eliminates a provision in the current fixed assets rule that established a five percent aggregate limit on investments in fixed assets for FCUs with $1,000,000 or more in assets. It also eliminates the provisions in the current fixed assets rule relating to waivers from the aggregate limit. Further, instead of applying the prescriptive aggregate limit provided by regulation in the current fixed assets rule, the Board proposes to oversee FCU ownership of fixed assets through the supervisory process and guidance. The 2015 proposal also makes conforming amendments to the scope and definitions sections of the current fixed assets rule to reflect this proposed approach, and it amends the title of § 701.36 to more accurately reflect this amended scope and applicability. In addition, the 2015 proposal simplifies the fixed assets rule's partial occupancy requirements for FCU premises acquired for future expansion by establishing a single six-year time period for partial occupancy of such premises and by removing the 30-month requirement for partial occupancy waiver requests. The Board notes that, in July 2014, it issued a proposal regarding the fixed assets rule that addressed, among other things, the partial occupancy provisions of the fixed assets rule (July 2014 proposal), but NCUA did not finalize that proposal. For reasons discussed below, the 2015 proposal incorporates similar partial occupancy proposed amendments from the July 2014 proposal, with one modification to the time period for partial occupancy., 181494=On October 8, 2014, the Federal Housing Finance Agency (FHFA) published a notice of proposed rulemaking in the Federal Register to transfer existing parts of the Federal Housing Finance Board (Finance Board) regulations to the FHFA regulations. These rules address Federal Home Loan Bank (Bank) capital stock and capital plans. FHFA did not propose to make any substantive changes to these requirements, but proposed to delete certain provisions that applied only to the one-time conversion of Bank stock to the new capital structure required by the Gramm-Leach-Bliley Act (GLB Act) and to make certain other clarifying changes. FHFA is now adopting the proposed rule as a final rule without change., 173021=The Federal Housing Finance Agency (FHFA) is issuing a final rule setting forth requirements related to allocations by the Federal National Mortgage Association (Fannie Mae) and the Federal Home Loan Mortgage Corporation (Freddie Mac) (together, the Enterprises) to the Housing Trust and Capital Magnet Funds created by the Housing and Economic Recovery Act of 2008. The rule implements a statutory prohibition against the Enterprises passing the cost of such allocations through to the originators of loans they purchase or securitize, and finalizes and continues an interim final rule FHFA issued on December 16, 2014.}",
    "lastModified": "Sat, 30 May 2015 06:18:41 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 30333 - Organization; Institution Stockholder Voting Procedures 2015-05-28; vol. 80 # 102 - Thursday, May 28, 2015 * Only displaying the most recent 50 entries for Title 12. Please, view a Part for the full list of changes within that Part. For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 12. Title 12 published on 2015-01-01. 75 FR 73950, Nov. 30, 2010] [ 240. 78w) and the rules and regulations thereunder. SEC regulations referenced in this form are codified at 17 CFR part 15 U.S.C. 78p and sections 16(a) and 23(a) of the Exchange Act ( This form shall be filed in lieu of SEC Form 4 pursuant to SEC Rules for statements of changes in beneficial ownership of",
    "textAfterTable": "FARM CREDIT ADMINISTRATION Final rule. Effective Date: The regulation will be effective 30 days after publication in the Federal Register during which either one or both Houses of Congress are in session. We will publish a notice of the effective date in the Federal Register . Compliance Date: All provisions of this regulation require compliance on or before January 1, 2016. 12 CFR Part 611 Summary The Farm Credit Administration (FCA, we, Agency or our) amends FCA's regulations to clarify and enhance Farm Credit System (Farm Credit or System) bank and association stockholder voting procedures for tabulating votes, the use of tellers committees, and other items as identified. 80 FR 30336 - Federal Home Loan Bank Community Support Program—Administrative Amendments GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-12807 RIN 2590-AA38 FEDERAL HOUSING",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}