{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The law enforcement personnel are efficient and well trained. There are little to no safety issues on EGC campus.",
            "I am so involved in my personal education, full time employment, and a child that I do not have time to experience the various clubs and activities that EGC has to offer.",
            "This college is a great starting point for students that plan to continue their education elsewhere. This is a college for students that are serious about their college education and learning.",
            "With East Georgia College, you will all the bang for the buck you have been expecting out of a college experience. The campus in Statesboro utilizes the neighboring Georgia Southern University campus facilities and East Georgia students have all that is available to GSU students.",
            "East Georgia College has various campus locations that include Swainsboro, Statesboro, and Augusta. The campus offers many educational job fairs, chess club, spelling b's, and various community relations that the student may be involved in.",
            "I live off campus.",
            "1.) Acquire good study habits early in your college career. 2.) Assume full responsibility for your grades and take each failure as a chance to do better. 3.) When studying, learn the material as if you are preparing for a pop quiz the following morning. 4.) Attitude is everything. If you think you can do it, you probably can.",
            "The instruction, education, and even friendship that I have acquired within the last year of my college experience has, without a doubt, changed my life for the better. The faculty and staff here at East Georgia College are undeniably knowledgeable on their subject of expertise and overwhelmingly caring for the education and futures of every student. East Georgia College is off the charts on a one to ten ranking system!"
        ]
    ],
    "pageTitle": "East Georgia State College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/East-Georgia-College/reviews?_escaped_fragment_=/show/58044",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00116-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895479011,
    "recordOffset": 895445704,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121465=© 2015, Cappex.com, LLC, 7750=We just got brand spanking new dorms in Fall of 2011, they are simply fantastic! The clubhouse is awesome and the meal plan is worth it!}",
    "textBeforeTable": "08/25/2009 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 2 out of 5 people found this review useful. 1 of 31 Riddhi from Reidsville, GA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID:",
    "textAfterTable": "What to do for fun There are many activities, sports and clubs. Tips for prospective students Be prepared to write top-notch papers. In three sentences East Georgia College is a wonderful school to attend. The professors are outstanding and the work is not over whelming. It is a great place to start college life. Login to rate or flag the reviews Jazzmin from Swainsboro, GA 05/15/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 31 Categories Comments Campus Safety The police on campus are pretty good, and since the campus is small they can get to wherever the problem is rather quickly. Clubs and Activities There is always tons of neat things going on, most involve free food. Great for these types of students This college is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}