{
    "relation": [
        [
            "Constant",
            "alignBounds",
            "alignMargins"
        ],
        [
            "Value",
            "0",
            "1"
        ],
        [
            "Description",
            "Align the bounds of the children. See ALIGN_BOUNDS.",
            "Align the margins of the children. See ALIGN_MARGINS."
        ]
    ],
    "pageTitle": "GridLayout | Android Developers",
    "title": "",
    "url": "http://developer.android.com/reference/android/widget/GridLayout.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00152-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 63426587,
    "recordOffset": 63352512,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Must be one of the following constant values. When set to alignMargins, causes alignment to take place between the outer boundary of a view, as defined by its margins. When set to alignBounds, causes alignment to take place between the edges of the view. The default is alignMargins. See setAlignmentMode(int). android:alignmentMode XML Attributes AccessibilityEvent. Handles the request for sending an AccessibilityEvent event) sendAccessibilityEventUnchecked( abstract void AccessibilityEvent given the event type. Handles the request for sending an sendAccessibilityEvent(int eventType) abstract void From interface android.view.accessibility.AccessibilityEventSource Called when a key up event has occurred. KeyEvent event) onKeyUp(int keyCode, abstract boolean Called when multiple down/up pairs of",
    "textAfterTable": "This corresponds to the global attribute resource symbol alignmentMode. Related Methods setAlignmentMode(int) android:columnCount The maxmimum number of columns to create when automatically positioning children. Must be an integer value, such as \"100\". This may also be a reference to a resource (in the form \"@[package:]type:name\") or theme attribute (in the form \"?[package:][type:]name\") containing a value of this type. This corresponds to the global attribute resource symbol columnCount. Related Methods setColumnCount(int) android:columnOrderPreserved When set to true, forces column boundaries to appear in the same order as column indices. The default is true. See setColumnOrderPreserved(boolean). Must be a boolean value, either \"true\" or \"false\". This may also be a reference to a resource (in the form \"@[package:]type:name\") or theme attribute (in the form \"?[package:][type:]name\") containing a value of this type. This corresponds to the global attribute resource symbol columnOrderPreserved. Related Methods setColumnOrderPreserved(boolean) android:orientation The orientation property is not used during layout. It is only used to allocate row and column parameters when they are not specified by its children's layout paramters. GridLayout works like LinearLayout",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}