{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Campus safety is great there, they have their own police officers and they came to help me when I locked my keys in my car very promptly.",
            "I wish I could have the quality of education of Kent State and the surroundings of Roanoke, but there just isn't an affordable middle without a scholarship.",
            "They have huge computer screens you can plug your laptop into, it would be good for studying or watching movies in your free time. It is also close to downtown Roanoke where there is lots of things to do.",
            "The food is good and the Domino's pizza is delicious!",
            "I don't live on campus.",
            "I want to do well in two out of my three classes because the teachers actually help you out and answer e-mails. My third class is biology 101 and my teacher has never taught before and has not a clue how to do it.",
            "Keep in mind that it is a community college and you will probably get a better education at a four year college than here, but not everything about it is bad.",
            "Virginia Western is a very nice school, but it's staff and teachers are disorganized. I didn't realize how good I had it at Kent State until I realized all the teachers weren't like the ones there. I love the other students there, they are very nice."
        ]
    ],
    "pageTitle": "Virginia Western Community College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Virginia-Western-Community-College/reviews?_escaped_fragment_=/show/85785",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00064-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 887641255,
    "recordOffset": 887602811,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{6587=As a previous student at a State University in NY, I am amazed at the level and quality of education given at Virginia Western Community College. I have been a student here since 2006, recently graduating the health technology/pre nursing curriculum, also enrolled in the human services curriculum, and expecting to begin the surgical technology program here offered through PVCC - so I've had experience with teachers in many areas. Each of my professors, while all unique, have been excellent., 173355=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "10/28/2009 Reviewer is A current student here. 5 out of 5 people found this review useful. 1 of 42 Chelsea from Roanoke, VA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Great for these types of students Young, old, on campus, or distance learning, VWCC caters to all. Tips for prospective students VWCC offers all kinds of clubs. Whatever you're into there's bound to be something to add to your enjoyment of being a student here. Bang for the buck From quality to services offered to class size, it can't be beat! Am enjoying being here VWCC offers a beautiful campus that has recently been renovated with it's students in mind. Lounge and study areas, WiFi, and it's modern appointments make it a pleasure to be on campus. Am learning a lot As a previous student at a State University in NY, I am amazed at the level and quality of education given at Virginia Western Community College. I have been a student here since 2006, recently graduating the health technology/pre nursing curriculum, also enrolled in the human services curriculum, and expecting to begin the surgical technology program here offered through PVCC - so I've had experience with teachers in many areas. Each of my professors, while all unique, have been excellent. Login to rate or",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}