{
    "relation": [
        [
            "First Party Legal Entity",
            "EMEA LE",
            "GB LE",
            "FR LE",
            "DE LE",
            "APAC LE",
            "AU LE",
            "SI LE",
            "NZ LE",
            "NAM LE",
            "US LE",
            "CA LE"
        ],
        [
            "Country",
            "UK",
            "UK",
            "FR",
            "DE",
            "AU",
            "AU",
            "SI",
            "NZ",
            "US",
            "US",
            "CA"
        ]
    ],
    "pageTitle": "Oracle Fusion Applications Project Management Implementation Guide",
    "title": "",
    "url": "http://docs.oracle.com/cd/E25054_01/fusionapps.1111/e20384/F552253AN34A05.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00084-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75388239,
    "recordOffset": 75193124,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{691741=1-Jan-1951, 832279=1000 USD, 574061=Invoice line 1 amount: 1333 USD, 570464=2567, 761407=1-Jan-1970, 832320=1000 USD * 10/100, 832216=1100 USD, 59458=Legal justification tax reporting types are introduced as a feature to support European Union (EU) value-added tax (VAT) changes for the year 2010. The changes are introduced to modernize and simplify rules relating to cross-border supply of services and recovery of input tax. These are the most far-reaching changes to VAT law since the introduction of the Single European Market in 1993. This impacts all businesses, which supply and purchase services across EU countries. Companies must rethink their service flow, as well as, their compliance and reporting obligations., 570304=173.2725, 574009=Invoice line 2 amount: 1679 USD, 571034=1679, 354335=Line amount: 1000 CAD, 833181=The following table illustrates the calculation methodology used with each of these options when a transaction line amount is 1000 USD and the applicable tax rate is 10% of the taxable basis amount, for example, line amount:, 58874=The new rule for place of supply of services, for tax determination in a business-to-business transaction, is where the customer is established and not where the supplier is established, as is the case before January 1, 2010. Therefore, if services are supplied in another EU member state, they are taxable in the recipient's country. For business-to-customer supply of services, the general rule for place of supply continues to be the place where the supplier is established. There are exceptions to the new rule for certain types of services. Examples include: services provided for immovable property, passenger transport services, cultural, and educational events. It also includes ancillary services, short term hiring of means of transport, and restaurant and catering services carried out on board a ship, aircraft, or train within the EU., 571610=1333, 573957=Invoice line 3 amount: 2567 USD, 356121=The taxable basis for the county tax is equal to the line amount plus the base rate modifier less the cash discount at 2% plus the state tax (1000 USD + 500 USD - 20 USD + 200 USD = 1680 USD)., 832097=1000 USD * 10/110, 857845=ABC Corporation is a business with a chain of bookstores across Canada. It intends to implement the Oracle Fusion Tax solution at its store in the province of Alberta. The GST rate of 5% is applicable for sales in Alberta. Input Tax Credit is available for GST included in purchases. ABC Corporation's primary ledger is CA Ledger, and the business unit is CA Operations. The tax account 0001-1500-1100-1000 is reserved for the Tax Recoverable or Liability account., 661460=2003 SIC, 728561=The end date is defined as the last date that the object can be active. The object is end dated one second after the date specified by the value of End Date, that is the next day at 12:00:01 a.m. You cannot set the end date in the past. Also, you can change the end date from a condition when the object is ended to a new end date greater than or equal to the system date, causing the object to go from inactive to active. The end date value is optional during catalog or category creation., 356251=The state tax is equal to the invoice line amount multiplied by the state tax rate (1000 USD * 20% = 200 USD)., 357456=Invoice line amount: 1000 USD, 352904=The county tax is equal to the invoice line amount multiplied by the county tax rate plus the state tax ((1000 USD * 10%) + 200 USD = 300 USD)., 656465=The supply of widgets by Widget Inc., UK Ltd. is within the terms and conditions of supplies to NATO forces which allows a supplier to zero rate supplies to visiting NATO forces. See Visiting Forces - HMRC Reference: Notice 431 (November 2003)., 353313=Line amount: 1000 USD, 355922=The country tax is equal to the taxable basis multiplied by the county tax rate (1680 USD * 10% = 168 USD)., 357989=Consider a sales transaction between two companies, A and B. The item value on the invoice is 1000 USD. However, if they are related companies, that is, within the same group, the tax authority has the discretion to mark the item value as 5000 USD for the purpose of tax based on the average market price. The tax authority can choose to collect the tax based on that value instead of the actual sales value of 1000 USD., 690796=Enter the values as shown in the above table. By default, the start date is the start date of the sales transaction parent record, that is, 1-Jan-1951.}",
    "lastModified": "Thu, 20 Sep 2012 18:00:29 GMT",
    "textBeforeTable": "The legal entities for: To create the appropriate tax configurations, you must set up the following: Prerequisites Create tax regimes for each country and the appropriate tax configuration options. Sales, marketing, and manufacturing organization has a first party legal entity and business unit. Countries which have the regional corporate centers have a first party legal entity and business unit for each corporate center. Each country has a single first party legal entity with a single business unit, except for: Europe, Middle East, and Africa (EMEA), based in London, UK Asian and Pacific (APAC), based in Melbourne, Australia North America (NAM), based in Redwood City, California, US Your company has their regional centers in: This example demonstrates how you set up the appropriate tax configuration options for your company that has three regional centers. These centers are responsible for tax setup and maintenance among other corporate activities. Each of these regional corporate centers is associated with a first party legal entity and business unit. Setting Up Tax Configuration Options: Worked Example The tax determination process uses only the tax exceptions owned by the specific first party organization Party-specific configuration The tax determination process uses only the tax exceptions defined and maintained by the global configuration owner. Common configuration Tax Exceptions Available Configuration",
    "textAfterTable": "The sales, marketing, and manufacturing organization's business unit uses the tax configuration of the legal entity. The relevant tax regimes for each country's tax include: Region Country Tax Regime Tax EMEA United Kingdom GB VAT GB VAT EMEA France FR VAT FR VAT EMEA Germany DE VAT DE VAT APAC Australia AU GST AU GST APAC Singapore SI VAT SI VAT APAC New Zealand NZ VAT NZ VAT NAM United States US SALES TAX US STATE SALES TAX US COUNTY SALES TAX US CITY SALES TAX NAM Canada CA HST & GST CA HST CA GST Setting Up Tax Configuration Options",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}