{
    "relation": [
        [
            "First Name",
            "Mike",
            "Anthony",
            "Lorna",
            "Anne"
        ],
        [
            "Last Name",
            "Eckard",
            "Alexander",
            "Wisham",
            "Grealy"
        ],
        [
            "Suffix",
            "",
            "Jr.",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=485F09F1-FF4F-43CB-9540-B0FDF286F65C&filingTypeID=69",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 227004819,
    "recordOffset": 226996617,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22331=S. 21, \"Cyber Security and American Cyber Competitiveness Act\"; H.R. 174, \"Homeland Security Cyber and Physical Infrastructure Protection Act\"; H.R. 668, \"SHIELD Act\"; \"Guarantee Reliability and Infrastructure Defense (GRID) Act\" - House draft; S. 1342, \"Gride Cyber Security Act\";, 35302=Coal Ash - combustion residuals issues generally; EPA's proposed Coal Combustion Residuals Rul and related legislative proposals; H.R. 1391, \"Recycling Coal Combustion Residuals Accessibility Act\", prohibits EPA from regulating coal ash under Subtitle C of RCRA; H.R. 2273, \"Coal Residuals Reuse and Management Act\", regulates coal ash under existing municipal solid waste landfill regulations;, 39545=Over-The-Counter derivatives issues generally; H.R. 1573, \"To facilitate implementation of Title VII of Dodd-Frank Wall Street & Consumer Protection Act\", to delay by 18 months implementation of Title VII of Dodd-Frank, (Over-the-Counter derivatives); H.R. 1840, to improve consideration by the Commodity Futures Trading Commission of the costs and benefits of its regulations and orders; H.R. 2682, \"Business Risk Mitigation and Price Stabilization Act of 2011\" (Over-the-Counter derivatives);, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 12229=H.R. 10, the \"regulations from the Executive in Need of Scrutiny (REINS) Act of 2011\", (as it relates to EPA regulations); H.R. 1872, the \"Employment Protection Act\" to require EPA to consider employment and other economic impacts prior to regulations or other actions; H.R. 2891, \"America's Energy Independence Act\", to delay EPA Cross-State Air Pollution Rule; S.J. Res. 27, disapproving the EPA Cross-State Air Pollution Rule; S. 609, the \"Comprehensive Assessment of Regulations on the Economy (CARE) Act of 2011\", (to provide for the establishment of a committee to assess the effects of certain federal regulatory mandates related to energy and the environment); Clean Water Act, Section 316(b) - cooling water intace structure rule-making; H.R. 1705, the \"Transparency in Regulatory Analysis of Impacts on the Nation (TRAIN) Act of 2011\", to require analyses of the cumulative and incremental impacts of certain rules, (energy, CES, NSR);, 43853=H.R. 2584, \"Department of the Interior, Environment, and Related Agencies Appropriations Act, 2012\" (coal ash); H.R. 2354, \"Energy and Water development and Related Agencies Appropriations Act of 2012\" (efficiency, electric transportation); S. 1599, \"Departments of Labor, Health and Human Services, and Education, and Related Agencies Appropriations Act, 2012\" (Low Income Home Energy Assistance Program); H.R. 2608, \"Continuing Appropriations Act, 2012\"; FY 2012 Budget Resolution;, 17058=H.R. 909, the \"A Roadmap for America's Energy Future\", (to address domestic energy policy, including renewable energy); S. 4, the \"Make America the World's Leader in Clean Energy Act\", (to promote clean energy); S. 559, the \"Securing American's Future with Energy and Sustainable Technologies Act\", (including renewable electricity and energy efficiency resource standards); Energy Policy Act of 2005 implementation including infrastructure; Implementation of \"Energy Independence and Security Act of 2007\"; Clean energy standard legislation generally; Clean energy standard legislation generally; S. 741, to amend PURPA to establish a renewable energy standard; S. 1000, \"Energy Savings and Industrial Competitiveness Act of 2011\", (efficiency); S. 1321, the \"Practical Energy Plan Act of 2011\";}",
    "textBeforeTable": "",
    "textAfterTable": "3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  Carrie Dunn  3303845596  cordead@firstenergycorp.com 5. Senate ID#  43764-12 7. Client Name Self Check if client is a state or local government or instrumentality  FIRSTENERGY CORP 6. House ID#  312290000",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}