{
    "relation": [
        [
            "Play Type",
            "Substitution",
            "Single",
            "Out",
            "Out",
            "Out"
        ],
        [
            "Play",
            "Russ Ortiz starts the inning for the Astros, batting 8th.",
            "Omar Quintanilla singled to center. Runner on first with none out and Paul Phillips due up.",
            "Paul Phillips sacrifice bunt to first. Runner on second with one out and Ian Stewart due up.",
            "Ian Stewart struck out swinging. Runner on second with two outs and Dexter Fowler due up.",
            "Dexter Fowler grounded out second to first to end the inning."
        ]
    ],
    "pageTitle": "Tuesday, June 2, 2009 Interleague Game: Colorado Rockies - Houston Astros Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Rockies_Astros/2009/06/02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 55644431,
    "recordOffset": 55628489,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2354=View all MLB box scores for 6/2/2009}",
    "TableContextTimeStampAfterTable": "{43798=Bourn's speed equated to a run in the bottom of the fifth. Bourn legged out a double just in front of the throw with two outs and Tejada's single off the glove of shortstop Omar Quintanilla and into center field allowed the fleet- footed outfielder to score for a 2-1 game.}",
    "textBeforeTable": "Top of the 1st Randy Marsh  3B Lance Barksdale  2B James Hoye  1B Marvin Hudson  H Umpires 4.73 9 15 1 0 0 0 1 1 Russ Ortiz (W, 3-2) 2.38 10 20 1 1 0 0 0 1 LaTroy Hawkins  3.97 15 27 2 2 0 0 0 1 Alberto Arias  3.32 7 14 0 1 0 0 0 1 Tim Byrdak  3.60 17 27 1 0 0 0 2 1 Jeff Fulchino  6.21 55 87 7 1 2 2 5 6 Felipe Paulino  ERA Strikes Pitches SO BB ER R H IP Name 1.35 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Astros pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/astros_22t.png 12 20 1 0 1 1 1 1.1 Josh Fogg (L, 0-1) 3.22 10 23 0 2 0 1 2 1 Huston Street (BS, 1) 6.08 15 22 3 0 0 0 2 1 Manuel Corpas (H, 3) 2.84 6 8 1 0 0 0 0 0.2 Joel Peralta (H, 1) 0.00 1 2 0 0 0 0 0 0.1 Randy Flores (H, 3) 4.11 71 113 4 4 1 1 7 6 Ubaldo Jimenez  ERA Strikes Pitches SO BB ER R H IP",
    "textAfterTable": "Single Michael Bourn singled to left. Runner on first with none out and Miguel Tejada due up. Out Miguel Tejada flied out to center. Runner on first with one out and Hunter Pence due up. Out Hunter Pence lined out to center. Runner on first with two outs and Carlos Lee due up. Stolen-base Michael Bourn stole second. Runner on second with two outs and Carlos Lee at the plate. Out Carlos Lee grounded out pitcher to first to end the inning. Top of the 2nd Play Type Play Out Brad Hawpe grounded out second to first. None on with one out and Garrett Atkins due up. Out Garrett Atkins grounded out pitcher to first. None on with two outs and Seth Smith due up. Out Seth Smith grounded out first to pitcher to end the inning. Bottom of the 2nd Play Type Play Out Lance Berkman grounded out second to first. None on with one out and Geoff Blum due up. Walk Geoff Blum walked. Runner on first with one out and Edwin Maysonet due up. Single Edwin Maysonet singled to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}