{
    "relation": [
        [
            "Day",
            "Mon",
            "Tue",
            "Wed",
            "Thu",
            "Fri",
            "Sat",
            "Sun"
        ],
        [
            "Drink Special",
            "$4 BBK drafts $6 pink/blue lemonades $5 vodka cocktails",
            "$4 Hook & Ladder drafts $5 martinis $5 vodka Red Bulls $5 cherry or grape bombs",
            "Half-price wine bottles $4 Fat Tire on tap $10 mini Korbel buckets",
            "$4 Sam Adams drafts $5 cherry or grape bombs $5 Sangria",
            "$4 Goose Island drafts $6 vodka cocktails $13 24-oz cocktails",
            "$3.50 Miller Lite bottles $5.50 Tito Vodka cocktails $8 Miller Lite pitchers",
            "$3.50 Coors Light bottles $3.50 Shiner Bock $8 Coors Light pitchers $6 White Trash Mimosas"
        ],
        [
            "Food Special",
            "$2 burgers & fries",
            "$0.30 chicken wings",
            "$9.95 Pasta Night",
            "$9.95 full rack of ribs $6.95 half rack of ribs (both include fries)",
            "$0.30 chicken wings",
            "$9.95 New York Strip (with choice of potato)",
            "$13.95 all-you-can-eat buffet $9.95 prime rib & potato"
        ]
    ],
    "pageTitle": "O'Donovan's: Chicago Bar Project",
    "title": "",
    "url": "http://www.chibarproject.com/Reviews/O'Donovan's/O'Donovan's.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 373294588,
    "recordOffset": 373278637,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{11432=O'Donovan's 2100 W. Irving Park Rd. (4000N, 2100W) Chicago, IL 60613 (773) 478-2100}",
    "TableContextTimeStampAfterTable": "{3313=Just beyond the end of the bar is a short hallway that leads to the beer garden. This area was recently created out of half of the parking lot next door. The garden offers patrons a canopy from the sun, a few televisions under the canopy, green and white string lights, an excellent view of the recently beautified Irving Park Road, and wrought-iron railings separate your burger from the masses. There is also sidewalk café seating on the east side of the building, surrounding a large tree adorned with a string of green lights. It was here that I once met up with one of the strangest pub crawls I've encountered yet: \"Sweatfest\" in which participants wore sweatshirts and sweatpants in August. From O'Donovan's, the crawl moved on to Resi's, and the now defunct Benedict's and Grizzly's Lodge. Strange indeed., 4339=While O'Donovan's is a great neighborhood bar, it was very sad to see its predecessor go. Schulien's, as it was known, had operated for over 110 years (by running a speakeasy in the basement during Prohibition) and became famous for its house magician, \"Heba Haba Al,\" who did magic tricks at your table while you ate. Fortunately, O'Donovan's has kept the tradition of magic performed at your table alive with the \"mystifying magic act\" of Al James, who has been seen on network television. Al was there at the O'Donovan's opening to do his drive-around-the-block-blindfolded trick. James also once replicated Harry Houdini's \"milk can\" escape in the O'Donovan's parking lot (prior to the beer garden), and in 1980, helped catch the \"Plumber Rapist\" by hypnotizing two policemen who thought they'd stopped the criminal but lost their notes and couldn't remember his name or license-plate number.}",
    "lastModified": "Mon, 15 Nov 2010 20:29:53 GMT",
    "textBeforeTable": "\"A North Center favorite for good times\" O'Donovan's 2100 W. Irving Park Rd. (4000N, 2100W) Chicago, IL 60613 (773) 478-2100 Written by Sean Parnell   © The Chicago Bar Project  ",
    "textAfterTable": "O'Donovan's Restaurant & Bar opened at the start of a wave of Irish-themed pub openings in Chicago, which consists of a different place opening each week. At face value, this puts O'Donovan's in competition with the likes of Celtic Crown, Johnny O'Hagan's, The Kerryman, and the Pepper Canister, for a share of the lucrative yuppie-Guinness crowd. However, O'Donovan's has a leg up on many of its American-Irish brethren with its long history, relaxed beer garden, a diverse menu, a classic Chicago theme, and magic tricks performed at your table. Overall, O'Donovan's is one of the best neighborhood hangouts on the North Side, joining a league of bars that includes Gannon's Pub, Jake's Pub, and the Village Tap. For now, the place is not yet overrun with anything but a cool, mellow crowd. O'Donovan's is located within spitting distance of the neighborhood German classics, Laschet's Inn across the street and Resi's Bierstube a few doors down to the east. Although under relatively new ownership, O'Donovan's façade resembles that of some of the other old standbys in the neighborhood like the Windy City Inn \u0096 it leaves something to be desired with its 1950's-style stone slabs, brown wood and green awning. However, the nicely crafted, \"O'Donovan's\" wooden sign",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}