{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-21637",
            "",
            "FR-5778-C-02"
        ]
    ],
    "pageTitle": "24 CFR Part 5, Subpart C - Pet Ownership for the Elderly or Persons With Disabilities | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/24/part-5/subpart-C",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00140-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 910890271,
    "recordOffset": 910866292,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1123=Title 24 published on 2014-04-01.}",
    "TableContextTimeStampAfterTable": "{74458=This proposed rule would revise HUD's public housing agency (PHA) consortium regulations. These regulations provide the procedures by which PHAs may choose to administer their public housing and Section 8 programs. The changes proposed are intended to increase administrative efficiencies associated with forming a consortium and to help ensure maximum family choice in locating suitable housing. The proposed rule focuses mainly on establishing a new category of consortia for administration of the Section 8 Housing Choice Voucher (HCV) program. This type of consortium would be comprised of multiple PHAs that would become a single PHA, with a single jurisdiction and a single set of reporting and audit requirements, for purposes of administering the Section 8 HCV program. This type of consortium would be in addition to the consortium structure established in current consortium regulations which the Department is referring to as multiple-ACC consortium in this proposed rule. The proposed rule would also revise the categories of Section 8 programs eligible to be administered under a consortium, and establish new requirements regarding the timeframes for the establishment and dissolution of a consortium. Further, HUD has taken the opportunity afforded by this proposed rule to make several technical, nonsubstantive changes to improve the clarity and organization of the consortia regulations. HUD has also taken the opportunity afforded by this proposed rule to amend the definition of “public housing agency” to be consistent with amendments to the United States Housing Act of 1937 (1937 Act), as provided for in the Consolidated Appropriations Act of 2014., 31520=§ 11902 - Authority to make grants, 30936=42 U.S. Code § 1601, 1602 - Transferred, 43039=On July 19, 2013, HUD published a proposed rule on Affirmatively Furthering Fair Housing. The comment period for the proposed rule closed on September 17, 2013. HUD received over 1,000 public comments in response to the proposed rule. While many commenters expressed outright support for HUD's proposal, and other commenters expressed outright opposition, the majority of the commenters provided valuable feedback and suggestions on HUD's proposal. One area of concern expressed by many commenters was the ability of program participants, those that are small or those that receive small grants or allocations of HUD funds, to prepare and submit the Assessment of Fair Housing (AFH) in accordance with the process set out in HUD's proposed rule, and by the proposed submission deadline. Commenters comprised of State jurisdictions or their representatives also expressed concern about the ability to complete an AFH, which they commented did not take into consideration the unique role of States. These commenters stated that HUD's proposed AFH was tailored to entitlement jurisdictions. In response to these comments, HUD is considering providing certain HUD program participants—States, Insular Areas, qualified PHAs, jurisdictions receiving a small Community Development Block (CDBG) grant (which is based on a percentage of the CDBG formula appropriation, as described in this notice)—with the option of submitting their first AFH at a date later than would otherwise be required for program participants that are not States or Insular Areas, not qualified PHAs, and are not grantees receiving a small CDBG grant, as proposed to be defined in this notice. This supplemental notice of proposed rulemaking therefore re-opens the public comment period on the Affirmatively Furthering Fair Housing proposed rule for an additional 30 days solely to seek comment on these specific issues. HUD is not soliciting comment on any other issues related to HUD's July 19, 2013, proposed rule., 37689=This proposed rule would amend HUD's regulations to fully implement the requirements of the Violence Against Women Act (VAWA) as reauthorized in 2013 under the Violence Against Women Reauthorization Act of 2013 (VAWA 2013). VAWA 2013 provides enhanced statutory protections for victims of domestic violence, dating violence, sexual assault, and stalking. VAWA 2013 also expands VAWA protections to HUD programs beyond HUD's public housing and Section 8 programs, which were covered by the reauthorization of VAWA in 2005 (VAWA 2005). In addition to proposing regulatory amendments to fully implement VAWA 2013, HUD is also publishing for public comment two documents concerning tenant protections required by VAWA 2013—a notice of occupancy rights and an emergency transfer plan. Although VAWA refers to women in its title, the statute makes clear that the protections are for all victims of domestic violence, dating violence, sexual assault, and stalking, regardless of sex, gender identity, sexual orientation, or age., 32042=§ 11907 - Monitoring, 22784=Section 243 of the Department of Housing and Urban Development Appropriations Act, 2014 (2014 Appropriations Act) authorizes HUD to implement certain statutory changes to the United States Housing Act of 1937 made by the 2014 Appropriations Act through notice followed by notice and comment rulemaking. This notice establishes the terms and conditions by which HUD will implement changes to the statutory definition of a “public housing agency” (PHA), the frequency of housing inspections, the statutory definition of “extremely low-income,” and utility allowances for tenant-paid utilities., 32229=§ 11909 - Repealed., 49353=Section 243 of the Department of Housing and Urban Development Appropriations Act, 2014 (2014 Appropriations Act), authorized HUD to implement certain statutory changes to the United States Housing Act of 1937 (1937 Act) made by the 2014 Appropriations Act through notice, followed by notice and comment rulemaking. Notices implementing the changes were published on May 19, 2014, and June 25, 2014. Consistent with statutory direction, this proposed rule commences the rulemaking process to codify in regulation the statutory changes made to the 1937 Act by the 2014 Appropriations Act and to solicit comment on HUD's implementation of these changes through the published notices. HUD intends to address the FY14 provision on consortia through separate rulemaking. In addition, this rulemaking also proposes changes to streamline regulatory requirements pertaining to certain elements of the Housing Choice Voucher (HCV), Public Housing (PH), and various multifamily housing (MFH) rental assistance programs; to reduce the administrative burden on public housing agencies (PHAs) and MFH owners; and to align, where feasible, requirements across programs. One of the proposed changes would also affect the HOME Investment Partnerships program, Continuum of Care program, and the Housing Opportunities for Persons With AIDS (HOPWA) program which are administered by HUD's Office of Community Planning and Development., 3122=On September 16, 2014, HUD published an interim rule that revised the financial reporting deadlines for operators participating in FHA's program for insurance of health care facilities under section 232 of the National Housing Act (Section 232 program) to bring them in-line with the reporting periods prescribed in HUD's Uniform Financial Reporting Standards, to which owners and borrowers participating in the Section 232 program are subject. HUD received no public comments in response to its solicitation of comment in the September 16, 2014, rule, and is therefore adopting the interim rule without change., 31617=§ 11903 - Eligible activities, 31962=§ 11906 - Reports, 17953=On June, 25, 2014, HUD published a document implementing statutory changes made by the Department of Housing and Urban Development Appropriations Act, 2014 to certain programs administered by HUD's Office of Housing and HUD's Office of Public and Indian Housing. In the discussion of implementation of the new definition of “extremely low-income” applicable to multifamily projects administered by HUD's Office of Housing, the document referred to “contract administrators” and it should have referenced “owners.” This document makes that correction., 31793=§ 11904 - Applications, 31878=§ 11905 - Definitions, 12822=Through a final rule published on September 7, 2012, HUD revised the regulations for FHA's program for insurance of health care facilities under section 232 of the National Housing Act (Section 232 program). In the September 7, 2012, final rule, HUD retained the longstanding requirement that owners and borrowers participating in the Section 232 program submit audited financial statements to HUD, and added the requirement that operators of Section 232 facilities also submit financial statements to HUD on a quarterly and annual basis. However, the September 7, 2012, rule placed operators on a different submission deadline than that required of owners. This interim rule revises the financial reporting deadlines for operators to bring them in-line with the reporting periods prescribed in HUD's Uniform Financial Reporting Standards, to which owners and borrowers are subject., 32574=119 Stat. 2936, 33546=Title 24 published on 2014-04-01, 27134=HERA, enacted into law on July 30, 2008, made comprehensive and significant reforms to several HUD programs, including HUD's Public Housing, Section 8 Tenant-Based Voucher, and Project-Based Voucher programs. On November 24, 2008, HUD published a notice that provided information about the applicability of certain HERA provisions to these programs. The notice identified: those statutory provisions that are self-executing and required no action on the part of HUD for the program changes made by HERA to be implemented; and those statutory provisions that require new regulations or regulatory changes by HUD for the HERA provisions to be implemented. The notice also offered the opportunity for public comment on the guidance provided. HUD followed the November 2008 notice with a May 15, 2012, rule that proposed to establish, in regulation, the reforms made by HERA solely to the Section 8 Tenant-Based Voucher and Project-Based Voucher programs as discussed in the November 2008 notice, to make other related changes to the regulations, and to further solicit public comment. This final rule conforms the regulations of the Section 8 Tenant-Based Voucher and Project-Based Voucher programs to the statutory program changes made by HERA, makes other related changes to these regulations as discussed in the May 2012 proposed rule, and makes further changes to the two voucher program regulations as a result of issues raised by public comment or as a result of further consideration by HUD of issues pertaining to these programs., 7992=On September 16, 2014, HUD published an interim rule that revised the financial reporting deadlines for operators participating in FHA's program for insurance of health care facilities under section 232 of the National Housing Act (Section 232 program) to bring the operators in-line with the reporting periods prescribed in HUD's Uniform Financial Reporting Standards. In accordance with HUD's regulations implementing its Uniform Financial Reporting Standards, HUD is providing notice that it has issued guidance on the manner in which the reports by operators are to be submitted to HUD., 32125=§ 11908 - Authorization of appropriations, 31425=§ 11901 - Congressional findings}",
    "lastModified": "Mon, 01 Jun 2015 12:27:51 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 79 FR 74612 - Federal Housing Administration (FHA): Section 232 Healthcare Facility Insurance Program—Aligning Operator Financial Reports With HUD's Uniform Financial Reporting Standards 2014-12-16; vol. 79 # 241 - Tuesday, December 16, 2014 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 24. Title 24 published on 2014-04-01. 3535(d)42 U.S.C. 1701r-1 § 5.380 — Public housing programs: Procedure for development of pet rules. Pet Ownership Requirements for Public Housing Programs § 5.363 — Housing programs: Protection of the pet. § 5.360 — Housing programs: Additional lease provisions. . and Authority:",
    "textAfterTable": "DEPARTMENT OF HOUSING AND URBAN DEVELOPMENT, HUD, Office of the Assistant Secretary for Housing—Federal Housing Commissioner Final rule. Effective date: January 15, 2015. 24 CFR Parts 5 and 232 Summary On September 16, 2014, HUD published an interim rule that revised the financial reporting deadlines for operators participating in FHA's program for insurance of health care facilities under section 232 of the National Housing Act (Section 232 program) to bring them in-line with the reporting periods prescribed in HUD's Uniform Financial Reporting Standards, to which owners and borrowers participating in the Section 232 program are subject. HUD received no public comments in response to its solicitation of comment in the September 16, 2014, rule, and is therefore adopting the interim rule without change. 2014-10-03; vol. 79 # 192 - Friday, October 3, 2014 79 FR 59646 - Federal Housing Administration (FHA): Section 232 Healthcare Facility Insurance Program—Submission of Operator Financial Reports in Accordance With HUD's Uniform Financial Reporting Standards: Commencement of Compliance GPO FDSys XML |",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}