{
    "relation": [
        [
            "",
            "MK-0518 400 mg b.i.d.",
            "Efavirenz 600 mg q.h.s."
        ],
        [
            "Description",
            "MK-0518 400 mg, which can be taken by mouth (PO) twice a day (b.i.d.) without regard to food, and placebo to efavirenz, which will be taken PO at bedtime (q.h.s.) on an empty stomach preferably at bedtime. All participants will take one tablet of TRUVADA® (200 mg of emtricitabine and 300 mg of tenofovir disoproxil fumarate) with food, daily with the morning dose of MK-0518. Dosing interval adjustment of TRUVADA® is recommended in all participants with creatinine clearance 30-49 mL/min.",
            "Efavirenz 600 mg, which will be taken by mouth (PO) at bedtime (q.h.s.) on an empty stomach preferably at bedtime, and placebo to MK-0518, which will be taken PO twice a day (b.i.d.) without regard to food. All participants will take one tablet of TRUVADA® with food, daily with the morning dose of placebo. Dosing interval adjustment of TRUVADA® is recommended in all participants with creatinine clearance 30-49 mL/min."
        ]
    ],
    "pageTitle": "A Study to Evaluate the Safety and Antiretroviral Activity of MK-0518 Versus Efavirenz in Treatment Naive HIV-Infected Patients, Each in Combination With TRUVADA (0518-021 EXT) - Study Results - ClinicalTrials.gov",
    "title": "",
    "url": "https://clinicaltrials.gov/ct2/show/results/NCT00369941?sect=Xl015&view=results",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 865189199,
    "recordOffset": 865175425,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{2349=Primary therapy period: 14-Sep-2006 to 06-May-2009}",
    "textBeforeTable": "Reporting Groups No text entered. Significant events and approaches for the overall study following participant enrollment, but prior to group assignment Pre-Assignment Details Primary therapy period: 14-Sep-2006 to 06-May-2009 Multicenter (67) in the United States (18) and Ex-US (49) Key information relevant to the recruitment process for the overall study, such as dates of the recruitment period and locations Recruitment Details   Hide Participant Flow   Participant Flow Drug: MK-0518 Drug: Comparator: efavirenz Drug: Comparator: Truvada Drug: Comparator: Placebo to MK-0518 Drug: Comparator: Placebo to efavirenz Interventions: HIV Infections Condition: Allocation: Randomized;   Endpoint Classification: Safety/Efficacy Study;   Intervention Model: Parallel Assignment;   Masking: Double Blind (Subject, Investigator);   Primary Purpose: Treatment Study Design: Interventional Study",
    "textAfterTable": "Participant Flow:   Overall Study     MK-0518 400 mg b.i.d.     Efavirenz 600 mg q.h.s.   STARTED     282     284   Treated     281     282   COMPLETED     210     184   NOT COMPLETED     72     100   Never Treated                 1                 2   Adverse Event                 14                 28  ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}