{
    "relation": [
        [
            "Patent application number",
            "20090202339",
            "20110103971"
        ],
        [
            "Description",
            "PLATFORM COOLING STRUCTURE FOR GAS TURBINE MOVING BLADE - A platform cooling structure for a gas turbine moving blade is provided which is capable of improving cooling performance of a platform and of improving reliability of a moving blade in such a manner that a portion in the vicinity of a side edge of the platform which is away from moving blade cooling passageways and is easily influenced by thermal stress caused by high-temperature combustion gas, that is, an upper surface of the side edge is effectively cooled by guiding high-pressure cooling air, flowing to the moving blade cooling passageways, to a discharge opening formed in a surface of the platform in the vicinity of the side edge of the platform without particularly attaching an additional member such as a cover plate to the platform. A moving blade cooling passageway",
            "TURBINE BLADE - The amount of cooling air (cooling medium) can be reduced, and low-temperature cooling air is prevented from being blown out through film cooling holes. Part of a cooling medium impingement-cooling an inner circumferential surface of a blade main body located on a ventral side further impingement-cools the inner circumferential surface of the blade main body located on a dorsal side and is blown out through film cooling holes in the blade main body that are located on the dorsal side."
        ],
        [
            "Published",
            "08-13-2009",
            "05-05-2011"
        ]
    ],
    "pageTitle": "Masamitsu - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/masamitsu-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00333-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 439528999,
    "recordOffset": 439507143,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Masamitsu Kuwabara, Hyogo JP 02-18-2010 HEADLAMP-EQUIPPED MODEL AND HEADLAMP LIGHT-GUIDING MECHANISM THEREOF - A new model representation technique is provided, providing a realistic feeling to the color tone at the time of lights-out as that of the actual one, while keeping lighting properties of a headlamp-equipped model. 20100041308 Published Description Patent application number Masamitsu Kumegawa, Tokyo JP 06-20-2013 MOLDED FOAM - A molded foam is provided in which even when a force in a sliding direction is applied to another member in contact with its surface, the occurrence of a shift in position relative to the other member can effectively be prevented and the occurrence of unusual noise due to rubbing between its surface and the other member can effectively be prevented. The molded foam is formed by heating expandable resin particles filled into a foaming mold. The molded foam has a plurality of first ridges arranged in one direction and a plurality of second ridges arranged in another direction and disposed so as to intersect the first ridges, the first and second ridges being provided on the surface of the molded foam. 20130157014 Published Description Patent application number Masamitsu Kondo, Tenri-Shi JP 01-16-2014 ROTARY DAMPER - A rotary damper 20140014449 Published Description Patent application number Masamitsu Kojima, Ashikaga-Shi JP 04-16-2015 IMAGE",
    "textAfterTable": "Patent applications by Masamitsu Kuwabara, Hyogo JP Masamitsu Matsui, Chiba JP Patent application number Description Published 20100105838 MATERIAL FOR MD SHRINK AND MD SHRINK FILM - Provided are a material for an MD shrink film with good shrinking performance and thickness accuracy, and a film formed with the material. 04-29-2010 Masamitsu Matsuura, Beppu JP Patent application number Description Published 20150147845 DUAL SIDED EMBEDDED DIE AND FABRICATION OF SAME BACKGROUND - Embodiments of the invention provide a method for forming a dual sided embedded die system. The method begins with starting material including a top surface and a bottom surface, a plurality of vias, a plurality of plated metal posts, die pads, and stiffeners. The surface are planarized to expose the included metal which is than selectively etching from die attach pad DAP areas to form cavities. Create a stiffener by using photo resist patterning and plating. Apply tacky tape. Attach a die. Laminate and grind. Remove tacky tape. Form redistribution layers RDLs and a solder mask. Mounting Surface Mount Devices. 05-28-2015 Masamitsu Miyake, Hiroshima JP Patent application number Description Published",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}