{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Item",
            "Sequence No.",
            "FAC",
            "FAR Case",
            "Docket No."
        ],
        [
            "regulations.gov",
            "C1-2014-29137",
            "9000-AM82",
            "I",
            "1",
            "2005-79",
            "2015-003",
            "2014-0050"
        ]
    ],
    "pageTitle": "48 CFR Part 52 - SOLICITATION PROVISIONS AND CONTRACT CLAUSES | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/48/part-52?qt-cfr_tabs=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911806615,
    "recordOffset": 911777499,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1068=Title 48 published on 2014-10-01.}",
    "TableContextTimeStampAfterTable": "{108623=§ 2306 - Kinds of contracts, 49556=DoD, GSA, and NASA are issuing a final rule amending the Federal Acquisition Regulation (FAR) to strengthen protections against trafficking in persons in Federal contracts. These changes are intended to implement Executive Order (E.O.) 13627, entitled “Strengthening Protections Against Trafficking in Persons in Federal Contracts,” and title XVII of the National Defense Authorization Act for Fiscal Year 2013., 232821=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to further implement the inflation adjustment of acquisition-related dollar thresholds. A statute requires an adjustment every five years of acquisition-related thresholds for inflation using the Consumer Price Index for all urban consumers, except for the Construction Wage Rate Requirements statute (Davis-Bacon Act), Service Contract Labor Standards statute, and trade agreements thresholds. DoD, GSA, and NASA are also proposing to use the same methodology to adjust nonstatutory FAR acquisition-related thresholds in 2015., 138452=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to implement sections of the Small Business Jobs Act of 2010 and regulatory changes made by the Small Business Administration, which provide for a Governmentwide policy on the consolidation and bundling of contract requirements., 107600=§ 2304 - Contracts: competition requirements, 112877=§ 2336, 154885=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to implement Executive branch policy in the President's Climate Action Plan to procure, when feasible, alternatives to high global warming potential (GWP) hydrofluorocarbons (HFCs). This will allow agencies to better meet the greenhouse gas emission reduction goals and reporting requirements of the Executive Order (E.O.) 13693 of March 25, 2015, Planning for Sustainability in the Next Decade. E.O. 13693 subsumes both E.O. 13423 of January 24, 2007, Strengthening Federal Environmental, Energy, and Transportation Management as well as E.O. 13514 of October 5, 2009, Federal Leadership in Environmental, Energy, and Economic Performance., 106718=§ 2301 - Repealed. Pub. L. 103–355 , title I , § 1501(a), Oct. 13, 1994, 108 Stat. 3296 ], 111981=§ 2330 - Procurement of contract services: management structure, 110247=§ 2316 - Disclosure of identity of contractor, 114097=Title 48 published on 2014-10-01, 110842=§ 2322 - Repealed., 109700=§ 2313 - Examination of records of contractor, 34257=DoD, GSA, and NASA are issuing corrections to FAR Case 2013-001; Ending Trafficking in Persons (Item I), which was published in the Federal Register at 80 FR 4967, January 29, 2015., 111508=§ 2326 - Undefinitized contractual actions: restrictions, 110633=§ 2320 - Rights in technical data, 110434=§ 2318 - Advocates for competition, 112467=§ 2333 - Joint policies on requirements definition, contingency program management, and contingency contracting, 109357=§ 2310 - Determinations and decisions, 39137=DoD, GSA, and NASA are issuing corrections to the Technical Amendments; (Item III), which was published in the Federal Register at 80 FR 4994, January 29, 2015., 227357=DoD, GSA, and NASA are proposing to amend the Federal Acquisition Regulation (FAR) to implement a section of the National Defense Authorization Act (NDAA) for Fiscal Year (FY) 2013 to include in the Federal Awardee Performance and Integrity Information System (FAPIIS), to the extent practicable, identification of any immediate owner or subsidiary, and all predecessors of an offeror that held a Federal contract or grant within the last three years. The objective is to provide a more comprehensive understanding of the performance and integrity of the corporation before awarding a Federal contract., 112756=§ 2335 - Prohibition on collection of political information, 109598=§ 2312 - Remission of liquidated damages, 44028=DoD, GSA, and NASA are issuing a correction to FAR Case 2014-008; Management and Oversight of the Acquisition of Services (Item II), which was published in the Federal Register at 80 FR 4992, January 29, 2015., 111308=§ 2324 - Allowable costs under defense contracts, 109456=§ 2311 - Assignment and delegation of procurement functions and responsibilities, 110922=§ 2323 - Contract goal for small disadvantaged businesses and certain institutions of higher education, 110354=§ 2317 - Repealed., 109258=§ 2309 - Allocation of appropriations, 109062=§ 2307 - Contract financing, 112640=§ 2334 - Independent cost estimation and cost analysis, 112370=§ 2332 - Share-in-savings contracts, 28751=DoD, GSA, and NASA are issuing an interim rule amending the Federal Acquisition Regulation (FAR) to implement Executive Order (E.O.) 13672, “Further Amendments to Executive Order 11478, Equal Employment Opportunity in the Federal Government, and Executive Order 11246, Equal Employment Opportunity,” and a final rule issued by the Department of Labor (DOL)., 112225=§ 2331 - Procurement of services: contracts for professional and technical services, 111753=§ 2328 - Release of technical data under Freedom of Information Act: recovery of costs, 110060=§ 2315 - Law inapplicable to the procurement of automatic data processing equipment and services for certain defense purposes, 109924=§ 2314 - Laws inapplicable to agencies named in section 2303 of this title, 112968=§ 2337 - Life-cycle management and product support, 106874=§ 2302 - Definitions, 111418=§ 2325 - Restructuring costs, 109151=§ 2308 - Buy-to-budget acquisition: end items, 111626=§ 2327 - Contracts: consideration of national security objectives, 110530=§ 2319 - Encouragement of new competitors, 107423=§ 2303 - Applicability of chapter, 110728=§ 2321 - Validation of proprietary data restrictions, 108379=§ 2305 - Contracts: planning, solicitation, evaluation, and award procedures, 111901=§ 2329 - Repealed., 85349=DoD, GSA, and NASA are issuing a final rule amending the Federal Acquisition Regulation (FAR) to delete obsolete regulations relating to the year 2000 compliance.}",
    "lastModified": "Mon, 06 Jul 2015 03:33:09 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 38306 - Federal Acquisition Regulation; Prohibition on Contracting With Inverted Domestic Corporations—Representation and Notification 2015-07-02; vol. 80 # 127 - Thursday, July 2, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 48. Title 48 published on 2014-10-01. 51 U.S.C. 2011340 U.S.C. 121(c) SUBPART 52.3 — Provision and Clause Matrix (§§ 52.300 - 52.301) 48 FR 42478, Sept. 19, 1983, unless otherwise noted. Source: . ; 10 U.S.C. chapter 137; and Authority:",
    "textAfterTable": "DEPARTMENT OF DEFENSE, GENERAL SERVICES ADMINISTRATION, NATIONAL AERONAUTICS AND SPACE ADMINISTRATION Final rule. Effective: November 1, 2015. 48 CFR Parts 1 and 52 Summary DoD, GSA, and NASA are issuing a final rule amending the Federal Acquisition Regulation (FAR) to require additional actions by contractors to assist contracting officers in ensuring compliance with the Governmentwide statutory prohibition on the use of appropriated (or otherwise made available) funds for contracts with any foreign incorporated entity that is an inverted domestic corporation or to any subsidiary of such entity. 80 FR 38309 - Federal Acquisition Regulation; Prohibition on Contracting With Inverted Domestic Corporations GPO FDSys XML | Text Additional Documents type regulations.gov FR Doc. 2015-16215 RIN 9000-AM70 Item V FAR Case 2014-017 Docket No. 2014-0017, Sequence No. 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}