{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2014-20325",
            "",
            "FDA-2014-N-0002"
        ]
    ],
    "pageTitle": "21 CFR Part 558 - NEW ANIMAL DRUGS FOR USE IN ANIMAL FEEDS | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/21/part-558",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 912867204,
    "recordOffset": 912851243,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1136=Title 21 published on 2014-04-01.}",
    "TableContextTimeStampAfterTable": "{22028=The Food and Drug Administration (FDA) is amending the animal drug regulations to reflect approval actions for new animal drug applications (NADAs) and abbreviated new animal drug applications (ANADAs) during April and May 2014. FDA is also informing the public of the availability of summaries of the basis of approval and of environmental review documents, where applicable. The animal drug regulations are also being amended to remove an obsolete entry for a drug for which approval was withdrawn in 1996., 43504=The Food and Drug Administration (FDA) published a document in the Federal Register of February 27, 2014, concerning the voluntary withdrawal of approval of new animal drug applications (NADAs). The document contained an incorrect list of NADAs., 7978=The Food and Drug Administration (FDA) is amending the animal drug regulations to reflect approval actions for new animal drug applications (NADAs) and abbreviated new animal drug applications (ANADAs) during September and October 2014. FDA is also informing the public of the availability of summaries of the basis of approval and of environmental review documents, where applicable. The animal drug regulations are also being amended to reflect a change of sponsorship of six NADAs and four ANADAs, the voluntary withdrawal of approval of an ANADA, and a correcting amendment., 45768=Title 21 published on 2014-04-01, 12674=The Food and Drug Administration (FDA) is amending the animal drug regulations to reflect approval actions for new animal drug applications (NADAs) and abbreviated new animal drug applications (ANADAs) during July 2014. FDA is also informing the public of the availability of summaries of the basis of approval and of environmental review documents, where applicable. The animal drug regulations are also being amended to add a cross reference to a tolerance., 17297=The Food and Drug Administration (FDA) is amending the animal drug regulations to reflect approval actions for new animal drug applications (NADAs) and abbreviated new animal drug applications (ANADAs) during June 2014. FDA is also informing the public of the availability of summaries of the basis of approval and of environmental review documents, where applicable. The animal drug regulations are also being amended to remove a cross-reference to a combination drug medicated feed that is no longer codified., 3184=The Food and Drug Administration (FDA) is amending the animal drug regulations to reflect application-related actions for new animal drug applications (NADAs) and abbreviated new animal drug applications (ANADAs) during January and February 2015. FDA is also informing the public of the availability of summaries of the basis of approval and of environmental review documents, where applicable. The animal drug regulations are also being amended to reflect several non-substantive changes. These technical amendments are being made to improve the accuracy of the regulations.}",
    "lastModified": "Mon, 01 Jun 2015 05:25:14 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 18773 - New Animal Drugs; Approval of New Animal Drug Applications; Withdrawal of Approval of New Animal Drug Applications; Change of Sponsor; Change of Sponsor's Name; Change of Sponsor's Address 2015-04-08; vol. 80 # 67 - Wednesday, April 8, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 21. Title 21 published on 2014-04-01. 37121 U.S.C. 360b SUBPART B — Specific New Animal Drugs for Use in 40 FR 13959, Mar. 27, 1975, unless otherwise noted. Source: . , Authority:",
    "textAfterTable": "DEPARTMENT OF HEALTH AND HUMAN SERVICES, Food and Drug Administration Final rule; technical amendments. This rule is effective April 8, 2015, except for the amendment to 21 CFR 522.1004, which is effective April 20, 2015. 21 CFR Parts 510, 520, 522, 524, 529, and 558 Summary The Food and Drug Administration (FDA) is amending the animal drug regulations to reflect application-related actions for new animal drug applications (NADAs) and abbreviated new animal drug applications (ANADAs) during January and February 2015. FDA is also informing the public of the availability of summaries of the basis of approval and of environmental review documents, where applicable. The animal drug regulations are also being amended to reflect several non-substantive changes. These technical amendments are being made to improve the accuracy of the regulations. 2014-12-15; vol. 79 # 240 - Monday, December 15, 2014 79 FR 74018 - New Animal Drugs; Approval of New Animal Drug Applications; Change of Sponsor; Withdrawal of Approval of New Animal Drug Applications GPO FDSys XML |",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}