{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "The officers are amazing. They are very friendly, but firm with their jobs.",
            "I'm not a member of any Greek life, so I really don't know.",
            "I am personally a member of the humans Vs. zombies club on campus. We have fun missions around campus, and go to other invitationals. There are clubs for pretty much anyone.",
            "The College is great for really any kind of student.",
            "The college is very expensive, and it only seems to continue getting more and more expensive. But I think it is worth it. The faculty is very friendly and helpful, and the classes are worth it.",
            "You can go for walks, watch movies, go skating, go to the mall that is about 5 minutes away, or do anything really.",
            "The dining hall is a hit or miss. Some days it's good, and other days it's so very bad.",
            "It all depends on the dorm. Rouzer hall, the freshman male dorm (soon to be co-ed) was a trash hole, and has been for years. That should change when it becomes co-ed. The other dorms are not bad.",
            "The classes are very hands on and the professors are very friendly and supportive.",
            "Be prepared for work, you have a lot of free time if you can get your work done fully and at a good pace.",
            "It is a very hands on college. The faculty is very friendly. The students are also very friendly."
        ]
    ],
    "pageTitle": "McDaniel College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/McDaniel-College/reviews?_escaped_fragment_=/show/104863",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906520168,
    "recordOffset": 906473255,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9602=At any college, you're only going to get out of your education what you put into it, but at McDaniel, the possibilities are endless. First-Year Seminar courses like Music and Words as a Quest for Meaning and Horror Fiction help freshmen adapt to college life. The Honors Program allows you to take special courses in topics such as Great Works of the Western World, A Hero's Journey, and Nanotechnology. Sophomore Interdisciplinary Studies courses feature topics like September 11 and its Aftermath and South Park and Contemporary Issues. Most professors have the highest degree in their field, and I have never had a professor that was not willing to talk to you in person for extra help or even just friendly conversation. Even outside the classroom, students have so many opportunities that promote skill-building and learning, such as internships, campus employment, and a huge variety of extra-curricular activities., 69185=Limited. There are only really two places you can eat. The main dining hall has really restricted hours (while it's open between lunch and dinner, it closes up for the night at 7:30. Weekend hours are rough) and, once again, if you're a Freshman, you are really restricted. However, there are nice places in town with great food. Main street is close by so you can always walk down to grab something or get pizza delivered. If you don't feel like spending extra money? Be very wary of any beef and prepare your digestive system for school food everyday., 162587=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "08/14/2009 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 33 Laura from Middle River, MD Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 }",
    "textAfterTable": "Am enjoying being here I know that McDaniel is where I was meant to be. The campus is small (you can walk across it in under 10 minutes), but that's what makes it so great. Students are not mere numbers, and there is a strong feeling of community. In addition, I like to keep busy, and it's so easy to get involved that I'm involved in 5 different campus organizations and hold offices in 3 of them. At a larger school, that would be impossible to do as a sophomore. McDaniel is located in Westminster, MD, which is a quiet little town a couple hours away from Baltimore and Washington, DC. The College, sponsors movies on Friday nights, campus organizations hold clubrooms (dances) usually at least once a week, tailgating is HUGE, and there is usually something fun going on. When there's not, it's easy enough to find something to do. The game room is now free, you can go swimming in Harlow Pool, or play intramural sports. McDaniel is becoming increasingly diverse, and I think it's awesome that I've gotten to meet so many different people. Everyone is so friendly, too! I'm having so much fun and learning quite a bit. Am learning a lot At any college, you're only going to get out of your education what you put into it, but",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}