{
    "relation": [
        [
            "Condition:",
            "Main Color:",
            "Length (inches):",
            "Country/Region of Manufacture:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Blue & White",
            "17",
            "China"
        ],
        [
            "Brand:",
            "Style:",
            "Theme:",
            ""
        ],
        [
            "Hasbro",
            "Charm",
            "My Little Pony",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/My-Little-Pony-Best-Friends-Pendant-Necklaces-BFF-Princess-Celeste-Luna-Set-2/161376158030?hash=item2592c4c14e",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00259-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 416309431,
    "recordOffset": 416268315,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  Aug 13, 2014 08:06:21 EDT  Seller assumes all responsibility for this listing. 161376158030 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window",
    "textAfterTable": "BRAND NEW ITEM......GET YOURS TODAY......!!!!!!! ♥ My Little Pony Princess Celestia and Princess Luna Pendant Necklaces ♥ Product Description These My Little Pony pendant necklaces are perfect to share with your bestie or sister. Princess Luna and Princess Celestia are sisters and co-rulers of Equestria. One pendant features Princess Celestia with a small sun charm that reads \"BFF.\" The other features Princess Luna with small glittery moon charm that reads \"BFF.\" The pendants hang from silver chains. ♪ Approximate Measurements: Pendant 1 ¾ “l x 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}