{
    "relation": [
        [
            "Categories",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "it's located in between gramercy, flatiron and murray hill in the city. walking distance from union square, penn station, k-town and many other places. won't find another city campus like baruch.",
            "being one of the few schools in the nation with a trading floor and it's low tuition. baruch offers a big bang for the buck, especially since major companies are always recruiting.",
            "there's events every week, especially thursday nights. every thursday's from noon until 2 no one has classes, just so they can be active within a club.",
            "food inside the school is good and there's all kinds of food outside the school. many places offer a student discount just for being a baruch student.",
            "baruch is finally getting dorms. definitely expanding!",
            "you have to get involved, if you don't you'll just be a typical commuter student and will realize that you should've been involved and active your junior year.",
            "big student life & city campus culture. success depends on the students, not the professors. not just a business school, baruch also has an arts & science school and public affairs school."
        ]
    ],
    "pageTitle": "Baruch College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/CUNY-Bernard-M-Baruch-College/reviews?_escaped_fragment_=/show/86438",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897850871,
    "recordOffset": 897793426,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{78810=Baruch is a business school through and through. It has its perks, but if you come from out of state or do not plan on being a business major, good luck. This goes for any potential CUNY student, the CUNY system may implement something called PATHWAYS in Fall 2013, look it up because it may change your mind on going to a CUNY school., 100043=May be convenient for students who live far away but as for those who live near, it won't play a big role in your time spent at Baruch College. Other than that, the dorms can be a great place to hang out with friends and study., 302792=© 2015, Cappex.com, LLC, 58757=If you think you deserve a treat, maybe after getting that first A in Eng 2150 or acing the philosophy midterm, you should head over to the student life office on the third floor to get some discount tickets! Broadway plays in Times Square or hop by the theatre on 23rd. Retail therapy is available in Union Square or by Penn Station (34th & Lexington)., 76074=As an out of state student, I feel like I could get a better education somewhere else for the price I am paying. Once I get in-state-residency rate come Fall of 2013 (which is considerably lower than out-of-state), I hopefully won't feel like I wasted time and money here., 256098=There came across a small mice inside the classroom in one of my classes in the year 2011. That was extremely unusual., 146945=$2500 for a semester. Respected as highly as Harvard Business School, do the math.}",
    "textBeforeTable": "08/28/2009 Reviewer is A current student here. 18 out of 18 people found this review useful. 1 of 75 Prinita from Queens Village, NY Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Categories Comments Great for these types of students business majors/pre law Tips for prospective students amazing high-tech busy school Login to rate or flag the reviews Nick from Kent, WA 12/28/2010 Reviewer is Researching this school. Reviewer has been to campus. 4 out of 4 people found this review useful. 3 of 75 Categories Comments Tips for prospective students Don't hold your breath for information from Baruch if you are also considering other schools. You will be forced to wait. If you are transferring right out of high school it might not be so bad as you know you will start at Baruch from scratch. If you are transferring credits, it will take an act of congress to find out which ones will transfer-- at least in the time you need to know if you are considering other schools. Very disappointed. Bang for the buck I have been accepted and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}