{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Lots of programs set up for keeping students safe. I've never even felt uncomfortable & I walk around late at night all the time. No worries.",
            "Exorbitant.",
            "There's something for everyone. I actually chose OU solely for one of the organizations they have.",
            "Don't walk under the clock tower, otherwise you won't graduate in 4 years.",
            "Support OU sports! It's tons of fun. There's always school sponsored events and free movie showings too.",
            "Not a ton of super healthy options. The only all-you-can-eat Chic-Fil-A in the country though! Woot! Very good cafeteria.",
            "LIVE IN THE DORMS! This is the best way to meet people and find an awesome community. Some RAs try harder than others, but if you can get along with your roommate, your experience WILL be amazing.",
            "Obviously some programs are better than others. I haven't been too terribly impressed with Gen Ed classes, but my major requirements have all been substantial. Don't underestimate the work, but don't be intimidated either.",
            "Don't let the advisors lead you astray. Make sure you look into the classes you're interested in, find the professor reviews online, and take the classes you'll need for your major. Be prepared. They see too many kids each day to pay very much attention to each one.",
            "OU is a very welcoming university. The campus is easy to navigate and small enough to walk in 20ish minutes. The student body is tons of fun and really loyal."
        ]
    ],
    "pageTitle": "University of Oklahoma (OU) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Oklahoma-Norman-Campus/reviews?_escaped_fragment_=/show/85015",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907542875,
    "recordOffset": 907356338,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1034498=The dorm rooms are small, not very nice, and can be incredibly noisy. For me anyway, housing and food services did not have you fill out a questionnaire to help assign a roommate to that could be problematic. There was a record number of changes during the 2014 school year., 1017252=Definetly apply early so that you can be enered into the freshman class scholarships which the deadline is February I believe. Also visit the campus because it is perfect for me, but others may find the campus to be out of their style or wants., 352334=The University of Oklahoma has an 18:1 student to teacher ratio. It is very known for the vigorous courses students take each year. With the toughness of the courses the ratio gives each student opportunities to learn more then they would in a big class., 22035=I greatly enjoyed being at this university! I plan on going back in the fall matter of fact! The campus is wonderful and beautiful. I felt like I was at home a week in. The people there are so happy and friendly and all the upperclassmen really do help you out and make you feel welcome. During welcome week there are a load of activities and they even have golf carts to take you to class if you get lost! Which is an awesome idea since the Oklahoma heat in September can be..overwhelming., 810708=Dorm Life is ok. Other than the opposite sex curfew they have it is just ok. P.S. Couch is the place to be. Westside 8th floor 2011., 1059878=© 2015, Cappex.com, LLC, 211603=there's no place better to be than ou for college football. there's a wide variety of intramural sports, from rugby to quidditch, the later of which ou actually hosted the world cup for in 2010. if sports aren't your thing, the union programming board offers a free movie night every friday with screenings of recent movies., 99897=I haven't actually moved in & started attending classes yet (I move in August 15th) but I've been there twice. Once for Sooner Saturday, an event for prospective student & I went to enroll. I love the campus it's so beautiful. The people here are very kind & helpful.}",
    "textBeforeTable": "07/12/2009 Reviewer is A current student here. 34 out of 34 people found this review useful. 1 of 231 Lucas from houston, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Am learning a lot OU professors really teach you to think for yourself, especially your English professors. OU professor also teach you different research skills. You really do have to study a lot to make the grade but it is worth it. There are so many diverse programs at OU that I am sure that you will be able to find the right program for you. Login to rate or flag the reviews Elle from Oklahoma City, OK 09/26/2009 Reviewer is A current student here. 14 out of 14 people found this review useful. 3 of 231 Categories Comments Great for these types of students -Anyone into athletics -We have a great business and engineering school; so anyone interested in that -Students who would want to go to a D-1 university, but still has a small town atmosphere Tips for prospective students I think it would be very helpful if you came on a campus tour. It will really show you everything OU has to",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}