{
    "relation": [
        [
            "Selector Name",
            "Hyphens to Em Dash",
            "Hyphen to En Dash",
            "Unslashed Zero",
            "Form Interrobang",
            "Smart Quotes",
            "Periods to Ellipsis"
        ],
        [
            "Selector Constant(s)",
            "kHyphensToEmDashOnSelector kHyphensToEmDashOffSelector",
            "kHyphenToEnDashOnSelector kHyphenToEnDashOffSelector",
            "kSlashedZeroOnSelector kSlashedZeroOffSelector",
            "kFormInterrobangOnSelector kFormInterrobangOffSelector",
            "kSmartQuotesOnSelector kSmartQuotesOffSelector",
            "kPeriodsToEllipsisOnSelector kPeriodsToEllipsisOffSelector"
        ],
        [
            "Selector Value",
            "0",
            "2",
            "4",
            "6",
            "8",
            "10"
        ],
        [
            "Selector Function",
            "Causes two adjacent hyphens to change into a single em dash. Use of this selector is discouraged.",
            "Changes the hyphen in a space-hyphen-space or digit-hyphen-digit group into an en dash. Use of this selector is discouraged.",
            "Makes sure the unslashed zero is always used (even if the font designates the slashed zero as default), of course assuming the unslashed zero actually exists in the font.",
            "Maps the strings '?!' or '!?' to the interrobang (if present in the font). Use of this selector is discouraged.",
            "Contextually replaces straight quotes with curly quotes. Use of this selector is discouraged.",
            "Replaces a sequence of three periods with the ellipsis. Use of this selector is discouraged."
        ]
    ],
    "pageTitle": "Font Feature Registry",
    "title": "",
    "url": "https://developer.apple.com/fonts/TrueType-Reference-Manual/RM09/AppendixF.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 873854575,
    "recordOffset": 873829120,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{121513=Copyright © 2015 Apple Inc. All rights reserved., 81292=This feature allows the selection of various alternate forms specific to East Asian ideographs (e.g., 誠 U+8AA0 vs. 説 U+8AAC, although these two have been separately encoded).}",
    "textBeforeTable": "Except for the slashed/unslashed selector, the use of this feature is discouraged. Font features should not be used to mimic possible changes in the underlying text, as it confuses users. The Typographic Extras feature type represents a collection of effects that are associated with fine typography. It is a non-exclusive feature type. Nonexclusive 14 kTypographicExtras Feature Type Feature Value Feature Constant Typographic Extras     Turns overlap prevention on or off. 0 kPreventOverlapOnSelector kPreventOverlapOffSelector Overlap Prevention Selector Function Selector Value Selector Constant(s) Selector Name The Overlapping Characters feature type permits the user to prevent the collision of long tails on characters with other characters. Nonexclusive 13 kOverlappingCharacters Feature Type Feature Value Feature Constant Overlapping Characters     Acts like the Vertical Fractions selector, but fractions will be synthesized using superiors and inferiors (or special-purpose numerator and denominator forms, if present in the font). 2 kDiagonalFractionsSelector Diagonal Fractions Form vertical (pre-drawn) fractions present in the font. 1 kVerticalFractionsSelector Vertical Fractions This means fractions should not be formed automatically. 0 kNoFractionsSelector No Fractions Selector Function Selector Value Selector Constant(s) Selector Name The Fractions feature",
    "textAfterTable": "    Mathematical Extras Feature Constant Feature Value Feature Type kMathematicalExtras 15 Nonexclusive The Mathematical Extras feature type represents a collection of effects useful in setting figures and mathematics. It is a non-exclusive feature type. Selector Name Selector Constant(s) Selector Value Selector Function Hyphen To Minus kHyphenToMinusOnSelector kHyphenToMinusOffSelector 0 Changes the hyphen in a space-hyphen-space or digit-hyphen-digit group into a minus. Use of this selector is discouraged. Asterisk to Multiply kAsteriskToMultiplyOnSelector kAsteriskToMultiplyOffSelector 2 Changes the \"*\" in a space-*-space group into a multiplication sign (×). Use of this selector is discouraged. Slash to Divide kSlashToDivideOnSelector kSlashToDivideOffSelector 4 Changes the \"/\" in a space-/-space group into a division sign (÷). Use of this selector is discouraged. Inequality Ligatures kInequalityLigaturesOnSelector kInequalityLigaturesOffSelector 6 Changes the >= sequence into a greater-than-or-equal glyph and the <= sequence into a less-than-or-equal glyph. Use of this selector is discouraged. Exponents kExponentsOnSelector kExponentsOffSelector 8 Takes digits immediately following a \"^\" and changes them into their superior forms. Use of this selector is discouraged. Mathematical Greek kMathematicalGreekOnSelector kMathematicalGreekOffSelector 10 Special forms of Greek glyphs designed for use in mathematics (as opposed to writing Greek).",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}