{
    "relation": [
        [
            "File",
            "back.png",
            "delete.png",
            "down.png",
            "first.png",
            "forward.png",
            "last.png",
            "new.png",
            "sheet.png"
        ],
        [
            "Role",
            "Icon",
            "Icon",
            "Icon",
            "Icon",
            "Icon",
            "Icon",
            "Icon",
            "Icon"
        ],
        [
            "Description",
            "Back Button",
            "Delete Button",
            "Down icon",
            "First Button",
            "Forward Button",
            "Last Button",
            "New Button",
            "Sheet Button"
        ]
    ],
    "pageTitle": "FiForms Framework: Framework for rapid Web application development - PHP Classes",
    "title": "",
    "url": "http://www.phpclasses.org/package/2186-PHP-Framework-for-rapid-Web-application-development.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00203-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 635125407,
    "recordOffset": 635104973,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Daniel McFeeters The FiForms Framework is an application development framework for building Web-database applications in XML, powered by MySQL and PHP. AJAX-enhanced forms, sub-forms, custom reports, and dynamically generated menus create a seamless user experience. The FiForms Framework lets you rapidly prototype and develop a Web/database front end using the latest PHP and XML technologies. It currently includes data-entry classes and XML report generation scripts. The libraries utilize the new XML capabilities of PHP 5 to create a framework for developing Web applications completely in XML languages.     Author   Description HTML, Databases, Libraries 5.0 GNU General Publi... fiforms 0.9.3     Categories  ",
    "textAfterTable": "combined scripts which utilize the new XML capabilities of PHP version 5 to create a framework for developing web applications completely in XML. The latest version of this software is available at the following web site: <http://www.fiforms.org> You can find documentation and setup instructions for the FiForms Framework on the wiki: <http://wiki.fiforms.org/> Documentation for XML schemas can be found at <http://xml.fiforms.org/> Quick Installation ================== To get FiForms up-and-running quickly, we suggest you follow the instructions outline on the wiki page http://wiki.fiforms.org/index.php/Installation Requirements ============ Before you can use FiForms, you must have the following software installed on your system: * an operating system (of course) FiForms should work on any operating system that Apache and PHP will run on. Most of the development and testing of FiForms has been done on Linux, but it should also run under Windows, OS X, BSD, etc. * an http webserver (works best on Apache webserver) <http://apache.org> * MySQL database server <http://mysql.org> FiForms works well with MySQL 4.0, 4.1, and 5.0. It should also work with other versions. * a PHP interpreter <http://www.php.net> FiForms requires PHP 5.x. * Php.XPath (this is included with FiForms if you are installing using a pre-built package or installer) <http://sourceforge.net/projects/phpxpath/> * XSLTProc (required if you will be using FiReportsXML with server-side transformation, and you are not using PHP_XSLT) <http://xmlsoft.org/XSLT/> Install libxslt on your operating system and configure the path to XSLTProc in FiForms_global.inc.php Note to windows users: A package containing all the programs you need is available at http://downloads.sourceforge.net/myforms/FiForms_Binary_Dependencies_Win.zip This",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}