{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Run!",
            "haven't started yet",
            "haven't started yet",
            "haven't started classes yet",
            "Penn State Behrend is a really nice campus with great facilities. They have tons of major opportunities and can accompany anyones interest. The Faculty are also very helpful."
        ]
    ],
    "pageTitle": "Pennsylvania State University-Penn State Erie-Behrend College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Pennsylvania-State-University-Penn-State-Erie-Behrend-College/reviews?_escaped_fragment_=/show/89683",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 897713855,
    "recordOffset": 897680658,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{127545=© 2015, Cappex.com, LLC, 43466=Bring cold weather gear--Erie is wintry from November to February guaranteed, and sometimes even from October to April/May, depending on the year. This includes boots, campus is hilly and you will have to walk in the snow. The Academic and Career Planning Center in the upstairs Reed building is extremely helpful, especially if you don't know what you're majoring in, or you decide to switch majors partway through your schooling. Everyone is so friendly and just wants to help.}",
    "textBeforeTable": "07/09/2009 Reviewer is A current student here. 9 out of 9 people found this review useful. 1 of 30 Lauren from Oakdale, PA Check out reviews left by other students or leave your own review. You could win a free scholarship. Pennsylvania State University-Penn State Erie-Behrend College Reviews Pennsylvania State University-Penn State Erie-Behrend College › Pennsylvania › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Great for these types of students Dedicated driven students who want the best education to go along with their degree. Tips for prospective students It is a difficult school make sure you go in with the right mind set and ask for help when you need it. Bang for the buck Students are receiving a Penn State degree and although it is not cheap it is well worth the money. Money is not just being payed for a degree at the end in every class students are learning skills to help them in a career. Am enjoying being here Penn State is close to home for me but it is still a new experience and either are a lot of activities to help every student get involved and meet new people. Even being stuck on campus during a snow storm is a relaxing enjoyable time. Am learning a lot Although what you learn depends mostly on you the teachers also have a part in how a student learns. At Penn State the teachers take extra time out of their day to assist you along with most of the other staff. Everyone is willing to help",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}