{
    "relation": [
        [
            "Drug",
            "Cocaine",
            "Heroin",
            "Metham-phetamine",
            "Marijuana"
        ],
        [
            "FY 2002 Baseline (Pure Metric Tons)",
            "260-270",
            "13-18",
            "110-140",
            "10,000-25,000"
        ],
        [
            "FY 2001 Seizures (Metric Tons)",
            "35",
            ".6",
            "2.0",
            "646"
        ],
        [
            "FY 2002 Seizures (Metric Tons)",
            "25",
            ".7",
            "1.8",
            "562"
        ]
    ],
    "pageTitle": "DOJ: AG: 2002 Performance Report: Section 2",
    "title": "DOJ's Reduction in Supply of Drugs Available for Consumption Within the U.S. [DEA]",
    "url": "http://www.justice.gov/archive/ag/annualreports/pr2002/Section02.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00119-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 530864751,
    "recordOffset": 530811862,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5606=The Department will strengthen its programs to target drug smuggling organizations that traffic across the Southern borders, and from Europe and Asia. Since September 11, 2001, the Department has strengthened its programs focus on targeting drug organizations using the Northern border as their transit zone for drugs and drug proceeds. All of these programs are intended to link federal, state and local investigations domestically and to facilitate multilateral enforcement efforts abroad., 10393=Efforts to curtail gang-related violence and the illegal use of firearms are other major features of this plan. In response to a surge in juvenile and gang-related violent crime between 1985 and 1995, the FBI developed its National Gang Strategy. As part of this gang strategy, federal law enforcement agents continue to form multi-agency task forces that include state and local police officers. Collectively, these teams are able to achieve results, which no agency could do on its own., 17992=As a result of the provisions of the Homeland Security Act of 2002 (P.L. 107-296), the law enforcement functions of the Treasury Department's Bureau of Alcohol, Tobacco and Firearms transferred to Department of Justice's (DOJ). The mission of the renamed Bureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) is to deter and investigate violations of law relating to alcohol, tobacco, firearms, explosives and arson; areas that could be monitored under Strategic Goal Two. Although ATF is not yet reflected in the Department's Strategic Plan, a separate section (Appendix A) addresses the ATF FY 2003 and FY 2004 performance plan and related resources (budget and personnel)., 497=The Criminal Section of the Civil Rights Division works closely with the Federal Bureau of Investigation, Immigration and Naturalization Service, Department of Labor, the Criminal Division, the U.S. Attorneys Offices, and Non-Government Organizations to identify victims, many of who are women and children of illegal trafficking. The Victims of Trafficking and Violence Protection Act, enacted into law in 2000, expanded the scope of federal enforcement authority over slavery offenses.}",
    "TableContextTimeStampAfterTable": "{122227=On September 26, 2002, David Myers, the former comptroller of WorldCom, pleaded guilty to conspiracy, securities fraud, and making false filings with the SEC; and on October 11, 2002, Betty Vinson, the former Director of Management Reporting at WorldCom, and Troy Normand, the former Director of Legal Entity Accounting, pleaded guilty to conspiracy and securities fraud., 36646=Strategies to Achieve the FY 2003/FY 2004 Goal: The FBI will provide oversight of ACE investigations to ensure that the Enterprise Theory of Investigation and sophisticated investigative techniques are utilized to order to disrupt and dismantle targeted ACEs. Specifically, the FBI will provide appropriate training to field agents working Asian Organized Crime (AOC) cases, monitor and assess investigative progress through regular communications and case meetings among all AOC field staff, initiate undercover operations where necessary, and participate in multi-agency information sharing sessions. In addition, the FBI will apply the Enterprise Theory of Investigation, an integrated investigative approach that utilizes the entire range of sophisticated investigative techniques to dismantle ECEs., 62832=Background/Program Objectives: The Department of Justice focuses its drug law enforcement efforts on reducing the availability of drugs by targeting the largest drug supply and money laundering networks for dismantlement of their entire infrastructure, from international supply and national transportation cells, to regional and local distribution organizations. The OCDETF program has been designated by the Attorney General as the centerpiece of his drug strategy. The program coordinates multi-agency and multi-region investigations, targeting the most serious drug trafficking threats. The OCDETF program functions through the efforts of the U.S. Attorneys; elements of the Department's Criminal Division; the investigative, intelligence, and support staffs of DEA, FBI, INS, and USMS; the investigative support of the Bureau of Alcohol, Tobacco and Firearms; the Internal Revenue Service; the U.S. Customs Service; the U.S. Coast Guard; as well as state and local law enforcement agencies. The goal of each OCDETF investigation is to determine connections to related investigations nationwide in order to identify and dismantle the entire structure of the drug trafficking organization (DTO). A major emphasis of OCDETF investigations is to disrupt financial dealings and dismantle the financial infrastructure that supports the DTO. As the Attorney General noted during a national conference in December 2001, \"Sophisticated drug trafficking organizations mirror the Fortune 500. They have similar business structures, distribution systems, and profitability - laundering an estimated $300 - $500 billion a year. Just as the Department seeks to dismantle terrorist operations by cutting off their access to money, so too must we combat the sophisticated financial infrastructure of drug trafficking operations.\", 113974=Strategies to Achieve the FY 2003/FY 2004 Goal: DOJ will continue to successfully investigate, prosecute and obtain judgments, forfeitures and settlements against providers that defraud health care programs. DOJ will also continue to sponsor training programs for prosecutors, investigators, and program integrity personnel and will collaborate with other federal and state agencies to combat health care fraud. The key performance measure illustrates projected reductions in discrete CMS Medicare expenditures based on recent enforcement initiatives. The relationship between law enforcement efforts targeting health care fraud and the resulting effect on identifiable areas of Medicare billings is implied by reductions in projected health care costs for Medicare expenditures related to services targeted for fraud enforcement. The Department will focus resources on early indicators of potential fraud that are anticipated to lead to high-impact investigations of nationwide health care schemes. Industries and markets that have been identified as potential targets for investigation will be monitored for reductions in economic loss and frequency of fraud., 136190=Background/Program Objectives: With the continuing expansion of the Internet as a global medium for electronic commerce and communications, the type of cybercrime most likely to cause significant harm to consumers and businesses here and abroad, and to undermine consumer confidence, is Internet fraud. There are substantial increases in various fraud schemes involving the Internet, such as online auction fraud, stock manipulation schemes, credit card fraud, false business or investment opportunities, ponzi/pyramid, identity theft, and perjury. One estimate is that online payment-card fraud will increase from $1.6 billion in 2000 to $15.5 billion by 2005., 172411=Data Collection and Storage: The data source is a record system maintained by the FBI Crimes Against Children Unit, Violent Crimes and Major Offenders Section, Criminal Investigative Division. Data from the Integrated Statistical Reporting and Analysis Application (ISRAA) are not used because prior to FY 2000, ISRAA did not record data for this specific type of crime., 139969=On May 17, 2002, the Fraud Section, in coordination with the U.S. Attorney's Offices in Pennsylvania and South Carolina, obtained the conviction of David Allen Sussman in connection with an online auction fraud. Sussman pleaded guilty to two counts of wire fraud in connection with a scheme to defraud users of eBay and other online auction sites. Sussman adopted multiple false names, established multiple Web-based e-mail accounts under those names, and used them to conduct fraudulent eBay auctions and to bid in others' eBay auctions for high-priced watches, jewelry, and other items of value. Sussman's scheme caused total losses of at least $85,894., 110883=Discussion: Although data collection takes place on a calendar year basis, and thus CY 2002 data are incomplete, so far the data indicate that the expected reduction in Medicare billings will occur. Updated information on CY 2001 Medicare data from CMS showed that previous estimates were reasonably close to more accurate data that are now available. Some of the updated revisions take into account certain DME codes that Medicare no longer services, and thus could not be tracked any further., 92901=Discussion: Two targets were exceeded despite a FY 2002 reallocation of 400 agents from the FBI's counterdrug efforts to counterterrorism. The target for dismantling Other DTOs was not met because dismantling DTOs linked to NPTs took priority over dismantling non-linked organizations. FY 2002 accomplishments included Mexican, Colombian, and Caribbean-based organizations., 157997=Strategies to Achieve the FY 2003/FY 2004 Goal: In FY 2003, the Department will continue its efforts to convict and deter environmental crimes through initiatives focused on laboratory fraud, chlorofluorocarbon (CFC) smuggling, water pollution, leaking underground storage tanks, and the transportation of hazardous materials. For example, the Laboratory Fraud Initiative centers on ensuring that businesses and environmental enforcement agencies at the federal, state and local levels can rely on the accuracy of analyses performed by commercial laboratories. Investigations will examine fraudulent practices, target companies suspected of committing laboratory fraud, and identify common investigative and prosecutorial issues in these cases. The CFC Smuggling Initiative has led to a dramatic decline in CFC trafficking, although the Department expects that smuggling may rise as the shortage of CFC-12, a type of ozone depleting chemical, becomes more acute. The Water Pollution Initiative is aimed at investigating and prosecuting cases involving the discharge of illegal pollutants into the nation's sewers and public wastewater treatment facilities. More than 100 million pounds of toxic industrial compounds annually pass untreated through the nation's publicly owned treatment works, only to be discharged into rivers and lakes. The focus of the Leaking Underground Storage Tanks initiative is uncovering widespread fraud by firms that fail to lawfully test and analyze underground tank systems. Such testing is critical to the protection of the nation's drinking water. The Department will work to identify the companies involved in these schemes and to develop criminal investigations and prosecute them. The \"Hazmat\" or Hazardous Material Enforcement Initiative focuses on violations of the laws in connection with the transportation and handling of toxic and flammable substances. Experts have identified the nation's Hazmat transportation & handling system as a vulnerable area for terrorist attacks. For example, thousands of deaths could result from a terrorist with a fraudulent HazMat license commandeering a tractor-trailer or a vessel laden with hazardous materials. The Department will work to ensure the environmental HazMat laws are enforced and will identify and prosecute violators, resulting in the strengthening of our homeland security., 98270=The FBI's drug program is being restructured for several reasons. Recent events, primarily the September 11, 2001 attacks, required the FBI to examine current and future investigative priorities and develop organizational changes to accomplish its new objectives. The FBI, with the approval of Congress, has shifted 567 agents (in FY 2002 and 2003) from drug investigations to counterterrorism, counterintelligence, security, and training functions. This reduction will ultimately affect the number of DTOs identified, disrupted, and dismantled by the FBI., 146825=Public Benefit: In recent years, ATR has enjoyed remarkable success in terms of fracturing international cartels, securing the convictions of major conspirators, and obtaining record-breaking fines. The benefits that accrue to U.S. consumers and businesses as the result of these efforts are considerable. Criminal enterprises encountered by ATR are increasingly large and global in scope, and their impact on international commerce is significant, raising prices and thwarting innovation around the globe. Since the beginning of FY 1997, ATR has prosecuted international cartels affecting well over $10 billion in U.S. commerce and collected fines exceeding $2 billion. It is clear that the termination of cartel activity in these cases will save U.S. businesses and consumers many hundreds of millions of dollars annually., 168273=Strategies to Achieve the FY 2003/FY 2004 Goal: The Tax Division coordinates nationwide criminal investigations and prosecutions of illegal tax protest groups using new and emerging schemes and combats abusive international tax evasion schemes before they cause significant damage to the tax system. TAX efforts stop the proliferation of regional and nationwide tax evasion schemes using illegal trusts. TAX prosecutes legal source income cases and prosecutes drug cases involving tax crimes. In addition, TAX conducts training and provides expert technical assistance to EOUSA. Assistance is also provided in treaty negotiations and foreign evidence gathering in criminal tax matters. Initiatives concerning legislative and policy matters involving the sentencing guidelines, the federal rules of evidence and criminal procedure, and substantive criminal law are also provided by TAX., 35034=The reallocation of field investigative resources following the events of September 11, 2001, had a significant impact on ECE program performance. Field offices with the largest Eurasian Organized Crime programs, such as New York, Newark, and Miami, were required to shift their focus to the investigative efforts following the terrorist attacks., 88981=Discussion: DEA exceeded both revised targets. The target for PDTOs disrupted or dismantled equated to 6% of targeted PDTOs. The actual accomplishment in this area was 19.9% of targeted PDTOs. In addition, during FY 2002, DEA completed efforts to automate reporting of the PDTO program and is now working to automate the CPOT linkages., 121488=The SEC brought swift enforcement action against WorldCom in June 2002, within days of the initial disclosure of massive accounting misstatements. That suit secured an injunction against the dissipation of remaining company assets and the imposition of a corporate monitor to ensure that executive wrongdoers did not remove cash from the company., 69666=While drug seizure data is readily available, it does not capture the total impact of disrupted or dismantled DTOs. In an effort to evaluate the Department's impact on the availability of drugs entering the U.S. during FY 2003, DEA is developing a methodology to determine the immediate and long term impact on drug trafficking and the drug supply as a result of successfully disrupting and/or dismantling a drug trafficking criminal enterprises. The development of this methodology will be complex due to the data limitations and numerous variables similar to those encountered in the development of the national drug supply estimates. Upon development of these estimates, the methodology will be expanded to determine the impact on drug supply as a result of the law enforcement efforts of the Departments of Transportation and Treasury., 71361=Strategies to Achieve the FY 2003/FY 2004 Goal: OCDETF has developed and implemented several changes to enhance the program's ability to achieve its goals. These developments include the establishment of a consolidated list of priority drug and money laundering targets, new and revised program guidelines, and new field guidance for agents and prosecutors to enhance effectiveness of OCDETF investigations., 94304=Strategies to Achieve the FY 2003/FY 2004 Goal: DEA has developed a strategy for targeting, disrupting and/or dismantling the most significant PDTOs and linked DTOs that present the greatest threat to the U.S. In order to disrupt or dismantle PDTOs, all organizational elements must be identified and targeted, including producers and/or suppliers, transporters, distributors, and facilitators. Due to the increasing decentralization of drug trafficking, not all organizational elements are usually contained within a single PDTO. A decentralized organizational structure affords a great deal of flexibility and protection. For example, the facilitator generally has little or no contact with the rest of the organization, so if the money laundering capability is disrupted, those arrested usually have little information about the remainder of the organization., 177915=Background/Program Objectives: The Civil Rights Division's (CRT) Criminal Section works closely with the FBI and the INS to identify victims, many of whom are women and children, of illegal trafficking and to investigate and prosecute incidents involving criminal violations of federal civil rights crimes. The Victims of Trafficking and Violence Protection Act of 2000 expanded the scope of the federal enforcement authority over slavery offenses. This new law strengthened our ability to investigate and prosecute slavery offenses. We are continuing our outreach programs in this area in an effort to coordinate slavery and trafficking enforcement efforts throughout the nation., 107113=The General Accounting Office (GAO) estimated that as much as 10 % of annual health care costs may be attributable to fraud. The Department of Health and Human Services (HHS), Office of Inspector General's most recent audit of improper payments in the Medicare fee-for-service program shows that the claims payment error rate was 6.3 % ($12.1 billion) in 2001, which is down from 14% ($23.2 billion) when the first audit was conducted in 1996. Fraudulent claims submitted to health care insurers and medically unnecessary services performed simply to generate billings are prevalent in every geographical area in the country. Pending cases demonstrate that fraud exists on a national scale, through either corporate schemes to defraud or systemic abuse by certain provider types. Home health care agencies, medical transport companies, suppliers of durable medical equipment, and clinical laboratories are particularly susceptible to fraud. Enhanced use of technology to analyze health care billing data will allow law enforcement and health care program agencies to become more proactive in detecting fraud and abuse, identifying systemic weaknesses and closing loopholes in the system before criminals take further advantage of them., 182154=Strategies to Achieve the FY 2003/FY 2004 Goal: The Criminal Section's Worker Exploitation Task Force brings together DOJ and the Department of Labor (DOL), Department of State and Health and Human Services (HHS) to address involuntary servitude, slavery, trafficking and other criminal violations involving undocumented workers and others held in bondage. DOJ works closely with DOL, local authorities and the Non-Governmental Organization (NGO) community to identify, investigate and prosecute incidents of servitude and human trafficking. Once victims are identified and certified, we work with several agencies to secure available assistance and benefits to victims (e.g., the Section works with HHS to access refugee-type benefits; with HUD to locate possible housing; with the Social Security Administration (SSA) to ensure victims who get a work permit also receive a social l security number; with the Department of Agriculture to obtain food stamps available to certified victims). We also consult with the Department of State, and the National Security Agency to locate language interpreters. Additionally, the Section has spearheaded formal training of local and federal investigators and prosecutors in the techniques of investigating and prosecuting slavery cases and to provide expert guidance on the newly enacted Trafficking Victims Act. Training and outreach efforts continue in this area., 115158=Crosscutting Activities: DOJ has increased participation on interagency task forces and working groups formed to address health care fraud and abuse issues. In addition to federal law enforcement and health care program agency representatives from the Departments of Justice, HHS, Defense, Labor, Veterans Affairs, and the Office of Personnel Management, such task forces may also include state and/or local law enforcement representatives from the National District Attorneys Association, the National Association of Medicaid Fraud Control Units, and the National Association of Attorneys General. To illustrate, the National Health Care and Managed Care Fraud Working Group was formed in the early 1990s and meets on a quarterly basis. Similarly, numerous United States Attorneys' Offices across the nation chair interagency health care fraud task forces that meet routinely on a local or state basis. DOJ and HHS formed an interagency Nursing Home Fraud and Abuse steering committee, comprised of CMS, HHS-OIG and the FBI, that has met monthly since the agencies launched a nursing home fraud and abuse initiative in October 1998. Since 2000, DOJ and CMS have jointly sponsored one national conference and two regional meetings to enhance the use of technology and high-tech analytic tools to combat health care fraud., 89338=DEA's accomplishments in the latter half of FY 2001 and FY2002 reflect a new program that initially included many PDTOs near completion for dismantlement. In the future, PDTO disruptions and dismantlements will level off., 65884=DOJ's Reduction in the Supply of Drugs Available for Consumption Within the U.S. [DEA, OCDETF] FY 2002 = Baseline d, 75801=Background/Program Objectives: In the past, the drug crime efforts of the DEA and FBI were reported separately, due in part to the size, complexity and significance of the drug trafficking organizations involved. While there were legitimate reasons for separate reporting, it created confusion and lacked Departmental focus. Consequently, in FY 2001, the Attorney General directed the Department to develop a single national list of major drug trafficking and money laundering organizations. In response, DEA, the FBI, and the U.S. Customs Service, with input from the intelligence community and other OCDETF member agencies, identified 53 international command and control organizations representing the most significant drug organizations threatening the U.S. These targets, titled the Consolidated Priority Organization Target (CPOT) list, represent the first time federal agencies have worked together to develop a single target list. This list reflects the most significant international narcotic supply and related money laundering organizations, poly?drug traffickers, clandestine drug manufacturers and producers, and major drug transporters supplying the U.S. The list, as well as linked organizations, will be updated periodically to remain current., 104280=Strategies to Achieve the FY 2003/FY 2004 Goal: The FBI's Foreign Counterintelligence (FCI) Program has recently completed a thorough and wide-ranging internal review of its operations and, as a result, has developed a comprehensive new Counterintelligence strategy. In the coming months, the FCI program will be developing program plans to carry out this strategy. The strategy is predicated on the need for a centralized national direction that facilitates a focus on common priorities and specific objectives in all areas of the country. It also recognizes the need for collaboration with other members of the U.S. Intelligence Community. This new strategy will enable the program to more effectively combat the intelligence threats facing the United States., 123624=Additionally, in January 2002, the Department of Justice formed a special Enron Task Force to examine all Enron-related matters. The Task Force is composed of a team of federal prosecutors supervised by the Department of Justice's Criminal Division and agents from the Federal Bureau of Investigation and other agencies., 122949=On September 23, 2002, John J. Rigas, the founder and former Chairman of the Board and CEO of Adelphia Communications Corp., two of his sons and two other executives were indicted on charges of wire fraud, securities fraud, bank fraud, and conspiracy to commit all of those offenses. The indictment charges that from 1999 through 2002, the defendants participated in a scheme to defraud Adelphia's creditors and investors by making false and misleading statements about Adelphia's debt, operating performance, and basic cable subscriber growth. The indictment also charges that the Rigas family embezzled hundred of millions of dollars in Adelphia's funds and assets., 176358=Strategies to Achieve the FY 2003/FY 2004 Goal: DOJ will continue to make efforts to apprehend those who commit sexual exploitation offenses against children, including those who traffic in child pornography. The objective of the strategy is to reduce the number of victimized children and to increase the rate of identification and apprehension of child pornographers. Facilitation of crimes against children through the use of a computer and the internet is a national crime problem that is growing dramatically. Statistics in this area have recently doubled annually. The FBI targets individuals involved in sexual exploitation of children by focusing its investigative efforts towards travelers/enticers (i.e. those who entice minors to meet them in order to engage in sexual acts), and enterprises involved in the manufacture and distribution of child pornography., 146182=Discussion: ATR's goal is to achieve a successful outcome in every case it tries. ATR has been aggressive in its pursuit of criminal anticompetitive behavior, exceeding its targeted 90% success rate in FY 2002., 69192=Discussion: During FY 2002, DOJ, in conjunction with the Office of National Drug Control Policy (ONDCP), and an interagency group led by DEA, baseline estimates were developed for the annual amount of cocaine, heroin, methamphetamine and marijuana available for consumption in the U.S. during 2001. These totals include drugs transported into the U.S., as well as drugs produced domestically. These drug availability estimates will be updated annually., 180171=Discussion: CRT's Criminal Section surpassed its target for FY 2002. 54 victims were protected as a result of federal charges filed against perpetrators engaging in human trafficking and holding persons in involuntary servitude. Many of these victims were women and children. In addition to protecting these 54 victims, the section filed 10 cases charging 41 defendants with human trafficking and servitude-related crimes in FY 2002., 156329=Discussion: FY 2002 successes include the $18 million dollar fine from a major passenger cruise line mentioned above, and a fuel supplier that was ordered to pay a total of $471,000 and spend 2 years on probation for conspiring to falsify reformulated gas testing results in order to meet EPA standards. In addition, a shipping company and its owner pled guilty to the crime of distributing caviar from protected species. The two defendants were fined a total of over $111,000 and ordered to pay total restitution of $48,000 split between the Fish & Wildlife Foundation and the Fish & Wildlife Service., 123952=Based on the work of the Task Force, the investigation already has produced significant results. On April 9, 2002, David Duncan, chief accountant for Arthur Andersen LLP, pleaded guilty to a one count information charging him with obstruction of justice. On June 15, 2002, Arthur Andersen LLP was convicted of an obstruction of justice charge for destroying Enron-related materials. On July 27, 2002, three former British bankers were charged with fraud in a $7.3 million scheme involving Enron. On August 21, 2002, Michael J. Kopper, a former managing director of the Enron Corporation, pleaded guilty to conspiracy to commit wire fraud and conspiracy to commit money laundering stemming from a scheme to defraud Enron and its shareholders. In pleading guilty, Mr. Kopper agreed to cooperate in the ongoing investigation of the Enron collapse and to pay $12 million in restitution and forfeiture. On October 31, 2002, Andrew Fastow, former chief financial officer of Enron, was charged in a 78-count indictment in connection with Enron's multi-billion dollar collapse. On November 26, 2002, former Enron executive Lawrence M. Lawyer pleaded guilty pursuant to a cooperation agreement to subscribing to a false tax return. As part of his cooperation agreement, Lawyer agreed to pay $29,274.73 in back taxes to the IRS and to pay voluntary restitution in the amount of $79,468.83 to the Enron Ex-Employees Relief Fund., 121842=Former WorldCom CFO Scott Sullivan and former WorldCom Director of General Accounting Buford Yates were indicated by a federal grand jury on charges of conspiracy and securities fraud charges stemming from their participation in a scheme to defraud the investing public by falsifying the financial condition and operating performance. On October 28, 2002, Yates pleaded guilty., 105944=Background/Program Objectives: According to the Centers for Medicare and Medicaid Services (CMS), spending for health care totaled nearly $1.3 trillion in 2000, and accounted for 13.2 % of the nation's gross domestic product. Public spending for health care services through the Medicare, Medicaid, and all other government funded health care programs accounted for 45 % of total health care spending in 2000. Medicare spending grew 5.6 % in 2000, following a brief period of slower growth in 1999 (1.5 %) and 1998 (1.0 %). CMS has attributed most of the increased spending to changes in provider payments, particularly those enacted in the Balanced-Budget Refinement Act of 1999 and the Benefit Improvement Protection Act of 2000. Due largely to demographic trends, CMS projects that national health expenditures will more than double to $2.8 trillion by 2011, growing at a mean annual rate of 7.3 % during the forecast period 2001 to 2011. Due to this expected growth in health care spending, CMS further projects that national health expenditures will constitute approximately 17.0 % of GDP by 2011, a substantial increase from 13.2 % in 2000., 66379=Data Collection and Storage: FY 2001 estimates were developed using intelligence data from several sources including but not limited to, the United Nations Office for Drug Control and Crime Prevention; ONDCP; the National Drug Intelligence Center; and the Federal-wide Drug Seizure System. FY 2002 seizure statistics were drawn from FDSS. In addition, a baseline estimate for the amount of illicit drugs consumed in the U.S. was developed by ONDCP based on data from the Substance Abuse and Mental Health Services Administration; National Institute of Justice's Arrestee Drug Abuse Monitoring Program; and the National Institute for Drug Abuse Monitoring the Future Survey., 126593=Strategies to Achieve the FY 2003/FY 2004 Goal: In FY 2004, under the leadership of the Corporate Fraud Task Force, DOJ will continue to identify and target fraud schemes such as corporate fraud. DOJ will also continue to pursue health care fraud, money laundering, financial institution fraud, insurance fraud, securities/commodities fraud, and identity theft, which threaten to undermine our nation's financial institutions. DOJ will aggressively utilize the money laundering and asset forfeiture statutes to ensure that fraudulently obtained funds are located and proper restitution is made to the victims of fraud. DOJ's enforcement strategy is a coordinated approach whereby the Department will continue to work with other Federal agencies to identify and target fraud schemes by successfully investigating, prosecuting, and obtaining judgments and settlements., 61316=Strategies to Achieve the FY 2003/FY 2004 Goal: As our network of international law enforcement treaties has grown in recent years, we have begun to focus our efforts on implementing our existing treaties, with a view to making them as effective as possible, rather than on negotiating many new instruments. The legal processes leading up to a fugitive's surrender include extradition and waiver of extradition (the U.S. has extradition treaty relationships with approximately 120 countries), deportation, expulsion and voluntary return., 138430=Discussion: Fraud Section exceeded its target for FY 2002., 109325=Data Limitations: Claims data from CMS are proved on a calendar year basis. BESS data are adjusted and reflect 95 % reporting of claims for 1999, 2000, and 2001, and 56 %reporting of claims for FY 2002. The figures are adjusted based upon the estimate of claims received for the reporting period. Changes in Medicare payment system due to legislative or regulatory action are taken into account so that comparisons of data from previous years are reliable., 27755=There are no program evaluations planned for FY 2003., 140672=Strategies to Achieve the FY 2003/FY 2004 Goal: DOJ will increase the quality and variety of Internet fraud related training, to ensure that prosecutors and agents are fully conversant with changing trends. To effectively manage the increase in prosecution of cases such as securities fraud, consumer fraud, and identity theft that exploit the Internet, including those cases that may operate in multiple jurisdictions and use sophisticated techniques for concealing and laundering criminal proceeds, the Fraud Section will plan for appropriate investigative, prosecutorial, financial and technical support., 53150=Strategies to Achieve the FY 2003/FY 2004 Goal: Project Safe Neighborhoods is a comprehensive and strategic approach to reduce gun violence across the country. A centerpiece of this initiative is to create multi-agency partnerships in every district that will effectively enforce existing gun laws, target violent offenders, and deter gun crime by publicizing these enforcement efforts in the community. In every district, the PSN partners have been given resources to assist them in evaluating the nature of the local gun violence problem and to develop meaningful measurements of the impact of the strategies developed. This accountability component is designed to keep the district-based partnership abreast of changes occurring in the community, to assist them in evaluating their efforts in light of those changes, and to provide them with an opportunity to retool their gun plans to address emerging issues. Many of the PSN strategies developed to date have focused on those communities, towns, and cities that have been most affected by gun violence. Thus, in order to measure our performance at the national level, we will report on the change in gun violence in these targeted areas, rather than entire states or districts., 154042=Discussion: FY 2002 successes include a guilty plea and an $18 million fine from a major passenger cruise line which was falsifying records of oil contaminated discharges to the sea. A portion of the fine will be paid to environmentally focused organizations. In another success, a defendant pled guilty to intentionally draining two ponds that contained a protected species thereby making way for a housing development. The judgment included fines and payments to environmentally focused organizations totaling $1 million, and an agreement to preserve a 640-acre parcel for the protected species., 44072=Strategies to Achieve the FY 2003/FY 2004 Goal: In FY 2004, DOJ will target and respond to particular local crime problems involving violence and gang activity, including drug-related crimes. To achieve this objective, DOJ will strive to reduce the level of violent crime by taking violent criminals and gangs off our streets through cooperative enforcement efforts with state and local law enforcement programs such as the FBI's Safe Streets Task Forces and DEA's Mobile Enforcement Teams (MET). DOJ will accomplish this objective dismantling 15 of the most dangerous gangs over a 5-year period. Cases will be selected based upon the multi-jurisdictional nature, violent activity, affiliation with a group identified in the National Gang Strategy, and/or degree of deleterious effect on the community. These cases are identified at the beginning of each fiscal year and always consist of the 30 most dangerous gangs fitting the criteria above. As cases and investigations are closed, new gangs meeting the established criteria are rotated in to maintain a base of 30., 149517=Strategies to Achieve the FY 2003/FY 2004 Goal: When businesses are found to be actively engaged in bid rigging, price fixing, and other market allocation schemes that negatively affect U.S. consumers and businesses (no matter where the illegal activity may be taking place), ATR pursues criminal investigations and prosecutions. ATR's Individual and Corporate Leniency Programs, revised in recent years for greater effectiveness, have proven critical in uncovering criminal antitrust violations. Increasingly, ATR is relying on formal international cooperation agreements or informal consultations with foreign antitrust authorities in pursuit of the companies and individuals involved, whether those companies come to our attention via the Leniency Programs, or through other channels. Greater time and resources are devoted to investigation-related travel and translation, given the increasingly international operating environment of the criminal conspiracies being encountered. In all instances, if ATR ultimately detects market collusion and successfully prosecutes, ATR may obtain criminal fines or injunctive relief., 133946=Strategies to Achieve the FY 2003/FY 2004 Goal: The Department will increase its efforts to address public corruption by (1) increasing Department-wide awareness of the significant harm caused by public corruption and the Department's interest in combating it; (2) making public corruption investigations and prosecutions a top priority throughout the Department; and (3) increasing the number and scope of training events for federal prosecutors and investigators focused on corruption cases., 132313=Public Benefit: The FBI vigorously pursues public corruption cases at all levels of public life, with almost 1,600 corruption probes pending at the end of FY 2002. Approximately 30 percent of public corruption convictions are typically associated with law enforcement corruption. These investigations are crucial to ceasing high-impact criminal conduct by the public servants entrusted with the safety and protection of American citizens and public property.}",
    "textBeforeTable": "Background/Program Objectives: The Department of Justice focuses its drug law enforcement efforts on reducing the availability of drugs by targeting the largest drug supply and money laundering networks for dismantlement of their entire infrastructure, from international supply and national transportation cells, to regional and local distribution organizations. The OCDETF program has been designated by the Attorney General as the centerpiece of his drug strategy. The program coordinates multi-agency and multi-region investigations, targeting the most serious drug trafficking threats. The OCDETF program functions through the efforts of the U.S. Attorneys; elements of the Department's Criminal Division; the investigative, intelligence, and support staffs of DEA, FBI, INS, and USMS; the investigative support of the Bureau of Alcohol, Tobacco and Firearms; the Internal Revenue Service; the U.S. Customs Service; the U.S. Coast Guard; as well as state and local law enforcement agencies. The goal of each OCDETF investigation is to determine connections to related investigations nationwide in order to identify and dismantle the entire structure of the drug trafficking organization (DTO). A major emphasis of OCDETF investigations is to disrupt financial dealings and dismantle the financial infrastructure that supports the DTO. As the Attorney General noted during a national conference in December 2001, \"Sophisticated drug trafficking organizations mirror the Fortune 500. They have similar business structures, distribution systems, and profitability - laundering an estimated $300 - $500 billion a year. Just as the Department seeks to dismantle terrorist operations by cutting",
    "textAfterTable": "DOJ's Reduction in the Supply of Drugs Available for Consumption Within the U.S. [DEA, OCDETF] FY 2002 = Baseline d Data Definition: Pure metric tons reflects the volume of drugs entering or produced in the U.S. prior to distribution and possible dilution. Data Collection and Storage: FY 2001 estimates were developed using intelligence data from several sources including but not limited to, the United Nations Office for Drug Control and Crime Prevention; ONDCP; the National Drug Intelligence Center; and the Federal-wide Drug Seizure System. FY 2002 seizure statistics were drawn from FDSS. In addition, a baseline estimate for the amount of illicit drugs consumed in the U.S. was developed by ONDCP based on data from the Substance Abuse and Mental Health Services Administration; National Institute of Justice's Arrestee Drug Abuse Monitoring Program; and the National Institute for Drug Abuse Monitoring the Future Survey. Data Validation and Verification: An executive-level interagency Steering Committee oversaw this effort and individual interagency working groups were formed to develop availability estimates for each drug type, to include cocaine, heroin, methamphetamine, and marijuana. The working groups met periodically to determine the most appropriate estimation model to be used for each of the drugs and to ensure that all applicable availability data was assessed for inclusion in the estimates. These drug specific working groups then presented their findings to the executive-level Steering Committee for approval.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}