{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "In terms of safety, it's not Fort Knox. If you have a bike, it'll probably get stolen, but I've never heard of anybody getting attacked.",
            "Tuition is cheap, the classes are challenging, and the people are nice. NMSU is a great value.",
            "Hang out with friends, go swimming, go see a game... There is plenty to do here.",
            "Taos diner is awful. The food is either dry, or flavorless, or both. It is quick, though.",
            "There are three dorms; Garcia, RGH, and Pinon. Garcia is loud, but otherwise nice, and Pinon is nice, but poorly lit and expensive. RGH is the cheapest and quietest, but it has communal bathrooms. Living here isn't awful, although it isn't the best.",
            "NMSU can be challenging at times, and if you let your guard down too much, it can bite you. Just keep up with studying and go to class.",
            "Don't be afraid to go in for tutoring.",
            "NMSU is a great university with very friendly staff. Before I got here I was very nervous about college, but now that I am here, I have calmed down. The campus is also very pretty."
        ]
    ],
    "pageTitle": "New Mexico State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/New-Mexico-State-University-Main-Campus/reviews?_escaped_fragment_=/show/78360",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 125,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00042-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906126303,
    "recordOffset": 906007888,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{663434=You have the option to choose from a meal plan which can let you go an infinite number of times to the main restaurant called TAOS. TAOS offers a variety of foods, and one of the best things is they have a special menu for vegans/vegetarians. They also have days where they have food themes from other places. One of the downsides, however, would have to be that they close pretty early, so if you wanted food at around 10:00 p.m. you would have to go to the food court, which doesn't have too much to offer in my opinion., 289598=Be sure to fill out the FAFSA and the Scholar Dollar$ Application before March 1st of the Fall you are going to attend to get any aid you may need., 501631=Apply before September of your senior year. Deadlines for institutional scholarships are Dec 1. Apply for housing as soon as possible. There are only 3 residence halls open to Freshman and they fill up fast. Don't take an excessive amount of classes(15+), your freshman year unless your major requires it for on time graduation. Fill out the Scholar Dollars application as soon as you receive your letter of admission. The sooner you apply the more scholarships you are eligible for., 231272=May be rought staying away from home, but with the great views from the dorms and friendly people in the area there is no need to feel blue., 373868=We have a luminaria walk every year on the first Sunday of December its beautiful. The campus is lined up with luminarias, and you get to see it all in a horse carriage, along with hot cocoa and singing Christmas songs., 679969=All of the professors I've had so far are extremely fun and understanding. Try to schedule classes when you know you will go. Do not register for a 7:30 AM class if you know that will not wake up., 4755=APPLY EARLY! My biggest fault was changing my mind at the last minute. I was only able to get loans because I didn't meet the March 1st deadline for scholarships. So always be on top of your deadlines. And have fun! The first few weeks I just studied. Keep a healthy balance of social activities as well as academics. I now do Zumba, have a part time job, and hang out with friends. Even though I've been studying less, my grades are still going up because I'm happy. I'm balanced and thus better able to stay focused., 688175=© 2015, Cappex.com, LLC, 455147=Greek life at New Mexico State university is one of the strongest and active group of students. Most greek are passionate about their chapter which makes every event a good time. Each chapter offers a different brotherhood/sisterhood where everyone can find their place. The Greek GPA average was higher than the undergradute GPA average for the 2012 Fall Semester.}",
    "textBeforeTable": "11/02/2009 Reviewer is A current student here. 25 out of 26 people found this review useful. 1 of 156 Katrina from Los Lunas, NM Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Great for these types of students Living here I've met so many different types of people. As long as you want to be in college, you'll love it here! We have everything from party girl sorotities to nerd clubs. There is definately something for everyone. The unique thing here is that everyone is so friendly! I was walking infront of my dorms and got invited to hookah by just walking by. Everyone is so nice here, and they accept everyone. My friends consist of everything from football players to goths. No one is ever left out here, and thats what I love about it! Tips for prospective students APPLY EARLY! My biggest fault was changing my mind at the last minute. I was only able to get loans because I didn't meet the March 1st deadline for scholarships. So always be on top of your deadlines. And have fun! The first few weeks I just studied. Keep a healthy balance of social activities as well as academics. I now do Zumba, have a part time job, and hang out with friends. Even though I've been studying less, my grades are still going up because I'm happy. I'm balanced and thus better able to stay focused. Bang for the buck New Mexico State is definately an affordable college. Tuition is practically nothing! I'm",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}