{
    "relation": [
        [
            "Model",
            "User Capacity",
            "Transaction Capacity",
            "Fingerprint Technology",
            "Matching Mode",
            "Identification Speed (Scanning + Matching)",
            "Communications",
            "Access Control",
            "Price",
            ""
        ],
        [
            "x628-C Biometric Fingerprint Reader",
            "1 500",
            "50 000 records",
            "Simple",
            "1:1 or 1:N (fingerprint only; ID + fingerprint; ID + code)",
            "<= 2 sec",
            "TCP/IP; RS232; RS485",
            "",
            "$629.99 $330",
            "Buy Now!"
        ],
        [
            "U300C Biometric Fingerprint Reader",
            "1 500",
            "50 000 records",
            "ZK optical sensor",
            "1:1 or 1:N (fingerprint only; ID + fingerprint; ID + code)",
            "<= 2 sec",
            "TCP/IP; RS232; RS485; USB-flash drive",
            "",
            "$845.99 $340",
            "Buy Now!"
        ],
        [
            "US10C Fingerprint Reader",
            "2 800",
            "50 000 records",
            "Rugged ZK Optical sensor",
            "1:1 or 1:N (fingerprint only; ID + fingerprint; ID + code)",
            "<= 2 sec",
            "TCP/IP, USB Drive",
            "",
            "$869.99 $355",
            "Buy Now!"
        ],
        [
            "S900 Biometric Fingerprint Reader",
            "1500",
            "30 000 records",
            "Rugged scratch-resistant optical sensor",
            "1:1 or 1:N up to 1500 templates",
            "<= 2 sec",
            "TCP/IP (Wireless Optional); RS232; RS485, USB Drive",
            "",
            "$1399.99 $695",
            "Buy Now!"
        ],
        [
            "Microsoft USB Fingerprint Reader",
            "needs a computer to operate",
            "needs a computer to operate records",
            "U.are.U optical sensor",
            "1:1 or 1:N (fingerprint only)",
            "<= 2 sec",
            "USB",
            "",
            "$129.99 $98.95",
            "Buy Now!"
        ]
    ],
    "pageTitle": "Employee Time Attendance Management with Biometric Handreaders from PayPunch",
    "title": "",
    "url": "http://www.paypunch.com/biometric%2Dfingerprint%2Dreaders/",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 644930086,
    "recordOffset": 644916506,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Fingerprint Device Price List and Comparison Chart: Price: $129.99 On Sale: $98.95 Buy Online or Call 1-888-777-0388 to Order! USB connection U.are.U Sensor for enhanced fingerprint identification FEATURES Microsoft USB Fingerprint Reader is a basic fingerprint reader for desktop-based time attendance management. Microsoft USB Fingerprint Reader uses the state-of-the-art American U.are.U optical sensor. Microsoft USB Fingerprint Reader Price: $1399.99 On Sale: $695 Buy Online or Call 1-888-777-0388 to Order! Relay contacts for bell Optional integrated Wifi also available Optional integrated prox or smart card reader Can retrieve data using USB flash drive (32Mb, provided) Advanced algorithm for reliability, precision and excellent matching speed, achieving matching time of <2 sec with 3000 fingerprint templates Rugged scratch-resistant optical sensor Color TFT screen with GUI Interface for ease of use FEATURES S900 is a premium fingerprint reader for attendance management. S900 uses the state-of-the-art Rugged optical sensor and is powered by Intel® processor. Together with an advanced algorithm, S900 is geared to provide unmatched reliability and matching speed. S900 Biometric Fingerprint Reader",
    "textAfterTable": "Other Compatible Devices Manufacturer Model Authentec AES, AFS Fingerprint Series BioLink U-Match Fingerprint Readers Digent FM, FD Fingerprint Series Digital Persona U.are.U compatible Fingerprint Readers Ethentica Ethenticator Fingerprint Readers Kingston Technology IdentiGuard Fingerprint Scanners LifeView FingerID Fingerprint Readers Microsoft Microsoft Fingerprint Reader NitGen FingKey, NDL, NAC Fingerprint Readers Precise Biometrics Precise Fingerprint Readers Sagem Morpho Morpho Fingerprint Readers Sony FUI Puppy Fingerprint Readers Suprema SFM, BEP, BES Fingerprint Readers Tacoma CanSecu Fingerprint Readers Tai-Hao F21, PB Fingerprint Readers Targus Defcon Authenticator Fingerprint Readers Amano Time Guardian FPT-40 Fingerprint Readers If you need a driver for a biometric device that is not on this list, please contact us!",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}