{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "212,252",
            "46,404",
            "31,313",
            "12,574",
            "7,426",
            "1,536",
            "366,055"
        ],
        [
            "Congregations",
            "39",
            "188",
            "73",
            "20",
            "16",
            "6",
            "-"
        ]
    ],
    "pageTitle": "Plainfield, Illinois (IL 60544) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Plainfield-Illinois.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 363181660,
    "recordOffset": 363043183,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26767=Incorporated on 08/13/1877, 8000=According to our research of Illinois and other state lists there were 23 registered sex offenders living in Plainfield, Illinois as of July 31, 2015. The ratio of number of residents in Plainfield to the number of sex offenders is 1,759 to 1. The number of registered sex offenders compared to the number of residents in this city is smaller than the state average.}",
    "TableContextTimeStampAfterTable": "{13169=On 8/28/1990, a category F5 (max. wind speeds 261-318 mph) tornado 8.6 miles away from the Plainfield village center killed 29 people and injured 350 people and caused between $50,000 and $500,000 in damages., 57693=2000 Presidential Elections Results, 173561=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 58265=2008 Presidential Elections Results, 58835=Graphs represent county-level data. Detailed 2008 Election Results, 39173=Sulfur Dioxide (SO2) [ppb] level in 2012 was 2.55. This is worse than average. Closest monitor was 6.7 miles away from the city center., 172234=Total of 743 patent applications in 2008-2015., 13488=On 6/13/1976, a category F4 (max. wind speeds 207-260 mph) tornado 11.1 miles away from the village center killed 2 people and injured 23 people and caused between $500,000 and $5,000,000 in damages., 57407=1996 Presidential Elections Results, 73825=4.95% of this county's 2011 resident taxpayers lived in other counties in 2010 ($49,546 average adjusted gross income), 54240=Educational Attainment (%) in 2013, 76024=5.51% of this county's 2010 resident taxpayers moved to other counties in 2011 ($48,984 average adjusted gross income), 57979=2004 Presidential Elections Results, 42111=Lead (Pb) [µg/m3] level in 2009 was 0.0167. This is about average. Closest monitor was 0.4 miles away from the city center., 38521=Air Quality Index (AQI) level in 2012 was 93.4. This is worse than average., 58551=2012 Presidential Elections Results, 41357=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 11.0. This is worse than average. Closest monitor was 7.7 miles away from the city center., 39903=Ozone [ppb] level in 2012 was 24.3. This is better than average. Closest monitor was 8.2 miles away from the city center., 40608=Particulate Matter (PM10) [µg/m3] level in 2010 was 20.6. This is about average. Closest monitor was 7.7 miles away from the city center., 54638=School Enrollment by Level of School (%) in 2013}",
    "textBeforeTable": "Religion statistics for Plainfield village (based on Will County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Electricity (3%) Utility gas (97%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 85 Will County: 1.27 / 10,000 pop. Illinois: 2.24 / 10,000 pop. Number of supercenters and club stores: 5 This county: 0.07 / 10,000 pop. State: 0.08 / 10,000 pop. Number of convenience stores (no gas): 32 Will County: 0.48 / 10,000 pop. Illinois: 0.75 / 10,000 pop. Number of convenience stores (with gas): 122 Will County: 1.82 / 10,000 pop. State: 2.61 / 10,000 pop. Number of full-service restaurants: 286 Here: 4.26 / 10,000 pop. State: 6.86 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}