{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-16927",
            "1904-AD23",
            "EERE-2014-BT-STD-0015"
        ]
    ],
    "pageTitle": "10 CFR Part 431, Subpart G - Commercial Water Heaters, Hot Water Supply Boilers and Unfired Hot Water Storage Tanks | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/10/part-431/subpart-G?qt-cfr_tabs=3",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00313-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 915903667,
    "recordOffset": 915868879,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1102=Title 10 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{112680=The U.S. Department of Energy (DOE) is requesting information to inform a potential rulemaking to consider new energy conservation standards for dedicated-purpose pool pumps. Pumps, which are already covered equipment under the Energy Policy and Conservation Act of 1975, as amended (EPCA), come in a variety of forms—including dedicated-purpose pool pumps. This RFI seeks to solicit information to help DOE determine the feasibility of developing energy conservation standards and an appropriate test procedure for this equipment. This RFI outlines the potential scope that could be involved in regulating dedicated-purpose pool pumps, possible industry-based testing methods that could be used to evaluate the efficiency of this equipment, and the types of information that would be needed in analyzing the potential for setting standards for this equipment. This RFI also solicits the public for information to help inform DOE's efforts in evaluating the prospect of regulating this equipment., 86071=On May 8, 2015, the U.S. Department of Energy (DOE) published in the Federal Register (80 FR 26475) a Request for Information (RFI) that requests information regarding potential energy efficiency standards for pool pumps established under the Energy Policy and Conservation Act. DOE published the RFI to solicit information to help DOE determine the feasibility of developing energy conservation standards and an appropriate test procedure for this equipment. The RFI outlines the potential scope that could be involved in regulating dedicated-purpose pool pumps, possible industry-based testing methods that could be used to evaluate the efficiency of this equipment, and the types of information that would be needed in analyzing the potential for setting standards for this equipment. It also solicits the public for information to help inform DOE's efforts in evaluating the prospect of regulating this equipment. The comment period for the RFI pertaining to the subject dedicated-purpose pool pumps was scheduled to end June 22, 2015. After receiving a request for additional time to comment, DOE has decided to reopen the comment period for the RFI pertaining to the potential energy efficiency standards for pool pumps until August 17, 2015., 37391=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes that the U.S. Department of Justice (DOJ) make a determination on the impact, if any, on the lessening of competition likely to result from a U.S. Department of Energy (DOE) proposed rule for energy conservation standards and that DOE publish the determination in the Federal Register . DOE published its final rule for energy conservation standards for walk-in coolers and freezers on June 3, 2014, and is today publishing DOJ's determination on such proposed rule., 32711=On May 16, 2012, the U.S. Department of Energy (DOE) published a final rule in the Federal Register that amended the energy conservation standards and test procedures for certain commercial heating, air-conditioning, and water-heating equipment. Due to a drafting error, there was a typographical error ( i.e., an incorrect symbol) for one equipment class of computer room air conditioners in a table to the applicable test procedure provision. This final rule rectifies this error., 168401=The U.S. Department of Energy (DOE) is initiating an effort to determine whether to amend the current energy conservation standards for residential clothes dryers. According to the Energy Policy and Conservation Act's 6-year review requirement, DOE must publish a notice of proposed rulemaking to propose amended standards for residential clothes dryers or a notice of determination that the existing standards do not need to be amended by August 24, 2017. This notice seeks to solicit information from the public to help DOE determine whether amended standards for residential clothes dryers would result in a significant amount of additional energy savings and whether those standards would be technologically feasible and economically justified., 62980=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes that the U.S. Department of Justice (DOJ) make a determination on the impact, if any, on the lessening of competition likely to result from a U.S. Department of Energy (DOE) proposed rule for energy conservation standards and that DOE publish the determination in the Federal Register . DOE published its final rule for energy conservation standards for commercial refrigeration equipment on March 28, 2014, and is publishing DOJ's November 25, 2013 determination on such proposed rule., 151366=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, sets forth a variety of provisions designed to improve energy efficiency. Part C of Title III, which for editorial reasons was re-designated as Part A-1 upon incorporation into the U.S. Code, establishes the “Energy Conservation Program for Certain Industrial Equipment.” The covered equipment includes pumps. In this document, DOE proposes to establish new energy conservation standards for pumps and announces a public meeting to receive comment on these proposed standards and associated analyses and results., 193124=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial warm air furnaces (CWAF). EPCA also requires that every six years, the U.S. Department of Energy (DOE) must consider amending its standards for specified types of commercial heating, air-conditioning, and water-heating equipment in order to determine whether more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant additional amount of energy. DOE has tentatively concluded that there is sufficient record evidence to support more-stringent standards, so DOE is proposing to amend the current energy conservation standards for CWAF. DOE also announces a public meeting to receive comment on these proposed standards and associated analyses and results., 157112=The U.S. Department of Energy (DOE or the Department) is giving notice that it intends to establish a negotiated rulemaking working group under the Appliance Standards and Rulemaking Federal Advisory Committee (ASRAC) in accordance with the Federal Advisory Committee Act (FACA) and the Negotiated Rulemaking Act (NRA) to negotiate regarding energy conservation standards for small, large, and very large, air-cooled commercial package air conditioners and heat pumps as well as commercial warm air furnaces. The purpose of the working group will be to discuss and, if possible, reach consensus regarding the development of energy conservation standards for small, large, and very large, air-cooled commercial package air conditioners and heat pumps as well as commercial warm air furnaces, as authorized by the Energy Policy and Conservation Act (EPCA) of 1975, as amended. The working group will consist of representatives of parties having a defined stake in the outcome of the energy conservation standards, and will consult as appropriate with a range of experts on technical issues. The working group is expected to negotiate a final term sheet regarding energy conservation standards for the aforementioned equipment by Monday, June 15, 2015. The final term sheet will be presented to ASRAC at an open meeting for their deliberation and decision on whether to pass it on as a formal recommendation to DOE., 103046=On April 14, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) that proposes mathematical conversion factors for converting from the current efficiency metrics ( i.e., energy factor for residential water heaters, and thermal efficiency and standby loss for commercial water heaters) to the uniform efficiency descriptor ( i.e., uniform energy factor metric). The comment period for the NOPR pertaining to the test procedures for water heaters was scheduled to end May 14, 2015. After receiving a request for additional time to comment for stakeholders, DOE is reopening the comment period for the NOPR for the Conversion Factor for Test Procedures for Consumer and Certain Commercial Water Heaters to June 15, 2015. Additionally, at the request of stakeholders, DOE is announcing a public meeting to discuss the conversion factors for consumer and commercial water heaters., 162825=The U.S. Department of Energy (DOE) proposes to establish a new test procedure for pumps. Specifically, DOE is proposing a test method for measuring the hydraulic power, shaft power, and electric input power of pumps, inclusive of electric motors and any continuous or non-continuous controls. The proposal, if adopted, would incorporate by reference the test procedure from the Hydraulic Institute (HI)—Standard 40.6-2014, “Methods for Rotodynamic Pump Efficiency Testing.” The proposed test procedure would be used to determine the constant load pump energy index (PEI CL ) for pumps sold without continuous or non-continuous controls or the variable load pump energy index (PEI VL ) for pumps sold with continuous or non-continuous controls. The PEI CL and PEI VL describe the power consumption of the rated pump, inclusive of an electric motor and, if applicable, any integrated continuous or non-continuous controls, normalized with respect to the performance of a minimally compliant pump for each pump basic model. The proposal reflects certain recommendations made by a stakeholder Working Group for pumps established under the Appliance Standards Rulemaking Federal Advisory Committee (ASRAC). DOE is also announcing a public meeting to discuss and receive comments on issues presented in this notice of proposed rulemaking (NOPR)., 27778=On June 3, 2014, the U.S. Department of Energy (DOE) issued a final rule adopting conservation standards for some classes of walk-in cooler and walk-in freezer components. The final rule was published with typographical errors to some of the reported values. DOE is providing corrections to address these errors. Neither the errors nor the corrections in this document affect the substance of the rulemaking or any of the conclusions reached in support of the final rule., 52358=Title 10 published on 2015-01-01, 122758=The U.S. Department of Energy (DOE) has completed a provisional analysis of the potential economic impacts and energy savings that could result from promulgating an energy conservation standard for commercial and industrial fans and blowers. This analysis incorporates information and comments received after the completion of an analysis presented in a notice of data availability (NODA) published in December 2014. At this time, DOE is not proposing an energy conservation standard for commercial and industrial fans and blowers. This analysis may be used in support of the Appliance Standards Federal Rulemaking Advisory Committee (ASRAC) commercial and industrial fans working group negotiations to develop a recommendation for regulating commercial and industrial fans. DOE encourages stakeholders to provide any additional data or information that may improve the analysis and to present comments submitted to this NODA and to the NODA published in December 2014 to the working group., 22473=On March 13, 2014, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedures for packaged terminal air conditioners (PTACs) and packaged terminal heat pumps (PTHPs). That NOPR serves as the basis for this final rule regarding the test method for PTACs and PTHPs. The amendments adopted here do not affect measured energy use. These changes incorporate by reference certain sections of the latest versions of industry test procedures AHRI Standard 310/380-2014, ANSI/ASHRAE Standard 16-1983 (RA 2014), ANSI/ASHRAE Standard 37-2009, and ANSI/ASHRAE Standard 58-1986 (RA 2014), and specify additional testing provisions that must be followed including an optional break-in period, require that cooling capacity tests be conducted using electricity measuring instruments accurate to +/− 0.5% of reading, explicitly require that wall sleeves be sealed, allow for the pre-filling of the condensate drain pan, and require testing with 14-inch deep wall sleeves and the filter option most representative of a typical installation., 15744=The U.S. Department of Energy (DOE) is amending its energy conservation standards for small three-phase commercial air-cooled air conditioners (single package only) and heat pumps (single package and split system) less than 65,000 Btu/h; water-source heat pumps; and commercial oil-fired storage water heaters. Pursuant to the Energy Policy and Conservation Act of 1975 (EPCA), as amended, DOE must assess whether the uniform national standards for these covered equipment need to be updated each time the corresponding industry standard—the American National Standards Institute (ANSI)/American Society of Heating, Refrigerating, and Air-Conditioning Engineers (ASHRAE)/Illuminating Engineering Society of North America (IESNA) Standard 90.1 (ASHRAE Standard 90.1)—is amended, which most recently occurred on October 9, 2013. Under EPCA, DOE may only adopt more stringent standards if there is clear and convincing evidence showing that more stringent amended standards would be technologically feasible and economically justified, and would save a significant additional amount of energy. The levels DOE is adopting are the same as the efficiency levels specified in ASHRAE Standard 90.1-2013. DOE has determined that the ASHRAE Standard 90.1-2013 efficiency levels for the equipment types listed above are more stringent than existing Federal energy conservation standards and will result in economic and energy savings compared existing energy conservation standards. Furthermore, DOE has concluded that clear and convincing evidence does not exist that would justify more-stringent standard levels than the efficiency levels in ASHRAE Standard 90.1-2013 for any of the equipment classes. DOE has also determined that the standards for small three-phase commercial air-cooled air conditioners (split system) do not need to be amended. DOE is also updating the current Federal test procedure for commercial warm-air furnaces to incorporate by reference the most current version of the American National Standards Institute (ANSI) Z21.47, Gas-fired central furnaces, specified in ASHRAE Standard 90.1, and the most current version of ASHRAE 103, Method of Testing for Annual Fuel Utilization Efficiency of Residential Central Furnaces and Boilers., 3732=On August 11, 2014, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedure for refrigerated bottled or canned beverage vending machines (beverage vending machines or BVMs). That proposed rulemaking serves as the basis for the final rule. In this final rule, DOE is reorganizing its test procedure for beverage vending machines into an Appendix A, which will be mandatory for equipment testing beginning 180 days after the final rule is published in the Federal Register, and an Appendix B, which will be mandatory for equipment testing to demonstrate compliance with any amended energy conservation standards arising out of DOE's ongoing BVM energy conservation standards rulemaking. Specifically, Appendix A includes amendments that update the referenced test method to ANSI/ASHRAE Standard 32.1-2010, eliminate the requirement to test at the 90 °F ambient test condition, establish a provision for testing at the lowest application product temperature, and adopt several amendments and clarifications to the DOE test procedure to improve the repeatability and remove ambiguity from the current BVM test procedure, as established by DOE in the 2006 BVM test procedure final rule. Appendix B contains all the amendments included in Appendix A and, in addition, incorporates provisions to account for the impact of low power modes on measured daily energy consumption (DEC). Finally, DOE is adopting in this final rule several clarifications regarding the certification and reporting requirements for beverage vending machines., 42289=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including automatic commercial icemakers (ACIM). EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting more-stringent energy conservation standards for some classes of automatic commercial ice makers as well as establishing energy conservation standards for other classes of automatic commercial ice makers. It has determined that the amended energy conservation standards for these products would result in significant conservation of energy, and are technologically feasible and economically justified., 208423=On December 10, 2014, the Department of Energy (DOE) published a notice of data availability (NODA) which presented a provisional analysis that estimates the potential economic impacts and energy savings that could result from promulgating a regulatory energy conservation standard for commercial and industrial fans and blowers. DOE did not propose any energy conservation standard for commercial and industrial fans and blowers. However, DOE published its analysis and the underlying assumptions and calculations, which may ultimately support a proposed standard, for stakeholder review. In response to requests by stakeholders, the comment period for the NODA is being extended to February 25, 2015., 81038=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial prerinse spray valves (CPSVs). EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this notice, DOE proposes amended energy conservation standards for commercial prerinse spray valves. The notice also announces a public meeting to receive comment on these proposed standards and associated analyses and results., 127977=On April 2, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) and public meeting for Energy Conservation Program: Energy Conservation Standards for Pumps. This document corrects the terms in one of the equations., 187838=On October 21, 2014, the U.S. Department of Energy (DOE) published a notice of proposed determination (NOPD) regarding energy conservation standards for high-intensity discharge (HID) lamps in the Federal Register . This notice tentatively determined that potential standards for three subcategories of HID lamps are either not technologically feasible or not economically justified. On December 22, 2014, DOE received a joint comment from the Appliance Standards Awareness Project (ASAP), Northwest Energy Efficiency Alliance (NEEA), the American Council for an Energy-Efficient Economy (ACEEE), and the Natural Resources Defense Council (NRDC) (Joint Comment), opposing DOE's proposed determination. This document announces a reopening of the public comment period for submitting comments and data in response to the Joint Comment. The comment period is extended to March 6, 2015., 9701=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including packaged terminal air conditioner (PTAC) and packaged terminal heat pump (PTHP) equipment. EPCA requires the U.S. Department of Energy (DOE) to determine whether more-stringent standards for PTACs and PTHPs would be technologically feasible and economically justified, and would save a significant amount of energy. In this final rule, DOE is adopting amended energy conservation standards for PTACs equivalent to the PTAC standards in American National Standards Institute (ANSI)/American Society of Heating, Refrigerating, and Air-Conditioning Engineers (ASHRAE)/Illuminating Engineering Society (IES) Standard 90.1-2013. DOE is not amending the current energy conservation standards for PTHPs, which are already equivalent to the PTHP standards in ANSI/ASHRAE/IES Standard 90.1-2013. DOE has determined that adoption of PTAC and PTHP standards more stringent than ANSI/ASHRAE/IES Standard 90.1-2013 is not economically justified., 144920=As required by the Energy Policy and Conservation Act of 1975 (EPCA), as amended, the U.S. Department of Energy (DOE) proposes to establish a mathematical conversion factor for the purpose of translating efficiency ratings for water heaters under the test method currently in effect to the ratings under the amended test method promulgated by DOE in a final rule published on July 11, 2014 (hereinafter referred to as the “the July 2014 final rule”). Compliance with the amended test procedure is required beginning on the later of: one year after the publication of a final rule that establishes a mathematical conversion factor, or December 31, 2015. This rulemaking document proposes a mathematical conversion factor which may be used to convert the existing efficiency ratings under the current Federal test procedure to efficiency ratings under the test procedure adopted in the July 2014 final rule for water heater basic models manufactured, tested and certified prior to the compliance date of the amended test procedure. The amended test procedure applies to all covered consumer water heaters and the covered commercial water heating equipment with residential applications defined in the July 2014 final rule as a “residential-duty commercial water heater.” In addition, this document proposes amendments to the minimum energy conservation standards for consumer water heaters and residential-duty commercial water heaters to account for the impact of the new metric, but does not alter the stringency of the existing energy conservation standards. While DOE has not planned a public meeting to discuss this proposal, DOE is willing to consider a request to hold a meeting., 214023=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including several classes of commercial heating, air-conditioning, and water-heating equipment. EPCA also requires that each time the American Society of Heating, Refrigerating and Air-Conditioning Engineers (ASHRAE) Standard 90.1 is amended with respect to the standard levels or design requirements applicable to that equipment, the U.S. Department of Energy (DOE) must adopt amended uniform national standards for this equipment equivalent to those in ASHRAE Standard 90.1, unless DOE determines that there is clear and convincing evidence showing that more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant additional amount of energy. ASHRAE most recently amended Standard 90.1 on October 9, 2013. Based upon its analysis of the energy savings potential of amended energy conservation standards and the lack of clear and convincing evidence to support more-stringent standards, DOE is proposing to adopt the amended standards in ASHRAE Standard 90.1 for: Small three-phase commercial air-cooled air conditioners (single package only) and heat pumps (single package and split system) less than 65,000 Btu/h; water-source heat pumps; and commercial oil-fired storage water heaters. DOE is also making a proposed determination that the standards for small three-phase commercial air-cooled air conditioners (split system) do not need to be amended. Finally, DOE is proposing updates to the current Federal test procedures to incorporate by reference the most current version of the American National Standards Institute (ANSI) Z21.47, Gas-fired central furnaces, specified in ASHRAE Standard 90.1 applicable to commercial warm-air furnaces, and to the most current version of ASHRAE 103, Method of Testing for Annual Fuel Utilization Efficiency of Residential Central Furnaces and Boilers. This document also announces a public meeting to receive comment on these proposed standards and associated analyses and results, as well as the proposed test procedure provisions., 47378=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes that the U.S. Department of Justice (DOJ) make a determination on the impact, if any, on the lessening of competition likely to result from a U.S. Department of Energy's (DOE) proposed rule for energy conservation standards and that DOE publish the determination in the Federal Register . DOE published its final rule for energy conservation standards for commercial clothes washers on December 15, 2014, and is publishing the determination that DOJ made on the proposed rule., 132064=On April 1, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking and public meeting for Energy Conservation Program: Test Procedure for Pumps. This document corrects terms in four equations.}",
    "lastModified": "Tue, 04 Aug 2015 12:58:57 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 45758 - Energy Conservation Program: Test Procedure for Refrigerated Bottled or Canned Beverage Vending Machines 2015-07-31; vol. 80 # 147 - Friday, July 31, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 10. Title 10 published on 2015-01-01. 69 FR 61983, Oct. 21, 2004, unless otherwise noted. Source: § 431.110 — Energy conservation standards and their effective dates. Energy Conservation Standards § 431.107 — Uniform test method for the measurement of energy efficiency of commercial heat pump water heaters [Reserved]",
    "textAfterTable": "DEPARTMENT OF ENERGY, Office of Energy Efficiency and Renewable Energy Final rule. The effective date of this rule is August 31, 2015. Compliance with Appendix A to subpart Q of 10 CFR part 431 will be mandatory for representations made on or after January 27, 2016. Compliance with Appendix B to subpart Q of 10 CFR part 431 will be mandatory for representations made on or after the compliance date of any amended energy conservation standards. (Docket No. EERE-2013-BT-STD-0022). DOE will publish a document in the Federal Register announcing the compliance date for Appendix B to subpart Q of 10 CFR part 431. The incorporation by reference of certain publications listed in this rule was approved by the Director of the Federal Register as of August 31, 2015. 10 CFR Parts 429 and 431 Summary On August 11, 2014, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedure for refrigerated bottled or canned beverage vending machines (beverage vending machines or BVMs). That proposed rulemaking serves as the basis for the final rule. In this final rule, DOE is reorganizing its test procedure for beverage vending machines into an Appendix A, which will be mandatory for equipment testing beginning 180 days after the final rule is published in the Federal Register, and an Appendix B,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}