{
    "relation": [
        [
            "Team",
            "12. Gillingham",
            "13. Millwall",
            "14. Oldham",
            "15. Peterborough",
            "16. Port Vale",
            "17. Rochdale",
            "18. Scunthorpe"
        ],
        [
            "P",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "W",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "D",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "L",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "GD",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Pts",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Peterborough United - The Posh Weekly - 12-June-2013",
    "title": "",
    "url": "http://www.peterborough.vitalfootball.co.uk/sitepage.asp?a=321639",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00106-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 649723763,
    "recordOffset": 649698578,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{39725=Seats are currently on sale by Posh within their Club 75 lounge for next season. Club 75 allows you to watch the game in the comfort of a pitch-view restaurant and enjoy some hospitality. Club 75 guests receive a three-course meal, half-time refreshments, a match day programme for each guest, team-sheets, seating inside and outside, access to the Executive Bar, reserved car parking and the chance to watch Premier League football on the large projector screen. It is a unique way for guests to experience a match day at London Road. You can purchase a Club 75 seat for single matches or for the whole campaign. To find out more: \u0095 Email: commercial@theposh.com \u0095 Telephone: 01733 563947, 11615=Time: 4:43PM, 38049=It`s all been very quiet at Posh with no noises being made which is very unusual as there are normally plenty of rumours doing the rounds. It is believed Posh have accepted a bid for one of their unwanted strikers though but no official confirmation has been forthcoming from the club as yet. There has also been no further movement on the Jack Payne transfer and it looks increasingly likely that Posh will miss out on their number one target!! The Gillingham Chairman is now demanding a large fee for him and now Posh have to abide by the 60% rule in terms of playing budget, it \"makes life very difficult\" according to Posh Chairman Darragh MacAnthony! Fulham manager Martin Jol has been surprised at the price tag put on the head of striker Dwight Gayle. It is rumoured that Posh have knocked back a £3 million bid from the Cottagers for the striker who is also fancied by Aston Villa and QPR. Mark Little will depart at the end of June following the end of his contract while George Boyd and Jonson Clarke-Harris have both already moved on to other clubs. Posh currently have 6 players on the transfer list; all of who have a price tag on their head. The six players are: Gaby Zakuani, Tommy Rowe, Tyrone Barnett, Emile Sinclair, Danny Kearns and Nicky Ajose., 35866=The third home pre-season friendly has yet to be announced but, as mentioned above, the tour of Ireland has finally been announced. The confirmed home pre-season matches are: Saturday, 13th July - QPR Monday, 29th July - Hull City, 11660=Date:Wednesday June 12 2013, 36395=Posh`s first ever pre-season tour of Ireland under the ownership of Darragh MacAnthony takes place during the first week of July. The tour will be based in Dublin where Posh will play the Dublin-based teams Shelbourne and UCD.}",
    "textBeforeTable": "League Results (view all) //--> document.write(''); } window.adgroupid = Math.round(Math.random() * 1000); if (window.adgroupid == undefined) { Forgotten details? Need to Register? Password: Username:",
    "textAfterTable": "0 18. Scunthorpe 0 0 0 0 0 0 Peterborough United Fixtures (view all) Rochdale (a) Aug 8 2015 3:00PM Sky Bet League One Crawley Town (H) Aug 11 2015 7:45PM Capital One Cup Colchester United (H) Aug 15 2015 3:00PM Sky Bet League One Sheffield United (H) Aug 18 2015 7:30PM Sky Bet League One Burton Albion (a) Aug 22 2015 3:00PM Sky Bet League One Gillingham (H) Aug 29 2015 3:00PM Sky Bet League One See all fixtures Report fixture change ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}