{
    "relation": [
        [
            "Ladder Model",
            "6' Fixed Plank",
            "6' - 9' Telescoping Plank",
            "8' - 13' Telescoping Plank",
            "10' - 16' Telescoping Plank"
        ],
        [
            "Storage Height",
            "",
            "",
            "",
            ""
        ],
        [
            "Stepladder Height",
            "-",
            "6' - 9'",
            "8' - 13'",
            "10' - 16'"
        ],
        [
            "Retail Price",
            "$121.94",
            "-",
            "-",
            "-"
        ],
        [
            "Sale Price",
            "$99.99",
            "$237.98",
            "$270.00",
            "$290.00"
        ],
        [
            "In Stock?",
            "Yes",
            "$178.00",
            "$202.00",
            "$217.00"
        ],
        [
            "",
            "Add to Cart",
            "Yes",
            "Yes",
            "Yes"
        ],
        [
            "",
            "",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart"
        ]
    ],
    "pageTitle": "Little Giant Ladders - eLadders.com",
    "title": "",
    "url": "http://www.eladders.com/little-giant.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00046-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 432477181,
    "recordOffset": 432460787,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3353=Please don't confuse the patented telescopic design of the Little Giant Ladder System with the cheaper 6-hinged folding ladders which have flooded the market recently. As you will see, these ladders are totally different in design and function. Folding ladders are unable to adjust in height as our telescopic Little Giant Ladder System can easily do. Relying on 3 pairs of hinges, the competition merely bends into a number of contorted positions in an attempt to mimic our patented design. Also beware of the copy-cat ladders that have entered the market that claim to be similar to the Little Giant Ladder System. The Little Giant Ladder System is quality, Designed and Engineered in the USA since the 1970's.! The Little Giant Ladder System is telescopically adjustable in one foot increments, both in the stepladder position and extension position, so you are not stuck with just one size of ladder. Pinched fingers are not a problem with Little Giant Ladder Systems, due to design and engineering measures incorporated into the ladder. Little Giant Type 1A ladders are tested at 1200 lbs. in every recommended ladder position, and they are available with the new Triple Lock Hinge and Tip and Glide Wheels. In the stepladder position, there are rungs on both sides of the ladder, so it can be used as a 2-man step ladder. In fact, it meets or exceeds OSHA's Type 1A, 300 lb rating for ladders, and it comes with a Lifetime warranty. There are 2 other weight ratings available: a 375lb Type 1AA Ultra Heavy Duty version, and a 250lb Type 1 heavy duty version. They function the same as the original 1A version, just in different weight ratings. Also just released are the new Little Giant Pro Series Ladder and the American Titan Ladder. They all meet ANSI 14.2 requirements for ladders. Fiberglass models are also available.}",
    "textBeforeTable": "Little Giant Parts Little Giant Ladder and Wing Enterprises have created a ladder revolution in design and ladder solutions. Think of the time saved by taking only one ladder to a job site, and knowing you will have the right size ladder with you. Think of the space saved around the home by having only one versatile ladder to use and store instead of 3 or 4 ordinary ones. And Little Giant Ladder Systems demonstrates professionalism for businesses. If you show up to a job site with cheap or worn out ladders, what does that say to your customers? But if you show up with a Little Giant Ladder System, it shows professionalism and demonstrates a sense of quality attributed to your work. And at home, are you reluctant to pull out that old rickety ladder to do some work, and hope the ladder holds up without collapsing? Wouldn't it be nice to have one good quality ladder around to take care of all your ladder needs? The Little Giant Ladder System is that ladder. Little Giant Ladders are designed and engineered in the USA and are shipped using Fast and Free shipping in the contiguous US! Average delivery time is 1-2 weeks. Please don't confuse the patented telescopic design of the Little Giant Ladder System with the cheaper 6-hinged folding ladders which have flooded the market recently. As you will",
    "textAfterTable": "$39.00 $39.00 Yes Add to Cart Type 1A All Steel Hinge Lock Assembly - $39.00 $36.00 Yes Add to Cart Type 1A Palm Button - $17.00 $16.00 Yes Add to Cart Type 1A Snap Ring for Hinge Lock - $2.00 $2.00 Yes Add to Cart Type 1A (Model 13) Label Kit - $10.00 $0.00 Yes Add to Cart Type 1A (Model 17) Label Kit - $10.00 $0.00 Yes Add to Cart Type 1A (Model 22) Label Kit - $10.00 $0.00 Yes Add to Cart Type",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}