{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Becker college, both Worcester and Leicester, are staffed with campus police, that are there at all times.",
            "Becker has many different sport options, boys and girls, and it also has a lot of different clubs.",
            "It is a great school for people in the gaming or veterinary studies.",
            "I play sports and for the most part we have to buy our own warm ups and I don't think we should when we pay so much to attend the college.",
            "Ii play softball and volleyball and hang out with friends.",
            "The food isn't that bad and the dining services are good.",
            "I don't live on campus.",
            "All of the professors I have had so far are pretty good, and don't get off track that often.",
            "I like Becker because of how small it is, and the classroom sizes. There are some things I don't like about it; I think it is to expensive and we pay so much and still have to pay for extras. The school is well known for veterinary studies."
        ]
    ],
    "pageTitle": "Becker College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Becker-College/reviews?_escaped_fragment_=/show/10495",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00033-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 903443587,
    "recordOffset": 903405973,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{150457=© 2015, Cappex.com, LLC, 15285=There are a few halls on the Leicester campus that have gained local and even national notoriety. Lane hall and Winslow hall which are both current resident halls have been rumored to be haunted. Winslow at one point was a funeral parlor so there have been accounts of strange things happening from time to time. Also May house which was a residence hall is now closed and is recognized as a historical site as it was once a stop on the Underground Rail Road during the 1800's., 78308=We've been starting all sorts of new traditions here; to welcome the incoming freshmen we will have a ceremony during the fall semester; there is a bonfire at the beginning of the year; etc. On Leicester campus we have May House, which was part of the underground railroad.}",
    "textBeforeTable": "10/30/2010 Reviewer is A current student here. 8 out of 8 people found this review useful. 1 of 38 Stacy from Marlborough, MA Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Tips for prospective students You need to keep your grades up and work hard. Have fun!!!! Get scholarships Love what you are majoring for and work hard to get to your goal. Bang for the buck It is expensive to go here unless you get a scholarship or work study. So you want to keep your grades up as in A's and B's in school and you will get a big scholarship from them. So yes it is expensive but it is the best thing that you can ever pay for this college is just great. Am enjoying being here I love being here. The Leicester campus is beautiful and quiet it is where most of the sports teams are. The Worcester campus is louder more city like and you get to live in houses because it is in the middle of the neighborhood where it is located. This is a very nice college and it has all the majors that I wanted to go into. So that is a plus because there aren't many colleges that have both the vet tech program and the equestrian studies program. Am learning a lot I am learning a lot the teachers here are wonderful and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}