{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Moderately Cold",
            "Moderately Cold",
            "Moderately Hot",
            "Rainy",
            "Very Hot",
            "Rainy",
            "Rainy",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Pleasant",
            "Moderately Cold"
        ],
        [
            "Details",
            "January has mild cold weather. Days are pleasing while nights are breezy cold. It is one of the best seasons to visit Daman beaches. Sightseeingand thrilling water sports like parasailing, wind surfing, snorkeling and water skiing are enjoyable. Winter month is also a good time for bird watching. Also, be sure to carry some light warm clothes for your trip.",
            "Days are always sunny and pleasant; temperatures drop down during nights only. It is an ideal time for enjoying at the beach, sightseeing, church visits and taking up water sports like snorkeling, parasailing and water skiing. Carry some light woolen clothes for this season.",
            "Summer season begins in March. Climate becomes hot and dry during day time but nights are always relaxing. Summer month is very favorable for beach activities like swimming, beach walk and enjoying adventurous water sports. Sightseeing can also be enjoyed during this month.",
            "Days are comparatively sunny and warm, but the cool breeze of the Arabian Sea makes the climate very pleasant after sun set. Relaxing and walking on the beaches in the evenings are pretty wonderful activities of this period. Sightseeing and water sports like snorkeling, water skiing etc can also be enjoyed during summer month.",
            "Warmest month of the year and tourists generally avoid visiting during this month. So the hotels become cheaper and the place gets less crowd. Proper time for relaxing, since the Arabian sea breezes always make the climate pleasant after sun set.",
            "Monsoon arrives causing frequent rainfalls in most time of the month and the temperature drops down to a certain point. Those who enjoy rains can still visit the place. Being off-season, the hotels rates becomes lower and is a good time for budget holiday.",
            "Heavy rainfall occurs in July. This coastal area offers a unique charm in monsoon though it's not a preferable time for sightseeing activities. However, hotels rates and tour packages rates becomes lower in monsoon, which is ideal for a budget vacation.",
            "It may not be a best season but a visit to this coastal place is always worth, as every season offers its own splendid look. This period is not preferable for sightseeing but rain lovers can still enjoy their visits. Hotels also offer discounted rates during monsoon.",
            "Monsoon lasts till this month. The frequency of the rainfall also becomes less. If you are a monsoon lover, you can plan your trip. Besides, hotels also offer discounted rates during monsoon season, which is ideal for budget travelers.",
            "Post monsoon month always offers scenic beauty with most of the days accompanied by clear blue skies. The climate is pleasing and is perfect for beach walk, swimming, sightseeing and other outdoor activities.",
            "The temperate climate makes this coastal place suitable for all types of tourist activities. Days are pleasantly warm followed by chilly nights. It is the best time for sightseeing, enjoying at the beach and other outdoor activities. Water sports like snorkeling, water skiing, parasailing and wind surfing are also favorable.",
            "December offers mild cold weather. Days are pleasing while nights can be a bit cold and breezy. It is a perfectly enjoyable time for sightseeing, beach walk, church visits and other tourist activities. Water activities like snorkeling, water skiing, wind surfing etc can also be enjoyed in this month. Light warm clothes will be required during nights."
        ]
    ],
    "pageTitle": "DAMAN Weather, Temperature, Best Season, Daman Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Daman-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 603353791,
    "recordOffset": 603322619,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Daman Weather Home  ›  Destinations  ›  Daman and Diu  ›  Daman  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Oct - Apr Summer 18 to 37Â°C, Winter 10 to 32Â°C Best Season / Best time to visit Daman Daman has moderate climate all through the year. But the best time to visit is from October to April. Winters (November to February) are the pleasant season with cool climate of temperature between 32 °C and 10 °C. The pleasing weather makes it perfect for sightseeing, outings, water sports and other tourist activities. Summers (March to May) are little hot in the range of 26 °C to 37 °C. May is the hottest month, but the sea breeze makes the atmosphere humid and cool. During March and April, water sports and beach activities are favorable. Monsoons (June to September) offer heavy rains due to depressions in the Sea. Tourists typically avoid heavy rainy days. However, you can plan for a budget trip if you enjoy rainy travel. October to February is ideal for all sightseeing and outings. September to December are fishing seasons in the Daman Coast. This is the best time to experience the fishing activities of the fishermen community. March to May is good for outdoor activities. June to August is somewhat idle without many activities on the coast.",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}