{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Great for these types of students",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Well lit campuses that are patrolled.",
            "Traditional , non traditional, online.",
            "Half price or less tuition compared to all the state universities!",
            "MCC has a lot of student life options and cultural events. Also, since all of the locations are in Omaha, you have easy access to everything in the city.",
            "Basic cafes at most campuses. The South Omaha campus has an excellent culinary institute with an awesome cafeteria. That bumped the rating an extra star.",
            "Im not in the dorms. I haven't heard anything bad.",
            "Not an ivy league by any means, but the courses give you the foundational knowledge required to be successful in your degree field and competitive when entering other academic institutions.",
            "Study your basic comprehension skills before taking the mandatory assessments. You can save money by only taking credit courses in math, english, etc.",
            "MCC is a great option for busy professionals that need the flexibility of online, evening, and weekend classes. With affordable tuition, transfer agreements at most colleges and universities in Nebraska, you can get your bachelor's degree at nearly half the cost of attending most other schools."
        ]
    ],
    "pageTitle": "Metropolitan Community College Area Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Metropolitan-Community-College-Area/reviews?_escaped_fragment_=/show/69730",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 911090639,
    "recordOffset": 911050565,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{160174=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "05/20/2012 Reviewer is A current student here. 2 out of 2 people found this review useful. 1 of 40 Aubrie from Omaha, NE Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Tips for prospective students Have fun and study hard. In three sentences Metropolitan Community College is great for students starting out in college. The campus is very welcoming and it is very easy to make new friends. My experience so far at Metro has been so much fun that I wish I could extend my time as a student there. Login to rate or flag the reviews Nicholas from Omaha, NE 05/18/2011 Reviewer is A past student here. 2 of 40 Categories Comments Great for these types of students 1. People who work part-time 2. People who want to discover their true vocation 3. People who want to enrich their lives 4. Public, private, and home-schooled High Schooler's who want to get a year's worth of school done in a quarter. 5. Anyone with a willing attitude to learn and have fun doing it. Tips for prospective students 1. Although I did mention that the tuition is cheap, be wary of prices of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}