{
    "relation": [
        [
            "Pos",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21"
        ],
        [
            "Car Number",
            "10",
            "6.",
            "47",
            "27",
            "1J",
            "0z",
            "96",
            "72",
            "63",
            "88",
            "423",
            "6",
            "13",
            "73.",
            "M1",
            "24",
            "31G",
            "81",
            "36",
            "911",
            "75"
        ],
        [
            "Name",
            "Bud Perry",
            "Perry Davenport",
            "Brian Heeney",
            "Nyle Weiler",
            "Jason Parish",
            "Chris Ozanich",
            "Justin Kazmar",
            "Dan Loughan",
            "Tim Easey",
            "Richard LaPratt",
            "Corey Miechiels",
            "Matthew Schindewolf",
            "Ken Buchner",
            "Earl Miles",
            "Bill Butler",
            "Aaron Katz",
            "Richard Gokee Sr",
            "Tracey Heeney",
            "Tom Williams",
            "Richard Maurer",
            "James Wells"
        ],
        [
            "Behind Leader",
            "",
            "0.748",
            "1.484",
            "1.649",
            "2.054",
            "2.403",
            "2.595",
            "2.900",
            "3.580",
            "3.841",
            "4.639",
            "5.159",
            "5.574",
            "5.921",
            "7.414",
            "7.712",
            "8.315",
            "--2 Laps--",
            "--18 Laps--",
            "--19 Laps--",
            "--31 Laps--"
        ],
        [
            "Gap",
            "",
            "0.748",
            "0.736",
            "0.165",
            "0.405",
            "0.349",
            "0.192",
            "0.305",
            "0.680",
            "0.261",
            "0.798",
            "0.520",
            "0.415",
            "0.347",
            "1.493",
            "0.298",
            "0.603",
            "--2 Laps--",
            "--16 Laps--",
            "--1 Lap--",
            "--12 Laps--"
        ]
    ],
    "pageTitle": "Spartan Speedway 2005 Archive Race Recap",
    "title": "",
    "url": "http://spartanspeedway.com/numbers/2005recap.php?id=527",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 229493925,
    "recordOffset": 229477969,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1330=Jimmy Gallagher and Chris Place brought the field of Andrews Chevrolet Super Late Models down for the start of their 40-lap feature. Gallagher jumped into the lead, while the remainder of the field was still side-by-side at the completion of lap one. Gallagher and Place pulled away from the field, as Bob Bauer, Jeff Finley, John Dunivon, and Jon McNett battled for position. Lap 10 saw Finley get around Place, with Bauer following him through with Dave Stehouwer hot on his heels. Stehouwer tried the outside groove around Bauer but couldn’t make it stick on lap 15, as Gallagher was running away to hide. Finley was trying to reel him in, as lapped traffic became a factor on lap 25, with the top ten running away from the field. Stehouwer executed a pass around Bauer for third as caution came out on lap 32, and on the restart, Gallagher, Finley, and Stehouwer pulled away in an eight-lap dash for the cash. At the line, it was Gallagher, Finley, Stehouwer, and Place, with John Ledwidge nipping McNett at the line for fifth. Heat winners were George Rangel, and John Dunivon. The 35-lap feature for the MI Army National Guard MI Modifieds lined up with Bud Perry and Perry Davenport sitting on the pole. Perry led lap one, with Davenport, Brian Heeney, Nyle Weiler, Jason Parish, and Tim Easey all running single file behind him. Chris Ozanich and fast qualifier, Dan Loughan, jumped to the high side and went to work from the middle of the field. Perry and Davenport put some daylight between themselves and the rest of the field, as Parish looked to the outside of Weiler on lap 13. Caution on lap 16 closed the field, and on the restart, Perry again pulled away leaving second through tenth running nose to tail. Lap 20 had Justin Kazmar and Ozanich looking to break into the top five, as Perry streaked away from Davenport, who distanced himself from Heeney and Weiler, leaving Parish to fight off Kazmar and Ozanich for fifth. Caution bunched up the field on lap 31, and Perry once again ran away from Davenport on the restart. The checkered flag flew as Perry crossed the line, followed by Davenport, Heeney, Weiler, and Parish. Aaron Katz, Perry, and Easey scored heat wins. Eighteen Performance Automotive Northwest Street Stocks made the field for their 25-lap feature. At the green, it was Don Zakrzewski shown as the lap one leader. Howard McDonough moved into first on lap two and was issued a speeding ticket on lap five. On lap eight, Damon Place looked to the inside of Brian Beckner for third, with Corey Davis, Bubber Patrick, and Dane Long coming along with him. Three-wide action on lap 10 brought Place into first. Place, Davis, B. Patrick, Nathan Moon, and Rob Patrick were sitting in the top five on lap 15, with fast qualifier, Dane Long, making his way up from the rear of the field, after a flat tire sent him to the pit. Long broke into the top five on lap 20 and challenged Davis for the second spot on lap 22. Place and Long battled door handle-to-door handle for first on lap 23, with Long making the pass to win the feature over Place, Davis, R. Patrick, and Mike Ammerman. Heat winners were Moon and Ammerman. The Q106 Pony Stock feature saw crazy three- and four-wide racing, and that was only the first lap! Russell Grandy jumped out to lead the first two laps, as Trei Deubel bolted through the middle of the field from sixteenth and was shown in second by lap three behind Jimmy Scavarda. Deubel made his way around Scavarda on lap seven, with TJ Conroy closing in on Scavarda. Lap 10 saw the “Onondaga Gang” going to work on each other, with Brent McCort having the advantage over Brian Passick II on lap 15. Deubel encountered lapped traffic on lap 15, lost momentum in turn four, gathered it back up, and scored another win in his division. Deubel, Passick II, Conroy, McCort, and George Wyers made up the top five at the line. Jason Brunn and Conroy tallied heat wins.}",
    "textBeforeTable": "Andrews Chevrolet Superlate Models Qualifying Results By: Michelle Sprague Jimmy Gallagher and Chris Place brought the field of Andrews Chevrolet Super Late Models down for the start of their 40-lap feature. Gallagher jumped into the lead, while the remainder of the field was still side-by-side at the completion of lap one. Gallagher and Place pulled away from the field, as Bob Bauer, Jeff Finley, John Dunivon, and Jon McNett battled for position. Lap 10 saw Finley get around Place, with Bauer following him through with Dave Stehouwer hot on his heels. Stehouwer tried the outside groove around Bauer but couldn’t make it stick on lap 15, as Gallagher was running away to hide. Finley was trying to reel him in, as lapped traffic became a factor on lap 25, with the top ten running away from the field. Stehouwer executed a pass around Bauer for third as caution came out on lap 32, and on the restart, Gallagher, Finley, and Stehouwer pulled away in an eight-lap dash for the cash. At the line, it was Gallagher, Finley, Stehouwer, and Place, with John Ledwidge nipping McNett at the line for fifth. Heat winners were George Rangel, and John Dunivon. The 35-lap feature for the MI Army National Guard MI Modifieds lined up with Bud Perry and Perry Davenport sitting on the pole. Perry",
    "textAfterTable": "Edward Hill 14.170 0.889 14.232 20 91 Leonard Cousino 14.240 0.959 14.269 21 45 Carl Sodman -.--- -.--- -.--- Michigan National Guard MMA Modifieds Pos Car Number Name Best Time Behind Leader 2nd Best Time 1 72 Dan Loughan 13.929 -.--- 14.030 2 96 Justin Kazmar 13.963 0.034 13.994 3 88 Richard LaPratt 13.989 0.060 14.164 4 1J Jason Parish 13.997 0.068 14.035 5 0z Chris Ozanich 14.001 0.072 14.059",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}