{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2012/12/07/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00085-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 709331567,
    "recordOffset": 709263102,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{55988=PHILLIP COOREY The NSW senator John Faulkner will push to reform the NSW Labor Party at its next state conference due next June, creating the potential for a messy brawl over internal party processes., 17347=Did the ancient Mayans know something we don't about December 21?}",
    "TableContextTimeStampAfterTable": "{261594=December 06 2012, 146111=Bruce Springsteen will tour Australia in 2013, no really., 238815=Poll closed 7 Dec, 2012, 122043=December 30 - 31: Now in its sixth year, Origin NYE is returning for WA punters., 249490=Hacka, Dec 6, 2012, 10:43PM, 248456=Gail Hargraves, Dec 6, 2012, 6:07PM, 121090=January 1 Attendees from last year will be elated to hear that Marquee is back for New Years Day in 2013., 120107=Entries close December 23 Enjoy the festival in supreme luxury., 243110=1348 views}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: It's the final episode of the season and Erinsborough's women are emptying their wombs in celebration. Neighbours What's on TV Tonight Win a chance to hit the course at the PGA Championship. Green envy? Competition Guided tours of Queensland's most infamous prison to kick off again. Boggo Road opens Behind bars Springsteen is coming to Australia, and the first stop is Brisbane. The Boss is coming back Springsteen tour We reveal who is most likely to make headlines next year.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}