{
    "relation": [
        [
            "Postage and handling",
            "US $3.99",
            "US $6.99",
            "US $19.99"
        ],
        [
            "Each additional item",
            "US $1.00",
            "Free",
            "Free"
        ],
        [
            "To",
            "United States",
            "United States",
            "United States"
        ],
        [
            "Service",
            "Standard Postage (USPS First Class Package®)",
            "Express Postage (USPS Priority Mail Flat Rate Envelope®)",
            "Express Postage (USPS Priority Mail Express Flat Rate Envelope®)"
        ],
        [
            "Delivery*",
            "On or before Sat. 08 Aug. to 20147",
            "On or before Sat. 08 Aug. to 20147",
            "Estimated by Thu. 6 Aug."
        ]
    ],
    "pageTitle": "ACB Palladium 1 Gram PD Precious Metal W COA 99 9 Solid Bullion Minted BAR | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/PD-Precious-Metal-1-GRAM-w-COA-99-9-PALLADIUM-SOLID-BULLION-MINTED-ACB-BAR/130882960076?hash=item1e793b7acc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00263-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 426635227,
    "recordOffset": 426589076,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Please enter five or nine numbers for the postcode. Please enter a valid postcode. Postcode: Select a valid country. There are 96 items available. Please enter a number less than or equal to 96. -Select- Albania American Samoa Andorra Anguilla Antigua and Barbuda Aruba Australia Bahamas Barbados Belarus Belgium Belize Bermuda British Virgin Islands Bulgaria Canada Cayman Islands Cook Islands Costa Rica Denmark Dominica Dominican Republic El Salvador Fiji Finland France French Polynesia Germany Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Haiti Honduras Iceland Ireland Italy Jamaica Jersey Kiribati Liechtenstein Luxembourg Macedonia Malta Marshall Islands Martinique Micronesia Moldova Monaco Montenegro",
    "textAfterTable": "* Estimated delivery dates- opens in a new window or tab include seller's handling time, origin ZIP Code, destination ZIP Code and time of acceptance and will depend on shipping service selected and receipt of cleared payment- opens in a new window or tab. Delivery times may vary, especially during peak periods. Return policy Item must be returned within Refund will be given as 60 days after the buyer receives it Money Back The buyer is responsible for return postage costs. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}