{
    "relation": [
        [
            "༺༻",
            "1.",
            "2.",
            "3.",
            "4."
        ],
        [
            "Archetype",
            "Child",
            "Victim",
            "Saboteur",
            "Prostitute"
        ],
        [
            "Description",
            "Longs to be light-hearted, innocent and expectant of the wonders of tomorrow. Has a playful quality at times and can bring out a parental quality in others to communicate. Will retreat after a disagreement.",
            "Does not take responsibility for her own well-being or happiness. Can bring out the need in you to develop self-esteem, stand up and take care of yourself.",
            "Runs away from opportunities and the sacred contract that can lead to happiness. Is frightened of life and good things, so turns away from them.",
            "Helps people face the parts of themselves that will negotiate their self-worth. Gives herself \"away\" too much to gain pleasures that don't contribute to her well-being."
        ]
    ],
    "pageTitle": "SpiritualWiki - Archetypen",
    "title": "",
    "url": "http://de.spiritualwiki.org/Wiki/Archetypen",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992201.62/warc/CC-MAIN-20150728002312-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62743399,
    "recordOffset": 62630015,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{248331=Roman: Stephen Vincent Benet, The Red Badge of Courage Märchen: Hans und die Bohnenranke, 1807 (englisches Märchen), 100755=Roman: Mark Twain [Samuel Langhorne Clemens] (1835-1910) US-amerikanischer Schriftsteller, Humorist,, 178627=Film: Stéphane Audran, Birgitte Federspiel und Bodil Kjer, Babbettes Fest, 1987, 25590=Drama: Harvey Fierstein, Torch Song Trilogy, 1982 Religion / Mythos: Isaak (Sohn des Abraham, den sein Vater in Gottes Auftrag opfern sollte), 225047=TV-Serie: My Friend Flicka; Lassie Roman: Arthur Conan Doyle, Figur Dr. Watson, The Adventures of Sherlock Holmes Drama: William Shakespeare (1564-1616) englischer Dramatiker, Bühnenschriftsteller, Lyriker, Schauspieler,, 210721=Roman: Henry Miller (1891-1980) US-amerikanischer Schriftsteller, Dramatiker, Stille Tage in Clichy, 1968 Religion / Mythos: Satyr (Geschöpf mit Ziegenschwanz, Flügel, Hufen und Hörner, jedoch einem menschlichen Oberkörper,, 95664=Drama: Christopher Marlowe, Doctor Faustus, 1592 [The Tragical History of Dr. Faustus] Religion / Mythos: Ochun (Orisha, Ehe und Mutterschaft, die sich gezwungen sah, sich zeitweilig als Prostituierte zu verdingen,, 21150=Film: Eriq Ebouaney, Lumumba, 14. Mai 2000, 75577=Film: Dustin Hoffman und Robert Redford, All the President's Men, 1974 [All the President's Men], 98048=Film: Jack Lemmon (*1925) US-amerikanischer Schauspieler, als Darsteller in den Filmen Das Appartement, 1960 (The Apartment); Manche mögen’s heiß'', 1959, 108764=Film: Glenda Jackson, Stevie, 1978, 246203=Roman: Charles Dickens (1812-1870) beliebtester englischer Romanschriftsteller des Viktorianischen Zeitalters,, 208302=Drama: Henrik Ibsen (1828-1906) norwegischer Theaterdirektor, Dichter, Bühnenschriftsteller, 106217=Roman: Georges Bernanos, Diary of a Country Priest, 1951 Drama: Bill C. Davis, Mass Appeal, 46091=Roman: Thomas Hughes, Tom Brown's School Days, 1857 Autobiograpie: Henry Adams, The Education of Henry Adams, 1907 Drama: George Bernard Shaw (1856-1950) irischer Politiker, Pazifist, Satiriker, Dramatiker, Nobelpreisträger in Literatur, 1925, Pygmalion, 1913 Religion / Mythos: Derwisch (Sufi-Bezeichnung für den Schüler eines Scheichs) (sufistisch-islamische Tradition), 160240=Film: Anthony Quinn, Alexis Sorbas, 1964 [Zorba the Greek], 133509=Film: Claude Laydu, Diary of a Country Priest, 1951, 221011=Roman: Margaret Mitchell, Vom Winde verweht, 1936, 122487=Film: Catherine Mouchet (*1959), Thérèse, 1986, 84496=Film: Sigourney Weaver als Hauptdarstellering in Alien 3, 1992 [Alien III], 78441=Film: Richard Dreyfuss, Zoff in Beverly Hills, 31. Januar 1986 (Down and Out in Beverly Hills), 23889=Film: Sean Connery, The Medicine Man, 1933, 40401=Roman: James Hilton, Auf Wiedersehen, Mr. Chips, US-amerikanischer Spielfilm von Sam Wood, 1939 [Goodbye, Mr. Chips] Drama: William Gibson, The Miracle Worker, 1957-1959 Märchen: Religion / Mythos: Sokrates (469-399 v. Chr.) (klassischer griechischer vorchristlicher Philosoph, der in Athens Forum lehrte., 42520=Film: Bette Davis, The Corn Is Green, 1942-1983, 69990=Roman: Hermann Hesse (1877-1962) deutsch-schweizerischer Dichter, Schriftsteller, Siddhartha, 1922, 182638=Film: Ellen Burstyn, Der starke Wille, 1980 [Resurrection], 27982=Film: Hilary Swank, Boys Don’t Cry, 1999, 115140=Film: John Boles, A Message to Garcia, 1936, 14999=TV-Serie: Buffy – Im Bann der Dämonen, 1997-2003 [Buffy the Vampire Slayer],, 65870=Film: William Powell, Mein Mann Godfrey, 1936 [My Man Godfrey], 62089=Film: Wolfen, 1981 (Wolfen), 240276=Roman: Antoine de Saint-Exupéry (1900-1944) französischer Schriftsteller, Flieger, Der kleine Prinz Märchen: Astrid Lindgren, Pippi Langstrumpf, 1944-1945, 170721=Roman: Herman Melville, Kapitän Starry Vere in Die Verdammten der Meere, 1962 [Billy Budd, Foretopman, 1924], 268108=Märchen: L. Frank Baum, Figur Glinda in Der Zauberer von Oz, 1900 (verfilmt als Das zauberhafte Land, 1939) Religion / Mythos: Angiris (Abkömmlinge des Feuergottes Agni, Engel, die menschliche Opferungen verwalten und, 59678=Film: Victor Mature (1913-1999), The Robe, US-amerikanischer epischer Bibelfilm, 1953, 252947=Film: Patrick Swazye, City of Hope Roman: Charles Dickens (1812-1870) beliebtester englischer Romanschriftsteller des Viktorianischen Zeitalters, Oliver Twist, 280581=Person: ⚡Bill Wilson [Bill W.] (1895-1971) US-amerikanischer Mitgründer der internationalen Selbsthilfevereinigung Anonyme Alkoholiker (AA) Film: Jack Lemmon (*1925) US-amerikanischer Schauspieler, und Lee Remick, Die Tage des Weines und der Rosen, 1962 [Days of wine and roses] (Alkohol);, 192896=Film: Kim Stanley, The Goddess, 1958, 121429=Roman: Mark Salzman, Lying Awake, 2001 Drama: John Pielmeier, Agnes of God, 1982 Religion / Mythos: Alle großen Traditionen haben fortgeschrittene Mystiker hervorgebracht. Dazu gehören unter anderem:, 191866=Roman: H. Rider Haggard, Sie und Allan, 1921 (Verfilmungen: SHE - Herrscherin einer versunkenen Welt, 1935;, 215404=Film: Humphrey Bogart (1899-1957) US-amerikanischer Schauspieler, Der Malteser Falke und The Big Sleep, 26600=Roman: Robert Louis Stevenson, Der seltsame Fall des Dr. Jekyll und Mr. Hyde, 1886, 270065=Film: Herbert Marshall als Darsteller in dem romantischen Fantasiefilm The Enchanted Cottage, 1945, 152530=Film: Paul Scofield, Ein Mann zu jeder Jahreszeit, 1966 [A Man for All Seasons], 159045=Roman: Hermann Hesse (1877-1962) deutsch-schweizerischer Dichter, Schriftsteller, Siddhartha, 1922 Märchen: Belling the cat Religion / Mythos: Dionysos (Gott des Weines, der Freude, der Trauben, der Fruchtbarkeit und der Ekstase,, 64312=Roman: Henry James, Figur Frau Grose in der Oper The Turn of the Screw, 1954 Märchen: Aschenputtel Religion / Mythos: Die Namen spiritueller Meister und Mystiker der Moderne beinhalten das Sanskrit Wort dasya (Diener):, 69277=Drama: Henrik Ibsen (1828-1906) norwegischer Theaterdirektor, Dichter, Bühnenschriftsteller, Figur Nora in, 37189=Film: James Caan (*1940) US-amerikanischer Schauspieler, Der Einzelgänger, 27. März 1981, (Thief), 68797=Roman: Mohandas Karamchand Mahatma Gandhi (1869-1948) indischer hinduistischer Weiser, spiritueller Führer, 94018=Film: Joan Crawford (*1905) US-amerikanische Filmschauspielerin, als Hauptdarstellerin in Ehe in Fesseln, 1955 Queen Bee, 198593=Film: Steve McQueen, Cincinnati Kid, 1965 (Schatten), 48900=Person: Gunter Sachs (1932-2011), Hugh Hefner (*1926) US-amerikanischer Verleger, Gründer und Chefredakteur des Männermagazins ⚡ Playboy Film: Sophie Marceau als Darstellerin von Anna Karenina; Sean Bean als Darsteller von Graf Alexei Kirillowitsch Wronski in:, 233299=Film: Terence Stamp, Die Verdammten der Meere, 1962 [Billy Budd, Foretopman, 1924], 150771=Drama: George Bernard Shaw (1856-1950) irischer Politiker, Pazifist, Satiriker, Dramatiker, Nobelpreisträger in Literatur, 1925,, 46726=Film: Julie Walters, Educating Rita, 1980, 171645=Film: Spencer Tracy, Das Urteil von Nürnberg, 1961 [Judgment at Nuremberg], 249873=Film: Matt Dillon, My Bodyguard, 1980, 81947=Film: Greta Garbo als Hauptdarstellerin in Mata Hari, 1931, 149327=Film: Dominic Guard, Der Mittler, 1970 [\"The Go-Between\"] Roman: Henry James, \"The Ambassadors\", 1903 Religion / Mythos: Thot (ibisförmiger oder paviangestaltiger Gott der Weisheit, Vermittler unter den Göttern, die stets seinen Rat erbitten,, 111572=Film: Debbie Reynolds, Das war der Wilde Westen, 1962 [How the West Was Won], 53540=Film: Rod Taylor als Darsteller von Sean O'Casey in Cassidy, der Rebell, 1965 [Young Cassidy], 85992=Sagen/Märchen: Hans und die Bohnenranke, 1807 (englisches Märchen), 263334=Drama: Peter Schaffer, Amadeus Märchen: Carlo Collodi, Figur Gepetto in Pinocchio, 1881 Religion / Mythos: Galatea (Bildhauer, hauchte der Statue Pygmalions Leben ein) (altgriechische Mythologie), 157499=Film: Nicolas Cage, Mondsüchtig, 1987 [Moonstruck], 73584=Roman: Herman Melville, Bartleby der Schreiber, 1853 [Bartleby, the Scrivener] Religion / Mythos: Ezra (hebräischer Schreiber, Priester, Sammler und Herausgeber der Bücher der hebräischen Bibel im 5. Jhdt. v. Chr.), 272682=Drama: William Gibson, The Miracle Worker, 1957-1959 Märchen: Rumpelstilzchen (Stroh in Gold spinnen) Religion / Mythos: Merlin (Zauberer, Prophet und Ratgeber im Leben von König Artur) (mittelalterliche Artussage, englischer Sagenkreis), 131747=TV-Serie: Derek Jacobi in Brother Cadfael (1977-1994) Roman: Umberto Eco, Der Name der Rose, 1980/1982 Religion / Mythos: Friar Tuck (der mythische mit dem Schwert kämpfende Mönch) in Robert Louis Stevensons (1850-1894),, 17987=Film: Gary Cooper, Zwölf Uhr mittags, 1952 [High Noon], 129232=Film: Irene Dunne, Geheimnis der Mutter, 1948 [ I Remember Mama], 83528=TV-Serie: US-amerikanische Westernserie Die Texas Rangers (1949-1957) [The Lone Ranger] Religion / Mythos: Bidadari (ansehnliche Nymphe, die ihre magischen Kenntnisse nutzte,, 185470=Film: Terence Stamp und Dragan Maksimovic, Meetings with Remarkable Men, Regisseur Peter Brook, 1979, 162294=Roman: Dale Wasserman, Der Mann von La Mancha, Musical, 1972 [Man of La Mancha] Märchen: Prinz Eisenherz, US-amerikanische Comic-Serie, 1937 [Prince Valiant] Religion / Mythos: Ritter der Tafelrunde (semi-mythische Gruppe bestehend aus 150 Rittern einschließlich:, 255572=Roman: Harper S. Lee, Wer die Nachtigall stört, 1960 Drama: Äschylos, Trilogie Orestie, 458 v. Chr., 294304=Vier Jahre später las er in einem gerade veröffentlichten Buch über einen griechischen Papyrus, in dem vom Mithras-Kult berichtet wird. Darin wurde eine Röhre erwähnt, die vom Antlitz der Sonne herabgelassen wird und den Ursprung des Windes darstellt. Das Bemerkenswerte ist nicht nur die Übereinstimmung zwischen der Halluzination des Kranken und der über 2000 Jahre alten Schrift, sondern auch die Tatsache, dass der Papyrus zum Zeitpunkt der Halluzination noch gar nicht veröffentlicht war. Der Kranke, der Volksschulbildung besaß und nie gereist war, konnte nicht auf dem Wege des Lesens zu seinem Bild gekommen sein., 126152=Drama: Bertholt Brecht (1898-1956) einflussreicher deutscher Bühnenschriftsteller, Lyriker, Dramatiker, Theaterdirektor,, 156163=Roman: Marion Meade, Stealing Heaven. The Love Story of Heloise and Abelard (1979 (historische Figuren Abelard und Heloise) Drama: William Shakespeare (1564-1616) englischer Dramatiker, Bühnenschriftsteller, Lyriker, Schauspieler,, 200479=Roman: James M. Cain, Wenn der Postmann zweimal klingelt, 1981 [The Postman Always Rings Twice] Religion / Mythos: Circe (verführerische Zaubererin, konnte Männer mit ihrem Zauberstab in ein Tier verwandeln), 47643=Roman: Anna Karenina, Roman von Leo Tolstoi (geschrieben 1873-1878), veröffentlicht 1877-1878 Drama: Religion / Mythos:, 246602=Film: Margaret O'Brien, Der geheime Garten, 1993 [The Secret Garden], 86861=Roman: Albert Camus (1913-1960) algerisch-französischer Philosoph, Schriftsteller, Nobelpreisträger für Literatur, 1957, Der Mensch in der Revolte, (1953), 2006, The Rebel, 1951, 163579=Film: Harrison Ford, Indiana Jones, Abenteuerfilmreihe und Indiana Jones und der letzte Kreuzzug, 1989, 234647=Märchen: James Matthew Barrie, Peter Pan, 1902 Religion / Mythos: Amor / Cupid (Knabengott, der angeblich aus einem Silberei geboren wurde) (altrömische Mythologie), 181290=Roman: Archibald Joseph Cronin (1896-1981) schottischer Arzt, Schriftsteller, Die Zitadelle (''The Citadel\"), 1937, 146781=Film (Mentor): Darsteller Alec Guinness für Darsteller Mark Hammill in Film-Trilogie Krieg der Sterne, 1977 [Star Wars], 205448=Film: William Powell, Unser Leben mit Vater, 1947, 100440=Drama: Arthur Miller (1915-2005) US-amerikanischer Schriftsteller, Dramatiker, Figur Biff in:, 14375=Roman: John Steinbeck (1902-1968), Stürmische Ernte, 1955 [In Dubious Battle, 1936] (Wanderarbeiter-Roman) Drama: Charles Fuller, A Soldier's Story Religion / Mythos: Bhima, \"der Schreckliche\" (Kriegsheld der Mahabharata, der berühmt für seine Stärke war. Der Sohn, 228263=Drama: Maxim Gorky, He Who Gets Slapped Oper: Rugierro Leoncavallo, Der Bajazzo Literatur: Miguel de Cervantes, Don Quichote, Teil 1, 1605, Teil 2, 1615, 142668=Drama: William Gibson, The Miracle Worker, 1957-1959 Religion / Mythos: Krishna (†3102 v. Chr.) indischer Avatar, Zentralfigur des Hinduismus (spiritueller Mentor von Arjuna), 110736=TV-Serie: Wagon Train, Bonanza, Little House on the Prairie Roman: James Hilton, Der verlorene Horizont, 1933 [Lost Horizons], 103581=Film: Laurence Olivier, Der Prinz und die Tänzerin, 13. Juni 1957 (The Prince and the Showgirl), 56289=Märchen: L. Frank Baum, die Figuren der fliegenden Affen in Der Zauberer von Oz, 1900 (verfilmt als Das zauberhafte Land, 1939) Religion / Mythos: Eurykleia (Sklavin von Laärtes in der Odyssee, treue Amme von Odysseus, die als Erste den Helden erkannte,, 88800=Film: James Dean als Hauptdarsteller in … denn sie wissen nicht, was sie tun, 1955 [Rebel Without a Cause], 30570=Film: Bela Lugosi, Dracula, 1931, 197630=Roman: Fjodor Michailowitsch Dostojewski (1821-1881) russischer Romanschriftsteller, Der Spieler, 1866 Religion / Mythos: Jason, Odysseus (Helden, die sich furchtlos auf aussichtslose lebensgefährliche Abenteuer einließen,, 143549=TV-Serie: Figur James Gandolfini für Figur Robert Imperioli in Die Sopranos (1999-2007) [The Sopranos] Roman: Charles Dickens (1812-1870) beliebtester englischer Romanschriftsteller des Viktorianischen Zeitalters,, 30017=Roman: Bram Stoker, Dracula, 1897, 28943=Religion / Mythos: Vlad III. Drăculea [Vlad Tepes] (~1431-1476/1477), walachischer Fürst (blutrünstiger Graf, der angeblich, 166230=Drama: William Shakespeare (1564-1616) englischer Dramatiker, Bühnenschriftsteller, Lyriker, Schauspieler,, 168185=Film: Charles Laughton, The Private Life of King Henry VIII, 1933 (The Private Life of Henry VIII), 134962=Drama: Molière (1622-1673) französischer Schauspieler, Theaterdirektor, Dramatiker, Der Geizige, 1668 Religion / Mythos: Midas (König von Phrygien in Kleinasien, der von Gott Dionysus die zweifelhafte Gabe bekam, alle Dinge,}",
    "TableContextTimeStampAfterTable": "{126111=1 The Manchurian Candidate (1962), Viooz.co film, 126:32 duration, undated ⇑, 110974=Major events in American history since the pilgrims landed show underlying 88-year cycles repeating every four generations in history. The current cycle will end around 2012 and a new one will start. Generations consist of four different archetypes: Idealistic Prophet (maker), Reactive Nomad (rebel), Civic Heros (mediator / consumer), Adaptive Artist (transformer), 14850=Joseph Campbell, Ph.D. (1904-1987) US American mythologist, expert in comparative mythology and comparative religion, Pathways To Bliss, ReadHowYouWant, large edition 16. May 2012, cited in: Jurnal blogspot Archetypes, Relationship, Shadow, Anima/Animus, and Personal Myth by Joseph Campbell, 30. July 2013, 126414=2 See minute 38:24 of Vimeo video presentation by Jaak Panksepp, Ph.D. (*1943) Estonian-born US American professor of psychology, Bowling Green State University, psychobiologist, neuroscientist, College of Veterinary Medicine, Washington State University, Social Emotion Systems of Mammalian Brains and Vicissitude of Early Social Bonds: The Transformation of Social Delight to Grief, Depression and Despair, sponsored by convention Human Nature and Early Experience, host University of Notre Dame Continuing Education Center, 10-12. October 2010, 1:03:0 duration, posted by ACEatND 14. December 2010 ⇑, 120018=Barack Obama, a self-reflective president, has travelled the hero's journey. Consciousness researcher Grof analyses Obama's preparation and initiation to play a role as a world leader. Obama struggled for a long time to gain a sense of belonging. He had an epiphany in Kenya and when listening to a sermon he was struck by the phrase The Audacity of Hope which inspired him to write a book with the same title published in 2006. In the process of writing Obama was called by distant voices. First he was reluctant to listen to them. They ebbed and returned later to call him again. Then he answered the call., 1706=Damasio et al. Brain imaging, 2000, confirmed the four classic temperaments. 2}",
    "textBeforeTable": "Sammlung von Archetypen – Caroline Myss Bearbeiten ↓ ↑ Quellen (engl.) von Prof. Allan G. Hunter, britisch-amerikanischer Professor für Literatur, Berater, Selbstentwicklungslehrer ► Archetypes. What Are The Six Archetypes? [Archetypen. Was sind die sechs Archetypen?], undatiert ► The Six Archetypes of Love. From Innocent to Magician [Die sechs Archetypen der Liebe. Vom Unschuldigen zum Magier], Findhorn Press, 2008   Unerwartete Wunder geschehen dort, wo sich der Magier aufhält. Er spricht aus, was angemessen ist und gewährt anderen die Freiheit und Kreativität, um ihre Seele auszudrücken. People take charge of their own lives, make a difference and perform extraordinary deeds. Der Magier ist ein Krustensprenger. This leader knows how and when to pick players and how to place them. He coaches and guides others with ease from behind, on the sidelines. Magier 6. Once the Warrior-Lover achieved the equilibrium between action and compassion, outwards and inwards, the larger world will call him to the Monarch archetype who does not engage in battling anymore. The skilled and delicate Monarch respects that people are different. King and",
    "textAfterTable": "Does not take responsibility for her own well-being or happiness. Can bring out the need in you to develop self-esteem, stand up and take care of yourself. The victim archetype can blame others and circumstances for her physical conditions. Even though she knows dairy products often lead to sinus infections, she blames atmospheric conditions instead of the half-pound of cheese she ate at a party. Saboteur Runs away from opportunities and the sacred contract that can lead to happiness. Is often frightened of life and good things, so she turns away from them. The saboteur archetype creates situations that block your healing because you fear the changes that might take place. After a doctor presents her with a surgical option for relieving her sinus problems, she dwells on her dislike of the doctor's bedside manner and refuses to have the surgery – all because she is fearful of the pain of surgery and recovery. Prostituierte Helps people face the parts of themselves that will negotiate their self-worth. Gives herself \"away\" too much to gain pleasures that don't contribute to her well-being. May stay in a job or a relationship when she is miserable for a superfluous benefit that does not make her happy. The prostitute archetype will show you what you're willing to negotiate in order to provide for your health. Knowing she has an acupuncture appointment that will provide relief, she continues working",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}