{
    "relation": [
        [
            "Rank",
            "1",
            "2",
            "3",
            "4",
            "5"
        ],
        [
            "Team",
            "Australia",
            "India",
            "South Africa",
            "Scotland",
            "Wales"
        ],
        [
            "Wins",
            "1",
            "1",
            "1",
            "0",
            "0"
        ],
        [
            "Draws",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Losses",
            "0",
            "0",
            "0",
            "1",
            "2"
        ],
        [
            "GD",
            "+6",
            "+2",
            "+2",
            "-6",
            "-8"
        ],
        [
            "Points",
            "3",
            "3",
            "3",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Commonwealth Games Hockey 2014: Daily Results, Scores and Updated Schedule | Bleacher Report",
    "title": "Men's Hockey Standings Pool A",
    "url": "http://bleacherreport.com/articles/2140521-commonwealth-games-hockey-2014-daily-results-scores-and-updated-schedule",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00320-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 25310375,
    "recordOffset": 25238757,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{115619=GOOOOAAAALLLLLLLL! 1-1. AUSvENG | #Glasgow2014 | @JodieSchulz equalises with 14 seconds to go., 159083=NZ Simon Child class act! Always scoring stunning goals and continued that today! #CWG2014, 254369=Ahhh The Queen photo-bombed our selfie!! 😄 👑 #royalty #sheevensmiled #amazing #Glasgow2014 @Hockeyroos @AusComGames pic.twitter.com/ZMtHYFUqHk, 118963=The comfortable win has set up a tantalising final with India. It will be a tough test despite Australia capturing every gold medal this event has offered since 1998., 162048=FULL TIME 4-2 | AUSvIND | #Glasgow2014 | Australia wins with goals from @TheBigDog_5 (2), @orch3 and @whetty12 pic.twitter.com/QbvKDdG6iP, 179283=Final Score | AUSvENG | #Glasgow2014 | 3-0 AUS | Two goals from @JodieSchulz and one from @Emilyjsmith26 pic.twitter.com/eFkXonwm5k, 112738=Glasgow2014.com, 135250=India aren't just wearing yellow, they are showing shades of Australia in their hockey too. Easy win vs SAfrica & a place in semis #CWG2014, 218122=First hat trick in an international @whetty12 has a great day against Wales @Kookaburras @tensporttv #glasgow2014, 104750=Australia win #Glasgow2014 hockey gold after a 4-0 win over India pic.twitter.com/eTIbjwthfW, 107171=It's a Golden Day for hockey in Australia! Men & Women crowned Commonwealth champions! We salute you! #Glasgow2014 pic.twitter.com/2hh9lQFtEp, 106564=Source: Glasgow2014.com, 114561=AUSvENG | #Glasgow2014 | Still @Hockeyroos comes forward. Possession stats must be one sided but England defending resolutely. Last 7 mins., 102980=Despite only being introduced as a full-time event in 1998, hockey has quickly grown into one of the Commonwealth Games' most popular sports, and Glasgow 2014 figures to be no exception., 226169=It was not a good day for Welsh Hockey teams at the 2014 Commonwealth Games in Glasgow. Both the men's and the women's representatives were comfortably dispatched., 161231=The referee in the @TheHockeyIndia v Oz at #CWG2014 is needlessly arrogant and dismissive towards the Indian players. @FIH_Hockey pls note!, 258870=FT: England 6 Trinidad & Tobago 1 Comfortable opening victory for Eng men's hockey. Doncaster's Barry Middleton also on target #Glasgow2014, 104427=Not only did the Australian women’s team win the gold medal on Saturday, but the nation’s men’s team also managed to bring home the top prize on Sunday and won the 2014 Commonwealth Games' field hockey tournament., 227638=There were seven goals in each half per Glasgow2014.com. Krystal Forgesson helped herself to four of those successful strikes., 284932=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 120807=Day 9 of the Commonwealth Games saw women’s hockey edge closer to its climax, as Australia and England earned their respective places in the 2014 gold medal match., 103206=Australia was the most dominant men's team in the competition and subsequently won the 2014 gold medal, but the squad faced some very strong teams this year. The Australians beat India in the gold medal game and England beat New Zealand in the bronze medal match to finalize the podium., 148280=#CWG2014 :Women Hockey: India loses to South Africa 2-3 ..hence doesn't qualify for Semis!!, 217271=FINAL SCORE: @AUSComGames Australia win 7-1 over Wales at #Glasgow2014., 109947=Our triumphant @Hockeyroos step onto the top step of the podium at #Glasgow2014 @AusComGames pic.twitter.com/Wlq5PWKDMi, 121402=FULL TIME | @Hockeyroos reach their third consecutive Comm. Games final with 7-1 win over South Africa #Glasgow2014 @AUSComGames, 258089=And India women begin well in #hockey as well - a 4-2 win over Canada. Three goals off PCs. Wow! #CWG2014, 160034=Kwan Browne is my new favorite player! #Hockey2014 #BringItOn @Glasgow2014, 173512=Get around the beard @mitton_ @1 scores a double @Glasgow2014 pic.twitter.com/I2O2YATikG}",
    "textBeforeTable": "Australia was the favorite to win the entire event, but the way the team dominated India in the final was better than expected. The Aussies scored two goals in the first half and another two goals in the second, but it was the defensive effort that made the ultimate difference. August 3, 2014 Australia win #Glasgow2014 hockey gold after a 4-0 win over India pic.twitter.com/eTIbjwthfW— BBC Sport (@BBCSport) Not only did the Australian women’s team win the gold medal on Saturday, but the nation’s men’s team also managed to bring home the top prize on Sunday and won the 2014 Commonwealth Games' field hockey tournament. Sunday Update Robert Cianflone/Getty Images   Only four teams qualified for the medal round, and the resulting action was unforgettable once the squads took to the field. The Australian women also managed to win the gold medal. Australia was the most dominant men's team in the competition and subsequently won the 2014 gold medal, but the squad faced some very strong teams this year. The Australians beat India in the gold medal game and England beat New Zealand in the bronze medal match to finalize the podium. Despite only being introduced as a full-time event in 1998, hockey",
    "textAfterTable": "Our triumphant @Hockeyroos step onto the top step of the podium at #Glasgow2014 @AusComGames pic.twitter.com/Wlq5PWKDMi— Hockeyroos (@Hockeyroos) August 2, 2014 The war of attrition was eventually ended by the Hockeyroos after a penalty shootout. Earlier, South Africa and New Zealand tussled for Bronze. The medal ultimately went to New Zealand after a thumping 5-2 triumph. Here's a full breakdown of today's results: Results for Saturday, August 2 Match Team Team Result Winner Men's Semi-final 2 Match Australia England 4-1 Australia Men's Semi-final 1 Match New Zealand India 2-3 India Men's Classification 5-6 Match South Africa Canada 7-3 South Africa Women's Bronze Medal Match South Africa New Zealand 2-5 South Africa Women's Gold Medal Match Australia England 1-1 Australia (Penalties) Glasgow2014.com Here's the updated schedule for Hockey's final day: Updated Schedule Match Start Time Team Team Venue Men's Bronze Medal Match 10 a.m. BST New Zealand England Glasgow National Hockey",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}