{
    "relation": [
        [
            "",
            "Rh-Negative Women",
            "Total women in trial",
            "Rh immunized 6 to 9 months after delivery"
        ],
        [
            "Given RhIG",
            "After Delivery",
            "1216",
            "0"
        ],
        [
            "Not Given RhIG",
            "After Delivery",
            "500",
            "36 (7.2%)"
        ]
    ],
    "pageTitle": "Alloimmune Hemolytic Disease of the Fetus and Newborn (Erythroblastosis Fetalis): Diagnosis, Management, and Prevention | GLOWM",
    "title": "",
    "url": "http://www.glowm.com/section_view/item/201",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00302-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471946863,
    "recordOffset": 471875941,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{4929=Diamond and co-workers, in 1932, were the first to show that hydrops fetalis, icterus gravis, and severe anemia of the newborn were the same disease albeit of differing severity, characterized by hemolysis of the red blood cells (RBCs) of the fetus and newborn and an outpouring of immature nucleated RBCs (erythroblasts). Darrow theorized that the hemolysis was due to the transplacental passage of a maternal antibody, antifetal hemoglobin, into the fetal circulation. Her theory was correct, but her postulated antigen (fetal hemoglobin) and antibody were untenable., 5345=Although Hippocrates may have described fetal hemolytic disease (erythroblastosis fetalis, hemolytic disease of the newborn), the first recorded report is that of a French midwife in 1609, who reported the birth of twins: the first was grossly edematous (hydrops fetalis) and died promptly; the second, in good condition at birth, became deeply jaundiced (icterus gravis) and died a few days later., 12994=Fig. 6. X-ray of a hydropic newborn at birth and 6 hours later after exchange transfusion. Note the small heart at the time of birth, with a marked increase in heart size and evidence of pulmonary congestion denoting heart failure 6 hours later. The fetus had extreme ascites.(Bowman JM: Blood-group incompatibilities. In Iffy L, Kaminetzky HA (eds): Principles and Practice of Obstetrics and Perinatology, p 1193. New York, John Wiley & Sons, 1981), 4342=The epoch-making experiments of Landsteiner and Wiener in 1940 revealed the true state of affairs. They produced a rhesus monkey RBC antiserum in rabbits and guinea pigs. The rhesus (Rh) antisera produced agglutination of the RBCs of 85% of a group of white subjects (Rh positive) but not of the remaining 15% (Rh negative). This experiment laid the foundation for safe blood transfusion, the determination of the cause of Rh hemolytic disease, and the development of the science of human anthropology. Although the rhesus monkey antigen, now named LW, is not exactly the same as the human Rh antigen (Rh-negative people usually are weakly LW positive), this in no way diminishes the importance of Landsteiner and Wiener's work., 12471=ISSN: 1756-2228, 3274=Since this work in the 1940s, the complexities of the Rh blood group system have been unraveled. There are more than 40 antigens in the system. Other blood group systems, some of clinical importance, have been discovered. Sensitive methods of screening for blood group antibodies and of measuring their strength are available, and the pathogenesis of maternal blood group immunization and of erythroblastosis fetalis is now known. The severity of erythroblastosis can be assessed accurately in utero. Methods of treatment of both fetus and newborn are now available, and since 1967, there has been a method of preventing Rh immunization, which has reduced its incidence greatly in the past 30 years.}",
    "TableContextTimeStampAfterTable": "{199307=Scott JR, Beer AE, Guy LR et al: Pathogenesis of Rh immunization in primigravidas: Fetomaternal versus maternofetal bleeding. Obstet Gynecol 49: 9, 1977, 60021=In 1961, Liley37 reported on a technique of amniotic fluid spectrophotometry that allows accurate comparison of measurements from one laboratory to another. Amniotic fluid must be protected from light, which destroys bilirubin. It is centrifuged and filtered, and optical density measurements are made in a good-quality spectrophotometer and recorded over the visible 700- to 350-nm range. The measurements are plotted on semilogarithmic paper (Fig. 7). Wavelength is the linear horizontal coordinate; optical density is the logarithmic vertical coordinate. The readings are connected. The deflection from linearity at 450 nm (ΔOD 450) is related to the severity of Rh disease. In fluid not contaminated with blood, a second rise at 405 nm is caused by heme pigment, which denotes severe hemolysis. To calculate the deflection from linearity at 450 nm, a tangent is drawn connecting the reading at 550 nm with the reading at 365 nm. The measurement from the intersection of the tangent with the 450-nm wavelength line to the actual amniotic fluid optical density at 450 nm gives the optical density rise at 450 nm (ΔOD 450; see Fig. 7)., 183656=Bowman JM: Management of Rh-isoimmunization. Obstet Gynecol 52: 1, 1978, 179346=James LS: Shock in the newborn in relation to hydrops. In Robertson JG, Dambrosio F (eds): International Symposium on the Management of the Rh problem. Annali Obstet Ginec Special Number:193, 1970, 178637=Lobuglio AF, Cotran RS, Jandl JH: Red cells coated with immunoglobulin G: Binding and sphering by mononuclear cells in man. Science 158: 1582, 1967, 181955=Hadley AG, Kumpel BM, Leader KA et al: Correlation of serological, quantitative and cell-mediated functional assays of maternal alloantibodies with the severity of haemolytic disease of the newborn. Br J Haematol 77: 221, 1991, 197385=Pollack W, Ascari WQ, Kockesky RJ et al: Studies on Rh prophylaxis. I. Relationship between doses of anti-Rh and size of antigenic stimulus. Transfusion 11: 333, 1971, 192268=Gold WR Jr, Queenan JT, Woody J et al: Oral desensitization in Rh disease. Am J Obstet Gynecol 146: 980, 1983, 175057=Peddle LJ: Increase of antibody titer following amniocentesis. Am J Obstet Gynecol 100: 567, 1968, 183068=Bevis DCA: Blood pigments in haemolytic disease of the newborn. J Obstet Gynaecol Br Emp 63: 68, 1956, 199933=Bowman JM, Friesen AD, Pollock JM et al: WinRho: Rh immune globulin prepared by ion exchange for intravenous use. Can Med Assoc J 123: 1121, 1980, 196138=Chown B, Duff AM, James J et al: Prevention of primary Rh immunization: First report of the Western Canadian Trial. Can Med Assoc J 100: 1021, 1969, 202897=Caine ME, Mueller-Heubach E: Kell sensitization in pregnancy. Am J Obstet Gynecol 154: 85, 1986, 193513=Graham-Pole J, Barr W, Willoughby MLN: Continuous flow plasmapheresis in management of severe Rhesus disease. Br Med J 1: 1185, 1977, 201529=Bernard B, Presley M, Caudillo G et al: Maternal fetal hemorrhage: Incidence and sensitization [Abstract]. Pediatr Res 11: 467, 1977, 188011=Crosby WM, Brobmann GF, Chang ACK: Intrauterine transfusion and fetal death: Relationship of intraperitoneal pressure to umbilical vein blood flow. Am J Obstet Gynecol 108: 135, 1970, 197730=Zipursky A, Blajchman M: The Hamilton Rh prevention studies. In Proceedings of the McMaster Conference on Prevention of Rh Immunization. September 28–30, 1977. Vox Sang 36: 50, 1979, 198505=Bartsch F, Sandberg L: Incidence of anti-D at delivery in previously non-immunized Rh-negative mothers with Rh-positive babies. In Proceedings of the McMaster Conference on Prevention of Rh Immunization. September 28–30, 1977. Vox Sang 36: 50, 1979, 68026=On the basis of this information and experience at the Rh Laboratory in Winnipeg based on 3351 ΔOD 450 measurements carried out on 1170 immunized pregnant women in the 22-year period ending January 31, 1983, I make the following observations (Table 6):, 171980=Race RR. The Rh genotype and Fisher's theory. Blood 3(Special Issue No 2):27, 1948, 176235=Lewis M, Kaita H, Chown B: Kell typing in the capillary tube. J Lab Clin Med 52: 163, 1958, 176504=Rosenfield RE, Haber GV: Detection and measurement of homologous human hemagglutinins: Automation in analytical chemistry. Technicon Symposia 503, 1966, 181173=Engelfriet CP, Brouwers HAA, Huiskes E et al: Prognostic value of the ADCC with monocytes and maternal antibodies for haemolytic disease of the newborn, p 162 [Abstract]. Sydney, Australia, Book of Abstracts, 21st Congr. ISH and 29th Congr ISBT, 1986, 201840=Rivat L, Parent M, Rivat C: Accident survenu apres injection de gamma-globulines anti-Rh du a la presence D/ anti-corps anti-yA. Presse Med 78: 2072, 1970, 54176=Indirect antiglobulin titer is used by many laboratories. It is more sensitive (usually positive one to three dilutions higher) than albumin titers. The indirect antiglobulin titer that puts the fetus at risk may be 1:32 to 1:64 but must be determined individually for each laboratory., 191356=Harman CR, Bowman JM, Menticoglou SM et al: Profound fetal thrombocytopenia in Rhesus disease: Serious hazard at intravascular transfusion. Lancet 2: 741, 1988, 184503=Bartsch FK: Bilirubin in the amniotic fluid: A review. In Robertson JG, Dambrosio F (eds): International Symposium on the Management of the Rh problem. Annali Obstet Ginec Special Number:73, 1970, 55310=Antibody measurement and history of severity of prior Rh disease together are insufficient to allow proper management of an Rh-immunized woman and her affected fetus. At the Winnipeg General Hospital, in an 8-year period from 1954 to 1961 in which 426 Rh-immunized pregnancies were managed, there were 67 perinatal deaths from erythroblastosis and 54 infants who survived only because they were delivered early (as early as 32 weeks' gestation).27 In just 62% of the 121 most severely affected fetuses was severity of erythroblastosis predicted accurately on the basis of history and antibody titer. If more accurate prediction of severity had been possible, half of the 67 deaths might have been prevented by treatment measures available at that time., 177445=Woodrow JC: Rh immunization and its prevention. In Jensen KG, Killmann SA (eds): Series Hematologica III, Vol 3, p 33. Copenhagen, Munksgaard, 1970, 183906=Nicolaides KH, Rodeck CH, Mibashan MD, Kemp JR: Have Liley charts outlived their usefulness? Am J Obstet Gynecol 155: 90, 1986, 203171=Hadi HA, Robertson A: Kell sensitization, hydrops, and low delta OD 450. J Maternal-Fetal Med 1: 293, 1992, 195413=Clarke CA, Donohoe WTA, McConnell RB et al: Further experimental studies in the prevention of Rh-haemolytic disease. Br Med J 1: 979, 1963, 190373=Nicolaides KH, Soothill PW, Clewell W et al: Rh disease: Intravascular fetal blood transfusion by cordocentesis. Fetal Ther 1: 185, 1986, 194436=de la Camara C, Arrieta R, Gonzalez A et al: High-dose intravenous immunoglobulin as the sole prenatal treatment for severe Rh immunization. N Engl J Med 318: 519, 1988, 171716=Wiener AS, Wexler IB: Heredity of the Blood Groups. New York, Grune & Stratton, 1958, 183348=Liley AW: Liquor amnii analysis in management of pregnancy complicated by rhesus immunization. Am J Obstet Gynecol 82: 1359, 1961, 192918=Bowman JM, Pollock JM: Reversal of Rh alloimmunization: Fact or fancy? Vox Sang 47: 209, 1984, 193190=De Silva M, Contreras M, Mollison PL: Failure of passively administered anti-Rh to prevent secondary Rh immune responses. Vox Sang 48: 178, 1985, 175593=Lewis M, Chown B: A short albumin method for the determination of isohemagglutinins, particularly incomplete Rh antibodies. J Lab Clin Med 50: 494, 1957, 174737=Kleihauer E, Braun H, Betke K: Demonstration von fetalem haemoglobin in den erythrozyten eines blutausstriches. Klin Wochenschr 35: 637, 1957, 189338=Rodeck CH, Holman CA, Karnicki J et al: Direct intravascular fetal blood transfusion by fetoscopy in severe rhesus isoimmunisation. Lancet 1: 652, 1981, 177770=Zipursky A, Israels LG: The pathogenesis and prevention of Rh immunization. Can Med Assoc J 97: 1245, 1967, 190997=Grannum PAT, Copel JA, Moya FR et al: The reversal of hydrops fetalis by intravascular intrauterine transfusion in severe isoimmune fetal anemia. Am J Obstet Gynecol 158: 914, 1988, 202528=Hoppe HH, Mester T, Hennig W et al: Prevention of Rh-immunization: Modified production of IgG anti-Rh for intravenous application by ion exchange chromatography (IEC). Vox Sang 25: 308, 1973, 199638=Bowman JM, Pollock JM: Antenatal Rh prophylaxis: 28 weeks' gestation service program. Can Med Assoc J 118: 627, 1978, 189668=De Crespigny LC, Robinson HP, Quinn M et al: Ultrasound-guided blood transfusion for severe rhesus isoimmunization. Obstet Gynecol 66: 529, 1985, 137693=1216, 196464=Samson D, Mollison PL: Effect on primary Rh-immunization of delayed administration of anti-Rh. Immunology 28: 349, 1975, 172567=Tippett P, Sanger R: Observations on subdivisions of the Rh antigen D. Vox Sang 7: 9, 1962, 175333=Wiener AS: Conglutination test for Rh sensitization. J Lab Clin Med 30: 662, 1945, 173180=Brown PJ, Evans JP, Sinor LT et al: The Rhesus D antigen: A dicyclohexylcarbodiimide-binding proteolipid. Am J Pathol 110: 127, 1983, 185488=Daffos F, Capella-Pavlovsky M, Forestier F: Fetal blood sampling during pregnancy with use of a needle guided by ultrasound: A study of 606 consecutive cases. Am J Obstet Gynecol 153: 655, 1985, 182360=Mollison P: Results of tests with different cellular bioassays in relation to severity of RhD haemolytic disease: Report from nine collaborating laboratories. Vox Sang 60: 225, 1991, 174464=Chown B: Anemia from bleeding of the fetus into the mother's circulation. Lancet 1: 1213, 1954, 186492=Avent ND, Martin PG: Kell typing by allele-specific PCR (ASP) Br J Haematol 93:728, 1996, 170708=Infants with ABO erythroblastosis usually are group A or B and have group O mothers. Twenty-five to 30% of such infants have weakly direct antiglobulin (Coombs' test) positive cord RBCs. Only a small number of these infants develop early and severe jaundice. In one report, in a 12-year period from 1954 to 1965, 2500 (28%) of 9000 ABO-incompatible infants had cord RBCs that were weakly direct antiglobulin positive.100 Only 41 (1.6%) of the 2500 infants required exchange transfusion. ABO erythroblastosis is entirely a pediatric problem and is concerned with the management of hyperbilirubinemia and the prevention of kernicterus., 203456=Vaughan JI, Warwick R, Letsky E et al: Erythropoietic suppression in fetal anemia because of Kell alloimmunization. Am J Obstet Gynecol 171: 247, 1994, 180431=Nance SJ, Nelson JM, Horenstein J et al: Monocyte monolayer assay: An efficient noninvasive technique for predicting the severity of hemolytic disease of the newborn. Am J Clin Pathol 92: 89, 1989, 122417=(May 1986-May 1997), 178336=Bowman JM, Chown B, Lewis M et al: Rh-immunization during pregnancy: Antenatal prophylaxis. Can Med Assoc J 118: 623, 1978, 150538=Rh immunization during pregnancy, therefore, accounts for about 14% of all cases of Rh immunization (if no Rh prophylaxis is given) and is the most important cause of residual Rh immunization. In Manitoba, it accounted for 69 (41%) of 167 Rh-immunized pregnancies encountered in a 3-year period ending October 31, 1976. Severity of subsequent Rh disease in fetuses of women Rh immunized during pregnancy is just as great as in fetuses of women Rh immunized after delivery., 187698=Lewis M, Bowman JM, Pollock JM et al: Absorption of red cells from the peritoneal cavity of an hydropic twin. Transfusion 13: 37, 1973, 73098=Amniocentesis always should be carried out using careful aseptic technique and local anesthesia. A clotted blood sample should be taken before and 5 minutes after amniocentesis. The needle insertion site is determined by palpation and ultrasound examination. The site is prepared with a suitable antiseptic, draped, and infiltrated with a local anesthetic. The operator introduces a lumbar puncture needle (20 or 22 gauge) through the abdominal wall into the uterus to the depth at which ultrasound has indicated a pocket of amniotic fluid. The stylet is removed, and 10 to 15 mL of fluid are aspirated. If fluid cannot be removed, the needle is withdrawn or inserted slightly. Rotation of the needle may aid the flow of fluid. Normally, amniotic fluid is slightly turbid, and turbidity increases as term is approached. Various degrees of yellow coloration are present. The fluid is protected from light and sent for ΔOD 450 measurement. After 31 weeks' gestation, it is also examined for the present of pulmonary maturity (lecithin/sphingomyelin [L:S] ratio of more than 2.0:1, phosphatidylglycerol [PG] of more than 2%). The maternal blood samples are sent for Kleihauer fetal cell screening and for antibody titration., 138411=Anti-D IgG has been licensed in North America and Europe since 1968. One prophylactic intramuscular dose in North America is about 300 μg. In Europe and Australia, the standard doses are 100 μg and 125 μg, which have been shown to be just about as effective., 77833=Despite these potential errors, I believe that amniotic fluid spectrophotometry is an accurate biologic screening test. Life-threatening inaccuracies occurred in only 2.1% of the 1170 women who underwent 3351 amniotic fluid examinations., 59329=For many years, obstetricians have observed that the amniotic fluid surrounding a fetus with severe Rh disease is yellow stained. The yellow material is bilirubin. Bevis36 carried out the first spectrophotometric measurements of bilirubin in amniotic fluid in 1956. Bilirubin, which absorbs visible light at wavelengths between 420 and 460 nm, can be measured most accurately by spectrophotometry., 172834=Gahmberg CG, Karhi KK: Association of Rho (D) polypeptides with the membrane skeleton in Rho (D)-positive human red cells. J Immunol 133: 334, 1984, 120918=The Winnipeg overall salvage rate with IPT from January 1964 to October 1986 (the last date that a fetus was given IPT alone) was 63% (222 of 353 fetuses transfused 862 times)., 186758=Lo Y-MD, Bowel PJ, Selinger M et al: Prenatal determination of fetal RhD status by analysis of peripheral blood of rhesus negative mothers [Letter]. Lancet 341: 1147, 1993, 184876=Rehder H, Weitzel H: Intrauterine amputation after amniocentesis. Lancet 1: 832, 1978, 58371=A 1991 report cast doubt on the ability of the monocyte-macrophage assay to predict severity of hemolytic disease of the newborn.35 In sera from 41 pregnant women with potentially dangerous blood group antibodies who delivered affected babies, there was no correlation between the hematocrit of a fetal blood sample obtained at cordocentesis and the monocyte-macrophage assay.35 Therefore, although the functional tests listed may be of value in helping to determine the fetus at risk and, in some pregnancies, of removing the need for invasive measures such as amniocentesis and fetal blood sampling, they do not replace these invaluable perinatal management parameters in differentiating the fetus who requires treatment in utero from the fetus who does not., 200543=Cohen F, Zuelzer WW: The transplacental passage of maternal erythrocytes into the fetus. Am J Obstet Gynecol 93: 566, 1965, 173489=Goto S, Nishi H, Tomoda A: Blood group Rh-D factor in human trophoblast determined by immunofluorescent method. Am J Obstet Gynecol 137: 707, 1980, 200257=Taylor JF: Sensitization of Rh-negative daughters by their Rh-positive mothers. N Engl J Med 276: 547, 1967, 185140=Chitkara U, Wilkins I, Lynch L et al: The role of sonography in assessing severity of fetal anemia in Rh- and Kell-isoimmunized pregnancies. Obstet Gynecol 71: 393, 1988, 194783=Von Dungern F: Beitrage zur Immunitatslehr. Munch Med Wochenschr 47: 677, 1900, 195730=Zipursky A, Pollock J, Yeow R et al: The pathogenesis and prevention of Rh-immunization in pregnancy. Proceedings of the II Congress of the International Society of Blood Transfusion. Sydney, 1966. Bibl Haematol 29 (I): 280, 1968, 181601=Hadley AG, Kumpel BM, Merry AH: The chemiluminescent response of human monocytes to red cells sensitized with monoclonal anti-Rh(D) antibodies. Clin Lab Haematol 10: 377, 1988, 190688=Seeds JW, Bowes WA: Ultrasound-guided intravascular transfusion in severe rhesus immunization. Am J Obstet Gynecol 154: 1105, 1986, 200844=Bowen FW, Renfield M: The detection of anti-D in Rho (D)-negative infants born of Rho (D)-positive mothers. Pediatr Res 10: 213, 1976, 122339=(July 1980-October 1986), 197045=Pollack W, Ascari WQ, Crispin JF et al: Studies on Rh prophylaxis. II. Rh immune prophylaxis after transfusions with Rh-positive blood. Transfusion 11: 340, 1971, 195040=Freda VJ, Gorman JG, Pollack W: Successful prevention of experimental Rh sensitization in man with an anti-Rh gamma 2-globulin antibody preparation: A preliminary report. Transfusion 4: 26, 1964, 177107=Moore BPL: Automation in the blood transfusion laboratory. I. Antibody detection and quantitation in the Technicon AutoAnalyzer. Can Med Assoc J 100: 381, 1969, 25645=2859, 196762=Bowman JM, Pollock JM: Transplacental fetal hemorrhage after amniocentesis. Obstet Gynecol 66: 749, 1985, 176833=Lalezari P: A polybrene method for the detection of red cell antibodies. Fed Proc 26: 756, 1967, 198932=Eklund J, Nevalinna HR: Rh antibody appearance during pregnancy in Finland. In Proceedings of the McMaster Conference on Prevention of Rh Immunization. September 28–30, 1977. Vox Sang 36: 50, 1979, 189991=Berkowitz RL, Chitkara U, Goldberg JD et al: Intrauterine intravascular transfusions for severe red blood cell isoimmunization: Ultrasound guided percutaneous approach. Am J Obstet Gynecol 155: 574, 1986, 70019=1170, 71416=Many other methods of measurement of amniotic fluid have been reported, with each author extolling his or her method as an advance in improving accuracy of prediction of Rh disease. As pointed out by Bartsch in 1970,41 none is an improvement over the Liley method. Experience and judgment of the person reviewing the amniotic fluid measurements and predicting the severity of the disease are more important than the method of measurement used., 172238=Lacey PA, Caskey CR, Werner DJ et al: Fatal hemolytic disease of the newborn due to anti-D in an Rh positive Du variant mother. Transfusion 23: 91, 1983, 198090=Hermann M, Kjellman H: Rh prophylaxis with immune globulin anti-D administered during pregnancy and after delivery. In Proceedings of the McMaster Conference on Prevention of Rh Immunization. September 28–30, 1977. Vox Sang 36: 50, 1979, 175924=Coombs RRA, Mourant AE, Race RR: A new test for the detection of weak and “incomplete” Rh agglutinins. Br J Exp Pathol 26: 255, 1945, 90692=In 1961, induced early delivery could not be carried out earlier than 31 to 32 weeks' gestation without encountering prohibitive mortality from prematurity and severe Rh disease., 193824=Robinson EAE, Tovey LAD: Intensive plasma exchange in the management of severe Rh disease. Br J Haematol 45: 621, 1980, 174153=Wiener AS: Diagnosis and treatment of anemia of the newborn caused by occult placental hemorrhage. Am J Obstet Gynecol 56: 717, 1948, 178055=Nevanlinna HR: Factors affecting maternal Rh immunization. Ann Med Exp Biol 31 (Fenn suppl 2): 1, 1953, 188372=Adamsons K Jr, Freda VJ, James LS et al: Prenatal treatment of erythroblastosis fetalis following hysterotomy. Pediatrics 35: 848, 1965, 132860=If amniotic fluid measurements indicate the need for interference at 34 weeks' gestation, the amniotic fluid should be examined for pulmonary maturity (L:S ratio greater than 2:1, PG present). If the lungs are mature, delivery should be undertaken. If they are not, administration of dexamethasone with delivery in 48 hours or fetal blood sampling and IVT repeated in 10 days with delivery at 37 to 37.5 weeks' gestation should be considered. If delivery has to be undertaken before 32 weeks' gestation or if the fetus is in a breech position, delivery should be by cesarean section, preferably with the use of epidural anesthesia. Otherwise, induction of labor with vaginal delivery should be attempted. Fetal heart rate monitoring during labor is essential. If delivery has not taken place within 24 hours after rupture of the membranes, cesarean section should be carried out., 179720=Bowman JM, Pollock JM: Amniotic fluid spectrophotometry and early delivery in the management of erythroblastosis fetalis. Pediatrics 35: 815, 1965, 203787=Bowman JM: Neonatal management. In Queenan JT (ed): Modern Management of the Rh Problem, 2nd ed, p 233. Hagerstown, MD, Harper & Row, 1977, 92572=Accurate calculation of donor hemoglobin concentration in the fetus at any time after transfusion allows appropriate spacing of IPT and selection of the proper gestation (after 33 to 34 weeks) for delivery. After IPT, 85% of the transfused RBCs are in the fetoplacental circulation. Residual donor hemoglobin levels in the fetus may be estimated within 1.5 g/dL 95% of the time using the following parameters: 0.85 times the fraction of donor RBCs in the fetoplacental circulation; fetal weight at the gestation donor hemoglobin levels; 125 mL/kg as fetoplacental blood volume; and 1/120 of the donor hemoglobin infused as the daily attrition rate of donor RBCs. For example, the donor RBC hemoglobin concentration at 28 weeks' gestation (fetal weight estimated to be 1150 g) 10 days after intrauterine transfusion (IUT) of 65 mL of donor RBCs with a hemoglobin concentration of 30 g/dL can be determined as follows:, 191978=Biermé SJ, Blanc M, Abbal M et al: Oral Rh treatment for severely immunized mothers. Lancet 1: 604, 1979, 186170=Hyland CA, Wolter LC, Saul A: Identification and analysis of Rh genes: Application of PCR and RFLP typing tests. Transfus Med Rev 1X: 289, 1995, 180806=Urbaniak SJ, Greiss MA, Crawford RJ, Fergusson MJ: Prediction of the outcome of Rhesus haemolytic disease of the newborn: Additional information using an ADCC assay. Vox Sang 46: 323, 1984, 187108=Liley AW: Intrauterine transfusion of fetus in haemolytic disease. Br Med J 2: 1107, 1963, 53849=Methods of titration vary from laboratory to laboratory. The Rh-antibody titer that puts a fetus at risk of developing hydrops must be determined for each laboratory (in the Winnipeg Rh Laboratory, the significant titer is 1:16 in albumin, which puts the fetus at a 10% risk of becoming hydropic before term)., 201178=Carapella-de Luca E, Casadei AM, Pascone R et al: Maternofetal transfusion during delivery and sensitization of the newborn against Rhesus D-antigen. Vox Sang 34: 241, 1978, 187376=Menticoglou SM, Harman CR, Manning FA et al: Intraperitoneal fetal transfusion: Paralysis inhibits red cell absorption. Fetal Ther 2: 154, 1987, 184211=Bowman JM, Pollock JM, Manning FA et al: Maternal Kell blood group alloimmunization. Obstet Gynecol 79: 239, 1992, 145962=Massive TPH usually occurs at the time of delivery. If TPH is diagnosed after delivery of an Rh-positive infant, multiple vials of anti-D IgG (300 μg) should be given intramuscularly as follows: two vials if the TPH is between 25 and 50 mL of blood; three vials if the TPH is between 50 and 75 mL, and so on. It is recommended that the contents of four vials (1200 μg) be given intramuscularly every 12 hours until the total dose has been administered. After administration of the total dose of anti-D IgG, the result of the Kleihauer test should be negative, and passive anti-D should be present in the maternal circulation., 182720=Brown SJ, Perkins JT, Sosler SD et al: The monocyte- monolayer assay does not predict severity of hemolytic disease of the newborn. Transfusion 31 (suppl 193): 53S, 1991, 192556=Gusdon JP Jr, Caudle MR, Herbst GA et al: Phagocytosis and erythroblastosis: 1. Modification of the neonatal response by promethazine hydrochloride. Am J Obstet Gynecol 125: 224, 1976, 185860=Bennett PR, Le Van Kim C, Colin Y et al: Prenatal determination of fetal RhD type by DNA amplification. N Engl J Med 329: 607, 1993, 90888=Eight percent of fetuses become hydropic before 32 weeks' gestation. The introduction by Liley49 in 1963 of fetal intraperitoneal transfusion (IPT) completely altered the outlook for these severely affected fetuses., 78211=Because amniocentesis is not without some hazard to the fetus, it should be undertaken only when the history or antibody titer indicates that the fetus is at risk of developing hydrops and dying. Using the history and antibody criteria already outlined as guidelines, only half of Rh-immunized pregnant women require amniocentesis. Amniocentesis should be undertaken at 18 to 19 weeks' gestation, irrespective of the titer, if there is a history of previous stillbirth or an infant who required exchange transfusion. If there is no such history, amniocentesis should be carried out only if there is an antibody titer indicating a risk of hydrops (more than 1:16 in albumin in my institution). If the critical titer is present before 18 weeks, the initial procedure is carried out at 18 to 19 weeks' gestation. If the critical titer is reached after 18 weeks' gestation, amniocentesis should be carried out within 5 to 7 days. Amniocentesis should be performed at 5- to 21-day intervals, depending on the ΔOD 450 measurement of the preceding amniotic fluid and the direction of the slope of the serial ΔOD 450 measurements already taken. Amniotic fluid ΔOD 450 readings may increase rapidly. It may be necessary to carry out amniocentesis at weekly intervals for 6 to 8 weeks before the ΔOD 450 slope is such that the interval may be increased or definitive treatment such as fetal transfusion or early delivery may be carried out., 194121=Berlin G, Selbing A, Ryden G: Rhesus haemolytic disease treated with high-dose intravenous immunoglobulin [Letter]. Lancet 1: 1153, 1985, 134947=Whereas our ability to suppress Rh immunization is doubtful, our ability to prevent Rh immunization is unquestionable, representing a major advance in the management of Rh-negative pregnant women. In 1900, the same year that Landsteiner described the ABO blood group system, Von Dungern, from ox RBC rabbit injection studies, proved the axiom that active immunization to an antigen (ox RBCs) is prevented by the presence of passive antibodies to the antigen (rabbit ox RBC antibodies).73 It is a comment on the rapidity of dissemination of scientific knowledge that this piece of basic research was not applied to the clinical problem of Rh prevention until 25 years after the discovery of the Rh blood group system and the elucidation of the pathogenesis of Rh immunization., 180045=Zupanska B, Brojer E, Richards Y et al: Serological and immunological characteristics of maternal anti-Rh(D) antibodies in predicting the severity of haemolytic disease of the newborn. Vox Sang 56: 247, 1989, 188686=Asensio SH, Figueroa-Longo JG, Pelegrina A. Intrauterine exchange transfusion. Am J Obstet Gynecol 95:1129, 1966, 98807=Pioneering attempts at direct IVT into either a fetal or placental vessel approached through a hysterotomy incision were attempted in the mid-1960s.53,54,55 The results were abysmal because the women almost invariably went into labor. In 1981, Rodeck and associates56 introduced direct transfusion through a fetoscope. Few others have achieved his skill with the fetoscope. Blood, meconium, or turbidity in the amniotic fluid makes fetoscopic visualization of the fetal blood vessels impossible. With the advent of fetal blood sampling, by the early to mid-1980s44 it became possible to follow the sampling procedure with direct IVT.57,58,59,60,61 Under ultrasound guidance, the tip of a 22- or 20-gauge spinal needle is introduced into a umbilical blood vessel, preferably the vein but occasionally the artery, at its insertion into the placenta and rarely at its insertion into the fetal abdomen., 8861=In 1992, the Rh(D) and Rh(non-D) polypeptides were cloned. Cartron and his group8 have determined that the Rh blood group locus is the product of two homologous structural genes, one of which encodes the Cc Ee polypeptide; the other (missing in Rh(D)-negative people) encodes the D antigen polypeptide. The predicted translation of the Rh(D) mRNA is a 417-aminoacid product with a molecular weight of 45,000. The D and Cc/Ee polypeptides differ by 36 aminoacid substitutions (8.4% divergence). The similarity between the two genes supports the belief that they evolved by duplication of a common ancestral gene., 191694=Carter BB: Preliminary report on a substance which inhibits anti-Rh serum. Am J Clin Pathol 17: 646, 1947, 188976=Seelen J, Van Kessel H, Eskes T et al: A new method of exchange transfusion in utero: Cannulation of vessels on the fetal side of the human placenta. Am J Obstet Gynecol 95: 872, 1966, 178963=Phibbs RH, Johnson P, Tooley WH: Cardio-respiratory status of erythroblastotic infants. II. Blood volume, hematocrit and serum albumin concentration in relation to hydrops fetalis. Pediatrics 53: 13, 1974, 156756=Anti-D IgG is prepared by the cold ethanol method originally described by Cohn in 1940. Anti-D IgG made by this process is effective and has a low incidence of untoward reactions. It does contain small amounts of IgA and IgM and traces of other plasma proteins. Some women, after a second or third injection, develop transient rashes, pain, and swelling at the injection site. There was one report of severe anaphylaxis after the use of Cohn-prepared anti-D IgG.94 Cohn-prepared anti-D IgG is anticomplementary and must not be given intravenously. The yield of anti-D in the IgG prepared by the Cohn method is at best only 40% to 50% and may be as low as 35% of that in the starting plasma., 173812=Le Van Kim C, Mouro I, Chrif-Zahar B et al: Molecular cloning and primary structure of the human blood group RhD polypeptide. Proc Natl Acad Sci USA 89: 10925, 1992, 202173=Jouvenceaux AC, Adenot N, Berthoux F et al: Gammaglobuline anti-D lyophilisee intra-veineuse pour la prevention de l'immunization anti-Rh. Rev Fr Transfus 12 (suppl): 341, 1969}",
    "textBeforeTable": "TABLE 1. Rh Gene Frequencies in a White Canadian Population of 2000 Unrelated Adults Because anti-d has never been determined, a man's zygosity for D can only be determined if he fathers two infants who have received different sets of antigens from him. Because certain sets of antigens are more common than others (Table 1), determination of the presence or absence of the other Rh antigens, C, E, c, and e, indicates the likely, but not certain, zygosity of the father for D (Table 2). Slightly fewer than half of Rh-positive people are homozygous for D (i.e., they have inherited a set of antigens containing D from both sets of parents). The remainder are heterozygous for D (i.e., they have inherited a D-containing set from only one parent). The D zygosity of an Rh-positive mate of an Rh-negative woman is important. If he is homozygous, all of his children will be Rh-positive; if he is heterozygous, there is an equal chance that the fetus will be Rh- negative or Rh-positive. Only Rh-positive fetuses can cause Rh immunization, and only Rh-positive fetuses are affected by the Rh antibody produced. The Rh blood group system is still the most important factor in erythroblastosis fetalis. It is made up of a family of inherited antigens. Although Wiener's theory of a single gene locus occupied by a pair of complex agglutinogens is the most accurate,1 the nomenclature and theories of inheritance",
    "textAfterTable": "Cde (r') 1.1 cdE (r”) 0.6 CDE (R2) 0.08 CdE (ry) 0.00 (Lewis M, Kaita H, Chown B: The inheritance of the Rh blood groups: Frequencies in 1000 unrelated Caucasian families consisting of 2000 parents and 2806 children. Vox Sang 20:502, 1971) TABLE 2. Zygosity for Rh(D) of D-Positive Husband (Mother D Negative)* Antigens A B C Present in (Most Likely (Less Likely (Least Likely Father Rh Genotype) Rh Genotype) Rh Genotype) 1. CDe CDe/CDe (R1R1) CDe/Cde (R1r')     Homozygous Heterozygous   2. CDce CDe/cde (R1r) CDe/cDe (R1R”) Cde/cDe (r'R0)   Heterozygous Homozygous Heterozygous 3. CDEce CDe/cDE (R1R2) Cde/cDE (r'R2) CDE/cDe (R2R0)   Homozygous CDe/cdE (R1r”) Homozygous     CDE/cde (R2r)       Heterozygous   4. DEc cDE/cDE (R2R2) cDE/cdE (R2r”)     Homozygous Heterozygous   5. DEce",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}