{
    "relation": [
        [
            "Patent application number",
            "20120329402",
            "20130005330",
            "20130128795",
            "20140120940",
            "20140211654",
            "20150110041"
        ],
        [
            "Description",
            "Method for controlling drive test logged measurement, drive test system and user equipment - The disclosure discloses a method for controlling Drive Test (DT) logged measurement, a DT system and User Equipment (UE). The method comprises the steps of: sending a logged measurement duration time to a UE by a network side or setting the logged measurement duration time by the UE itself; recording and reserving, by the UE, a measurement result obtained by DT; deleting the measurement result by the UE when the logged measurement duration time expires or the measurement result is reported during the logged measurement duration time. The disclosure makes the UE more efficient in reporting the measurement result and managing the storage space, thus saving memory space.",
            "Method and system for determining reason for too late handover to Home eNB - The present disclosure provides a method for determining a reason for too late handover to a Home eNB (HeNB), and the method includes that: after completing the re-establishment link of Radio. Resource Control (RRC) with User Equipment (UE), the HeNB confirms that a Radio Link Failure (RLF) event occurs when the UE is connected with a cell of another eNodeB; the HeNB generates an RLF Indication message and transmits the RLF Indication message to the another eNodeB, wherein the RLF Indication message includes information of a Closed Subscriber Group (CSG) cell currently accessed by the UE; the another eNodeB determines the reason for too late handover of the UE to the HeNB according to the RLF Indication message. The disclosure also provides a system for determining the reason for too late handover to the HeNB. The present disclosure can determine a specific reason for the RLF, and thereby, can be more useful for improving the configuration of related parameters at the network side.",
            "METHOD AND DEVICE FOR ENERGY SAVING CONTROL IN HOME BASE STATION ENVIRONMENT - A method and a device for energy saving control in the home base station environment are provided to solve the problem of energy saving control in the home base station environment. In the present invention, a source base station sends an energy saving control request to a target home base station, wherein the energy saving control request comprises the information of the target base station, the information of the source base station, and the type of the energy saving control request. After receiving the energy saving control request, the target home base station performs an energy saving control processing operation, and sends a result of the energy saving control processing to the source base station through an energy saving control response. If the energy saving control processing fails, the energy saving control response further comprises a reason for the failure and/or a wait time. In the present invention, by exchanging energy saving control related messages between the source base station and the target home base station, energy saving control can be implemented on a home base station in time, and the home base station can sleep or be awakened, and thereby effective energy saving of a network in the home base station environment is achieved.",
            "Method and system of resource reconfiguration for cognitive-radio system - The disclosure provides a method and system of resource reconfiguration for a cognitive-radio system. The method includes that: a reconfiguration module of a wireless communication system acquires a reconfiguration command according to a received spectrum refarming indication or by monitoring a network condition of the wireless communication system (",
            "Spectrum resource reconfiguration method, device, and system - A spectrum resource reconfiguration method is disclosed. The method includes: after spectrum resource configuration is triggered, a spectrum resource configuration decision is generated, and spectrum resources are configured to a to-be-configured link according to the configuration decision. Also disclosed are a spectrum resource reconfiguration device and system for implementing the method. In the disclosure, a spectrum resource Database (DB) is set and stores currently available spectrum resources and used spectrum resources. In this way, when insufficient spectrum resources occur on some links or spectrum resources are unavailable, a system may configure corresponding spectrum resources to the links according to currently available spectrum resources, so that it is ensured that the links with insufficient spectrum resources have available resources, thereby ensuring development of as many services as possible. By means of the technical solution of the disclosure, the use of spectrum resources is more reasonable, all spectrum resources may be fully utilized instead of being limited to specific spectrum resources, thereby maximally utilizing the spectrum resources.",
            "Base station, cognitive radio system, and control method for a neighbour relationship - Provided is a cognitive radio system CRS, a base station and a method for controlling a neighbour relationship, including: a serving base station actively notifies a neighbour base station of transport layer configuration information after resource reconfiguration, the neighbour base station thus performs a maintenance operation on locally saved neighbour cell information of the serving base station, which can solve the problem that the change in the neighbour relationship affects terminal services."
        ],
        [
            "Published",
            "12-27-2012",
            "01-03-2013",
            "05-23-2013",
            "05-01-2014",
            "07-31-2014",
            "04-23-2015"
        ]
    ],
    "pageTitle": "Ren, Shenzhen - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/ren-shenzhen-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441770043,
    "recordOffset": 441743505,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Longtao Ren, Shenzhen CN 09-11-2014 REVERSE CURRENT CONTROL FOR AN ISOLATED POWER SUPPLY HAVING SYNCHRONOUS RECTIFIERS - In certain example embodiments, a system is provided that includes a circuit. The system also includes a reverse current control module that provides an isolated power supply in order to protect one or more devices in a power chain during one or more testing activities having one or more requirements. 20140254206 Published Description Patent application number Ling Ren, Shenzhen CN 08-05-2010 CHANNEL ESTIMATION METHOD OF THE MOBILE COMMUNICATION SYSTEM BASED ON THE TIME DIVISION PILOT FIELD - A method of channel estimation of a mobile communication system based on a time division pilot field is disclosed. The method uses a transmitting end that transmits a time division pilot sequence having a cyclic prefix and a receiving end that transforms the time division pilot sequence into frequency domain using a fast Fourier transform module. Channel estimation is performed to obtain a channel frequency response estimation result. The receiving end transforms the channel frequency response estimation result back into time domain and obtains a channel impulse response estimation result. 20100197237 Published Description Patent application number Liang Ren, Shenzhen CN 04-28-2011 METHOD, APPARATUS AND SYSTEM FOR MAKING A DECISION ABOUT VIRTUAL MACHINE MIGRATION - A method, an apparatus, and a system for making a decision about virtual machine migration includes",
    "textAfterTable": "Patent applications by Longtao Ren, Shenzhen CN Lu Ren, Shenzhen CN Patent application number Description Published 20140219203 Method and device for reducing transmission power of uplink signal - The present disclosure provides a method for reducing the transmission power of an uplink signal, comprising: performing, by a User Equipment (UE), Component Carrier (CC) grouping on configured uplink CCs; and comparing correspondingly the transmission power of an uplink signal in each CC group with a maximum transmission power configured for the each CC group by an evolved Node B (eNB), and performing a power reduction within the CC group when the comparison result meets an intra-group power reduction condition; and/or comparing the sum of transmission powers of uplink signals in all CC groups with a maximum transmission power configured for the UE by the eNB, when the comparison result meets an inter-group power reduction condition, performing a power reduction between the CC groups. The present disclosure further provides a device for reducing the transmission power of an uplink signal. The technical solution of the present disclosure can improve the covering capability and reliability of the uplink signal in an Inter-band CA scenario, and to improve a utilization rate of a UE's uplink",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}