{
    "relation": [
        [
            "Maximum",
            "180 seconds",
            "20 seconds",
            "15 CPS"
        ],
        [
            "Details",
            "Time to get all ports into meetings (includes the time to disconnect from previous meetings)",
            "Time to get the meetings started",
            "Maximum call rate for inbound calls"
        ]
    ],
    "pageTitle": "Cisco Unified MeetingPlace, Release 7.0 -- System Capacity Quick Reference Tables - DocWiki",
    "title": "",
    "url": "http://docwiki.cisco.com/w/index.php?title=Cisco_Unified_MeetingPlace,_Release_7.0_--_System_Capacity_Quick_Reference_Tables&diff=33937&oldid=33936",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00043-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 79535739,
    "recordOffset": 79523976,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{45055=1300, 21284=1000, 49858=2000, 49991=1328, 20868=1500, 41571=2x1500}",
    "textBeforeTable": "Capacity Does not support Cisco WebEx-scheduled meetings Supports both Cisco Unified MeetingPlace-scheduled meetings and reservationless meetings Single node configuration using the Hardware Media Server and Cisco Unified MeetingPlace web conferencing Six Video blades Six Audio blades Two Windows servers (the system supports a minimum of 2 servers but scales to 6 servers depending on your configuration and features) One Cisco Unified MeetingPlace Application Server using a minimum MCS-7845-I3-RC1 or equivalent. This configuration assumes the following: Configuration Details Release 7.0.3 (MR2) with Cisco Unified MeetingPlace Web Conferencing 9.6 Recommended Practices 9.5 Redundancy 9.4 Call Rate 9.3 Sizes 9.2 Capacity 9.1 Configuration Details 9 Release 8.0 Using a Hardware Media Server from Cisco WebEx 8.6 Recommended Practices 8.5 Redundancy 8.4 Call Rate 8.3 Sizes 8.2 Capacity 8.1 Configuration Details 8 Release",
    "textAfterTable": "1000 Web sessions per Application Server when not using SSL or recording 1000 Web sessions per Application Server when using SSL or recording 500 Number of concurrent audio and web meetings per Application Server 3000 Total meetings per day 1000 Continuous meetings 50 Simultaneous meetings that can be recorded 300 Largest possible audio meeting (or 299 when recorded)2 300 Largest possible web meeting when not using SSL or recording3 300 Largest possible web meeting when using SSL or recording3 20 Simultaneous Conference Manager sessions 1 Database replication connection per Windows cluster (internal and external). Customers desiring redundancy for the SQL database must set up a database cluster sharing that one replication connection. Footnote 1: When using a 7835 (I2 or H2) server, the maximum audio ports supports is 500, independent of audio mode. Footnote 2: We recommend that you schedule larger meetings. Footnote 3: The Cisco MCS 7845-I3 Web Server supports a maximum of 600 web ports per server.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}