{
    "relation": [
        [
            "Week/Location",
            "Week 1 @ Green Bay",
            "Week 4 @ Jacksonville",
            "Week 5 @ Carolina",
            "Week 6 @ Tampa Bay",
            "Week 14 @ Tennessee",
            "Weekly Average"
        ],
        [
            "Result",
            "L",
            "W",
            "W",
            "L",
            "W",
            "N/A"
        ],
        [
            "Points Scored",
            "34",
            "23",
            "30",
            "20",
            "22",
            "34.2"
        ],
        [
            "Passing Yards",
            "419",
            "351",
            "359",
            "383",
            "337",
            "334.2"
        ],
        [
            "TD/INT",
            "3/0",
            "1/2",
            "2/1",
            "1/3",
            "2/0",
            "2.9/0.9"
        ],
        [
            "Total Yards",
            "477",
            "503",
            "444",
            "453",
            "437",
            "467.1"
        ]
    ],
    "pageTitle": "Community - CBSSports.com",
    "title": "",
    "url": "http://eye-on-football.blogs.cbssports.com/mcc/blogs/view/22475988/2?mcctag=Detroit%20Lions",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 84834959,
    "recordOffset": 84778507,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "This year, the franchise tag value will be a percentage of the overall salary cap figure for the previous five years. As such, NFL.com (the league's official website, making the figures trustworthy, one would hope) the following figures, plus figures from last year that we've included: On Monday February 20, NFL teams can begin to apply the franchise tag to players. They can do so up until March 5 at 4 p.m. ET. For those that don't know, the franchise tag is a method of keeping players from hitting the open market. Previously, the franchise-tag number was generated by averaging the top-five salaries at a position to determine a number for that position. By Will Brinson Brees reportedly won't be happy if he gets tagged. (Getty Images) What players will get franchise tagged in 2012? Edited on: February 21, 2012 9:59 am Comments (22) Add a Comment | Matthew Stafford   Posted on: February 14, 2012 9:07 am  ",
    "textAfterTable": "*The only instances this doesn't apply: when a player already made more than the franchise-tag value, or when a player receives the franchise tag for the second-straight year, in which case tagging said player would cost 120 percent of their previous base salary. Aside from the asterisked exception above, it's clearly much more cost effective to utilize the franchise tag on a player in 2012 than it was in 2011. Wide receivers like DeSean Jackson, Dwayne Bowe and Marques Colston might not be tag candidates at $11.4 million. At $9.4 million, they certainly are. With all of that in mind, let's look at some possible franchise-tag candidates, in order of likelihood to be tagged. New Orleans Saints: Drew Brees, Marques Colston or Carl Nicks The Saints are all but guaranteed to use their franchise tag. Brees is a free agent and there is a zero percent chance that they let him walk into free agency. This is an absolute zero; losing Brees would not only be a disaster for the franchise in terms of winning, it would result in riots on Bourbon Street.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}