{
    "relation": [
        [
            "Parameter",
            "Installation",
            "Aesthetics",
            "Hardware Recognition",
            "Pre-installed Packages",
            "Performance",
            "Overall"
        ],
        [
            "Weights (%)",
            "20",
            "20",
            "20",
            "10",
            "30",
            "100"
        ],
        [
            "Score",
            "10.0",
            "10.0",
            "10.0",
            "8.0",
            "9.0",
            "9.5"
        ]
    ],
    "pageTitle": "» Linuxaria – Everything about GNU/Linux and Open source Zorin OS 9 Core Review: As good as Linux Mint 17!",
    "title": "",
    "url": "http://linuxaria.com/recensioni/zorin-os-9-core-review-as-good-as-linux-mint-17",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988511.77/warc/CC-MAIN-20150728002308-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 147018351,
    "recordOffset": 146985058,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Fri, 31 Jul 2015 21:10:18 GMT",
    "textBeforeTable": "Breakup Final Score: 9.5/10 here. The present release of Zorin is at par with Linux Mint 17 Cinnamon, the best Linux distro that I used this year. This is a release you should check out definitely, if you own a touch screen laptop. You can download 32 and 64 bit versions of Zorin OS 9 from  Personally, after Zorin for a while, it feels like a rock solid distro with support for advanced hardware. It seems a very good option for users with low cost modern laptops with touch support with limited specs and running Windows 8 as the primary OS. The laptop on which I tested Zorin OS 9 is one of them and I personally didn’t have a pleasant experience with Windows 8.1. If you have a Windows 8 low spec laptop, surely you can try out Zorin and prepared to be surprised by the amazing speed and functionality it offers. Though personally I don’t like Linux operating system resembling Windows (I had really bad experiences with Windows and lost a lot of data in the past at a critical phase in my student life and OS resembling Windows reminds me of the same), but I have seen Zorin OS to be quite popular among the new users, specially those who are converting from Windows to Linux. Even I used Zorin OS for sometime in the past, but once I upgraded",
    "textAfterTable": "Popular Posts: The ultime guide of linux logging Popcorntime alternatives: watch free movies on Linux.  Posted by linuxari at 19:50  Tagged with: linux, mint 17, open source, zorin os   8 Responses to “Zorin OS 9 Core Review: As good as Linux Mint 17!” John B says: Monday August 25th, 2014 at 11:25 PM I used to use ZorinOS on my laptop. I have had it after it ruined my setup after a new update for the nth time so I switched to Mint. Perhaps things have changed since then but for me Zorin is certainly not up on par with Mint. Reply",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}