{
    "relation": [
        [
            "Categories",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I want to major in dance. It is very hard to find a Christian college with that major that isn't extremely expensive or hard to get into. It's not cheap, but it's better!",
            "I know there is a mall, I think it's called Renaissance at colony park, that is very nice, about a 15 minute drive. There are some excellent restaurants in that area! So if you like shopping, lucky you, but beware it is pricy. I also went to a movie theatre, maybe about 10 minutes, while I was at Belhaven. Plus, you're in Jackson, there is plenty to find to do when you're bored!",
            "It's ok, not as good as home cooking, but that's given since it is a college.",
            "nice dorms, from my stay over the summer the girls in Caldwell said there were cockroaches, but I don't know for sure. The showers are awesome.",
            "From what my friends have told me, academics are great, keep up on your work.",
            "keep in touch with your admissions counselor with any questions you have. Also, get in touch with the head of the department you want to major in, learn about their requirements and such.",
            "Belhaven has a beautiful campus. You can feel the seriousness and sincerity when you are on campus. Everyone I have met from there are very friendly, helpful, and kind."
        ]
    ],
    "pageTitle": "Belhaven University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Belhaven-University/reviews?_escaped_fragment_=/show/45217",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00258-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 895093787,
    "recordOffset": 895061125,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{106219=© 2015, Cappex.com, LLC, 38512=Belhaven has a fairly low tuition in comparison to other school. This is part of the reason that I chose BU. In addition to scholarships awarded for your academic competitiveness, you may try things like choir or cross country for another easy 1000 dollars or so. You can also cut some costs by applying for the many work study positions that are offered on the campus. In this particular area this school was a good choice for me., 77988=You can find everything from swing dancing to midnight breakfast to inter-murals to cowboy ho-downs at Belhaven. Late November brought the Singing Christmas Tree and September kicked off the year with a full-blown luau.}",
    "textBeforeTable": "08/19/2009 Reviewer is A current student here. 4 out of 6 people found this review useful. 1 of 27 Gwen from Pearl, MS Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp",
    "textAfterTable": "Will enjoy being here I really enjoyed my visits to the campus!!! Everyone was so friendly, even the students, they tried to you make you feel welcome at their school. It was so welcoming and homey, and it has a great atmosphere!!! And for those who want to go where there is a Christian environment, it is great!! Will learn a lot I learned a lot my two times there!!! Everyone is informative and gives you a great insight about it. You will definitely learn a lot!! Login to rate or flag the reviews Lauren from TN 04/30/2012 Reviewer is A current student here. 4 out of 4 people found this review useful. 3 of 27 Categories Comments Campus Safety The security guards are almost always within yelling distance, and the students watch out for each other. What to do for fun There is almost always",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}