{
    "relation": [
        [
            "Release",
            "11.0",
            "12.2(33)SRA",
            "12.2SX"
        ],
        [
            "Modification",
            "This command was introduced.",
            "This command was integrated into Cisco IOS Release 12.2(33)SRA.",
            "This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of this train depends on your feature set, platform, and platform hardware."
        ]
    ],
    "pageTitle": "Cisco IOS Asynchronous Transfer Mode Command Reference - show lane bus through vc-class atm [Support] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/ios-xml/ios/atm/command/atm-cr-book/atm-s2.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00240-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 362952887,
    "recordOffset": 362884540,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{63270=39.020304050607080910111213.00000CA05B43.00, 52438=local-segment-id 2048}",
    "TableContextTimeStampAfterTable": "{178338=(Optional) Number of traps. The range is from 1 to 1000. The default is 10., 132697=The following example shows the enabling of ATM PVC traps on a router, so that if PVC 0/1 goes down, host 172.16.61.90 will receive the notifications:, 152101=The following example shows all three of the extended ATM PVC traps enabled on a router. If PVC 0/1 leaves the UP state, leaves the DOWN state, or has an OAM loopback failure, host 172.16.61.90 will receive the SNMP notifications:, 191605=Enables linkUp/linkDown SNMP traps that are compliant with RFC 2233., 362076=This command was implemented on Cisco ASR 1000 series routers., 187931=The following example shows how to enable ATM subinterface traps on a device. If an ATM subinterface on this device changes state, host 172.16.61.90 will receive the notifications., 301785=The following example specifies the output-pcr, output-mcr, input-pcr,and input-mcr arguments for an ATM SVC to be 10000 kbps, 3000 kbps, 9000 kbps, and 1000 kbps, respectively:, 130143=This command was integrated into Cisco IOS XE Software Release 2.3 and implemented on the Cisco ASR 1000 series routers., 231365=The ces keyword was added to configure CES encapsulation when using the OC-3/STM-1 ATM Circuit Emulation Service network module on Cisco 2600 and Cisco 3600 series platform., 182646=The snmp-server trap link ietf command must be configured in order to use the snmp-server enable traps atm subif command. The snmp-server trap link ietf command is used to configure a router to use the RFC 2233 IETF standards-based implementation of linkUp/linkDown traps. The default Cisco object definitions do not generate linkUp/linkDown traps correctly for subinterfaces., 155810=In the following example, the ATM OAM CC notifications and an extended ATM PVC notification are enabled. If connectivity failures are detected on PVC 0/1, host 172.16.61.90 will receive the SNMP notifications:}",
    "textBeforeTable": "Syntax Description [brief] elan-name ] subinterface-number ] | name [ . number atm [ interface bus lane show Cisco 4500 and 4700 Routers [brief] elan-name ] subinterface-number ] | name [ . slot/port-adapter/port atm [ interface bus lane show ATM Port Adapter on the Cisco 7500 Series Routers [brief] elan-name ] subinterface-number ] | name [ . slot/port atm [ interface bus lane show AIP on the Cisco 7500 Series Routers; ATM Port Adapter on the Cisco 7200 Series To display detailed LAN Emulation (LANE) information for the broadcast and unknown server (BUS) configured on an interface or any of its subinterfaces, on a specified subinterface, or on an emulated LAN (ELAN), use the show lane bus command in user EXEC or privileged EXEC mode. show lane bus vc-class atm vbr-rt vbr-nrt ubr+ cos ubr+ ubr tx-limit transmit-priority svc sscop send-window sscop receive-window sscop",
    "textAfterTable": ". subinterface-number (Optional) Subinterface number. name elan-name (Optional) Name of the ELAN. The maximum length of the name is 32 characters. brief (Optional) Displays the brief subset of available information. Command Modes User EXEC Privileged EXEC Command History Release Modification 11.0 This command was introduced. 12.2(33)SRA This command was integrated into Cisco IOS Release 12.2(33)SRA. 12.2SX This command is supported in the Cisco IOS Release 12.2SX train. Support in a specific 12.2SX release of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}