{
    "relation": [
        [
            "Month",
            "Jan",
            "Feb",
            "Mar",
            "Apr",
            "May",
            "Jun",
            "Jul",
            "Aug",
            "Sep",
            "Oct",
            "Nov",
            "Dec"
        ],
        [
            "Climate",
            "Moderately Cold",
            "Moderately Cold",
            "Pleasant",
            "Moderately Hot",
            "Very Hot",
            "Moderately Hot",
            "Rainy",
            "Rainy",
            "Pleasant",
            "Pleasant",
            "Pleasant",
            "Moderately Cold"
        ],
        [
            "Details",
            "Weather during this month is comfortably cold with clean atmosphere. It is a great time for taking up holiday package for Mount Abu. In fact, a suitable month for honeymooning, sightseeing and outdoor actions. Warm clothes are preferable for this period. Camel festival is also held in this month.",
            "Feb has mild cold climate with lots of sunshine. The month is ideal for discovering and exploring the city and its borders. You can indulge in sightseeing and outdoor activities. Light warm clothes are recommended.",
            "March is accompanied by warm days and light cold nights. Days are beautiful with good amount of sunshine. The moderate weather makes it completely ideal for tourist visits. Good time for sighting attractions and carrying out outdoor activities.",
            "Summer days have comfortably hot climate making it possible for vacation or tourist visits. Days are warm with lots of sunshine. Nights offer relatively cool climate as compared to daytime. Carry protective sun gear for this period.",
            "This month offer hot weather. The environment becomes comfortable during nights. It may not be best time but tourist visits are still possible. Make sure you carry protective sun gear for visiting this hill station during summer season.",
            "June brings in light showers reducing the temperature to some extent. The climate is hot but still lies within the comfortably hot zone making it possible for tourist visits. It is preferable to carry sunscreens or sun protective products.",
            "The wonderful monsoon is here. The south west monsoon brings lots of rain in this month. The climate is comfortable. The place is entirely soaked in rains and the place becomes very scenic. It is great month for nature lovers to take up travel package for Mount Abu to enjoy the scenic beauty of nature.",
            "The place receives highest amount of rainfall during this month. The weather becomes pleasing and the natural beauty is in its prime during monsoons. It is a perfect month for enjoying waterfalls, lush green mountains & romantic mist. It would be a good idea to carry proper rain gear for your trip.",
            "Monsoon season continues but September offers less rainfall and the temperature remains nice and comfortable making it suitable for carrying out tourist activities. It is also a great time for enjoying lush greenery and serene sights of the place. In fact, a good month for nature enthusiast.",
            "The month offers mild climate. Days are comfortably warm followed by pleasant and enjoyable nights. It is one a good month for exploring in and around the city. Enjoyable time for visiting various tourist attractions like Nakki Lake, Dilwara Temples etc and indulging in outdoor activities.",
            "Winter season begins from this month offering pleasing weather which makes it perfect for tourism in Mount Abu. Days offer quite pleasing climate while nights are comparatively cool. Indulge in sightseeing, outings and outdoor activities during this month.",
            "The hill station has mild cold weather in December. Pleasant days with cold nights. It is the best month for taking up package for honeymoon in Mount Abu. The climate is favorable for all kinds of tourist activities. Light warm clothes are recommended for this month."
        ]
    ],
    "pageTitle": "MOUNT ABU Weather, Temperature, Best Season, Mount Abu Weather Forecast, Climate",
    "title": "",
    "url": "http://www.mustseeindia.com/Mount-Abu-weather",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00200-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 602242287,
    "recordOffset": 602209701,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Mount Abu Weather Home  ›  Destinations  ›  Rajasthan  ›  Mount Abu  ›  Weather   var addthis_config = {services_compact: 'facebook,print,twitter,email,google,gmail,pinterest,blogger,stumbleupon,favorites,tumblr,more'}; register_onload(function(){hide_zedo_image()}); googletag.cmd.push(function() { googletag.display('div-gpt-ad-1325834386456-188'); }); }); googletag.enableServices(); googletag.defineSlot('/1008434/season-header-1-banner', [728, 90], 'div-gpt-ad-1325834386456-188').setTargeting('NetworkId', 'season').addService(googletag.pubads()); googletag.cmd.push(function() { add_comscore(); } el.parentNode.insertBefore(s, el); s.src = (document.location.protocol == \"https:\" ? \"https://sb\" :\"http://b\") + \".scorecardresearch.com/beacon.js\"; s.async = true; el = document.getElementsByTagName(\"script\")[0]; var s = document.createElement(\"script\"); function add_comscore(){ _comscore.push({ c1: \"2\", c2: \"15366170\" }); var _comscore = _comscore || [];  ",
    "textAfterTable": "View all photos Best Season: Throughout the year Summer 32 to 45Â°C, Winter 5 to 32Â°C Best Season / Best time to visit Mount Abu The climate of Mount Abu is quite cool and can be visited all through the year. Winters (November to February) has a maximum temperature of 29Â°C and a minimum of about 12Â°C. This season is best for taking up honeymoon packages in Mount Abu. The weather is perfect for sightseeing and outdoor activities as well. Summers (April to June) the temperature touches maximum level of 33Â°C and a minimum of 23Â°C. Weather remains pleasant in daytime while nighttime can be cool. This period is ideal for tourist visits. Monsoons (July to September) receives an average rainfall of 70 â\u0080\u0093 180 cm. Weather during this season is moderate and natural beauty is in its prime. It is a favorable time for tourism in Mount Abu. Lush greenery, waterfalls and mountain mist can be best enjoyed in monsoon. Mount Abu is a popular destination for Rajasthan tourism . Winter months are perfect for exploring and enjoying honeymoon",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}