{
    "relation": [
        [
            "Subject",
            "Achieve the most from Big Data with HP Software Ed...",
            "“Are you a Subject Matter Expert in HP Vertica?” T..."
        ],
        [
            "Kudos",
            "1",
            "1"
        ]
    ],
    "pageTitle": "HP Software Solutions Blog - HP Enterprise Business Community",
    "title": "",
    "url": "http://h30499.www3.hp.com/t5/HP-Software-Solutions-Blog/bg-p/sws-667/label-name/Software%20Solutions",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990611.52/warc/CC-MAIN-20150728002310-00096-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 107873947,
    "recordOffset": 107799978,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{325296=HP has historically taken a strong stand against the proliferation of open source licenses.  We’ve never proposed our own open source license. I started speaking out against license proliferation as early as 2005, pointing to the interoperability and compatibility issues raised by having a large number of open source licenses.  Many members of the open source community have also embraced the concept of non-proliferation. The reaction to any new license tends to center around whether a new license addresses an unmet need. That’s why I am concerned about a new license proposed by Oracle., 237830=What are your biggest concerns with a centralized IT department? Between now and 2020, what major technology challenges will your organization face? Share your thoughts on the software-defined enterprise, and let us know the issues you encounter when managing constant change., 76864=The February edition of the IT Experts Newsletter is out now!}",
    "TableContextTimeStampAfterTable": "{48177=© 2015 Hewlett-Packard Development Company, L.P.}",
    "textBeforeTable": "Top Kudoed Posts Do you mean  Search instead for  Showing results for  Auto-suggest helps you quickly narrow down your search results by suggesting possible matches as you type. turn on suggestions CommunityCategoryBlogKnowledge BaseUsers",
    "textAfterTable": "View All Featured Follow Us",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}