{
    "relation": [
        [
            "Architeture",
            "ARM (eabi)",
            "AVR",
            "X86",
            "PowerPC",
            "MIPS"
        ],
        [
            "CPUtype",
            "1136jfs,xscale(-hf),iwmmx,v4t(-hf),v5te,xscale",
            "n/a",
            "i586, i686",
            "603e",
            "mipsel (softfloat)"
        ],
        [
            "gcc",
            "4.1.2, 4.3.2",
            "3.4.6, 4.1.2, 4.3.2",
            "4.1.2, 4.3.2",
            "4.1.2, 4.3.2",
            "4.2.3"
        ],
        [
            "glibc",
            "2.5, 2.8",
            "1.0.5, 1.4.8, 1.6.2",
            "2.5, 2.8",
            "2.5, 2.8",
            "2.8"
        ],
        [
            "binutils",
            "2.17, 2.18",
            "2.17",
            "2.17, 2.18",
            "2.17, 2.18",
            "2.18"
        ],
        [
            "kernel header",
            "2.6.18, 2.6.27",
            "n/a",
            "2.6.18, 2.6.27",
            "2.6.18, 2.6.27",
            "2.6.27"
        ]
    ],
    "pageTitle": "Toolchains - eLinux.org",
    "title": "OSELAS.Toolchain() Feature matrix (v1.99.1, build with PTXdist v1.99.7)",
    "url": "http://elinux.org/index.php?title=Toolchains&oldid=10590",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00154-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 79723218,
    "recordOffset": 79706824,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The OSELAS.Toolchain() project aims at supplying a complete build system for recent GNU toolchains. It uses the PTXdist build system, a userland build system based on Kconfig. The current version 1.99.3.1 of OSELAS.Toolchain() contains support for arm, x86, avr, mips and PowerPC. In addition, there are toolchains for bare metal platforms like Cortex-M3 and AVR-8-Bit. OSELAS.Toolchain() Crossdev is a project sponsored by Timesys, completely unrelated to the Gentoo cross toolchain generation system. The projects main focus is on a tool called tsrpm which is used to build cross development toolchains and generate cross-compiled software packages. Currently only x86 and select PowerPC architectures are supported. Link: Crossdev Crossdev/tsrpm (Timesys) Crosstool-NG is a well-maintained fork of crosstool, targeted at easier configuration, re-factored code, and a learning base on how toolchains are built, with support for both uClibc and glibc, for debug tools (gdb, strace, dmalloc...), and a wide range of versions for each tools. Different target architectures are supported as well. It offers a kernel-like configuration system to select the different configuration options of the toolchain (component versions, component configuration, etc.). Crosstool-NG has an active and responsive user and developer community. Crosstool-NG Crosstool is probably the first publicly-released script which downloads source tar-balls and builds simple gcc/glibc cross toolchains. Originally written by Dan Kegel, it only supported glibc toolchains, and is now unmaintained. Crosstool Crossdev is specific to",
    "textAfterTable": "OSELAS.Toolchain() contains some further goodies like gcj support for ARM and mingw Support for x86. Link: OSELAS.Toolchain() Link: PTXdist Bitbake Bitbake is the tool used by OpenEmbedded. There is a bitbake manual at http://bitbake.berlios.de/manual/, but the best way to get started is probably by just building an existing distribution that uses openembedded (e.g. Ångström, see http://www.angstrom-distribution.org/building-%C3%A5ngstr%C3%B6m for details). By Platform ARM See ARMCompilers Retrieved from \" http://elinux.org/index.php?title=Toolchains&oldid=10590\" Category: Development Tools Navigation menu Personal tools Create account Log in Namespaces Page",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}