{
    "relation": [
        [
            "image",
            "title",
            "Height",
            "Length",
            "Width",
            "Weight",
            "Binding",
            "price",
            "reviews",
            "link",
            "Brand",
            "Color",
            "Feature",
            "Title",
            "Reviews",
            "Link"
        ],
        [
            "",
            "Aidapt Aluminium Rollator Walking Aid",
            "36.61 inch",
            "28.35 inch",
            "22.44 inch",
            "17.64 pound",
            "Personal Care",
            "56.00",
            "Read Reviews",
            "More Info",
            "Aidapt",
            "Silver",
            "Lightweight, strong aluminium frame durable enough for daily use Anatomically-designed handgrips and loop cable brakes, suitable for users with little grip power Supplied with a useful basket and comfortable, padded seat Folds for easy storage and transportation 114 kg (18 stone) user weight limit",
            "Aidapt Aluminium Rollator Walking Aid",
            "Read Reviews",
            "More Info"
        ],
        [
            "",
            "Lightweight Rollator with Bag – Red",
            "",
            "",
            "",
            "",
            "Personal Care",
            "53.99",
            "Read Reviews",
            "More Info",
            "Drive Medical",
            "",
            "",
            "Lightweight Rollator with Bag – Red",
            "Read Reviews",
            "More Info"
        ],
        [
            "",
            "Z-TEC Deluxe Lightweight Aluminium Tri-Walker in Metallic Red",
            "",
            "",
            "",
            "",
            "Personal Care",
            "56.80",
            "Read Reviews",
            "More Info",
            "Z-TEC",
            "",
            "",
            "Z-TEC Deluxe Lightweight Aluminium Tri-Walker in Metallic Red",
            "Read Reviews",
            "More Info"
        ],
        [
            "",
            "Able2 Aluminium 4-wheel Rollator Walker (Blue)",
            "",
            "",
            "",
            "",
            "",
            "79.90",
            "Read Reviews",
            "More Info",
            "Electrovision by MotionPerformance",
            "",
            "",
            "Able2 Aluminium 4-wheel Rollator Walker (Blue)",
            "Read Reviews",
            "More Info"
        ],
        [
            "",
            "Powertek 4 Wheel Indoor/ Outdoor Rollator",
            "",
            "",
            "",
            "",
            "Personal Care",
            "107.35",
            "Read Reviews",
            "More Info",
            "POWERTEK",
            "",
            "",
            "Powertek 4 Wheel Indoor/ Outdoor Rollator",
            "Read Reviews",
            "More Info"
        ]
    ],
    "pageTitle": "Essential Items: Topro Troja Rollator - Living with Disability | Living with Disability",
    "title": "",
    "url": "http://livingwithdisability.info/rollator-walker-reviews/",
    "hasHeader": true,
    "headerPosition": "FIRST_COLUMN",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 137573771,
    "recordOffset": 137549097,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{11590=Topra Trojan rollator please can u tell me where I can view these I live Newcastle upon Tyne look forward to a reply.}",
    "textBeforeTable": "  To see other Rollator Walker Reviews see the table below: To find out about the brand new addition to the topro troja range see our new post:  Topro 2G As the video shows, the Topro Troja Rollator is fantastic for using in all locations and provides great support for the user. Customers never fail to be impressed with the flexibility and support provides by the Troja and it really is the number one walker around. If you’re interested in finding out more, click on the box below: This video shows the Topro Troja in use: The Troja is a four wheeled walker, which allows for maximum support when being used and it is extremely easy to fold away and store safely, with the added bonus of being able to remain on its wheels when stored. As it’s such a small and portable item it’s great for putting in the boot of your car, using on the bus or even in the hold of an aeroplane. The Troja is also equipped with powerful breaks to maintain complete control when using it. Lightweight and travel-friendly The Troja is the original rollator walker designed by the Norwegian brand Topro and it is known for being the best",
    "textAfterTable": "Related Posts None One Response to “Essential Items: Topro Troja Rollator Walker Reviews” Sally bleazard Twitter: I do not use twitter says: August 9, 2014 at 3:05 pm Topra Trojan rollator please can u tell me where I can view these I live Newcastle upon Tyne look forward to a reply. Trackbacks/Pingbacks All New Topro Troja 2G Rollator - Living with DisabilityLiving with Disability - [...] previously discussed the fantastic Topro Troja Rollator back in February, we’re pleased to announce that a new model was … Topro Troja Rollator Walker - Lap Desk Travel BagLap Desk Travel Bag - [...] about a Topro troja walker. The Original topro troja from the Norwegian company Topro. Useful guide to how they … The Topro Troja – a rollator walker from Mobility ChoicesWheelchair Lap Trays",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}