{
    "relation": [
        [
            "Package",
            "Early Rounds (5 nights)",
            "Early Rounds (6 nights)",
            "2nd & 3rd Rounds (5 nights)",
            "Later Rounds (6 nights)",
            "Final Rounds (6 nights)"
        ],
        [
            "Dates",
            "Sat Jan 16 – Thu Jan 21",
            "Sat Jan 16 – Fri Jan 22",
            "Tue Jan 19 – Sun Jan 24",
            "Fri Jan 22 – Thu Jan 28",
            "Tue Jan 26 – Mon Feb 1"
        ],
        [
            "Silver Corporate seats in Rod Laver Arena (RLA) Advantage Seats in Margaret Court Arena (MCA)",
            "Combination of 2 sessions in RLA & 2 sessions in MCA Mon Jan 18 – Wed Jan 20",
            "4 Day & 4 Night Sessions in RLA Mon Jan 18 – Thu Jan 21",
            "Combination of 2 sessions in RLA & 2 sessions in MCA Thu Jan 21 – Sat 23",
            "4 Day & 4 Night Sessions Sun Jan 24 – Wed Jan 27",
            "1 Day & 1 Night Session 3 Twilight Sessions Thu Jan 28 – Sun Jan 31"
        ],
        [
            "Price Per Person",
            "$2350",
            "$3575",
            "$2675",
            "$5625",
            "$7275"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Australian Open 2016 Tour Packages",
    "title": "",
    "url": "http://www.grandslamtennistours.com/australian-open-packages/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 503494183,
    "recordOffset": 503475506,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16620=Your flight crosses the International Date Line on its journey down to the South Pacific, so you actually ‘jump over’ this day. You actually arrive two days later than you departed. For example, if you leave on Fri. Jan. 13 you will arrive in Melbourne on Sun. Jan. 15. However, the day you have ‘lost’ on your flight down will be returned to you when you come back home again, so it all balances out in the long run. On your return, you arrive in LA earlier on the same day that you departed Melbourne., 17555=During the first 11 days, day sessions start at 11:00 a.m and night sessions at 7:30 p.m. The last night session is the second Thursday. Friday session starts at 3:00 pm, Saturday at 1:00 p.m. and Sunday at 4:30 p.m. You will be advised of any last minute changes in scheduling., 15513=They are very flexible. We have blocked seats for specific departure and return dates in January. However, you can travel to the South Pacific a few weeks earlier and stay through February…up to one month. Fares are available for longer stays. We have a variety of special side trips and stopovers to choose from. Click here to go to our Explore More packages to New Zealand and other Cities in Australia.}",
    "textBeforeTable": "*Rates are per person based on double occupancy Melbourne Tennis Packages FAQ Hotels What is Included Sample Itinerary Packages Have a question about an Australian Open package? Call your Grand Slam Tennis Tours specialist at 802.549.4658 or download a brochure. As an official tour operator, Grand Slam Tennis Tours offers the best courtside seats in both Rod Laver and Margaret Court Arenas guaranteeing you an unforgettable tennis experience. Our hotel accommodations are within walking distance of many great restaurants and shops, as well as all the tennis action at Melbourne Park. We also provide access to corporate hospitality areas to cool down and grab a bite to eat in between matches. Want more? We can arrange excursion packages around Australia, New Zealand, and the South Pacific to make your vacation the trip of a lifetime. The Australian Open kicks off the tennis year down under in Melbourne with a bang! With brilliant facilities and all the top players, the Australian summer plays perfect host to the drama. Jan 18 – 31, 2016 | Melbourne, Australia timer_metaslider_893(); }; var slider = !window.jQuery ? window.setTimeout(timer_metaslider_893, 100) : !jQuery.isReady ? window.setTimeout(timer_metaslider_893, 1) : metaslider_893(window.jQuery); var",
    "textAfterTable": "*Additional nights: $225 per person per night *Single supplements: $200 per night *Grand Slam Tennis Tours Tours offers rain insurance – ask your sales representative for details **Includes Accommodation, Tickets, Luncheon, Gift and Services of Grand Slam Tennis Tours Hosts *Rates are per person based on double occupancy Package Dates Lower Level Seats in Rod Laver Arena Price Per Person   2 Men’s Quarterfinals & Men’s Semifinals (6 nights) Sun Jan 24 – Sat Jan 30 2 Night Sessions: Tue Jan 26 and Wed Jan 27 2 Twilight Sessions: Thu Jan 28 and Fri Jan 29 $4850 Men’s Semifinals & Ladies and Men’s Final (6 nights) Tue Jan 26 – Mon Feb 1 1 Night Session: Thu Jan 28 3 Twilight Sessions: Fri Jan 29 – Sun Jan 31 $5375 Final Rounds** (4 nights) Thu Jan 28 – Mon Feb 1 2 Twilight Sessions Sat Jan 30 and Sun Jan 31 $3950 *Additional nights: $225 per person per night *Single supplements: $200 per night *Grand Slam Tennis Tours Tours offers rain insurance – ask your sales representative for details Melbourne Tennis Package Sample Itinerary",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}