{
    "relation": [
        [
            "Player",
            "Henrik Sedin",
            "Jason Garrison",
            "Daniel Sedin",
            "Mike Santorelli",
            "Ryan Kesler"
        ],
        [
            "GP",
            "10",
            "10",
            "10",
            "10",
            "10"
        ],
        [
            "G",
            "2",
            "2",
            "2",
            "4",
            "3"
        ],
        [
            "A",
            "10",
            "7",
            "6",
            "2",
            "1"
        ],
        [
            "P",
            "12",
            "9",
            "8",
            "6",
            "4"
        ],
        [
            "+/-",
            "2",
            "-3",
            "0",
            "3",
            "-5"
        ]
    ],
    "pageTitle": "Game 11: Canucks @ Islanders (10.22.13) - Vancouver Canucks - Features",
    "title": "",
    "url": "http://canucks.nhl.com/club/news.htm?id=687866",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00181-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 41864815,
    "recordOffset": 41842913,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{5082=Puck drop at 4 pm PT - Live on Sportsnet Pacific, The TEAM 1040, or online at teamradio.ca., 680=Prior to their 4-3 home loss to Carolina on Saturday, the Islanders had earned at least a point in 10 straight games on home ice (7-0-3) dating back to last season. That streak was their longest consecutive home game point streak in 31 years. The 10-game streak pales in comparison to the one they enjoyed back in 1982, however. They went 30 straight games with a point earned from January 2 to October 30, 1982 compiling a record of 28-0-2 during that stretch., 1245=Captains in Islanders team history, the latest being John Tavares who was named to the position back on September 1., 2104=Years since the Canucks' last visit to Long Island – a 4-3 Vancouver shootout win on Jan. 11, 2011.}",
    "TableContextTimeStampAfterTable": "{10996=Canucks.com is the official Web site of The Vancouver Canucks. The Vancouver Canucks and Canucks.com are trademarks of The Vancouver Canucks Limited Partnership.  NHL, the NHL Shield, the word mark and image of the Stanley Cup and NHL Conference logos are registered trademarks of the National Hockey League. All NHL logos and marks and NHL team logos and marks as well as all other proprietary materials depicted herein are the property of the NHL and the respective NHL teams and may not be reproduced without the prior written consent of NHL Enterprises, L.P. Copyright © 1999-2015 The Vancouver Canucks Limited Partnership and the National Hockey League. All Rights Reserved.}",
    "textBeforeTable": "2013.14 Regular Season Canucks Leading Scorers Prior to their 4-3 home loss to Carolina on Saturday, the Islanders had earned at least a point in 10 straight games on home ice (7-0-3) dating back to last season. That streak was their longest consecutive home game point streak in 31 years. The 10-game streak pales in comparison to the one they enjoyed back in 1982, however. They went 30 straight games with a point earned from January 2 to October 30, 1982 compiling a record of 28-0-2 during that stretch. Did You Know Games played by Roberto Luongo against the team that drafted him. He has a 7-10-3 career record versus the Islanders. 23 Captains in Islanders team history, the latest being John Tavares who was named to the position back on September 1. 14 Game point streak for John Tavares coming into tonight's game (4-6-10). 7 Game point streak for Henrik Sedin coming into tonight's game (2-4-6). 5 Straight games played without a regulation loss for the Canucks at Long Island (2-0-2). 4 Years since the Canucks' last visit to Long Island – a 4-3 Vancouver shootout win on Jan. 11, 2011. 2 By the Numbers Nabokov shuts",
    "textAfterTable": "Islanders Leading Scorers 2013.14 Regular Season Player GP G A P +/- John Tavares 8 4 6 10 1 Frans Nielsen 8 4 4 8 5 Kyle Okposo 8 3 5 8 2 Michael Grabner 8 2 6 8 2 Josh Bailey 8 3 4 7 4 In the Infirmary For the Canucks... F Jordan Schroeder (lower body) and F Alex Burrows (foot) are on the injured reserve list. For the Islanders... D Lubomir Visnovsky (concussion) is on the injured reserve list. F Michael Grabner is serving an NHL suspension.  ",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}