{
    "relation": [
        [
            "FILSON SHIRTS",
            "Neck",
            "Sleeve",
            "Back length",
            "XL Sleeve",
            "XL Back Length"
        ],
        [
            "S",
            "15",
            "33 7/8",
            "32",
            "N/A",
            "N/A"
        ],
        [
            "M",
            "16",
            "34 1/4",
            "32 1/2",
            "36",
            "34"
        ],
        [
            "L",
            "17",
            "35 1/8",
            "33",
            "36 5/8",
            "34 1/2"
        ],
        [
            "XL",
            "18",
            "35 3/4",
            "33 1/2",
            "37 1/4",
            "35"
        ],
        [
            "XXL",
            "19",
            "36 3/8",
            "34",
            "37 7/8",
            "35 1/2"
        ],
        [
            "XXXL",
            "20",
            "37",
            "34 1/2",
            "N/A",
            "N/A"
        ]
    ],
    "pageTitle": "Alaskan Guide Shirt - Extra Long | Filson",
    "title": "",
    "url": "http://www.filson.com/products/alaskan-guide-shirt-extra-long.12007.html?fromCat=true&fvalsProduct=mens/workwear&fmetaProduct=1013",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445343283,
    "recordOffset": 445321671,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7483=\"We guarantee every item purchased from us. No more, no less. Your satisfaction is the sole purpose of our transaction.\" — Clinton C. Filson, 1897}",
    "textBeforeTable": "The Alaska Fit Extra Long Shirt represents classic Filson designs, in which garments are roomy and generously cut to accommodate heavy layering. Long shirts have 1-1/2\" longer sleeves and 1-1/2\" longer body length. Alaska Fit Extra Long 7-oz. cotton flannel Imported L, XL, 2XL, 3XL Machine wash Product Care Field; Workwear; Hunting; Shooting; Everyday Usage Medium-weight fabric is wind and abrasion resistant Cut extra long for added coverage Straight collar Adjustable button-closure cuffs 2 flap pockets Button-front closure Pleated back for ease of movement in shoulders, with hanging loop for license Features This durable, breathable shirt is made with medium-weight cotton that's brushed for comfort. It's cut for mobility and wind resistance, with adjustable cuffs, dual expandable pockets and a back hanging loop to display your license. Reviews Fit Notes Fabric Info Details To order by phone, please call 1-866-860-8906 Tweet Alaskan Guide Shirt - Extra Long",
    "textAfterTable": "Filson shirts: In general order by your neck and sleeve measurements. If machine wash/line dry, allow for moderate shrinkage. *Measurements can vary by style, please contact customer service if you need specific details. Shipping & Returns | Filson Guarantee | Print Page Committed to Our Customers Visit our customer care center, or call 1-866-860-8906 for custom hemming, returns, customer service or sales. SUPPORTING U.S. MANUFACTURING Always committed to producing the best products, Filson continues to offer goods made by the American",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}