{
    "relation": [
        [
            "Player",
            "Babe Ruth",
            "Babe Ruth",
            "Babe Ruth",
            "Lou Gehrig",
            "Babe Ruth",
            "Babe Ruth",
            "Babe Ruth",
            "Hack Wilson",
            "Lou Gehrig",
            "Babe Ruth",
            "Jimmie Foxx",
            "Jimmie Foxx",
            "Lou Gehrig",
            "Lou Gehrig",
            "Joe DiMaggio",
            "Jimmie Foxx",
            "Manny Ramirez",
            "Todd Helton",
            "Albert Pujols"
        ],
        [
            "Year",
            "1920",
            "1921",
            "1926",
            "1927",
            "1927",
            "1929",
            "1930",
            "1930",
            "1931",
            "1931",
            "1932",
            "1933*",
            "1934*",
            "1936",
            "1937",
            "1938",
            "1999",
            "2001",
            "2006"
        ],
        [
            "HR",
            "54",
            "59",
            "47",
            "47",
            "60",
            "46",
            "49",
            "56",
            "46",
            "46",
            "58",
            "48",
            "49",
            "49",
            "46",
            "50",
            "44",
            "49",
            "49"
        ],
        [
            "RBI",
            "137",
            "171",
            "146",
            "175",
            "164",
            "154",
            "153",
            "191",
            "184",
            "163",
            "169",
            "163",
            "165",
            "152",
            "167",
            "175",
            "165",
            "146",
            "137"
        ],
        [
            "AVG",
            ".376",
            ".378",
            ".372",
            ".373",
            ".356",
            ".345",
            ".359",
            ".356",
            ".341",
            ".373",
            ".364",
            ".356",
            ".363",
            ".354",
            ".346",
            ".349",
            ".333",
            ".336",
            ".331"
        ]
    ],
    "pageTitle": "Triple Crown or not, Miguel Cabrera having season for ages | tigers.com",
    "title": "Players who have batted at least .330 with at least 44 homers and 137 RBIs in a season",
    "url": "http://m.tigers.mlb.com/news/article/39427190",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 154681679,
    "recordOffset": 154660386,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{7364=For more perspective, Alex Rodriguez has only batted better than .330 once, and he did that in his first full season. Larry Walker reached the average (.366) and home run requirement (49) in 1997, but fell short in RBIs (130). Jim Rice, one of the most feared sluggers of all-time, was never able to hit better than .325., 6722=Todd Helton used the thin air of Colorado to help him reach the .330/44/137 standard in 2001, when he batted .336 with 49 home runs and 146 RBIs. And Albert Pujols made it in '06, when he batted .331 with 49 home runs and 137 RBIs en route to a World Series title with the Cardinals., 6086=Only two other players -- Joe DiMaggio and Hack Wilson -- managed to join that Hall of Fame company before World War II. DiMaggio did it in 1937, when he batted .346 with 46 homers and 167 RBIs, and Wilson did it in '30, when he set the all-time single-season record with 191 RBIs., 7029=Barry Bonds notably never made it to this peak, but he did come close twice. Bonds batted .336 with 46 home runs in 1993 -- his first season with San Francisco -- but fell short with 123 RBIs. Bonds logged more than 130 RBIs once (137 in 2001), but he fell short by batting .328 with 73 homers in that campaign., 5438=Ruth's teammate, the great Lou Gehrig, pulled off the feat four times (1927, '31, '34 and '36). Gehrig won the MVP Award in two of those campaigns, including his Triple Crown season of '34. Amazingly, both Gehrig and Ruth exceeded the .330/44/137 line in '27 en route to the World Series title., 5756=Hall of Famer Jimmie Foxx also put his stamp on this category by doing it three times -- in 1932, '33 and '38 -- and taking home the MVP Award trophy all three times. Foxx won the Triple Crown in '33, but he was even better in '32, when he batted .364 with league-high totals in homers (58) and RBIs (169)., 6391=The baseball world would have to wait more than six decades from the final time Foxx did it before a new member would join the club. Manny Ramirez batted .333 with 44 homers and 165 RBIs in his epic 1999 season with the Cleveland Indians, and two other players have since managed to join that elite company.}",
    "textBeforeTable": "Seasons to remember If the Detroit third baseman's average doesn't dip by more than a point in the finale, he would be one of just nine players to hit for a .330 average with at least 44 home runs and 137 RBIs, and he'd be one of only four players who have done it since World War II. There have been 19 such seasons by those eight players, but only two resulted in a Triple Crown. Cabrera, who goes into his final game leading the American League in batting average (.331), home runs (44) and RBIs (139), can boast of a season in line with the greatest in big league history. Miguel Cabrera's 2012 season will be one for the ages, regardless of whether or not he comes home with the Triple Crown. 0 COMMENTS + | MLB.com By Spencer Fordin / 10/02/12: Tigers manager Jim Leyland and Miguel Cabrera talk about Cabrera's potential playing",
    "textAfterTable": "* Triple Crown season Cabrera's line has him dwelling in the company of the game's greatest players. Babe Ruth hit .330 with 44 homers and at least 137 RBIs seven times, but he never won the Triple Crown. Ruth led his league in average just once (.378 in 1924), and he only had 121 RBIs, good for second in the AL that season. Ruth's teammate, the great Lou Gehrig, pulled off the feat four times (1927, '31, '34 and '36). Gehrig won the MVP Award in two of those campaigns, including his Triple Crown season of '34. Amazingly, both Gehrig and Ruth exceeded the .330/44/137 line in '27 en route to the World Series title. Hall of Famer Jimmie Foxx also put his stamp on this category by doing it three times -- in 1932, '33 and '38 -- and taking home the MVP Award trophy all three times. Foxx won the Triple Crown in '33, but he was even better in '32, when he batted .364 with league-high totals in homers (58) and RBIs (169). Only two other players -- Joe DiMaggio and Hack Wilson -- managed to join that Hall of Fame company before World War II. DiMaggio did it in 1937, when he batted .346 with 46 homers and 167 RBIs, and Wilson did it in '30, when he set the all-time single-season record with 191 RBIs. The baseball world would have to wait more than six",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}