{
    "relation": [
        [
            "Operating System (64 bit)",
            "Debian KDE 7.3.0",
            "Neptune 3.3",
            "Netrunner 13.06",
            "Siduction 13.2.0",
            "Mint 15 KDE",
            "Solydk 2013.11",
            "Bridge Linux 2013.06",
            "Mint 16 KDE",
            "PCLinuxOS 2013.12",
            "Kwheezy 1.4",
            "Kubuntu 13.04",
            "Mageia 3",
            "Calculate Linux 13.11 KDE",
            "Kubuntu 13.10",
            "Chakra Fritz 2013.09",
            "OpenSUSE 13.1",
            "ROSA Fresh KDE R2",
            "Manjaro 0.8.8 KDE",
            "Fedora 20 KDE",
            "Korora 19.1",
            "Korora 20"
        ],
        [
            "Size of ISO (GB)",
            "0.7",
            "1.9",
            "1.4",
            "1.2",
            "1.4",
            "1.6",
            "1.0",
            "1.4",
            "1.6",
            "4.0",
            "0.9",
            "1.4",
            "2.3",
            "1.0",
            "1.8",
            "4.4",
            "1.6",
            "2.0",
            "0.9",
            "2.4",
            "2.3"
        ],
        [
            "Base",
            "Debian Wheezy",
            "Debian Wheezy",
            "Ubuntu Raring",
            "Debian Unstable",
            "Ubuntu Raring",
            "Debian Testing",
            "Arch",
            "Ubuntu Saucy",
            "Mandriva",
            "Debian Wheezy",
            "Ubuntu Raring",
            "Mandriva",
            "Gentoo",
            "Ubuntu Saucy",
            "Arch",
            "OpenSUSE",
            "Mandriva",
            "Arch",
            "Fedora",
            "Fedora",
            "Fedora"
        ],
        [
            "Desktop",
            "KDE 4.8.4",
            "KDE 4.11.2",
            "KDE 4.10.5",
            "KDE 4.11.4",
            "KDE 4.10.5",
            "KDE 4.11.3",
            "KDE 4.10.4",
            "KDE 4.11.3",
            "KDE 4.11.3",
            "KDE 4.8.4",
            "KDE 4.10.5",
            "KDE 4.10.2",
            "KDE 4.11.3",
            "KDE 4.11.2",
            "KDE 4.11.1",
            "KDE 4.11.2",
            "KDE 4.11.3",
            "KDE 4.11.3",
            "KDE 4.11.3",
            "KDE 4.11.1",
            "KDE 4.11.5"
        ],
        [
            "Linux kernel",
            "3.2.0",
            "3.10.12",
            "3.8.0",
            "3.12.0",
            "3.8.0",
            "3.10.3",
            "3.12.5",
            "3.11.0",
            "3.4.70",
            "3.2.0",
            "3.8.0",
            "3.8.0",
            "3.10.19",
            "3.11.0",
            "3.10.10",
            "3.11.6",
            "3.10.19",
            "3.10.24",
            "3.12.5",
            "3.11.2",
            "3.12.6"
        ],
        [
            "CPU (%)",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-10%",
            "0-10%",
            "0-10%",
            "0-5%",
            "0-5%",
            "0-5%",
            "0-10%",
            "0-5%",
            "0-5%",
            "0-10%",
            "0-5%",
            "0-5%",
            "0-5%"
        ],
        [
            "RAM usage (MB)",
            "423",
            "439",
            "475",
            "478",
            "483",
            "484",
            "490",
            "496",
            "496",
            "511",
            "523",
            "530",
            "537",
            "547",
            "550",
            "593",
            "620",
            "655",
            "691",
            "697",
            "750"
        ],
        [
            "Size of installation",
            "4.1",
            "7.2",
            "5.9",
            "3.7",
            "7.0",
            "6.2",
            "4.6",
            "7.0",
            "5.8",
            "12.4",
            "4.9",
            "3.9",
            "7.1",
            "5.2",
            "5.0",
            "6.0",
            "5.4",
            "7.0",
            "8.4",
            "9.2",
            "8.0"
        ],
        [
            "Boot time (sec)",
            "49",
            "53",
            "40",
            "60",
            "45",
            "59",
            "39",
            "37",
            "65",
            "49",
            "35",
            "46",
            "64",
            "53",
            "41",
            "53",
            "53",
            "66",
            "77",
            "79",
            "58"
        ]
    ],
    "pageTitle": "Linuxed - Exploring Linux distros: Korora 20 \"Peach\" KDE Review: Enhanced Fedora 20 and up-gradable to KDE 4.12.1",
    "title": "",
    "url": "http://mylinuxexplore.blogspot.com/2014/01/korora-20-peach-kde-review-enhanced.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 17,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00332-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 168780395,
    "recordOffset": 168738887,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{59049=Hello Arindam Once again, thank you for your review. I've seen you have “upgraded” your reviews and started grading the different distros. Some of the items are clearly subjective (like aesthetics), but ultimately it is up to the reader to make it's own evaluation of the items he feels that matter the most in a distro. I've never been a big fan of KDE, mostly because I've always found it to be less stable than GNOME (but I'm neither a computer expert nor OS expert, so this statement is purely based on my experience using LINUX and I don't want to start a discussion about this topic in your blog). Started using Linux in 2008 and tried Ubuntu, Kubuntu, Mint, openSUSE, Fedora, Arch and Debian – so I'm not really a distrohopper. Nowadays, I have Arch and Debian (Sid) installed in my computer. I initially used Ubuntu (Mint for a couple of months in-between, but then returned to Ubuntu) for two years or so (up to Unity). Perhaps because “...Ubuntu removed the noob's need for CLI, equalling Microsoft and Apple”, who knows. Later, when I felt more comfortable with Linux, I decided to try other distros. My KDE experience was never the best but given your review, I decided to try openSUSE 13.1 (last time I tried openSUSE back in 2010 I found the distro to be quite “heavy”). My experience was, apparently, closer to Greg's and Eddie's (last one posted his comments in your openSUSE review): the system crashed, full of bugs, and really slow. The installation process of openSUSE was fast but then it took forever to make the first system update (I admit some of the bugs went away after this, but very far from being a stable release). I even got an error in Amarok (something about an invalid certificate). My Fedora 19 KDE experience was also not very good (huge memory consumption, the installer very disappointing, and again crashes). I'll try out Netrunner (being such a success) and see if finally I manage to have a good KDE experience. Congrats on your reviews, between you and another distro reviewer I usually decide which distros to try. Keep up the good work.}",
    "lastModified": "Fri, 31 Jul 2015 00:40:22 GMT",
    "textBeforeTable": "For it's lower boot time but higher RAM consumption, Korora gets 5.5/10 in performance. From Korora 20 http://mylinuxexplore.blogspot.in One of the major improvements I saw from Fedora 20 is in boot time. In my review on Fedora 20, I mentioned that it takes ages (about 80 sec.) to boot the desktop on autologin mode. Korora takes about 58 sec. to boot which is very close to the KDE average that I recorded. From Korora 20 http://mylinuxexplore.blogspot.in Performance Korora disappointed me a bit in terms of performance. On my machine, Fedora 20 KDE actually outperformed Korora by a long margin. At steady state with system monitor running Korora consumes about 750 MB RAM which is about 10% higher than Fedora 20. Average KDE distro consumes about 545 MB RAM and Korora takes about 40% more RAM. On modern machines, one won't even notice a difference of 200 MB RAM but on older machines, Korora may be a tad bit slow. All these numbers are recorded based on the performance on Asus K55VM post installation. From Korora 20 http://mylinuxexplore.blogspot.in",
    "textAfterTable": "Overall I really like Korora and I believe it should appeal to Fedora users a lot. It manages to preserve the best of Fedora and actually enhance it to a certain extent without compromising the user experience. A lot of utility applications are pre-installed in Korora along with multimedia codecs and flash plugin. Further, RPM fusion repositories, Google product repos, virtualbox, Adobe repos, etc. are already added in Korora, thereby saving a lot of time and effort. All these are actually tailor made for Linux newbies who want to try out Fedora. For experienced users, I believe, Korora is a good choice for the benefits it provides over Fedora. It tries to provide more functionality without compromising the KDE experience shunning unnecessary tweaks and modifications of the KDE desktop environment. One advantage of it was that I could easily upgrade to 4.12.1 without actually spoiling the set up or experiencing any instability. One significant improvement in Korora is that it boots faster than Fedora. In overall, Korora is definitely a very elegant and stable distro and brings a lot of value add over Fedora 20. It is definitely to Fedora what Linux Mint is to Ubuntu - only thing is I would like to see Korora outperforming Fedora - because that is what is Mint does release after release. In my assessment, Korora gets a 8.4/10 for it's easy installation, fast boot up",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}