{
    "relation": [
        [
            "Manuf",
            "Federal",
            "Federal",
            "Federal",
            "Federal",
            "Federal",
            "Federal",
            "Federal",
            "Federal"
        ],
        [
            "Name",
            "American Eagle Full Metal Jacket",
            "American Eagle Full Metal Jacket",
            "American Eagle Full Metal Jacket",
            "American Eagle Full Metal Jacket",
            "Premium Expanding Full Metal Jacket",
            "Power-Shok Jacketed Hollow Point",
            "Premium Hydra-Shok Jacketed Hollow Point",
            "Premium Personal Defense Hydra-Shok Jacketed Hollow Point"
        ],
        [
            "Grains",
            "165",
            "180",
            "165",
            "155",
            "165",
            "180",
            "155",
            "135"
        ],
        [
            "Type",
            "Full Metal Jacket",
            "Full Metal Jacket",
            "Full Metal Jacket",
            "Full Metal Jacket",
            "Full Metal Jacket",
            "Jacketed Hollow Point",
            "Jacketed Hollow Point",
            "Jacketed Hollow Point"
        ],
        [
            "Rnds/box",
            "50",
            "100",
            "50",
            "50",
            "50",
            "20",
            "20",
            "20"
        ],
        [
            "Cost",
            "$15.00",
            "$34.50",
            "$35.23",
            "$36.09",
            "$37.29",
            "$30.05",
            "$34.98",
            "$36.95"
        ],
        [
            "Cost/Rnd",
            "$0.30",
            "$0.35",
            "$0.70",
            "$0.72",
            "$0.75",
            "$1.50",
            "$1.75",
            "$1.85"
        ]
    ],
    "pageTitle": "Why The Gov't Purchase Of Ammunition Should Scare The Hell Out Of You",
    "title": "",
    "url": "http://prepperpodcast.com/govt-purchase-ammunition-scare-hell/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00221-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 193356795,
    "recordOffset": 193318991,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38397=By Catholic Online (NEWS CONSORTIUM) 1/27/2015 There are…, 41091=By James Walton 3 March 2015   https://www.indiegogo.com/projects/our-world-a-survivalist-graphic-novel…, 55953=By James Smith 30 July 2014 The word…, 90737=And again in 1993, an opinion by Col Parks allowed the U.S. Special Operations Command to use a Winchester 230-grain JHP for issue with its H&K-manufactured Mk 23 Mod 0 pistol., 79505=Posted by James Smith on August 16, 2012, 86915=Most people will wrongly state that their use is outlawed in the Geneva Convention. The ammunition’s forerunner was banned in 1899, and a portion of that ban is shown here:, 64458=By Kristina Pydynowski, Senior Meteorologist January 25, 2015…, 89121=The US’s observation of the Convention meant that ammunition used by troops would be solid ball ammunition. However, in 1985 the rules of combat changed with an opinion written by Judge Advocate General, written by Col W. Hays Parks, Chief of the JAG’s International Law Branch, for the signature of Major General Hugh R. Overholt, which stated:, 39347=By Michael Snyder, on January 19th, 2015 The…, 46194=by Dan Goodin – Jan 15 2015 As…, 87687=Inspired by the sentiments which found expression in the Declaration of St. Petersburg of the 29th November (11th December), 1868,, 88605=The United States only conceded to this, but did not sign.  Where the U.S. did commit to was the Hague Convention IV of 1907, Article 23(e) of which Annex states:, 90122=“The purpose of the 7.62mm “open-tip” MatchKing bullet is to provide maximum accuracy at very long range. … Bullet fragmentation is not a design characteristic, however, nor a purpose for use of the MatchKing by United States Army snipers. Wounds caused by MatchKing ammunition are similar to those caused by a fully jacketed military ball bullet, which is legal under the law of war, when compared at the same ranges and under the same conditions. (The Sierra #2200 BTHP) not only meets, but exceeds, the law of war obligations of the United States for use in combat.”, 89680=In October of 1990, Col. Parks, at the request of the Commander of the United States Special Operations Command (USSOCOM) and coordinated with the Department of State, Army General Counsel, as well as the Offices of the Judge Advocates General of the Navy and Air Force wrote a Memorandum that concluded:, 42314=January 20, 2015 By Gaye Levy One of…, 55324=By James Smith 19 Nov 2014 History In…, 53441=http://media.blubrry.com/prepperpodcastradionetwork/p/prepperpodcast.com/files/The-UK-Prepper-30-May-2015.mp3 Podcast: Play in new window | Download…, 52652=http://media.blubrry.com/prepperpodcastradionetwork/p/prepperpodcast.com/files/The-UK-Prepper-8-Jun-2015.mp3 Podcast: Play in new window | Download…, 35113=Thursday, January 15th 2015 Written By Sayer Ji…, 59873=Holly Deyo Jan 30, 2015 Chris Kyle shot…, 44462=By  Tenth Amendment Center Blog TALLAHASSEE, Fla. (Jan.…, 37416=By Michael Snyder, on January 27th, 2015  …, 45328=By Cody Poplin Friday, January 16, 2015 We’ve…, 33482=By: Dr. Jeff Masters , January 23, 2015…, 63643=By Alex Sosnowski, Expert Senior Meteorologist January 27,…, 65325=By Kristina Pydynowski, Senior Meteorologist January 20, 2015…, 81647=16 August 2012, 34291=by Christina Sarich Posted on January 20, 2015…, 51871=http://media.blubrry.com/prepperpodcastradionetwork/p/prepperpodcast.com/files/The-UK-Prepper-21-Jul-2015.mp3 Podcast: Play in new window | Download…, 41495=January 19, 2015, by Ken Jorgustin Most people…, 87105=Declaration on the Use of Bullets Which Expand or Flatten Easily in the Human Body” adopted at the First Hague Peace Conference of (29 July) 1899 which states:, 61460=January 10, 2015, by Ken Jorgustin Photographer: Noris…}",
    "textBeforeTable": "  A good rule of thumb in all things commercial is: The fancier, the pricier. And ammunition is not alone in this. Below is a chart from a meta search engine, Ammo Engine. The search parameters were simple and selected from the results were only ammunition sold by the Federal Cartridge Company, a frequent awardee of ammunition in contracts put out by the Department of Homeland Security and the rounds selected were the .40 S&W that the DHS has purchased hundreds of millions. Money Civilian law enforcement and military use of such ammunition should not be of concern. What concerns people these days are the purchases by innocuous government agencies such as the Social Security Administration and National Oceanographic and Atmospheric Administration. While they may be going to strictly the investigative arms of these agencies, what needs to be looked at is the bottom line:  The city of Seattle also uses the hollow point rounds. Legal challenges in Los Angeles and elsewhere, however, have proved fruitless, since most big-city departments began adopting the ammunition in the 1970’s and 1980’s. Studies on the issue are inconclusive. But civil libertarians have criticized the hollow point bullets, saying they are more deadly and increase the",
    "textAfterTable": "  As you can see in the chart, the Jacket Hollow Point (JHP) is as much as five times more expensive that the standard Full Metal Jacket (FMJ) round. But the price isn’t because the JHP is a “more powerful” round. Below is a comparison of the Federal .357 Sig JHP versus the FMJ.   Federal Ammunition Ballistics Round Type Weight Muzzle Energy FPS .357 Sig JHP 125 506 1350 .357 Sig FMJ 125 506 1350   Below is a video of the comparison between .40 S&W JHP and FMJ when it hits the human body, using ballistics gelatin which is used as a human flesh analog.   And lastly, a visual explanation on the damage of the hollow point. A bullet will travel in pretty much a straight line. Once the round strikes the body, the physics of flight changes, causing the round to tumble and spin much like a gyroscope that is about to stop. This is what causes the damage to the body. Compare the bodily damage of the .357 Sig JHP 125 grain to the two  .40 S&W",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}