{
    "relation": [
        [
            "Year",
            "1995",
            "1999",
            "2000",
            "2001",
            "2002"
        ],
        [
            "Team",
            "Mariners",
            "D-backs",
            "D-backs",
            "D-backs",
            "D-backs"
        ],
        [
            "W-L",
            "18-2",
            "17-9",
            "19-7",
            "21-6",
            "24-5"
        ],
        [
            "ERA",
            "2.48",
            "2.48",
            "2.64",
            "2.49",
            "2.32"
        ],
        [
            "K",
            "294",
            "364",
            "347",
            "372",
            "334"
        ]
    ],
    "pageTitle": "Unit's 'greatest run' came with D-backs | dbacks.com",
    "title": "Randy Johnson collected five Cy Young Awards during his illustrious career, including four consecutive from 1999-2002. His five awards trails only Roger Clemens, who earned seven.",
    "url": "http://m.dbacks.mlb.com/news/article/7879610",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00146-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 149681775,
    "recordOffset": 149653815,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{303=Johnson, 46, was with the D-backs for eight seasons from 1999-2004 and again from 2007-08.}",
    "TableContextTimeStampAfterTable": "{6847=Curt Schilling, Johnson's teammate from 2000-03, saw Johnson at his best. The pair formed a one-two punch at the top of the rotation that drew comparisons to the Dodgers' Sandy Koufax and Don Drysdale., 6394=\"It was a huge deal,\" then-general manager Joe Garagiola Jr. said of that news conference in December 1998. \"I remember literally thinking, 'We got him. We signed Randy Johnson.' It was a tremendous coup.\", 7633=The highlight of Johnson's career from a team perspective came in 2001, when he went 21-6 with a 2.49 ERA and led the D-backs to a World Series championship., 6134=After the D-backs finished 65-97 in their inaugural season of 1998, then-owner Jerry Colangelo decided to be aggressive in the free-agent market. His first big target was the 6-foot-10 Johnson, who signed a four-year $53.4 million deal., 12366=A less than amicable parting from the D-backs after the 2008 season left a bad taste in Johnson's mouth. While players get some input into the decision, the Hall of Fame makes the final decision and it would seem like the D-backs would be the logical choice given his accomplishments there., 11636=While Johnson had plenty of individual highlights, two that certainly are near the top of the list are the 20-strikeout game against the Reds on May 8, 2001, and the perfect game he threw against the Braves on May 18, 2004, in Atlanta.}",
    "textBeforeTable": "THE CY YOUNG YEARS \"This is a team game, 25 guys and a coaching staff and the main objective that you play for when you go to Spring Training is to get to a World Series,\" Johnson said. \"I would have to say the pinnacle of my career was to be able to do my part to get the team to the World Series and do my part in the playoffs and do my part in the World Series. That's probably my crowning achievement from a team standpoint.\" The highlight of Johnson's career from a team perspective came in 2001, when he went 21-6 with a 2.49 ERA and led the D-backs to a World Series championship. \"For two years, I have never witnessed the complete domination, day in and day out, he brought to the game,\" Schilling said. \"There were nights he made the best players, best lineups and best teams look like he was in a league above them. His intensity and 'anger' were unparalleled. I could never get to that 'place' he could when I pitched -- I enjoyed it while I was doing it, I think. He was a miserable and angry man on the days he had the ball. He's the most dominating pitcher I ever played with at any level.\" Curt Schilling, Johnson's teammate from 2000-03, saw Johnson at",
    "textAfterTable": "Johnson did his part and then some that year. Not only did he win Games 2 and 6 of the World Series, he also picked up the win in relief in Game 7. \"He was one of the greatest pitchers of all time and one of the most intimidating players of his era,\" D-backs GM Josh Byrnes said. \"He certainly will be an unforgettable part of Diamondbacks history.\" While Johnson had plenty of individual highlights, two that certainly are near the top of the list are the 20-strikeout game against the Reds on May 8, 2001, and the perfect game he threw against the Braves on May 18, 2004, in Atlanta. \"To throw a 98 mph fastball in the ninth inning for the last out of the game, I still remember that,\" Johnson said. \"It says a lot about what I was about when I was out there.\" Johnson was asked Tuesday which hat he would like to wear when he enters the Hall of Fame five years from now. Of the teams he played for, Johnson spent the most time with the Mariners (nine-plus years) and the D-backs (eight). A less than amicable parting from the D-backs after the 2008 season left a bad taste in Johnson's mouth. While players get some input into the decision, the Hall of Fame makes the final decision and it would seem like the D-backs would be the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}