{
    "relation": [
        [
            "Player, Team",
            "David Price, Rays",
            "Justin Verlander, Tigers",
            "Jered Weaver, Angels",
            "Felix Hernandez, Mariners",
            "Fernando Rodney, Rays",
            "Chris Sale, White Sox",
            "Jim Johnson, Orioles",
            "Matt Harrison, Rangers",
            "Yu Darvish, Rangers"
        ],
        [
            "1st",
            "14",
            "13",
            "",
            "",
            "1",
            "",
            "",
            "",
            ""
        ],
        [
            "2nd",
            "13",
            "13",
            "2",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "3rd",
            "1",
            "2",
            "14",
            "5",
            "5",
            "1",
            "",
            "",
            ""
        ],
        [
            "4th",
            "",
            "",
            "9",
            "10",
            "4",
            "4",
            "1",
            "",
            ""
        ],
        [
            "5th",
            "",
            "",
            "2",
            "6",
            "8",
            "6",
            "3",
            "2",
            "1"
        ],
        [
            "Points",
            "153",
            "149",
            "70",
            "41",
            "38",
            "17",
            "5",
            "2",
            "1"
        ]
    ],
    "pageTitle": "Matthew Leach: AL Cy Young winner David Price rewarded for steady dominance | raysbaseball.com",
    "title": "",
    "url": "http://m.rays.mlb.com/news/article/40254092",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00099-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 145747111,
    "recordOffset": 145723149,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{3472=\"That's why I play the game,\" Price said. \"I don't do this for the paycheck. I don't do this to be an average big leaguer. I want to leave my mark on baseball. That's why I do it. I said that in an interview back in 2008. I said, 'When people think about baseball and people think about pitching, I want them to think about David Price.' That's the way I've always been.\", 2559=\"He had a good run in 2010 for the Cy Young, but I think he was more of a thrower that year than a pitcher,\" said teammate James Shields. \"And even though he had good numbers that year, I think that this year he was a much better pitcher as far as being a pitcher and knowing how to pitch and knowing himself as a pitcher. I think he definitely deserves it.\"}",
    "textBeforeTable": "There's not much more you can ask. So game in and game out, against one of the toughest schedules in the league and with minimal margin for error, Price gave his team a strong chance to win. He helped an effective bullpen succeed by limiting the number of innings that Tampa Bay relievers had to pitch. And Price was reliable all season long, from Opening Day all the way to the end. That shows up in the numbers. Measured by opponents' OPS, Price faced the fifth-toughest slate of hitters of any AL starter this year (according to Baseball Prospectus). The aggregate OPS (on-base percentage plus slugging percentage) of the hitters who faced Price was .763, more than four percent better than the overall AL average of 731. Verlander ran the 15th-toughest gauntlet among qualifying starters, Jered Weaver 29th of the 36 pitchers who tossed 162 innings in the Junior Circuit. And Price did it in the AL East, which even in a somewhat down year remained one of baseball's most daunting divisions. That, in itself, is surely not enough to justify a Cy Young Award for any pitcher. But it's an indication of what it is that Price did so well for the Rays. He delivered quality innings, in bulk, start after start. Price did it for a team that had a hard time scoring runs, so every time he",
    "textAfterTable": "Matthew Leach is a national reporter for MLB.com. This story was not subject to the approval of Major League Baseball or its clubs. Share This Email Print + Hide Comments 0 COMMENTS Price rewarded for steady dominance",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}