{
    "relation": [
        [
            "Name",
            "Alcyone",
            "Atlas",
            "Electra",
            "Maia",
            "Merope",
            "Taygeta",
            "Pleione",
            "Celaeno",
            "Sterope, Asterope",
            "—"
        ],
        [
            "Pronunciation (IPA & respelling)",
            "/ælˈsaɪ.əniː/ al-SY-ə-nee",
            "/ˈætləs/ AT-ləs",
            "/ɨˈlɛktʃrə/ i-LEK-trə",
            "/ˈmeɪə/, /ˈmaɪə/ MAY-ə, MY-ə",
            "/ˈmɛrəpiː/ MERR-ə-pee",
            "/teɪˈɪdʒɨtə/ tay-IJ-i-tə",
            "/ˈplaɪ.əniː/ PLY-ə-nee",
            "/sɨˈliːnoʊ/ sə-LEE-noh",
            "/ˈstɛrɵpiː/, /əˈstɛrɵpiː/ (ə)-STERR-ə-pee",
            "—"
        ],
        [
            "Designation",
            "Eta (25) Tauri",
            "27 Tauri",
            "17 Tauri",
            "20 Tauri",
            "23 Tauri",
            "19 Tauri",
            "28 (BU) Tauri",
            "16 Tauri",
            "21 and 22 Tauri",
            "18 Tauri"
        ],
        [
            "Apparent magnitude",
            "2.86",
            "3.62",
            "3.70",
            "3.86",
            "4.17",
            "4.29",
            "5.09 (var.)",
            "5.44",
            "5.64;6.41",
            "5.66"
        ],
        [
            "Stellar classification",
            "B7IIIe",
            "B8III",
            "B6IIIe",
            "B7III",
            "B6IVev",
            "B6V",
            "B8IVpe",
            "B7IV",
            "B8Ve/B9V",
            "B8V"
        ]
    ],
    "pageTitle": "Pleiades - Wikipedia, the free encyclopedia",
    "title": "Pleiades bright stars",
    "url": "https://en.wikipedia.org/wiki/Pleiades_(star_cluster)",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042992543.60/warc/CC-MAIN-20150728002312-00054-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 878132691,
    "recordOffset": 878091474,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{14661=The Babylonian star catalogues name the Pleiades MUL.MUL or \"star of stars\", and they head the list of stars along the ecliptic, reflecting the fact that they were close to the point of vernal equinox around the 23rd century BC. The earliest known depiction of the Pleiades is likely a bronze age artifact known as the Nebra sky disk, dated to approximately 1600 BC. Some Greek astronomers considered them to be a distinct constellation, and they are mentioned by Hesiod, and in Homer's Iliad and Odyssey. They are also mentioned three times in the Bible (Job 9:9 and 38:31, as well as Amos 5:8). Some scholars of Islam suggested that the Pleiades (ath-thurayya) are the star mentioned in the sura (chapter) Najm of the Quran., 16858=The rising of the Pleiades is mentioned in the Ancient Greek text Geoponica.[11] The Greeks oriented the Hecatompedon temple of 550 BC and the Parthenon of 438 BC to their rising.[12] The rising of the Pleiades before dawn (usually at the beginning of June) has long been regarded as the start of the new year in Māori culture, with the star group being known as Matariki. The rising of Matariki is celebrated as a midwinter festival in New Zealand.[13] In Hawaiian culture the cluster is known as the Makali'i and their rising shortly after sunset marks the beginning of Makahiki, a 4-month time of peace in honor of the god Lono., 21747=The Pleiades have long been known to be a physically related group of stars rather than any chance alignment. The Reverend John Michell calculated in 1767 that the probability of a chance alignment of so many bright stars was only 1 in 500,000, and so correctly surmised that the Pleiades and many other clusters of stars must be physically related.[14] When studies were first made of the stars' proper motions, it was found that they are all moving in the same direction across the sky, at the same rate, further demonstrating that they were related., 28014=Measurements of the distance have elicited much controversy. Results prior to the launch of the Hipparcos satellite generally found that the Pleiades were about 135 parsecs away from Earth. Data from Hipparcos yielded a surprising result, namely a distance of only 118 parsecs by measuring the parallax of stars in the cluster—a technique that should yield the most direct and accurate results. Later work consistently argued that the Hipparcos distance measurement for the Pleiades was erroneous.[3][4][5][19][20][21] In particular, distances derived to the cluster via the Hubble Space Telescope and infrared color-magnitude diagram fitting favor a distance between 135–140 pc;[3][19] a dynamical distance from optical interferometric observations of the Pleiad double Atlas favors a distance of 133-137 pc.[21] However, the author of the 2007–2009 catalog of revised Hipparcos parallaxes reasserted that the distance to the Pleiades is ~120 pc, and challenged the dissenting evidence.[2] Recently, Francis and Anderson[22] proposed that a systematic effect on Hipparcos parallax errors for stars in clusters biases calculation using the weighted mean, and gave a Hipparcos parallax distance of 126 pc, and photometric distance 132 pc based on stars in the AB Doradus, Tucana-Horologium moving group and Beta Pictoris moving groups, which are similar in age and composition to the Pleiades. Those authors note that the difference between these results can be attributed to random error., 21195=Galileo Galilei was the first astronomer to view the Pleiades through a telescope. He thereby discovered that the cluster contains many stars too dim to be seen with the naked eye. He published his observations, including a sketch of the Pleiades showing 36 stars, in his treatise Sidereus Nuncius in March 1610., 23602=Edme-Sébastien Jeaurat then drew in 1782 a map of 64 stars of the Pleiades from his observations in 1779, which he published in 1786.[16][17][18], 31383=The latest result (August, 2014)[23] used very long baseline radio interferometry (VLBI) to determine a distance of 136.2 ± 1.2 pc, conclusively showing \"that the Hipparcos measured distance to the Pleiades cluster is in error.\", 22522=Charles Messier measured the position of the cluster and included it as M45 in his catalogue of comet-like objects, published in 1771. Along with the Orion Nebula and the Praesepe cluster, Messier's inclusion of the Pleiades has been noted as curious, as most of Messier's objects were much fainter and more easily confused with comets—something that seems scarcely possible for the Pleiades. One possibility is that Messier simply wanted to have a larger catalogue than his scientific rival Lacaille, whose 1755 catalogue contained 42 objects, and so he added some bright, well-known objects to boost his list.[15]}",
    "lastModified": "Thu, 30 Jul 2015 02:52:00 GMT",
    "textBeforeTable": "List[edit] The location of the Pleiades on the constellation Taurus. A map of the Pleiades The nine brightest stars of the Pleiades are named for the Seven Sisters of Greek mythology: Sterope, Merope, Electra, Maia, Taygeta, Celaeno, and Alcyone, along with their parents Atlas and Pleione. As daughters of Atlas, the Hyades were sisters of the Pleiades. The English name of the cluster itself is of Greek origin (Πλειάδες), though of uncertain etymology. Suggested derivations include: from πλεῖν plein, \"to sail,\" making the Pleiades the \"sailing ones\"; from πλέος pleos, \"full, many\"; or from πελειάδες peleiades, \"flock of doves.\" The following table gives details of the brightest stars in the cluster: Brightest stars[edit] Studies show that the dust responsible for the nebulosity is not uniformly",
    "textAfterTable": "Possible planets[edit] Analyzing deep-infrared images obtained by the Spitzer Space Telescope and Gemini North telescope, astronomers discovered that one of the cluster's stars – HD 23514, which has a mass and luminosity a bit greater than that of the Sun, is surrounded by an extraordinary number of hot dust particles. This could be evidence for planet formation around HD 23514.[30] See also[edit] Pleiades in folklore and literature References[edit] ^ a b c d e \"SIMBAD Astronomical Database\". Results for M45. Retrieved 2007-04-20.  ^ a b Van Leeuwen, F. (2009). \"Parallaxes and proper motions for 20 open clusters as based on the new Hipparcos catalogue\". Astronomy and Astrophysics 497: 209–242. arXiv:0902.1039. Bibcode:2009A&A...497..209V. doi:10.1051/0004-6361/200811382.  ^ a b c d Majaess, Daniel J.; Turner, David G.;",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}