{
    "relation": [
        [
            "",
            "2010-11",
            "2011-12",
            "2012-13",
            "2013-14",
            "Total"
        ],
        [
            "g",
            "25",
            "19",
            "38",
            "40",
            "122"
        ],
        [
            "hbp",
            "1",
            "-",
            "2",
            "1",
            "4"
        ],
        [
            "sf",
            "-",
            "-",
            "1",
            "2",
            "3"
        ],
        [
            "sh",
            "2",
            "2",
            "12",
            "7",
            "23"
        ],
        [
            "tb",
            "9",
            "6",
            "27",
            "29",
            "71"
        ],
        [
            "xbh",
            "0",
            "0",
            "4",
            "6",
            "10"
        ],
        [
            "hdp",
            "1",
            "-",
            "-",
            "2",
            "3"
        ],
        [
            "go",
            "17",
            "7",
            "55",
            "37",
            "116"
        ],
        [
            "fo",
            "12",
            "9",
            "20",
            "38",
            "79"
        ],
        [
            "go/fo",
            "1.42",
            "0.78",
            "2.75",
            "0.97",
            "1.47"
        ],
        [
            "pa",
            "52",
            "31",
            "135",
            "123",
            "341"
        ]
    ],
    "pageTitle": "Yesenia Alcala - Sacramento State Athletics",
    "title": "",
    "url": "http://hornetsports.com/sports/sball/2013-14/bios/alcala_yesenia_k88n?view=gamelog&pos=h",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989891.18/warc/CC-MAIN-20150728002309-00211-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 113655287,
    "recordOffset": 113632114,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{222848=Archives Div. I Era Roster Player Career Stats (1990-Pres.) Recruiting Questionnaire Softball Facebook Page Donate to Softball Big Sky Conference NCAA Softball Stats, 26131=2014 Season An honorable mention all-Big Sky Conference selection after starting 40 of the Hornets’ 46 games…37 of those starts came at second base and three came at shortstop…started each of the final 25 games of the season, including all 19 games against a Big Sky opponent…the Hornets went 23-14 when Alcala started games at second base…hit .282 against Big Sky opposition with 11 runs scored, nine RBIs and a .356 on-base percentage…committed just one error in conference play, good for a .980 fielding percentage…overall, she hit .204 with a team-best seven sacrifices…struck out just nine times in 103 at-bats…had a pair of hitting streaks at least four games long, including a five gamer from March 28-April 4…finished with 13 RBIs, and seven of those came with two outs in an inning. 2013 Season Appeared in 38 games, making 33 starts at shortstop and three at designated player…hit .207 (23-for-111) with nine runs, four doubles, seven RBIs and a team-high tying 12 sacrifices…had a pair of four-game hitting streaks…drew a two-out, walkoff walk in the Hornets’ 1-0 victory over Northern Colorado…opened the season by going 2-for-3 with a double and two RBIs in the season-opening win against UTEP. 2012 Season Appeared in 19 games, including eight starts at shortstop…led the team with seven pinch-hitting appearances…batted .222 (6-27) with three runs and an RBI…had a pinch-hit, RBI-single against Portland State…had one of the Hornets’ three hits against top-ranked Cal. 2011 Season Appeared in 25 games, including 18 starts at shortstop…hit .196 (9-46) with four runs, five RBIs, three walks, two sacrifices and a stolen base…in eight games against PCSC opposition, she hit .308 (4-13) with two runs and four RBIs…batted .353 (6-17) with runners in scoring position and .308 (8-26) with runners on base…in four opportunities with a runner at third base and less than two outs, she successfully drove in the run three times. High School A 2010 graduate of Banning High School in Wilmington, Calif…played four years of varsity softball for the Pilots at both shortstop and third base…a four-time all-Marine League selection (second team each of her first three seasons, first team as a senior)…helped the Pilots to a combined 80-44 record during her four seasons…named the Invitational Division Player of the Year after her senior season by the Los Angeles Wave. Personal Parents are Jose and Martha Alcala…a criminal justice major…played for the Corona Angels’ ASA travel team from 2003-09, and was a part of three top five finishing teams in the nation over a four-year span (2005, 2007, 2008)…one of many eventual Div I student-athletes that came from the Corona Angel program., 221925=Prospect Clinic Aug. 22, 9 am-2 pm, Ages 13-18, 222100=Online Media Guide Photo Galleries Video Highlights 2015 Quick Facts 2015 Capital Classic Live Stats, 223984=1981 - AIAW Div. II}",
    "textBeforeTable": "Yesenia Alcala 23 23 Related Bios Kayla Papez Paige Martin Shelby Johnston Sasha Margulies Alexis Martinez Makenzie Wayadande Kaitlyn Yerby Kortney Solis Jennifer Hartman Jessica Ravetti Nicole Clark Taylor Stroud Paris Prado T.J. Watts Riley Price Paige Castro Alyssa Vanderdrink Nikki Gialketsis Caitlin Brooks Alexa Chattleton   News   |   Coaches   |   Statistics   |   Schedule/Results   |   Roster   |   Home Softball RSS Feeds Social Media Central YouTube Channel Live Audio WatchBigSky.com Live Stats Multimedia Multimedia Donate Now Upcoming Events",
    "textAfterTable": "at Weber State W, 11-1 Apr 25 at Weber State W, 4-3 Apr 26 at Weber State May 8 vs. Southern Utah L, 5-2 May 9 vs. Northern Colorado W, 4-0 May 9 at Idaho State L, 10-7 Statistics category Overall Conf Games 40 16 Plate appearances 123 50 At Bats 103 39 Runs 12 4 Hits 21 11 Doubles 5 1 Triples - - Home Runs 1 1 Runs Batted In 13",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}