{
    "relation": [
        [
            "Date",
            "Oct 4, 2006",
            "Jun 3, 2010",
            "Jun 15, 2010",
            "Nov 29, 2010",
            "Aug 9, 2013",
            "Apr 17, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: INFINEON TECHNOLOGIES AG,GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:STOLLE, REINHARD;HEISE, BERND;REEL/FRAME:018378/0544 Effective date: 20060804",
            "Owner name: INFINEON TECHNOLOGIES WIRELESS SOLUTIONS GMBH,GERM Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INFINEON TECHNOLOGIES AG;REEL/FRAME:024474/0937 Effective date: 20090703 Owner name: INFINEON TECHNOLOGIES WIRELESS SOLUTIONS GMBH, GER Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INFINEON TECHNOLOGIES AG;REEL/FRAME:024474/0937 Effective date: 20090703",
            "Owner name: LANTIQ DEUTSCHLAND GMBH,GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INFINEON TECHNOLOGIES WIRELESS SOLUTIONS GMBH;REEL/FRAME:024529/0656 Effective date: 20091106 Owner name: LANTIQ DEUTSCHLAND GMBH, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INFINEON TECHNOLOGIES WIRELESS SOLUTIONS GMBH;REEL/FRAME:024529/0656 Effective date: 20091106",
            "Owner name: DEUTSCHE BANK AG NEW YORK BRANCH, AS COLLATERAL AG Free format text: GRANT OF SECURITY INTEREST IN U.S. PATENTS;ASSIGNOR:LANTIQ DEUTSCHLAND GMBH;REEL/FRAME:025406/0677 Effective date: 20101116",
            "Year of fee payment: 4",
            "Owner name: LANTIQ BETEILIGUNGS-GMBH & CO. KG, GERMANY Free format text: RELEASE OF SECURITY INTEREST RECORDED AT REEL/FRAME 025413/0340 AND 025406/0677;ASSIGNOR:DEUTSCHE BANK AG NEW YORK BRANCH, AS COLLATERAL AGENT;REEL/FRAME:035453/0712 Effective date: 20150415"
        ]
    ],
    "pageTitle": "Patent US7664522 - Adjusting a transmit power of a subscriber device of a communication network ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7664522?dq=7350717",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 11,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00289-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473070203,
    "recordOffset": 473031911,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{101252=This application claims priority from German Patent Application No. 102006017252.3, which was filed on Apr. 12, 2006, and is incorporated herein by reference in its entirety.}",
    "textBeforeTable": "Patent Citations While this invention has been described in terms of several preferred embodiments, there are alterations, permutations, and equivalents which fall within the scope of this invention. It should also be noted that there are many alternative ways of implementing the methods and compositions of the present invention. It is therefore intended that the following appended claims be interpreted as including all such alterations, permutations, and equivalents as fall within the true spirit and scope of the present invention. Although the embodiments were described with reference to VDSL communications, other embodiments may refer to other types of data communication, for example to other xDSL communications, like ADSL or HDSL. Further, it is to be noted, that the term “modem” is to be regarded comprehensively and includes in its general form a device, an interface or a program which serves for transferring information, for example via cable lines. may also be regarded as individual means of the CPE or the CO, respectively, taking over the corresponding function and for example implemented as software in FPGA or an ASIC circuit component. FIG. 2 In particular, it is to be noted, that depending on the conditions, the inventive scheme may also be implemented in software. The implementation may take place on a digital storage medium, in particular a floppy disc or a CD having electronically readable control signals which may cooperate with a",
    "textAfterTable": "Transmit spectrum for a digital subscriber line signal US8520745 Jul 29, 2009 Aug 27, 2013 Qualcomm Incorporated Reverse link power control for an OFDMA system US8521206 * Apr 16, 2009 Aug 27, 2013 Qualcomm Incorporated Interference management with reduce interference requests and interference indicators US8559879 Apr 16, 2009 Oct 15, 2013 Qualcomm Incorporated Null pilots for interference estimation in a wireless communication network US8718181 * Jul 29, 2009 May 6, 2014 Qualcomm Incorporated Reverse link power control for an OFDMA system US20100099449 * Apr 16, 2009 Apr 22, 2010 Qualcomm Incorporated Interference management with reduce interference requests and interference indicators * Cited by examiner Classifications U.S. Classification 455/522, 455/500, 375/341, 379/27.01, 455/127.1, 375/260, 455/69, 455/466, 455/517,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}