{
    "relation": [
        [
            "Citing Patent",
            "US4717888 *",
            "US4730243 *",
            "US5883796 *",
            "US6097182 *",
            "US6374188",
            "US6483290",
            "US6504357",
            "US6507794",
            "US6577961",
            "US6703823",
            "US6762598",
            "US6954061",
            "US7180282",
            "US7239125",
            "US7339805",
            "US7355867",
            "US8552709 *"
        ],
        [
            "Filing date",
            "May 22, 1986",
            "Dec 23, 1985",
            "Apr 7, 1997",
            "Jun 7, 1995",
            "Nov 30, 1998",
            "Mar 26, 1998",
            "Mar 26, 1998",
            "Nov 30, 1998",
            "Nov 30, 1998",
            "Jun 6, 1996",
            "Jun 7, 1995",
            "Jul 10, 2003",
            "Jul 11, 2003",
            "Aug 1, 2005",
            "Jan 3, 2007",
            "Aug 17, 2004",
            "Feb 7, 2005"
        ],
        [
            "Publication date",
            "Jan 5, 1988",
            "Mar 8, 1988",
            "Mar 16, 1999",
            "Aug 1, 2000",
            "Apr 16, 2002",
            "Nov 19, 2002",
            "Jan 7, 2003",
            "Jan 14, 2003",
            "Jun 10, 2003",
            "Mar 9, 2004",
            "Jul 13, 2004",
            "Oct 11, 2005",
            "Feb 20, 2007",
            "Jul 3, 2007",
            "Mar 4, 2008",
            "Apr 8, 2008",
            "Oct 8, 2013"
        ],
        [
            "Applicant",
            "Raytheon Company",
            "Sundstrand Corporation",
            "Wisconsin Alumni Research Foundation",
            "Abb Power T&D Company Inc.",
            "Abb Automation Inc.",
            "Abb Automation Inc.",
            "Abb Automation Inc.",
            "Abb Automation Inc.",
            "Abb Automation Inc.",
            "Elster Electricity, Llc",
            "Elster Electricity, Llc",
            "Elster Electricity, Llc",
            "Elster Electricity, Llc",
            "Elster Electricity, Llc",
            "Elster Electricity, Llc",
            "Elster Electricity, Llc",
            "Tasco Inc."
        ],
        [
            "Title",
            "Integrated circuit offset voltage adjustment",
            "EMI reduction circuit",
            "Dynamic series voltage restoration for sensitive loads in unbalanced power systems",
            "Electrical energy meter for 3-wire delta service",
            "Energy meter with instrumentation systems and methods",
            "Apparatus for metering electrical power that determines energy usage data based on downloaded information",
            "Apparatus for metering electrical power and electronically communicating electrical power information",
            "Energy meter with power quality monitoring systems and methods",
            "Energy meter having programmable functions",
            "Method and apparatus for electronic meter testing",
            "Method for providing optical test signals for electronic meter testing",
            "Method and apparatus for electronic meter testing",
            "Apparatus for metering at least one type of electrical power over a predetermined range of service voltages",
            "Method and apparatus for electronic meter testing",
            "Power supply having voltage blocking clamp",
            "Power supply for an electric meter having a high-voltage regulator that limits the voltage applied to certain components below the normal operating input voltage",
            "Systems and methods for locating a circuit"
        ]
    ],
    "pageTitle": "Patent US4131844 - Static voltage balancer - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4131844?dq=6666377",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00336-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479071216,
    "recordOffset": 479055257,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Other types of modulator systems may be employed to provide slightly different trim voltages in summer 30. For example, referring to FIG. 8, a modulator which provides a pulse width modulated signal wherein one pulse is generated for each half period of the phase voltage is shown. The width of the pulse is proportional to the amount of correction required, and establishes a trim voltage which is summed with the phase voltage once each half period. When phase A error voltage VA is zero and modulator 44 provides a square wave output, transistors 122 and 124 and diodes 126 and 128 transfer power back and forth between summer 30 and power supply 50. When the individual phase voltages equal the average voltage of all the phase voltages, the total power transferred between summers 30, 32 and 34 and power supply 50 is zero. Power supply 50 provides the required DC voltage by half wave rectification of the three phases by diodes 140, 142 and 144. The DC voltage is integrated by capacitor 146 to provide short term energy storage while maintaining the DC voltage constant over a period of time. Referring to FIG. 6, the pulse width modulated signal from phase A modulator circuit 44 is coupled to switching amplifier 48 by line 46. The switching amplifier circuit 48 includes transistor control circuit 120, control transistors 122 and 124 and diodes 126 and 128. Transistor control",
    "textAfterTable": "US6577961 Nov 30, 1998 Jun 10, 2003 Abb Automation Inc. Energy meter having programmable functions US6703823 Jun 6, 1996 Mar 9, 2004 Elster Electricity, Llc Method and apparatus for electronic meter testing US6762598 Jun 7, 1995 Jul 13, 2004 Elster Electricity, Llc Method for providing optical test signals for electronic meter testing US6954061 Jul 10, 2003 Oct 11, 2005 Elster Electricity, Llc Method and apparatus for electronic meter testing US7180282 Jul 11, 2003 Feb 20, 2007 Elster Electricity, Llc Apparatus for metering at least one type of electrical power over a predetermined range of service voltages US7239125 Aug 1, 2005 Jul 3, 2007 Elster Electricity, Llc Method and apparatus for electronic meter testing US7339805 Jan 3, 2007 Mar 4, 2008 Elster Electricity, Llc Power supply having voltage blocking clamp US7355867 Aug 17, 2004 Apr 8, 2008 Elster Electricity, Llc Power supply for an electric meter having a",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}