{
    "relation": [
        [
            "Date",
            "Jun 10, 1996",
            "Aug 24, 2001",
            "Sep 14, 2005",
            "Feb 24, 2006",
            "Apr 25, 2006"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: CHARTERED SEMICONDUCTOR MANUFACTURING PTE LTD., SI Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SUNDARESAN, RAVISHANKAR;REEL/FRAME:008055/0963 Effective date: 19960521",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20060224"
        ]
    ],
    "pageTitle": "Patent US5721163 - Method of manufacture of thin film transistor SRAM device with a titanium ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5721163?dq=552685",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00250-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484727923,
    "recordOffset": 484706707,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38617=FIG. 3D shows the product of FIG. 3C after formation of photoresist mask 33 over the electrode 24 to protect the channel region 32 in polysilicon thin film 28 from doping with P+ dopant 33'. In FIG. 3D, the dopant 33' is being ion implanted into TFT S/D regions 30 and 34 of polysilicon thin film 28 with boron B11 dopant ions 32 in a dose of from about 1019 atoms/cm3 to about 1020 atoms/cm3 to form the source/drain regions 30/34 of the TFT device as shown in FIG. 3E with the mask 33 removed., 40648=8. Vt implant adjustment with P-type or N-type boron/phosphorus dopant with dopant ions 32 in a dose of from about about 1016 atoms/cm3 to about 1017 atoms/cm3., 37879=Next a Vt implant adjustment with a P-type or N-type adjustment of the polysilicon thin film 28 with dopant ions 32 in a dose of boron or phosphorus from about 1016 atoms/cm3 to about 1017 atoms/cm3., 31532=8) performing a Vt implant adjustment of the device by doping with P-type or N-type boron/phosphorus dopant in a dose of from about 1016 atoms/cm3 to about 1017 atoms/cm3, and}",
    "textBeforeTable": "Patent Citations While this invention has been described in terms of the above specific embodiment(s), those skilled in the art will recognize that the invention can be practiced with modifications within the spirit and scope of the appended claims, i.e. that changes can be made in form and detail, without departing from the spirit and scope of the invention. Accordingly all such changes come within the purview of the present invention and the invention encompasses the subject matter of the claims which follow. 10. Standard back end flow through second metal. 9. Form TFT S/D regions by ion implantation. Form a TFT polysilicon mask for patterning the polysilicon thin film 28 and etch to remove unwanted portions of thin film 28. 8. Vt implant adjustment with P-type or N-type boron/phosphorus dopant with dopant ions 32 in a dose of from about about 1016 atoms/cm3 to about 1017 atoms/cm3. 7. Deposit a polysilicon thin film 28 for TFT active channel over gate dielectric layer 26 in FIG. 3C which is undoped. 6. Form a TFT (silicon dioxide) gate oxide, dielectric layer 26 covering exposed surfaces of control gate electrode 24 in FIG. 3B. 5. Form a photoresist mask 25 and pattern by etching of control gate electrode from layer 24 in FIG. 3A. 4. Deposit a the TiN/Refractory metal silicide gate layer 24 forming buried contact BC in opening 17 in FIG. 2 and FIG. 3A. 3. Form a",
    "textAfterTable": "US5327003 * Jan 15, 1993 Jul 5, 1994 Fujitsu Limited Semiconductor static RAM having thin film transistor gate connection US5385854 * Jul 15, 1993 Jan 31, 1995 Micron Semiconductor, Inc. Method of forming a self-aligned low density drain inverted thin film transistor US5397718 * Feb 19, 1993 Mar 14, 1995 Matsushita Electric Industrial Co., Ltd. Method of manufacturing thin film transistor US5495119 * Jul 23, 1993 Feb 27, 1996 Nec Corporation MOS thin film transistor having high breakdown voltage US5600153 * May 26, 1995 Feb 4, 1997 Micron Technology, Inc. Conductive polysilicon lines and thin film transistors JPH043469A * Title not available JPH02132832A * Title not available JPH04152566A *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}