{
    "relation": [
        [
            "Date",
            "Apr 29, 1986",
            "Feb 1, 1989",
            "Mar 4, 1991",
            "Apr 18, 1995",
            "Sep 10, 1995",
            "Sep 12, 1995",
            "Nov 21, 1995"
        ],
        [
            "Code",
            "AS",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "AS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Assignment",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: KENDALL COMPANY THE, BOSTON, MA. A CORP. OF DE. Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:HUDDLESTON, ELWYN G.;REEL/FRAME:004555/0504 Effective date: 19860428",
            "Owner name: MANUFACTURERS HANOVER TRUST COMPANY, AS AGENT Free format text: SECURITY INTEREST;ASSIGNOR:KENDALL COMPANY, THE;REEL/FRAME:005251/0007 Effective date: 19881027",
            "Year of fee payment: 4",
            "",
            "",
            "Owner name: KENDALL COMPANY, THE, MASSACHUSETTS Free format text: RELEASE OF SECURITY INTEREST;ASSIGNOR:CHEMICAL BANK (THE SUCCESSOR BY MERGER WITH MANUFACTURER S HANOVER TRUST COMPANY);REEL/FRAME:007644/0328 Effective date: 19950102",
            "Effective date: 19950913"
        ]
    ],
    "pageTitle": "Patent US4692352 - Method of making an adhesive tape - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4692352?dq=5359317",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00016-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481138299,
    "recordOffset": 481112719,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25376=My copending applications Ser. Nos. 823,222 filed Jan. 28, 1986 and No. 843,943 filed March 25, 1986 relate to protective coating systems for metal surfaces, e.g. tubular articles such as metal pipes and the like, which systems comprise: (1) a rubber-based primer coating mixture; and (2) an adhesive tape comprising a backing material carrying a partially crosslinked rubber-based adhesive coating, the system further including a crosslinking agent and a crosslinking activator adapted to provide an in situ additional crosslinking of the system after the primer coating and tape are applied., 54227=A 4 row Cavity Transfer Mixer as described in the aforementioned U.S. Pat. No. 4,419,014 was fitted with a plain screw onto the outflow end of a standard cold-feed extruder (a David Standard 15:1 L/D 60 mm (21/2\"). The extruder was provided with an injection port for introducing the crosslinker into the rubber mix prior to passage into the attached cavity transfer mixer. In the manner described in Example 1 of the aforementioned Ser. No. 823,222, a rubber adhesive premix was obtained in the Banbury comprising the following proportions of ingredients:, 30326=U.S. Pat. No. 4,472,231 issued Sept. 19, 1984 to Robert F. Jenkins is directed primarily to providing an improved anti-corrosion protective coating for the surface of metal pipes that are designed for inground implantation. According to the teachings of Jenkins, a two component interacting protective pipewrap system is provided consisting of: (1) a primer mixture comprising a blend of natural rubbers, resins and a crosslinking metal oxide activator coated with organo-titante; and (2) a rubber-based adhesive carried on an olefin polymer backing to be helically wrapped over the primer layer, the adhesive layer comprising a blend of virgin butyl rubber and reclaimed butyl rubber partially crosslinked with p-quinone dioxime crosslinking agent, a tackifier, and a residual amount of the p-quinone dioxime crosslinker. When the adhesive layer, containing unreacted p-quinone dioxime crosslinker, is placed in contact with the primer-coated pipe outer surface, a further crosslinking reaction then occurs at the primer-adhesive interface, as well as throughout the primer layer and the adhesive layer. This additional crosslinking, which is aided in part by the elevated temperature of the operating pipeline and its contents, results in an improved ability of the system to resist tape creep caused by high shear forces., 53250=In general, the ratio of liquid vehicle to crosslinker is not critical and may vary widely, consistent of course with cost and efficiency. By way of illustration, ratios within the range of 7:3 to 3:7 may be employed.}",
    "textBeforeTable": "Referenced by Since certain changes may be made without departing from the scope of the invention herein described, it is intended that all matter contained in the foregoing description, including the examples, shall be taken as illustrative and not in a limiting sense. By way of recapitulation, the present invention provides an elegant system for incorporating a material in a rubber-based premix at an elevated temperature at which the material is reactive with a least one component of the premix, coating the material onto a backing material while substantially maintaining reactive temperature and then cooling the resulting tape to a temperature where this material is no longer reactive, the time period between incorporating the material and cooling being so short that at best only minimal amounts of the incorporated material can react. In this context, Applicants cannot state unequivocally that this time period is so short that no portion of the incorporated material can react. Accordingly, as used herein and in the appended claims, the term \"minimal amounts\" means amounts which are so small as to be insignificant and unobjectionable, leaving substantially all of the incorporated material in its unreacted state while the invention is directed primarily to rubber mixes including at least one butyl based rubber, in its broadest aspects it is not so limited and may be employed in procedures for incorporating an additive into the other known rubber mixes, e.g. natural rubber, EPDM or mixtures",
    "textAfterTable": "Jul 23, 2004 Jan 16, 2007 Imation Corp. Magnetic recording medium with dual layer front coating and method of manufacture US7753285 Jul 13, 2007 Jul 13, 2010 Bacoustics, Llc Echoing ultrasound atomization and/or mixing system US7780095 Jul 13, 2007 Aug 24, 2010 Bacoustics, Llc Ultrasound pumping apparatus US7896539 Aug 16, 2005 Mar 1, 2011 Bacoustics, Llc Ultrasound apparatus and methods for mixing liquids and coating stents US8313051 Mar 5, 2009 Nov 20, 2012 Sealed Air Corporation (Us) Process and apparatus for mixing a polymer composition and composite polymers resulting therefrom US20040265642 * Jul 23, 2004 Dec 30, 2004 Lowery David C. Magnetic recording medium with dual layer front coating and method of manufacture US20110067800 * Nov 13, 2007 Mar 24, 2011 Pirelli Tyre S.P.A. Process and plant for producing an elastomeric compound * Cited by examiner Classifications",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}