{
    "relation": [
        [
            "Date",
            "Jan 28, 1994",
            "Jul 23, 1996",
            "Jun 28, 1999",
            "Jun 27, 2003",
            "Jun 21, 2007"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: EP TECHNOLOGIES, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:PANESCU, DORIN;REEL/FRAME:006872/0199 Effective date: 19940126",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5487391 - Systems and methods for deriving and displaying the propagation velocities ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5487391?dq=6377161",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00210-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479197807,
    "recordOffset": 479158072,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63937=Further details of the deployment and use of the introducer 14 and guide sheath 16 to establish a pathway for the probe 18 are set forth in pending U.S. patent application Ser. No. 08/033,641, filed Mar. 16, 1993, entitled \"Systems and Methods Using Guide Sheaths for Introducing, Deploying, and Stabilizing Cardiac Mapping and Ablation Probes.\", 72425=Further details of flexible electrode carrying elements can be found in copending U.S. patent application Ser. No. 08/138,142, filed Oct. 15, 1993, entitled \"Systems and Methods for Creating Long, Thin Lesions in Body Tissue.\", 49669=Researchers have taken epicardial measurements of the electrical resistivity of heart tissue. Their research indicates that the electrical resistivity of infarcted heart tissue is about one-half that of healthy heart tissue. Their research also indicates that ischemic tissue occupying the border zone between infarcted tissue and healthy tissue has an electrical resistivity that is about two-thirds that of healthy heart tissue. See, e.g., Falleft et al., \"Myocardial Electrical Impedance Mapping of Ischemic Sheep Hearts and Healing Aneurysms,\" Circulation, Vol. 87, No. 1, January 1993, 199-207.}",
    "textBeforeTable": "Patent Citations Various features of the invention are set forth in the following claims. In the illustrated embodiment (see FIG. 30), an external steerable ablating probe 100 is deployed in association with the basket structure 36. The physician can now takes steps to ablate the myocardial tissue areas located by the basket electrodes 38. The physician can accomplish this result by using an electrode to thermally destroy myocardial tissue, either by heating or cooling the tissue. Alternatively, the physician can inject a chemical substance that destroys myocardial tissue. The physician can use other means for destroying myocardial tissue as well. Regardless of the specific form of the output used, the physician analyses one or more of the outputs derived from the basket electrodes 38 to locate likely efficacious sites for ablation. E. Ablating the Tissue FIG. 29 provides by sharp contrast between black and white (with no intermediate hues) the potential ablation site (Area A). FIG. 29 shows a representative display processed according to the above methodology. In FIG. 29, a threshold of 0.8 has been used for illustration purposes. Values greater than the threshold of 0.8 have been set to 1.0, while values equal to or less than 0.8 have been set to 0.0. The CPU 206 generates this display on the display device 246 for viewing by the physician. The means 258 selects a threshold value. Tissue regions having matched output values above the",
    "textAfterTable": "Cardiac mapping system simulator US5058583 * Jul 13, 1990 Oct 22, 1991 Geddes Leslie A Multiple monopolar system and method of measuring stroke volume of the heart US5092339 * Jul 23, 1990 Mar 3, 1992 Geddes Leslie A Method and apparatus for electrically compensated measurement of cardiac output US5109870 * Oct 26, 1990 May 5, 1992 Forschungsgesellschaft Fur Biomedizinische Technik E.V. Apparatus for and method of motility and peristalsis monitoring US5137019 * Mar 1, 1991 Aug 11, 1992 Cardiac Pacemakers, Inc. Variation in cardiac chamber volume or pressure as a controlling parameter US5156151 * Feb 15, 1991 Oct 20, 1992 Cardiac Pathways Corporation Endocardial mapping and ablation system and catheter probe US5195968 * Jul 17, 1992 Mar 23, 1993 Ingemar Lundquist Catheter steering mechanism US5197467 * Jun 22, 1992 Mar 30, 1993",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}