{
    "relation": [
        [
            "Date",
            "13 Oct 1998",
            "29 Mar 2004",
            "17 Apr 2008",
            "21 Jul 2008",
            "2 Jul 2012",
            "21 Nov 2012",
            "8 Jan 2013"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: AKOS BIOMEDICAL, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SIMPSON, PHILIP J.;MATSUURA, DAVID G.;KILCOYNE, JOHN;REEL/FRAME:009524/0709;SIGNING DATES FROM 19980916 TO 19980922",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: MEDTRONIC, INC., MINNESOTA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:MEDTRONIC ENDONETICS, INC.;REEL/FRAME:021266/0204 Effective date: 20080717",
            "",
            "",
            "Effective date: 20121121"
        ]
    ],
    "pageTitle": "Patent US6149607 - Multiple sample biopsy device - Google Patents",
    "title": "",
    "url": "http://www.google.com.au/patents/US6149607",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988399.65/warc/CC-MAIN-20150728002308-00169-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 483810927,
    "recordOffset": 483782148,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Although the invention has been described in terms of a certain embodiment, other embodiments apparent to those of ordinary skill in the art also are within the scope of this invention. Thus, various changes and modifications may be made without departing from the spirit and scope of the invention. Accordingly, the scope of the invention is intended to be defined only by the claims that follow. Moreover, a removable tissue collection device or plunger could also be incorporated into the device to facilitate the orderly removal of the multiple samples so as to not disturb their sequence. This orderly removal would allow better data collecting abilities because the tissue samples could be better tracked to their origin in the patient's body. It is further contemplated that the sample collection chamber could be extended through the entire device. An embodiment in which the sample collection chamber is coextensive with the medical device could allow for the insertion of another tool from, for instance, the control handle end of the device 10, such as, for example but without limitation, a light fiber or a guide wire. Moreover, the sample collection region 23 could also serve as an open lumen to the control end of the device which would allow the removal of tissue, debris blood, or the like by a use of differential pressure. The application of suction can also be used to aid the intake of samples",
    "textAfterTable": "R. J. Surgical Instruments, Inc. Surgical cutting instrument US5415182 * 15 Oct 1993 16 May 1995 Boston Scientific Corporation Multiple needle biopsy instrument US5538008 * 17 Mar 1994 23 Jul 1996 Crowe; John Forceps for endoscopes US5542432 * 1 Feb 1994 6 Aug 1996 Symbiosis Corporation Endoscopic multiple sample bioptome US5562102 * 21 Nov 1994 8 Oct 1996 Taylor; Thomas V. Multiple biopsy device US5573008 * 29 Oct 1993 12 Nov 1996 Boston Scientific Corporation Multiple biopsy sampling coring device US5573546 * 7 Mar 1995 12 Nov 1996 Nakao; Naomi L. Biopsy ejecting forceps US5620459 * 25 Apr 1995 15 Apr 1997 Microsurge, Inc. Surgical instrument US5638827 * 12 May 1995 17 Jun 1997",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}