{
    "relation": [
        [
            "Citing Patent",
            "US7634407 *",
            "US7809568",
            "US7831425",
            "US7831428",
            "US8793129 *",
            "US20110071832 *"
        ],
        [
            "Filing date",
            "May 20, 2005",
            "Nov 8, 2005",
            "Dec 15, 2005",
            "Nov 9, 2005",
            "Sep 23, 2010",
            "Sep 23, 2010"
        ],
        [
            "Publication date",
            "Dec 15, 2009",
            "Oct 5, 2010",
            "Nov 9, 2010",
            "Nov 9, 2010",
            "Jul 29, 2014",
            "Mar 24, 2011"
        ],
        [
            "Applicant",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Microsoft Corporation",
            "Casio Computer Co., Ltd.",
            "Casio Computer Co., Ltd."
        ],
        [
            "Title",
            "Method and apparatus for indexing speech",
            "Indexing and searching speech with text meta-data",
            "Time-anchored posterior indexing of speech",
            "Speech index pruning",
            "Image display device for identifying keywords from a voice of a viewer and displaying image and keyword",
            "Image display device, method, and program"
        ]
    ],
    "pageTitle": "Patent US20050228671 - System and method for utilizing speech recognition to efficiently perform ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20050228671?dq=5435091",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990445.44/warc/CC-MAIN-20150728002310-00034-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467314211,
    "recordOffset": 467292565,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Referenced by The invention has been explained above with reference to certain preferred embodiments. Other embodiments will be apparent to those skilled in the art in light of this disclosure. For example, the present invention may be implemented using certain configurations and techniques other than those described in the embodiments above. Additionally, the present invention may effectively be used in conjunction with systems other than those described above as the preferred embodiments. Therefore, these and other variations upon the foregoing embodiments are intended to be covered by the present invention, which is limited only by the appended claims. retrieval procedure may be repeated to retrieve and display any desired number of images from stored data 226 in electronic device 110. The present invention therefore provides an improved system and method for efficiently utilizing speech recognition to perform data indexing procedures. FIG. 9 process may terminate. However, in step 934, if the search procedure locates matching pattern word(s) 612 in index file 222, then in step 940, retrieval module 518 utilizes a corresponding image identifier 616 to efficiently locate and display a corresponding image from stored data 226 upon display 134 of electronic device 110. The FIG. 9 In step 934, retrieval module 518 determines whether one or more matching pattern word(s) 612 have been found in index file 222 during the foregoing search procedure.",
    "textAfterTable": "* Cited by examiner Classifications U.S. Classification 704/260, 704/E15.045, 707/E17.103 International Classification G10L15/26, G10L13/08, G06F17/30 Cooperative Classification G06F17/30268, G10L15/26 European Classification G06F17/30M2M, G10L15/26A Legal Events Date Code Event Description Mar 30, 2004 AS Assignment Owner name: SONY CORPORATION, JAPAN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:OLORENSHAW, LEX;ABREGO, GUSTAVO HERNANDEZ;KOONTZ, EUGENE;REEL/FRAME:015164/0603 Effective date: 20040330 Owner name: SONY ELECTRONICS INC., NEW JERSEY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:OLORENSHAW, LEX;ABREGO, GUSTAVO HERNANDEZ;KOONTZ, EUGENE;REEL/FRAME:015164/0603 Effective date: 20040330 Mar 18, 2011 FPAY Fee payment Year of fee payment: 4",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}