{
    "relation": [
        [
            "Date",
            "May 17, 2004",
            "Mar 26, 2010",
            "May 9, 2014",
            "Sep 26, 2014",
            "Nov 18, 2014"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: ROCKWELL AUTOMATION TECHNOLOGIES, INC., OHIO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SKIBINSKI, GARY LEONARD;REEL/FRAME:015339/0431 Effective date: 20040507",
            "Year of fee payment: 4",
            "",
            "",
            "Effective date: 20140926"
        ]
    ],
    "pageTitle": "Patent US7113065 - Modular inductor for use in power electronic circuits - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7113065?dq=%22robert+sheehan%22",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981525.10/warc/CC-MAIN-20150728002301-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474053595,
    "recordOffset": 474025999,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations While the invention may be susceptible to various modifications and alternative forms, specific embodiments have been shown in the drawings and have been described in detail herein by way of example only. However, it should be understood that the invention is not intended to be limited to the particular forms disclosed. Rather, the invention is to cover all modifications, equivalents, and alternatives falling within the spirit and scope of the invention as defined by the following appended claims. c above. The resulting inductor may be packaged as described above, and benefits from enhanced thermal characteristics, as well as the modular packaging which facilitates its interconnection with other circuitry of the overall circuit assembly. FIG. 1 c above. The output of coil 176 is coupled to the input of coil 178, as indicated at reference numeral 184, in a lead that may be labeled “−INV1” corresponding to the arrangement of FIG. 1 On an opposite side the core, a similar arrangement is provided. That is, coils 176 and 178 are wound in a same direction in accordance with the right-hand rule. A DC bus input is provided at lead 180, and an output lead 182 maybe labeled “−INV2” to correspond to the arrangement illustrated in c above. FIG. 1 c above. The coils are wound in the same direction, and interleaved with one another to",
    "textAfterTable": "US6812676 * Jul 8, 2003 Nov 2, 2004 Texas Instruments Incorporated DC-DC converter and controller for DC-DC converter US6850426 * Apr 1, 2003 Feb 1, 2005 Honeywell International Inc. Synchronous and bi-directional variable frequency power conversion systems US6856283 * Feb 28, 2003 Feb 15, 2005 Raytheon Company Method and apparatus for a power system for phased-array radar US20030133257 * Dec 18, 2002 Jul 17, 2003 Beihoff Bruce C. Modular power converter having fluid cooled support US20040239467 * May 28, 2003 Dec 2, 2004 Cyntec Company Configuration and method for manufacturing compact high current inductor coil JPH11195533A * Title not available * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}