{
    "relation": [
        [
            "Date",
            "Feb 21, 2002",
            "May 14, 2004",
            "Dec 19, 2005",
            "Dec 11, 2006",
            "Sep 7, 2010",
            "Sep 26, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "",
            "",
            "Owner name: AFFINION NET PATENTS, INC., NEW YORK Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:TRILEGIANT LOYALTY SOLUTIONS, INC.;REEL/FRAME:017125/0465 Effective date: 20051017",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US6578012 - Fully integrated, on-line interactive frequency and award redemption program - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6578012?dq=6778979",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00040-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482653483,
    "recordOffset": 482623727,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{43942=This application is a continuation application of application Ser. No. 09/105,227 filed on Jun. 25, 1998, now U.S. Pat. No. 6,009,412, which is a continuation of application Ser. No. 08/572,017, filed on Dec. 14, 1995, now U.S. Pat. No. 5,774,870., 72074=While the above method of displaying the qualified awards is workable, it may take too much time to scan all the awards in order to “custom” build a qualified awards catalog. Therefore, other alternatives may be used for creating the qualified award catalog. According to the preferred alternative, point levels are defined. For example, point level 1 can include all awards of value up to 500 points, point level 2, up to 1000 points, etc. When the user's account is read at 425, the highest point level the user is qualified for is determined. At this point a message may be displayed such as “You are qualified for point level 3 and have additional 350 points in your account. To qualify for point level 4 you will need 150 additional points”., 73641=In the preferred embodiment the award libraries are arranged in a progressive manner, so as to avoid the need for a large memory size. The above example of the point levels will be used to explain this feature. Using the above example, award library 1 should include all awards worth up to 500 points. Award library 2 should include all awards worth from 501-1000 points, etc. Thus, if the user is qualified, for example, for point level 2, access is made to award libraries 1 and 2. Thus, duplication of awards in the various libraries is prevented.}",
    "textBeforeTable": "Patent Citations Certain variations would be apparent to those skilled in the art, which variations are considered within the spirit and scope of the claimed invention. In the description of the preferred embodiment, the term “user” also refers to merchants, product manufacturers, award program administrators, etc. These particular users may be provided with a special access code. Upon entering the special code, these particular users may be provided with a privileged access to the program which allows them to make limited changes to the data. Thus, for example, a merchant may use this special access to change a price charged for a particular product. Similarly, a program administrator may gain privileged access to enter newly added awards available through the program. In addition, in the preferred embodiment a report is generated upon each privileged entry so that the changes made can be monitored. The proper amount of points is then subtracted from the user's account and an adjustment is made in the frequency database, 520. A link is then established to the fulfillment house or directly to the product manufacturer and an award order is communicated, 530. Thereafter, the program returns to the PROGRAM HOMEPAGE 300. It should be noted that if the REDEEM 500 step has been entered into from an award page, the award described in that particular page may be automatically read into the REDEEM 500 routine as the selected award. However, the user may",
    "textAfterTable": "Mccarthy Patrick D Centralized consumer cash valve accumulation system for multiple merchants US5200889 Aug 26, 1991 Apr 6, 1993 Teraoka Seiko Co., Ltd. System for maintaining continuous total of refund amounts due a customer and for allowing customer designation of the amount of refund to be applied to a purchase US5202826 Nov 26, 1991 Apr 13, 1993 Mccarthy Patrick D Centralized consumer cash value accumulation system for multiple merchants US5233514 Jan 9, 1990 Aug 3, 1993 Luay Ayyoubi System and method for redeeming and accumulating stock purchase credits in a company by the participating consumers US5287268 Nov 16, 1992 Feb 15, 1994 Mccarthy Patrick D Centralized consumer cash value accumulation system for multiple merchants US5483444 Feb 7, 1995 Jan 9, 1996 Radisson Hotels International, Inc. System for awarding credits to persons who book travel-related reservations US5513102 Jun 28, 1994 Apr 30, 1996 Auriemma Consulting Group, Inc. Data processing methods of implementing an award to an authorized user of a credit card US5537314",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}