{
    "relation": [
        [
            "Cited Patent",
            "US1957947 *",
            "US2280206 *",
            "AT61859B *",
            "FR383073A *",
            "GB650461A *",
            "GB189416326A *",
            "GB190723396A *",
            "GB191311048A *"
        ],
        [
            "Filing date",
            "Sep 18, 1931",
            "Sep 14, 1937",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Publication date",
            "May 8, 1934",
            "Apr 21, 1942",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Applicant",
            "Dreyfuss Henry H",
            "Vitarama Corp",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Title",
            "Motion picture auditorium",
            "Motion picture theater",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available",
            "Title not available"
        ]
    ],
    "pageTitle": "Patent US2942516 - Panoramic motion picture presentation arrangement - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US2942516",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989126.22/warc/CC-MAIN-20150728002309-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 478714419,
    "recordOffset": 478696514,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{25049=References Cited in the file of this patent UNITED STATES PATENTS 1,957,947 Dreyfuss May 8, 1934 2,280,206 Waller et al Apr. 21, 1942 FOREIGN PATENTS 16,326 Great Britain 1894 23,396 Great Britain 1907 11,048 Great Britain 1913 650,461 Great Britain Feb. 28, 1951 61,859 Austria Oct. 25, 1913 383,073 France Dec. 27, 1907, 8060=Jun e 28, 1960 w. E. DISNEY ETAL PANORAMIC MOTION PICTURE PRESENTATION ARRANGEMENT 2 Sheets-Sheet 1 Filed July 17. 1956 S 2. mm N E 5 N V/W R MEI O f T 55% TV 0 A. m T 1. w m r June 28, 1960 w. E. DISNEY ETAL 2,942,515, 8543=United States Patent PAN ORAMIC MOTION PICTURE PRESENTATION ARRANGEMENT Walter E. Disney, Los Angeles, and Ub Iwerks, Sherman Oaks, Califi, assignors, by mesne assignments, to Walt Disney Productions, Burbank, Calif., a corporation of California Filed July 17, 1956, Ser. No. 598,451, 8299=I A PANORAMIC MOTION PICTURE PRESENTATION ARRANGEMENT Filed July 17. 1956 2 Sheets-Sheet. 2}",
    "textBeforeTable": "Patent Citations References Cited in the file of this patent UNITED STATES PATENTS 1,957,947 Dreyfuss May 8, 1934 2,280,206 Waller et al Apr. 21, 1942 FOREIGN PATENTS 16,326 Great Britain 1894 23,396 Great Britain 1907 11,048 Great Britain 1913 650,461 Great Britain Feb. 28, 1951 61,859 Austria Oct. 25, 1913 383,073 France Dec. 27, 1907 7. A panoramic motion picture presentation arrangement, comprising: an odd-numbered plurality of substantially fiat screens of substantially equal size, collectively defining a substantially cylindrical field; a generally vertically extending non-light reflecting strip separating the proximate edges of each of said screens; an audiencereceiving area disposed below said screens and encompassed thereby, with the eye level of the audience being below the lower edge of said screens; a horizontal partition extending outwardly from the lower portion of said screens; a walkway encompassing said partition, said partition and walkway defining a false ceiling for said audience-receiving area; and a plurality of projectors 6 corresponding to the number of said screens and strips, each of said projectors when viewed in plan being disposed diametrically opposite the screen upon which it may directly project and immediately radially outwardly of the plane of its corresponding strip, each of said projectors being disposed above the lower portion of its corresponding strip whereby said projectors may collectively project a single panoramic picture on said screens that is continuous except for the spaces occupied by said strips. said",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US3118340 * Aug 26, 1960 Jan 21, 1964 Panoramic motion picture camera arrangement US3225672 * Oct 2, 1961 Dec 28, 1965 Clay Wallace A Stereoscopic photographing and reproduction apparatus and method US3740126 * Sep 3, 1970 Jun 19, 1973 Goto Optical Mfg Co Ltd Panoramic motion picture camera US4991955 * Apr 6, 1990 Feb 12, 1991 Todd-Ao Corporation Circular projection and display system using segmented trapezoidal screens US5179399 * Jan 24, 1991 Jan 12, 1993 Pringle David A Theatre in the round projection apparatus and method US5264881 * Jun 3, 1992 Nov 23, 1993 Hughes Training, Inc. Split static surround display system",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}