{
    "relation": [
        [
            "Citing Patent",
            "US7109664 *",
            "US7444080 *",
            "US7593747",
            "US7609006",
            "US8044599 *",
            "US8358085",
            "US8487537 *",
            "US8523394 *",
            "US8569960 *",
            "US8686666",
            "US8823266 *",
            "US8860328 *",
            "US8863416",
            "US8894430 *",
            "US8959810",
            "US9044056",
            "US9055777",
            "US9072171",
            "US20050127269 *",
            "US20060279957 *",
            "US20090290076 *",
            "US20100181919 *",
            "US20120106157 *",
            "US20130119893 *",
            "US20130134875 *",
            "US20130313988 *",
            "US20140003054 *"
        ],
        [
            "Filing date",
            "Dec 16, 2003",
            "Nov 22, 2004",
            "Jul 1, 2005",
            "Jan 30, 2009",
            "Feb 17, 2009",
            "Jan 6, 2010",
            "Jan 20, 2009",
            "Oct 28, 2011",
            "Nov 14, 2011",
            "Dec 18, 2012",
            "Dec 27, 2010",
            "Dec 31, 2012",
            "Oct 24, 2012",
            "Aug 28, 2013",
            "Nov 19, 2014",
            "Mar 15, 2013",
            "Aug 8, 2013",
            "Aug 24, 2012",
            "Dec 16, 2003",
            "Jun 9, 2006",
            "",
            "Jan 20, 2009",
            "Oct 28, 2011",
            "",
            "Dec 27, 2010",
            "Dec 31, 2012",
            "Aug 28, 2013"
        ],
        [
            "Publication date",
            "Sep 19, 2006",
            "Oct 28, 2008",
            "Sep 22, 2009",
            "Oct 27, 2009",
            "Oct 25, 2011",
            "Jan 22, 2013",
            "Jul 16, 2013",
            "Sep 3, 2013",
            "Oct 29, 2013",
            "Apr 1, 2014",
            "Sep 2, 2014",
            "Oct 14, 2014",
            "Oct 21, 2014",
            "Nov 25, 2014",
            "Feb 24, 2015",
            "Jun 2, 2015",
            "Jun 16, 2015",
            "Jun 30, 2015",
            "Jun 16, 2005",
            "Dec 14, 2006",
            "Nov 26, 2009",
            "Jul 22, 2010",
            "May 3, 2012",
            "May 16, 2013",
            "May 30, 2013",
            "Nov 28, 2013",
            "Jan 2, 2014"
        ],
        [
            "Applicant",
            "Tsu-Yeh Wu",
            "Zilog, Inc.",
            "Cisco Technology, Inc.",
            "Ventur Research And Development Corp.",
            "Chu-Cheng Chang",
            "Terralux, Inc.",
            "The Sloan Company, Inc",
            "Ilumisys, Inc.",
            "Willis Electric Co., Ltd",
            "Terralux, Inc.",
            "Ningbo Huadian Envirotech Co., Ltd.",
            "National Christmas Products",
            "Polygroup Macau Limited (Bvi)",
            "Ilumisys, Inc.",
            "Polygroup Macau Limited (Bvi)",
            "Willis Electric Co., Ltd.",
            "Willis Electric Co., Ltd.",
            "Ilumisys, Inc.",
            "Tsu-Yeh Wu",
            "Samsung Electronics Co., Ltd.",
            "Tait Towers Inc.",
            "Sloanled, Inc.",
            "Altair Engineering, Inc.",
            "Johnny Chen",
            "Ningbo Huadian Envirotech Co., Ltd.",
            "Michael M. McRae",
            "Ilumisys, Inc."
        ],
        [
            "Title",
            "LED light with blaze-like radiance effect",
            "IrDA/RC transmitter circuit having low energy consumption",
            "Techniques for controlling delivery of power to a remotely powerable device based on temperature",
            "LED light string with split bridge rectifier and thermistor fuse",
            "Light string with alternate LED lamps and incandescent lamps",
            "Method and device for remote sensing and control of LED lights",
            "LED drive circuit",
            "Mechanisms for reducing risk of shock during installation of light tube",
            "Conformal power adapter for lighted artificial tree",
            "Method and device for remote sensing and control of LED lights",
            "Light regulatable LED illumination lamp",
            "Method and apparatus for controlling a multi-colored LED light string",
            "Powered tree construction",
            "Mechanisms for reducing risk of shock during installation of light tube",
            "Powered tree construction",
            "Modular tree with electrical connector",
            "Modular artificial lighted tree with decorative light string",
            "Circuit board mount for LED light",
            "LED light with blaze-like radiance effect",
            "Lamp, lamp holder, power supply module, backlight assembly having the power supply module and display device having the power supply module",
            "Flexibly supported video display",
            "Led drive circuit",
            "Mechanisms for reducing risk of shock during installation of light tube",
            "Conformal power adapter for lighted artificial tree",
            "Light Regulatable Led Illumination Lamp",
            "Method and apparatus for controlling a multi-colored LED light string",
            "Mechanisms for reducing risk of shock during installation of light tube"
        ]
    ],
    "pageTitle": "Patent US7029145 - Low voltage decorative light string including power supply - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7029145?dq=6981235",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00205-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481421431,
    "recordOffset": 481384181,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6361=The power output of the supply 50 is accessible from a terminal strip 59 mounted in a vertically elongated slot in the front wall 60 of the housing 52. This terminal strip 59 can receive up to ten plugs 61 on the ends often different light strings, as illustrated in FIG. 6 b. Thus, if each light string contains 100 lights, the power supply can accommodate a total of 1000 lights for a given tree. Each plug 61 is designed to fit the terminal strip 59 but not standard electrical outlets, to avoid accidental attachment of the low-voltage light string to a 120-volt power source. A latch 62 extends along one elongated edge of the terminal strip 59 to engage each plug 61 as it is inserted into the strip, to hold the plugs in place. When it is desired to remove one of the plugs 61, a release tab 63 is pressed to tilt the latch enough to release the plug.}",
    "TableContextTimeStampAfterTable": "{41069=This application is a U.S. continuation-in-part of International PCT Application PCT/02/07609, filed Mar. 13, 2002, which claims priority from provisional Application Ser. No. 60/287,162, filed on Apr. 27, 2001, now abandoned, and from U.S. Provisional Application Ser. No. 60/277,346 filed on Mar. 19, 2001, now abandoned., 66587=The PWM output voltage is achieved by switching a pair of MOSFET transistors Q21 and Q22 on and off by the integrated circuit driver U21, such as an IR21571 driver available from International Rectifier. MOSFET transistors Q21 and Q22, such as an IRFB260N available from International Rectifier have very low “on” resistance which improves the efficiency of energy transfer. The driver U21 is powered by a charge pump created by a capacitor C30, a pair of diodes D23 and D24, and a current limiter R31. A safety thermal shutdown circuit is formed by a thermistor TH21 and a resistor R25 which act as a voltage divider to the shut down pin of the driver U21. If the thermistor's resistance decreases due to a temperature increase beyond the design specification, the voltage presented to the driver U21 increases above 2.0 volts, which causes the driver U21 to shut down and protects the circuit and the power MOSFETs Q21 and Q22., 79436=Light strings embodying the present invention are particularly useful when used to pre-string artificial trees, such as Christmas trees. Such trees can contain well over 1000 lights and can cost several hundred dollars (US) at the retail level. When a single light and its shunt fail in a series light string, the lights in an entire section of the tree can be extinguished, causing customer dissatisfaction and often return of the tree for repair or replacement pursuant to a warranty claim. When the artificial tree is made in sections that are assembled by the consumer, only the malfunctioning section may be returned, but the cost to the warrantor is nevertheless substantial. With the light string of the present invention, however, the only lights that are extinguished when a single light fails are the lights in the same series-connected group as the failed light. Since this group includes only a few lights, typically 2 to 5 lights, the failed bulb can be easily located and replaced., 77277=The low-voltage output of the power supply may have a voltage level other than 24 volts, but it is preferably no greater than the 42.4 peak voltage specified in the UL standard UL1950, SELV (Safe Extra-Low Voltage). With a 30-volt supply, for example, 10-volt lights may be used in groups of three, or 6-volt lights may be used in groups of five. Other suitable supply voltages are 6 and 12 volts, although the number of lights should be reduced when these lower output voltages are used., 70267=If a wider range of dimming control is needed, the driver U21 can be replaced by another integrated circuit such as an IC2106 along with a PWM controller to drive a fuller range of PWM output voltage. Because the lamp load is a resistive load, the output can be controlled from almost zero light to full light.}",
    "textBeforeTable": "Patent Citations . With the tool 250 in this position, the tool is pulled upwardly to pry the bulb base 257 out of the socket 254. The tool 250 may be made of metal or a rigid plastic. FIG. 14 ). The tool 250 can also be placed over the bulb 258, with the bulb extending upwardly through an opening 259 in the tool, and with the inner edge 260 of the opening 259 resting on the top surface 253 of the socket 254, as illustrated in FIG. 13 illustrate a separate bulb-removal tool 250 that can be packaged with the other spare parts for a light string. The bases and sockets of such bulbs are typically made to fit tightly together to ensure that the bulbs remain in their sockets and maintain the electrical connections that are made by a tight frictional fit within those sockets. As a result, when a bulb fails, it is often difficult to remove the burned-out bulb for replacement. The tool 250 has an elongated tapered edge 251 that forms a cutout 252 that can be pressed between the top surface 253 of a bulb socket 254 and the lower surface of a flange 256 on a bulb base 257. The tool can be tilted up and down, and pivoted back and forth horizontally, while being pressed between the flange 256 and the socket surface 253, to",
    "textAfterTable": "US4943752 Sep 8, 1988 Jul 24, 1990 Todd Philip A Piezoelectric incandescent lamp test device US4984999 * May 17, 1990 Jan 15, 1991 Leake Sam S String of lights specification US5032961 Feb 26, 1990 Jul 16, 1991 Territoire De La Polynesie Francaise Ground light system for a landing strip US5070522 Aug 23, 1989 Dec 3, 1991 Nilssen Ole K Combined signal and power distribution system US5150964 Jun 21, 1991 Sep 29, 1992 Tsui Pui Hing Joy light structure US5180952 Feb 7, 1992 Jan 19, 1993 Nilssen Ole K Electronic track lighting system US5290986 Oct 22, 1991 Mar 1, 1994 International Business Machines Corporation Thermally assisted shorts removal process for glass ceramic product using an RF field US5317491 Aug 3, 1992 May 31, 1994 Lee Kuo Hsing Holder for string of electric lights US5365145 Aug 9, 1993",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}