{
    "relation": [
        [
            "Citing Patent",
            "US7576901",
            "US7643305",
            "US7646529",
            "US7782522",
            "US7952788",
            "US8144385",
            "US8988760"
        ],
        [
            "Filing date",
            "Dec 17, 2007",
            "Mar 7, 2008",
            "Feb 3, 2009",
            "Jul 17, 2008",
            "Jul 7, 2009",
            "Jan 11, 2010",
            "Jul 27, 2010"
        ],
        [
            "Publication date",
            "Aug 18, 2009",
            "Jan 5, 2010",
            "Jan 12, 2010",
            "Aug 24, 2010",
            "May 31, 2011",
            "Mar 27, 2012",
            "Mar 24, 2015"
        ],
        [
            "Applicant",
            "Idc, Llc",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc.",
            "Qualcomm Mems Technologies, Inc."
        ],
        [
            "Title",
            "Method and device for selective adjustment of hysteresis window",
            "System and method of preventing damage to metal traces of flexible printed circuits",
            "Method and device for multistate interferometric light modulation",
            "Encapsulation methods for interferometric modulator and MEMS devices",
            "Method and device for selective adjustment of hysteresis window",
            "Method and device for multistate interferometric light modulation",
            "Encapsulated electromechanical devices"
        ]
    ],
    "pageTitle": "Patent US7355782 - Systems and methods of controlling micro-electromechanical devices - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7355782?dq=6650327",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00188-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 482559811,
    "recordOffset": 482507604,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6384=Referring to FIGS. 10A and 10B, the initial stage of the IMods fabrication process is shown, FIG. 10A. Arrow 1004 indicates the direction of the perspective of the side view. Substrate 1000 has had sacrificial spacer 1002 a silicon layer 2000 angstroms thick deposited and patterned on its surface.}",
    "TableContextTimeStampAfterTable": "{30100=This application is a continuation of co-pending U.S. application Ser. No. 11/438,913, filed May 23, 2006, which is a continuation of U.S. application Ser. No. 09/413,222, filed Oct. 5, 1999 (now U.S. Pat. No. 7,123,216)., 106295=A static version of this geometry is described in the paper H.A. Haus “Channel drop filters in photonic crystals”, Optics Express, vol. 3, no. 1, 1998., 90193=Fabricated on a substrate 1100 (glass is one possibility though there are many others), the structure is essentially a circular waveguide whose refractive index and dimensions w, r, and h determine the frequencies and modes of light which will propagate within it. Such a resonator, if designed correctly, can act as a frequency selective filter for broadband radiation that is coupled into it. In this case, the radiation is generally propagating in the XY plane as indicated by orientation symbol 1101. The one-dimensional analog of this device would be a Fabry-Perot filter made using single layer mirrors. Neither device exhibits a high order optical periodicity, due to the single layer “boundaries” (i.e. mirrors); however, they can be considered photonic structures in the broad sense., 104728=On the inner surface of the membrane 1315 are fabricated two isolated columns 1311, which are directed downwards, and have the same dimensions and are of the same material (or optically equivalent) as the columns on the substrate. The resonator and columns are designed to complement each other; there is a corresponding absence of a column in the resonator where the column on the membrane is positioned., 111282=The standoff is fabricated from a material that has the same or higher index of refraction than that of the substrate. This could be SiO2 (same index) or a polymer whose index can be varied. The standoff is machined so that the mirror is supported at an angle of 45 degrees. Machining of the standoff can be accomplished using a technique known as analog lithography that relies on a photomask whose features are continuously variable in terms of their optical density. By appropriate variation of this density on a particular feature, three-dimensional shapes can be formed in photoresist that is exposed using this mask. The shape can then be transferred into other materials via reactive ion etching. The entire assembly is suspended over conductor, 1503, which has been patterned to provide an unobstructed “window” 1505 into the underlying substrate, 1504. That is to say the bulk of conductor 1503 has been etched away so that window 1505, comprising bare glass, is exposed. The switch, like other IMods, can be actuated to drive the whole assembly into contact with the substrate/waveguide. Side view, 1512, shows the optical behavior. Beam 1510 is propagating within the substrate at an angle 45 degrees from normal that prevents it from propagating beyond the boundaries of the substrate. This is because 45 degrees is above the angle known as the critical angle, which allows the beam to be reflected with minimal or no losses at the interface 1519 between the substrate and the outside medium by the principle of total internal reflection (TIR)., 112927=The principle of TIR depends on Snell's law, but a basic requirement is that the medium outside the substrate have an index of refraction that is lower than that of the substrate. In side view, 1512, the device is shown with the switch 1506 in the un-driven state, and beam 1510 propagating in an unimpeded fashion. When switch 1506 is actuated into contact with the substrate as shown in side view 1514, the beam's path is altered. Because the standoff has a refractive index greater than or equal to that of the substrate, the beam no longer undergoes TIR at the interface. The beam propagates out of the substrate into the optical standoff, where it is reflected by the mirror. The mirror is angled, at 45 degrees, such that the reflected beam is now traveling at an angle which is normal to the plane of the substrate. The result is that the light may propagate through the substrate interface because it no longer meets the criteria for TIR, and can be captured by a fiber coupler 1520, which has been mounted on the opposite side of the substrate/waveguide. A similar concept is described in the paper, X. Zhou, et al, “Waveguide Panel Display Using Electromechanical Spatial Modulators”, SID Digest, vol. XXIX, 1998. This particular device was designed for emissive display applications. The mirror may also be implemented in the form of a reflecting grating, which may be etched into the surface of the standoff using conventional patterning techniques. This approach, however, exhibits wavelength dependence and losses due to multiple diffraction orders that are not an issue with thin film mirrors. Additionally, alternative optical structures may be substituted for the mirror as well with their respective attributes and shortcomings. These can be categorized as refractive, reflective, and diffractive and can include micro-lenses (both transmissive and reflective), concave or convex mirrors, diffractive optical elements, holographic optical elements, prisms, and any other form of optical element which can be created using micro-fabrication techniques. In the case where an alternative optical element is used, the standoff and the angle it imparts to the optic may not be necessary depending on the nature of the micro-optic., 131035=In this device example, all of the films are etched using the same pattern. This is seen in 1918 where the photoresist has been stripped away after the application of tool 1916. Tool 1920, is another deposition tool that deposits what will become the structural layer of the IMod. Aluminum is one candidate for this layer 1922. This material may also include organic materials which exhibit minimal residual stress and which may be deposited using a variety of PVD and PECVD techniques. This layer is subsequently patterned, etched, and stripped of photoresist using tools 1924, 1926, and 1928 respectively. Tool 1930 is used to etch away the sacrificial layer. If the layer is silicon, this can be accomplished using XeF2, a gas phase etchant used for such purposes. The result is the self-supporting membrane structure 1932 that forms the IMod., 136846=The imaging device is connected to a computer system 2036, upon which resides hardware and capable of recording and processing the image data. The hardware could comprise readily available high speed processing boards to perform numerical calculations at high rates of speed. The software may consist of collection routines to collect color information and calculate surface deformations. The core routine would use the deformation data to determine the optimal combination of uniform stress and stress gradient across the thickness of the membrane, which is capable of producing the overall shape., 94068=This kind of structure may also be fabricated using the same materials and techniques used to fabricate the resonator 1102. For example, a single film of silicon may be deposited on a glass substrate and patterned, using conventional techniques, and etched using reactive ion etching to produce the high aspect ratio columns. For a wavelength of 1.55 μm, the diameter and spacing of the columns could be on the order of 0.5 μm and 0.1 μm respectively., 131984=Packaging of the resulting devices is accomplished by bonding flexible sheet 1933 to the top surface of the substrate sheet. This is also supplied by a continuous roll 1936 that has been coated with a hermetic film, such as a metal, using coating tool 1934. The two sheets are joined using bonding tool 1937, to produce the resulting packaged device 1940., 41998=An attribute of one previously described IMod design (the induced absorber design described in U.S. patent application Ser. No. 08/554,630, filed on Nov. 6, 1995, and incorporated by reference) is the efficiency of its dark state, in which it can absorb as much as 99.7% of light which is incident upon it. This is useful in reflective displays. In the described design, the IMod reflects light of a certain color in the un-actuated state, and absorbs light in the actuated state., 109565=To incident light, the IMod operates as an absorbing region whose area depends on the value of the applied voltage. Side view 1434 shows the effect on a substrate propagating beam when no voltage is applied. The corresponding reflective area 1429, which shows the IMod from the perspective of the incident beam, shows “footprint” 1431 of the beam superimposed on the reflective area. Since the entire area 1429 is non-absorbing, beam, 1430, is reflected from IMod 1428 (with minimal losses) in the form of beam 1432., 129780=The metal master is mounted on a drum that is pressed against the sheet with enough pressure to deform the plastic to form the depressions. View 1906 illustrates this. Coater 1908 deposits thin layers of material using well known thin film deposition processes, such as sputtering or evaporation. The result is a stack 1910 of four films comprising an oxide, a metal, an oxide, and a sacrificial film. These materials correspond to the induced absorber IMod design. A tool 1912 dispenses, cures, and exposes photoresist for patterning these layers. Once the pattern has been defined, the film etching occurs in tool 1914. Alternatively, patterning may be accomplished using a process known as laser ablation. In this case, a laser is scanned over the material in a manner that allows it to be synchronized with the moving substrate. The frequency and power of the laser is such that it can evaporate the materials of interest to feature sizes that are on the order of microns. The frequency of the laser is tuned so that it only interacts with the materials on the substrate and not the substrate itself. Because the evaporation occurs so quickly, the substrate is heated only minimally., 81262=Thus, the electronics may be implemented using other means as suggested in U.S. patent application Ser. No. 08/769,947, filed on Dec. 19, 1996 and incorporated by reference. In particular the drive electronics and logic functions can be implemented using switch elements based on MEMS., 73667=Incident light 706 is either completely absorbed or a particular frequency of light 708, is reflected depending on the spacing of the layers of the stack. The optical behavior is like that of the induced absorber IMod described in U.S. patent application Ser. No. 08/688,710, filed on Jul. 31, 1996, and incorporated by reference., 110163=In side view 1436, an interim voltage value is applied and the reflected beam 1440 has been attenuated to some extent because the reflective area, shown in 1437 is now partially absorbing. Views 1438 and 1429 reveal the result of full actuation and the complete attenuation of the beam., 30354=The disclosures of all the above-referenced prior applications, publications, and patents are considered part of the disclosure of this application, and are incorporated by reference herein. The disclosures of U.S. application Ser. Nos. 08/554,630, (now abandoned), 08/688,710 (now U.S. Pat. No. 6,040,937), 08/744,253 (now U.S. Pat. No. 5,986,796), 08/769,947 (now abandoned) and 09/056,975 (now U.S. Pat. No. 6,674,562) filed on Nov. 6, 1995, Jul. 31, 1996, Nov. 5, 1996, Dec. 19, 1996, and Apr. 8, 1998, respectively, are hereby incorporated by reference., 64351=In personal computers, power consumption is not an issue, and the user typically wants to run a large number of complicated software applications. The opposite is true of typical display centric/personal electronic products. They are required to consume low power and offer a relatively small number of relatively simple programs. Such a regime favors implementing the special purpose programs, which could include web browsers, calendar functions, drawing programs, telephone/address databases, and handwriting/speech recognition among others, as hardapps. Thus whenever a particular mode of functionality, e.g., a program, is required by the user, the core processor is reconfigured with the appropriate hardapp and the user interacts with the product. Thus the hardapp processor, a variant of a Field Programmable Gate Array has the hardapp (i.e. program) manifested in its internal logic and connections, which get re-arranged and re-wired every time a new hardapp is loaded. Numerous suppliers of these components also provide an application development system that allows a specialized programming language (a hardware description language) to be reduced into the logical representation that makes up the appropriate processor. Numerous efforts are also underway to simplify the process or reducing higher level programming languages into this form as well. One approach to realizing such a processor is detailed in the paper Kouichi Nagami, et al, “Plastic Cell Architecture: Towards Reconfigurable Computing for General-Purpose”, Proc. IEEE Workshop on FPGA-based Custom Computing Machines, 1998., 120150=Beam 1702 is incident upon Fabry-Perot 1704, which transmits a particular frequency of light 1708 while reflecting the rest 1709. The transmitted frequency is incident onto and reflected from the reflective superstructure 1706, and is reflected again by mirror 1716 onto angled mirror 1710. Mirror 1710 is tilted such that the light is directed towards antireflection coating 1712 at a normal angle with respect to the substrate, and passes through and into the external medium. The device as a whole thus acts as a wavelength selective filter., 115245=This variation on the IMod acts as a de-coupling switch for light. Broadband radiation, or specific frequencies if the mirror is designed correctly, can be coupled out of the substrate/waveguide at will. Side view 1526 shows a more elaborate implementation in which an additional fixed mirror, angled at 45 degrees, has been fabricated on the side of the substrate opposite that of the de-coupling switch. This mirror differs from the switch in that it cannot be actuated. By careful selection of the angles of the mirrors on both structures, light 1522 that has been effectively decoupled out of the substrate by switch 1506 may be re-coupled back into the substrate by re-coupling mirror 1528. However, by fabricating the re-coupling mirror with different orientations in the XY plane, the mirror combination may be used to redirect light in any new direction within the substrate/waveguide. The combination of these two structures will be referred to as a directional switch. Re-coupling mirrors can also be used to couple any light that is propagating into the substrate in a direction normal to the surface., 107358=The materials are configured so that in the undriven state the device reflects in a particular wavelength region, but becomes very absorbing when the membrane is driven into contact. Side view 1410 shows a view of the device looking into the side of the substrate. Light beam 1408 propagates at some arbitrary angle through the substrate and is incident on IMod 1406, shown in the un-driven state. Assuming the frequency of the light corresponds with the reflective region of the IMod in the un-driven state, the light is reflected at a complementary angle and propagates away. Side view, 1414, shows the same IMod in the driven state. Because the device is now very absorbing, the light which is incident upon it is no longer reflected but absorbed by the materials in the IMod's stack., 125763=This structure produces the same result as a recoupling mirror, except that the mirror is parallel to the surface of the substrate. Because the mirror is suspended a fixed distance beyond the substrate surface, the position of the point of incidence on the opposite substrate interface is shifted towards the right. This shift is directly determined by the height of the repositioner. The beam 1819, containing the unselected wavelengths, is also shifted by virtue of repositioner 1818. The result is that all three beams are equally separated when they are incident on an array of decoupling switches 1820 and 1824. These serve selectively to redirect the beams into one of two optical combiners, 1828 being one of them or into detector/absorber 1830. The optical combiners may be fabricated using a variety of techniques. A polymeric film patterned into the form of a pillar with its top formed into a lens using reactive ion etching is one approach. The absorber/detector, comprising a semiconductor device that has been bonded to the substrate, serves to allow the measurement of the output power of the mixer. Optical superstructures 1829 support external optical components and provide a hermetic package for the mixer.}",
    "textBeforeTable": "Patent Citations Other embodiments are within the scope of the following claims. All three of these types of discontinuous films are candidates for inclusion into an IMod structure. That is to say they could act as one or more of the material films in the static and/or movable portions of an IMod structure. All three exhibit unique optical properties which can be manipulated in ways that rely primarily on the structure and geometry of the individual film instead of a combination of films with varying thickness. They can be used in conjunction with other electronic, optical, and mechanical elements of an IMod that they could comprise. In very simple cases, the optical properties of each of these films may be changed by bringing them into direct contact or close proximity to other films via surface conduction or optical interference. This can occur by directly altering the conductivity of the film, and/or by altering the effective refractive index of its surrounding medium. Thus more complex optical responses in an individual IMod may be obtained with simpler structures that have less complex fabrication processes. . Instead, its optical properties differ from the un-etched film in that incident radiation experiences lower losses and may exhibit transmission peaks based on surface plasmons. Additionally, the geometry of the holes as well as the angle of incidence and refractive index of the incident medium may be manipulated to control the spectral characteristics",
    "textAfterTable": "US4459182 Apr 22, 1983 Jul 10, 1984 U.S. Philips Corporation Method of manufacturing a display device US4482213 Nov 23, 1982 Nov 13, 1984 Texas Instruments Incorporated Perimeter seal reinforcement holes for plastic LCDs US4519676 Jan 24, 1983 May 28, 1985 U.S. Philips Corporation Passive display device US4786128 Dec 2, 1986 Nov 22, 1988 Quantum Diagnostics, Ltd. Device for modulating and reflecting electromagnetic radiation employing electro-optic layer having a variable index of refraction US4790635 Apr 24, 1987 Dec 13, 1988 The Secretary Of State For Defence In Her Brittanic Majesty's Government Of The United Kingdom Of Great Britain And Northern Ireland Electro-optical device US4859060 Nov 25, 1986 Aug 22, 1989 501 Sharp Kabushiki Kaisha Variable interferometric device and a process for the production of the same US4900136 Oct 28, 1988 Feb 13, 1990 North American Philips Corporation Method of metallizing silica-containing gel and solid state light modulator incorporating the metallized gel US4965562 May 6, 1988",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}