{
    "relation": [
        [
            "Cited Patent",
            "US2685289 *",
            "US3189031 *",
            "US3566874 *",
            "US3861396 *",
            "US4182342 *"
        ],
        [
            "Filing date",
            "Nov 3, 1952",
            "Nov 4, 1963",
            "Aug 13, 1968",
            "Aug 8, 1973",
            "Apr 28, 1978"
        ],
        [
            "Publication date",
            "Aug 3, 1954",
            "Jun 15, 1965",
            "Mar 2, 1971",
            "Jan 21, 1975",
            "Jan 8, 1980"
        ],
        [
            "Applicant",
            "Devine Jr John W",
            "Andersen Prod H W",
            "Nat Patent Dev Corp",
            "Hydro Med Sciences Inc",
            "Med-Pro, Ltd."
        ],
        [
            "Title",
            "Surgical apparatus for intestinal intubation",
            "Gastrointestinal sump tube",
            "Catheter",
            "Drainage tube",
            "Naso-gastric feeding device and method of inserting same"
        ]
    ],
    "pageTitle": "Patent US4516970 - Medical device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4516970?ie=ISO-8859-1&dq=6,243,373",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981753.21/warc/CC-MAIN-20150728002301-00009-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 473758335,
    "recordOffset": 473735037,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Without further analysis, the foregoing will so fully reveal the gist of the present invention that others can, by applying current knowledge, readily adapt it for various applications without omitting features that, from the standpoint of prior art, fairly constitute essential characteristics of the generic and specific aspects of our contribution to the art and, therefore, such adaptations should and are intended to be comprehended within the meaning and range of equivalence of the claims. A modification of the element 60 is shown in FIG. 7. The modified element 60a has an inner wall 61a, an outer wall 62a, an elongated annular clearance 63a between the walls 61a and 62a, and a set of normally coaxial tubular elements or annuli 64a in the clearance 63a. The neighboring surfaces of the annuli 64a are convex so as to promote the flexibility of the element 60a. The material of the tubular elements 64a may be identical with that of the elements 64 shown in FIG. 6. Thus, such material may be a metal-powder/binder mixture which is polymerized in a manner as described in connection with FIG. 5. The weighting of the element 60 is accomplished, as illustrated, by confining in the clearance 63 a series of axially adjacent annuli 64. There may be made from the metal-powder/binder mixture disclosed herein and polymerized as discussed hereinbefore. In fact, that is what is shown in the drawing. However, it is",
    "textAfterTable": "* Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4594074 * May 6, 1985 Jun 10, 1986 Viridian, Inc. Non-occluding high flow enteral feeding tube US4610673 * Feb 19, 1985 Sep 9, 1986 Superior Healthcare Group, Inc. Gastroenteric feeding tube US4631054 * Nov 16, 1984 Dec 23, 1986 Kim Il G Apparatus and process for naso-intestinal intubation US4692152 * Mar 15, 1985 Sep 8, 1987 Fresnius Ag Medical tube US4698059 * Sep 26, 1986 Oct 6, 1987 Concept Polymer Technologies, Inc. Enteral feeding tubes US4769014 * Jun 2, 1987 Sep 6, 1988 Superior Biosystems Inc. Gastroenteric feeding tube for endoscopic placement US4778455 * Dec 23,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}