{
    "relation": [
        [
            "Citing Patent",
            "US8179238 *",
            "US8188847 *",
            "US8285611",
            "US8339251",
            "US8358205",
            "US8362888",
            "US8416067",
            "US8442758",
            "US8532921",
            "US8583319 *",
            "US8594861",
            "US8788114 *",
            "US8868220",
            "US8896430",
            "US8915738 *",
            "US8977427 *",
            "US9076331 *",
            "US20090045924 *",
            "US20090254270 *",
            "US20120105213 *",
            "US20130110310 *",
            "US20130189649 *",
            "US20140094995 *"
        ],
        [
            "Filing date",
            "Jul 23, 2008",
            "Dec 28, 2011",
            "Dec 29, 2009",
            "Apr 4, 2012",
            "Apr 4, 2012",
            "Apr 4, 2012",
            "Sep 9, 2009",
            "Feb 27, 2012",
            "Feb 27, 2012",
            "Sep 8, 2011",
            "Feb 27, 2012",
            "Dec 21, 2011",
            "Apr 19, 2011",
            "Mar 13, 2013",
            "Jan 24, 2012",
            "Oct 7, 2013",
            "Jul 16, 2007",
            "Jul 23, 2008",
            "Apr 2, 2008",
            "",
            "",
            "Jan 24, 2012",
            "Oct 7, 2013"
        ],
        [
            "Publication date",
            "May 15, 2012",
            "May 29, 2012",
            "Oct 9, 2012",
            "Dec 25, 2012",
            "Jan 22, 2013",
            "Jan 29, 2013",
            "Apr 9, 2013",
            "May 14, 2013",
            "Sep 10, 2013",
            "Nov 12, 2013",
            "Nov 26, 2013",
            "Jul 22, 2014",
            "Oct 21, 2014",
            "Nov 25, 2014",
            "Dec 23, 2014",
            "Mar 10, 2015",
            "Jul 7, 2015",
            "Feb 19, 2009",
            "Oct 8, 2009",
            "May 3, 2012",
            "May 2, 2013",
            "Jul 25, 2013",
            "Apr 3, 2014"
        ],
        [
            "Applicant",
            "R&L Carriers, Inc.",
            "R&L Carriers, Inc.",
            "Fuller Max L",
            "R+L Carriers, Inc.",
            "R&L Carriers, Inc.",
            "R&L Carriers, Inc.",
            "United Parcel Service Of America, Inc.",
            "Toyota Motor Engineering & Manufacturing North America, Inc.",
            "Toyota Motor Engineering & Manufacturing North America, Inc.",
            "Webtech Wireless Inc.",
            "Toyota Motor Engineering & Manufacturing North America, Inc.",
            "Telenav, Inc.",
            "Crucs Holdings, Llc",
            "United Parcel Service Of America, Inc.",
            "Toyota Motor Engineering & Manufacturing North America, Inc.",
            "Webtech Wireless Inc.",
            "Crucs Holdings, Llc",
            "R & L Carriers, Inc.",
            "O2Micro, Inc.",
            "R+L Carriers, Inc.",
            "Telenav, Inc.",
            "Toyota Motor Engineering & Manufacturing North America, Inc.",
            "Webtech Wireless Inc."
        ],
        [
            "Title",
            "Information transmission and processing systems and methods for freight carriers",
            "Information transmission and processing systems and methods for freight carriers",
            "Method for in-cab driver operation",
            "Information transmission and processing systems and methods for freight carriers",
            "Information transmission and processing systems and methods for freight carriers",
            "Information transmission and processing systems and methods for freight carriers",
            "Systems and methods for utilizing telematics data to improve fleet management operations",
            "Systems and methods for a vehicle smart calendar",
            "Systems and methods for determining available providers",
            "System, method and odometer monitor for detecting connectivity status of mobile data terminal to vehicle",
            "Systems and methods for communicating with a vehicle user",
            "Navigation system with compliance reporting and method of operation thereof",
            "Systems and methods for automatically changing operational states of appliances",
            "Systems and methods for utilizing telematics data to improve fleet management operations",
            "Driver quality assessment for driver education",
            "System, method and odometer monitor for detecting connectivity status of mobile data terminal to vehicle",
            "System and method to monitor vehicles on a roadway and to control driving restrictions of vehicle drivers",
            "Information Transmission and Processing Systems and Methods For Freight Carriers",
            "System and method for tracking a path of a vehicle",
            "Information Transmission and Processing Systems and Methods for Freight Carriers",
            "Navigation system with compliance reporting and method of operation thereof",
            "Driver quality assessment for driver education",
            "System, Method and Odometer Monitor for Detecting Connectivity Status of Mobile Data Terminal to Vehicle"
        ]
    ],
    "pageTitle": "Patent US7881838 - Driver activity and vehicle operation logging and reporting - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7881838?dq=6,263,507",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00056-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 476820995,
    "recordOffset": 476775403,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6401=Referring to FIG. 4, data acquisition and recording 130 encompasses acquiring data from the vehicle mileage sensing system, the vehicle ECM, GPS, driver input, and data portal 235. The on-board recorder 200 is connected to the ECM of the vehicle through a data bus, such as an SAE J1708, J1850 or J1939 data bus connected through the ECM interface 225. The data on the bus is translated into an RS232 signal via a commercial off-the-shelf data translator and fed into the on-board recorder processor 205 and memory 210. The vehicle mileage sensing system interface 220 is formed, for example, by hard-wiring on-board recorder 200 to the vehicle's magnetic speed sensor. Recorder 200 includes a Global Positioning System (GPS) receiver which forms satellite interface 230 and derives its input signal from an antenna located on the interior or exterior of the vehicle.}",
    "TableContextTimeStampAfterTable": "{78973=Recorder 200 can have a short range RF transmitter which broadcasts the driver's HOS compliance status, electronic vehicle license plate, driver's risk factor based on past records, etc. The receiver can be an RF receiver distributed to state, local, and federal authorities for a snapshot monitoring status of drivers (HOS compliant or non compliant) high risk drivers and vehicles at toll gates and border crossings, and for Homeland Security purposes generally. The receiver can plug into the cigarette lighter of the law enforcement vehicle, similar power source or be positioned within a handheld device. A non-compliant driver can be identified by recorder 200 emitting short range signals, such as 315 MHZ or 434 MHZ (approximately 200 ft) RF signals, which can be detected by authorities. The receiver held by authorities can be a 315 MHZ or 434 MHZ RF device. The data exchange is dependent upon an authentication process, whereby only authorized users (the authorities) can access the data. The authorities can then be alerted while driving past a vehicle on the highway or when sitting along an interstate and monitoring for violators. Once a violation has been detected the authorities can obtain a detailed log from the recorder via a hard connection or a wireless connection, such as BLUETOOTH.™ OR WIFI.™ adapter in the USB data port of recorder 200. Also the non compliant driver status can be broadcasted on the SAE J1708/1587 data bus and the RS-232 port from the recorder. As another method the RS-232 and/or SAE J1708 data can allow existing telecommunication products on the vehicle such as QUALCOMM.™, XATA.™ and PEOPLENET.™ to transmit the driver log report status. Also, as another method the RS232, SAE J1708 or USB data port can allow the driver logs to be downloaded via WIFI.™ or BLUETOOTH.™ adapters or devices at WIFI.™ hot spots at truck stops, for example, SIRICOMM.™ has incorporated WIFI.™ hot spots at Pilot Service Centers, and WIFI.™ Hot(s) Networks are planned at weigh stations, toll gates, and Fleet Terminals., 26766=Federal regulations relating to the safe operation of Commercial Motor Vehicles (CMV) are defined in 49 CFR Part 395 and 49 CFR Part 390.5, the entirety of each of which are incorporated by reference. One way in which safety is promoted in the hours-of-service regulations is to prohibit drivers from operating or being forced to operate their vehicles more than a specified amount of time between mandatory off-duty periods. In 1987, the FMCSA permitted carriers the flexibility of using an automatic on-board recording devices (AOBRD) instead of the traditional reporting method involving manual data entry and filing of reports by the CMV drivers and/or their carriers., 55795=Mileage can be determined from only the ECM or through a broadcasting of an odometer reading from a vehicle dashboard, such as on a SAE J 1708 MID 140 bus. Alternatively, data received from the vehicle mileage sensing system, such as a speed sensor positioned at the transmission tail shaft of a vehicle can be automatically calibrated, for example, by comparing the data to mileage determined from GPS or through GPS mapping from a central server. The device can be automatically re-calibrated, by programming recorder 200 with the size and wear of the vehicle's tires and/or for different gear ratios. Recorder 200 can then provide the calibrated mileage to at least one of the odometer display and the ECM. Vehicle mileage can also be calibrated by using the GPS mapping at the central server and then sending the calibration back to the vehicle., 34599=Automatically uploading includes uploading over a pager connection, a cellular telephone connection, a wide area network connection, an infrared connection, a radio connection, and/or a satellite connection. Automatically uploading includes uploading during an off-peak operating period, for example between 1:00 am and 5:00 am and/or on a weekend, for a wireless telecommunications network. Automatically uploading includes attempting to upload at least daily first over a least expensive connection and, if unsuccessful, then over at least one next least expensive connection, and uploading over a satellite connection when successive daily uploads are unsuccessful. Automatically uploading includes attempting to upload at least daily first over a predetermined wireless telecommunications network connection and, if unsuccessful, then over another predetermined wireless telecommunications network. Automatic uploading is an uploading of the current day, previous days, or day prior to the previous day hours of service and/or fuel tax logs., 25829=One of the largest government-mandated paperwork and cost burdens imposed upon any segment of private industry are the reporting requirements relating to commercial motor vehicles (CMV). Commercial Motor Vehicles (CMV) and their respective drivers and carriers are required by various federal regulations and international agreements to comply with rules governing the safe operation of the vehicles and the reporting of fuel taxes. In 1937, the federal government imposed hours-of-service (HOS) regulations upon commercial motor vehicle drivers operating commercial vehicles in the domestic motor carrier industry to ensure highway safety. Under direction of Congress, the Federal Motor Carrier Safety Administration (FMCSA) has scrutinized and periodically revised the hours-of-service regulations to aid in the reduction of driver fatigue and sleep disorder related incidents on the nation's highways., 61982=Recorder 200 is configured to automatically attempt to transmit data to a host server via the wireless telecommunications network's off-peak hours, e.g., at a pre-determined period of time (e.g., 1:00 am-5:00 am) that is selected because it is available at low cost. A wireless telecommunications network made up of pager networks, cell phone networks and wide area networks provides low cost options. Other options are an infrared connection, a radio connection, and a satellite connection. Recorder 200 is programmed to seek a single wireless telecommunications network to upload data to a host server. Alternatively, recorder 200 can be programmed to seek various wireless telecommunications networks to upload data to a host server, from the least cost to the next most expensive cost and so on until the device finds such a data link and uploads its data. If after a predetermined time period for performing an upload, such as fourteen days, upload has not been successful, each day's HOS log, and IFTA log, and alternatively an exceptions report as well, can be uploaded whenever the recorder comes into contact with the predetermined method of uploading data, or can be uploaded over a satellite connection. Data is stored on recorder 200 for not less than 14 consecutive days and is organized by driver for hours of service purposes and/or by vehicle for fuel tax reporting purposes., 82038=Recorder 200 can also be provided with the option of detecting whether or not a trailer is tethered to the vehicle. If tethered, recorder 200 connects to a PLC chip located in the trailer from the ABS Trailer Module that contains the trailer's ID number and related data and a PLC receiver chip located in the recorder. The trailer ID information can be obtained from various sources, for example, via a PLC4Trucks power line communications, such as defined in SAE J2497. If the fleet operator wants to locate that particular trailer it can access the PLC network chip via cell or pager network, or via satellite, through recorder 200., 82727=The Recorder 200 can be equipped with a Tractor PLC ID transmitter chip and the driver log information can be downloaded from a Trailer Tracking System, such as TERION.™, using a SAE J2497 power line communication protocol. This method allows the driver's log report along with a tractor ID to be sent through an existing power line, for example, using a standard SAE J560 tractor/trailer connector and SAE J2497 protocol to a trailer communication wireless product.}",
    "textBeforeTable": "Patent Citations Accordingly, other embodiments are within the scope of the following claims. The Recorder 200 can be equipped with a Tractor PLC ID transmitter chip and the driver log information can be downloaded from a Trailer Tracking System, such as TERION.™, using a SAE J2497 power line communication protocol. This method allows the driver's log report along with a tractor ID to be sent through an existing power line, for example, using a standard SAE J560 tractor/trailer connector and SAE J2497 protocol to a trailer communication wireless product. Recorder 200 can also be provided with the option of detecting whether or not a trailer is tethered to the vehicle. If tethered, recorder 200 connects to a PLC chip located in the trailer from the ABS Trailer Module that contains the trailer's ID number and related data and a PLC receiver chip located in the recorder. The trailer ID information can be obtained from various sources, for example, via a PLC4Trucks power line communications, such as defined in SAE J2497. If the fleet operator wants to locate that particular trailer it can access the PLC network chip via cell or pager network, or via satellite, through recorder 200. Vehicles emitting an in-compliance signal can pass through a checkpoint or roadside inspection without further delay and those that are not in-compliance can be stopped for further investigation. Recorder 200 can be queried to generate a",
    "textAfterTable": "US4547778 Jun 9, 1981 Oct 15, 1985 Texas Instruments Incorporated Method and apparatus for automatic distress call signal transmission US4555619 May 19, 1983 Nov 26, 1985 Rockwell International Corporation Driver key car identifying system US4575803 Dec 30, 1981 Mar 11, 1986 Semco Instruments, Inc. Engine monitor and recorder US4590569 Oct 14, 1983 May 20, 1986 Navigation Sciences Inc. Navigation system including an integrated electronic chart display US4630292 Aug 13, 1984 Dec 16, 1986 Juricich Ronald A Fuel tax rebate recorder US4644351 May 8, 1984 Feb 17, 1987 Motorola, Inc. Two way personal message system with extended coverage US4651157 May 7, 1985 Mar 17, 1987 Mets, Inc. Security monitoring and tracking system US4654879 Mar 29, 1985 Mar 31, 1987 Itt Corporation Cellular mobile radio subscriber location detection US4660037 Jan 26, 1983 Apr 21, 1987 Honda Giken Kogyo Kabushiki",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}