{
    "relation": [
        [
            "Citing Patent",
            "US5622414 *",
            "US5792427 *",
            "US6117687 *",
            "US6503751",
            "US6878177",
            "US7849644 *",
            "US7926229",
            "US8413393 *",
            "US8661750",
            "US8869473 *",
            "US20100186299 *",
            "US20130312330 *",
            "WO1999001704A2 *"
        ],
        [
            "Filing date",
            "Jun 7, 1993",
            "Feb 9, 1996",
            "Apr 5, 1999",
            "Aug 14, 2001",
            "Aug 28, 2001",
            "May 16, 2006",
            "Apr 27, 2010",
            "Dec 9, 2009",
            "Jul 26, 2011",
            "Apr 19, 2011",
            "Dec 9, 2009",
            "May 23, 2012",
            "Jun 26, 1998"
        ],
        [
            "Publication date",
            "Apr 22, 1997",
            "Aug 11, 1998",
            "Sep 12, 2000",
            "Jan 7, 2003",
            "Apr 12, 2005",
            "Dec 14, 2010",
            "Apr 19, 2011",
            "Apr 9, 2013",
            "Mar 4, 2014",
            "Oct 28, 2014",
            "Jul 29, 2010",
            "Nov 28, 2013",
            "Jan 14, 1999"
        ],
        [
            "Applicant",
            "Ardco, Inc.",
            "Forma Scientific, Inc.",
            "Forma Scientific, Inc.",
            "Thermo Forma Inc.",
            "Thermo Forma, Inc.",
            "Melesky James B",
            "Melesky James B",
            "James B. Melesky",
            "James B. Melesky",
            "James B. Melesky",
            "Melesky James B",
            "Faurecia Interior Systems, Inc.",
            "Gen Electric"
        ],
        [
            "Title",
            "Refrigerator display cabinet with thermally insulated pivotable all glass front window panel",
            "Controlled atmosphere incubator",
            "Controlled atmosphere incubator",
            "Controlled atmosphere incubator",
            "Incubator having combined HEPA and VOC filter",
            "System for insulating attic openings",
            "System for insulating attic openings",
            "Insulation cover for attic closures",
            "Systems and methods for insulating attic openings",
            "System for insulating attic openings",
            "Insulation Cover for Attic Closures",
            "Sealing arrangements for doors of motor vehicles and methods of making the same",
            "Modular refreshment center for refrigerator fresh food compartment"
        ]
    ],
    "pageTitle": "Patent US5161329 - Insulated closure structure - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5161329?dq=6,757,710",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00242-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479605587,
    "recordOffset": 479589627,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It is to be understood that the above examples are by way of illustration only, and that substitutions and equivalents may be obvious to those skilled in the art. The full scope and definition of the invention therefore is to be as set forth and defined in the following claims. To install the closure assembly, a rectangular opening is cut into the wall and, if necessary, the threshold area is cut out a short amount. The threshold 40 is placed in position and permanently attached flush with the surface of the floor of the building. The inner frame member 10 is then positioned inside the unit such that the mating flange 11 is inserted into the rectangular opening. The outer frame member 20 is then positioned from the outside of the unit such that the mating lip 21 is inserted into the opening. The end of the mating flange 11 is seated into the mating lip 21 and the inner frame unit 10 and outer frame unit 20 are permanently joined by adhesive means or mechanical fasteners. Likewise, the frame members are attached to the wall 99. With the two frame members now joined and the threshold 40 in place, the rectangular opening is completely encircled by the apparatus. A total thermal barrier prevents heat transfer into the interior of the wall or into the floor area. Door member 30 is then attached to the outer",
    "textAfterTable": "US6878177 Aug 28, 2001 Apr 12, 2005 Thermo Forma, Inc. Incubator having combined HEPA and VOC filter US7849644 * May 16, 2006 Dec 14, 2010 Melesky James B System for insulating attic openings US7926229 Apr 27, 2010 Apr 19, 2011 Melesky James B System for insulating attic openings US8413393 * Dec 9, 2009 Apr 9, 2013 James B. Melesky Insulation cover for attic closures US8661750 Jul 26, 2011 Mar 4, 2014 James B. Melesky Systems and methods for insulating attic openings US8869473 * Apr 19, 2011 Oct 28, 2014 James B. Melesky System for insulating attic openings US20100186299 * Dec 9, 2009 Jul 29, 2010 Melesky James B Insulation Cover for Attic Closures US20130312330 * May 23, 2012 Nov 28, 2013 Faurecia Interior Systems, Inc. Sealing arrangements",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}