{
    "relation": [
        [
            "Citing Patent",
            "US6168460 *",
            "US6329810 *",
            "US6483289 *",
            "US6624534 *",
            "US6953890 *",
            "US6983211 *",
            "US7199572",
            "US7297021 *",
            "US7359182",
            "US7928722",
            "US8547686 *",
            "US8717007",
            "US8841563 *",
            "US8913354 *",
            "US8927861 *",
            "US20040094319 *",
            "US20040254750 *",
            "US20130048366 *",
            "US20130279049 *",
            "US20140027143 *",
            "US20140183188 *",
            "EP2626710A1 *",
            "WO1999047935A1 *",
            "WO2003012462A1 *"
        ],
        [
            "Filing date",
            "Apr 7, 1998",
            "Mar 18, 1998",
            "Jul 27, 2001",
            "Sep 7, 2001",
            "Sep 8, 2003",
            "Dec 4, 2002",
            "Mar 1, 2005",
            "Aug 31, 2006",
            "Nov 6, 2003",
            "Feb 20, 2009",
            "Nov 24, 2008",
            "Oct 13, 2009",
            "Aug 27, 2012",
            "Apr 19, 2012",
            "Dec 24, 2013",
            "Sep 8, 2003",
            "Dec 4, 2002",
            "",
            "Apr 19, 2012",
            "Jul 23, 2013",
            "Dec 24, 2013",
            "Feb 6, 2013",
            "Mar 17, 1999",
            "Jul 16, 2002"
        ],
        [
            "Publication date",
            "Jan 2, 2001",
            "Dec 11, 2001",
            "Nov 19, 2002",
            "Sep 23, 2003",
            "Oct 11, 2005",
            "Jan 3, 2006",
            "Apr 3, 2007",
            "Nov 20, 2007",
            "Apr 15, 2008",
            "Apr 19, 2011",
            "Oct 1, 2013",
            "May 6, 2014",
            "Sep 23, 2014",
            "Dec 16, 2014",
            "Jan 6, 2015",
            "May 20, 2004",
            "Dec 16, 2004",
            "Feb 28, 2013",
            "Oct 24, 2013",
            "Jan 30, 2014",
            "Jul 3, 2014",
            "Aug 14, 2013",
            "Sep 23, 1999",
            "Feb 13, 2003"
        ],
        [
            "Applicant",
            "General Electric Company",
            "Square D Company",
            "Square D Company",
            "Reliance Controls Corporation",
            "Juergen Koessler",
            "Power Measurement, Ltd.",
            "Greg May",
            "Siemens Energy & Automation, Inc.",
            "Abb Oy",
            "Square D Company",
            "Meter Devices Company, Inc.",
            "Electro Industries/Gauge Tech",
            "Ryan O'Neil",
            "Eaton Corporation",
            "Inner-Tite Corp.",
            "Juergen Koessler",
            "Macfarlene I. Ross",
            "Ryan O'Neil",
            "Andrew L. Van Fossen",
            "Michael Hunter",
            "Inner-Tite Corp.",
            "Abb Ag",
            "Square D Co",
            "Square D Co"
        ],
        [
            "Title",
            "A-base terminal block assembly",
            "Modular sensor array, metering device and mounting and connection base",
            "Modular sensor array, metering device and mounting and connection base",
            "Optional meter panel utilizing a current transformer, for use with a transfer switch",
            "Junction box",
            "Revenue meter bayonet assembly and method of attachment",
            "Method and system for improving the operational safety, reliability, and functionality of electrical power consumption monitoring devices",
            "Devices, systems, and methods for bypassing an electrical meter",
            "Plug-in unit assembly comprising instrument transformers",
            "Apparatus and method for voltage sensing in electrical metering systems",
            "Watthour meter socket with secured access high voltage section",
            "Intelligent electronic device having a terminal assembly for coupling to a meter mounting socket",
            "Split line and low voltage wire conduit and transformer box",
            "Enclosed metering and protective electrical apparatus including an external disconnect handle",
            "Meter box cover",
            "Junction box",
            "Revenue meter bayonet assembly and method of attachment",
            "Split Line and Low Voltage Wire Conduit and Transformer Box",
            "Enclosed metering and protective electrical apparatus including an external disconnect handle",
            "Electrical Box Insert Device",
            "Meter box cover",
            "Meter support housing for a meter cabinet",
            "Modular sensor array, metering device, mounting and connection base",
            "Modular sensor array, metering device and mounting and connection base"
        ]
    ],
    "pageTitle": "Patent US5834932 - Watthour meter system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5834932?dq=5,987,610",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00342-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 487658339,
    "recordOffset": 487623917,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38893=Those skilled in the art have already recognized the long-felt need to consolidate the number of required ANSI forms for watthour meter applications. For instance, in 1992, ABB Power T & D Co., Inc. (ABB) designed its Alpha™ meter which was the first commercially available wide voltage range solid state watthour meter. The Alpha™ meter permitted the use of the same basic watthour meter for several different watthour meter applications. In particular, the Alpha™ meter was capable of measuring the energy consumed by power systems having voltages varying from 120 Vrms to 480 Vrms.}",
    "textBeforeTable": "Patent Citations It will thus be seen the present invention provides a new and improved watthour meter system having a number of advantages and characteristics, including those pointed out herein and others which are inherent in the invention. Several preferred embodiments having been described by way of illustration, it is anticipated that modifications to the described forms of product will occur to those skilled in the art and that such modification and changes may be made without departing from the spirit of the invention or the scope of the appended claims. Outside of these modifications for this alternative embodiment of the present invention, the energy measuring system shown in FIGS. 2 and 4 is structurally and functionally similar to the energy measuring system shown in FIGS. 1 and 3. Referring again to FIGS. 2 and 4, the jumper 109a is shown having nodes that are electrically connected in an identical manner to that described with reference to FIGS. 1 and 3. The jumper 109a will typically be used in the electrical energy consumption measuring system 10a when that system is already connected to the secondary windings of voltage transformers external to meter box 12a rather than directly connected to the service voltage of the power lines, although those skilled in the art will appreciate that this need not be the case. On the other hand, the plug 106a and the plug 108a may be connected to each other",
    "textAfterTable": "US8547686 * Nov 24, 2008 Oct 1, 2013 Meter Devices Company, Inc. Watthour meter socket with secured access high voltage section US8717007 Oct 13, 2009 May 6, 2014 Electro Industries/Gauge Tech Intelligent electronic device having a terminal assembly for coupling to a meter mounting socket US8841563 * Aug 27, 2012 Sep 23, 2014 Ryan O'Neil Split line and low voltage wire conduit and transformer box US8913354 * Apr 19, 2012 Dec 16, 2014 Eaton Corporation Enclosed metering and protective electrical apparatus including an external disconnect handle US8927861 * Dec 24, 2013 Jan 6, 2015 Inner-Tite Corp. Meter box cover US20040094319 * Sep 8, 2003 May 20, 2004 Juergen Koessler Junction box US20040254750 * Dec 4, 2002 Dec 16, 2004 Macfarlene I. Ross Revenue meter bayonet assembly and method of attachment US20130048366",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}