{
    "relation": [
        [
            "Citing Patent",
            "US5728411 *",
            "US5938580 *",
            "US6126429 *",
            "US6416451",
            "EP0755324A1 *"
        ],
        [
            "Filing date",
            "Nov 20, 1995",
            "Apr 14, 1995",
            "Jun 2, 1998",
            "Dec 21, 1998",
            "Apr 14, 1995"
        ],
        [
            "Publication date",
            "Mar 17, 1998",
            "Aug 17, 1999",
            "Oct 3, 2000",
            "Jul 9, 2002",
            "Jan 29, 1997"
        ],
        [
            "Applicant",
            "Exact Mixing Systems, Inc.",
            "Ranpak Corp.",
            "Burger Engineering, Inc.",
            "Ranpak Corp.",
            "Ranpak Corporation"
        ],
        [
            "Title",
            "Mixing system for dispensing measured volumes of kneadable material",
            "Cushioning conversion machine with restricted access to a cutting assembly",
            "Combination slide retainer and position sensing switch for injection molds",
            "Output chute for cushioning conversion machine",
            "A cushion producing machine"
        ]
    ],
    "pageTitle": "Patent US4536144 - Reversing mechanism for safety gate of injection molding machine - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4536144?dq=5,838,906",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989178.64/warc/CC-MAIN-20150728002309-00334-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 490665187,
    "recordOffset": 490647002,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations It should be understood, of course, that the foregoing disclosure describes only a preferred embodiment of the invention and that it is intended to cover all changes and modifications of this example of the invention which fall within the scope of the appended claims. The leading edge of the safety gate 10 and its pivot corner 10c are reinforced by means of a vertical angle 27 which is engaged against the inner sides of the main panel 10b and of the vertical side flange 10a, as can be seen in FIGS. 3 and 4. The leg portions 27a and 27b of the angle 27 are much heavier than the sheet metal gauge of the deep-drawn safety gate frame. The transverse leg portion 27b of the angle 27 is set back from the inner vertical edge of the safety gate side flange 10a, but reaches to the level of the pivot loop 17a of the actuating lever 17, thereby securing the latter on the pivot noses 28. The position of the actuating lever 17 is additionally secured by the fact that its inclined leg portion 17d reaches into contact, or near-contact, with the side flange 10a. The small angle α with which the trigger edge 12e of the contact bar 12 attacks the inclined leg portion 17d of the actuating lever 17 assures a smooth and rebound-free driving engagement between the two parts. Additionally, the knee-shaped second",
    "textAfterTable": "Filing date Publication date Applicant Title US5728411 * Nov 20, 1995 Mar 17, 1998 Exact Mixing Systems, Inc. Mixing system for dispensing measured volumes of kneadable material US5938580 * Apr 14, 1995 Aug 17, 1999 Ranpak Corp. Cushioning conversion machine with restricted access to a cutting assembly US6126429 * Jun 2, 1998 Oct 3, 2000 Burger Engineering, Inc. Combination slide retainer and position sensing switch for injection molds US6416451 Dec 21, 1998 Jul 9, 2002 Ranpak Corp. Output chute for cushioning conversion machine EP0755324A1 * Apr 14, 1995 Jan 29, 1997 Ranpak Corporation A cushion producing machine * Cited by examiner Classifications U.S. Classification 425/154, 425/136 International Classification B29C45/84, F16P3/10, E05F15/00,",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}