{
    "relation": [
        [
            "Citing Patent",
            "US5919157 *",
            "US6039715 *",
            "US6258053",
            "US6302873",
            "US6695815",
            "US6783513",
            "US7063680 *",
            "US7066923 *",
            "US7094229 *",
            "US7373850",
            "US7588553 *",
            "US7704244 *",
            "US8050752 *",
            "US8246631",
            "US8267891",
            "US8535332",
            "US8579929",
            "US8784361",
            "US8852091",
            "US20040089080 *",
            "US20040111052 *",
            "US20040167473 *",
            "US20120157934 *",
            "DE102011107676A1 *",
            "WO1999055260A1 *",
            "WO1999058179A1 *",
            "WO2000074615A2 *",
            "WO2006029181A2 *"
        ],
        [
            "Filing date",
            "Apr 28, 1998",
            "May 11, 1998",
            "Jan 24, 2000",
            "Feb 23, 2000",
            "Aug 21, 2001",
            "May 29, 2002",
            "Sep 21, 2005",
            "Sep 9, 2004",
            "Dec 14, 2004",
            "Nov 8, 2002",
            "Sep 6, 2005",
            "Oct 27, 2005",
            "Sep 29, 2006",
            "Nov 30, 2004",
            "Dec 18, 2008",
            "Jul 24, 2012",
            "Sep 3, 2010",
            "Dec 7, 2010",
            "Apr 4, 2012",
            "Nov 8, 2002",
            "Dec 3, 2003",
            "Feb 25, 2004",
            "Dec 5, 2011",
            "Jul 13, 2011",
            "Apr 27, 1999",
            "Mar 25, 1999",
            "Jun 1, 2000",
            "Sep 7, 2005"
        ],
        [
            "Publication date",
            "Jul 6, 1999",
            "Mar 21, 2000",
            "Jul 10, 2001",
            "Oct 16, 2001",
            "Feb 24, 2004",
            "Aug 31, 2004",
            "Jun 20, 2006",
            "Jun 27, 2006",
            "Aug 22, 2006",
            "May 20, 2008",
            "Sep 15, 2009",
            "Apr 27, 2010",
            "Nov 1, 2011",
            "Aug 21, 2012",
            "Sep 18, 2012",
            "Sep 17, 2013",
            "Nov 12, 2013",
            "Jul 22, 2014",
            "Oct 7, 2014",
            "May 13, 2004",
            "Jun 10, 2004",
            "Aug 26, 2004",
            "Jun 21, 2012",
            "Jan 17, 2013",
            "Nov 4, 1999",
            "Nov 18, 1999",
            "Dec 14, 2000",
            "Mar 16, 2006"
        ],
        [
            "Applicant",
            "Strukel; Igor",
            "Mackool; Richard J.",
            "Alcon Universal, Ltd.",
            "Stephen P. Moenning",
            "Stephen P. Moenning",
            "Stephen P. Moenning",
            "Alcon, Inc.",
            "Alcon, Inc.",
            "Alcon, Inc.",
            "Advanced Medical Optics, Inc.",
            "Dewey Steven H",
            "Alcon, Inc.",
            "Bacoustics, Llc",
            "Bausch & Lomb Incorporated",
            "Alcon Research, Ltd.",
            "Bausch & Lomb Incorporated",
            "Alcon Research, Ltd.",
            "Alcon Research, Ltd.",
            "Alcon Research, Ltd.",
            "Advanced Medical Optics, Inc.",
            "Moenning Stephen P.",
            "Moenning Stephen P.",
            "Grace Chuang Liao",
            "Geuder Ag",
            "Vidda Inc",
            "Mackool Richard J",
            "Alcon Universal Ltd",
            "Dewey Steven H"
        ],
        [
            "Title",
            "Shaped flexible infusion sleeve",
            "Angulated phacoemulsification needle whose outer surface converges and inner channel narrows",
            "Phacoemulsification instrument having a gap between a needle and a sleeve of the instrument that is at least the same size as an inside area of an infusion line",
            "Minimally invasive medical apparatus for dispensing a biologically active compound and an associated medical procedure for dispensing a biologically active compound",
            "Minimally invasive medical apparatus for dispensing a biologically active compound and an associated medical procedure for dispensing a biologically active compound",
            "Body cavity access assembly and an associated medical procedure for dispensing a liquid",
            "Surgical apparatus",
            "Surgical method and apparatus using dual irrigation paths",
            "Surgical method and apparatus",
            "Test chamber for bi-manual lens extraction",
            "Phacoemulsification device having rounded edges",
            "Surgical method",
            "Method of treating lumens, cavities, and tissues of the body with an ultrasound delivered liquid",
            "Two stage plunger for intraocular lens injector",
            "Gilled phacoemulsification irrigation sleeve",
            "Two stage plunger for intraocular lens injector",
            "Torsional ultrasound hand piece that eliminates chatter",
            "Combined coaxial and bimanual irrigation/aspiration apparatus",
            "Devices, systems, and methods for pupil expansion",
            "Test chamber for bi-manual lens extraction",
            "Minimally invasive medical apparatus for dispensing a biologically active compound and an associated medical procedure for dispensing a biologically active compound",
            "Trocar-cannula complex, cannula and method for delivering fluids during minimally invasive surgery",
            "Infusion Sleeve with Multiple Material Layers",
            "Medizinisches Werkzeug und Verfahren zur Herstellung eines medizinischen Werkzeugs",
            "Shaped flexible infusion sleeve",
            "Angulated phacoemulsification needle whose outer surface converges and inner channel narrows",
            "Phaco-emulsification needle",
            "Phacoemulsification device having rounded edges"
        ]
    ],
    "pageTitle": "Patent US5830192 - Irrigation sleeve for phacoemulsification apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5830192?ie=ISO-8859-1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988250.59/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 461764207,
    "recordOffset": 461745418,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{49948=Maneuverability of cutting tip 136 may be further improved by the inclusion of means for allowing a predetermined amount of relative movement, or \"play\", between extending portion 114 and the rest of irrigation sleeve 110. For example, as shown in FIG. 14, the soft and resilient material of base portion 1012 and intermediate portion 1022 may be configured to elastically deform to create an angle, ∝', between the longitudinal axis of the cutting tip 1036 and the normally collinear longitudinal axis of the extending portion 1014. Further, intermediate portion 1022 may be configured to elastically deform to create a change in distance, d, between the distal end 1037 of the cutting tip 1036 and the distal end 1032 of the irrigation sleeve 1010., 50728=Further, the irrigation sleeve 1010 shown in FIG. 14 may be configured as part of a kit. During use of the kit in surgery, the surgeon chooses various combination of kit components to be connected in order to achieve desired characteristics of irrigation sleeve 1010. For example, a kit including a base portion 1012 with an integral intermediate portion 1022 may include separate extending portions 1014 of various diameters and lengths. After selecting desired components, the surgeon connects extending portion 1014 to base portion 1012 by placing the distal end of extending portion 1014 at the proximal end 1028 of passageway 1016. Extending portion 1014 is then pushed through base portion 1012 until the flange 1064 at the proximal end of the extending portion 1014 engages channel 1062 in intermediate portion 1022.}",
    "textBeforeTable": "Patent Citations Further, the irrigation sleeve 1010 shown in FIG. 14 may be configured as part of a kit. During use of the kit in surgery, the surgeon chooses various combination of kit components to be connected in order to achieve desired characteristics of irrigation sleeve 1010. For example, a kit including a base portion 1012 with an integral intermediate portion 1022 may include separate extending portions 1014 of various diameters and lengths. After selecting desired components, the surgeon connects extending portion 1014 to base portion 1012 by placing the distal end of extending portion 1014 at the proximal end 1028 of passageway 1016. Extending portion 1014 is then pushed through base portion 1012 until the flange 1064 at the proximal end of the extending portion 1014 engages channel 1062 in intermediate portion 1022. Maneuverability of cutting tip 136 may be further improved by the inclusion of means for allowing a predetermined amount of relative movement, or \"play\", between extending portion 114 and the rest of irrigation sleeve 110. For example, as shown in FIG. 14, the soft and resilient material of base portion 1012 and intermediate portion 1022 may be configured to elastically deform to create an angle, ∝', between the longitudinal axis of the cutting tip 1036 and the normally collinear longitudinal axis of the extending portion 1014. Further, intermediate portion 1022 may be configured to elastically deform to create a change in distance, d, between",
    "textAfterTable": "US8246631 Nov 30, 2004 Aug 21, 2012 Bausch & Lomb Incorporated Two stage plunger for intraocular lens injector US8267891 Dec 18, 2008 Sep 18, 2012 Alcon Research, Ltd. Gilled phacoemulsification irrigation sleeve US8535332 Jul 24, 2012 Sep 17, 2013 Bausch & Lomb Incorporated Two stage plunger for intraocular lens injector US8579929 Sep 3, 2010 Nov 12, 2013 Alcon Research, Ltd. Torsional ultrasound hand piece that eliminates chatter US8784361 Dec 7, 2010 Jul 22, 2014 Alcon Research, Ltd. Combined coaxial and bimanual irrigation/aspiration apparatus US8852091 Apr 4, 2012 Oct 7, 2014 Alcon Research, Ltd. Devices, systems, and methods for pupil expansion US20040089080 * Nov 8, 2002 May 13, 2004 Advanced Medical Optics, Inc. Test chamber for bi-manual lens extraction US20040111052 * Dec 3, 2003 Jun 10, 2004 Moenning Stephen P. Minimally invasive medical apparatus for dispensing a biologically active compound",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}