{
    "relation": [
        [
            "Date",
            "May 9, 1994",
            "Nov 12, 1998",
            "Dec 21, 1998",
            "Dec 11, 2002",
            "May 23, 2003",
            "Jul 22, 2003"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "AS",
            "REMI",
            "LAPS",
            "FP"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Assignment",
            "Maintenance fee reminder mailed",
            "Lapse for failure to pay maintenance fees",
            "Expired due to failure to pay maintenance fee"
        ],
        [
            "Description",
            "Owner name: METROPOLITAN COMMUNICATION AUTHORITY, INC., WASHIN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SASS, RICHARD G.;GREULICH, RICHARD A.;CARLSON, F. PAUL;REEL/FRAME:006995/0990;SIGNING DATES FROM 19940426 TO 19940505",
            "Year of fee payment: 4",
            "Owner name: METROPOLITAN COMMUNICATIONS CONSULTANTS, L.L.C., W Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:METROPOLITAN COMMUNICATION AUTHORITY, INC.;REEL/FRAME:009648/0414 Effective date: 19981210",
            "",
            "",
            "Effective date: 20030523"
        ]
    ],
    "pageTitle": "Patent US5418878 - Multi-mode communications cable having a coaxial cable with twisted ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5418878?dq=6,272,646",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988317.67/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480810363,
    "recordOffset": 480791126,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The terms and expressions which have been employed in the foregoing specification are used therein as terms of description and not of limitation, and there is no intention, in the use of such terms and expressions, of excluding equivalents of the features shown and described or portions thereof, it being recognized that the scope of the invention is defined and limited only by the claims which follow. In FIG. 4 is shown another preferred embodiment of a cable 10\" of the present invention. The cable 10\" includes the coaxial cable 12, five 26 AWG twisted pairs 14 and the 22 AWG twisted pair 16. The cable 10\" also includes a plurality of fibers arranged in an alternating pattern having one row located contiguous with the periphery of the coaxial cable 12 and a second row, interlaced between the first row, contiguous with the inner periphery of the water blocking tape 20. As shown in FIG. 4, there are 16 optical fibers 18. But it is to be understood that there could be a greater or fewer number of optical fibers 18 in the cable 10\". FIG. 3 shows another preferred embodiment of a cable 10' of the present invention. The cable 10' has the centrally located coaxial cable 12 and a plurality of twisted pairs comprising five 26 AWG twisted pairs 14 and a single 22 AWG twisted pair 16. The composition of the twisted pairs",
    "textAfterTable": "US4695127 * Mar 27, 1985 Sep 22, 1987 Cooper Industries, Inc. Hybrid coaxial-optical cable and method of use US4761519 * Jan 29, 1987 Aug 2, 1988 Precision Interconnect Corporation Highly flexible, shielded, multi-conductor electrical cable US4832443 * Mar 28, 1988 May 23, 1989 Bp Chemicals Limited Fibre optic cable having a layer of a polyethylene composition and process of making same US4856867 * Sep 10, 1984 Aug 15, 1989 Gaylin Wayne L Carrier cable, fiber optic cable, and sheath support assembly US4861945 * Dec 9, 1988 Aug 29, 1989 Precision Interconnect Corporation Yieldably extensible self-retracting shielded cable US5042904 * Jul 18, 1990 Aug 27, 1991 Comm/Scope, Inc. Communications cable and method having a talk path in an enhanced cable jacket US5237635 * Jul 15, 1992 Aug 17, 1993 W. L. Gore & Associates, Inc.",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}