{
    "relation": [
        [
            "Code or Value",
            "1",
            "2",
            "3",
            "4",
            "."
        ],
        [
            "Value Description",
            "HH full food security: 0",
            "HH marginal food security: 1-2",
            "HH low food security: 3-5 (HH w/o child) / 3-7 (HH w/ child)",
            "HH very low food security: 6-10 (HH w/o child) / 8-18 (HH w/ child)",
            "Missing"
        ],
        [
            "Count",
            "6927",
            "1148",
            "1354",
            "634",
            "86"
        ],
        [
            "Cumulative",
            "6927",
            "8075",
            "9429",
            "10063",
            "10149"
        ],
        [
            "Skip to Item",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "NHANES 2007 - 2008: Food Security Data Documentation, Codebook, and Frequencies",
    "title": "",
    "url": "http://www.cdc.gov/nchs/nhanes/limited_access/FSQ_E_R.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 18,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00088-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 359104051,
    "recordOffset": 359076589,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6736=NHANES has assessed household food security with the US Food Security Survey Module (US FSSM) since 1999. Individual-level food security items for adults and children were implemented in the survey in 2000, and added for adolescents in 2005. Similar modules have been used in various surveys, including the the Census Bureau's Current Population Survey (CPS) and a growing number of State, local, and regional studies such as the California Health Interview Survey (CHIS). For more information on food security measurement, please refer to the USDA’s website at: http://www.ers.usda.gov/Briefing/FoodSecurity., 6054=The NHANES household interview included two questionnaires: a sample person questionnaire to collect information regarding each individual survey participant’s personal health status, and a family questionnaire to collect information at the family level, such as total income for the family, food availibility in the family, etc. The sample person questionnaire was answered by participants themselves (adult proxy for child under 16 years old). The family questionnaire required an adult family member, preferably the head of the family, to respond to these questions for the entire family. The information on household food security status and Food Stamp program benefits in the FSQ section were collected as part of this family questionnaire. In 2007-2008, 77 participants have missing values to all of these items in the FSQ section because the family questionnaire was not administered. Most common reasons for missing the family questionnaire interview were no eligible adult respondent in the family available or refusal., 3300=WIC benefit information was collected for female participants 12 to 59 years of age in 2007-2008. This file contains all data for females 12 years and older, whereas the publicly released data set (FSQ_E) has limited information for females 12-19 years of age due to possible disclosure risks., 17993=3. Food Stamp program benefits The questions related to Food Stamp program benefits were re-designed for the 2007-2008 data collection. In this cycle, we no longer collected information at the individual level. All Food Stamp benefits questions were collected at the household level. One adult responded to these questions for the entire household during the household interview. Information collected included whether anyone in the household had ever received Food Stamp benefits; whether anyone in the household received benefits in the last 12 months; time since last received benefits within last 12 months; and the amount of benefits the household received last time., 7184=FSD660ZW (Women currently received WIC benefit) This question only asked of female participants who received WIC benefits in the last 12 months, and were pregnant or 0-12 months postpartum at the time of interview. The postpartum screening criterion for this question is a new addition in 2007-2008. It helps to better classify eligibility for WIC benefit., 21492=Title: Food Security (FSQ_E_R ) Contact Number: 1-866-441-NCHS Years of Content: 2007 - 2008 First Published: July, 2010 Revised: NA Access Constraints: RDC Only Use Constraints: RDC Only Geographic Coverage: National Subject:The food security section provides data on household and individual level food security, food stamp benefits, and participation in the WIC program Record Source: NHANES 2007 - 2008 Survey Methodology: NHANES 2007 - 2008 is a stratified multistage probability sample of the civilian non-institutionalized population of the U.S. Medium: NHANES Web site; SAS transport files, 16625=For children participants’ WIC benefits, we collected information on current participation, participation in the last 12 month, and total length (in months) of benefits received. Similar to previous cycles, current participation and participation in the last 12 months were ascertained for children 0-5 years of age. In 2007-2008, the target age group for the benefit length question was extended from children 0-5 years of age to 0-11 years old. Also new in this cycle, additional information was obtained on WIC participation during various important periods in early childhood, including prenatal, infancy, and 1-4 years of age. These data were collected through adult proxy during the household interview as part of the Dietary Behavior and Nutrition questionnaire (DBQ) and released on the individual participant’s record., 9828=No food security categories are assigned if all or most of these items were answered as \"don't know\" or \"refusal\". There are 9 such records in the 2007-2008 dataset, two of them from households with children. These records contain missing values for FSDHH, FSDAD, and FSDCH., 18916=Participants 16 years and older were asked 6 questions about their own food security. Participants under 16 years old were asked 5 questions; the question about having lost weight was not asked of this age group. Most NHANES survey questions that assess a specific aspect of food security are identical or very similar for adults, teens, and children. Similar to the 2005-2006 cycle, data collected separately for different age groups are combined and released as one variable for each topic, although the actual survey instruments may be slightly different by participants’ ages. The exact wording of the FSQ questionnaires used in the survey can be found at the NHANES website at: http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/questexam07_08.htm., 4171=In 2007-2008, a new sample design was implemented to the survey. All Hispanics were oversampled, not just Mexican Americans. In addition, for each of the race/ethnicity domains, the 12-15 and 16-19 year age domains were combined and the 40-59 year age minority domains were split into 10 year age domains 40-49 and 50-59. This has led to an increase in the number of participants aged 40+ and a decrease in 12-19 year olds from previous cycles. Lastly, pregnant women were no longer oversampled. Based on these changes, unweighted frequencies of certain variables may differ slightly in this survey cycle compared to earlier survey cycles. For further discussion, please see the Analytic Notes for the Demographic data file: http://www.cdc.gov/nchs/nhanes/nhanes2007-2008/DEMO_E.htm}",
    "lastModified": "Tue, 25 Jun 2013 12:25:42 GMT",
    "textBeforeTable": "Both males and females 0 YEARS - 150 YEARS Target: Collected at household level. English Instructions: Now I am going to read you several statements that people have made about their food situation. For these statements, please tell me whether the statement was often true, sometimes true, or never true for {you/your household} in the last 12 months, that is since last {DISPLAY CURRENT MONTH}. The first statement is . . . {I/we} worried whether {my/our} food would run out before {I/we} got money to buy more. English Text: HH Worried run out of food SAS Label: FSD032A Variable Name: FSD032A - HH Worried run out of food Both males and females 0 YEARS - 150 YEARS Target: Respondent sequence number. English Text: Respondent sequence number SAS Label: SEQN Variable Name: SEQN - Respondent sequence number Codebook and Frequencies Bickel G, Nord M, Price C, Hamilton W, Cook J. Guide to Measuring Household Food Security Revised 2000.  U.S. Department of Agriculture, Food and Nutrition Service, Alexandria VA. March, 2000. http://www.fns.usda.gov/fsec/FILES/FSGuide.pdf [Accessed on: accessed 5/06/10] References   FSQ data were collected in the household",
    "textAfterTable": ". Missing 77 10149 FSD032B - HH Food didn't last Variable Name: FSD032B SAS Label: HH Food didn't last English Text: [The next statement is . . .] The food that {I/we} bought just didn't last, and {I/we} didn't have money to get more. English Instructions: Collected at household level. Target: Both males and females 0 YEARS - 150 YEARS Code or Value Value Description Count Cumulative Skip to Item 1 Often true 620 620 2 Sometimes true 1665 2285 3 Never true 7779 10064 7 Refused 6 10070 9 Don't know 2 10072 . Missing 77 10149 FSD032C - HH Couldn't afford balanced meals Variable Name: FSD032C SAS Label: HH Couldn't afford balanced meals",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}