{
    "relation": [
        [
            "Team",
            "16. Notts County",
            "17. Oxford",
            "18. Plymouth",
            "19. Portsmouth",
            "20. Stevenage",
            "21. Wimbledon",
            "22. Wycombe"
        ],
        [
            "P",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "W",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "D",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "L",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "GD",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Pts",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Portsmouth - Summer Toast # 5 - Save Dave?",
    "title": "",
    "url": "http://www.portsmouth.vitalfootball.co.uk/article.asp?a=160006",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 650810031,
    "recordOffset": 650787561,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{13929=Evans likely but Robinson moves on (Monday July 27 2015), 13730=ST sales continue VERY nicely! (Monday July 27 2015), 24735=Date:Sunday July 5 2009, 13339=On this day in history...26th July (Sunday July 26 2015), 13139=Poke out Murphy in? (Saturday July 25 2015), 38241=There will be no Toast next Sunday as we are all off to Hermann`s birthday party and are busy preparing for that event. So today a bumper issue. Rob Styles quits Came as a bit of a surprise this week when Waterlooville Premier League referee Rob Styles handed in his notice. Rob was in charge of the 2005 FA Cup final between Manchester United and Arsenal and spent nine years refereeing in the top flight. He claimed he had lost the buzz at the age of 45 and felt he would leave before he was shown the door. Pompey fans of course do not get the chance to see Rob in action as we are his local club but judging from some his decisions in the last few seasons fans of other clubs might be saying - buzz off!! Toast inside information - 'he's got a nice house'. Hawkeye The Hawkeye system in use at Wimbledon still continues to impress all those who have seen it. It is accurate and very fast. Surely it must come to football soon? Some of you out there are cricket fans and won`t need telling that the Ashes start on Wednesday, Hawkeye will play a major part in the TV coverage but we are unable to discover whether the third umpire will be allowed the technology to make decisions Toast inside information - 'Hawkeye was first used at Lord's, 'the Home of Cricket' in 2001' and is the invention of a company in Romsey. DD DD just keeps on rolling along and we believe no news is good news - ever the optimist. We are told that the DD at Citeh took over six weeks. Then we have to wait for the Premier League fit and proper person test which now takes longer. Anyone got any nails left? Matt Ritchie - star of the future? Well we were planning a piece on the Gosport boy and will he have a chance to breaking into 1st team? Well another planned article ends on in the recycle bin after Rug beat us to it. Read it here Season 1961/62 As you all know Toast boss eastneydave has almost completed fifty years supporting Pompey. What we have decided to do is look back at some of the memorable seasons in that era and have started with the 1961/62 season which saw Pompey back in the third division for the first time in nearly forty years. reddie Cox had been sacked the previous February and replaced by George Smith. He was one of the best coaches around and was famous for his strict military style discipline. The season started well with a 3-1 win at the County Ground over Swindon Town and Pompey were to go on a twelve match unbeaten start to the season. Seven wins and five draws put Pompey top of the table, a position they were to hold for most of the season. Defeat number one came at Notts County by 2-1 and the next two away games at Brentford and Grimsby were also lost by odd goals. The Grimsby game then kicked started a run of nineteen games through December to March with only one defeat. That defeat came in a crucial game at Bournemouth who were mounting a challenge to Pompey. An incredible 23,000 packed Dean Court to the rafters as the Cherries triumphed 2-0. It was the last eight games that created the problems. After defeat at Bradford Park Avenue - yes there were two Bradford clubs in those days - the unbeaten home record was lost. Home game twenty one saw Grimsby Town come to Fratton and triumph 2-0 and complete the double. They were now challenging Bournemouth hard for second place but Pompey were faltering too. One point from the next three games followed including the infamous 3-0 home defeat to Peterborough. Pompey needed a win to clinch promotion and goalkeeper Dick Beattie had a nightmare in front of over 20,000 fans. He was never to play for Pompey again with rumours of match fixing flying around. Easter Monday saw another home game with Watford and this time Pompey scraped to a nervy 2-1 win thanks to goals from Ron Saunders and Bobby Campbell. The party began but what a twitchy finish to what should have been a majestic season. The final table saw Pompey with 65 points and Grimsby with 62, Bournemouth just missed out with 59. Ed`s note - only 2pts for a win then. * Only ever present was Jimmy Dickinson who was nearly 37. * Top scorer - Ron Saunders 26 * Average home attendance 16,122. The cup competitions saw little success. In the League Cup Pompey progressed to the second round with a win over Barrow at Holker Street by 2-0 with goals from Harry Middleton and Sammy Chapman. The second round draw pitted Pompey with Derby County at Fratton Park. The game finished 1-1, Johnny Gordon scoring the goal. The replay at the Baseball Ground was to be a different occasion as Pompey ran out 4-2 winners with Harry Middleton scoring all four goals! He became the first Pompey player to score a hat-trick in the League Cup and the only player to score four. The run ended with a 1-0 defeat at Sheffield United. The FA Cup run lasted just 90 minutes. Drawn at Crystal Palace, Pompey should have fancied their chances especially after winning the league game at Selhurst Park a few weeks earlier. The biggest crowd to watch Pompey that season, over 30,000, witnessed probably their worst display as they crashed out 3-0. Just to concentrate on the league eh? Toast oddity - Cliff Portwood, Grimsby's top scorer that season would join Pompey two years later. So Pompey were back in the Second Division where they would spend an eternity (well fourteen seasons to be exact). George Smith did a commendable job of keeping the club at that level until becoming General Manager in 1970. In the process he took Pompey down to a one team club, explaining that there were only fish in the sea around Portsmouth. That era also reminds me of a joke that did the rounds in the mid 60s. It was approaching Christmas and Pompey had a home game. As kick off time neared only John Milkins and Albert McCann had arrived. Manager George Smith told them to do their best and sent the two out to play. Albie had a great first half with his step over trick working well and in goal Milkins pulled off one save after another. At half-time they led 9-0!! In the interval Albie turned to Milkins and said 'I have to buy the wife a Christmas present will it be OK if I slope off now? You can cope easily'. Milkins agreed. Later that evening Albie runs into Milkins and asks 'how did you do then?' 'We lost 10-9' he replies. A gobsmacked McCann asked 'How did that happen?' Milkins replied 'The rest of the team turned up!!' Got any better Pompey jokes? Let me have them please, I can't live off that one forever. The next episode in this series looks at the only serious attempt Pompey made at getting out of Division Two in the right direction - 1967/68. Birthdays Remember to click on the player`s name to link to the Pompeyrama stats 6th July Alan Rogers is 55. Ever popular winger who danced down the left wing against many an opponent including England right back Phil Neil at Anfield in 1980. 8th July Tommy Youlden is 60. ex Arsenal left back who signed in 1968. Big strong defender who played just shy of 100 games and then went north to Aldershot. Tommy told Pompey fans recently Dave Sexton, one of my coaches at Arsenal, and who is rated as one of Britain`s best of all-time, has gone on record as saying he gained most of his knowledge from George Smith. Mike Barnard is 76. Mike also played cricket for Hampshire from 1952 to 1966. he was a member of the team that won the County Championship for the first time in 1961. Later went on to have a career in radio reporting on football and cricket. 9th July Stan Earl is 80. Right back who played a handful of games between 1950 and 1952. 10th July Lee Mills is 39. Striker who scored goals wherever he went except Fratton Park. The comments below will no doubt tell the story better than me. Probably more popular at Port Vale where in 1996 he scored a last minute equaliser against local rivals Stoke City. Billy Wilson is 63. Blond left back who came from Blackburn in 1972. Played the bad days as Pompey slipped down the leagues but was still popular with the fans. Packed a mean left foot shot and managed five goals for the club. 11th July Hermann is 35. A full biography is being prepared for next week and will appear on the site in due course. Save Dave? Fascinated when a leaflet dropped through the door this week with huge print saying SAVE DAVE - GOING FROM A DRINK TO A DRUNK!! Was this personally aimed at me I thought? I then discover it is a campaign to get you to help people you know drinking to excess and is run by the Safer Portsmouth Partnership and is worthy of your support - for more information click here The campaign claims 'there are approximately 8,000 'Daves' in Portsmouth who are drinking at levels which will damage their health. Are you one of them?` I agree but why pick on me? That`s it for this week see some of you at Hermann`s birthday party. Now I`m off down the pub!! Before I go though the answer to last week's teaser is Colchester United - well done NorfolknBlue for getting it right. No teaser for a few weeks as you are all about to be quizzed out!! The quizzes start tonight!! PUP, 14897=Foggy at Fratton (Wednesday July 29 2015), 14121=Sam Magri...Remember him? (Tuesday July 28 2015), 24694=Time: 5:00AM, 13534=Pompey assessment - Woking (a) (Sunday July 26 2015), 14712=Ertl reflects on PFC stay (Wednesday July 29 2015), 14519=PFC signing - Evans is a done deal! (Tuesday July 28 2015), 14317=No-one's PFC position is safe! (Tuesday July 28 2015)}",
    "textBeforeTable": "League Results (view all) 9 JASON R 10. 10 russellm 9. 12 Jimsmithswig 8. 13 Pompeytim 7. 19 eastneydave 6. 21 FrattonBlue 5. 22 mslorna48 4. 28 bhhardinge 3. 40 Et_tu_Pompeii 2. 148 pompeyrug 1. Vital Members League (view all) //--> document.write(''); } window.adgroupid = Math.round(Math.random() * 1000); if (window.adgroupid == undefined) {",
    "textAfterTable": "0 22. Wycombe 0 0 0 0 0 0 Portsmouth Fixtures (view all) Dagenham & Redbridge (H) Aug 8 2015 3:00PM Sky Bet League Two Derby County (H) Aug 12 2015 7:45PM Capital One Cup Plymouth Argyle (a) Aug 15 2015 3:00PM Sky Bet League Two Crawley Town (a) Aug 18 2015 7:45PM Sky Bet League Two Morecambe (H) Aug 22 2015 3:00PM Sky Bet League Two Luton Town (a) Aug 29 2015 3:00PM Sky Bet League Two See all fixtures Report fixture change ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}