{
    "relation": [
        [
            "SPELL NAME",
            "Rejuvenation",
            "Nourish",
            "Swiftmend",
            "Regrowth",
            "Nature’s Cure",
            "Healing Touch",
            "Nature’s Swiftness"
        ],
        [
            "MANA COST",
            "16%",
            "10.2%",
            "8.5%",
            "29.7%",
            "15.8%",
            "28.9%",
            "0%"
        ],
        [
            "CAST TIME",
            "0 sec",
            "2.5 sec",
            "0 sec",
            "1.5 sec",
            "0 sec",
            "2.5 sec",
            "0 sec"
        ],
        [
            "DIRECT HEAL",
            "210",
            "329 (395)",
            "691",
            "514",
            "0",
            "996",
            "0"
        ],
        [
            "HoT HEAL",
            "840",
            "0",
            "4,837 x3",
            "2,361",
            "0",
            "0",
            "0"
        ],
        [
            "COOLDOWN",
            "0 sec",
            "0 sec",
            "15 sec",
            "0 sec",
            "8 sec",
            "0 sec",
            "60 sec"
        ]
    ],
    "pageTitle": "Druid Leveling: Restoration 1-30 | Psynister's Notebook",
    "title": "",
    "url": "https://psynister.wordpress.com/2012/11/27/druid-leveling-restoration-1-30/?like=1&source=post_flair&_wpnonce=309c070579",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00238-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 874910315,
    "recordOffset": 874880553,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48468=May 1, 2014 at 4:30 AM, 46460=Posted by Psynister on November 27, 2012 in Caster, Druid, Guide, World of Warcraft, 50555=May 1, 2014 at 8:25 AM}",
    "textBeforeTable": "Healing versus Mana For the most part, you aren’t going to have to worry about mana at all while you’re leveling unless you’re weaving heals and damage spells constantly for a lengthy amount of time. But, if you’re going to be effective at healing when you’re max level, then you should still be aware of what these spells cost you in relation to how much healing you’re getting out of them in return. Healing amounts listed are averaged in the case of spells which have a healing range. Restoration Healing Druids are unique healers because they focus on healing over time (HoT) spells instead of direct heals. This means that Druid healers can sometimes seem more boring to play early on because a HoT will keep someone topped off for several seconds where a direct heal would simply heal for it’s amount and then be done. If you’re running dungeons with a well geared tank and DPS who don’t make you want to slam your face through a table whilst flipping said table, then you often cast a HoT or two before the tank pulls and then cast DPS spells for the rest of the encounter and your tank will still be a full health at the end of the fight. When you start fighting groups of mobs instead of singles, always start with just 2-3 and work your way up. You want to get a feel for how",
    "textAfterTable": "I’m not going to get into hardcore math here, and I’m going to leave out all of the modifiers such as spellpower and crit chance. In fact, I’m going to skip almost all of the math here and just let you look at the table. I know not everyone is going to take the time to actually look at that table, so here’s the summary for you. If you want cheap heals, throw Rejuvenation on everyone who’s taking damage. If you want a big heal, cast Swiftmend if you can, Regrowth if you need it fast, or Health Touch if you’ve got time to spare. How To Heal For solo leveling you should be able to get by just fine with little more than Rejuvenation and an occasional Swiftmend to keep you alive even in dire situations. If you need to root something in place and then move away to get out of melee range then you can heal yourself back to full with Healing Touch or Regrowth followed by a Rejuvenation. If you’re running dungeons, then again Rejuvenation is your primary healing spell that you want to cast on everyone taking damage. Swiftmend will offer nice burst healing in your tank gets in a bind or your DPS are getting hit hard. Regrowth combined with Rejuvenation will keep your tank alive and well during any moderate-to-high damage boss fights. Nourish is good if you want to provide little bursts of direct healing to keep people topped",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}