{
    "relation": [
        [
            "Location (Use links below to see detailed statistics and historical trends)",
            "England",
            "London",
            "Yorkshire",
            "South East",
            "Bradford",
            "West Yorkshire",
            "Buckinghamshire",
            "Surrey",
            "Edinburgh",
            "Scotland",
            "Milton Keynes"
        ],
        [
            "Rank Change on Same Period Last Year",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "Matching Contract IT Job Ads",
            "7",
            "3",
            "2",
            "2",
            "2",
            "2",
            "1",
            "1",
            "1",
            "1",
            "1"
        ],
        [
            "Average Daily Rate Last 3 Months",
            "£388",
            "-",
            "£338",
            "£475",
            "£338",
            "£338",
            "£550",
            "£400",
            "-",
            "-",
            "£550"
        ],
        [
            "Average Daily Rate % Change on Same Period Last Year",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-",
            "-"
        ],
        [
            "Live Job Vacancies",
            "1",
            "1",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Process Improvement Analyst Contracts, Contractor Rates for a Process Improvement Analyst",
    "title": "",
    "url": "http://www.itjobswatch.co.uk/contracts/uk/process%20improvement%20analyst.do",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00149-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 525467970,
    "recordOffset": 525459768,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5537=The table below looks at the statistics for the Process Improvement Analyst role in IT contracts advertised across the UK. Included is a guide to the average contractor rates offered in IT contracts that have cited Process Improvement Analyst in their job title over the 3 months to 29 July 2015 with a comparison to the same period in the previous 2 years., 16797=This chart provides a histogram of daily rates quoted in contract IT jobs citing Process Improvement Analyst within the UK over the 3 months to 29 July 2015., 18058=The table below looks at the demand and provides a guide to the average contractor rates quoted in IT jobs citing Process Improvement Analyst within the UK over the 3 months to 29 July 2015. The 'Rank Change' column provides an indication of the change in demand within each location based on the same 3 month period last year., 34228=For the 6 months to 29 July 2015, IT contractor jobs within the UK that cited Process Improvement Analyst in their job title mentioned the following IT skills grouped by category. The figures indicate the number of jobs and their proportion against the total number of contract IT job ads sampled with Process Improvement Analyst in their job title. Up to 20 skills are shown per category., 24791=For the 6 months to 29 July 2015, IT contractor jobs within the UK that cited Process Improvement Analyst in their job title mentioned the following IT skills in order of popularity. The figures indicate the number of jobs and their proportion against the total number of contract IT job ads sampled with Process Improvement Analyst in their job title.}",
    "textBeforeTable": "The table below looks at the demand and provides a guide to the average contractor rates quoted in IT jobs citing Process Improvement Analyst within the UK over the 3 months to 29 July 2015. The 'Rank Change' column provides an indication of the change in demand within each location based on the same 3 month period last year. Process Improvement Analyst Top 11 Contract Locations This chart provides the 3-month moving average for hourly rates quoted in IT contractor jobs citing Process Improvement Analyst within the UK. Process Improvement Analyst Hourly Rate Trend This chart provides a histogram of daily rates quoted in contract IT jobs citing Process Improvement Analyst within the UK over the 3 months to 29 July 2015. Process Improvement Analyst Daily Rate Histogram This chart provides the 3-month moving average for daily rates quoted in IT contract jobs citing Process Improvement Analyst within the UK. Process Improvement Analyst Daily Rate Trend",
    "textAfterTable": "Process Improvement Analyst Top 30 Related IT Skills For the 6 months to 29 July 2015, IT contractor jobs within the UK that cited Process Improvement Analyst in their job title mentioned the following IT skills in order of popularity. The figures indicate the number of jobs and their proportion against the total number of contract IT job ads sampled with Process Improvement Analyst in their job title. 1 12 (100.00%) Process Improvement 2 7 (58.33%) Six Sigma 3 5 (41.67%) Business Analysis 4 4 (33.33%) Business Process Improvement 5 3 (25.00%) Target Operating Model 5 3 (25.00%) Change Management 5 3 (25.00%) Stakeholder Management 5 3 (25.00%) Retail 5 3 (25.00%) Degree 5 3 (25.00%) Six Sigma Black Belt 6 2 (16.67%) Project Planning 6 2 (16.67%)",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}