{
    "relation": [
        [
            "Pollutant",
            "Carbon monoxide(surrogate)",
            "Nitrogen oxides(surrogate)",
            "Black carbon(surrogate)",
            "PM2.5(surrogate)",
            "PM2.5 (surrogate)",
            "Acetaldehyde (MSAT)",
            "Acrolein (MSAT)",
            "Benzene (MSAT)",
            "1,3-Butadiene (MSAT)",
            "Formaldehyde (MSAT)"
        ],
        [
            "Sampling Approach",
            "Continuous monitoring(NDIR FRM CO analyzer)",
            "Continuous monitoring(Chemiluminescence NOx analyzer)",
            "Continuous monitoring (Aethalometer)",
            "Continuous monitoring (Beta gauge or TEOM)",
            "Integrated filter sampling (PM2.5 FRM method)",
            "Integrated sampling/HPLC analysis (USEPA Method TO-11A)",
            "Integrated sampling/HPLC analysis(USEPA Method TO-11A)",
            "Canister sampling-GC/MS analysis (USEPA Method TO-15)",
            "Canister sampling-GC/MS analysis (USEPA Method TO-15)",
            "Integrated sampling/HPLC analysis (USEPA Method TO-11A)"
        ],
        [
            "Accuracy",
            "20%",
            "20%",
            "5%",
            "5%",
            "5%",
            "10%",
            "10%",
            "10%",
            "10%",
            "10%"
        ],
        [
            "Precision",
            "10%",
            "10%",
            "5%",
            "5%",
            "5%",
            "5% for flow rate 10% for HPLC",
            "5% for flow rate 10% for HPLC",
            "5% for flow rate 10% for GC/MS",
            "5% for flow rate 10% for GC/MS",
            "5% for flow rate 10% for HPLC"
        ],
        [
            "Data Completeness",
            "80%",
            "80%",
            "80%",
            "80%",
            "90%",
            "90%",
            "90%",
            "90%",
            "90%",
            "90%"
        ]
    ],
    "pageTitle": "4.0 Monitoring Methods - Protocol - National Near-Road Study - Research And Analysis - Air Toxics - Air Quality - Environment - FHWA",
    "title": "Table 5. Summary of Pollutant Measurements and DQIs",
    "url": "http://www.fhwa.dot.gov/environment/air_quality/air_toxics/research_and_analysis/near_road_study/protocol/protocol04.cfm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 443969731,
    "recordOffset": 443954142,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Table 4-1 present a summary of the recommended monitoring methods for the MSATs and surrogate compounds to be measured during the studies conducted under this Protocol. Included in this table are values for some of the key data quality indicators (DQIs) that are recommended. Discussions of these DQIs are given below. 4.1.7 Summary Fine particulate matter (referred to as PM2.5) is component of vehicle emissions and should be measured as a surrogate for vehicle exhaust. The only accepted means of measuring PM2.5 is the filter based FRM8 that involves the collection of a 24-hour average PM2.5 sample. Monitoring for PM2.5 should be conducted using FRM designated PM2.5 samplers.7 In addition to the PM2.5 FRM measurements, continuous surrogate measurements of fine particle concentrations should also be made using commercially available instruments, e.g., either a beta attenuation monitor (BAM) or a tapered element oscillating microbalance (TEOM) monitor. Prior to implementation of either of these monitors into a monitoring study, the limitations of these techniques should be understood. Because of the nature of the measurement techniques employed in these monitors, their respective responses to aerosols will be dependent upon the aerosol properties and will not necessarily agree with one another, or with the PM2.5 FRM. 4.1.6 PM2.5 and Surrogates for PM2.5 A major component of urban aerosol is elemental carbon (EC), which is frequently called \"soot\". EC is emitted from all types of combustion, including from diesel exhaust. Although EC is not a unique surrogate for motor vehicle,",
    "textAfterTable": "4.1.7.1 Accuracy Accuracy is defined as the agreement between a measured value and the true value for a given parameter. Accuracy includes components of random error associated with variability from imprecision and systematic error associated with instrumental bias. Accuracy should be determined for the MSAT and surrogate monitoring systems and for the meteorological sensors. For the continuous gas analyzers (CO and NOx) accuracy should be assessed by challenging each analyzer with audit gases of known and certified concentration using a flow dilution system checked against a National Institute of Standards and Technology (NIST) traceable flow standard. Accuracy should be expressed in terms of a percent difference between the measured concentration and the known concentration of the audit gas. Particulate matter standards do not exist, therefore, accuracy for the continuous aerosol monitors and the integrated PM2.5 samplers should be established based on flow rate audit measurements, as is customary for these methods. For the meteorological sensors, accuracy should be assessed by comparisons to collocated transfer standards. Accuracy of the MSAT integrated methods (canister sampling/GC/MS analysis and DNPH cartridges/HPLC analysis) is assessed in two ways, i.e., by sampling flow checks and by laboratory calibrations. The air sampling flow rates of the MSAT sampling methods should be audited in the field, using NIST-traceable flow standards. The GC/MS and HPLC analytical methods are calibrated using commercially prepared gas standards, and using liquid phase standards of the carbonyl compounds, respectively. Accuracy thus depends on the quality of these primary standards, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}