{
    "relation": [
        [
            "Item Code",
            "2313",
            "2338",
            "2312",
            "2316",
            "2318",
            "2319"
        ],
        [
            "Variety Name",
            "Goodman",
            "Snowball Y",
            "Tipoff Romanesco F1",
            "Janvel F1",
            "Skywalker F1",
            "Veronica Romanesco F1"
        ],
        [
            "Type",
            "white",
            "white",
            "Romanesco",
            "white",
            "white",
            "Romanesco"
        ],
        [
            "Disease Resistance",
            "",
            "",
            "FY",
            "",
            "FY",
            "FY"
        ],
        [
            "DTM",
            "65",
            "70",
            "72",
            "75",
            "75",
            "77"
        ],
        [
            "Standout Characteristics",
            "small plants produce nice heads, deep curds, ivory domes average 10\" across, holds in field, concentrated harvest period",
            "smooth and tight curds, 6-7\" heads, dwarf plants, outer leaves protect heads, harvest over long period, good for fall harvest",
            "excellent flavor, nice yields, uniform, nutty flavor, good raw or cooked, can take heat better than Veronica F1",
            "gorgeous, high quality uniform heads with tight wrapper leaves that protect curds from sunburn; high yielding and slightly longer harvest window",
            "good for fall harvest, excellent uniformity and quality, concentrated harvest, perfect white heads, widely adapted, partially self-wrapping heads",
            "tends to be cream colored with a blush of pink in warmer temperatures, nutty flavor, good cooked or raw"
        ]
    ],
    "pageTitle": "Organic Non-GMO Seeds - Tipoff F1 Romanesco Cauliflower",
    "title": "",
    "url": "http://www.highmowingseeds.com/organic-non-gmo-seeds-Tipoff-F1-Romanesco-Cauliflower.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 10,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00000-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 494655427,
    "recordOffset": 494621391,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{51865=Cauliflower prefers well drained fertile soils high in organic matter. It will tolerate slightly alkaline soil, performing best in the 6.0 \u0096 7.5 range. A general guideline is 2-3 lbs of 8-16-16 fertilizer over 100 sq ft of garden area two weeks before planting.  If boron is not present in your soils, consider adding 1 Tbs per 100 sq ft. If soils are heavy or tend to be wet, a raised bed is recommended. Mulch can help keep soil cool and moist.}",
    "lastModified": "Mon, 03 Aug 2015 17:26:17 GMT",
    "textBeforeTable": "Organic Cauliflower Comparisons { document.orderform.mode.value='add2wl';document.orderform.submit(); }\" style=\"cursor: pointer;\" valign=\"middle\"> 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63",
    "textAfterTable": "Disease Resistance Key: FY Fusarium Yellows & Wilt Organic Cauliflower - Growing Information Printable version of this page Cauliflower Cauliflower is a cool season biennial in the Brassicaceae family, sharing species name Brassica oleracea  with brussels sprouts, cabbage, collards, kale, broccoli, and kohlrabi. Most cauliflower varieties are white, but a few are purple. The spectacular Veronica Romanesco has a green floret that grows in a spiky spiral. Soil  and Nutrient Requirements Cauliflower prefers well drained fertile soils high in organic matter. It will tolerate slightly alkaline soil, performing best in the 6.0 \u0096 7.5 range. A general guideline is 2-3 lbs of 8-16-16 fertilizer over 100 sq ft of garden area two weeks",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}