{
    "relation": [
        [
            "Bank",
            "Bank of America",
            "Capital One",
            "Charles Schwab",
            "Chase",
            "Citibank",
            "HSBC",
            "PNC",
            "TD Bank",
            "U.S. Bank",
            "Wells Fargo"
        ],
        [
            "Currency Amount",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36",
            "$131.36"
        ],
        [
            "Fees",
            "$6.31",
            "$0-$5.95",
            "$0",
            "$8.94",
            "$5.94",
            "$6.44",
            "$8.94",
            "$2.50",
            "$6.44",
            "$5"
        ],
        [
            "Total",
            "$137.67",
            "$131.36-137.31",
            "$131.36",
            "$140.30",
            "$137.30",
            "$137.80",
            "$140.30",
            "$133.86",
            "$137.80",
            "$136.36"
        ],
        [
            "% markup",
            "4.8%",
            "0-4.5%",
            "0%",
            "6.8%",
            "4.52%",
            "4.9%",
            "6.8%",
            "1.9%",
            "4.9%",
            "3.8%"
        ]
    ],
    "pageTitle": "Avoiding ATM Withdrawal Fees When Traveling AbroadThe Points Guy",
    "title": "",
    "url": "http://thepointsguy.com/2013/07/avoiding-atm-withdrawal-fees-when-traveling-abroad/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00287-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 239024259,
    "recordOffset": 238972148,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{181695=Exciting New Airline Routes for July 2015 and Beyond, 139319=DISCLAIMER: This information is based on my research of bank websites and correspondence with customer service representatives via e-mail or on the phone. Certain institutions make this information very clear and easy to find, while others require some extensive digging. In addition, bank fees are always subject to change, so while these numbers are accurate as of mid-July, it’s always a good idea to call and verify the details with your own bank prior to departure. If you have any recent experience that differs from what I have below, please share in the comments!, 140065=Update: As of December 2013 Bank of America charges 3% on international transaction fees., 167274=$0-5.95, 135484=6)   Bank of America: Update: As of December 2013 Bank of America charges 3% on international transaction fees. Numerous international partners allow customers to avoid a $5 by withdrawing from a partner ATM but you still get hit with a 1% international transaction fee. 100 EUR = $132.67 at these partner banks, whereas 100€ = $137.67 at non-partner locations.}",
    "lastModified": "Thu, 30 Jul 2015 03:23:43 GMT",
    "textBeforeTable": "Now let’s put these numbers to the test on a sample withdrawal of 500 Euros at a rate of 1 EUR = $1.3136 (exchange rate on 7/19). The following calculations assume that you are using a non-affiliated bank and that all banks convert at the same exchange rate: Like many other American banks, Wells Fargo doesn’t have any international partners with fee-free withdrawals. Any customer taking out money at a foreign ATM will be hit with a $5 fee. These fees are detailed out on the Wells Fargo debit card FAQ page here. Wells Fargo Wells Fargo doesn’t have any international partners with fee-free withdrawals. This Minneapolis-based bank also has no partners outside the U.S. They charge $2.50 per transaction plus a 2% fee for withdrawals made in U.S. dollars or a 3% fee for foreign currency withdrawals. However, the $2.50 fee is waived for Platinum and Premium Checking customers, while Gold Checking customers can get two fee waivers every statement period. To compare the different accounts, click here. U.S. Bank TD’s tagline as “America’s most convenient bank” unfortunately doesn’t apply to customers traveling internationally, as they too have no international partners. ATM withdraws result in a $2.50 fee; however, according to my correspondence with customer service, TD Bank",
    "textAfterTable": "* The $656.77 amount is not exactly equal to 1.3136*500. All conversions are made using the XE currency app, which includes many more decimal points when converting between two currencies. Now let’s see what happens to those numbers when you use a partner/affiliated bank: Bank Currency Amount Fees Total % markup Bank of America $656.77 $6.57 $663.34 1% Capital One $656.77 $0-$21.70 $656.77-678.47 0-3.3% Charles Schwab $656.77 $0 $656.77 0% Chase $656.77 $24.70 $681.47 3.76% Citibank $656.77 $0 $656.77 0% HSBC $656.77 $19.70 $676.47 3%",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}