{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10"
        ],
        [
            "Film",
            "Gravity",
            "Captain Phillips",
            "Cloudy With a Chance of Meatballs 2",
            "Machete Kills",
            "Runner Runner",
            "Prisoners",
            "Insidious Chapter 2",
            "Rush",
            "Don Jon",
            "Baggage Claim"
        ],
        [
            "Weekend",
            "$44,265,000 (-20.7)",
            "$26,000,000",
            "$14,200,000 (-32.2)",
            "$3,797,000",
            "$3,725,000 (-51.7)",
            "$3,665,000 (-36.2)",
            "$2,650,000 (-32.0)",
            "$2,364,000 (-47.2)",
            "$2,340,000 (-43.7)",
            "$2,075,000 (-49.1)"
        ],
        [
            "Per Screen",
            "$12,094",
            "$8,609",
            "$3,665",
            "$1,496",
            "$1,231",
            "$1,284",
            "$1,229",
            "$1,110",
            "$1,172",
            "$1,572"
        ],
        [
            "",
            "$123,400,000",
            "$26,000,000",
            "$78,037,000",
            "$3,797,000",
            "$14,114,000",
            "$53,620,000",
            "$78,447,000",
            "$22,202,000",
            "$20,141,000",
            "$18,272,000"
        ]
    ],
    "pageTitle": "Weekend Box Office Report: ‘Gravity’ Holds On, ‘Captain Phillips’ Launches and ‘Machete’ Doesn’t Kill",
    "title": "",
    "url": "http://kgab.com/weekend-box-office-report-gravity-captain-phillips-machete-kills/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00231-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 133799531,
    "recordOffset": 133774647,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{22632=Despite a few new releases, this weekend was all about last week’s champion. ‘Gravity‘ held on to the number one spot with all of its might, showing that Alfonso Cuaron’s space thriller may have some of the strongest legs of any major 2013 release.}",
    "textBeforeTable": "Despite a few new releases, this weekend was all about last week’s champion. ‘Gravity‘ held on to the number one spot with all of its might, showing that Alfonso Cuaron’s space thriller may have some of the strongest legs of any major 2013 release. Sony Share on Twitter Share on Facebook ScreenCrush October 13, 2013 11:51 AM | By Jacob Hall Weekend Box Office Report: ‘Gravity’ Holds On, ‘Captain Phillips’ Launches and ‘Machete’ Doesn’t Kill Newsletter Sign Up Top 5 at 7:45 Whatchu Talkin’ Bout Cheyenne Local Experts Meet your next car Noteworthy: Tip Us",
    "textAfterTable": "  With a downright minuscule 20% drop, ‘Gravity’ made $44 million in its second weekend for an astonishing $123 million gross. Sure, other movies have opened bigger and have had bigger second weekends, but percentage drops that small are extremely rare. This proves that the film isn’t just a major moneymaker, but a movie that audiences actually love and are talking about. This is the kind of second weekend that comes around when everyone who saw the film told all of their friends to check it out for themselves. Sure, the extra 3D charge doesn’t hurt, but people seem to really like the 3D in ‘Gravity,’ so all is well for everyone. Although ‘Gravity’ held onto the top, Paul Greengrass’ ‘Captain Phillips‘ opened very well in second place, grossing $26 million. You can thank the star power of Tom Hanks and the exceptional trailers for that one. We can’t imagine the film being a smash hit in the long run thanks to its difficult, adult subject matter, but it was made for a moderate budget. Unless it has a total drop-off next week, it should be a strong (if not spectacular) success. In many ways, it should play to the ‘Argo’ crowd. It’s a movie for adults and should continue playing well to them. However, it’s tough to find nice things to say about ‘Machete Kills,’ which was slaughtered by the critics and completely rejected by audiences. That $3 million opening should hopefully give director",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}