{
    "relation": [
        [
            "Rok",
            "2011 [Sty-Lis]",
            "2010",
            "2009",
            "2008",
            "2007",
            "2006",
            "2005"
        ],
        [
            "Operacji",
            "318,970",
            "339,898",
            "348,306",
            "366,561",
            "378,161",
            "355,593",
            "332,623"
        ],
        [
            "% zmiana",
            "2.05",
            "2.4",
            "5.0",
            "3.1",
            "6.3",
            "6.9",
            "-"
        ],
        [
            "Cargo (w tonach)",
            "375,060.53",
            "393,075.87",
            "321,133.44",
            "376,095.71",
            "-",
            "-",
            "-"
        ],
        [
            "% zmiana",
            "4.59",
            "22.40",
            "14.61",
            "-",
            "-",
            "-",
            "-"
        ]
    ],
    "pageTitle": "Port lotniczy Meksyk-Benito Juarez – Wikipedia, wolna encyklopedia",
    "title": "Statystyki operacji i cargo",
    "url": "https://pl.wikipedia.org/wiki/Port_lotniczy_Meksyk-Benito_Juarez",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 858313051,
    "recordOffset": 858278659,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13958=To lotnisko jest obsługiwane przez 32 linii lotniczych, krajowych i międzynarodowych oraz oferuje bezpośrednie loty do ponad 100 miejsc na całym świecie. Zapewnia bezpośrednie połączenia z Meksyku do Ameryki Północnej, Ameryki Środkowej i Karaibów, Ameryki Południowej, Europy i Azji (Aeromexico jest jedynym przewoźnikiem, który lata do Azji z miasta Meksyk). W 2010 r. lotnisko obsłużyło 24.130.535 pasażerów. W optymalnych warunkach, oraz po gruntowny remoncie i projektach rozbudowy, Port lotniczy Benito Juárez będzie w stanie obsłużyć do 32 milionów pasażerów rocznie[1]. Jest głównym węzełem największej meksykańskiej linii lotniczej Aeromexico i węzłem pomocniczym dla spółki zależnej Aeroméxico Connect, lotnisko stało się ośrodkiem SkyTeam. Jest to także centrum dla Aeromar, Interjet oraz VivaAerobus i Volaris., 11910=Port lotniczy Meksyk-Benito Juarez (IATA: MEX, ICAO: MMMX) – międzynarodowy port lotniczy, największy w Meksyku. Położony jest na wschód od centrum meksykańskiej stolicy. W 2005 obsłużył około 23,3 mln pasażerów. Jest najbardziej ruchliwym portem lotniczym Meksyku zarówno pod względem ruchu pasażerskiego i ruchu statków powietrznych i drugim najbardziej ruchliwym Ameryki Łacińskiej ruchu pasażerskiego po Guarulhos w São Paulo, w Brazylia i najbardziej ruchliwym portem w ruchu statków powietrznych. Chociaż Juárez nie był jego oficjalną nazwą od kilkudziesięciu lat, był tak formalnie nazwany po XIX wiecznym prezydencie Benito Juárez w 2006 r. i jest główną międzynarodową i krajową bramą Meksyku. Lotnisko jest własnością Grupo Aeroportuario de la Ciudad de México i jest zarządzana przez Aeropuertos y Servicios Auxiliares, państwową firmę, która obsługuje także 21 innych lotnisk, poprzez Meksyk. W ostatnich latach Port lotniczy Toluca stał się alternatywnym lotniskiem., 63297=W 2010 roku Port lotniczy Benito Juárez był najbardziej ruchliwym portem lotniczym w Ameryce Łacińskiej pod względem ruchu samolotów z 27,3% więcej operacji niż Port lotniczy El Dorado w Bogocie i 35,5% więcej niż Guarulhos w São Paulo. Dla 12-miesięcznego okres kończącego się 31 grudnia 2010 r. port lotniczy obsłużył 339898 operacji, średnio 931 operacji dziennie., 23698=W dniu 15 listopada 2007, Terminal 2 został otwarty, zwiększając zdolności lotniska. Wszyscy członkowie SkyTeam przenieśli swoją działalność do nowego terminalu, z wyjątkiem Air France i KLM. Został oficjalnie otwarty w marcu 2008 r., kiedy nowego dostępu drogowego i dróg kołowania zostały ukończone. Terminal 2 zwiększył możliwości lotniska o 40%, oraz zdolności operacyjną o 15%., 120044=Terminal 2 jest połączony z Terminalem 1 przez system jednotorowego Aerotrén, z którego mogą korzystać tylko pasażerowie z bagażem podręcznym będący po odprawie. Technicy i załoga pokładowa mogą z niego korzystać. Normalne godziny pracy są od 05:00 do 23:00, każdego dnia w roku, a pierwszy kurs uruchamiany jest zawsze od T2 do T1; ostatni w ciągu dnia biegnie do T2. Odległość między terminalami wynosi 3 km i prędkość Aerotrén wynosi 45 km/h. Podróż Aerotrén podróży, gdy drzwi są całkowicie zamknięte trwa około 4 minut i 40 sekund pomiędzy stacjami w obu kierunkach. Ponadto, maksymalny okres oczekiwania na następny pociąg wynosi o 11 minut. Jest też obsługi naziemna między terminalami o nazwie \"transport między terminalami\". Autobusy te znajdują się przy wejściu 6 z Terminalu 1 i wyjściu 4 z Terminalu 2., 22153=W 2001 r. wschodnie skrzydło terminalu (H-bramy) zostało otwarte jako ostateczna poczekalnia, głównie dla członków SkyTeam. Ze względu na rosnący popyt, prezydent Vicente Fox zapowiedział budowę nowego, większego lotniska na 5000 h w gminach Texcoco i San Salvador Atenco, ale kiedy lokalne protesty gwałtownie wzrosły, nowy port lotniczy został odwołany. Zamiast tego, uruchomił program o nazwie Rozbudowa Portu lotniczego Meksyk do maksymalnej pojemności w 2002 roku w celu zwiększenia zdolności lotniska. Cały terminal był rozszerzony i rozbudowany o nowe sale check-in, 13 więcej pasów odbioru bagażu, budowa pięter odlotów i przylotów, budowę kilku nowych dróg kołowania i nowych terminali naprzeciwko oryginalnego, łamiąc w ten sposób koncepcję jednego terminala. Projekt został rozpoczęty z początkową kwotą 200 mln dolarów. Niemniej jednak, jego ostateczny koszt był 800.000.000 dolarów MXP. Oryginalny Terminal 2, który mieści tylko Aeromar zaprzestał działalności i został rozebrany, a nowy Terminal 2 został zbudowany w mniej niż dwa lata., 20556=Lotnisko po raz pierwszy otwarto jako Lotnisko Wojskowe Balbuena z pięcioma pasami startowymi. Pierwsze lądowanie odbyło się w dniu 5 listopada 1928 roku i regularne usługi rozpoczęto rok później, ale zostało one oficjalnie otwarte w dniu 15 maja 1931 roku. Pierwszą międzynarodową trasą był lot do Los Angeles International Airport obsługiwany przez Mexicana. Prezydent Miguel Alemán otworzył terminal w 1952 roku, stając się portem komercyjnym. W latach 70 prezydent Luis Echeverría zamknął trzy pasy startowe i dał teren ziemi dla ludzi ubogim w celu budowania swoich domów, pozostawiając tylko dwa równoległe pasy startowe. W 1980 roku terminal został rozbudowany dwukrotnie, przy użyciu jednego dużego terminala niż wielu terminali, jak w innych portach lotniczych. Dziesięć lat później w 1990 roku, mieszane bramki krajowe / międzynarodowe były oddzielone, aby zwiększyć funkcjonalność terminala, wraz z wydzieleniem hal chek-in krajowych i międzynarodowych.}",
    "lastModified": "Thu, 23 Jul 2015 12:14:16 GMT",
    "textBeforeTable": "Statystyki ruchu[edytuj | edytuj kod] World Airways (Mediolan-Malpensa) UPS Airlines (Louisville) Tampa Cargo (Bogota) MasAir (Bogotá, Buenos Aires-Ezeiza, Campinas-Viracopos, Caracas, Guadalajara, Guayaquil, Lima, Los Angeles, Manaus, Medellín-Córdova, Miami, Quito, Santiago de Chile) Lufthansa Cargo (Chicago O'Hare, Dallas/Fort Worth, Frankfurt) Florida West International Airways (Bogotá, Miami) Estafeta (Mérida, San Luis Potosí, Villahermosa) DHL de Guatemala (Gwatemala) DHL Express obsługiwane przez Astar Air Cargo (Cincinnati/Northern Kentucky, Miami) Cielos Airlines (Lima) Centurion Air Cargo (Bangor (ME), Miami) Cargolux (Atlanta, Guadalajara, Houston-Intercontinental, Luksemburg, Miami, Nowy Jork-JFK) Atlas Air obsługiwane przez Emirates SkyCargo (Huntsville) Atlas Air (Huntsville) Amerijet International (Miami) Air France Cargo (Guadalajara, Houston-Intercontinental, Paryż-Charles de Gaulle, Porto) AeroUnion (Chicago-O'Hare,",
    "textAfterTable": "15,848,060 2.1 8,879,236 3.3 24,727,296 2.5 2005 15,523,755 - 8,591,797 - 24,115,552 - Statystyki operacji i cargo Rok Operacji  % zmiana Cargo (w tonach)  % zmiana 2011 [Sty-Lis] 318,970 2.05 375,060.53 4.59 2010 339,898 2.4 393,075.87 22.40 2009 348,306 5.0 321,133.44 14.61 2008 366,561 3.1 376,095.71 - 2007 378,161 6.3 - - 2006 355,593",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}