{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "32",
            "35",
            "-",
            "22",
            "89"
        ],
        [
            "gs",
            "29",
            "35",
            "-",
            "-",
            "64"
        ],
        [
            "min/g",
            "24.4",
            "26.2",
            "-",
            "4.8",
            "20.3"
        ],
        [
            "fg/g",
            "3.6-8.7",
            "4.3-10.1",
            "0.0-0.0",
            "0.3-1.0",
            "3.1-7.3"
        ],
        [
            "pct",
            "41.5",
            "42.8",
            "-",
            "27.3",
            "41.7"
        ],
        [
            "3pt/g",
            "0.0-0.4",
            "0.3-0.9",
            "0.0-0.0",
            "0.3-0.8",
            "0.2-0.7"
        ],
        [
            "pct",
            "7.7",
            "33.3",
            "-",
            "35.3",
            "28.3"
        ],
        [
            "ft/g",
            "3.0-4.7",
            "3.1-4.8",
            "0.0-0.0",
            "0.0-0.0",
            "2.3-3.6"
        ],
        [
            "pct",
            "64.4",
            "64.9",
            "-",
            "-",
            "64.7"
        ],
        [
            "ppg",
            "10.2",
            "12.0",
            "-",
            "0.8",
            "8.6"
        ]
    ],
    "pageTitle": "Gena Johnson - Pacific",
    "title": "",
    "url": "http://www.pacifictigers.com/sports/w-baskbl/2012-13/bios/johnson%20gena%20ulxi",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00227-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 629336615,
    "recordOffset": 629312618,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28441=Sophomore (2011-12): Transitioned from shooting guard to point guard as a sophomore and averaged 10.2 points per game and 2.1 assists per game. Started 29 of 32 games. Finished 12th in the Big West in scoring, and third in blocked shots (1.4 per game). No point guard in the NCAA averaged more blocked shots. Her blocked shot average ranked 126th in the NCAA overall, sixth-best among guards and second in the county amongst players under 5-10 in height. Also finished 11th in the Big West in steals per game (1.5). Scored in double figures in 18 of 32 games, including a run of seven in a row from Feb. 25 to Mar. 16. The Tigers were +25 in point differential with Johnson on the floor. Scored a season-high 19 points at Long Beach State (Feb. 28) on six-of-nine shooting and a seven-for-nine performance from the free throw line. Hit five-of-six field goal attempts for 14 points at UC Riverside (Jan. 7) and again versus UC Davis (Feb. 25). Averaged 13.3 points per game in the last four regular season games. Averaged 16.0 points per game in the Big West tournament with 17 against UC Davis (Mar. 3) and 15 against UC Santa Barbara (Mar. 6). Posted 16 points in the Tigers' first round win over Arizona State in the WNIT (Mar. 16). Grabbed five or more rebounds 10 times, including a season-best nine to finish one shy of a double-double against Cal State Northridge (Jan. 14). Handed out a career-high nine assists against Air Force (Dec. 21) while finishing with 13 points. Added five assists with 16 points against Seattle (Jan. 17) and five helpers at UC Davis (Jan. 21). Recorded multiple steals in a game 11 times (Pacific went 8-3 in those games), including a career-high six against Air Force (Dec. 21). Added five steals at UC Riverside (Jan. 7). Drove for a basket and got fouled 16 times and converted 13 'and-one' free throws, tops in both categories on the team., 31368=High School Johnson paced the Franklin High School Wildcats with an average of 16.7 points, 7.1 rebounds, 3.8 assists and 1.7 blocks per game - all totals that led the team her senior season. Johnson was named to the All-Delta Valley League team , helping Franklin to the semifinals of the Sac-Joaquin Section Tournament (which was held at the Alex G. Spanos Center on Pacific's campus). In the semis, Johnson tallied 18 points to close out her high school career. She was recognized by the local media as First-Team All-Metro by the Sacramento Bee. As a junior in 2008-09, Johnson led the Wildcats to a 21-8 overall record and a 9-1 Delta Valley League finish. She led the team in points per game (16.9) as the Delta Valley League's leading scorer. She also chipped in 3.4 steals per game and 2.1 blocks per game, leading the team in both categories, to go with a 5.2 rebounding average. Johnson ranked as California's No. 21 guard prospect after being named the Delta Valley League's MVP and First Team All-League. She also was named to the 2009 First Team Sacramento Bee All-City team, and was tabbed as Sacramento's top athlete on the River Cats' All-City team as a junior. Prior to transferring to Franklin, Johnson spent two seasons at Laguna Creek High School in Elk Grove, Calif., where she closed out the 2007-08 season with team-leading figures in points per game (15.9), rebounds per game (3.9) and blocks per game (2.2). She was named Honorable Mention All-Delta Valley as a sophomore and earned Sacramento All-City Honorable Mention accolades. As a freshman Johnson led her team with 1.4 blocks per game. She also turned in 199 points to average 7.1 per game. \"Gena is an outstanding athlete and will be a tremendous fit in our system,\" Roberts said. \"She can attack the basket, really elevate and finish in traffic. She has the potential to be a tremendous defensive player with her length and athleticism. We really anticipate Gena being an impact player in the Big West Conference.\"  , 185696=Pacific Athletics 3601 Pacific Ave., Stockton, CA 95211 209-946-2472, 186700=Countdown to 2015-16 Season, 30392=2010-11 (Freshman): An All-Big West Honorable Mention and Big West All-Freshman Team selection, Gena Johnson averaged 8.9 points per game, and 11.1 in Big West games in her breakout freshman campaign. She appeared in 29 games, starting the final seven before a broken hand sidelined her for the Big West Semifinals.  She reached double-figure scoring in 11 games, setting a new career-high in points on four separate occasions. She sprung for a career-best 28 points against Cal State Fullerton (Feb. 19) on eight-of-14 shooting and an 11-for-11 performance from the free-throw line. She added 19 in the Tigers win at UC Riverside (Jan. 29) and 18 against UC Irvine (Feb. 24). Johnson finished with 29 steals and 23 blocks, while handing out 44 assists. She doled out a career-high five assists at UC Irvine (Feb. 17) and went for a season-best nine rebounds in the Tigers' win at UC Davis (Feb. 9).}",
    "textBeforeTable": "Gena Johnson 24 24 Related Bios Tabatha Anderson Kristina Johnson Kendall Rodriguez Ashley Smith Kendall Kenyon Ashley Wakefield Erin Butler Sam Pettinger Brianna Johnson Claire Conricode Erica McKenzie Hailie Eackles Shanice Butler Ande Lampert }); }); $(this).toggleClass('active').next('ul').toggleClass('active'); $('.secondary-nav .container > h1').click(function() { $(function() { })(jQuery); }); }); $('.has-submenu.active').removeClass('active'); $(document).on('click', function(e) { }); return false; $(this).parent().toggleClass('active'); $('.has-submenu > a', '#nav').on('click', function() { }); return false; $('#nav').removeClass('active'); $('#jump-to-nav').removeClass('active'); $('#nav .close').click(function(e) { }); $('#nav').toggleClass('active'); $(this).toggleClass('active'); e.preventDefault(); $('#jump-to-nav').click(function(e) { $(function() { (function($) {",
    "textAfterTable": "   Gena Johnson Career Stats      Minutes  Total  3-Point  F-Throws  Rebounds    Year  gp-gs  min  avg  fg  fga  pct  fg  fga  pct  ft  fta  pct  off  def ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}