{
    "relation": [
        [
            "Player",
            "Bruce Berenyi",
            "Randy Myers",
            "John Mitchell",
            "Terry Leach",
            "Ed Lynch"
        ],
        [
            "G",
            "14",
            "10",
            "4",
            "6",
            "1"
        ],
        [
            "IP",
            "39.2",
            "10.2",
            "10.0",
            "6.2",
            "1.2"
        ],
        [
            "W",
            "2",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "L",
            "2",
            "0",
            "1",
            "0",
            "0"
        ],
        [
            "ERA",
            "6.35",
            "4.22",
            "3.60",
            "2.70",
            "0.00"
        ],
        [
            "SO",
            "30",
            "13",
            "2",
            "4",
            "1"
        ]
    ],
    "pageTitle": "1986 New York Mets season - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/1986_New_York_Mets_season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 21,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00179-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 852090191,
    "recordOffset": 852035529,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{35270=The Mets had a rocky start with a 2-3 record (including two extra-inning losses to the St. Louis Cardinals and Philadelphia Phillies respectively).[14] But when the Mets hosted the Phils in Shea Stadium, they began an 11-game winning streak. Their toughest test in this stretch happened in St. Louis. On April 24, Howard Johnson hit a game-tying homer. A few games later, Wally Backman made a series-saving double-play. The Mets finished the month 13-3., 297442=Had the Red Sox won the World Series, they would have won their first World Series since 1918, in addition to making Boston the first city to win both NBA and World Series championships in the same year. As it turned out, the Celtics championship four months before would be the last championship for Boston and for Massachusetts until the New England Patriots, who lost Super Bowl XX to the Chicago Bears in January, won Super Bowl XXXVI in 2002., 37776=On July 3 against Houston, Darryl Strawberry hit a game-tying home run. But it was Ray Knight who won the game with a homer of his own. Dwight Gooden's first half performance was good enough for him to earn the honor of being named starting pitcher for the National League in the All-Star Game in the Astrodome. This game marked the end of a streak where the NL won 13 of the previous 14 games and served as foreshadowing for what would happen next. Later in the month, the Mets lost three of four to the Astros. During this series, four Mets were arrested at a popular nightclub in Houston. Their fortunes improved in a bizarre game in Cincinnati's Riverfront Stadium on July 22. In the top of the ninth, Dave Parker dropped the ball that could have been the final out for the Reds, allowing the Mets to tie the game. In the bottom of the tenth, Eric Davis got to third and brawled with Ray Knight. Both men, along with Kevin Mitchell and Mario Soto, were ejected. Johnson was forced to alternate Jesse Orosco and Roger McDowell in the outfield. In the bottom of the twelfth, Carl Willis bunted into a double-play. In the top of the fourteenth, Howard Johnson hit a home run to put the Mets on top., 44213=The Mets then split a two-game series St. Louis, trimming the magic number to clinch to 1 on September 16. The following day, they faced Dennis Eckersley and the Chicago Cubs. With a flu-ridden Hernandez, Dave Magadan would be the offensive source of the day. Hernandez would return in the 9th to get the final out.[22] The champagne would be popped immediately while the fans invaded the field quickly.[23] The Mets would win a team-record 108 games after defeating the Pirates.[24], 4500=The 1986 New York Mets season was the Mets' 25th season in the National League. They improved from a 98–64 record in 1985 to finish the season with a franchise record 108–54 record, giving them the division title. They went on to defeat the Houston Astros in six games in the NLCS and the American League champion Boston Red Sox in seven games in the World Series. This is their last championship to date., 17240=The 1986 New York Mets held Spring Training at Al Lang Stadium in St. Petersburg, Florida for the 25th season., 279333=October 14 (Shea Stadium, Flushing, New York), 12853=In the 1985-86 offseason, general manager Frank Cashen brought in Tim Teufel, a right-handed hitting infielder from the Minnesota Twins and Bob Ojeda, a left-handed pitcher from the Boston Red Sox. The Mets added them to an existing veteran core including along with former MVPs George Foster and Keith Hernandez, veteran catcher Gary Carter and speedsters Wally Backman and Mookie Wilson., 12243=Darryl Strawberry made his debut in 1983, followed by Dwight Gooden, Ron Darling, Sid Fernandez and Lenny Dykstra in 1984. That was the year that the Mets hired Davey Johnson to manage the ballclub. The Mets would finish in 2nd-place for two years in a row., 40001=Former MVP George Foster was released. Former Mets favorite Lee Mazzilli would return. Gary Carter would be injured. While he was gone, the Mets would win 8 of 11 games. The highlight came on August 27 in Jack Murphy Stadium against the Padres when Tim Flannery would hit one into the outfield.[17] However, it was thrown to home plate to get the runner out at home and eventually Flannery out at third.[17], 274483=October 11 (Shea Stadium, Flushing, New York), 37122=This month, the shining light came on June 10 against the Phillies when Tim Teufel hit a pinch-hit, game-winning grand slam.[15][16], 289119=One of the most famous games in baseball history is Game 6 of the 1986 World Series. The Mets rallied in the bottom of the 8th inning of Game 6, tying the game on a Gary Carter sacrifice fly. Reliever Calvin Schiraldi had loaded the bases with no outs and had a 3-0 count on Carter, who swung away at the next pitch to hit the fly ball. In the ninth inning, after a walk and an error put two men on with nobody out, Howard Johnson was sent to the plate to sacrifice the winning run to third. It was then, however, that Mets manager Davey Johnson made his most criticized[by whom?] decision of the series. After Johnson failed in his first bunt attempt, Davey took the bunt off. Johnson ended up striking out, leaving runners at first and second with one out. Lee Mazzilli followed with a deep fly to left that would have won the game had the runner been at third. Lenny Dykstra then flied out for the third out, sending the game to extra innings., 272296=October 9 (Astrodome, Houston), 269993=October 8 (Astrodome, Houston), 276983=October 12 (Shea Stadium, Flushing, New York), 36336=The Mets continued dominating in May. On May 23, 1986, Mookie Wilson had 5 hits in one game versus the San Diego Padres. The turning point for the Mets season came on May 27 when third baseman Ray Knight brawled with Dodgers' pitcher Tom Niedenfuer. This gave the Mets a reputation for playing hard and fighting. Many other teams hated their curtain calls., 281832=October 15 (Astrodome, Houston)}",
    "lastModified": "Sun, 02 Aug 2015 16:08:37 GMT",
    "textBeforeTable": "Note: Pos = position; G = Games played; AB = At Bats; H = Hits; Avg. = Batting Average; HR = Home Runs; RBI = Runs Batted In Starters by position[edit] Batting[edit] = Indicates team leader Player stats[edit] 30 Mel Stottlemyre 28 Bill Robinson 52 Greg Pavlick 51 Vern Hoscheit 23 Bud Harrelson Coaches  5 Davey Johnson Manager  1 Mookie Wilson 18 Darryl Strawberry  7 Kevin Mitchell 13 Lee Mazzilli 27 Stan Jefferson 25 Danny Heep 15 George Foster  4",
    "textAfterTable": "SS Rafael Santana 139 394 86 .218 1 28 0 LF George Foster 72 233 53 .227 13 38 1 CF Lenny Dykstra 147 431 127 .295 8 45 31 RF Darryl Strawberry 136 475 123 .259 27 93 28 Other batters[edit] Player G AB H Avg. HR RBI SB Mookie Wilson 123 381 110 .289 9 45 25 Kevin Mitchell 108 328 91 .277 12 43 3 Tim Teufel 93 279 69 .247 4 31 1 Howard Johnson 88 220 54 .245 10 39 8 Danny Heep 86 195 55 .282 5 33 1 Ed Hearn 49 136 36 .265 4 10 0 Lee Mazzilli 39 58 16 .276 2 7 1 Kevin Elster 19 30 5 .167 0 0 0 Stan Jefferson 14",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}