{
    "relation": [
        [
            "Year",
            "2007",
            "2008",
            "2009",
            "2010",
            "2011",
            "2012",
            "2013"
        ],
        [
            "Winner",
            "Annette Obrestad",
            "John Juanda",
            "Barry Shulman",
            "James Bord",
            "Elio Fox",
            "Phil Hellmuth",
            "Adrián Mateos"
        ],
        [
            "Winning Hand",
            "7♥ 7♠",
            "K♠ 6♣",
            "10♠ 10♣",
            "10♦ 10♥",
            "A♦ 10♠",
            "A♥ 10♦",
            "A♠ K♣"
        ],
        [
            "Prize Money",
            "£1,000,000",
            "£868,800",
            "£801,603",
            "£830,401",
            "€1,400,000",
            "€1,058,403",
            "€1,000,000"
        ],
        [
            "Entrants",
            "362",
            "362",
            "334",
            "346",
            "593",
            "420",
            "375"
        ],
        [
            "Runner-Up",
            "John Tabatabai",
            "Stanislav Alekhin",
            "Daniel Negreanu",
            "Fabrizio Baldassari",
            "Chris Moorman",
            "Sergii Baranov",
            "Fabrice Soulier"
        ],
        [
            "Losing Hand",
            "5♠ 6♦",
            "A♣ 9♠",
            "4♠ 4♦",
            "5♠ 5♥",
            "A♥ 7♠",
            "A♠ 4♣",
            "9♦ 8♦"
        ]
    ],
    "pageTitle": "World Series of Poker Europe - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/World_Series_of_Poker_Europe",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00272-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 851256515,
    "recordOffset": 851230903,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7904=In 2008, the WSOPE added a fourth event and was held at the Casino at the Empire in Leicester Square, London. The 2008 WSOPE was particularly notable, as Jesper Hougaard became the first person to win a bracelet at both the WSOP and WSOPE, let alone winning both in a single year. The WSOPE Main Event included several big name stars including Ivan Demidov, John Juanda and Daniel Negreanu. Demidov's appearance at the WSOPE final table was of particular interest. While sitting at the WSOPE Main event final table, he was one of the November Nine players scheduled to play in November for the WSOP Main Event. This meant that for a period of time there was a chance that the same person could win both Main Events. As it was, he was the first player to make it to the final table at both the WSOP and WSOPE Main Events.[6] Three-time bracelet winner John Juanda won his fourth bracelet in the WSOPE Main Event. Theo Jørgensen, who made it to the 2007 WSOPE Main Event final table, won his first bracelet in the £5,000 Pot-Limit Omaha event. Sherkhan Farnood, undoubtably had the most challenging final table as four of his final six opponents (Ivo Donev, Howard Lederer, Phil Ivey, and Jeff Lisandro) had a combined 9 WSOP bracelets between them. The 2008 WSOPE also marked a technological advance with the advent of the mobile hole card camera. At previous tournaments, the viewing audience could only see the hole cards at select tables. In 2008, a special camera was used that enabled roaming camera crews to capture the action at adjacent tables.[7], 4826=The 2009 WSOPE was held from September 17 to October 1 at the Casino at the Empire in London, England. It consisted of four bracelet events including a £1,000 No-Limit Hold'em, a £2,500 Pot Limit Hold'em/Pot-Limit Omaha, a £5,000 Pot Limit Omaha, and a £10,000 World Championship No-Limit Hold'em Main Event.[8], 1289=For 2013 the tournament moved to the Casino Barriere in Enghien-les-Bains, France. From October 11 to October 23 there were eight bracelet events., 1991=The 2012 WSOPE Event returned to Cannes - again with seven bracelet events., 2817=The 2011 WSOPE Event was held at the Majestic Barrière Cannes and the Le Croisette Casino Barrière in Cannes. There were seven bracelet events., 10345=In marketing the WSOPE, Harrah's Casino did not rely upon the reputation of Harrah's or the WSOP alone. On July 5, 2007, Harrah's announced its alliance with England-based Betfair, one of the largest online gaming companies in the world. The agreement builds on Betfair's European reputation in advertising the WSOPE while creating the largest agreement between a web-based and brick-and-mortar casinos.[4] Due to changes in U.S. laws, effective in 2007, the WSOP could no longer accept money from online gambling companies. This prevented the WSOP from acknowledging WSOP qualifiers from online events. The WSOPE is not bound by this limitation. The United Kingdom Gambling Act of 2005 allows for legal regulated online poker sites.[3] Furthermore, as the laws that govern the age of gambling differ in England than the U.S., the WSOPE admits younger players. In 2007, four of the five finalists at the first event of the WSOPE had won bracelets. Thomas Bihl, however, outlasted each of them to claim the first-ever WSOPE bracelet. No previous bracelet winners played at the second final table; Dario Alioto won the bracelet. Annette \"Annette_15\" Obrestad, became the youngest player to win a WSOP bracelet event at age 18 years, 364 days in the final event of the tournament.[5], 3754=The 2010 World Series of Poker Europe was held from September 14 to September 28 at the Casino at the Empire in London, England. There were five bracelet events, culminating in the £10,350 WSOPE Championship No Limit Hold'em event which was won by James Bord, the first WSOPE bracelet winner from the UK., 13284=In 2004, Harrah's Casinos purchased the rights to the WSOP label. Harrah's later purchased London Clubs International (LCI). LCI operates three casinos in the London area—Fifty, Leicester Square, and The Sportsman. After the purchase of these casinos, Harrah's decided to expand its WSOP label into Europe.[2] European casinos typically have a different environment than those in the U.S.[2] Jeffrey Pollack, the WSOP Commissioner, indicated that the WSOPE would have a \"style and flair that is both unique and appropriate to the setting. So don't be surprised if we require participants to wear blazers at the tables. If James Bond were hosting a poker tournament it may look like the World Series of Poker Europe.\"[2], 17301=The World Series of Poker Europe (WSOPE) is the first expansion effort of World Series of Poker-branded poker tournaments outside the United States. Since 1970, participants had to travel to Las Vegas if they wanted to compete in the World Series of Poker (WSOP). Although the WSOP held circuit events in other locations, the main tournaments, which awarded bracelets to the winners, were exclusively held in Las Vegas. The inaugural WSOPE, held in 2007, marked the first time that a WSOP bracelet was awarded outside of Las Vegas.[1] From its inception to the 2013 tournament, players from 19 countries — USA (10), France (4), UK (3), Denmark (3), Canada (2), Norway (2), Portugal (2), Italy (2), Afghanistan, Germany, Indonesia, Spain, New Zealand, Sweden, Tunisia, Switzerland, Australia, Italy and Finland — have won bracelets., 727=In November 2013 it was announced that the WSOP Europe and WSOP Asia Pacific will begin rotating annually beginning in 2014, with WSOP APAC being held in even-numbered years and WSOPE in odd-numbered years. Therefore, the WSOP Europe will not be held in 2014.[9]}",
    "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT",
    "textBeforeTable": "Main Event winners[edit] In November 2013 it was announced that the WSOP Europe and WSOP Asia Pacific will begin rotating annually beginning in 2014, with WSOP APAC being held in even-numbered years and WSOPE in odd-numbered years. Therefore, the WSOP Europe will not be held in 2014.[9] Future events[edit] For 2013 the tournament moved to the Casino Barriere in Enghien-les-Bains, France. From October 11 to October 23 there were eight bracelet events. 2013 World Series of Poker Europe Main article: 2013 World Series of Poker Europe[edit] The 2012 WSOPE Event returned to Cannes - again with seven bracelet events. 2012 World Series of Poker Europe Main article: 2012 World Series of Poker Europe[edit] The 2011 WSOPE Event was held at the Majestic Barrière Cannes and the Le Croisette Casino Barrière in Cannes. There were seven bracelet events. 2011 World Series of Poker Europe Main article: 2011 World Series of Poker Europe[",
    "textAfterTable": "Notes[edit] ^ \"Harrah's Set to Launch World Series of Poker Europe\". Gaming Business. 2007-02-27. Archived from the original on 2007-09-30. Retrieved 2007-07-25.  ^ a b c Warner, Eric (2007-02-27). \"Stay classy, London: Jeffrey Pollack on the World Series of Poker Europe\". Pokerlistings.com. Poker Listings. Retrieved 2007-07-27.  ^ a b World Series of Poker (WSOP) Comes to Europe This Fall February 27, 2007. Pokerpages.com. Accessed 7/25/07 ^ \"Harrah's Selects Betfair.com as 'Presenting Sponsor' of World Series of Poker Europe\". PRweb.com. PRweb. 2007-07-05. Retrieved 2009-02-08.  ^ \"£10,000 NLHE, Final Table: Annette Obrestad Makes History\". Pokernews.com. Retrieved 2009-05-09.  ^ Bradley, Lance (2008-10-02). \"WSOPE: Ivan Demidov Makes Historic Double Final Table Appearance\". BluffMagazine. Retrieved 2009-02-08.  ^ Newell, Jennifer (2009-01-06). \"ESPN to Air WSOP Europe Beginning February 1\". PokerWorks.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}