{
    "relation": [
        [
            "Team",
            "18. MK Dons",
            "19. Preston",
            "20. Q.P.R.",
            "21. Reading",
            "22. Rotherham",
            "23. Sheff Wed",
            "24. Wolves"
        ],
        [
            "P",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "W",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "D",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "L",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "GD",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Pts",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Reading - Pick Your Championship Fantasy Football Team",
    "title": "",
    "url": "http://www.reading.vitalfootball.co.uk/article.asp?a=116098",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 1,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00082-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 663830593,
    "recordOffset": 663814199,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{10910=Season Preview- Derby (Tuesday July 28 2015), 11291=Season Preview- Huddersfield (Wednesday July 29 2015), 11477=Season Preview- Hull (Wednesday July 29 2015), 16293=Time: 4:10PM, 10163=Season Preview- Burnley (Saturday July 25 2015), 9976=Season Preview- Bristol City (Saturday July 25 2015), 10726=Crawley Vs Reading- Preview (Monday July 27 2015), 21373=Pick your Fantasy Football Championship team today Select a fantasy team ahead of the new season - there's £5,000 in cash to be won. Plus - join Vital Football`s own League just for Royals fans\u0085 Free to play: click here for details At long last, there's a proper Fantasy Football game for fans of teams that play in the Championship. Vital Football has teamed up with The Daily Telegraph and FourFourTwo to give Royals fans the chance to select from the best players in the division and build and manage a winning team. There's £5,000 in cash up for grabs and, best of all, it's absolutely free to play! To get the most out of the game, select your team and then join Vital Football's very own Super League for Reading followers. So, as well as competing for the main £5,000 prize fund with everybody else up and down the country, you'll also be able to aim for the title of best fantasy manager amongst users of this site with some exclusive prizes for Vital users including 12 month subscriptions to 442 How to join the Vital Football League for Reading Fans Once you've registered, select the 'Join League' option from your My Team page and submit the following two bits of information: Super League name: Vital Reading Password: vital SELECT A TEAM NOW > Playing the game The game invites you, the manager, to pick a team of eleven players using an imaginary budget of £30million. The players you choose score points for you depending on their performances on the pitch in this season's Championship and FA Cup, starting on Saturday, August 9, 2008. Players score points for scoring goals, setting up goals (assists) and, for goalkeepers and defenders, preventing goals. All players lose points for red and yellow cards and missing penalties. The aim of the game is to score the highest number of points you can - the more points your team accumulates, the better your chances of winning one of the cash prizes. You can buy and sell players throughout the season, testing your skill in the transfer market. At the end of the game, the manager with the highest number of points wins £3,000. Simple as that. Click Here to select your free team. Register before 12.45pm on August 9 to score from the start., 10350=Season Preview- Cardiff (Monday July 27 2015), 10536=Season Preview- Charlton (Monday July 27 2015), 9783=Reading Vs Swansea- Preview (Friday July 24 2015), 11098=Season Preview- Fulham (Wednesday July 29 2015), 16335=Date:Friday July 18 2008}",
    "textBeforeTable": "League Table (view table) 1 Jason Treeby 1. Vital Members League (view all) //--> document.write(''); } window.adgroupid = Math.round(Math.random() * 1000); if (window.adgroupid == undefined) { Vital Reading Articles from 2015",
    "textAfterTable": "Reading Fixtures (view all) Birmingham City (a) Aug 8 2015 3:00PM Sky Bet Championship Colchester United (a) Aug 11 2015 7:45PM Capital One Cup Leeds United (H) Aug 16 2015 3:00PM Sky Bet Championship Sheffield Wednesday (a) Aug 19 2015 7:45PM Sky Bet Championship Milton Keynes Dons (H) Aug 22 2015 3:00PM Sky Bet Championship Brentford (a) Aug 29 2015 3:00PM Sky Bet Championship See all fixtures Report fixture change ",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}