{
    "relation": [
        [
            "Column",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15"
        ],
        [
            "Field Name",
            "Body",
            "Body name",
            "Date",
            "Transaction number",
            "Invoice Number",
            "Amount",
            "Supplier Name",
            "Supplier ID",
            "VAT Registration Number",
            "Expense Area",
            "Expense Type",
            "Expense Code",
            "BVACOP",
            "Proclass",
            "Extended Description"
        ],
        [
            "What Is Required",
            "The statistics.data,gov.uk URI that represents the authority, e.g. Lichfield District Council is http://statistics.data.gov.uk/id/local-authority/41UD",
            "Name of the authority",
            "The payment date as recorded in departments’ purchase or general ledger.",
            "A unique reference number for each individual expenditure transaction",
            "The reference number for the invoice if it is recorded on the accounts system",
            "The actual value of the transaction",
            "The full name of the supplier",
            "The internal ID of the supplier in the accounts system",
            "The supplier’s VAT registration number",
            "The Department or Directorate responsible for spending the money",
            "The description of the type of expenditure",
            "The internal account code which represents the Expense Type",
            "The BVACOP code for the transaction",
            "The Proclass code for the transaction",
            "A description in words for the details of the transaction"
        ],
        [
            "Reason For Inclusion",
            "To allow the file to be self-describing",
            "Aids readability for casual reading",
            "To identify the date that cost the transaction took place.",
            "To act as a reference number when dealing with enquiries or FOI requests.",
            "To allow matching to invoices (one payment may be for several invoices, and one invoice may be settled by several payments)",
            "To identify the full cost of the transaction.",
            "To identify the recipient of the spend",
            "To allow suppliers with same name to be distinguished form each other and allow matching of the same supplier even if the name is changed",
            "To identify and aggregate supplier information even if the supplier descriptions are not consistent",
            "To identify the area within the authority that has spent the money. The description needs to be meaningful and may possibly relate to the department’s organisational structure. This may be at directorate level or relate to the cost centre structure.",
            "To identify the general nature of the spend",
            "To allow expense types to be matched even when the wording of the description is changed",
            "To allow comparison of spending by finance category between periods and authorities",
            "To allow comparison of spending by finance category between periods and authorities, and to aid in connection to procurement data",
            "This might be stored as a commentary in the accounts system, and inclusion will help explain the payment"
        ],
        [
            "Additional Information",
            "Using a URI to identify the body means that it is uniquely identifiable to data users. The GLA should use the URI http://data.ordnancesurvey.co.uk/id/7000000000041441",
            "",
            "If it is not possible to source data using the payment date invoice input date or invoice date may be used The UK date format (DD/MM/YYYY) should be used. Leading zeros should be used where necessary so that the string is precisely 10 characters (e.g. 01/09/2010)",
            "The transaction number used in departments’ own systems may be used.",
            "Some councils have been discussing ultimately publishing invoices, and inclusion of this fields allows for an easy transition to this, should they do this.",
            "Amounts should be in sterling and inclusive of irrecoverable VAT. Values should be in pounds and pence. Each entry should include a decimal point and exactly two digits for pence. Pound or other currency signs must not be included. Income or other negative spend (eg corrections) should be show with a leading minus sign. Leading zeros should not be used. Commas should not be used to separate thousands of pounds. So, for instance, a payment of £25,123 should be shown as 25123.00 and a credit of £26,123.45 should be shown as -26123.45. If possible recoverable VAT should not be included and does not need to be shown separately. Expenditure needs to be published gross of any income. Where an invoice crosses multiple expense codes, the separate payment lines should be published even where they are individually worth less than £25,000. The amount should represent expenditure for an individual transaction and should not be cumulative.",
            "The name of the supplier named on departments’ own vendor record can be used. Where the same supplier has been recorded using different naming conventions, there is no need to aggregate. However these multiple versions will appear in the published record.",
            "",
            "Publishing the VAT number makes it much easier to match the supplier to external data, and thus makes comparisons across authorities much easier",
            "",
            "The description of expenditure used against account codes held on departments’ own finance systems should be suitable for this purpose e.g. consultancy, stationery. Descriptions should make sense and be suitable for the public domain.",
            "",
            "",
            "",
            ""
        ],
        [
            "Inclusion status",
            "Mandatory",
            "Mandatory",
            "Mandatory",
            "Mandatory",
            "Desirable",
            "Mandatory",
            "Mandatory",
            "Mandatory",
            "Desirable",
            "Mandatory",
            "Mandatory",
            "Desirable",
            "Desirable",
            "Desirable",
            "Desirable"
        ]
    ],
    "pageTitle": "Blogs | data.gov.uk",
    "title": "",
    "url": "http://data.gov.uk/blog/local-spending-data-guidance",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00137-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 63440527,
    "recordOffset": 63406029,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{60438=Eric Pickles, Speaking at LGA Conference, 6th July 2010, 6539=This guidance has been produced by the Local Public Data Panel, and builds on the draft guidance published in June this year by the panel, on comments made on that guidance, the Treasury guidance to central government departments on releasing their spending data, and experience from publishing the data, and, crucially, using and analysing it., 104154=The guidance suggests publishing from April 2010 - is this going to be the minimum cut off date or is it just guidance?  Some councils are publishing from April 2010 and some are starting from Sept 2010 with no intention of going back further - surely an agreed date should be necessary in order to offer a full comparison of all council spending over the same period.  If there is no requirement to publish from a specific date then there will be a mishmash of start dates resulting in 'incomplete' comparison., 78940=I will also be writing to my MP asking him to seek to ensure that at least the mandatory elements of the guidance are incorporated into the law requiring councils to publish each item of spending over £500 from January 2011. I am concerned that if the publication standards remain merely guidance councils will be free to ignore them, and without the guidence potential benefits of the government's aspirations will not be realised., 71209=If the argument is \"oh its confusing for english readers\" well why aren't you stipulating a \"12 Dec 2010\" format?, 59876=Extract from joint LGA / CLG press release 4th June 2010, endorsed by Eric Pickles. This press release makes no mention of the \"reuse of the data in innovative applications, mashups, visualisations and analysis\" as an Over-riding Principle., 80958=Is there actually going to be a \" law requiring councils to publish each item of spending over £500 from January 2011\"?  , 11071=The Secretary of State for Communities and Local Government has committed local authorities to publish items of spending over £500 by January 2011. We recommend that where possible data is provided from 1 April 2010. This will add value to the user and demonstrate commitment to complete transparency., 55201=No one can argue with transparency on how the publics hard earned taxes are spent, but we don't need to be lectured by faceless officials on what format to use. For the record my Council has already published the required information since April 2010. It appears to me that CSV is the preferred format as it allows it to be manipulated and then used by other outside bodies either for commercial reasons or to allow Central Government to do some nice graphs. This has nothing to do with being accountable to local taxpayers which should be at the heart of it., 5927=The document below (and attached to this blog post) contains draft guidance for Local Authorities on how to comply with the Prime Minister’s call to publish each financial transaction over £500 from January 2011. As the guidance is in draft format, we would welcome any comments, suggestions or questions you may have. You can either post your comments below or contact the Local Data Panel directly. We look forward to hearing your feedback to the draft guidance., 100388=See also the Local Government Group \"practitioners' guide\" published October 2010, 17395=Councils have also been told they are expected to start publishing new contract and procurement information from Jan 2011, and so all information linking procurement and accounts systems should be published, allowing spending to be linked to contracts and tenders. Procurement systems will also typically have much more information about suppliers (e.g. Company Number) than accounts systems and this will make it much easier for users of the data to identify them.}",
    "lastModified": "Thu, 30 Jul 2015 03:39:41 GMT",
    "textBeforeTable": "Appendix i: CSV file format All authorities should however publish a consistent Expense Type (i.e. the Service description), together with the ID identifying the Service (possibly the nominal code on the chart of accounts). data.gov.uk licence), and ideally both. The recommendation therefore is that local authorities where possible should publish whichever classification they can (subject to BVACOP being published under a licence compatible with the It is worth noting that these provide different classifications – BVACOP is an accounts classification, and Proclass procurement classification. It’s also important to say that while Proclass is published under an open licence, at time of writing BVACOP is not, and is therefore not suitable for use when publishing open data, although there has been talk that this will change. In order for spending to be comparable between periods and between local authorities it is important that it is clearly and consistently categorized. Depending on the accounts system this may be easy or quite difficult. There are two candidates for categorization – CIPFA’s BVACOP classification and the Proclass procurement classification system (which is widely used in local authority procurement systems). Service categorization This is the part of the entity that has spent the money. It should represent a meaningful part of your organisation structure or activity. This might be at directorate level, or another appropriate part of your organisation structure, possibly drawn from your cost centre structure. To aid transparency, it would be helpful if the",
    "textAfterTable": "Appendix ii: examples of data to be included The table below gives specific examples of transactions that should be included in publication. No. Examples of transactions that should be published Reason 1 Payments to other government and public sector bodies All transactions whether with other public or private sector bodies should be included 2 Payments to government or other third party service providers All transactions should be included 3 Payments to sole traders Business rather than personal expenditure 4 Payments for secondees Payment for service rather than personal or pay bill expenditure. However, if a secondee’s pay would become transparent, this should be redacted. 5 Travel and subsistence claims 6 Service charge element of pension contributions 7 Ex-gratia payments above contract price The full payment cost is required 8 Credit notes Needed to ensure correct transaction values have been recorded 9 Policy lending (other than to individuals, or funds management) Regarded as spend 10 Gifts Publishable under FOI 11 Rent and business rates Standard expenditure costs Appendix iii: examples of data to be excluded/redacted The main principles are expected to follow the exemptions provided by the Freedom of Information Act. Key redactions will relate to data that is protected under the Data Protection Act, particularly relating to children and vulnerable persons. Please",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}