{
    "relation": [
        [
            "Course #",
            "SYS 501",
            "SYS 581",
            "SYS 595",
            "SYS 605",
            "SYS 611",
            "SYS 625",
            "SYS 630",
            "SYS 631",
            "SYS 632",
            "SYS 633",
            "SYS 635",
            "SYS 636",
            "SYS 637",
            "SYS 638",
            "SYS 640",
            "SYS 645",
            "SYS 650",
            "SYS 655",
            "SYS 660",
            "SYS 667",
            "SYS 670",
            "SYS 675",
            "SYS 681",
            "SYS 703",
            "SYS 710",
            "SYS 725",
            "SYS 744",
            "SYS 750",
            "SYS 760",
            "SYS 800",
            "SYS 801",
            "SYS 810",
            "SYS 900",
            "SYS 960"
        ],
        [
            "Course Name",
            "Probability and Statistics for Systems Engineering This course is designed for students with a background in engineering, technology, or science that have not taken a class in statistics or need a refresher class. In this class we will apply probability and statistics throughout a system’s life cycle. Topics include the roles of probability and statistics in Systems Engineering, the nature of uncertainty, axioms and properties of probability models and statistics, hypothesis testing, design of experiments, basic performance requirements, quality assurance specification, functional decomposition, technical performance measurements, statistical verification, and simulation.",
            "Introduction to Systems Engineering The growing complexity of today’s engineered systems presents daunting challenges to those who are charged with creating, operating, enhancing and sustaining them throughout their lifecycles. While the components of these systems require no less design effort than in the past, attention to the components is not sufficient to ensure overall system success. This course focuses on the interactions between the elements of a complex system, the context within which they are designed and operate, and the relationships between the technical systems and the organizations that design them and the enterprises that they serve. Students develop the understanding of techniques and processes that can help them ensure that their individual contributions are not only excellent in themselves, but that they become part of a cohesive, successful whole. This course may not be applied toward a Master’s of Engineering in Systems Engineering or Engineering Management.",
            "Design of Experiments and Optimization This course is an application oriented with theoretical arguments approached from an intuitive level rather than from a rigorous mathematical approach. This course teaches the student how statistical analyses are performed while assuring the student an understanding of the basic mathematical concepts. The course will focus on \"real world\" uses of statistical analysis and reliability theory. The student will use the software to solve problems. Included in this course will demonstrate Markov modeling techniques. This course is a perquisite to the System Reliability and Life Cycle Analysis course.Syllabus",
            "Systems Integration This course will explore and discuss issues related to the integration and testing of complex systems. First and foremost, students will be exposed to issues relating to the formulation of system operational assessment and concept. Subsequently, functional modeling and analysis methods will be used to represent the system functionality and capability, leading to the packaging of these functions and capabilities into high-level system architecture. Specific focus will be given to issues of interface management and testability. The course will also address the related management issues pertaining to integrated product teams, vendors and suppliers, and subcontractors. In addition, selected articles will be researched to demonstrate the techniques explored in class. Syllabus Pre-Reading",
            "Simulation and Modeling This course emphasizes the development of modeling and simulation concepts and analysis skills necessary to design, program, implement, and use computers to solve complex systems/products analysis problems. The key emphasis is on problem formulation, model building, data analysis, solution techniques, and evaluation of alternative designs/ processes in complex systems/products. Overview of modeling techniques and methods used in decision analysis, including Monte Carlo and discrete event simulation is presented. Syllabus",
            "Fundamentals of Systems Engineering This course discusses fundamentals of systems engineering. Initial focus is on need identification and problems definition. Thereafter, synthesis, analysis, and evaluation activities during conceptual and preliminary system design phases are discussed and articulated through examples and case studies. Emphasis is placed on enhancing the effectiveness and efficiency of deployed systems while concurrently reducing their operation and support costs. Accordingly, course participants are introduced to methods that influence system design and architecture from a long-term operation and support perspective. Syllabus PreReading",
            "DAU Level I Certification Examinationion This will test the knowledge of students who have achieved the equivalent of Level I certification through the Defense Acquisition University or who have completed selected industry training programs. Typically students take 80 hours training for this certification level equivalent. Upon successful completion (graded pass/fail), students will be awarded 3 credits toward a Master of Engineering in Systems Engineering. Enrollment Form",
            "Level II Certification Examination This will test the knowledge of students who have achieved the equivalent of Level II certification through the Defense Acquisition University or who have completed selected industry training programs. Typically students take more than 160 hours training for this certification level equivalent. Upon successful completion (graded pass/fail), students will be awarded between 3 and 6 credits toward a Master of Engineering in Systems Engineering. Enrollment Form",
            "Designing Space Missions and Systems (Module version is SDOE 632) This course examines the real-world application of the entire space systems engineering discipline. Taking a process-oriented approach, the course starts with basic mission objectives and examines the principles and practical methods for mission design and operations in depth. Interactive discussions focus on initial requirements definition, operations concept development, architecture tradeoffs, payload design, bus sizing, subsystem definition, system manufacturing, verification and operations. This is a hands-on course with a focus on robotic missions for science, military and commercial applications.Syllabus",
            "Mission and System Design Verification and Validation This unique course gives students a hands-on opportunity to apply key principles of space systems engineering. In part 1 of the course, students are given a set of customer expectations in the form of broad mission objectives. Using state-of-the-industry mission design and analysis tools (provided), the task is to apply systems engineering process to define top-level system requirements and design key elements of the system. The end result will be a system design review during which students present and defend their design decisions. In part 2 of the course, students experience system realization processes first-hand by integrating, verifying, validating and delivering the shoe box-sized EyasSAT educational satellite. Lecture is combined with hands-on experience. From the part-level to the system level, students will implement a rigorous assembly, integration, verification and validation plan on real hardware and software applying \"test like you fly, fly like you test\" principles.",
            "Human Spaceflight This course provides the conceptual framework for developing space missions of human spacecraft starting from a blank sheet of paper. It describes and teaches the human space mission design and analysis process. The entire course is process oriented to equip each participant with practical tools to complete a conceptual design and analyze the impacts of evolving requirements. At the end of this course you will be better able to tie mission elements together and perform tradeoffs between system design and mission operations that must occur, during the early stages of planning, in order to deliver cost-effective results. Syllabus",
            "Space Launch and Transportation Systems This course provides an integrated view of space launch and transportation systems (SLaTS) design and operations. It analyzes customer needs, objectives and requirements, through launch and transportation system design, development, test and manufacturing to creating operations concepts and infrastructure capabilities. Lifecycle cost and the business case will be assessed. The thrust of this course is to identify technical risk and mitigate it in the most cost-effective manner, while maintaining the technical integrity of the vehicle(s) and infrastructure. In the course you will take a fresh look at space launch and transportation systems by emphasizing a process-oriented approach for creating cost-effective concepts to meet customer needs and objectives. This process describes how to translate SLaTS objectives, requirements, and constraints into viable and cost-effective operations concepts. Vehicle design presentations show practical, detailed approaches and tools to analyze and design manned and unmanned, reusable and expendable vehicles for both launch and interplanetary systems, including architecture and configuration, payloads, and vehicle subsystems. Course presentations on launch operations describe the functions to be performed, define and evaluate the key issues, help you develop an appropriate operations concept, and assess the complexity and cost of operations. Special emphasis is placed on describing the interrelationships and tradeoffs between system design and launch operations that must occur during the early stages of planning in order to deliver effective systems.",
            "Cost-Effective Space Mission Operations This course examines the real-world space mission operations. Taking a process-oriented approach, the course provides an in-depth view of the entirety of space mission operations, including the concept of operations and all functions that are performed in support of a space mission. Interactive discussions focus on initial requirements definition, operations concept development, functional allocation among spacecraft, payload, ground system and operators. A detailed model is provided that allows the user to estimate operations complexity and then prepare an estimate of the number of operators required and overall cost. This is a hands-on course with a focus on space missions for science, military and commercial applications.",
            "Crew Exploration Vehicle Design This unique course gives participants a hands-on opportunity to apply key principles of space systems engineering. Participants are given a set of customer expectations in the form of broad mission objectives for a crew exploration vehicle with the task of applying systems engineering process to define top-level system requirements and design key elements of the system. The end result will be a system design review during which students present and defend their design decisions. Course participants are given a set of mission objectives in the form of a Request for Proposal (RFP) or Announcement of Opportunity (AO) and divided into competing groups to conceptually design a viable crewed mission that meets the customer expectations at an acceptable lifecycle cost. The groups are guided through a structured space system engineering approach to define a mission concept and supporting space mission architecture, and complete a detailed analysis.",
            "System Supportability and Logistics The supportability of a system can be defined as the ability of the system to be supported in a cost effective and timely manner, with a minimum of logistics support resources. The required resources might include test and support equipment, trained maintenance personnel, spare and repair parts, technical documentation and special facilities. For large complex systems, supportability considerations may be significant and often have a major impact upon life-cycle cost. It is therefore particularly important that these considerations be included early during the system design trade studies and design decision-making. Syllabus",
            "Design for System Reliability, Maintainability, and Supportability This course provides the participant with the tools and techniques that can be used early in the design phase to effectively influence a design from the perspective of system reliability, maintainability, and supportability. Students will be introduced to various requirements definition and analysis tools and techniques to include quality function deployment, input-output matrices, and parameter taxonomies. An overview of the system functional analysis and system architecture development heuristics will be provided. Further, the students will learn to exploit this phase of the system design and development process to impart enhanced reliability, maintainability, and supportability to the design configuration being developed. Given the strategic nature of early design decisions, the participants will also learn selected multiattribute design decision and risk analysis methodologies, including Analytic Hierarchy Process (AHP). As part of the emphasis on maintainability, the module addresses issues such as accessibility, standardization, modularization, testability, mobility, interchangeability and serviceability and the relevant methods, tools, and techniques. Examples and case studies will be used to facilitate understanding of these principles and concepts. Syllabus",
            "System Architecture and Design This course discusses the fundamentals of system architecting and the architecting process, along with practical heuristics. Furthermore, the course has a strong \"how-to\" orientation, and numerous case studies are used to convey and discuss good architectural concepts as well as lessons learned. Adaptation of the architectural process to ensure effective application of COTS will also be discussed. In this regard, the course participants will be introduced to an architectural assessment and evaluation model. Linkages between early architectural decisions, driven by customer requirements and concept of operations, and the system operational and support costs are highlighted.Syllabus Pre-Readings",
            "Robust Engineering Design This course is designed to enable engineers, scientists, and analysts from all disciplines to recognize potential benefits resulting from the application of robust engineering design methods within a systems engineering context. By focusing on links between sub-system requirements and hardware/software product development, robust engineering design methods can be used to improve product quality and systems architecting. Topics such as Design and Development Process and Methodology, Need Analysis and Requirements Definition, Quality Engineering, Taguchi Methods, Design of Experiments, Introduction to Response Surface Methods, and Statistical Analysis of Data will be presented. Syllabus",
            "Decision and Risk Analysis This course is a study of analytic techniques for rational decision-making that addresses uncertainty, conflicting objectives, and risk attitudes. This course covers modeling uncertainty; rational decision-making principles; representing decision problems with value trees, decision trees and influence diagrams; solving value hierarchies; defining and calculating the value of information; incorporating risk attitudes into the analysis; and conducting sensitivity analyses. Syllabus",
            "Complex System Technologies and Application Domains This course serves as an overview of phenomenology and technologies associated with the development, design, construction, and life cycle management of network centric systems and systems of systems. The goal of this class is to provide the early career engineers and scientists who have been educated in a traditional academic disciplines, visibility into the interdisciplinary methods, processes, terminology, and tools needed to integrate these technologies into an operationally and cost effective adaptive network centric systems of systems.",
            "Forecasting and Demand Modeling Systems This course covers the theory and application of modeling aggregate demand, fragmented demand and consumer behavior using statistical methods for analysis and forecasting for facilities, services and products. It also aims to provide students with both the conceptual basis and tools necessary to conduct market segmentation studies, defining and identifying criteria for effective segmentation, along with techniques for simultaneous profiling of segments and models for dynamic segmentation. All of this provides a window on the external environment, thereby contributing input and context to product, process and systems design decisions and their ongoing management.Syllabus",
            "Dynamic Pricing Systems Dynamic pricing is defined as the buying and selling of goods and services in free markets where the prices fluctuate in response to supply and demand and changing. This course illustrates the difference between static and dynamic pricing, and covers various dynamic pricing models and methodologies for successful pricing. This course also illustrates the fact that effective pricing optimization is based on modeling of demand and elasticity of demand at a very granular level. It will explore various dynamic pricing models and explore and identify factors relevant in choosing dynamic pricing models that best support the operational effectiveness, external environment and business strategy of a particular firm.",
            "Dynamic Modeling of Systems and Enterprise The course introduces students to system dynamics models of business policy analysis and forecasting of associated management problems of complex systems and enterprise. The course covers advanced techniques of policy and strategy development applications: system thinking and modeling dynamics of growth and stability, including interaction of human factors with the technology. The tools of increasing power and complexity are offered for student’s business and management applications: causal feedback diagrams, technology process graphs, information processing flowcharts, decision scenarios. Students will get hands-on training in systems modeling by STELLA and AnyLogic software languages and perform their own case studies of real system of technology and/or business development. Prerequisite: Course in statistics.",
            "Curricular Practical Training International graduate students may arrange an educationally relevant internship or paying position off campus and receive Curricular Practical Training (CPT) credit via this course. Students must maintain their full time status while receiving CPT. Prior approval of the program director is required for enrollment. To justify enrollment, the student must have a concrete commitment from a specific employer for a specific project, and must provide to the program director for his/her approval a description of the project plus a statement from the employer that he/she intends to employ the student. This information must be provided to the program director with sufficient advance notice so that the program director has time to review the materials and determine if the project is appropriate. The project must be educationally relevant; i.e., it must help the student develop skills consistent with the goals of the educational program. During the semester, the student must submit written progress reports. At the end of the semester, the student must submit for grading a written report that describes his/her activities during that semester, even if the activity remains ongoing. The student must also present his/her activities in an accompanying oral presentation that is also graded. This is a one-credit course that may be repeated up to a total of three credits.",
            "Research Methodologies Research philosophy, ethics, and methodology will be discussed. Each student will, under the guidance of the instructor, formulate a problem, search the literature, and develop a research design. In addition, the student will examine and criticize research reports with specialemphasis on the statement of the problem, the sampling and measuring techniques that are used, and theanalyses and interpretation of the data. Emphasis is on applying research methodology to real-world organizational problems. Syllabus",
            "Advances in System of Systems Engineering The discipline of Systems Engineering (SE) provides us with necessary engineering and management guidance to successfully design and develop a system rather than focus on its separate individual components. However, due to the rapidly increasing complexity of today’s dynamic environment, we are faced with the need to engineer multiple integrated complex systems. In response to this emerging paradigm shift, a new discipline of System of Systems Engineering (SoSE) has evolved. This course serves as an overview of the advances in SoSE and provides the students the capability to apply this knowledge in the synthesis, analysis, and evaluation of activities during the lifecycle of a System of Systems (SoS) through case study analysis.",
            "Advanced Data Analysis for Data Mining and Knowledge Discovery This data driven course focuses on the subjects of both traditional and modern data analysis and mining techniques. The course emphasizes the analysis of business and engineering data using a combination of theoretical techniques and commercially available software to solve problems. Topics such as data analysis and presentation, linear and nonlinear regression, analysis of variance, factor analysis, cluster analysis, neural networks, and classification trees will be presented. The course will make extensive use of the Splus software packages. However, students will be encouraged to use a wide variety of industry standard data analysis and mining tools including SPSS, SAS, MATLAB, and BrainMaker.",
            "Advanced System and Software Architecture Modeling and Assessment This course presents the fundamentals of complex systems architecting using the Object Modeling Group’s (OMG) SysML. It addresses the differences between functional decomposition and object oriented decomposition while architecting complex systems. Emphasis is placed on modeling mission objectives to the definition of the system level architecture. Topics include identification of system level architecture alternatives and considerations, including definition of objectives for physical (hardware) and logical (software) structure, information and system assurance, behavior, cost, performance and human integration based on the system concept at every level of system decomposition. System of System (SoS) architecture is examined, addressing composition of multiple systems and engineering new, emergent behavior in the SoS. Examples used will come from a variety of operational environments (e.g. communications systems, space systems, weapon systems, etc) Special consideration is given to the importance of effective construction and transitioning of the SysML models to software engineering for software intensive systems projects.Syllabus",
            "Advanced Decision and Risk Analysis This course is the advanced study of analytic techniques for rational decision making that addresses uncertainty, conflicting objectives, and risk attitudes. This course covers advanced techniques for modeling uncertainty; values and risk preference. The advanced techniques for modeling uncertainty include Bayesian networks and the various approaches for both representing joint probability distributions and computing posterior distributions given new evidence. The techniques for modeling preferences address various degrees of preferential dependence among objectives. Finally, the risk preference techniques address non-exponential risk preference and the associated computation of value of information. These techniques are valuable as part of the risk management process, conduct of systems engineering trade-offs, and managing systems engineering projects",
            "Special Problems in Systems Engineering (ME) Three credits for the degree of Master of Engineering (Systems Engineering). This course is typically conducted as a one-on-one course between a faculty member and a student. A student may take up to two special problems courses in a master’s degree program. A department technical report is required as the final product for this course.",
            "Special Problems in Systems Engineering (PhD) Three credits for the degree of Doctor of Philosophy. This course is typically conducted as a one-on-one one investigation of a topic of particular interest between a faculty member and a student and is often used to explore topical areas that can serve as a dissertation. A student may take up to two special problems courses in a Ph.D. degree program. A department technical report is required as the final product for this course. Students enrolled in the SDOE program should enroll in course number SDOE 801.",
            "Selected Topics in Systems Engineering Selected topics from various areas within Systems Engineering. This course is typically taught to more than one student and often takes the form of a visiting professor’s course. Prerequisite: consent of instructor.",
            "Thesis in Systems Engineering (ME) A minimum of six credit hours is required for the thesis. Hours and credits to be arranged. Students enrolled in the SDOE program should enroll in course number SDOE 900.",
            "Research in System Engineering (PhD) Original work, which may serve as the basis for the dissertation, required for the degree of Doctor of Philosophy. A minimum of 30 hours of SYS 960 research is required for the Ph.D. degree. Students enrolled in the SDOE program should enroll in course number SDOE 960."
        ],
        [
            "Credit",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "1",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3"
        ],
        [
            "Lab",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Lecture",
            "3",
            "3",
            "0",
            "3",
            "3",
            "3",
            "3",
            "3",
            "0",
            "0",
            "3",
            "3",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "0",
            "3",
            "3",
            "0",
            "3",
            "3",
            "0",
            "3",
            "3",
            "0",
            "0",
            "3",
            "0",
            "0"
        ],
        [
            "Study Hours",
            "3",
            "0",
            "0",
            "3",
            "0",
            "3",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Courses | SSE - School of Systems & Enterprises",
    "title": "",
    "url": "http://www.stevens.edu/sse/academics/graduate/course-catalog?order=field_course_no&sort=asc",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00212-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 722628803,
    "recordOffset": 722575801,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{244759=© 2015 Stevens Institute of Technology. All rights reserved. Castle Point on Hudson, Hoboken NJ 07030-5991 USA +1.201.216.5000, 195897= This course covers the basics of Emerging Markets instruments, models, risks, hedging and trading practices. Emerging Markets have seen a dramatic increase in volume, especially since the latest crisis in the developed markets. Geographically the course will be focused on the 4 BRIC countries (Brazil, Russia, India and China) and Mexico. The student should develop a deep understanding of the main differences between Developed Markets and Emerging Markets risk and trading. Many of the unique attributes and models in Emerging Markets have now been adopted by Developed Markets since the 2008 crisis, given students an edge in understanding the latest trends in the markets. Main topics to be covered include: funding in EM; XC basis markets; OIS and local collateralization; Credit Valuation Adjustment (CVA); Extinguishable XC swaps; Inflation indexes and inflation currencies; Capital Constraints, Convertibility and Transferability.Prerequisites:  Probability, Statistics, and Calculus}",
    "lastModified": "Mon, 03 Aug 2015 17:14:49 GMT",
    "textBeforeTable": "Systems Security Engineering Socio-technical Systems Financial Engineering Software Engineering Engineering Management Systems Engineering } jQuery('#'+id).toggle(); { function showhide(id)",
    "textAfterTable": "Course # Course Name Credit Lab Lecture Study Hours EM 224 Informatics and Software Development This course deal with the challenges associated with the variety and volume of information encountered in today's workplace, and working with others in a software development environment.  Students will analyze and work with both structured and semi-structured data, using the python programming language.  Students will learn about the types of software development environments they are likely to encounter in their careers.  The capstone of the course is a small-group project that analyzes real-world data to answer a business or research question. 3 0 3 0 EM 275 Project Management This course presents the tools and techniques for project definition, work breakdown, estimating, resource planning, critical path development, scheduling, project monitoring and control and scope management. Students will use project management software to accomplish these tasks. In addition, the student will become familiar with the responsibilities, skills and effective leadership styles of a good project manager. The role organization design plays in project management will",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}