{
    "relation": [
        [
            "Asteroid",
            "2011 BZ11",
            "2011 BW11",
            "2011 AL37",
            "2011 BF10",
            "2011 BG24",
            "2011 BE24",
            "2003 YG118",
            "2000 PN9",
            "2002 DB4",
            "2008 UC202",
            "2009 UK20",
            "2008 FU6",
            "2003 YT1"
        ],
        [
            "Date(UT)",
            "Jan 22",
            "Jan 25",
            "Jan 26",
            "Jan 30",
            "Jan 30",
            "Feb 3",
            "Feb 20",
            "Mar 10",
            "Apr 15",
            "Apr 27",
            "May 2",
            "May 5",
            "May 5"
        ],
        [
            "Miss Distance",
            "4.8 LD",
            "0.3 LD",
            "2.2 LD",
            "9.1 LD",
            "5.9 LD",
            "9.3 LD",
            "67.7 LD",
            "45.5 LD",
            "62.5 LD",
            "8.9 LD",
            "8.6 LD",
            "75.5 LD",
            "65.3 LD"
        ],
        [
            "Mag.",
            "25.7",
            "28.5",
            "24.2",
            "27.3",
            "25.9",
            "25.4",
            "17.0",
            "16.1",
            "16.4",
            "28.2",
            "26.4",
            "17.9",
            "16.1"
        ],
        [
            "Size",
            "31 m",
            "9 m",
            "60 m",
            "14 m",
            "23 m",
            "35 m",
            "1.8 km",
            "2.6 km",
            "2.2 km",
            "10 m",
            "23 m",
            "1.2 km",
            "2.5 km"
        ]
    ],
    "pageTitle": "Spaceweather.com Time Machine",
    "title": "",
    "url": "http://spaceweather.com/archive.php?view=1&day=31&month=01&year=2011",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 59,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00015-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 221786546,
    "recordOffset": 221770152,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6422=UPDATED: January 2011 Aurora Photo Gallery [previous Januaries: 2010, 2009, 2008, 2007, 2005, 2004], 6962=Researchers call this a \"coronal hole.\" Solar rotation is turning the coronal hole toward Earth. The stream of solar wind pouring from it will swing around and hit our planet in early February, possibly sparking polar magnetic storms. High-latitude sky watchers should be alert for auroras between Feb. 2nd and 4th., 8108=NO LEGS, NO PROBLEM: NASA's Robonaut 2 (\"R2\") doesn't have legs yet, but that isn't stopping the humanoid robot. R2 is set to leave Earth in February to join the crew of the International Space Station. Legs will follow R2's busy torso on a later flight. Get the full story from Science@NASA., 5327=V-TOPPED LIGHT PILLARS: Light pillars are a common sight around cities in winter. Urban lights bounce off ice crystals in the air, producing tall luminous columns sometimes mistaken for auroras. But the light pillars Mike Hollingshead saw on Jan. 26th near a corn mill in Blair, Nebraska, were decidely uncommon. \"They had V-shaped tops,\" he explains, \"and some of the Vs were nested.\" Here is what he saw:, 7598=CORONAL HOLE: A dark croissant-shaped hole has opened up in the sun's atmosphere, and it is spewing a stream of solar wind into space. NASA's Solar Dynamics Observatory took this picture of the vast opening during the early hours of Jan. 31st:}",
    "textBeforeTable": "Recent & Upcoming Earth-asteroid encounters: 1185 potentially hazardous asteroids. On January 31, 2011 there were new onesPHAs all the time. ) are space rocks larger than approximately 100m that can come closer to Earth than 0.05 AU. None of the known PHAs is on a collision course with our planet, although astronomers are finding Potentially Hazardous Asteroids ( Near Earth Asteroids   Solar Eclipse Photo Gallery [NASA: Hinode Observes Annular Solar Eclipse] \"The flares are a form of the upper tangent arcs that we sometimes see in daytime halo displays,\" he continues. \"But even more exotic, some flares have a second one nested within them! Some ice crystal columns do not rotate but instead keep two of their prism faces improbably horizontal to give us the very uncommon Parry arcs of solar halo displays. The nested flares here are amazing and probably the light halo equivalent of Parry arcs.\" \"These light",
    "textAfterTable": "Notes: LD means \"Lunar Distance.\" 1 LD = 384,401 km, the distance between Earth and the Moon. 1 LD also equals 0.00256 AU. MAG is the visual magnitude of the asteroid on the date of closest approach.   Essential web links NOAA Space Weather Prediction Center   The official U.S. government space weather bureau Atmospheric Optics   The first place to look for information about sundogs, pillars, rainbows and related phenomena.",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}