{
    "relation": [
        [
            "Date",
            "Jul 20, 1999",
            "Mar 22, 2004",
            "Apr 17, 2008",
            "Aug 15, 2008",
            "Jan 31, 2011",
            "Apr 17, 2012",
            "Mar 6, 2015"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: THERMAL CORP., DELAWARE Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:NORTH, MARK T.;ROSENFELD, JOHN H.;MUTH, DAVID L.;AND OTHERS;REEL/FRAME:010119/0761 Effective date: 19990720",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Owner name: NATIONAL PENN BANK,PENNSYLVANIA Free format text: SECURITY AGREEMENT;ASSIGNORS:THERMAL CORP.;FSBO VENTURE ACQUISITIONS, INC.;REEL/FRAME:021398/0300 Effective date: 20080430",
            "Owner name: SOVEREIGN BANK, PENNSYLVANIA Free format text: SECURITY AGREEMENT;ASSIGNORS:THERMACORE, INC.;THERMAL CORP.;REEL/FRAME:026039/0865 Effective date: 20101230",
            "Year of fee payment: 12",
            "Owner name: PINE STREET CAPITAL PARTNERS II, L.P., NEW YORK Free format text: SECURITY INTEREST;ASSIGNOR:THERMAL CORP.;REEL/FRAME:035134/0363 Effective date: 20141113"
        ]
    ],
    "pageTitle": "Patent US6131650 - Fluid cooled single phase heat sink - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US6131650?dq=3691140",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 464174715,
    "recordOffset": 464155130,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations For example various attachment holes and fixtures can be attached to lid 18 or pan 12, and fluid access holes could be located on other surfaces of lid 18. Moreover, porous pad 14 can be constructed with different materials such as ceramic, with different structures such as screen, metal felt, and foamed metal, or with particles bonded together by methods other than sintering. It is to be understood that the form of this invention as shown is merely a preferred embodiment. Various changes may be made in the function and arrangement of parts; equivalent means may be substituted for those illustrated and described; and certain features may be used independently from others without departing from the spirit and scope of the invention as defined in the following claims. The heat sink of the present invention thereby provides improved cooling of heat generating devices, although it is constructed of a minimum number of simple parts. This variation in the cross section area of the liquid flow path through porous pad 52 causes a variation in the velocity of the liquid flowing through porous pad 52, so that the liquid flow increases velocity as it moves toward output channels 60. This increase in velocity means that when the liquid is coolest, as it enters porous pad 52, it will be moving slowest, and when the liquid is the warmest, as it leaves porous pad 52, it will be",
    "textAfterTable": "1 J.H. Rosenfeld, J.E. Lindemuth, M.T. North, and R.H. Goulding, \"Innovative Technologies For Faraday Shield Cooling\", 16th IEEE/NPSS Symposium, Oct. 1, 1995. 2 * J.H. Rosenfeld, J.E. Lindemuth, M.T. North, and R.H. Goulding, Innovative Technologies For Faraday Shield Cooling , 16th IEEE/NPSS Symposium, Oct. 1, 1995. 3 J.M. Rosenfeld and M.T. North, \"Porous Media Heat Exchangers for Cooling of High-power Optical Components\", Optical Engineering, vol. 34, No. 2, pp 335 (Feb. 1995). 4 * J.M. Rosenfeld and M.T. North, Porous Media Heat Exchangers for Cooling of High power Optical Components , Optical Engineering, vol. 34, No. 2, pp 335 (Feb. 1995). * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US6405792 Jul 24, 2001 Jun 18, 2002 Thermal Corp. Compact fluid to fluid heat exchanger US6684637 * Jan 25, 2002 Feb 3, 2004 Sunpower, Inc. Parallel slot heat exchanger",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}