{
    "relation": [
        [
            "Cited Patent",
            "US3213370 *",
            "US3348152 *",
            "US3555427 *",
            "US3604004 *",
            "US3646443 *",
            "US3750178 *",
            "US3783385 *",
            "US3863257 *",
            "US4057758 *",
            "US4101893 *",
            "US4166275 *"
        ],
        [
            "Filing date",
            "Mar 13, 1961",
            "Mar 23, 1964",
            "Feb 1, 1968",
            "Feb 10, 1969",
            "Oct 1, 1968",
            "May 22, 1959",
            "Nov 28, 1972",
            "Jun 27, 1972",
            "Oct 2, 1975",
            "Aug 5, 1977",
            "Aug 18, 1977"
        ],
        [
            "Publication date",
            "Oct 19, 1965",
            "Oct 17, 1967",
            "Jan 12, 1971",
            "Sep 7, 1971",
            "Feb 29, 1972",
            "Jul 31, 1973",
            "Jan 1, 1974",
            "Jan 28, 1975",
            "Nov 8, 1977",
            "Jul 18, 1978",
            "Aug 28, 1979"
        ],
        [
            "Applicant",
            "Ibm",
            "Di Losa Vincent J",
            "Raytheon Co",
            "Edward M Buyer",
            "Raytheon Co",
            "Itt",
            "Itt",
            "Us Air Force",
            "Nippon Telegraph And Telephone Public Corporation",
            "The United States Of America As Represented By The Secretary Of The Navy",
            "Digital Marine Electronics Corporation"
        ],
        [
            "Title",
            "Signal selecting system with switching at the interstice between data increments",
            "Diversity receiving system with diversity phase-lock",
            "Digital diversity reception system",
            "Dual frequency radio apparatus for data transmission and direction finding",
            "Multiaperture receiving and transmitting system",
            "Radio location detection system",
            "Digital diversity combiner",
            "Passive ranging by time difference multi-path",
            "Mobile diversity radio communication system",
            "Aircraft landing aid for zero-zero visibility landings",
            "Loran receiver system"
        ]
    ],
    "pageTitle": "Patent US4334314 - Transmission of time referenced radio waves - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4334314?ie=ISO-8859-1&dq=7,346,545",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042985647.51/warc/CC-MAIN-20150728002305-00138-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 480469923,
    "recordOffset": 480432040,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95046=In FIG. 13f it appears that the channel A is giving a strong signal S whilst the channel B is giving a disturbed signal of distinctly weaker amplitude, S/30, for example. This state of things is found again at the output from the filter 2121 (FIG. 13h). The rectified signal (13i), given by the rectifier circuit 213 is much stronger during the timing segments associated with the channel A. Hence the automatic gain control as in the other embodiments is sensitive above all to the undisturbed signal from this channel., 101515=The time base 1113 is connected (connection not shown) to the transmitter 1110 coupled to the antennae 1101 through the duplexer 1001. For reception the latter connects the antenna to the receiver amplifier 1211 which is associated with its automatic gain control 1204., 100028=A clock 1260 measures the time separation between the output 12523 and the origin time base 1113. From it in known manner is deducted the propagation time Tp, with an ambiguity equal to the period TR of this time base. This ambiguity may be removed at least partially by means of techniques which are likewise known., 94075=On the other hand the time discrimination is different from that as FIG. 9. In the present case the output from the delay circuit 252 of frequency 2/τ controls another modulator by phase reversal 2320 which receives at its input the output from the first modulator 2120. Its output is applied to another coherent integrating filter circuit 2321. Finally a multiplier 254 multiplies the outputs from the two coherent integrating filters 2121 and 2321. Preferably the multiplier 254 provides the non-linear characteristic suitable for favouring the stronger signals. One skilled in the art will understand that the output from the multiplier 254 represents the time separations between the local timing-mark and the timing-mark received, just as the discriminator 254 in FIG. 9 did. After that the output from the circuit 254 feeds the integrating filter circuits 256 of the time tracking loop which in turn adjusts the delay θ in the delay circuit 252., 51584=The negative or positive signals thus obtained are applied to an integrating filter circuit 256 which controls the delay in the circuit 252 and forms with it a delay correction loop. The circuit 256 comprises, for example, two consecutive stages of filtration in order to achieve a second order filtration, one of these filters (often the first) being corrected so as to avoid instabilities in the delay correction loop. In that way the delay in the circuit 252 is permanently corrected as a function of the high-frequency pulses received. The result is at the output from the delay circuit (output 2523, FIG. 2h) a timing mark synchronous with that from the transmitter but shifted in phase by the propagation time Tp and written T1 +Tp +K.TR., 102585=Hence the \"receiving\" portion of the interrogator 1000 is sub-divided after the amplifier 1211 into n channels assigned respectively to the n responders. Each channel includes the decoder 1212 followed by the non-linear circuit 1213. The output from the latter is applied to the integrating filter circuit 1203 as well as to the time discriminator 1254 which forms the tracking loop with its integrating filters 1256 and the controlled delay circuit 1252 connected to the time base 1113. Finally in each channel a switch such as 1801 fed by the signal X1 for the channel 1 blocks the delay circuit 1252 outside the signal X1, that is to say, outside the moments when the channel 1 is cooperating with the responder R1., 92777=The output from the delay circuit 252 is divided by two (in frequency), which restores the frequency 1/τ of the transmission, which is then applied to a pseudo-random code generator 2511 like that in the transmission., 96368=A local timing-mark may be defined in the same way: another pseudo-random code generator 261 like the first one 2511 is connected to the output from the clock 251 across the divider of frequency by two 262; the same decoding is carried out on the code generator 261 as on the first one 2511, which gives the timing-mark local to the receiver, T2 +P.TR. Finally, as previously, a clock 260 measures the separation between the two timing-marks. Of course numerous variants exists as to the way of employing the timing-mark received as contained in the code generator 2511., 99466=Thus in the interrogator 1000 the duplexer 1001 connects the antenna to a receiving unit as in FIG. 9. The receiving unit includes the receiving chain 1211 to 1213, the automatic gain control loop 1203 and 1204, and the time tracking loop 1252, 1254 and 1256. The timing-mark output 12523 from the circuit 1252 provides the timing-mark initially transmitted, delayed by twice the propagation time Tp, by the possible delay D due to the circuit 2002 in the responder and small delays which are known, due to the circuits themselves., 49298=A controlled delay circuit 252 produced different forms of pulses shifted in phase by the same variable delay as the pulses of the time base 251. An output 2521 from this circuit supplies pulses of the same duration as the transmitted high-frequency pulses. FIG. 2d illustrates the form of these pulses on the time scale of FIGS. 2a to 2c. FIGS. 2e, 2f and 2h give enlarged representations corresponding with the outputs from the circuit 252, while FIG. 2g gives an enlarged representation corresponding with the output from the detector 213., 107989=Thus, for example, instead of exploiting the installation as FIG. 16 in the hyperbolic mode the position of the receiver RP may be determined by solving the matrix equation of the n measurements contained in the registers such as 1811 (determination of two-dimensional position coordinates by the method of \"pseudo-distances\"). This method yields as a supplementary result the separation between the original timing-mark To (+KTR) and the local timing-mark T1 (+K\".TR), as soon as there are at least 3 stations available. This time separation is known with an accuracy which depends upon the validity that may statistically be granted to each measurement. Knowing this time separation, the receiver RP can then reconstitute a local timing mark which is synchronous with the original mark., 97573=FIG. 14 illustrates a connection out and back between an interrogator 1000 and a responder 2000., 105832=Hence in the registers connected to the output from the clock 1260 will be found Tpo +To -T (register 1811), Tp1 +To -T1, Tp2 +To -T1, . . . Tpn +To -T1. The receiver RP has not in general available the timing mark To employed by the transmitter Eo and the fixed responder R1 . . . Rn. In this case, by forming the difference between the contents of the registers, To -T1 disappears and one obtains Tpo -Tp1, Tpo -Tp2 and all of the differences of the same species. These differences in propagation time correspond with differences in distances of the receiver RP with respect to the stations Eo, R1, R2 . . . Rn. The receiver RP can determine its position by intersection of networks of hyperbolic position lines (hyperbolic radio-navigation)., 98369=For its part the responder 2000 also includes circuits like those in FIG. 7. Two antennae 2201 and 2202 are connected alternately by a switch 2205 to a duplexer 2001. The latter feeds in particular a receiving unit like that in FIG. 7 (components 2203 and 2204, 2211 to 2213 and 2251 to 2256)., 103333=All of the automatic gain control integrating filter circuits such as 1203 are connected by a series of switches (reacting to the signals X1 to Xn) to the input to the circuit 1204. Otherwise when it is not blocked (hence X1 . . . Xn in turn) each delay circuit such as 1252 applies its output to the clock 1260 which compares it with the time base 1113. As previously indicated the time separation measured each time by the clock is representative of the values 2.Tp1,2.Tp2, . . . 2.Tpn, during the successive moments X1, . . . Xn. A final set of switches brings the values measured to a series of storage registers such as 1811., 104457=FIG. 16 illustrates another example of application. The transmitter Eo is that having two antennae as FIG. 9. Responders R1 to Rn likewise having two antennae respond to this transmitter each in turn as for FIG. 15. Their signals are collected by a pure receiving station RP like the interrogator 1000 in FIG. 15 but without the transmitter 1110 or, consequently, the duplexer 1001. The transmitter and responders are fixed (or have known positions). Hence the transit times of the waves between Eo and R1,R2, . . . Rn are known, which are written C1,C2, . . . Cn., 91980=It has previously been seen that the clock 1130 operates at a period τ which is a sub-multiple of that TR of the time base. A divider of frequency by 2n -1, designated by 1131, restores the time base T1 +K.TR (FIG. 13d). As in FIG. 9 this feeds the remainder of the transmitter device, in particular the switching of the antennae 101 and 102 (FIG. 13e). In practice instead of a divider by 2n -1, decoding of the content of the register 1120 may be employed., 49860=The decoder 212 is here a simple switch which carries out a correlation between the high-frequency pulse received (FIG. 2b) and the output 2521 from the delay circuit 252. Insofar as the delay is suitably adjusted the correlation is total, the two signals coincide and hence the decoder lets pass the whole of the high-frequency pulse received and suppresses the noise present between the pulses. Otherwise a portion of the high frequency pulse received is removed because the closure of the switch 212 does not coincide exactly with this pulse. After that the detector 213 rectifies the whole or the remaining portion of the high-frequency pulse received, as the case may be., 93014=The output from the receiver amplifier 211 (FIG. 13f) is applied to a decoder circuit 212 consisting first of all of a modulator by phase reversal 2120 controlled by the code output from the code generator 2511 (FIG. 13g), and then of a coherent integrating filter circuit 2121 (output illustrated in FIG. 13h). The latter consists, for example, of an L-C filter tuned to its input frequency, the time constant of which is preferably at least equal to TR. In practice because of the wide separation between the frequency of the carrier signal and that (1/TR) of the timing-marks, one or more frequency changes are advantageously employed before decoding (this is valid also with other types of coding, in particular with pulse compression codes)., 100386=In practice the transmission out between the interrogator 1000 and the responder 2000 and the transmission back between the responder 2000 and the interrogator 1000 are carried out over different high carrier frequencies or else in shared time over the same carrier frequency under the control of their respective time bases 1113 and 2251. In the latter case a delay D sufficient for the response is employed by means of the circuit 2002., 96039=Thus the local pseudo-random code generator circuit 2511 contains the timing mark received. It may be found again in the time base form T1 +Tp +K.TR by carrying out a predetermined decoding of the different stages of the shift register incorporated in the code generator 2511., 97689=The interrogator 1000 includes a transmission time base 1113 the timing-mark of which is T1 +K.TR. It is connected to a transmission circuit 1110 which combines the functions of coding (112, FIG. 7) and amplification of transmission (111, FIG. 7). A duplexer 1001 couples the output from the transmission circuit 1110 to the sole transmission antenna 1101. (It will be observed that by removing the thousands digit the numerical references of components already described are often found again; in what follows they will not all be described in detail again). These circuits of the interrogator 1000 effect the transmission as for FIG. 7., 50762=For this purpose the output from the detector 213 (FIG. 2g) is applied of one input to a time discriminater 254. In one embodiment the latter receives as its other input a bipolar signal supplied by the output 2522 from the circuit 252. This bipolar signal (FIG. 2f) has a negative portion followed by a positive portion, symmetrical with one another. The transition between them coincides with the centre of the signal given by the output 2521. The time discriminator multiplies the output from the detector 213 by the bipolar signal 2522. Hence the output from the time discriminator will be positive or negative according to whether the rectified pulse leaving the detector 213 is late or early with respect to the output from the delay circuit 252. It will be zero in the case of exact coincidence., 105266=The clock 1260 in the pure receiver RP will make time measurements with respect to the local mark T1 +K\"TR defined by the time base 1113., 88800=FIG. 11e illustrates the output from such a decoder. After processing by the tracking loop the signal of FIG. 11g is obtained as the output 2523 from the circuit 252. For its part the output from the time base 251 in the receiver is illustrated in FIG. 11f. And the clock 260 (FIG. 9) will now provide a time separation increased by the constant delay θ due to the decoder or T1 +Tp +θ-T2 +(K-P)TR (FIG. 11g)., 101804=On the other hand a register 1800 connected to the time base 1113 produces n reception control signals separated in time, designated by X1 to Xn; the signals X1 to Xn define n reception time spans assigned respectively to the n responders for the interrogation and the response of each of them. For example, between the instant O and the instant TR the responders R1 is interrogated; from TR to 2.TR it is R2 and so on until the last one Rn between the instant (n-1).TR and n.TR. The cycle is then repeated periodically. Recognition by the various \"responder\" stations of the interrogations which are particularly assigned to them may be realized by well known means of synchronization or coding., 99096=Thus the timing-mark received by the responder 2000 (output 22523 from 2252) is sent by its transmitter 2110., 98682=Instead of being applied to a clock, the output 22523 from the circuit 2252 feeds in its turn a transmitter unit 2110 (like 1110), if necessary through a circuit 2002 which defines a constant delay D. The transmitter 2110 is also coupled to the duplexer 2001 in order to feed the antennae 2201 and 2202 alternately through the switch 2205 controlled by the divider 2206 from the time base 2251., 100844=Such a connection out and back may be made general to a number of responders as shown in FIG. 15 where responders R1,R2,R3, . . . Rn may be distinguished, built in the same way as the responders 2000 in FIG. 14. In order to simplify the drawing only the two antennae and the switch associated with each responder are illustrated. By Tp1, Tp2,Tp3 . . . Tpn are designated the respective propagation times of the waves between the responders R1,R2,R3, . . . Rn and the interrogator 1000., 91025=At the transmission end the clock 1130 now defines a frequency f=1/τ (13a) where τ is a sub-multiple of the period TR. This clock 1130 feeds a pseudo-random code generator 1120 consisting of a shift register of n stages, the input to which is fed by a logical combination from at least two of its intermediate stages. In such cases τ must satisfy the relationship TR =(2n -1).τ. The logical combination in question or else any one chosen in advance, of the stages of the register 1120 (FIG. 13b) feeds a phase modulator 1121 which produces a signal intended for the transmission and modulated in phase according to the output from the pseudo-random code generator (FIG. 13c). It will be assumed here that it is a question of modulation by phase reversal. Otherwise modulation may be effected over a signal of intermediate frequency which a change in frequency then brings to the transmission frequency., 99225=Between the latter and a receiving unit incorporated in the interrogator 1000 the antennae 2201 and 2202 (now transmission) and the antenna 2101 (now reception) define a space-diversity connection, this time as in FIG. 9.}",
    "textBeforeTable": "Patent Citations The present invention by enabling satisfactory transmission very much beyond the horizon, of a timing-mark, considerably enriches the possibilities of measurement of propagation time and/or of distance, and more generally the possibilities of terrestrial transmission (ground-to-ground) of time information. Thus, for example, instead of exploiting the installation as FIG. 16 in the hyperbolic mode the position of the receiver RP may be determined by solving the matrix equation of the n measurements contained in the registers such as 1811 (determination of two-dimensional position coordinates by the method of \"pseudo-distances\"). This method yields as a supplementary result the separation between the original timing-mark To (+KTR) and the local timing-mark T1 (+K\".TR), as soon as there are at least 3 stations available. This time separation is known with an accuracy which depends upon the validity that may statistically be granted to each measurement. Knowing this time separation, the receiver RP can then reconstitute a local timing mark which is synchronous with the original mark. The same applies for any of the variants upon coded transmission previously described, especially in Section III as well as with reference to FIGS. 9 and 11 combined and 12 and 13 combined. FIGS. 14 to 16 illustrate simple cases, non-restrictively. Thus the stations called fixed may, for example, be moved provided that their positions are known to the moving object which is determining its position (during or after the measurements). Any of the",
    "textAfterTable": "* Cited by examiner Non-Patent Citations Reference 1 Elements of the ATA Collision Avoidance System; Shear IEEE Trans. on Aeroce & Electronic Systems; VolAES-4, #2; pp. 295-304, 3/68. 2 * Elements of the ATA Collision Avoidance System; Shear IEEE Trans. on Aeroce & Electronic Systems; VolAES-4, #2; pp. 295-304, 3/68. * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US4423419 * Oct 20, 1980 Dec 27, 1983 Megapulse Incorporated Pulsed, pseudo random position fixing radio navigation method and system and the like US4607257 * Dec 27, 1982 Aug 19, 1986 Nippon Electric Co. Ltd. Remote calibrating system for satellite time US5899957 * Mar 10, 1997 May 4, 1999 Trimble Navigation, Ltd. Carrier phase differential GPS corrections network",
    "hasKeyColumn": true,
    "keyColumnIndex": 4,
    "headerRowIndex": 0
}