{
    "relation": [
        [
            "Date",
            "Dec 8, 2005",
            "Apr 14, 2006",
            "May 15, 2008",
            "May 19, 2008",
            "Dec 23, 2008",
            "Dec 22, 2009",
            "Feb 9, 2010",
            "Jun 22, 2011",
            "Dec 1, 2011",
            "Dec 1, 2011",
            "Jun 24, 2015"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "AS",
            "RR",
            "RR",
            "RR",
            "FPAY",
            "SULP",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Request for reexamination filed",
            "Request for reexamination filed",
            "Request for reexamination filed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: THE RUSSELL WHITE LLC, TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:IMES, KEVIN R.;WHITE, RUSSELL W.;REEL/FRAME:016870/0669 Effective date: 20040602",
            "Owner name: AFFINITY LABS, LLC, TEXAS Free format text: CHANGE OF NAME;ASSIGNOR:THE RUSSELL WHITE, LLC;REEL/FRAME:017472/0406 Effective date: 20040602",
            "",
            "",
            "Effective date: 20081107",
            "Effective date: 20090922",
            "Effective date: 20091113",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7324833 - System and method for connecting a portable audio player to an automobile ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7324833?dq=5893120",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00014-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475220603,
    "recordOffset": 475187588,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{39707=The first commercial radio stations in the United States began operation around 1920. Today, there may be as many as 12,000 radio stations in the United States programming in several distinct formats. When broadcasting their respective signals, these radio stations often use an analog signal, which may be modulated based on frequency or amplitude. Frequency modulated (FM) radio appears to be the dominant entertainment medium while amplitude modulated (AM) radio seems to be a popular outlet for news and information., 41337=Canada proposed using the L-Band for digital radio as early as 1992. Several countries throughout the world have since agreed to use the L-Band for digital radio with one notable exception. It appears the United States has chosen not to operate its digital radio within the L-Band. In the United States, the L-Band may already be committed for military uses. Apparently, the United States plans to adopt a system called in-band on-channel, or IBOC, which fits within the AM and FM frequencies., 40834=Some countries, like Canada and many European countries, may choose to have digital radio operate in a single digital radio band such as the L-band between 1452-1492 megahertz (MHz). This band would allow the reception of both terrestrially and satellite-originated signals. By comparison, FM radio typically operates between 88 and 108 MHz while AM radio typically operates between 0.525 and 1.705 MHz. Neither of these bands allows for easy transmission via satellite., 39204=This is a continuation application of U.S. patent application Ser. No. 09/537,812 filed on Mar. 28, 2000, now U.S. Pat. No. 7,187,947, Issued Mar. 6, 2007, the entirety of which is incorporated herein by reference in its entirety., 82507=In another embodiment, homepage 401 may allow a user to select when to download the information to an electronic device. For example, a user may want to listen to a certain genre of music at a specific time of day thereby allowing a user to select the information. As such, a user may select a different playlist for every day of the week thereby allowing a user to listen to different songs on different days of the week. The user can further identify when the selected playlist should be available for listening. For example, if a user wanted to listen to “playlist #1” on Monday morning during the drive into work between 8:00 am and 9:00 am, the user would enter the time and the day “playlist #1” would be available for listening. In this manner, the playlist may be communicated to the electronic device thereby allowing a user to listen to selective audio information at a desirable time.}",
    "textBeforeTable": "Patent Citations The benefits, advantages, solutions to problems, and any element(s) that may cause any benefit, advantage, or solution to occur or become more pronounced are not to be construed as a critical, required, or essential feature or element of the present invention. Accordingly, the present invention is not intended to be limited to the specific form set forth herein, but on the contrary, it is intended to cover such alternatives, modifications, and equivalents, as can be reasonably included within the spirit and scope of the invention as provided by the claims below. The audio files may be remotely or locally communicated to electronic device 907 and upon coupling to audio system 901, the audio files may be transmitted to audio system 901 in a form receivable by audio system 901. Although the disclosed embodiments have been described in detail, it should be understood that various changes, substitutions and alterations can be made to the embodiments without departing from their spirit and scope. In another embodiment, a radio manufacturer may provide interface 904 as a standard interface integrated into the audio system, thereby allowing communication between electronic device 907, audio system 901 and/or console 900. Electronic device 907 may include a plurality of different types of devices. For example, electronic device 907 may include a PDA device operable to store selected audio information. The information may be either remotely downloaded using an Internet web browser",
    "textAfterTable": "Jul 20, 1999 May 9, 2000 James Buchheim Portable digital player compatible with a cassette player US6088730 Jan 12, 1998 Jul 11, 2000 International Business Machines Corporation Methods and apparatus for downloading data between an information processing device and an external device via a wireless communications technique US6144848 Jun 7, 1996 Nov 7, 2000 Weiss Jensen Ellis & Howard Handheld remote computer control and methods for secured interactive real-time telecommunications US6167253 Dec 24, 1997 Dec 26, 2000 Bell Atlantic Network Services, Inc. Mobile data/message/electronic mail download system utilizing network-centric protocol such as Java US6199076 Oct 2, 1996 Mar 6, 2001 James Logan Audio program player including a dynamic program selection controller US6230322 * Nov 5, 1997 May 8, 2001 Sony Corporation Music channel graphical user interface US6232539 * Oct 18, 1999 May 15, 2001 Looney Productions, Llc Music organizer and entertainment center US6236832 Jan 14, 2000 May",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}