{
    "relation": [
        [
            "Citing Patent",
            "US6185642",
            "US6266731 *",
            "US6336159 *",
            "US6449677 *",
            "US6463490 *",
            "US6557068 *",
            "US6598103",
            "US6601121",
            "US6609171",
            "US6633588 *",
            "US6680631",
            "US6742160",
            "US6745369",
            "US6804735",
            "US6807592",
            "US6816934 *",
            "US6880031",
            "US6907487",
            "US6948017 *",
            "US7085889",
            "US7099986",
            "US7464207",
            "US7587542",
            "US7606960 *",
            "US20010037424 *",
            "US20040123178 *",
            "US20050033893 *",
            "EP1246044A1 *"
        ],
        [
            "Filing date",
            "Jul 15, 1998",
            "Sep 3, 1998",
            "Jan 13, 1998",
            "Mar 11, 1999",
            "Nov 24, 1999",
            "Dec 22, 2000",
            "Nov 6, 2001",
            "Aug 10, 2001",
            "Dec 29, 1999",
            "Oct 1, 1999",
            "Mar 27, 2001",
            "Feb 14, 2001",
            "Sep 22, 2000",
            "Feb 14, 2001",
            "Aug 10, 2001",
            "Apr 28, 2003",
            "Feb 14, 2001",
            "Feb 14, 2001",
            "Dec 18, 2002",
            "Mar 22, 2002",
            "Sep 20, 2004",
            "Jul 29, 2005",
            "Jul 28, 2005",
            "Mar 26, 2004",
            "Feb 14, 2001",
            "Dec 18, 2002",
            "Sep 20, 2004",
            "Mar 18, 2002"
        ],
        [
            "Publication date",
            "Feb 6, 2001",
            "Jul 24, 2001",
            "Jan 1, 2002",
            "Sep 10, 2002",
            "Oct 8, 2002",
            "Apr 29, 2003",
            "Jul 22, 2003",
            "Jul 29, 2003",
            "Aug 19, 2003",
            "Oct 14, 2003",
            "Jan 20, 2004",
            "May 25, 2004",
            "Jun 1, 2004",
            "Oct 12, 2004",
            "Oct 19, 2004",
            "Nov 9, 2004",
            "Apr 12, 2005",
            "Jun 14, 2005",
            "Sep 20, 2005",
            "Aug 1, 2006",
            "Aug 29, 2006",
            "Dec 9, 2008",
            "Sep 8, 2009",
            "Oct 20, 2009",
            "Nov 1, 2001",
            "Jun 24, 2004",
            "Feb 10, 2005",
            "Oct 2, 2002"
        ],
        [
            "Applicant",
            "International Business Machines Corporation",
            "Compaq Computer Corporation",
            "Intel Corporation",
            "Compaq Information Technologies Group, L.P.",
            "Via Technologies, Inc.",
            "Hewlett-Packard Development Company, L.P.",
            "Intel Corporation",
            "Intel Corporation",
            "Intel Corporation",
            "Matsushita Electric Industrial Co., Ltd.",
            "Intel Corporation",
            "Intel Corporation",
            "Altera Corporation",
            "Intel Corporation",
            "Intel Corporation",
            "Hewlett-Packard Development Company, L.P.",
            "Intel Corporation",
            "Intel Corporation",
            "International Business Machines Corporation",
            "Intel Corporation",
            "Hewlett-Packard Development Company, L.P.",
            "Hewlett-Packard Development Company, L.P.",
            "Hewlett-Packard Development Company, L.P.",
            "Intel Corporation",
            "Gurbir Singh",
            "International Business Machines Corporation",
            "Compaq Computer Corporation",
            "Intel Corporation"
        ],
        [
            "Title",
            "Bus for high frequency operation with backward compatibility and hot-plug ability",
            "High speed peripheral interconnect apparatus, method and system",
            "Method and apparatus for transferring data in source-synchronous protocol and transferring signals in common clock protocol in multiple agent processing system",
            "Method and apparatus for multiplexing and demultiplexing addresses of registered peripheral interconnect apparatus",
            "Dual data rate transfer on PCI bus",
            "High speed peripheral interconnect apparatus, method and system",
            "Transmission of signals synchronous to a common clock and transmission of data synchronous to strobes in a multiple agent processing system",
            "Quad pumped bus architecture and protocol",
            "Quad pumped bus architecture and protocol",
            "Data transferring device",
            "Setting the speed of clocked circuitry",
            "Checkerboard parity techniques for a multi-pumped bus",
            "Bus architecture for system on a chip",
            "Response and data phases in a highly pipelined bus architecture",
            "Quad pumped bus architecture and protocol",
            "Computer system with registered peripheral component interconnect device for processing extended commands and attributes according to a registered peripheral component interconnect protocol",
            "Snoop phase in a highly pipelined bus architecture",
            "Enhanced highly pipelined bus architecture",
            "Method and apparatus having dynamically scalable clock domains for selectively interconnecting subsystems on a synchronous bus",
            "Use of a context identifier in a cache memory",
            "High speed peripheral interconnect apparatus, method and system",
            "Device operating according to a communication protocol",
            "Device adapted to send information in accordance with a communication protocol",
            "Apparatus for adjusting a clock frequency of a variable speed bus",
            "Snoop phase in a highly pipelined bus architecture",
            "Method and apparatus having dynamically scalable clook domains for selectively interconnecting subsystems on a synchronous bus",
            "High speed peripheral interconnect apparatus, method and system",
            "Setting the speed of clocked circuitry"
        ]
    ],
    "pageTitle": "Patent US5978869 - Enhanced dual speed bus computer system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5978869?dq=6,275,983",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 481090895,
    "recordOffset": 481066548,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29784=The system bus 105 is connected through a PCI (Peripheral Component Interconnect) Host Bridge A circuit 111 to a second bus 113, which, in turn, is connected through an expansion bus interface 115 to a an expansion bus 117 in the present example. The expansion bus 117 may include connections to a keyboard/mouse adapter 119 and also to other peripheral device adapters such as peripheral device adapter 121. The exemplary embodiment illustrated also includes a PCI Host Bridge B 123 connecting the system bus 105 to a multi-speed or \"D66\" bus 125 which is implemented in accordance with the disclosed multi-speed methodology. The multi-speed bus 125 is connected, in the present example, to a 66 MHz PCI device 127 and also to a \"D66\" PCI device 129. The \"D66\" device in the present example, and the PCI Host Bridge, are capable of operating at double the speed of the 66 MHz device, and devices with this capability shall be hereinafter referred to as \"D66\" devices. The methodology herein disclosed provides a solution to the PCI bus speed limitation as hereinbefore described by defining means to enhance and extend the current 66 MHz PCI architecture definition, providing both 66 MHz and 133 MHz data rate capability. The D66 PCI bus definition described herein includes all of the protocol capabilities of the PCI standard, i.e. \"PCI Local Bus Specification, Production Version, Revision 2.1, Jun. 1, 1995, and updates, plus additional D66 capabilities.}",
    "textBeforeTable": "Patent Citations The D66 133 MHz PCI data transfer methodology disclosed herein provides a number of enhancements over standard PCI 66 MHz processing in order to improve the data throughput achievable compared to the standard PCI architecture. The method and apparatus of the present invention has been described in connection with a preferred embodiment as disclosed herein. Although an embodiment of the present invention has been shown and described in detail herein, along with certain variants thereof, many other varied embodiments that incorporate the teachings of the invention may be easily constructed by those skilled in the art. Accordingly, the present invention is not intended to be limited to the specific form set forth herein, but on the contrary, it is intended to cover such alternatives, modifications, and equivalents, as can be reasonably included within the spirit and scope of the invention. Each PCI device receives a separate clock signal as the standard 66 MHz PCI bus does. The disclosed methodology supports pacing with IRDY# and TRDY# only between data blocks when utilizing data blocking. When utilizing optional data blocking, data transfers must begin on the beginning of the minimum block size, must transfer integer multiples of data blocks and must not pace except between 32 byte blocks. When the last block of data is less than 32 bytes, that transfer is handled in the normal non-blocking fashion. Pacing with IRDY# and TRDY# signals is allowed between data",
    "textAfterTable": "US6807592 Aug 10, 2001 Oct 19, 2004 Intel Corporation Quad pumped bus architecture and protocol US6816934 * Apr 28, 2003 Nov 9, 2004 Hewlett-Packard Development Company, L.P. Computer system with registered peripheral component interconnect device for processing extended commands and attributes according to a registered peripheral component interconnect protocol US6880031 Feb 14, 2001 Apr 12, 2005 Intel Corporation Snoop phase in a highly pipelined bus architecture US6907487 Feb 14, 2001 Jun 14, 2005 Intel Corporation Enhanced highly pipelined bus architecture US6948017 * Dec 18, 2002 Sep 20, 2005 International Business Machines Corporation Method and apparatus having dynamically scalable clock domains for selectively interconnecting subsystems on a synchronous bus US7085889 Mar 22, 2002 Aug 1, 2006 Intel Corporation Use of a context identifier in a cache memory US7099986 Sep 20, 2004 Aug 29, 2006 Hewlett-Packard Development Company, L.P. High speed peripheral interconnect apparatus, method and system US7464207",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}