{
    "relation": [
        [
            "Date",
            "May 24, 1993",
            "Jan 28, 1999",
            "Mar 19, 2003",
            "Apr 30, 2003",
            "Apr 30, 2003",
            "Jan 31, 2007",
            "Dec 23, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "FPAY",
            "SULP",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Fee payment",
            "Surcharge for late payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: EPIC DESIGN TECHNOLOGY, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HUANG, XIAOLI;ZHANG, WILLIAM H.;REEL/FRAME:006487/0365 Effective date: 19930427",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 7",
            "Year of fee payment: 12",
            "Effective date: 19970916 Owner name: SYNOPSYS, INC., CALIFORNIA Free format text: MERGER;ASSIGNOR:EPIC DESIGN TECHNOLOGY, INC.;REEL/FRAME:029538/0262"
        ]
    ],
    "pageTitle": "Patent US5446676 - Transistor-level timing and power simulator and power analyzer - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5446676?dq=5083039",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042991951.97/warc/CC-MAIN-20150728002311-00298-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 470939339,
    "recordOffset": 470892036,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{38462=Switch-level timing simulation, represented by such programs as MOTIS and RSIM, serves a critical role in the simulation and verification of logic and timing behavior of a digital MOS circuit on the switch level. It is characterized by (1) switched-resistor models instead of complicated analytical models for MOS transistors; (2) event-driven techniques which obviate the need to solve an entire circuit repeatedly; and (3) estimated timing and logic values, in lieu of solving a set of nonlinear ordinary differential equations, to evaluate the impact of an event on a set of nodes and transistors. These characteristics combine to offer a simulation performance and capacity close to that of gate level logic simulators (e.g. 1000 times faster than circuit simulators for circuits with hundreds of thousands of transistors) at an accuracy level typically of 20% to 30% of circuit simulators for typical digital MOS circuits. As more VLSI chips, especially high speed ones, are experiencing electrical problems caused by nonidealities in transistors and interconnections thereof, switch-level timing simulation is becoming an indispensable software tool for the verification of digital MOS VLSI., 69123=The principal behind this calculation is discussed in B. R. Chawla, H. K. Gummel, P. Kozah, MOTIS--An MOS Timing Simulator, IEEE Transactions,.CAS,(December 1975).}",
    "textBeforeTable": "Patent Citations The invention has now been described in terms of a preferred embodiment. Modifications and substitutions will now be apparent to persons of ordinary skill in the art. Accordingly, it is not intended that the invention be limited except as provided by the appended claims. One embodiment of the invention is implemented in software which runs on a Vnix™-based engineering workstations, as discussed above. In addition to the features already discussed, this embodiment includes routines which speed up d.c. initialization, trace a path from Vdd to ground, calculate current at block (i.e., subcircuit) levels and provide for an R-C delay modeling and simulation algorithm for MOS circuits. As discussed above, print-- cell provides partial calculation of these values in the form of the numerator of each equation. Such advanced calculations are also available for any transistor identified by the user by establishing transistor-specific storage buffers analogous to the power-- buffer. The remaining arithmetic steps required to determine these values are obvious from the foregoing equations and need not be explained further. Average and RMS currents are calculated in accordance with equations (24) and (25) provided below: ##EQU3## Peak current (maximum current for all <t,i> pairs) for any power node is calculated in the print-- cell subroutine, described above and in FIG. 23b. Instantaneous current (i.e., <t,i> data) is automatically output for power nodes, and may be requested for any transistor by the user as described above. The",
    "textAfterTable": "* Geus; Logic Synthesis Speeds ASIC design ; IEEE Spectrum 1989. 13 Halliday, \"dv/dt Automates Creating Timing Diagras\"; Communication Channels May 1991. 14 * Halliday, dv/dt Automates Creating Timing Diagras ; Communication Channels May 1991. 15 J. R. Black, \"Electromigration Failure Modes in Aluminum Metallization for Semiconductor Devices\", Proc. of the IEEE, vol. 57, No. 9, pp. 1587-1594, Sep. 1969. 16 * J. R. Black, Electromigration Failure Modes in Aluminum Metallization for Semiconductor Devices , Proc. of the IEEE, vol. 57, No. 9, pp. 1587 1594, Sep. 1969. 17 * L. A. Glasser, D. W. Dobberpuhl, The Design and Analysis of VLSI Circuits , pp. 97 101, Addison Wesley, 1985. 18 L. A. Glasser, D. W. Dobberpuhl, The Design and Analysis of VLSI Circuits, pp. 97-101, Addison-Wesley, 1985. 19 P. Odryna and S. Nassif, \"The ADEPT Timing Simulation Algorithm,\" VLSI Systems Design, pp. 24-34, Mar. 1986. 20 * P. Odryna",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}