{
    "relation": [
        [
            "Rank",
            "1.",
            "2.",
            "3.",
            "4.",
            "5.",
            "",
            "7.",
            "",
            "",
            "",
            "10.",
            ""
        ],
        [
            "Player",
            "Andy Pettitte",
            "John Smoltz",
            "Tom Glavine",
            "Roger Clemens",
            "Curt Schilling",
            "Greg Maddux",
            "Chris Carpenter",
            "David Wells",
            "Dave Stewart",
            "Whitey Ford",
            "Orlando Hernandez",
            "Catfish Hunter"
        ],
        [
            "Inn.",
            "270",
            "209",
            "218 1/3",
            "199",
            "133 1/3",
            "198",
            "100",
            "125",
            "133",
            "146",
            "106",
            "132 1/3"
        ],
        [
            "Wins",
            "19",
            "15",
            "14",
            "12",
            "11",
            "11",
            "10",
            "10",
            "10",
            "10",
            "9",
            "9"
        ],
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Tracy Ringolsby: Chris Carpenter leads Cards to brink of NLCS | MLB.com",
    "title": "Most career postseason wins",
    "url": "http://m.mlb.com/news/article/39679574",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00004-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 151340259,
    "recordOffset": 151319397,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1049=And there was no bloody sock like the one Curt Schilling made famous when he pitched Boston into a decisive Game 7 against the New York Yankees in the 2004 American League Championship Series, allowing the Red Sox to become the first team to rebound from 0-3 in a best-of-seven series en route to their first World Series title since 1918.}",
    "TableContextTimeStampAfterTable": "{3816=Along came Pete Kozma, who \"five times during the summer\" while he was in the Minor Leagues was about to be taken off the 40-man roster, before finding himself the Cardinals' starting shortstop in a September postseason race because of an injury to Rafael Furcal, delivering the momentum-moving three-run home run in the second inning., 6191=\"Character is developed through the adversity, and the adversity seemed to start off in Spring Training when we lose a Carpenter, and then a Lance Berkman goes down, and all of the change that happened since the 2011 season [including the free-agent departure of Albert Pujols].}",
    "textBeforeTable": "Carp sharp in October But it wasn't bad, the way the elements combined in St. Louis' 8-0 victory in Game 3 on Wednesday against the Washington Nationals to give the Cardinals a 2-1 edge in the best-of-five National League Division Series. And there was no bloody sock like the one Curt Schilling made famous when he pitched Boston into a decisive Game 7 against the New York Yankees in the 2004 American League Championship Series, allowing the Red Sox to become the first team to rebound from 0-3 in a best-of-seven series en route to their first World Series title since 1918. WASHINGTON -- This was not Kirk Gibson hobbling to home plate, delivering that walk-off home run off Dennis Eckersley in Game 1 of the 1988 Fall Classic that gave the Los Angeles Dodgers the shot they needed to upset the Oakland A's and go on to claim the World Series title. 0 COMMENTS + | @TracyRingolsby | MLB.com By Tracy Ringolsby /",
    "textAfterTable": "There was Chris Carpenter, the inner force of the Cards' clubhouse, slightly more than two months removed from what was supposed to be season-ending surgery to correct a nerve that was creating numbness in his right shoulder, taking the mound and turning in a bend-but-don't break 5 2/3 innings of scoreless baseball. Along came Pete Kozma, who \"five times during the summer\" while he was in the Minor Leagues was about to be taken off the 40-man roster, before finding himself the Cardinals' starting shortstop in a September postseason race because of an injury to Rafael Furcal, delivering the momentum-moving three-run home run in the second inning. And now the Cards sit one victory away from taking the second of four postseason steps needed to become the first NL team to repeat as World Series champions since Cincinnati's Big Red Machine in 1975-76. Carpenter weaved his way through a scoreless afternoon of work despite the fact that 17 of the 27 batters he faced came up with a man on base -- only two of them getting hits -- taking any road-game pressures off the Cardinals. They now have two shots at winning this NLDS, and have a perfectly aligned rotation. Kyle Lohse, who started the Wild Card showdown in Atlanta on Friday, is set to start Thursday, and Adam Wainwright is ready to go on regular rest in case a Game 5 is needed on Friday. \"That's a great compliment to our guys,",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}