{
    "relation": [
        [
            "Course Title",
            "Applications/Concepts or Info Technology Problem Solving or PC Hardware and Software",
            "Principles of Internet and Info Security",
            "Introduction to Networking",
            "Introduction to Computer Forensics",
            "Windows Operating Systems",
            "Networking Security",
            "Information Security and Assurance",
            "Batch File Programming",
            "Ethical Hacking",
            "Total Credits"
        ],
        [
            "Course Number",
            "CIT110 or CIT113 or CIT182",
            "CIT118",
            "CIT162",
            "CIT121",
            "CIT268",
            "CIT264",
            "CIT219",
            "CIT271",
            "CIT273",
            ""
        ],
        [
            "Semester Taken",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Credits",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "1",
            "4",
            "26"
        ],
        [
            "Prerequisites",
            "ESL098 or RDG095 ENG090 and RDG090",
            "CIT110 or CIT113 or CIT120 or Chair approval",
            "CIT110 or CIT113 or CIT120 or Chair approval",
            "CIT110 or CIT113 or CIT120 or Chair approval",
            "CIT110 or CIT113 or CIT120 or Chair approval",
            "CIT162",
            "CIT268",
            "CIT270 and Pre/co-req CIT268",
            "CIT268 or CIT270 or Chair approval",
            ""
        ]
    ],
    "pageTitle": "Information Technology Security Certificate – Bunker Hill Community College",
    "title": "",
    "url": "http://bhcc.mass.edu/programsofstudy/programs/informationtechnologysecuritycertificate/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00031-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 23893359,
    "recordOffset": 23884669,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10582=© 2015 Bunker Hill Community College · 250 New Rutherford Avenue · Boston, Massachusetts 02129 · Phone (617) 228-2000 TTY (617) 242-2365}",
    "textBeforeTable": "Information Technology Security Certificate Program Information Technology Security Certificate Programs »  Programs of Study »  College Catalog »  Academics »  Home »  College Catalog Archives Courses Certificate Programs Associate in Science Degrees Associate in Arts Degrees Programs of Study }) ; i++ ; } $(this).addClass(\"first\") ; if (i == 5) { } $(this).addClass(\"omega\") ; if (i == 2) { } $(this).addClass(\"alpha omega\") ; if (i == 0) { $(this).find(\"a\").attr(\"id\", \"tab\" + (i + 1)) ; listItems.each(function() { var i = 0 ; var listItems = list.children(\"li\") ; var list = $(\"#mainNav\").children(\"ul\") ; //get lis */ * /* script adds class to mainNav child ul lis and ids to child links",
    "textAfterTable": "Additional Information View Gainful Employment Information for Information Technology Security Certificate. View Department Page View Division Page Option Overview This option prepares students to support the security of networks, systems located on these networks, and the data/information contained within those systems; identifying, developing, implementing and maintaining security processes throughout organizations to reduce risks, respond to incidents and limit exposure and liability; identifying, notifying, and responding to security threats to networks. Career Outlook This option is designed to align with the National Institute of Technology and Standards’ (NITS) National Initiative for Cybersecurity Education Cybersecurity Workforce Framework to ensure consistent, current, and flexible training in the growing technology field of Information Security. Graduates of this option will qualify for positions as entry level information security professionals. For more information about our graduation rates, the median debt of students who completed the program, and other important information, please visit our website at www.bhcc.mass.edu/ certificate-programs. Upon Completion of this Concentration Graduates will be able to: Understand network protocols and routing. Understand commonly used network services - DNS, mail, web, etc. as well as less common network services. Perform packet analysis and be able to identify malformed packets. Understand differences between various operating systems - which OS an event came from and which OS is vulnerable to a certain attack. Define the types of malicious software found in modern networks. Explain the threats and countermeasures for physical security and social engineering. Perform",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}