{
    "relation": [
        [
            "Name of building",
            "The Solaire",
            "Tribeca Green",
            "The Verdesian",
            "Millenium Tower",
            "The Riverhouse",
            "The Visionaire",
            "Site 23 and Site 24"
        ],
        [
            "Design (start)",
            "2000",
            "2000",
            "2003",
            "2004",
            "2004",
            "2005",
            "2006"
        ],
        [
            "Construction (completion)",
            "2003",
            "2005",
            "2006",
            "2007",
            "2008",
            "2008",
            "2011"
        ],
        [
            "Location and use of PV",
            "West façade BIPV and bulkhead*(South and West facing walls). Entrance canopy (West)",
            "Bulkhead (East, West and South facing walls)",
            "Bulkhead (primarily East and West facing walls)",
            "Bulkhead (West facing wall)",
            "PV tracking array at rooftop level (East, West and South racks)",
            "West and East façade BIPV",
            "PV trellises at lower rooftops and on bulkheads (top and South facing) of both buildings"
        ],
        [
            "Design architect",
            "Pelli Clarke Pelli Architects",
            "Robert A.M. Stern Architects",
            "Pelli Clarke Pelli Architects",
            "Handel Architects",
            "Ennead and Ismael Leyva Architects",
            "Pelli Clarke Pelli Architects",
            "EE&K Architects"
        ]
    ],
    "pageTitle": "Buildings | Free Full-Text | Photovoltaic Design Integration at Battery Park City, New York | HTML",
    "title": "Table 1. Battery Park City (BPC) buildings under investigation.",
    "url": "http://www.mdpi.com/2075-5309/3/2/341/htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 562110459,
    "recordOffset": 562077420,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{27098=The idea of the BPC development starts in the mid sixties, following the dismantling of the shipping industry and the progressive decay of the piers jutting out onto the river. Susan Kaplan, Director of Sustainability at the BPCA explains how this large dysfunctional area on the waterfront was seen by the then ex-governor of New York, Nelson A. Rockefeller, as an opportunity to have full jurisdiction over buildable areas and, through the strategy of reclaimed land, start an entire new city jutting out from Manhattan Island [18]. The development of BPC goes through two distinct phases that are visually experienced with a visit to the site. The first goes from the mid-sixties to the new master plan of 1979. It is defined by several master plans that result in closed communities such as the Gateway, which shows exclusion to street life and nature. The second phase stems from the 1979 master plan. This phase begins to include environmental considerations, primarily at an urban design scale, and can be considered the reference driver for the rest of the BPC development., 20822=The source material of this study originates from on-site video interviews carried out during the construction process of the Battery Park City development in the periods 18-26 June and 14-17 November, 2007, and the period 27 September to 11 October, 2009, with the Battery Park City Authority (BPCA) director of sustainability, the architects in charge of the buildings concerned, and the BPC PV installer. The raw interview data is transcribed and subjected to content analysis to show emerging themes in the integration of PV in the building’s design. The content of each theme is interpreted through observation and literature review. Conclusions are then drawn from the findings., 22681=Established in 1993, the mission of the IEA-PVPS program is to accelerate and promote the development and deployment of PV solar energy through information dissemination and a set of scheduled tasks. The program’s premise is that of PV as a sustainable renewable energy source that can significantly contribute to the reduction of carbon emissions and world dependency on fossil fuels. Central issues relevant to the introduction of PV in buildings, accountable for more than 40% of the world’s energy demands are PV economy, government incentives, and technological innovation. In support of the advantages of integrating PV in buildings we find studies, from both IEA-PVPS program and independent sources, which focus on the PV’s economic, environmental, and architectural added value [8,9,10,11]., 45085=It is suggested, however, that it is the very challenges posed by the introduction of PV in the city and the stringent building and environmental guidelines set by the BPCA that has triggered a set of attractive advantages for architects and developers. To begin with, architects were given the opportunity to show, in a highly visible way, the environmental commitment of their practice. BPC has also shown to be an incubator for the use of PV in the city, drawing architects and developers to use PV in their future projects and engage in the use of PV systems with more confidence. An example is the Helena building in New York, by Fox and Fowle architects, completed in 2005. As PV installer of the Helena, Anthony Pereira [23] states that the decision to include PV in the building’s design agenda was fostered by the physical evidence provided by the BPC buildings, bringing forth confidence to the PV initiative. Likewise, the Albanese Developing Corporation, developer of the Solaire, the Verdesian, and the Visionaire has, since their experience at BPC, started to incorporate green buildings strategies as a norm, with the inclusion of PV in most of their projects. Most importantly, the BPC development has triggered the activation of PV government financial support and tax breaks incentives, making the inclusion of PV in buildings’ more attractive to clients, architects, and developers, expanding the use of PV in architecture and pushing for innovative solutions., 87441=© 2013 by the authors; licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution license (http://creativecommons.org/licenses/by/3.0/)., 65154=If a PV systems’ main purpose is to generate energy from renewable sources and significantly contribute to a building’s energy demands, then the PV installed at BPC need to be put into question. In fact, the BPCA 2000 Guidelines requirement to provide only 5% of the base energy load, updated in 2004 to 0.75% of the building’s base energy loads calculated on the actual PV energy produced, is a small contribution to a building’s energy demands, particularly when compared to the estimated energy potential of BIPV. To put things in perspective, based on a IEA-PVPS report, it is estimated that if building surfaces are used that generate 80% of the maximum solar power, the ratio between BIPV solar electricity production and current electricity consumption can vary from 15% to almost 60% in IEA countries [13]., 30066=In 2000, the BPCA establishes the Hugh L. Carey Battery Park City Authority Residential Environmental Guidelines [20]. The formulation of the guidelines is coeval to the Leadership in Energy and Environmental Design (LEED) Green Building Rating System [21]. It distinguishes itself from LEED, however, by setting mandates, rather then options, with stringent requirements for the provision of renewable energy and green power sources. The guidelines mandates that renewable energy sources be incorporated in the BPC building’s design to initially provide 5% of the base energy load of each building; that is: the load of the buildings’ non-tenanted spaces. Several studies are conducted to explore the different renewable energy options, including wind and biomass. The application of PV systems, however, quickly appears to the developers as the most tested and economic option, and as such it is adopted in the BPC buildings., 15895=Buildings 2013, 3(2), 341-356; doi:10.3390/buildings3020341, 18794=Photovoltaic (PV) cells transform the visible spectrum of solar radiation (photons) into electrical energy. The greater the efficiency of the PV cell, the larger the PV surface area exposed, and the better the PV’s position with respect to the sun, the greater the total electrical output produced. It is important to remember that initial use and testing of PV cells occurred in outer space. In 1958, PV cells were installed in the satellite Vanguard to generate energy to power its radio transmitters. The event was significant because it demonstrated the original scope and potential of PV: to effectively generate self-sufficient energy from the sun. This machine-like function and high-tech aesthetic of PV remains fundamentally unchanged and is arguably what challenges architects when PV systems are to be integrated in a building’s design. The integration of PV in architecture, however, can also potentially provide an important supply of electricity for a building’s energy demand and significantly contribute to the reduction of carbon emissions. The application of PV systems in the Battery Park City (BPC) buildings represents a challenge that architects face globally when presented with PV technology; that is, to make PV perform and assimilate it as constituent parts of the design process., 31122=The BPC buildings under investigation, completed between 2003 and 2011, represent a test case in PV application. The details of these buildings are shown below, in Table 1. All the buildings follow tight zoning and geometric constraints on massing, orientation, and envelope directives (i.e., the façade’s ratio of opaque to transparent).}",
    "textBeforeTable": "Table 1. Battery Park City (BPC) buildings under investigation. Click here to display table The BPC buildings under investigation, completed between 2003 and 2011, represent a test case in PV application. The details of these buildings are shown below, in Table 1. All the buildings follow tight zoning and geometric constraints on massing, orientation, and envelope directives (i.e., the façade’s ratio of opaque to transparent). In 2000, the BPCA establishes the Hugh L. Carey Battery Park City Authority Residential Environmental Guidelines [20]. The formulation of the guidelines is coeval to the Leadership in Energy and Environmental Design (LEED) Green Building Rating System [21]. It distinguishes itself from LEED, however, by setting mandates, rather then options, with stringent requirements for the provision of renewable energy and green power sources. The guidelines mandates that renewable energy sources be incorporated in the BPC building’s design to initially provide 5% of the base energy load of each building; that is: the load of the buildings’ non-tenanted spaces. Several studies are conducted to explore the different renewable energy options, including wind and biomass. The application of PV systems, however, quickly appears to the developers as the most tested and economic option, and as such it is adopted in the BPC buildings.",
    "textAfterTable": "* Bulkhead: structure on the roof housing mechanical systems and other installations. 4. Emerging Themes The emerging themes from the interviews are categorized in four sections, namely: The “carrot and stick” (discusses the effects of mandating PV systems in the BPC development); PV and building integration (discusses the architect’s different approaches to PV integration in the design process); PV industry and design process (discusses the difficult relationship between PV industry and the design process); Green visible (brings out the PV overall prevailing function at BPC, comparing the short term symbolic function of PV with its potential long term goal). 4.1. The “Carrot and Stick” Residential development is an exceedingly money conscious sector of the building industry. Newly built residential buildings must generate a certain pre-calculated return, and anything outside of a tested financial program is seen with scepticism and as a risk. Kaplan, states that having mandated the use of PV as renewable generation system through the BPCA residential guidelines has fostered the development of the PV industry in the residential sector [22]. According to Anthony Pereira [23], President and CEO of AltPower, the BPC PV installer, “the reality is that if you did not use the stick, no one would apply the technology, no matter what the incentive. The stick had to happen for it to happen”. For the scope of this study, the question is: what effect",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}