{
    "relation": [
        [
            "",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9"
        ],
        [
            "Teams",
            "chennai super kings",
            "mumbai indians",
            "rajasthan royals",
            "sunrisers hyderabad",
            "royal challengers bangalore",
            "kings xi punjab",
            "kolkata knight riders",
            "pune warriors india",
            "delhi daredevils"
        ],
        [
            "M",
            "16",
            "16",
            "16",
            "16",
            "16",
            "16",
            "16",
            "16",
            "16"
        ],
        [
            "W",
            "11",
            "11",
            "10",
            "10",
            "9",
            "8",
            "6",
            "4",
            "3"
        ],
        [
            "L",
            "5",
            "5",
            "6",
            "6",
            "7",
            "8",
            "10",
            "12",
            "13"
        ],
        [
            "PTS",
            "22",
            "22",
            "20",
            "20",
            "18",
            "16",
            "12",
            "8",
            "6"
        ]
    ],
    "pageTitle": "IPL spot-fixing: BCCI shaken as top officials Sanjay Jagdale, Ajay Shirke resign - IPL 2013 News",
    "title": "",
    "url": "http://sports.ndtv.com/indian-premier-league-2013/news/208612-ipl-spot-fixing-bcci-shaken-as-top-officials-sanjay-jagdale-ajay-shirke-resign",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00173-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 229019259,
    "recordOffset": 229000341,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{50499=May 19 2013,, 48679=May 22 2013,, 85990=© Copyright NDTV Convergence Limited 2015. All rights reserved., 49591=May 21 2013,, 46864=May 26 2013,, 47772=May 24 2013,, 14578=BCCI secretary Sanjay Jagdale, a former cricketer, and treasurer Ajay Shirke (in pic), sent their resignations to Srinivasan on Friday evening. They said they were deeply hurt by the spot-fixing scandal that has rocked cricket in the last few weeks. (Watch: My credibility was at stake, says Shirke) Mr Jagdale also recused himself from a three-member inquiry commission set up by the BCCI to investigate allegations that Mr Srinivasan's son-in-law Gurunath Meiyappan associated with bookies and indulged in betting during the Indian Premier League. Mr Meiyappan in police custody and an increasing number of the BCCI's members reportedly see Mr Srinivasan continuing as BCCI president a conflict of interest. (Watch: Is Srinivasan's ouster enough to clean up Indian cricket?) Mr Jagdale said, \"Yes, that's true, I have resigned...I am deeply hurt by the recent developments in Indian cricket. I thought it's better to get out so that some new faces come in and deal with it in a better way.\" (Watch: Not everyone is corrupt in the BCCI, says Jagdale) Mr Srinivasan has so far refused to resign. But the pressure on him did make him call a working committee meeting on Sunday, June 2, to discuss the crisis that has beset Indian cricket. The working committee meeting that Mr Srinivasan has been forced to call cannot vote him out. But it can ask that a special general body meeting be called where he can be impeached. His term ends in September this year. (Read: N Srinivasan should be sacked if he doesn't step down, says ex-BCCI secretary Jaywant Lele) Mr Srinivasan is expected to face tough questions, including some on the allegation by Mumbai Police sources today that Gurunath Maiyappan had told small-time actor, Vindu Dara Singh, as the sixth edition of the IPL was beginning, that he had been warned by the the International Cricket Council (ICC) to be careful of the company he was keeping. (Read: Ankeet Chavan released from Tihar Jail for marriage) There is no official confirmation from either the ICC or the BCCI that such a warning was issued, but it is being argued that if the anti-corruption unit of the ICC had indeed been watching Mr Meiyappan, the BCCI chief would have known about it. Mr Srinivasan has flatly refused any knowledge of such a warning. (Watch: ICC did not inform BCCI that they warned Gurunath, says Ratnakar Shetty) Sachin Tendulkar said on Friday he was \"hurt when the game of cricket is in the news for the wrong reasons. The developments in the last two weeks have been shocking and disappointing. As cricketers we are always taught to go out, fight hard, give our very best and play in the true spirit of the game,\" and sought an early restoration of the game's credibility. (Read: Politics and sports should not be mixed, says PM Manmohan Singh), 18884=Story first published on: Friday, 31 May 2013 20:38 IST}",
    "lastModified": "Sat, 01 Jun 2013 08:39:57 GMT",
    "textBeforeTable": "IPL 2013 Points Table Live Scores & Results Advertisement",
    "textAfterTable": "Fixtures Results T20 T20 There are no matches available for this series. May 26 2013, 20:00 (IST) Cricket Score Centre Mumbai Indians beat Chennai Super Kings by 23 runs May 24 2013, 20:00 (IST) Cricket Score Centre Mumbai Indians beat Rajasthan Royals by 4 wickets May 22 2013, 20:00 (IST) Cricket Score Centre Rajasthan Royals beat Sunrisers Hyderabad by 4 wickets",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}