{
    "relation": [
        [
            "Sun",
            "",
            "5",
            "12 Sean Morello: Constellations & Supersymmetries",
            "19",
            "26"
        ],
        [
            "Mon",
            "",
            "6",
            "13 Rock Art Hot Spots",
            "20",
            "27"
        ],
        [
            "Tue",
            "",
            "7 Home Coffee Roasting Why Sales People Fail!",
            "14 Instagram Adult Improv Comedy Show Full Bar/Restaurant",
            "21 Improv Comedy Workshop",
            "28"
        ],
        [
            "Wed",
            "1 God Help the Girl Film Screening",
            "8",
            "15 In Football We Trust Film Screening",
            "22",
            "29"
        ],
        [
            "Thu",
            "2",
            "9 Eat Drink SLC",
            "16",
            "23 Twilight Concert Series: Black Rebel Motorcycle Club",
            "30 Twilight Concert Series: Prhyme with Adrian Younge"
        ],
        [
            "Fri",
            "3",
            "10 Opening Reception & Dance Performance",
            "17",
            "24",
            "31"
        ],
        [
            "Sat",
            "4 Moab's Alpine to Slickrock 50 Mile Race",
            "11 Print to Wear - Linoleum Carving Blitzen Trapper",
            "18 Miles for Melanoma Salt Lake City Mastering Martinis Music in the Mountains Healing Strategies for Chronic Pain and Inflammation",
            "25 An Evening with Toby Beard",
            ""
        ]
    ],
    "pageTitle": "2013 Best of the Beehive: Family Adventure | Salt Lake Magazine",
    "title": "",
    "url": "http://saltlakemagazine.com/blog/2013/06/01/best-of-the-behive-family/?t=143812021283",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00183-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 218418007,
    "recordOffset": 218407549,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{12242=The largest library of its kind, the LDS Family History Library has all the microfilm, books and databases you need to map out your family tree or find out if grandpa really was a flim-flam man. 35 N. West Temple, SLC, 866-406-1830, familysearch.org, 9961=The biggest bummer about snow tubing is gravity. It's way fun to slide down the hill but a pain to drag your tube back up. Gorgoza Park eliminates the trek with a tow rope. It's cold, white fun until your feet freeze, then into the yurt for hot chocolate. 3868 W. Kilby Rd., Park City, 435-658-2648, gorgoza.com, 10437=Days of '47 is a Utah-only holiday, and it's famously \"bigger than the Fourth of July.\" The big event is the Days of '47 Parade, but remember, even if you're on time for this parade, you're late. The best spots go to those who get there early—way early. Pack your camping gear, games and a cooler to spend the night before, in anticipation of the grand marshall's whistle at 9 a.m. Find the route and more info on the July 24 parade at daysof47.com., 9493=Heber Valley Railroad is known for excursions like a river rafting/train ride combo. But we can't wait for Hobo Days. Enjoy a tin-can-cooked dinner before chugging to Deer Creek Dam for hobo stories around barrel fires. Just preface your name with \"Boxcar.\" Aug. 9-10, $45, 450 S. 6oo West, Heber City, 801-581-9980, hebervalleyrr.org, 11405=Best Friends Animal Society runs the largest no-kill animal shelter in the country. Support Best Friends' no-kill mission by volunteering at their sanctuary, by socializing the dogs, cats, rabbits, parrots, pigs or doing a construction project. 5001 Angel Canyon Rd., Kanab, 435-644-2001, bestfriends.org}",
    "textBeforeTable": "‹July '15› Events Calendar Preview: Sugar Ray, et al Egyptian Theatre Announces Stand-Up Series Beauty Buff: Orange Lipstick Local Business Spotlight: Red Ledges' Jack Nicklaus Signature 12-Hole Golf Park Review: Sugar Ray/Under the Sun Recent Blogs MOST RECENT POST })(); (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq); dsq.src = 'http://slmag.disqus.com/embed.js'; var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true; (function() { var disqus_identifier = 'BlogPost-8947'; var disqus_title = '2013 Best of the Beehive: Family Adventure '; var disqus_url = 'http://saltlakemagazine.com/blog/2013/06/01/best-of-the-behive-family/'; var disqus_developer = 'False' == 'True'; } this.page.api_key = ''; this.page.remote_auth_s3 = ''; var disqus_config = function () {",
    "textAfterTable": "VIEW FULL CALENDAR About Contact Us In The Magazine Careers Ad Index Site Map Media Kits Subscriptions Copyright 2014 Salt Lake Magazine Privacy Policy View Mobile Site",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}