{
    "relation": [
        [
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "TITLE",
            "There's Nothing Racist About Opposing ObamaCare and Other Politically Incorrect Ideas (Members Only) PJTV Special",
            "THE RICOCHET ROUNDTABLE: Our Incompetent Intelligentsia and the Immigration Debacle (MEMBERS ONLY) PJTV Special",
            "Taxpayers Lose Big on GM Bailout Front Page with Allen Barton",
            "RNC 2012: PJTV Takes Tampa, Kicks Off Convention Coverage RNC 2012",
            "President Obama, Person of the Year? Front Page with Allen Barton",
            "Loose Nukes and Atomic Nuts: What Are the Biggest Threats to the US? (Members Only) National Security Review",
            "Frank Gaffney: Suhail Khan Won't Acknowledge Family Involvement in Muslim Brotherhood (Members Only) CPAC 2011",
            "Feed the Beast? Economist Argues That Increased Taxes Lead to Smaller Government Front Page with Allen Barton",
            "Disaster Socialism: Why Gun Hysteria Could Lead to Another Expansion of Government InstaVision With Glenn Reynolds",
            "Creativity in Crisis: Is America Running Out of Innovative Ideas? (Members Only) Front Page with Allen Barton"
        ],
        [
            "DESCRIPTION",
            "Columnist Deroy Murdock talks with Joe Hicks and answers viewer questions. They tackle issues of race and identity, while paying particular attention to the left's obsession with race related issues.",
            "What happens when the smartest men in America meet in one place? Find out in a special members only conversation with PJTV's Bill Whittle.",
            "\"Did the Treasury Department protect taxpayer interests?\" -- Allen Barton",
            "",
            "",
            "\"They could possibly produce an electromagnetic pulse attack. That's when you shoot one missile with one nuclear warhead high, up about 40,000 feet into the atmosphere...you'd kill no one immediately but you would knock out...the electric grid.\" -- Cliff May",
            "\"Suhail Khan refuses to acknowledge that his parents were involved in starting Muslim Brotherhood organizations.\" -- Frank Gaffney",
            "\"Whether we have periods of low taxes or periods of high taxes, government seems to grow\" -- Yaron Brook",
            "\"When people are arguing and fighting about guns they're not talking about the debt and the deficit\" -- Glenn Reynolds",
            "Front Page talks to Yaron Brook and Terry Jones about the creative process. A recent study shows a decline in United States creativity. Could the problem be that we aren't teaching kids reading, writing and arithmetic?"
        ],
        [
            "DATE",
            "Sep 27, 2010",
            "Jul 30, 2010",
            "Dec 22, 2012",
            "Aug 27, 2012",
            "Dec 24, 2012",
            "Jun 3, 2011",
            "Feb 12, 2011",
            "Jan 1, 2013",
            "Jan 17, 2013",
            "Jul 27, 2010"
        ],
        [
            "TIME",
            "18min",
            "19min",
            "8min",
            "60min",
            "6min",
            "7min",
            "10min",
            "8min",
            "12min",
            "10min"
        ]
    ],
    "pageTitle": "PJTV - Library - Categories - Think Tanks & Organizations",
    "title": "",
    "url": "http://www.pjtv.com/?cmd=library&series-id=All&tag-id=151&from-date=All&to-date=All&include-future=false&sort=title&reverse=true&page=1&library-results-per-page=10&all-text=true&newValue=&video-id=&query-string-library=members+only",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00070-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 655403096,
    "recordOffset": 655386702,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{17976=Series:  All 1 AC TEST 3 1 Pajamas TV 9/12 Movement A Soldier's Story A Soldier's Story... After Hours with ... Afterburner with ... Alexis Garcia AlfonZo Rachel Pr... American Tea Party Ask Dr. Helen Best of Hot Seat ... Bill Whittle Inve... Brandi Milloy CA AAB Colored Particles... Consoles in the C... CPAC 2010 CPAC 2011 CPAC 2013 Danika Quinn Death By Taxes: H... Democratic Nation... Dept. 7 don't use Durban Watch e-Human: How New ... Economics in One ... Economy and Finan... Ed Driscoll's Sil... Education Bias Eleven in Two Faster, Please! Freedom Academy Freedom Fest 2011 Freedom's Charter Front Page with A... Hot Seat with Bil... Hugh News HUGH NEWS In Case You Misse... Instapundit InstaVision With ... International Cli... Iranian Time Bomb Iranium Issue of the Day Just Joe Keeping Your Gold... Klavan & Whittle Klavan on Culture Kruiser Control w... Louder With Crowder Made in China Media Bias Medically Incorrect Meet the Blogs Michelle Malkin Middle East Update Minority Report MK - New Series -... MK - New Series -... National Security... News Nuggets Next Gen Special Next Gen Startups Next Generation NRA 2015 Annual M... Pajamas TV Pandemic Panic: H... PJ News Break PJTV Daily PJTV Documentary ... PJTV Healthcare F... PJTV Healthcare G... PJTV Report PJTV Special PJTV TESTS POLITIZOID POLIWOOD Poll Position wit... Powerline Red State Red Carpet RNC RNC 2012 Roger L. Simon: T... Scott Ott Thought Setting the Recor... Sharia and Jihad Sonja Schmidt's L... stock video TCOT on PJTV Tea Party Coaliti... Tea Party Convent... Tea Party Express... Tea Party TV Ten in Two The Best of Klava... The Bottom Line w... The Conversation ... The Future of the... The Hicks File The Leave Us Alon... The PJTV Grill The Rundown Trifecta Trifecta Platinum... Up or Down VodkaPundit War on Men: How M... Washington Rewind Washington Watch}",
    "TableContextTimeStampAfterTable": "{4489=RNC 2012, 7830=CPAC 2011}",
    "textBeforeTable": "Showing results 1 to 10 of 14 Wired Magazine The Huffington Post Test tag Smart Girl Politics Reason Pohanka Automotive Group National Review National Center for Policy Analysis NCPA Manhattan Institute Investor's Business Daily Hudson Institute Hoover Institution Heritage Foundation Goldwater Institute Foundation for Defense of Democracies Competitive Enterprise Institute Center for Security Policy Cato Institute Brookings Institute Ayn Rand Center American Enterprise Institute Think Tanks & Organizations RNC 2012 People of Interest PJTV Shows PJTV CLASSICS: Vol 1 Next Generation Election 2012 CPAC 2013 Categories Series:  All 1 AC TEST 3 1 Pajamas TV 9/12 Movement A Soldier's Story A Soldier's Story... After Hours with ... Afterburner with ...",
    "textAfterTable": "1 2 Next About Us Terms Of Service Privacy Policy Disclaimer FAQ Contact Us © PJ Media 2008-2015",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}