{
    "relation": [
        [
            "",
            "HEIGHT(men)",
            "HEIGHT(women)",
            "TORSO",
            "WAIST"
        ],
        [
            "XS",
            "--",
            "4’8”-5’1",
            "16-18 in.",
            "25-29 in."
        ],
        [
            "S",
            "Under 5'6\"\"",
            "5’2”-5’9”",
            "16-18 in.",
            "30-34 in."
        ],
        [
            "M",
            "5’6”-6’2”",
            "5’10” plus",
            "18-21 in.",
            "30-34 in."
        ],
        [
            "L",
            "5’6”-6’2”",
            "--",
            "18-21 in.",
            "35-39 in."
        ],
        [
            "XL",
            "6’3” plus",
            "--",
            "21-24 in.",
            "35-39 in."
        ],
        [
            "XXL",
            "--",
            "--",
            "21-24 in.",
            "40+ in."
        ]
    ],
    "pageTitle": "ASAP Pack | Mystery Ranch Backpacks",
    "title": "",
    "url": "http://www.mysteryranch.com/items-in-progress/asap-pack",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00208-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 593452215,
    "recordOffset": 593430881,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{20266=We're moving to a kitted system so that we can design and build packs and frames that are optimized for integration based on the function of the product. There are some cool new things in the works. In the mean time, we may be able to accommodate pack only orders based on available inventory - contact MR Customer Service or call 406-585-1428, 17863=Marmot Warranty: (888) 311-2900 Mon - Fri : 7:30am - 5pm (PST) marmot_warranty@marmot.com, 7180=For more information please contact MR Customer Service or call 406-585-1428, 11551=If you think that you qualify for a pro discount, please give us a call at 406-585-1428. Thanks!, 12596=Mystery Ranch accepts returns for a refund within 60 days of the original purchase date. Items must be returned in brand new, unused condition, and shipping charges are non-refundable. Please give us a call at 406-585-1428, and we can get you set up with a Return Authorization (RA#)., 15598=We are not set up to perform custom work on individual orders and no, we cannot build a pack for you in a custom color. If your concern is in regards to sizing please give us a call at 406-585-1428., 17442=Boulder Mountain Repair: 2744 47th St. Boulder, CO80301 (303) 499-3634 repairs@bouldermtnrepair.com, 10662=If you are in need of a different size yoke or waist belt, please give us a call at 406-585-1428.}",
    "textBeforeTable": "Use a tailors tape measure or string and have a friend measure between the bony bump at the base of your neck (C7 vertebra) to the spot on your spine that is just above the top of your hip bones. Torso 3 Measure around your waist just above the top of your hip bones. Waist 2 Our packs are adjustable and height can be used as a general guide for sizing. For greater accuracy, please use torso and waist measurements. Height 1 Mystery Ranch packs are hand built for ultimate durability and designed for a custom fit using our modular harnessing and waist belt system. X FIT SIZE Mystery Cinch Relevant",
    "textAfterTable": "A couple of things to keep in mind: If you're between sizes we recommend you size down If your measurements fall outside of our standard sizing, please call our customer service team at (406) 585-1428 × Contact us First Name: Last Name: Organization: Phone Number: Email: Explain the details of your request: #CAGE: 3HXV1 #DUNS: 059122783",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}