{
    "relation": [
        [
            "",
            "2010-11",
            "2011-12",
            "2012-13",
            "2013-14",
            "Total"
        ],
        [
            "gp",
            "28",
            "30",
            "30",
            "27",
            "115"
        ],
        [
            "gs",
            "28",
            "30",
            "30",
            "27",
            "115"
        ],
        [
            "min/g",
            "27.6",
            "31.8",
            "31.0",
            "29.1",
            "29.9"
        ],
        [
            "fg/g",
            "4.2-8.2",
            "5.1-12.4",
            "5.7-12.1",
            "5.4-13.9",
            "5.1-11.7"
        ],
        [
            "pct",
            "50.6",
            "41.3",
            "47.3",
            "39.2",
            "43.9"
        ],
        [
            "3pt/g",
            "0.6-1.8",
            "0.6-3.0",
            "0.7-2.1",
            "1.0-3.4",
            "0.7-2.6"
        ],
        [
            "pct",
            "35.3",
            "20.2",
            "33.9",
            "29.0",
            "28.5"
        ],
        [
            "ft/g",
            "3.1-3.8",
            "4.4-5.2",
            "3.5-4.1",
            "4.6-5.6",
            "3.9-4.7"
        ],
        [
            "pct",
            "81.9",
            "84.6",
            "84.6",
            "82.8",
            "83.6"
        ],
        [
            "ppg",
            "12.1",
            "15.3",
            "15.6",
            "16.5",
            "14.9"
        ]
    ],
    "pageTitle": "Christine Clark - Harvard",
    "title": "",
    "url": "http://www.gocrimson.com/sports/wbkb/2013-14/bios/clark_christine_e8th?view=gamelog&pos=sh",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 5,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00274-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475411419,
    "recordOffset": 475381139,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{207171=© Copyright 2014 Harvard University All Rights Reserved, 71990=2012-13 (Junior) Named All-Ivy League first team ... Also named to the College Sports Madness Ivy League preseason first team ... Led the team in scoring in each of the first six games ... Named to the Ivy League Honor Roll after averaging 16.0 ppg, 4.0 rpg and 2.5 apg at North Dakota State and North Dakota ... Scored 15 points with three rebounds at North Dakota State (Nov. 9) ... Netted 17 points on 6-of-10 shooting and dished out four assists at North Dakota (Nov. 11) ... Recorded 18 points, four assists and three steals against BYU (Nov. 16) ... Named the Ivy League Player of the Week Nov. 26 after turning in 21.3 ppg, 6.3 rpg and 2.7 apg in three games ... Registered 25 points on 9-of-17 shooting, 3-of-4 from three, with six rebounds, three assists and three steals at Holy Cross (Nov. 20) ... Went for 23 points on 11-of-22 shooting at Michigan (Nov. 23) while also grabbing eight boards ... Scored 16 points and added four rebounds and four steals at Eastern Michigan (Nov. 24) ... Matched her career-highs in assists (5) and blocks (3) while scoring 14 points at Hofstra (Dec. 1) ... Recorded 17 points, four assists and two steals against Providence (Dec. 4) ... Scored eight points and added six rebounds and four assists at BU (Dec. 10) ... Tallied 15 points and three assists against No. 14/13 Oklahoma State (Dec. 28) ... Registered 11 points with four rebounds and three assists against SMU (Dec. 30) ... Named the Ivy League Player of the Week Jan. 7 after averaging 20.0 ppg and shooting 51.7 percent in a pair of wins ... Scored 19 points to enter Harvard's 1,000-point club against UMass (Jan. 2) and added four assists ... Recorded 21 points on 8-of-14 shooting with six rebounds at Rhode Island (Jan. 6) ... Named the Ivy League Player of the Week after scoring 22 points on 8-of-11 shooting with seven rebounds, two assists and two steals vs. Dartmouth (Jan. 12) ... Turned in her third straight 20-plus point performance with 22 points on 9-of-12 shooting at Dartmouth (Jan. 26) ... Named to the Ivy League Honor Roll after averaging 12.5 ppg and 6.5 rpg at Yale and Brown ... Recorded 19 points, six boards, three assists and three steals at Brown (Feb. 2) ... Just missed a double-double with 15 points and nine rebounds versus Cornell (Feb. 10) ... Named to the Ivy League Honor Roll after averaging 18.0 ppg and 8.0 rpg against Brown and Yale ... Scored 16 points and went 9-of-10 from the line against Brown (Feb. 22) ... Registered her first double-double of the year with 20 points and a career-high 13 rebounds against Yale (Feb. 23) ... Named the Ivy League Player of the Week after averaging 16.0 ppg, 4.5 rpg and shooting 81.3 percent against Princeton and Penn ... Tallied 14 points on 6-of-6 shooting against Princeton (March 1) ... Turned in 18 points on 7-of-10 shooting and grabbed seven rebounds against Penn (March 2) ... Named to the Ivy League Honor Roll after averaging 13.5 ppg and 5.5 rpg at Columbia and Cornell ... Recorded 22 points while going 10-of-11 from the line with six rebounds at Cornell (March 9) ... Posted a double-double with 15 points on 7-of-10 shooting and 10 boards at Hartford (March 21) ... Tallied 15 points and a career-high six assists at Drexel (March 23)., 70535=2013-14 (Senior) Named All-Ivy League first team … College Sports Madness Preseason All-Ivy Player of the Year … College Sports Madness Preseason All-Ivy first team … Team captain … Registered 22 points, pulled down seven rebounds and had five assists versus Cal Poly (Nov. 9) … Notched 21 points against Boston University (Nov. 13) … Tallied 21 points, three rebounds and three assists versus North Dakota State (Nov. 16) … Added 21 points against FIU (Nov. 19) … Dropped 21 points at Colgate on 8-of-18 shooting (Nov. 23) … Contributed 28 points (9-of-17) at Northeastern along with seven rebounds (Nov. 26) … Scored 17 points and had seven rebounds against Dartmouth (Jan. 25) … Scored 25 points and grabbed five rebounds at Princeton (Jan. 31) … Neared a double-double with 10 points and nine rebounds at Penn (Feb. 1) … Netted 19 points, added five rebounds and handed out two helpers at Brown (Feb. 7) … Contributed 21 points, pulled down four rebounds and four assists versus Columbia (Feb. 14) … Posted 20 points and four rebounds versus Cornell (Feb. 15) … Netted 23 points, chipped in nine rebounds and dished out three assists at Cornell (Feb. 28) ... Scored 20 points on 7-of-11 shooting while contributing four rebounds and four assists versus Brown (March 8) … Netted 16 points, including the game-winning basket as time expired, at Iona in the first round of the WNIT (March 20). , 75270=2011-12 (Sophomore) First Team All-Ivy League ... Ranked third in the Ivy League in free-throw percentage (84.6), fifth in scoring (15.3), eighth in minutes played (31.8), 10th in steals (1.5), 12th in rebounding (5.6) and 12th in field-goal percentage (41.3) ... Named to the Ivy League Honor Roll, Hawkeye Challenge All-Tournament Team and CollegeSportsMadness Ivy League Player of the Week after averaging 22.5 ppg, 5.5 rpg, 3.0 apg and shooting 55.5 percent at the Hawkeye Challege ... Matched her career-high of 28 points at Iowa (Nov. 12) with six rebounds, three assists and three blocks ... Scored 17 points, including 15 in the second half, on 5-of-7 shooting from the floor and 7-of-8 at the line vs. Butler (Nov. 13) ... Tallied 10 points, five rebounds, two assists and three steals at Providence (Nov. 18) ... Named the Ivy League Player of the Week Nov. 28 after averaging 17.5 ppg and 7.0 rpg against Rhode Island and Holy Cross ... Scored 18 points and grabbed nine rebounds versus Rhode Island (Nov. 22) ... Notched 18 points on 8-of-12 shooting with five rebounds, two assists and two steals against Holy Cross (Nov. 27) ... Went 11-of-11 at the line and finished with 16 points, seven rebounds and three assists at New Hampshire (Dec. 6) ... Scored 16 points and was 8-of-8 at the line against Alcorn State (Dec. 9) ... Tallied 12 points, nine rebounds and three steals against St. John's (Dec. 22) ... Named to the Ivy League Honor Roll after scoring 15 points with nine rebounds and three steals at Hartford (Dec. 29) ... Registered 13 points and a season-high four assists at UMass (Jan. 3) ... Scored 13 points, grabbed four rebounds, dished out three assists and blocked two shots at TCU (Jan. 7) ... Named to the Ivy League Honor Roll after registering a 17-point, 10-rebound double-double at Dartmouth (Jan. 14) ... Tallied 13 points on 5-of-7 shooting and three steals in just 15 minutes of action against Brown (Jan. 29) ... Named the Ivy League Player of the Week Feb. 6 after averaging 22.0 ppg at Cornell and Columbia and going 17-of-17 at the line ... Scored 23 points at Cornell (Feb. 3) with six rebounds and a career-high five steals ... Notched 21 points at Columbia (Feb. 4) while going 12-of-12 from the line, matching Reka Cserny '05 for the best single-game performance in program history ... Recorded back-to-back double-doubles with 17 points and 11 rebounds against Princeton (Feb. 11) and 20 points with 10 reboundsat Brown (Feb. 17) ... Named the Ivy League Player of the Week Feb. 20 after averaging 21.5 ppg and 8.5 rpg, including back-to-back 20-point performances, at Brown and Yale ... Netted 23 points on 10-of-12 shooting and grabbed seven rebounds at Yale (Feb. 18) ... Scored 18 points, grabbed seven boards and dished out three assists against Columbia (March 2) ... Tallied 23 points on 9-of-15 shooting with seven rebounds and two steals at Hofstra (March 15)., 81155=Before Harvard A McDonald’s All American Nominee and four-sport athlete from Tucson Magnet High School, is ranked No. 57 as a point guard on ESPN HoopGurlz. ... Led her team to a compelling 26-2 record averaging 18.5 points, 4.3 assist, 8.7 rebounds and 4.4 steals a game in senior season ... A three- time 5A All-State and three-time first-team All-Southern Arizona region honoree ... Three-time 5A Southern Arizona Player of the Year ... Nominee for the USA Basketball U-18 team as a senior ... A two-time Tucson Magnet High School Athlete of the Year ...  The 2009 State Champion in the 300-meter hurdles, 2010 state champion in the 100 and 300-meter hurdles and finished fifth in the 2010 high jump ...  Holds the high jump and 100 meter hurdles record at her school ... A finalist for the 2010 Arizona Scholar-Athlete of the Year., 69477=Finished fourth in Harvard history with 1,711 points Finished second in Harvard history with 447 free throws. Three-time All-Ivy League first team (2013-14, 2012-13,  2011-12) 2010-11 Ivy League All-Rookie selection. Has earned 11 Ivy League weekly awards (8 Player of the Week, 3 Rookie of the Week). Has recorded six double-doubles., 78230=2010-11 (Freshman) Named to the Ivy League all-rookie team ... Started all 28 games thiss season ... Was fourth on the team and eighth in the Ivy League in scoring, averaging 12.1 points per game ... Made 50.6 percent of her field goal attempts ... Was second on the team and 18th in the Ancient Eight in rebounds per game, averaging 4.7 boards ... Made 33 steals ... Scored seven points, handed out two assists, grabbed two rebounds and collected a steal in collegiate debut against Maine (Nov. 13) ... Named Ivy League Rookie of the Week (Nov. 22) for averaging  12.5 points, 5.5 rebounds and 2.5 assists per game in a win and loss for Harvard ... Scored a career-high 13 points, grabbed a career-high seven rebounds and handed out a career-best four assists in an 84-76 win over Oral Roberts (Nov. 19) .... Led the Crimson with 12 points at Navy (Nov. 20) ... Scored 11 points, grabbed five rebounds and handed out three assists against BU (Nov. 23) ... Scored a team-high 12 points which included a 4-for-4 effort from the free throw line at Holy Cross (Nov. 28) ... Went 4-for-6 from the field for 11 points and three rebounds in win over Hartford (Dec. 3) ... Named Ivy Leage Rookie of the Week (Dec. 6) ... Posted 10 points which included a 6-for-6 effort from the free throw line and a career-best five assists at Florida (Dec. 7) ... Scored a career-high 18 points on a 6-for-11 performance from the field, grabbed three rebounds and handed out three assists in win over UNH (Dec. 10) ... Led the Crimson with 18 points on a 7-for-9 effort from the field and grabbed five rbounds in loss to Sacred Heart (Dec. 22) ... Named to the Ivy League Honor Roll on Dec. 23 ... Had nine points and three assists at Dayton (Dec. 30) ... Made 7-of-8 attempts from the field for 16 points and grabbed six rebounds in win over UMass (Jan. 2) ... Named to the Ivy League Honor Roll on Jan. 3 ... Converted on 5-of-11 shots for 11 points at Boston College (Jan. 6) .... Grabbed a career-high eight reounds, scored six points and handed out four assists in win over NJIT (Jan. 9) ... Notched first collegiate double-double with 18 points and 10 rebounds on a 7-of-10 effort from the floor against Dartmouth (Jan. 15) ... Named to the Ivy League Honor Roll on Jan. 17 ... Scored the game winning basket against Columbia with 3.5 seconds left on the clock. Had 10 points against the Lions (Jan. 28) ... Named to the Ivy League Honor Roll on Jan. 31 ... Had game-high 18 points on an 8-for-8 effort from the line, five rebounds and two assists in win over Princeton (Feb. 4) ... Scored 13 points against Penn (Feb. 5) ... Named to the Ivy League Honor Roll on Feb. 7 ... Scored a career-high 28 points on an 11-for-13 effort from the field in win over Columbia (Feb. 19) ... Named Ivy League Rookie of the Week for Feb. 21 ... Dropped in 19 points in season finale at Dartmouth (Mar. 8).}",
    "textBeforeTable": "Christine Clark 22 22 Related Bios Gisele Bailey Ali Curtis Kaitlyn Dinkins Jasmine Evans Temi Fagbenle Taylor Finley Elise Gordon Maggie Hartman AnnMarie Healy Grace Keane Erin McDonnell Kit Metoyer Melissa Mullins Destiny Nunley Shilpa Tummala }); }); $(this).toggleClass('active').next('ul').toggleClass('active'); $('.secondary-nav > h1').click(function() { $(function() { })(jQuery); }); }); $('.has-submenu.active').removeClass('active'); $(document).on('click', function(e) { }); return false; $(this).parent().toggleClass('active'); $('.has-submenu > a', '#global-nav').on('click', function() { }); return false; $('#global-nav').removeClass('active'); $('#jump-to-global-nav').removeClass('active'); $('#global-nav .close').click(function(e) { }); $('#global-nav').toggleClass('active'); $(this).toggleClass('active'); e.preventDefault(); $('#jump-to-global-nav').click(function(e) { $(function() { (function($) {",
    "textAfterTable": "Yale W, 69-65 Mar 8 Brown W, 87-67 Mar 20 at Iona W, 90-89 Mar 24 at Rutgers L, 63-52 Statistics category Overall Conf Games 27 14 Games started 27 14 Minutes 786 417 Minutes per game 29.1 29.8 FG 147-375 76-196 FG Pct 39.2 38.8 3PT 27-93 16-50 3PT Pct 29.0 32.0 FT 125-151 67-78 FT Pct 82.8 85.9 Off rebounds 44 26",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}