{
    "relation": [
        [
            "Program Area",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE",
            "RE"
        ],
        [
            "Course Number",
            "AIS113",
            "ARH145",
            "COM263",
            "COM281",
            "CPD102AS",
            "CPD103BL or LDR101",
            "EXS265",
            "GBS120",
            "GBS205",
            "GCU221",
            "HES100",
            "HIS105",
            "HIS106",
            "HRM110",
            "PSY230"
        ],
        [
            "Course Name",
            "Proposal Writing",
            "History of American Indian Art",
            "Elements of Intercultural Communication",
            "Communication Activities",
            "Conflict Resolution",
            "Dynamics of Leadership or Emerging Leaders",
            "Theory of Coaching (any module)",
            "Workplace Communication Skills",
            "Legal, Ethical, and Regulatory Issues in Business",
            "Arizona Geography",
            "Healthful Living",
            "Arizona History",
            "Southwest History",
            "Introduction to Hospitality and Tourism Management",
            "Introduction to Statistics"
        ],
        [
            "Prerequisites",
            "ENG102 or ENG108",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "PSY101 with a grade of C or better and MAT092 or equivalent or permission of Instructor"
        ],
        [
            "Notes",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Credits",
            "3",
            "3",
            "3",
            "1",
            "2",
            "2",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3"
        ]
    ],
    "pageTitle": "Associate in Applied Science in Recreation Management | Programs & Degrees | Mesa Community College",
    "title": "",
    "url": "http://www.mc.maricopa.edu/programs/course-sequences/recreation-management-aas",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981856.5/warc/CC-MAIN-20150728002301-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 566172223,
    "recordOffset": 566156280,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{34922=mesacc.edu  |  480-461-7000  |  © 2015 Mesa Community College  |  A Maricopa Community College The Maricopa County Community College District is an EEO/AA institution and an equal opportunity employer of protected veterans and individuals with disabilities.}",
    "textBeforeTable": "Select from the following courses to meet the Restricted Elective requirement. Program Electives 6 Restricted Elective RE 3 Any approved General Education course in the Humanities & Fine Arts area Humanities & Fine Arts HUM 1–3 Permission of Instructor Volunteerism for Recreation: A Service Learning Experience or Volunteerism for Recreation: A Service Learning Experience or Volunteerism for Recreation: A Service Learning Experience REC282AA or REC282AB or REC282AC RC 3 Recreation Leadership REC250 RC 3 Outdoor Adventure Skills REC150AB RC 16–18 Credits Notes Prerequisites Course Name Course Number Program Area Term 4 2–4 Any recreational activity modules not used to satisfy other required courses Any REC155 course or Any Physical Education activity modules REC155++ or PED+++ RC 3 Any approved General Education course in",
    "textAfterTable": "Ready to get started? Follow one of the options below to get started on your personal career pathway. Become a Student Click here for MCC's easy-to-use Student Checklists. Program Information Learn more about and find contact information for the Recreation program. General Help Ask general questions over the phone at 480-461-7400 or via online chat. Disclaimer All information is administered by the Center for Curriculum and Transfer Articulation at Maricopa County Community College District and published is subject to change without notice. Every effort has been made to ensure the accuracy of information presented, but based on the dynamic nature of the curricular process, course and program information is subject to change in order to reflect the most current information available. View MCCCD's program website for the Associate in Applied Science in Recreation Management (https://aztransmac2.asu.edu/cgi-bin/WebObjects/acres.woa/wa/freeForm3?id=25604).",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}