{
    "relation": [
        [
            "Cart Icon",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart",
            "Add to Cart"
        ],
        [
            "Activity",
            "241033-01",
            "241033-02",
            "241033-03",
            "241033-04",
            "241033-05",
            "241033-06",
            "241033-07",
            "241033-08",
            "241033-09"
        ],
        [
            "Description",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash",
            "Wacky Dash"
        ],
        [
            "Dates",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15",
            "08/01/15- 08/01/15"
        ],
        [
            "Times",
            "8:00A- 8:00A",
            "8:10A- 8:10A",
            "8:20A- 8:20A",
            "8:30A- 8:30A",
            "8:40A- 8:40A",
            "8:50A- 8:50A",
            "9:00A- 9:00A",
            "9:10A- 9:10A",
            "9:20A- 9:20A"
        ],
        [
            "Fees",
            "$25",
            "$25",
            "$25",
            "$25",
            "$25",
            "$25",
            "$25",
            "$25",
            "$25"
        ],
        [
            "Single Icon",
            "Item Details",
            "Item Details",
            "Item Details",
            "Item Details",
            "Item Details",
            "Item Details",
            "Item Details",
            "Item Details",
            "Item Details"
        ],
        [
            "Status",
            "Available",
            "Available",
            "Available",
            "Available",
            "Available",
            "Available",
            "Available",
            "Available",
            "Available"
        ],
        [
            "Share",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email",
            "Share Facebook Twitter Pinterest Email"
        ]
    ],
    "pageTitle": "WebTrac Activity Search",
    "title": "",
    "url": "https://www.folsom.ca.us/wbwsc/webtrac.wsc/wbsearch.html?wbsi=f3b194aa-4a2d-6aa0-e311-7220c9c456e4&xxmod=ar",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 906311279,
    "recordOffset": 906279499,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{168320=T Games & Actvities from 9:00 a.m. to 5:00 p.m. The Greeting Card Clinic is held the 1st Thursday of every month at 12:30pm On the 4th Thursday of every month at 12:30pm there is a live performance by the local band \"Scotch, Tape and Baling Wire!\" This group specializes in folk, country and some soft rock. Shows are FREE and you don't need to reserve a seat., 141068=Off Key Singers is a fun and social group and meets every Monday. Social Bridge is for all levels and meets on the 1st and 3rd Monday each month. Senior Citizens Club meets the 2nd and 4th Monday of each month at 48 Natoma and you are invited to join in. The group enjoys socialization, lunch followed by bridge and bingo. The club meets on the second Monday of each month for a potluck, and the fourth Monday is a bring your sack lunch meeting. Occasional trips and guest speakers are also planned. Dues are $5 yearly and 50 cents per meeting. Meetings are held starting at 11:30 a.m. in activity rooms A and B at 48 Natoma. Meeting schedule: Sept. 8 & 22, Oct. 13 & 27, Nov. 10 & 24, and Dec. 8 & 22. For more information call 983-6903 or 983-4841, 124089=Parkinson's Support Group The Parkinson Association of Northern California, (PANC) will host a support group for people with Parkinson's, their caregivers and friends. For further information please contact: Ed or Yvonne Haskell at 916-353-1301. Information on Parkinson's Disease is available at the National Parkinson's Foundation website: www.parkinson.org or by calling 1-800-272-3900. Third Monday of each month - 10:00am-12:00pm - No fee for this group., 18478=Canadian Rockies Getaway July 19th-24th $2,395 (+750 single supplement) Enjoy 5 nights at one hotel in Banff. Trip highlights include Calgary City Tower, Bow Falls, Lake Louise, Yoho Nation Park, Valley of the Ten Peaks, Hoodoos, Banff National Park, and more! Fee includes roundtrip airfare, motor coach transportation, tour director, 5 night hotel accommodations, 7 meals, and baggage handling. For complete details pick up a brochure at the Folsom Senior and Art Center located at 48 Natoma Street or call 355-7285., 128553=Meals On Wheels by ACC This program serves hot lunches to seniors 60+, Monday-Friday at 11:30 a.m. at the Folsom Senior Center (48 Natoma St.). Home delivered meals are also available Monday-Friday. Call (916) 351-3386 to make a lunch reservation at the Folsom Senior Center. Call (916) 444-9533 to make a home delivered meal reservation. ($2/meal suggested donation). Lunch reservations for the entire week must be made by Monday the week prior., 46618=Folsom Sports Complex at 66 Clarksville Rd. Hours of Operation: Open Daily! Mon.-Fri. - 10:00A - 10:00P Sat. & Sun. - 9:00A - 10:00P Let us host your next birthday celebration! Parties include: - One hour play of desired sport Sports available are: soccer, basketball, flag football, dodgeball, kickball, or capture the flag - One hour in the party room with a trained birthday party host(ess) - Birthday child plus 15 guests - Four large pizzas (pepperoni or cheese) and four pitchers of soda - Party T-shirt for birthday child and balloons for everyone - Decorations, plates, napkins, cups, utensils; plus set-up and clean-up Fee: $325 - select one sport from the following: Soccer -- Flag Football -- Dodgeball -- Kickball -- Basketball -- Capture the Flag $10 each additional child (beyond 16) * All guests including parents and non-sport participants must have a liability waiver completed. NEW! Bounce House Birthday Party Package Party fee $350 for 1 hour in the bounce house and 1 hour in the party room. (Includes all of sports party features) Book your party today! For parties, team builders, other rentals at the Folsom Sports Complex, contact Derik Perez at (916) 984-2856 or dperez@folsom.ca.us, 132831=Join us for a Hot August Nights celebration. Guests will enjoy refreshments, a raffle, and a live Rock n' Roll performance! Events are free; make a lunch reservation with Meals on Wheels ($2 donation) by calling 351-3386 by 3/2, or bring your own brown bag lunch., 39369=Folsom Sports Complex at 66 Clarksville Rd. Hours of Operation: Open Daily! Mon.-Fri. - 10:00A - 10:00P Sat. & Sun. - 9:00A - 10:00P Featuring: - Two soccer fields; one indoor (187' x 85') and one mini outdoor for the smaller kids - Two indoor basketball courts (high school regulation) and two outdoor hoops - Three indoor regulation volleyball courts - Four indoor batting cages for softball or baseball, and one pitching/batting tunnel for baseball (pitching mat for fast pitch softball available) - Full locker rooms with shower facilities - Timeout Café with a family oriented menu - Meeting rooms for special events, team builders, and birthday parties - Arcade games and air hockey, and ping pong tables ------------------------------------------------------------------------------------------------------------------------------------- Rates & Rental Fees: Drop-In's: Batting Cage $2.50 token (20 pitches) $25 Punch Pass (12 tokens, save $5) Drop-In Soccer or Basketball (Indoor) $5 / 2 hour max session $20 Punch Pass (equal to 5 drop-ins) Drop-In Ping Pong $5 visit NEW!....Drop-In Pickleball $3/visit or $20 Punch Pass M/W/F 10A - Noon & Sun. 9-11A Drop-In Soccer or Basketball (Outdoor) $2/visit with valid High School student body card ------------------------------------------------------------------------------------------------------------------------------------- Indoor Rentals: 24 hours notice on all facility rentals Soccer Field $125/hour - December - May $90/hour - June - November Half Basketball Court $50/hour Full Basketball or Volleyball Court $70/hour Single Batting Cage available M-F after 7:30P; no weekend rentals $35/30 minutes; $65/60 minutes Pitching Mound & Hitting Tunnel $20/30 minutes; $40/60 minutes ------------------------------------------------------------------------------------------------------------------------------------- Outdoor Rentals: Mini Soccer Field $50/hour Basketball Court Half Court - $20/hour Full Court - $30/hour ------------------------------------------------------------------------------------------------------------------------------------- Room Rentals: West Room - $50/hour or $300/day East Room - $50/hour or $300/day Both Rooms - $80/hour or $480/day THE EDGE - $90/hour or $500/day Features: - Stage - Four Flat-screen TV's - 96\" retractable projection screen - Surround Sound - Coffee house-style furnishings ------------------------------------------------------------------------------------------------------------------------------------- For any and all inquiries, please contact the Folsom Sports Complex at 916-984-2850 or Derik Perez at 916-984-2856 or dperez@folsom.ca.us, 248248=The CAVE offers supervised recreational activities as an excellent after-school alternative for middle school children (6th-8th graders attending each middle school) who might otherwise be home alone at the end of their school day. Our Recreation Leaders will engage teens in activities that include pool, Ping-Pong, video games, movies, outdoor sports, snacks and more. The CAVE also offers a reference library for those students wanting to get a jump start on their daily homework. There is a CAVE Teen Center on both middle school campuses. The CAVE located at Folsom Middle School (Blue Ravine Campus) is located in Room 122, a triple-wide portable behind the two-story. A second CAVE site is located at Sutter Middle School (Riley Street Campus) in Room S-3 on the Persifer Street side of campus. Students who attend need to fill out a registration form and code of conduct form. These are available at the Folsom Parks & Recreation Department, at each CAVE site, or at the middle school office locations. There is an annual $150 administration fee due at the time of registration. Hours of Operation at both sites: Monday-Thursday close of school until 6:00PM Friday close of school until 5:30pm (including all early dismissal days). Site Phone numbers: Sutter Middle School CAVE 355-7203 Folsom Middle School CAVE 351-3530 For additional information: Folsom and Sutter Middle School CAVE, contact Ryan Erwin - 351-3510 or rerwin@folsom.ca.us}",
    "textBeforeTable": "with Katie Pearce Aquacise is the perfect combination of low impact, great conditioning, and cardiovascular exercise for all levels of fitness. This includes moms-to-be, seniors, those recovering from knee injuries, and athletes in their off season. A variety of resistance equipment is used for strength training and challenge. All equipment is provided. Drop-In: $7.00 10-visit Pass: $50.00 (expires 6 months from date of purchase) 121044 - Aquacise Showing: 1 to 75 Total Results: 439 Activity Search Results SubType: Category: All Categories Adult All Ages Folsom Aquatic Center Folsom Sports Complex Folsom Zoo Sanctuary Preschool Seniors Teens & Pre-Teens Youth Youth 2 - 6 Year Olds Show Search Criteria Sort Order: Activity/Number Start Date Start Time Description Availability Option: All Classes Only Available Classes Available Nonresident Classes Begin Month: All Months January February March April May",
    "textAfterTable": "Read Notice 155200-04 Sunday Coed I, II 04/12/15- 08/23/15 4:00P- 11:00P $1050/$1075 Item Details Unavailable Share Facebook Twitter Pinterest Email 156106 - Drop-In & Rental Fees Folsom Sports Complex at 66 Clarksville Rd. Hours of Operation: Open Daily! Mon.-Fri. - 10:00A - 10:00P Sat. & Sun. - 9:00A - 10:00P Featuring: - Two soccer fields; one indoor (187' x 85') and one mini outdoor for the smaller kids - Two indoor basketball courts (high school regulation) and two outdoor hoops - Three indoor regulation volleyball courts - Four indoor batting cages for softball or baseball, and one pitching/batting tunnel for baseball (pitching mat for fast pitch softball available) - Full locker rooms with shower facilities - Timeout Café with a family oriented menu - Meeting rooms for special events, team builders, and birthday parties - Arcade games and air hockey, and ping pong tables ------------------------------------------------------------------------------------------------------------------------------------- Rates & Rental Fees: Drop-In's: Batting Cage $2.50 token",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}