{
    "relation": [
        [
            "Remaining Maturity",
            "Loans1",
            "U.S. Treasury securities2",
            "Holdings",
            "Weekly changes",
            "Federal agency debt securities3",
            "Holdings",
            "Weekly changes",
            "Mortgage-backed securities4",
            "Holdings",
            "Weekly changes",
            "Asset-backed securities held by TALF LLC5",
            "Repurchase agreements6",
            "Central bank liquidity swaps7",
            "",
            "Reverse repurchase agreements6",
            "Term deposits"
        ],
        [
            "Within 15 days",
            "67",
            "",
            "0",
            "0",
            "",
            "0",
            "- 808",
            "",
            "0",
            "0",
            "0",
            "0",
            "1,293",
            "",
            "98,069",
            "11,913"
        ],
        [
            "16 days to 90 days",
            "112",
            "",
            "4",
            "0",
            "",
            "6,633",
            "0",
            "",
            "0",
            "0",
            "0",
            "0",
            "186",
            "",
            "0",
            "0"
        ],
        [
            "91 days to 1 year",
            "111",
            "",
            "381",
            "0",
            "",
            "17,518",
            "+ 565",
            "",
            "0",
            "0",
            "0",
            "...",
            "0",
            "",
            "...",
            "0"
        ],
        [
            "Over 1 year to 5 years",
            "73",
            "",
            "622,371",
            "+ 22,613",
            "",
            "39,153",
            "- 565",
            "",
            "2",
            "0",
            "0",
            "...",
            "0",
            "",
            "...",
            "..."
        ],
        [
            "Over 5 year to 10 years",
            "0",
            "",
            "855,332",
            "- 19,377",
            "",
            "62",
            "0",
            "",
            "2,643",
            "+ 74",
            "0",
            "...",
            "0",
            "",
            "...",
            "..."
        ],
        [
            "Over 10 years",
            "...",
            "",
            "523,005",
            "+ 4,483",
            "",
            "2,347",
            "0",
            "",
            "1,297,186",
            "+ 52,793",
            "0",
            "...",
            "0",
            "",
            "...",
            "..."
        ],
        [
            "All",
            "364",
            "",
            "2,001,093",
            "+ 7,718",
            "",
            "65,713",
            "- 808",
            "",
            "1,299,831",
            "+ 52,867",
            "0",
            "0",
            "1,479",
            "",
            "98,069",
            "11,913"
        ]
    ],
    "pageTitle": "FRB: H.4.1 Release-- Factors Affecting Reserve Balances -- Thursday, August 15, 2013",
    "title": "",
    "url": "https://www.federalreserve.gov/releases/h41/20130815/h41.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982745.46/warc/CC-MAIN-20150728002302-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905677951,
    "recordOffset": 905643542,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{1643=June 12, 2014, 1722=4:30 P.M. EDT}",
    "TableContextTimeStampAfterTable": "{611=August 15, 2013, 227470=9. Statement of Condition of Each Federal Reserve Bank, August 14, 2013, 3493=Aug 15, 2012, 157054=TALF LLC is a limited liability company formed to purchase and manage any asset-backed securities received by the FRBNY in connection with the decision of a borrower not to repay a TALF loan. TALF LLC has committed, for a fee, to purchase all asset-backed securities received by the FRBNY in conjunction with a TALF loan at a price equal to the TALF loan plus accrued but unpaid interest. Prior to January 15, 2013, the U.S. Treasury's Troubled Asset Relief Program (TARP) committed backup funding to TALF LLC, providing credit protection to the FRBNY. However, the accumulated fees and income collected through the TALF and held by TALF LLC now exceed the remaining amount of TALF loans outstanding. Accordingly, the TARP credit protection commitment has been terminated, and TALF LLC has begun to distribute excess proceeds to the Treasury and the FRBNY. Any remaining funds will be shared by the FRBNY and the U.S. Treasury., 133177=Note: On June 26, 2008, the Federal Reserve Bank of New York (FRBNY) extended credit to Maiden Lane LLC under the authority of section 13(3) of the Federal Reserve Act. This limited liability company was formed to acquire certain assets of Bear Stearns and to manage those assets through time to maximize repayment of the credit extended and to minimize disruption to financial markets. Payments by Maiden Lane LLC from the proceeds of the net portfolio holdings will be made in the following order: operating expenses of the LLC, principal due to the FRBNY, interest due to the FRBNY, principal due to JPMorgan Chase & Co., and interest due to JPMorgan Chase & Co. Any remaining funds will be paid to the FRBNY., 131690=Fair value. Fair value reflects an estimate of the price that would be received upon selling an asset if the transaction were to be conducted in an orderly market on the measurement date. Revalued quarterly. This table reflects valuations as of June 30, 2013. Any assets purchased after this valuation date are initially recorded at cost until their estimated fair value as of the purchase date becomes available., 155599=Note: On November 25, 2008, the Federal Reserve announced the creation of the Term Asset-Backed Securities Loan Facility (TALF) under the authority of section 13(3) of the Federal Reserve Act. The TALF is a facility under which the Federal Reserve Bank of New York (FRBNY) extended loans with a term of up to five years to holders of eligible asset-backed securities. The Federal Reserve closed the TALF for new loan extensions in 2010. The loans provided through the TALF to eligible borrowers are non-recourse, meaning that the obligation of the borrower can be discharged by surrendering the collateral to the FRBNY., 2377=Wednesday Aug 14, 2013, 123225=Aug 14, 2013, 147780=Note: On November 25, 2008, the Federal Reserve Bank of New York (FRBNY) began extending credit to Maiden Lane III LLC under the authority of section 13(3) of the Federal Reserve Act. This limited liability company was formed to purchase multi-sector collateralized debt obligations (CDOs) on which the Financial Products group of American International Group, Inc. (AIG) has written credit default swap (CDS) contracts. In connection with the purchase of CDOs, the CDS counterparties will concurrently unwind the related CDS transactions. Payments by Maiden Lane III LLC from the proceeds of the net portfolio holdings will be made in the following order: operating expenses of Maiden Lane III LLC, principal due to the FRBNY, interest due to the FRBNY, principal due to AIG, and interest due to AIG. Any remaining funds will be shared by the FRBNY and AIG., 140616=Note: On December 12, 2008, the Federal Reserve Bank of New York (FRBNY) began extending credit to Maiden Lane II LLC under the authority of section 13(3) of the Federal Reserve Act. This limited liability company was formed to purchase residential mortgage-backed securities from the U.S. securities lending reinvestment portfolio of subsidiaries of American International Group, Inc. (AIG subsidiaries). Payments by Maiden Lane II LLC from the proceeds of the net portfolio holdings will be made in the following order: operating expenses of Maiden Lane II LLC, principal due to the FRBNY, interest due to the FRBNY, and deferred payment and interest due to AIG subsidiaries. Any remaining funds will be shared by the FRBNY and AIG subsidiaries., 331968=9. Statement of Condition of Each Federal Reserve Bank, August 14, 2013 (continued), 2665=Week ended Aug 14, 2013, 420427=The Federal Reserve Bank of New York (FRBNY) has extended loans to several limited liability companies under the authority of section 13(3) of the Federal Reserve Act. On June 26, 2008, a loan was extended to Maiden Lane LLC, which was formed to acquire certain assets of Bear Stearns. On November 25, 2008, a loan was extended to Maiden Lane III LLC, which was formed to purchase multi-sector collateralized debt obligations on which the Financial Products group of the American International Group, Inc. has written credit default swap contracts. On December 12, 2008, a loan was extended to Maiden Lane II LLC, which was formed to purchase residential mortgage-backed securities from the U.S. securities lending reinvestment portfolio of subsidiaries of American International Group, Inc. On November 25, 2008, the Federal Reserve Board authorized the FRBNY to extend credit to TALF LLC, which was formed to purchase and manage any asset-backed securities received by the FRBNY in connection with the decision of a borrower not to repay a loan extended under the Term Asset-Backed Securities Loan Facility., 84147=2. Maturity Distribution of Securities, Loans, and Selected Other Assets and Liabilities, August 14, 2013, 3244=Aug 7, 2013}",
    "lastModified": "Thu, 12 Jun 2014 20:38:00 GMT",
    "textBeforeTable": "Millions of dollars 2. Maturity Distribution of Securities, Loans, and Selected Other Assets and Liabilities, August 14, 2013 Face value. Fully collateralized by U.S. Treasury securities. 4. Includes non-marketable U.S. Treasury securities, supranationals, corporate bonds, asset-backed securities, and commercial paper at face value. 3. Face value of federal agency securities and current face value of mortgage-backed securities, which is the remaining principal balance of the underlying mortgages. 2. Includes securities and U.S. Treasury STRIPS at face value, and inflation compensation on TIPS. Does not include securities pledged as collateral to foreign official and international account holders against reverse repurchase agreements with the Federal Reserve presented in tables 1, 8, and 9. 1. Note: Components may not sum to totals because of rounding.        793 +      189 +       45        816",
    "textAfterTable": "Note: Components may not sum to totals because of rounding. ...Not applicable. 1. Excludes the loans from the Federal Reserve Bank of New York (FRBNY) to Maiden Lane LLC, Maiden Lane II LLC, Maiden Lane III LLC, and TALF LLC. The loans were eliminated when preparing the FRBNY's statement of condition consistent with consolidation under generally accepted accounting principles. 2. Face value. For inflation-indexed securities, includes the original face value and compensation that adjusts for the effect of inflation on the original face value of such securities. 3. Face value. 4. Guaranteed by Fannie Mae, Freddie Mac, and Ginnie Mae. Current face value of the securities, which is the remaining principal balance of the underlying mortgages. 5. Face value of asset-backed securities held by TALF LLC, which is the remaining principal balance of the underlying assets. 6. Cash value of agreements. 7. Dollar value of foreign currency held under these agreements valued at the exchange rate to be used when the foreign currency is returned to the foreign central bank. This exchange rate equals the market exchange rate",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}