{
    "relation": [
        [
            "Brand",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Belkin",
            "Benq",
            "Biltema",
            "C3 Tech",
            "Cyberpower",
            "Dell",
            "Dell",
            "Dell",
            "Dell",
            "Delock",
            "Deltaco"
        ],
        [
            "Name",
            "4-Port Ultra-Slim Desktop Hub",
            "Hi-Speed USB 2.0 4-Port Hub",
            "TetraHub™ USB 2.0 4-Port Hub",
            "Hi-Speed USB 2.0 4-Port Hub",
            "Hi-Speed USB 2.0 7-Port Hub",
            "MyEssentials 7-Port High-Speed USB 2.0 Hub",
            "Hi-Speed USB 2.0 4-Port Lighted Hub",
            "Hi-Speed USB 2.0 7-Port Lighted Hub",
            "Hub 2-en-1",
            "Hi-Speed USB 2.0 7-Port Hub",
            "Ultra-Slim Desktop Hub",
            "",
            "",
            "",
            "High-speed Hub",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "Model Number",
            "F4U040",
            "F5U224",
            "F5U231",
            "F5U234",
            "F5U237",
            "F5U259-ME",
            "F5U403",
            "F5U700",
            "F5U706ea",
            "F5U237v1",
            "F4U039qukAPL",
            "E2220HD",
            "23-924",
            "",
            "CP-H720P",
            "2001FP",
            "SP2309W",
            "2407FWP",
            "U3011",
            "B/N61393",
            "UH-715 Rev 2"
        ],
        [
            "Hardware ID",
            "05e3:0608",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "05e3:0608",
            "",
            "",
            "",
            "0409:0050",
            "",
            "",
            "",
            "",
            "",
            ""
        ],
        [
            "USB Version",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0",
            "USB 2.0"
        ],
        [
            "Number of Ports",
            "4-Port",
            "4-Port",
            "4-Port",
            "4-Port",
            "7-Port",
            "7-Port",
            "4-Port",
            "7-Port",
            "7-Port",
            "7-Port",
            "7-Port",
            "4-Port",
            "4-Port",
            "7-Port",
            "7-Port",
            "4-Port",
            "4-Port",
            "4-Port",
            "4-Port",
            "4-Port",
            "7-Port"
        ],
        [
            "Power Rating*",
            "5v - 2.6A",
            "5v - 500mA per Port",
            "5v - 500mA per Port",
            "5v - 500mA per Port",
            "5v - 3.8A",
            "",
            "",
            "",
            "",
            "5v - 2.5A",
            "",
            "",
            "2.0A",
            "5V - 2.0A",
            "3.6A",
            "",
            "",
            "",
            "",
            "2.0A",
            "2.0A"
        ],
        [
            "Powers RPi",
            "Not Verified",
            "Not Verified",
            "Verified",
            "Verified",
            "Verified",
            "Verified",
            "Not Verified",
            "Verified",
            "Verified",
            "Verified",
            "Verified",
            "Verified",
            "Verified",
            "Not Verified",
            "Verified",
            "Not Verified",
            "Not Verified",
            "Not Verified",
            "Not Verified",
            "Verified",
            "Verified"
        ],
        [
            "Additional Information",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            "Monitor with built in Hub",
            "",
            "Backpowering - Mod hub or cut red wire in uplink cable.",
            "May Contain dual 05e3:0608 instead of 0409:0050",
            "Monitor with built in Hub",
            "Monitor with built in Hub",
            "Monitor with built in Hub - 6-in-1 Card Reader Works but cannot read SDXC",
            "Monitor with built in Hub - Card Reader Works - May work with SDXC",
            "",
            ""
        ]
    ],
    "pageTitle": "RPi VerifiedPeripherals - eLinux.org",
    "title": "",
    "url": "http://elinux.org/index.php?title=RPi_VerifiedPeripherals&oldid=195908",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00327-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 83652787,
    "recordOffset": 83580336,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{225169=Shortly after the Raspberry Pi was released it was confirmed that there were a number of issues with the Linux USB driver for the SMSC95xx chip. These included problems with USB 1.x peripherals that use split transactions, a fixed number of channels (causing problems with Kinect) and the way the ARM processor handles the SMSC95xx interrupts. [1] [2] A large number of fixes were included in the 2012-08-19-wheezy-raspbian Linux image., 53293=Here It is another option: http://www.dealextreme.com/p/hdmi-v1-4-male-to-vga-female-converter-adapter-cable-white-15cm-130458, is cheap (it's free shipping from china) and works perfectly, I tested it with an Acer VGA monitor (AL1511), without no change in my XBMC distribution. The config.txt for Raspbian (Flatron VGA monitor 1024 * 768): hdmi_drive=2 hdmi_group=2 hdmi_mode=16 hdmi_force_hotplug=1 disable_overscan=0, 103674=This adapter works, but (probably) requires a bit of work. The driver for the chipset (Asix AX88178) included with the Raspbian kernel (v 3.1.9+ Aug 7 2012) does not work. With that driver the device is detected, but it does not seem to be possible to actually put any traffic through it. :-( In order to make it work you need to download the latest driver from the chipset manufacturer. The version I used was \"Linux kernel 3.x/2.6.x Driver\" v4.4.0, released 2012-05-18. Fortunately this is GNU GPLv2 -licenced source code and not a binary blob, so compiling it for the Raspberry Pi is perfectly doable. The hardest part was in fact getting the Linux source code required, because the repositores contained the source for the wrong kernel version. >:-( Fortunately there is a very useful guide for how to get the sources from github, and preparing that source so that you can compile modules. Unfortunately you will have to compile the kernel (even if you don't actually install it) - which will take the better part of the day on the Raspberry, but once that's done you can unpack the driver source and just run \"make && sudo make install\". Reboot and you should have a fully working ethernet adapter., 60293=The HDMI to DVI-D cable provided by Apple with the 2010 Mac Mini worked. It does not appear this adapter can be purchased separately., 58692=Sanoxy HDMI to VGA converter, $27 from Amazon, no changes required with official Raspbian Wheezy image (2012-Jul-15), note: had already disabled overscan previously, 47642=Note that manufacturers change their designs over time, even as the specs stay the same. (E.g. an ACME 8 GB class 4 card manufactured in 2011 might work, while one manufactured in 2012 might not.) For this reason, please specify product numbers in the lists below, when possible., 225605=Model B Hardware Revision 2.0 and Revision 1.0 with ECN0001 change This had the polyfuses removed, removing the 100mA current limitation for each USB port (but leaving the main fuse F3 intact). Users should still ensure their power supply can power the RPi and the USB peripherals. Revision 2.0 was released in August 2012., 52679=And another one: http://cgi.ebay.pl/ws/eBayISAPI.dll?ViewItem&item=251086464644. Very cheap but works perfectly. No config.txt changes was needed at all. I've booted Raspbian and OpenELEC. Monitor is detected correctly and the optimal resolution is set (Raspbian) or you can change the res in the menu (OpenELEC). The /opt/vc/bin/tvservice is able to read monitor edid data. I tested the adapter using NEC 72VM 15\" LCD. (1280x1024 60Hz, 1024x768 60Hz, 640x480 works) The adapter is based on Lontium LT8511A chip, but I was unable to get the spec for it. The D1 diode is getting very hot though. Most likely the adapter drives more than 200mA. The standard RS Components 1,2A usb power supply is able to provide enough power for the RPi and the adapter. I'll try to modify the adapter to connect external power to bypass D1. Marcin., 56396=http://www.ebay.com/itm/ws/eBayISAPI.dll?ViewItem&item=130699741793 -- eBay is swarming with $16 converters all like this one., 56130=This adapter -- http://www.ebay.co.uk/itm/300692770623 -- works from 640x480 up to 1920x1080, audio over HDMI works too. Sadly the IC's on the PCB have all been scrubbed. Requires HDMI boost and overscan, config.txt settings for 640x480@60Hz: hdmi_drive=2 hdmi_group=2 hdmi_mode=4 config_hdmi_boost=4 overscan_top=-30 overscan_bottom=-30 overscan_left=-30 overscan_right=-30, 55532=According to user \"Mortimer\" -- HDFuryPro HDMI to YPbBr/VGA Converter found on Amazon -- http://www.amazon.co.uk/Inputs-Component-Video-YPbPr-Converter/dp/B00797ZZ4S/ -- Works with Raspberry Pi. Tested against a Philips 170B 1280x1024 LCD monitor, producing a full native resolution image. Not tested against a Component Video TV yet, and audio has yet to be got working. The config.txt settings used are: hdmi_drive=2 hdmi_group=2 hdmi_mode=36 disable_overscan=1}",
    "textBeforeTable": "Working USB Hubs If you use a powered hub and PI PSU together consider powering them from the same power bar with switch, so you can turn them on simultaneously., especially if the HUB tries to feed the PI through their interconnect cable, due to the 100mA limiting fuse in the PI the PI will be partially powered which may cause problems (unwanted writes to the SD card). A number of low-cost powered USB hubs are known to have caused problems. Members of the Raspberry Pi forums have reported low power or no power at all in some cases. The following is a list of specific Powered USB Hubs which appear to be fault-free. Please note that these do not take into account powering the Raspberry Pi from the hub, in addition to its peripherals. Powered USB Hubs Shortly after the Raspberry Pi was released it was confirmed that there were a number of issues with the Linux USB driver for the SMSC95xx chip. These included problems with USB 1.x peripherals that use split transactions, a fixed number of channels (causing problems with Kinect) and the way the ARM processor handles the SMSC95xx interrupts. [1] [2] A large number of fixes were included in the 2012-08-19-wheezy-raspbian Linux image. Linux Driver Issues Model B Hardware Revision 2.0 and Revision 1.0 with ECN0001 change This had the polyfuses removed,",
    "textAfterTable": "'*' Power Ratings may not be completely accurate, use as rough guideline rather than fact. Acme USB 2.0 hub 4 port (ACME) Based on NEC μPD720114 USB2.0 Hub Controller USB ID 0409:005a NOTE! It is bus-powered hub, but very cheap and small and works after a small modding: on usb-hub board you have 4 holes: V, D+, D- and GND. Connect GND, D+ and D- to the RasPI, and additionally connect GND and +5v from power supply to the same holes on usb-hub GND and V. Now there is common contacts: GND, D+ and D- between RasPI and hub needed to work, and additional power for USB devices, connected to the hub. Tested on my RasPI. DYNEX 7port hub idVendor=0409, idProduct=0050 works D-Link [3] 7-Port USB Hub DUB-H7 (See note below - doesn't work for all, apparently). Working model marked BUBH7A....A5. Worked with Debian on production B model, for keyboard, mouse, and thumb drives, also worked with ArchLinux, didn't work with Bodhi Linux immediately thereafter. Recent model did not work with default raspbian firmware (3.1.9+ #272); updated firmware with rpi-update (to 3.2.27+ #66), now seems to work perfectly. [4] 4-Port USB Hub DUB-H4 Worked on Debian with keyboard, mouse, and thumb drive. Also tested with Raspbmc and external HD (powered through USB). While the hub has a charging",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}