{
    "relation": [
        [
            "",
            "2010-11",
            "2011-12",
            "2012-13",
            "2013-14",
            "Total"
        ],
        [
            "g",
            "25",
            "28",
            "19",
            "17",
            "89"
        ],
        [
            "gs",
            "17",
            "13",
            "8",
            "13",
            "51"
        ],
        [
            "w",
            "8",
            "14",
            "4",
            "7",
            "33"
        ],
        [
            "l",
            "11",
            "9",
            "10",
            "6",
            "36"
        ],
        [
            "sv",
            "0",
            "3",
            "1",
            "1",
            "5"
        ],
        [
            "cg",
            "12",
            "11",
            "7",
            "10",
            "40"
        ],
        [
            "ip",
            "130.2",
            "131.2",
            "90.2",
            "83.0",
            "436.0"
        ],
        [
            "h",
            "121",
            "116",
            "99",
            "85",
            "421"
        ],
        [
            "r",
            "60",
            "56",
            "48",
            "47",
            "211"
        ],
        [
            "er",
            "47",
            "48",
            "32",
            "40",
            "167"
        ],
        [
            "bb",
            "29",
            "39",
            "27",
            "30",
            "125"
        ],
        [
            "k",
            "67",
            "79",
            "54",
            "40",
            "240"
        ],
        [
            "k/g",
            "3.59",
            "4.20",
            "4.17",
            "3.37",
            "3.85"
        ],
        [
            "hr",
            "9",
            "14",
            "5",
            "7",
            "35"
        ],
        [
            "era",
            "2.52",
            "2.55",
            "2.47",
            "3.37",
            "2.68"
        ]
    ],
    "pageTitle": "Taylor Stroud - Sacramento State Athletics",
    "title": "",
    "url": "http://www.hornetsports.com/sports/sball/2013-14/bios/stroud_taylor_1yek?view=splits",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00141-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 501749723,
    "recordOffset": 501730399,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{222762=1981 - AIAW Div. II, 220703=Prospect Clinic Aug. 22, 9 am-2 pm, Ages 13-18, 221626=Archives Div. I Era Roster Player Career Stats (1990-Pres.) Recruiting Questionnaire Softball Facebook Page Donate to Softball Big Sky Conference NCAA Softball Stats, 220878=Online Media Guide Photo Galleries Video Highlights 2015 Quick Facts 2015 Capital Classic Live Stats, 26420=2014 Season A second team all-Big Sky Conference selection after going 7-6 with a 3.37 ERA…in 17 appearances, she had 13 starts, 10 complete games, three shutouts and a save in 83.0 innings of work…struck out 40 batters and opponents hit .255 when she was in the circle…in conference play, she was 4-1 with a 1.75 ERA, allowing just 33 hits and six extra base hits in 36.0 innings…Big Sky opposition hit just .237 against Stroud and the 1.75 ERA was the second best mark in the league…struck out 25 batters in league play compared to just six walks…her three shutouts matched a team best, and those blankings came against Iowa State, North Dakota and Portland State…completed her four-year career at Sacramento State with 33 victories, a 2.68 ERA, 89 appearances, 51 starts, 40 complete games, nine shutouts, five saves, 436.0 innings pitched and a .250 opponents batting average…the wins, complete games and innings pitched all rank seventh in Sacramento State’s Div. I (1990-pres.) career record book. 2013 Season Made 19 appearances in the circle, including eight starts, seven complete games and one shutout…had a 2.47 ERA, and limited the opposition to a .269 batting average in 90.2 innings…rarely received good run support from her offense and finished with a 4-10 record despite posting the second-best ERA in the Big Sky…of her 19 appearances, 11 came in relief…recorded the Hornets’ lone save of the season…amazingly, she was 0-5 against conference competition despite leading the Hornets and the conference with a 1.27 ERA…conference opponents batted just .222 against Stroud…received an average of 1.5 runs per game from her offense during her eight starts…tossed a six-hit shutout of Nevada, and allowed seven hits and no earned runs in a career-high 10.0 innings of relief against Weber State…struck out a season-best seven batters in both those games…of her 48 runs allowed during the season, 16 were unearned…her save came in a 3-2 victory against Santa Clara… has 26 career wins, which are tied for 10th in Sacramento State’s Div. I era 2012 Season Made a team-high 28 appearances in the circle, posting a 14-9 record and a 2.55 ERA…led the Hornets’ pitching staff in wins, appearances, ERA, complete games (11), saves (3), innings (131.2), strikeouts (79) and opponents batting average (.234)…15 of her 28 appearances came in relief…named the PCSC Coastal Division Pitcher of the Week on Feb. 13…her 14 wins are tied for the 12th best single-season mark in Sacramento State’s Div. I era (1990-pres.)…tossed a five-hit shutout against UC Riverside, and was a part of two combined shutouts of North Dakota State and Colorado State…had a career-high 11 strikeouts at Saint Mary’s on April 1…her three saves tied for the second best mark in the Hornet Div. I single-season era…in the team’s final game of the season, she allowed just six hits and one unearned run in a 7-1 win at San Diego…in her 15 relief appearances, she was 7-3 with a 1.52 ERA…named to the PCSC’s Commissioner’s Honor Roll for the second straight year. 2011 Season An honorable mention all-PCSC Coastal Division selection as a freshman…posted an 8-11 record with a 2.52 ERA…led the Hornets in appearances (25), starts (17), complete games (12), shutouts (4), innings (130.2), opponents batting average (.248) and strikeouts (67)…among PCSC Coastal Division leaders, she ranked second in opponents batting average, third in innings, and fifth in both wins and ERA…walked just one batter every 4.2 innings, and her no-hitter against San Diego on April 9 was the first by a Hornet pitcher since 2006…among her four shutouts included a three-hitter against Pacific and two-hitters against both Loyola Marymount and Utah State…also had a relief appearance against ninth-ranked Cal where she allowed two hits and no runs in five innings…against PCSC competition, she went 4-5 with a 2.56 ERA while allowing opponents a .249 batting average…named PCSC Player of the Week on two occasions (Feb. 14, March 14)...named to the PCSC’s Commissioner’s Honor Roll. High School A 2010 graduate of Montgomery High School in Santa Rosa, Calif…starting pitcher for the varsity squad all four years with the Vikings…put together a remarkable career that saw her rack up the following awards: two-time all-state, three-time all-West Region, three-time first team all-Empire, four-time first team all-North Bay League and four-time team MVP…during her final two seasons, she combined to go 35-4 with a 0.35 ERA, 33 complete games, 16 shutouts, 338 strikeouts, 37 walks, 259 innings and a .140 opponents batting average…as a senior, she was second team all-state, second team all-West Region, first team all-Empire, The Press Democrat Athlete of the Year and first team all-league after going 16-2 with a 0.49 ERA while throwing two no-hitters, striking out 164 batters and walking just 19 in 120 innings…as a junior, she was named first team all-state, North Bay League MVP and The Press Democrat’s Empire Player of the Year after going 19-2 with a section-best 0.25 ERA, including two no-hitters, 174 strikeouts,18 walks and a .137 opponents batting average in 139 innings…threw 85 straight scoreless innings to begin her junior year…allowed just eight earned runs in 2010, and five earned runs in 2009…named the North Bay League’s Freshman of the Year in 2007 and led the league with a 0.78 ERA as a sophomore…offensively, she batted at least .362 all four years…Montgomery combined for an 89-20 overall record, a 44-7 league mark and two league championships during her four seasons…a four-time scholar-athlete award winner. Personal Parents are Rod and Denise Stroud…a psychology major…played for the San Jose Lady Sharks 18-under gold team in 2009-10 after playing three years for the San Jose Strikkers (2006-08).}",
    "textBeforeTable": "Taylor Stroud 14 14 Related Bios Kayla Papez Paige Martin Shelby Johnston Sasha Margulies Alexis Martinez Makenzie Wayadande Kaitlyn Yerby Kortney Solis Jennifer Hartman Jessica Ravetti Nicole Clark Paris Prado T.J. Watts Riley Price Paige Castro Alyssa Vanderdrink Yesenia Alcala Nikki Gialketsis Caitlin Brooks Alexa Chattleton   News   |   Coaches   |   Statistics   |   Schedule/Results   |   Roster   |   Home Softball RSS Feeds Social Media Central YouTube Channel Live Audio WatchBigSky.com Live Stats Multimedia Multimedia Donate Now Upcoming Events",
    "textAfterTable": "L, 5-2 May 9 vs. Northern Colorado W, 4-0 May 9 at Idaho State L, 10-7 Statistics category Overall Conf Games 17 7 Plate appearances 0 0 At Bats 0 0 Runs 0 0 Hits 0 0 Doubles - - Triples - - Home Runs - - Runs Batted In 0 0 Total bases 0 0 Walks - - Hit by pitch - -",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}