{
    "relation": [
        [
            "",
            "2011-12",
            "2012-13",
            "2013-14",
            "2014-15",
            "Total"
        ],
        [
            "gp",
            "10",
            "10",
            "11",
            "9",
            "40"
        ],
        [
            "punt",
            "-",
            "5",
            "7",
            "5",
            "17"
        ],
        [
            "yds",
            "-",
            "150",
            "230",
            "171",
            "551"
        ],
        [
            "avg",
            "-",
            "30.0",
            "32.9",
            "34.2",
            "32.4"
        ],
        [
            "lg",
            "-",
            "41",
            "46",
            "39",
            "46"
        ],
        [
            "in20",
            "-",
            "3",
            "5",
            "4",
            "12"
        ],
        [
            "fc",
            "-",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "tb",
            "-",
            "0",
            "1",
            "0",
            "1"
        ],
        [
            "blk",
            "-",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Austin Damaschke - Concordia University Wisconsin",
    "title": "",
    "url": "http://cuwfalcons.com/sports/fball/2013-14/bios/damaschke_austin_ey6f?view=gamelog&pos=kr",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 16,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 59846071,
    "recordOffset": 59826432,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{41885=2012 Season (Sophomore): Named Wisconsin Football Coaches Association Private College Player of the Year…Named All-Northern Athletics Conference Second Team…Started all 10 games at quarterback…Led the team to a 7-3 overall record and a 6-1 NAC record…Directed the team to two three-games winning streaks and three second half game-winning drives…Finished with 2,440 passing yards, 25 passing touchdowns and six interceptions…Had a 152.50 pass efficiency rating…Ranked first in the NAC in completion percentage (66.1), tied for first in passing touchdowns (25), tied for the longest passing completion (85) and had the least interceptions (6) among starting quarterbacks…Threw for over 300 yards in three games and over 200 yards in six games…Had back-to-back 300 passing games mid-season…Finished with three or more touchdowns passes in four games and had seven multi-touchdown passing games…Completed over 60 percent of his passes in eight games and over 70 percent in three games…Recorded a touchdown pass to seven different receivers and a completion to 13 different receivers…Rushed for a team-best 252 yards on 146 carries…Scored a rushing touchdown in three games…Began the season with back-to-back two passing touchdown performances…Had the first 300-yard passing game (312) of his career and four touchdown passes on 19-of-24 passing against Maranatha Baptist Bible College (Oct. 6)…Recorded the first back-to-back 300-yard, four touchdown passing games of his career after throwing 307 yards and four touchdowns on 20-of-37 passing, also ran for a career-best 70 yards and a touchdown against Concordia University Chicago (Oct. 13)…Had a career day accounting for six touchdowns after throwing for 390 yards and five touchdowns on 26-of-37 passing, as well as rushing 36 yards and a touchdown at Aurora University (Nov. 3)., 43783=2011 Season (Freshman): Named Northern Athletics Conference Co-Freshman of the Year…Took over the starting quarterbacking duties in the fourth game of the season…Finished with 1,517 passing yards, 16 touchdowns and eight interceptions…Had a 125.54 pass efficiency rating...Ranked first among passers during NAC play in touchdown passes, yards, yards per game, completions and attempts…Had 200 or more passing yards in four games…Twice had back-to-back 200-yard passing games…Threw three or more touchdowns in three contests…Rushed for 238 yards on 75 carries and one touchdown…Tossed the first touchdown of his career on a 16-yard completion against Rockford College (Oct. 1)…Finished with 228 passing yards on 16-for-24 throwing against RC…Completed 11-of-17 passes for 215 yards and a season- and career-best four touchdowns against Maranatha Baptist Bible College (Oct. 8)…Threw for 215 yards and three touchdowns, while running for 32 yards on 12 carries against Aurora University (Oct. 22)…Completed 24 passes on a season-high 41 attempts for a season- and career-high 274 yards, along with three touchdowns against Wisconsin Lutheran College (Oct. 29)…Rushed for a season- and career-high 84 yards on 17 carries, including a career-long 32 yards, and his first touchdown against WLC., 207029=CONCORDIA UNIVERSITY WISCONSIN ATHLETICS 12800 NORTH LAKE SHORE DRIVE MEQUON, WI 53097, 38681=2013 Season (Junior): Named a finalist for the Gagliardi Trophy…Named Wisconsin Football Coaches Association Private College Player of the Year for the second-consecutive year…Named the Northern Athletics Collegiate Conference Offensive Player of the Year…Named All-NACC First Team…Named NACC Offensive Player of the Week three times…Named to the D3Football.com Team of the Week after a record-breaking performance with 536 total offensive yards, 425 passing yards (28-of-50 passing) and a career-high 111 rushing yards and four touchdowns against Lakeland College...Named team MVP...Led the team to an 8-3 overall record and an undefeated 6-0 NACC record…Guided the team to a seven-game winning streak to end the regular season…Set the NACC career record for total offensive yards (7,918) and pass completions (559)…Set the CUW career record for total offensive yards (8,266), passing touchdowns (65), pass completions (583), completion percentage (61.2)…Set the CUW single season record for total offensive yards (3,844), passing yards (3,171), completions (250) and passing attempts (398)…Set CUW single game records for total offensive yards (536) and passing yards (425) in a home victory over Lakeland College (Oct. 26)…Ranked fourth nationally in total offensive yards per game (349.5) and ninth in points responsible for (216.0)…Ranked in the top-50 in 11 different statistical categories…Ranked first in the NACC in completions, attempts, completion percentage, yards and passing touchdowns, seventh in rushing yards and tied for second in rushing touchdowns…Started all 11 games at quarterback…Finished with 3,171 passing yards and 24 passing touchdowns and seven interceptions on 250-of-398 passing (62.8 percent)…Had a 146.1 pass-efficiency rating…Ran for a team-high 673 yards and 12 touchdowns on 150 attempts (4.5 average)…Recorded six 300-plus yard passing games, including a season-high 425 yards…Twice threw for 300-plus yards in back-to-back games…Finished with seven multi-touchdown games, five with at least three and a career-high-tying five touchdown passes at Trine University (Sept. 21)…Completed over 70 percent of his passes in three games and over 60 percent of his passes in six games…Had a touchdown pass to six different receivers and a completion to 11 different receivers…Led the Falcons on a fourth-quarter comeback, driving the team 82 yards on eight plays in two minutes and 29 seconds for a 28-27 victory over Benedictine University (Oct. 5)…Had a combined 805 passing yards on 52-of-97 passing in victories at Concordia University Chicago (Oct. 19) and at home over Lakeland College (Oct. 26)…Twice tied a career-high with 28 completions at Trine University (Sept. 21) and at home against Lakeland College (Oct. 26)…Completed a pass over 32 yards in every game, including a completion of at least 50 yards in five games…Scored a rushing touchdown in seven games, including a score in five-straight games…Had three multi-rushing touchdown contests…Ran for over 50 yards in six games…Recorded a career-high 111 rushing yards and four rushing touchdowns in a home victory over Lakeland College (Oct. 26).}",
    "textBeforeTable": "Austin Damaschke 5 5 Related Bios Austin Padilla Michael Bahr Zak DeWindt Shannon Smith Brett Bengsch James Saunders Zach Stolenberg Shay Klitzke Austin Mugnai TJ Nelson V Cody Johnson Steve Carter Jack Kugler Peter Morton Brandon Wood Adedeji Giwa Jordan Juchniewich Taylor Devenport Andrew Worth Patrick Berg Dustin Veldboom Dylan Krivoshein Josh Hoffman Hunter Breunig Aaron Krapfl Joseph Grono John Palese Logan Hass Bathong Pham Stevan Isteefanos Brady Schmidt Tyler White Trayvay Conway LaCurt Evans Ryan Edleman Bryan Thomas QuRon Hall Joe Paul Brian Emo Josh Malkowski Kalvin Baena Brandon Martin Vincent Walker Jacob Grosenick Andrew Gatz Logan Peltier Dominic Saragaglia Kealin McLean Brett Waldorf Weston Kimmel Phillip Brechlin Nathan Prom David Gonzalez Ben Kempen Brady Meyer Drew Setzer Austin Kaatz Anthony Moro London Beth Vince Denor Raymond Morel Luke Scheuerlein Taylor Witty William Turner Jr. James Thomsen Richard Crane Cody Furey Nathan Krcma Richard Ellis Lane Lawson Andrew",
    "textAfterTable": "2012 Season (Sophomore): Named Wisconsin Football Coaches Association Private College Player of the Year…Named All-Northern Athletics Conference Second Team…Started all 10 games at quarterback…Led the team to a 7-3 overall record and a 6-1 NAC record…Directed the team to two three-games winning streaks and three second half game-winning drives…Finished with 2,440 passing yards, 25 passing touchdowns and six interceptions…Had a 152.50 pass efficiency rating…Ranked first in the NAC in completion percentage (66.1), tied for first in passing touchdowns (25), tied for the longest passing completion (85) and had the least interceptions (6) among starting quarterbacks…Threw for over 300 yards in three games and over 200 yards in six games…Had back-to-back 300 passing games mid-season…Finished with three or more touchdowns passes in four games and had seven multi-touchdown passing games…Completed over 60 percent of his passes in eight games and over 70 percent in three games…Recorded a touchdown pass to seven different receivers and a completion to 13 different receivers…Rushed for a team-best 252 yards on 146 carries…Scored a rushing touchdown in three games…Began the season with back-to-back two passing touchdown performances…Had the first 300-yard passing game (312) of his career and four touchdown passes on 19-of-24 passing against Maranatha Baptist Bible College (Oct. 6)…Recorded the first back-to-back 300-yard, four touchdown passing games of his career after throwing 307 yards and four touchdowns on 20-of-37 passing, also ran for a career-best 70 yards and a touchdown against Concordia University Chicago (Oct. 13)…Had a career day accounting for six touchdowns",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}