{
    "relation": [
        [
            "Course #",
            "ES 621",
            "ES 677",
            "ES 678",
            "ES 679",
            "ES 683",
            "ES 684",
            "ES 690",
            "ES 691",
            "ES 800",
            "ES 801",
            "ES 810",
            "ES 900",
            "ES 960"
        ],
        [
            "Course Name",
            "Fundamentals of Enterprise Systems Traditional systems engineering techniques must be adapted to understand a broader class of human designed systems that we refer to as an enterprise, of which a technical system is only one part. Students will learn how describe the value of systems engineering on complex projects, provide a (common) global view of the system and enterprise, elicit and write good requirements, and understand how to develop robust and efficient architectures. Students should complete this class with “next steps” knowledge of tools, templates, capability patterns, and community. Case studies and examples are used throughout to give students an appreciation of how systems engineering tools, techniques, and thinking can be applied to the real world enterprises that we encounter daily.",
            "Governing Development For a variety of business reasons, today’s business and government organizations are demonstrating a heightened interest in governance. Development programs and organizations have unique governance concerns due to inherent uncertainty of development efforts. Moving beyond platitudes, this course introduces modern concepts of organizational governance and their application to organizations that develop systems and products. Course topics include the business climate forcing an emphasis on governance; a general governance framework, including definitions of governance elements; governance as a process; governance solutions for the development teams; development governance styles; and advanced topics.",
            "Engineering of Agile Systems and Enterprises Real-time responsiveness characterizes systems at the forefront of competition, enterprise, strategy, warfare, governance, innovation, engineering, development, information, integration, and virtually anything designed today for purpose. This course covers fundamental objectives, performance metrics, analysis frameworks, and design principles for engineering agile and resilient systems. Real examples are analyzed in case studies for their change proficiency and response ability. Response capability frameworks are applied in analysis and requirements development. Architecture and design principles which enable resilient and innovative response are illuminated and then applied in synthesis exercises. Hands-on, minds-on exercises prepare and guide the participant in applying the knowledge. Systems for case study and focus can run the range from products and processes to governance and infrastructure to enterprises and systems-of-systems.",
            "Architecting the Extended Enterprise This course presents a systems architecting process to achieve enterprise integration both within and between corporate boundaries. The process leverages systems thinking - the antithesis of scientific reductionism, which fails to appreciate the interrelationships between components that make-up a system. Systems thinking has proven to be successful in the delivery of integrated technology products, and is now being applied to understanding the structure and dynamics of organizations for which communications and co-stuff in general is a key to business success; in other words inter-relationships are prime in managing an enterprise. The systems approach further emphasizes emergence, wider systems and the environment. These concepts are crucial to architecting an enterprise in consideration of issues of decentralization, alliance advantage, and market phenomena.",
            "Design of Agile Systems and Enterprises The frontier of systems engineering today seeks new levels of system capability and behavior, and expects to find that benefit in higher forms of systems that elude traditional control and creation concepts. Common themes converge here in a study of agility across a seemingly wide variety of interesting system types, characterized principally by aspects of self-organization and systems of systems. Esthetic quality in systems and enterprises makes the difference between enforced compliance and embraced experience; and determines the positive or negative vectors of self-organization and emergence. This module explores the value and nature of esthetic design quality, principles and architectures for harnessing self organized systems of systems, agility as risk management and reality confrontation, and similar issues at the edge of agile system and enterprise knowledge. (Formerly SYS790)",
            "Systems Thinking It takes something special for the term system to have such ubiquity. The downside is that it is overused, improperly so, detracting from its power. This class builds upon a solid conceptual foundation to ensure that the system/enterprise is properly defined, conceived, and realized. Uniquely, the class shows how it is possible to use systems in order to think more deeply and to act more decisively. This approach is made possible by emphasizing the simultaneity of perspectives, the role of paradox, and the centrality of soft issues in resolving complexity. The SystemitoolTM is used to structure and conduct analysis of decisions. This class is aimed at policy and decision-makers at all levels in an organization.",
            "Introduction to Infrastructure Systems Selected topics from various areas within Enterprise Systems. This course is typically taught to more than one student and often takes the form of a visiting professors course.",
            "Advanced Topics in Infrastructure Systems Building on the topics presented in ES 690, this course introduces advanced topics in infrastructure systems, focusing on tools and methodologies crucial to infrastructure systems analysis and planning. Topics discussed include CLIOS analysis and dynamic modeling of infrastructure systems, fundamentals of network analysis, decision analysis for infrastructure systems, and infrastructure resiliency.",
            "Special Problems in Enterprise Systems (ME) Three credits for the degree of Master of Science (Enterprise Systems). This course is typically conducted as a one-on-one course between a faculty member and a student. A student may take up to two special problems courses in a master’s degree program. A department technical report is required as the final product for this course.",
            "Special Problmes in Enterprise Systems (PhD) Three credits for the degree of Doctor of Philosophy. This course is typically conducted as a one-on-one one investigation of a topic of particular interest between a faculty member and a student and is often used to explore topical areas that can serve as a dissertation. A student may take up to two special problems courses in a Ph.D. degree program. A department technical report is required as the final product for this course.",
            "Selected Topics in Enterprise Systems Selected topics from various areas within Enterprise Systems. This course is typically taught to more than one student and often takes the form of a visiting professor’s course.",
            "Thesis in Enterprise Systems For the degree of Master of Science (Engineering Systems). A minimum of six credit hours is required for the thesis.",
            "Research in Enterprise Systems Original work, which may serve as the basis for the dissertation, required for the degree of Doctor of Philosophy. A minimum of 30 hours of ES 960 research is required for the Ph.D. degree."
        ],
        [
            "Credit",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "1",
            "1",
            "3",
            "1",
            "1"
        ],
        [
            "Lab",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ],
        [
            "Lecture",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "1",
            "1",
            "0",
            "1",
            "1"
        ],
        [
            "Study Hours",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0",
            "0"
        ]
    ],
    "pageTitle": "Courses | SSE - School of Systems & Enterprises",
    "title": "",
    "url": "https://www.stevens.edu/sse/academics/graduate/course-catalog",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 4,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00209-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 935820315,
    "recordOffset": 935771825,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{195863= This course covers the basics of Emerging Markets instruments, models, risks, hedging and trading practices. Emerging Markets have seen a dramatic increase in volume, especially since the latest crisis in the developed markets. Geographically the course will be focused on the 4 BRIC countries (Brazil, Russia, India and China) and Mexico. The student should develop a deep understanding of the main differences between Developed Markets and Emerging Markets risk and trading. Many of the unique attributes and models in Emerging Markets have now been adopted by Developed Markets since the 2008 crisis, given students an edge in understanding the latest trends in the markets. Main topics to be covered include: funding in EM; XC basis markets; OIS and local collateralization; Credit Valuation Adjustment (CVA); Extinguishable XC swaps; Inflation indexes and inflation currencies; Capital Constraints, Convertibility and Transferability.Prerequisites:  Probability, Statistics, and Calculus, 244725=© 2015 Stevens Institute of Technology. All rights reserved. Castle Point on Hudson, Hoboken NJ 07030-5991 USA +1.201.216.5000}",
    "lastModified": "Thu, 30 Jul 2015 05:50:59 GMT",
    "textBeforeTable": "Systems Security Engineering Socio-technical Systems Financial Engineering Software Engineering Engineering Management Systems Engineering } jQuery('#'+id).toggle(); { function showhide(id)",
    "textAfterTable": "Cost-Effective Space Mission Operations This course examines the real-world space mission operations. Taking a process-oriented approach, the course provides an in-depth view of the entirety of space mission operations, including the concept of operations and all functions that are performed in support of a space mission. Interactive discussions focus on initial requirements definition, operations concept development, functional allocation among spacecraft, payload, ground system and operators. A detailed model is provided that allows the user to estimate operations complexity and then prepare an estimate of the number of operators required and overall cost. This is a hands-on course with a focus on space missions for science, military and commercial applications. 3 0 3 0 SYS 638 Crew Exploration Vehicle Design This unique course gives participants a hands-on opportunity to apply key principles of space systems engineering. Participants are given a set of customer expectations in the form of broad mission objectives for a crew exploration vehicle with the task of applying systems engineering process to define top-level system requirements and design key elements of the system. The end result will be a system design review during which students present and defend their design decisions.  Course participants are given a set of mission objectives in the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}