{
    "relation": [
        [
            "HORMONE",
            "Gastrin",
            "Secretin",
            "Enterogastrone",
            "Cholesystokinin",
            "Pancreozymin"
        ],
        [
            "ORGAN IN WHICH IT IS SECRETED",
            "Stomach mucosa",
            "Duodenal mucosa",
            "Small intestine mucosa",
            "Small intestine mucosa",
            "Duodenal mucosa"
        ],
        [
            "STIMULATING FACTOR IN SECRETION PRODUCTION",
            "Presence of food in stomach",
            "Presence of acidic foods in duodenum",
            "Fatty acids",
            "Acidic foods",
            "Acidic foods"
        ],
        [
            "REACTION ORGAN",
            "Stomach mucosa",
            "Pancreas",
            "Stomach",
            "Gall bladder",
            "Pancreas"
        ],
        [
            "REACTION ORGAN’S RESPONSE",
            "Gastric fluid",
            "Initiates enzyme release",
            "Deceleration of stomach activity",
            "Gall bladder causes production of gall.",
            "Slow down the working of the pancreas"
        ]
    ],
    "pageTitle": "Read or download The Human Miracle",
    "title": "",
    "url": "http://www.evolutiondeceit.com/en/books/9599/The-Human-Miracle/chapter/14237/The-digestive-system-2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 3,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00277-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 436643439,
    "recordOffset": 436612657,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33966=Various mechanisms permit the foods to be transmitted along the digestive tract. One is the involuntary contraction of the muscles in the intestines. Thanks to the rhythmic contraction of these muscles, foodstuffs always progress in one direction only. But why? A team of researchers led by Jan Huizinga of McMaster University in Canada investigated this subject, examining the cells that bring about this one-way movement. They used micro-electrodes located along the digestive tract to establish that the so-called interstitial cells of Cajal set up a constant, regular electrical current. This current permits the muscles, that surround the intestine wall, to contract constantly. However, the presence of an electrical current is not sufficient for this mechanism to function. The current must also be set up with a flawless rhythm. Within the intestines, therefore, the cells of Cajal set up a web that allows them to give off electrical impulses at the same rhythm. (Science et Vie, September, 1998).}",
    "textBeforeTable": "Capillary blood vessels in the villum. Nucleotide building blocks Alkali Pancreas Deoxyribonucl ease and ribonuclease DNA and RNA Duodenum Small intestine NUCLEIC ACID DIGESTION Capillary lymph vessels (lymph pipelines) in the villum Fatty acid glycerine (glycerol) Alkali Pancreas Lipase Fat Duodenum Small intestine FAT DIGESTION Amino acids Alkali Small intestine glands Erycin Peptides (intermediate compounds such as tripeptide) Small intestine Peptides (amino-acids) Alkali Pancreas Chymotrypsin Peptone polypeptide Peptides (amino-acids) Alkali Pancreas Trypsin Peptone polypeptide Duodenum Separation of casein Acid Stomach Rennin Milk protein Capillary blood vessels in the villum   Peptone polypeptide Acid Stomach Pepsin (in",
    "textAfterTable": "All the process during digestion depicted above are performed in a complete and ordered manner. The digestive system’s flawless creation, which never gives rise to any confusion, belongs to Allah. One of the small intestine’s special features is its ability to absorb just enough of certain needed substances. For example, too much iron can harm the body. Iron reaching the intestines above a particular level is excreted without being digested. Were this not to happen, the result would be serious illnesses. In addition, as mentioned earlier, regions in a very special part of the small intestine are composed of cells prepared to absorb Vitamin B12. People who have this area of their intestines surgically removed must receive additional vitamin supplements, or they will die. Small intestine Furry protrusion Epithelium Submucosa seroza Mucosa",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}