{
    "relation": [
        [
            "Monday",
            "",
            "5",
            "12",
            "19 STATE HOLIDAY OFFICES CLOSED",
            "26"
        ],
        [
            "Tuesday",
            "",
            "6",
            "13 FIRST ADVERTISEMENT",
            "20",
            "27 SECOND ADVERTISEMENT"
        ],
        [
            "Wednesday",
            "",
            "7",
            "14",
            "21 Plant Mix Bid Letting",
            "28 PREQUAL LIST BID LETTING"
        ],
        [
            "Thursday",
            "1 STATE HOLIDAY OFFICES CLOSED",
            "8",
            "15",
            "22",
            "29"
        ],
        [
            "Friday",
            "2 STATE OFFICES CLOSED",
            "9",
            "16 STATE HOLIDAY OFFICES CLOSED",
            "23 PLAN HOLDERS",
            "30"
        ]
    ],
    "pageTitle": "J A N U A R Y 2 0 1 5",
    "title": "",
    "url": "http://virginiadot.org/business/const/calendar-jan.asp",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 252246899,
    "recordOffset": 252231540,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16569=© Copyright 2015, VDOT. All rights reserved. Web Policy / Privacy Statement / WAI Compliance / Site Map, 15413=VDOT Central Office 1401 E. Broad St. Richmond, VA 23219}",
    "textBeforeTable": "J A N U A R Y 2 0 1 5 Transparency in Procurement E-Z Pass Virginia Organizational Chart Six-Year Improvement Program database Highway Safety Challenge Follow Virginia's Stimulus Dollars Open to the Public VirginiaRoads.org Portal Other Links Visit Our Social Media Pages » Connect With Us! Consider a Career at VDOT Manuals Guides and Informational Instructions Hampton Roads Tunnels and Bridges Jamestown-Scotland Ferry Current Opportunities High Occupancy Vehicle (HOV) Lanes - Rules and FAQs Business Center High Occupancy Vehicle (HOV) Systems Popular Links Your one-stop source for VDOT maps, data and project info. Virginia Roads --> 511 offers real-time traffic info. Anytime you need it, anywhere you are.",
    "textAfterTable": "JAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV DEC With the exception of the Advertisement and Letting dates, all other dates are approximate.   Page last modified: Jan. 28, 2015 Additional Links Employee Outlook Access VDOT Dashboard Freedom of Information Act Adobe Reader Flash Player Microsoft Office Connect With Us Twitter YouTube Flickr Facebook RSS Feed 511 Virginia Need Help? 800-FOR-ROAD VDOT Central Office 1401 E. Broad St. Richmond, VA 23219 800-367-7623 (toll-free) 711 (hearing impaired) Report a Road Problem This website includes hyperlinks to sites neither controlled nor sponsored by VDOT or the Commonwealth of Virginia. Links may open in a new window. Some resources on this site require the Adobe Reader and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}