{
    "relation": [
        [
            "Lefty Digest",
            "2114",
            "2114",
            "2271",
            "ig114",
            ""
        ],
        [
            "Righty Digest",
            "2316",
            "2275",
            "2017",
            "2017",
            ""
        ],
        [
            "Transform into",
            "R",
            "R",
            "L",
            "L",
            ""
        ],
        [
            "Plate on",
            "CK",
            "CK",
            "AC",
            "AC",
            ""
        ],
        [
            "Short Description",
            "pCon.VacuoleBusterA",
            "pCon.VacuoleBusterB",
            "Pbad.SelfLysisT",
            "Ptet.SelfLysisT",
            ""
        ],
        [
            "'",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Berk2010-Amy - OpenWetWare",
    "title": "",
    "url": "http://www.openwetware.org/index.php?title=Berk2010-Amy&diff=456749&oldid=456748",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 51,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00236-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 613467151,
    "recordOffset": 613409597,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{153622=Pick 4 colonies for ig114/2271+2017. Normal colPCR seems to be a waste of time, but I'll try it anyway. I'm also going to do my backbone analysis PCR. Negative control: Bjh2345 in PMLLAC., 163880=This is a gel from a colPCR with oligos th395/th396 of four colonies picked from 2271+2017 and ig114 7/16/10 plates. If the plasmid is still a hybrid, it will contain the p15 origin of replication, and will PCR off a ~900bp DNA. This gel suggests that all the colonies I picked contained the hybrid vector. Tim said that if I need to do the transfer over again, I should use more pMLL vector (~3uL). For now, I'll pick more colonies., 111077=None of the 1884/1858 samples were cotransformed, but out the the 41/42+43/44 samples, 41+44b and 42+44a were cotransformed., 195009=Added 1uL of each of those dilutions to 70uL of MG1655 cells., 196661=Picked 8 colonies from Assembly attempt #2 (one pot) and assembly attempt #3 (gel purification) for 2114+2275, ig114+2017 and 2271+2017. Inoculated, checked for co-transformation, and set up ColPCR., 117415=I picked four colonies of each of the 41/42 and 43/44 combinations (a good number of colonies grew up on all of the plates) and four colonies of the restreaked 1884+1858 in jc012 vector. I checked them all for cotransformation, but skipped the colPCR since the parts are so large and jco12 doesn't have ca998/goo101., 101846=Eco/Bam digest of 1884+1858 combo minipreps (e and f a-b) Started at 2:206pm, 133416=Started ligation at 4:37pm. Used 2114+2275/2316 digests from construction of 47 and 48., 216166=None of the 2271+2017 or ig114+2017 colonies were cotransformed, but ALL of the iGEM10_018 (16a+SL) were cotransformed., 137900=Submitted iGEM10_020b in pmllCA, iGEM10_042a in pmllAC, iGEM10_041b in pmllCA, and jh1884+1858 in 1601CK A,B for sequencing., 52696=Transformed jtk159. Rescue started at 4:09pm. Plate 164-6 on CK and 166-9, 2142 on CA., 171357=2271+2017 in pMLL/1601 vector Eco/Bam: 3670, 2704 Lower band includes parts., 239733=Started ligation at 4:05pm. Ligated Eco/Bam digests of Bjh2291 and 2348 with my Eco/Bam digested Pjh1601K plasmid., 109545=1884+1858 in jc012: Eco/Bam should give 712 and 5713bp., 128917=Need to transform cells w/ 9145-1144 so we can get more DNA., 161409=I'm going to make more of pMLL4AC Eco/Bam digest from Tim's stock in plate 2, well F7 (pMLL4AC Bth8062). Started digestion at 2:04pm. Drop out is 813bp. Vector should be 2745bp., 55687=jh2093 in 1601AC into jtk049 to get rid of righty methylation., 162282=Everything grew up very well. The only concern I have is that the colonies with 2345 in the part have a transparent loop around the colony, possibly suggesting that self-lysis is starting. I'll have to careful when I miniprep these., 138840=Picked 8 colonies of iGEM10_020 and checked for cotransformation. Didn't run a colPCR b/c the part is too big. Picked 4 colonies of 42/41PCR+pMLL4AC and started a 4K colPCR. Had to make more colPCR MM., 80485=Bgl/XhoI of sbb04: 5543, 1958 Bgl/XhoI of iGEM10_55: 5543, 1634, 250759=Started digest at 11:10am, for all but ig114+2017. I added the speck of 2017 (~.2uL) left at around 11:36am. Started the 20 min heat kill for all but ig114+2017 at 12:30pm. Accidently set the heat kill program for 20 sec instead of minutes and added ligase. Hopefully that won't hurt anything. Put all four tubes in the PCR machine to heat kill at 12:53pm. Added ligase at 1:41pm. Started rescue at 2:42pm., 171259=Eco/Bam digest of 2271+2017 g.p. a, ig114+2017 g.p. a., 154374=DNA used: Rigthy: Bjh2093 in 1601AC Lefty: ef1a PMLLKA b (7/14 miniprep) and atub PMLLKA b (7/14 miniprep) All samples are methylated., 6302=July entries, 144688=Tomorrow, pick colonies. Can do colPCR off plasmid (1601 series)., 141646=R: bgl/xhoI of igem019-gel purify (mapping at same time): 6181, 1607. Cut out top band., 216537=Can disregard the results for 16a+SL since all samples were cotransformed. 2017 combo inoculations are useless since nothing showed up on the colony pcr. Very strange, since they weren't co-transformed. GOOD NEWS: atub and ef1a look great., 52946=Lane 1-3: 51, Lane 4-6: 52. Expected lengths 51: 5763, 52: 6332 and 2617 (backbone), 224805=There are a significant number of colonies on the plate for the 2271+2017 and ig114+2017 redo. I'll pick colonies/colony pcr/inoculate/check for cotransformation for 8 colonies from each. Also, since all the colony PCR's failed for my re-picking of 2114+2275, I'm going to redo the one-pot reaction for that as well., 160127=Expected lengths: 4644, 1466, 155728=None of the colonies picked yesterday from the iGEM10_047, 48, 51, 52, or 16+2294 were co-transformed. And since the ColPCR didn't reveal much of anything, I'm just going to miniprep the first two samples of each, except for iGEM10_047. iGEM10_047's d sample looked great on ColPCR, so I'll miniprep sample a and d instead of a and b. Also, somehow all 12 of the colonies that I picked for the transfer of 2271/ig114+ 2017 from the hybrid into PMLL4AC seemed to still be in the hybrid vector, based on my analytical pcr (they all had bands around 900bp). I'll miniprep four of each anyway and map them. If they're not the right side, I'll do the transfer over again., 118598=For Tn5, I can use the oligo I designed to go off the NLS: igemTen048 gctagCTCGAGttaAACTTTACGTTTTTTTTTCGGCGG 38 rev xhoI 1858 {<NLS!}, 184976=I miniprepped the remaining 1mL of 10 or bjh2294-PMLLKA (eluted with 25uL to keep normal MP concentration), ef1a-PMLLKA b, atub-PMLLKA b,c., 161671=Unfortunately, there's only about 1.75uL of digest PMLL4AC vector left, so I used it to redo the ligation w/ eco/bam digested ig114+2017. I started the ligation at 1:51pm. Started rescue at 3:04pm., 199458=This data suggest that all the backbones that should be A- are indeed A- and that all the backbones that are -A are indeed -A. So the antibiotics shouldn't be the problem. For whatever reason, nothing turned up in the 2345 lane. I'll run the PCR again just to double check., 68970=Ran an analytical gel of the SOEing PCR product and saw multiple bands, so I ran all my Zymo'd product and gel purified the upper bands. Started Eco/Bam digest of three PCR products and Tahoura's 1968 MP at 2:00pm., 218831=Performed a Lefty (Bam/XhoI digest), Righty (Bgl/XhoI digest), and one-pot digest on all the parts in my SL/VB promoter as well as iGEM10_016a and Bjh2294 in PMLL-KA can be found in the Cheshire Chat plate in H3 and F3. I'll gel purify the Lefty digests of Bjh2345, Bjh2271, Bjh1968, Bjh2114, ig114, 16a and the Righty digests of Bjh2316, Bjh2275, and the two self-lysis devices. The other digests are just to make sure everything was methylated correctly and that the one-pot reaction works on these vectors., 248747=Since my Colony PCR turned out so horribly yesterday, and 2345 is the Self Lysis Device we've been using for all our construction, I'm just going to use Tim's digests and ligate them together., 144568=rfp+nls: 1884+1858 in 1601KC, 141230=1884+1858: expected colPCR length: 912bp efla/atub+2093 expected colPCR lengths: 1952, 2190bp, 223988=Started ligation at 6:45pm. Will transform into jtk030 (pir +, MC1061 cells). I forgot to digest 2017, so I used a righty digest that I had done previously. Started rescue at 8:10pm., 52606=Assembly of iGEM10_164-9 and ligation of jh2142 to pmllAC started at 3:25pm., 131786=I wasn't going to map these, but since sequencing of 1884+1858 a and b w/ g00101 both failed, I'm going to map them. The maps won't show whether or not the NLS tag is there, but it should show how good the MP is and if the backbone is good., 233239=Pick 8 more colonies from 2114+2275. Ran colony PCR, inoculate, check for cotransformation., 103241=Started Eco/Bam mapping redo of 1884+1858 in jco12 F,d at 2:44pm. The gel came up empty :(, 50586=To in this order: Conor's Zymo 4:23, 142943=The PCRs look successful. I'm going to Eco/Bam the PCR product and ligate with pMLL4AC., 169090=-ligate g.p. 2294 with g.p. 16a., 176951=I'm going to Eco/Bam Transfer the part, because it's currently in a pMLL-jh1601 fusion backbone., 149256=This analytical backbone PCR seems useless, since a 900bp band was supposed to reveal the presence of the p15 origin of rep, a sign that the part was in the hybrid vector but my negative control, a part in pMLL4AC, also produced a 900bp band! My only choice of analysis then is mapping, but all of the colony PCRs look very crazy. Maybe I'll just miniprep and map them all anyway. Another route I could do would be to perform an Eco/Bam transfer into a vector w/ diff antibiotics, and then do another Eco/Bam transfer into the PMLL4AC. That's just going take a long time..., 223286=NOTE: lane 2 in the lefty gel is Bjh2294 H3, and everything else is pushed over one lane, 141829=Gel purified 19b,d: There was a band at around 6000bp, but I couldn't see one at 1607, but that could be because I ran the gel for a long time. I gel purified the top band anyway and I'll continue on with the next step of assembly. I could map again, but I think my analytical colPCR combine with sequencing results will be a pretty good confirmation., 134107=Designed the following oligo: igemTen048 gctagCTCGAGttaAACTTTACGTTTTTTTTTCGGCGG 38 rev xhoI 1858 {<NLS!}, 168815=-Eco/Bam digest ig114+2017 g.p. and 2271+2017 g.p. Run on gel and gel purify. Ligate to pMLLAC pre-digested vector. (calculated expected lengths before running gel, to make sure it's worth the trouble. Bands might be so similar that maybe just a zymo is better), 194840=Added 100uL of H2O to 1uL of DNA from Tera's Ef1a and Atub payload constructs. Added 10uL of H2O to 1uL of DNA from my minipreps of 2348/2291-1601K., 198416=Ligated ef1a and atub eco/bam zymo'd digests (from my previous insertion into the supposed KA vector) with the new gel purified Eco/Bam digested KA vector. Started at 7:05pm. Transformed jtk030, MC1061 pir+ cells. In retrospect, I could have used Lefty., 172324=Bam/XhoI: 2345 in PMLL4 b, 1968 in PMLL4AC (T1, L) Bgl/XhoI: 2114+2316 g.p. a, 2114+2275 a (7/14), 178182=Ran out the gel a bit more, and I think it shows that the two 2271+2017 samples mapped well:, 142253=41/42+pMLL4AC, transform into lefty 19b/d with 1, transform into jtk030, 143394=All of the samples for ef1a/atub+2093 were co-transformed. I'll pick a lot more colonies today, colPCR, inoculate, and streak for cotransformation., 153011=One of these is clearly still in its hybrid vector, but I don't know what's going on with the single bands. I'm going to Fusion PCR off ___ using ca998 and g00101. Then I'll Eco/Bam that into PMLL4AC., 183146=The boundaries of parts 2114+2275 and ig114+2017 look good. I'm going to PCR off the middle to check if the insides are go too. I used ca56 for ig114+2017 (binds to pbad promoter). I designed a primer for the middle of, 242203=An Eco/Bam digest of iGEM10_16 in PMLL5-CK should result in bands at 2662 and 867., 124874=Bgl/XhoI digest of 1884+1858 e,f eluted PCR products, 225142=The ligation of the atub promoter to the KA vector (Bjh2342-pMLL6-KA) was very successful, since I got a lot of colonies. I'll inoculate and run colony PCR (no need to check for co-transformation. Since my two colony picks of ef1a seemed to fail on the colony PCR yesterday, I'm going to pick a bunch more, inoculate, and run colony PCR again., 159591=Submitted a sample a for each of the 2345/1968 assemblies for sequencing, except I submitted sample d for iGEM10_047., 148467=Lane 1-4: iGEM10_019 w/ igemTen21/24, I wanted 888bp band, so they all look great! Lane 5-8: ef1a+2093 w/ ca998/g00101, expected 1952, all bad--last two are probably cotransformed w/ ef1a parent vector Lane 9-12: atub+2093 w/ ca998/g00101, expected 2190, all bad, 80698=Mapping of Quik change his6tag onto 20a. Eco/Bam: about 6300 and 2700, 66017=I still have my digests from my 2345+43/44 assembly, so I'll start from the ligation step. And even though I have sequenced off of tetR promoter yet, I'll also redo the assembly of 42 (tetR-self lysis T) w/ 43/44 while I'm at it. And I'll transform Bjh2017 (SelfLysisT) which is currently in R 1601KC into jtk159 to get rid of the methylation so I can Eco/Bam transfer it into a new vector, in case 42 is messed up., 159722=16+2294 is righty methylated. That's why I only got one band. It's the right sized band though. I'll map it with Eco/XhoI. Started digest at 4:10pm., 55763=Started rescue at 10:44., 243400=2114+2316 and 2114+2275 both successfully transformed righty pir+ cells. The plates are covered in colonies. 2271+2017 and ig114+2071 weren't as successful. The former had no colonies, while the latter had 11, which is surprising, because I used barely any DNA., 208929=Very odd. Even though I gel purified the correct bands, it appears that only 2114+2316 worked correctly. I'm going to check to make sure that everything is in the correct vector, because I don't know what else could be causing a problem. Since I'm miniprepping a the couple correct products, might as well miniprep and map a few others to try and figure out what the problem may be., 251199=These numbers have been based on Qiagen minipreps of Jin's pBjh1601 assembly vectors:, 121154=Lane 1-3: 46 c,d,g Expected lengths: 6117, 2877 Lane 4-6: 49 a,b,c Expected lenghts: 5778, 2877, 112354=Started adding DNA at 1:40pm. For DNA, we mixed two minipreps of 9145-1144. Well, we mixed them after adding DNA from one of the MPs to the 1uL tubes and the 13 .5uL tube (Whoops)., 6222=June entries, 171447=ig114+2017 in pMLL/1601 vector Eco/Bam: 3670, 2934 Lower band includes parts, 161600=Use 3uL of digested pMLL4AC instead of 1uL when ligating.}",
    "textBeforeTable": "Eco/Bam map 51, 52. Eco/Bam digest 2093. Gel purify. Digest started at 4:25pm. Miniprep 2093, 51, 52 To in this order: Conor's Zymo 4:23 Amy N. Kristofferson 18:11, 21 September 2010 (EDT) Submit newly assembled 45b, 46a, 47a with 63 and g00101 oligos. Transform in jtk159 so we can do a self-lysis test. Amy N. Kristofferson 19:23, 22 September 2010 (EDT) 54.4 Eco/Bam digest of EF1a PCR product 54.3 One Pot Assembly of Jin's Parts 54.2 2345 Redo: Ligating Tim's ebid 24 and EB pMLL4-AC 54.1 Eco/Bam transfer 2348 and 2291 into 1601K 54 Amy N. Kristofferson 13:40, 1 July 2010 (EDT) 53.5 2345 Redo from 24+PMLL4 digests 53.4 Moving into jh1601K 53.3 SL/VB Promoter Manual Assembly: Analysis of One-Pot reaction 53.2.2 Assembly of iGEM10_018 53.2.1 Mapping of iGEM10_016 minipreps a and b 53.2 iGEM10_20 2ab Assembly 53.1 Transposase Assay Take 2: Testing time for Transposase expression and time",
    "textAfterTable": "Pick colonies 2093 Righty digest sbb42 in pMLL-AK Ligations Assembly of iGEM10_164-9 and ligation of jh2142 to pmllAC started at 3:25pm. Transformed jtk159. Rescue started at 4:09pm. Plate 164-6 on CK and 166-9, 2142 on CA. Analytical Digests 51 and 52 eco/bam'd into CK: Lane 1-3: 51, Lane 4-6: 52. Expected lengths 51: 5763, 52: 6332 and 2617 (backbone) Tomorrow: co-transform good ones with all payloads. Assembly digests Bgl/XhoI'd 2uL of sbb42. Amy N. Kristofferson 01:18, 20 September 2010 (EDT) Miniprepped 51 and 52 Eco/Bam transfers Stored in Temp Miniprep box. Need to be mapped. ColPCR showed nothing. Digests Started at 10:11pm. Lane Part Digest 1 Bjh2271 in CA a Lefty 2 Bjh2642 in CA c Lefty 3 iGEM10_001 in CK Lefty 4 iGEM10_005 in KA a Righty 5 iGEM10_010 in KA b Righty 6 iGEM10_017 in KA a Righty 7 sbb06, Romeo H3 in AK",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}