{
    "relation": [
        [
            "This Wk",
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
            "18",
            "19",
            "20",
            "21",
            "22",
            "23",
            "24",
            "25",
            "26",
            "27",
            "28",
            "29",
            "30",
            "31",
            "32",
            "33",
            "34",
            "35",
            "36",
            "37",
            "38",
            "39",
            "40"
        ],
        [
            "Last Wk",
            "51",
            "-",
            "-",
            "2",
            "3",
            "1",
            "5",
            "-",
            "4",
            "6",
            "-",
            "7",
            "-",
            "-",
            "8",
            "10",
            "9",
            "-",
            "12",
            "-",
            "11",
            "-",
            "-",
            "14",
            "15",
            "16",
            "13",
            "22",
            "19",
            "18",
            "-",
            "-",
            "21",
            "-",
            "-",
            "24",
            "25",
            "27",
            "-",
            "-"
        ],
        [
            "Artist - Title",
            "Toonz - Twinkle Twinkle House Like Add to Playlist",
            "Nastee Nate - Illuminate Dubstep Like Add to Playlist",
            "Sonaris - Sonaris - Feeding Frenzy Drum n Bass Like Add to Playlist",
            "Nastee Nate - Anonymous Atrophy Dubstep Like Add to Playlist",
            "Justin Waters - David Guetta ft Usher vs. Justin Waters - Without You Progressive House Like Add to Playlist",
            "Insatiable - Grimey 2.0 Drum n Bass Like Add to Playlist",
            "Gerald The Genius - The Sounds Electro House Like Add to Playlist",
            "Gerald The Genius - Galactic Grinder Electro House Like Add to Playlist",
            "CheMora - CheMora - Devoured by Plants Dubstep Like Add to Playlist",
            "ForensiK MistaKe - Rejuvenate (Original Mix) House Like Add to Playlist",
            "Gerald The Genius - GQ - Disco Night (Gerald The Genius Remix) Tech House Like Add to Playlist",
            "Particle-X - Tales from the Nebula Trance Like Add to Playlist",
            "Oshmusik - Monotone Progressive House Like Add to Playlist",
            "Churpenstein - Crazed n Donfuzed Electro House Like Add to Playlist",
            "DJ TripVanwinkle - Floating Bubble (toxic antifreeze triphop extended) Trip-Hop Like Add to Playlist",
            "Love Deuce - Prisoner (Dubstep Remix) Dubstep Like Add to Playlist",
            "Oshmusik - HotAss Tech House Like Add to Playlist",
            "PPB - PPB Vs Particle X - Lithany Goa/Psytrance Like Add to Playlist",
            "Gerald The Genius - ULTRUS Electro House Like Add to Playlist",
            "Nastee Nate - Music Drum n Bass Like Add to Playlist",
            "Vector Futon - Moment of Clarity - The Future Experimental Like Add to Playlist",
            "Particle-X - Anxiety Goa/Psytrance Like Add to Playlist",
            "Syntheticsax - Heart (original mix) Electro House Like Add to Playlist",
            "Particle-X - Le grand vide Trance Like Add to Playlist",
            "Alexandar Bree - Alexandar Bree Vs. Kelis - Sweet Bounce (original mix) House Like Add to Playlist",
            "Dj Andrew S.mile - Flo Rida ft David Guetta - Club Can't Handle Me (MaxiGroove Remix) Tech House Like Add to Playlist",
            "Insatiable - Take the Bait Tech House Like Add to Playlist",
            "David Argunetta - Dasho malh (Heda Hamzatova vocal edit) House Like Add to Playlist",
            "Andrew McHogan - Walking On The Misty Road House Like Add to Playlist",
            "Raptus - Bratkilla - Thou Art Dead (Raptus Remix) [FREE DOWNLOAD] Dubstep Like Add to Playlist",
            "Hot Shit! (Eoliveira) - Eoliveira & Hot Shit! - 26 Years Old Electro House Like Add to Playlist",
            "norflex - Burn this way Electro House Like Add to Playlist",
            "Diejester - Kick The Baby Drum n Bass Like Add to Playlist",
            "DJ Transaction - Euphoric Trance House Infusion: Get up on the Dance Floor. 2012 Dj Transaction Trance Like Add to Playlist",
            "Gerald The Genius - Girls (Oh Yea) [Club Mix] Electro House Like Add to Playlist",
            "DonDon5000 - get busy dyin' Progressive House Like Add to Playlist",
            "MenzieBeatz - Abletron Dubstep Like Add to Playlist",
            "ProgrammK - Life Is Here And Now Progressive House Like Add to Playlist",
            "Milwoukee - Szystem (DnB) Drum n Bass Like Add to Playlist",
            "Medievil-Music - White Lava Trance Like Add to Playlist"
        ],
        [
            "Peak",
            "1",
            "2",
            "3",
            "2",
            "3",
            "1",
            "3",
            "8",
            "4",
            "4",
            "11",
            "5",
            "13",
            "14",
            "6",
            "3",
            "3",
            "4",
            "6",
            "2",
            "11",
            "11",
            "2",
            "7",
            "15",
            "11",
            "1",
            "6",
            "12",
            "18",
            "6",
            "13",
            "3",
            "34",
            "5",
            "3",
            "22",
            "27",
            "22",
            "29"
        ],
        [
            "Wks on",
            "2",
            "1",
            "1",
            "4",
            "2",
            "5",
            "3",
            "1",
            "2",
            "3",
            "1",
            "4",
            "1",
            "1",
            "3",
            "5",
            "4",
            "4",
            "5",
            "5",
            "4",
            "4",
            "7",
            "3",
            "2",
            "3",
            "11",
            "7",
            "5",
            "3",
            "6",
            "4",
            "5",
            "1",
            "7",
            "7",
            "6",
            "3",
            "3",
            "3"
        ]
    ],
    "pageTitle": "Top Music Chart for January 1, 2012",
    "title": "",
    "url": "http://www.internetdj.com/charts.php?chartid=641",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 525738271,
    "recordOffset": 525717096,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Top Music Chart for January 1, 2012 InternetDJ publishes this chart every Sunday. For more details about our charts, read the FAQ. Top Music Chart for January 1, 2012 Music Chart Home Members Forum New! Music & Tech News Find Songs, Videos, Mixes Playlists BROWSE INTERNETDJ Today's Best Mixes Today's Best Videos Today's Best Songs Week's Best Songs New Music & Videos BEST OF INTERNETDJ What to Hear --> (adsbygoogle = window.adsbygoogle || []).push({}); Leaderboard",
    "textAfterTable": "1 2 3 4 Next Filter by Genre Select Genre Ambient   Ambient Dub   Ambient Groove   Ambient House   Beatless   Psybient   Soundscape   Ambient Noise   Dark Ambient   Abstract AmbientBreaks   Big Beat   Florida Breaks   Funky Breaks   Nu Skool Breaks   Progressive Breaks   Nu Jazz/Broken BeatDowntempo   Acid Jazz   Dub   Trip-HopDrum n Bass   Breakcore   Jungle   Tech StepExperimental   NoiseGarage   Two Step   Speed/UK Garage   GrimeHouse   Hard House   Chicago House   Deep House   Ghetto House   Tribal House   Funky House   Disco   Progressive House   Tech House   Hi-NRG   Acid House   French House   Minimal House   Electro House   Eurodance   Trap   Jackin HouseTechno   Detroit Techno   Gabber   Acid Techno   Happy Hardcore   Hardcore   Dark/Terror/Speed-core   Minimal Techno   Rave",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}