{
    "relation": [
        [
            "Material",
            "Cold bitumen",
            "Bitumen with alu-foil",
            "Epoxy resin",
            "Paraffin",
            "++ very good"
        ],
        [
            "Processing",
            "++",
            "+",
            "++",
            "+",
            "+ good"
        ],
        [
            "Seal",
            "o",
            "++",
            "+",
            "o",
            "o satisfactory"
        ],
        [
            "Durability",
            "o",
            "+",
            "++",
            "o",
            "- problematic"
        ],
        [
            "Costs",
            "++",
            "+",
            "-",
            "++",
            ""
        ]
    ],
    "pageTitle": "Biogas Plants in Animal Husbandry: 5. Biogas technique: 5.4 Design and construction of plant components",
    "title": "",
    "url": "http://collections.infocollections.org/ukedu/en/d/Jg32bie/6.4.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988860.4/warc/CC-MAIN-20150728002308-00269-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 49788391,
    "recordOffset": 49772874,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{68541=1400, 68904=365/1300, 70731=1300, 71359=1200, 73196=1100, 74707=1010/720}",
    "lastModified": "Tue, 10 Jan 2012 10:32:06 GMT",
    "textBeforeTable": "Table 5.8: common substrate mixing ratios (Source: OEKOTOP, compiled from various sources) Depending on the available building material and type of plant under construction, different variants of the individual components are possible. Biogas plants of simple design consist of the following main components: - mixing pit - inlet/outlet(feed/dischargepipes) - digester - gasholder - slurry store. 5.4 Design and construction of plant components   10.7 Lists and indexes 10.6 Selected literature 10.5 List of pertinent suppliers and institutions",
    "textAfterTable": "5.4.2 Inlet and outlet The inlet (feed) and outlet (discharge) pipes lead straight into the digester at a steep angle. For liquid substrate, the pipe diameter should be 10-15 cm, while fibrous substrate requires a diameter of 20 - 30 cm. Plastic or concrete pipes are preferred. Note: - Both the inlet pipe and the outlet pipe must be freely accessible and straight, so that a rod can be pushed through to eliminate obstructions and agitate the digester contents; - The pipes should penetrate the digester wall at a point below the slurry level. The points of penetration should be sealed off and reinforced with mortar. - The inlet pipe ends higher than the outlet pipe in the digester in order to promote more uniform throughflow. In a fixed-dome plant, the inlet pipe defines the bottom limit of the gasholder, thus providing overpressure relief. - In a floating-drum plant, the end of the outlet pipe determines the digester's slurry level. Fig. 5.18: Inlet and outlet for fixed-dome (1) and floating-drum plants (2) (Source: OEKOTOP) Fig. 5.19: Forces acting on a spherical-dome digester (Source: OEKOTOP) 5.4.3 Digester Design The digester of a biogas plant must accommodate the substrate and bacterial activity, as well as fulfill the following structural functions: - accept the given static forces - provide impermeability to gas and liquids - be durable and resistant to corrosion As a rule, the digesters of simple biogas plants are made of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}