{
    "relation": [
        [
            "JMA",
            "Red Rock",
            "Spring Mtn. Wheeler Pass",
            "Johnnie",
            "Total/Overall",
            "",
            ""
        ],
        [
            "A",
            "77",
            "369",
            "105",
            "551",
            "",
            ""
        ],
        [
            "B",
            "72",
            "137",
            "207",
            "416",
            "",
            ""
        ],
        [
            "C",
            "22",
            "57",
            "24",
            "103",
            "",
            ""
        ],
        [
            "D",
            "39",
            "28",
            "81",
            "148",
            "",
            ""
        ],
        [
            "E",
            "187639",
            "379812",
            "216874",
            "784325",
            "",
            ""
        ],
        [
            "F",
            "2437",
            "1029",
            "2065",
            "1423",
            "",
            ""
        ],
        [
            "G",
            "2606",
            "2772",
            "1048",
            "1885",
            "",
            ""
        ],
        [
            "H",
            "8529",
            "6663",
            "9036",
            "7615",
            "",
            ""
        ],
        [
            "I",
            "4811",
            "13565",
            "2677",
            "5299",
            "",
            ""
        ]
    ],
    "pageTitle": "Action Alert | Loki's Gift",
    "title": "",
    "url": "http://giftofloki.com/tag/action-alert/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00168-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 111205723,
    "recordOffset": 111164069,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampBeforeTable": "{9257=Posted in ALERTS, Horse Slaughter in Canada, United States - Action Needed, Wildhorses of America, tagged Action Alert, Saving America's Wild Horses on August 17, 2013 | 9 Comments », 16480=I really need people to speak up and defend Loki, to plead his case so that he can live out his life in freedom.  I pray that you will speak for him.  Loki spent the first year of his life caged (I have pictures to prove that) and has only enjoyed his freedom since escaping the shelter in 2010 after having been rescued/seized in May 2010., 22769=Posted in ALERTS, Commitment, dogs in Canada's north, Fate of Sled Dogs, LOKI, LOKI : fact not fiction, tagged Action Alert, animal protection in N.W.T., Canada's North, LOKI Sole Survivor, LOKI UPDATES on September 15, 2013 | 28 Comments », 4226=Dr. Stull, along with others at UC Davis, wrote the code for standards of care for horses in California in 2010 and 2013., 19507=When I contacted the Wildlife Officer, and town officials , basically saying that due to unanswered emails and calls made to the Wildlife Officer, that I and others could only conclude that Loki was going to be allowed to live out his remaining days in freedom.  Only one person to responded, Mr. Potter,  stating that this is not the case and that they want to see Loki’s issue resolved by the end of September or sooner.  In other words if I do not have him here they will take the manner in their own hands to get him off the streets and we know what that means., 26748=Posted in ALERTS, Wildlife & Nature, Wildlife Protection, tagged Action Alert on April 19, 2014 | 1 Comment », 25493=April 14, 2014 – Notice of Constitutional Question, 12996=With no further help coming from the Wildlife Officer and officials wanting this situation resolved by the end of September or sooner, time is running out to plead Loki’s case. I need everyone to contact those persons listed above, a blitz if you will, so that the Powers that Be will see that Loki should be allowed to live out the rest of his life in freedom and not become one of the thousands in the NT who have been slaughtered. I have in the past via letters, suggested that Loki become the Town Mascot, which would make Hay River noted for compassion and become a leader to other northern communities for being a community that values even a feral animals life. Proving that a bullet is not the answer!, 17829=As the sole surviving pup (one of the 23 seized in the Hay River Hoarding case of 2010) Loki has survived free and cared for by those of us who dearly love him.  The 22 other pups, rather than be relocated as I offered to do in emails and letters to the Town Officials in June 2010, were secretly removed from the shelter and destroyed in mid August 2010.  My offers to relocate the pups to properly equipped professionally run rehab shelters out of territory were not even acknowledged by town officials.  Those pups were murdered needlessly.  Only Loki survived because he escaped the shelter twice prior to the destruction of the puppies. (Means of destruction is a big secret but I do know that no vet was present) (reliable source information provided)., 19738=All of this took place during July.  The last darting arrangement was cancelled at the last minute by the Wildlife Officer and no further help has been forthcoming to help me get him here.  I have idea why., 25747=April 17, 2014 Media Release – Groups seek legal remedies to stop re-introduction of the Ontario Spring Bear Hunt, 3358=rainfall) regardless of the horses’ age, breed, or body condition. It appears, contrary to what Dr. Stull said in Reno,Nevada, on August 6, all horses, not just compromised horses, are to be provided shelter in excessively high temperatures. In addition,” all horses “should ” be monitored for heat stress in hot, ambient temperatures.  A horse facing heat stress  may appear weak or disoriented. Other signs of heat stress include muscle tremors and shallow or rapid breathing.” (Google “Standards of Care for Horses in California.), 25265=April 14, 2014 – Notice of Application to Divisional Court for Judicial Review, 24025=Until 1999, thousands of black bears were killed when they came out of hibernation in the spring, baited with garbage food and hunted down by dogs.}",
    "TableContextTimeStampAfterTable": "{9957=PALOMINO VALLEY, (Nevada) – High Desert sun relentlessly shines upon 1800 plus warehoused wild horses and burros enclosed within BLM shadeless pens where horses are offered no escape from triple degree dangerous heat., 37583=2677, 85442=Posted in ALERTS, dogs in Canada's north, Fate of Sled Dogs, Help Needed, LOKI, LOKI : fact not fiction, tagged Action Alert, LOKI Sole Survivor, LOKI UPDATES on May 17, 2013 | 2 Comments », 33808=2772, 9550=PHOTO: MARJORIE LYNNE WAGNER , Surface temperature of sun drenched ground reads 164 degrees on July 1st, 2013 at approximately 3:20 PM. within the BLM Wild horse holding facility PALOMINO VALLEY CENTER, NEVADA, 7215=Posted in ALERTS, Recognizing Animal Cruelty, United States - Action Needed, Wildhorses of America, tagged Action Alert, Saving America's Wild Horses on July 13, 2013 | 1 Comment », 30183=2437, 2866=http://thisisreno.com/2013/08/opinion-palomino-horse-facility-needs-shade/, 47614=The mathematical analysis of acres per existing individual 2013 wild horse/wild burro and proposed 2013 AML individual wild horse/wild burro reveals the gross unfairness of the proposed joint BLM/USFS plan for the Spring Mountain Complex toward the legitimate wild horse and burro populations.  I have double checked these figures and they clearly reveal: (1) that the current wild horse and burro populations in the Complex are not overpopulated, but rather are still in the process of filling their respective horse or burro ecological niches in this region.  Even in the drier portions of the Complex, the number of acres per individual wild horse or burro should be in the low hundreds per individual, not in the low thousands per individual (existing 2013 population) and much less in the several thousands of acres per individual wild horse or wild burro!  That the proposed Appropriate Management Levels for the enormous 784,325-acre Spring Mountains Complex plans to allow for only one individual wild horse per 7,615 legal JMA acres and for only one individual wild burro per 5,299 legal JMA acres reveals the disgusting extent to which our BLM & USFS public officials are subverting the true intent and purpose of the unanimously passed WFHBA!  This is a travesty of justice and must not be allowed by a caring public!  It makes mockery of American democracy and caters to the traditional enemies of the wild horses and burros, especially in the case of the Spring Mountains Complex to the big game hunting interests represented by the Nevada Department of Wildlife. This agency has traditionally sought to eliminate wild horses and burros from the state of Nevada, including its majority of federal lands and in spite of their great popularity with the general public both in this state and nationwide., 40097=1885, 4300=The Obama Administration has said repeatedly that it opposes horse slaughter. But actions speak louder than words. What’s happening now in Nevada suggests that the Administration — through its federal agencies — is actually complicit in sending horses to a slaughter auction. posted on August 15, 2013 at 12:46pm EDT, 95623=A few words from his volunteer: Pichou deserves a chance. He has been in this awful shelter far too long, since November 2011. When you factor in the long hours spent alone, minimal people contact, no outings, walks, exercise, regular routine, nothing different to see, no-one to trust or love him, plus the fact that he gets minimum time to be fed and clean his cage, it’s no wonder he is unstable and doesn’t trust or respect new people. Only one person has worked with him, trying different things. Its a trust issue for Pichou, he has no one he can trust, no one who truly loves him and shows him love and respect.  Its sad to know from one volunteer who saw him over a year ago, that he was at that time, he was the happiest dog to be rescued. Now one year later, with other dogs coming and going, some who he got along with and some not, the isolation, it has all taken a toll on him. He needs a miracle to find the right person to work with him as he is not trustworthy in his present state. Miracles do happen, right? Pichou’s history helps to understand why he is who he is now. He needs someone with whom he can learn to trust again. We desperately need to find this special person which is why we are knocking at your door. Let us know if you want to meet Pichou. That might help you make the decision. PLEASE!  Post, email, FB, share with everyone you know. That special person is out there. Pichou is special – lets help them meet each other.  Do not hesitate to contact me for any information you may need or question you may have regarding dear Pichou.  please contact alexiapearce@rogers.com, 13175=June 30, 2013, 54612=Whole document: You should recognize the very crucial role wild horses & wild burros play in preventing catastrophic wildfires by eating the coarser, drier, more flammable vegetation over broad areas and their converting this via their droppings into rich and moist soils.  With their post-gastric digestive system, they are ideally equipped in this capacity. To ignore this salient biological fact is wrong.  The ruminant grazers: deer, elk, bighorn, cattle, etc., are not nearly as capable in this regard and burn up their metabolisms in the more thorough digestive processing of such dry and coarse vegetation.  In the era of Global Warming, this is a major consideration, as the wild horses & burros, if allowed to fill their niches, will greatly assist in catastrophic fire prevention.  In many regions where equid populations have been either drastically reduced or eliminated, catastrophic and extensive fires have resulted due to their no longer being able to consume and process the dry vegetation for which their post-gastric digestive systems are ideally suited. (See my book, Ch. II & Bell, R.H.B, 1970 reference in book’s bibliography.), 91430=Posted in ALERTS, Shelter Animals, tagged Action Alert, Loving Home Needed on April 28, 2013 | 2 Comments », 24621=2013 Pop. Est.; B = WB Median 2013 Pop. Est.; C = WH Median 2013 Proposed AML; D = WB Median 2013 Proposed AML; E = Total JMA acres; F = WH # acres per individual, current 2013 pop.; G = WB # acres per individual, current 2013 pop.; H = WH # acres per individual, proposed AML 2013; I = WB # acres per individual, proposed AML 2013., 10781=    http://terrifarley.blogspot.ca/2013/07/counting-wild-horses-why-statistics.html, 60164=7: This 30% utilization standard can be quite arbitrary and unjust to the actual species inhabiting the ecosystem.  Such standards can be out of tune with nature’s balancing processes over time, such as the natural shifts in occupied annual home range over the generations that both wild horses and wild burros display (see Pellegrini 1971 in bibliography of my book)., 39780=1423, 3603=http://thisisreno.com/2013/07/opinion-elements-relief-and-a-hot-debate-on-horses-in-holding/, 22728=Section 2 c of the Wild Free-Roaming Horses and Burros Act of 1971 (WFHBA) plainly states that the land where the wild horses & burros lived in 1971 (meaning their year-round habitat by any fair and judicial view) were to be “devoted principally … to their welfare …”  The proposal contained in your document, however, ignores this core legal intent by assigning ridiculously low Appropriate Management Levels that are both genetically non-viable and would create tortured populations of wild horses and burros. These would be frustrated in realizing their natural, ecological niche, or place in the life community. Here I present a Table for your consideration based on the data you have supplied in your document:, 76925=     When asked by the only media reporter in the NWT that contacted me why I was raising funds, I responded by saying …. Being the sole income support for my family, is the reason that this fund raising campaign was launched.  The dog run could never have been purchased, had not donations started coming in as fast as they did.  A deadline to get Loki off the streets by May 31st has been extended, however, it was not made clear by Town officials how much more time I have., 14475=Re: Spring Mountains Wild Horse & Burro Complex Herd Management Area Project Plan, Humboldt-Toiyabe Nat’l. Forest, Spring Mtns. NRA & Bureau of Land Management, So. Nevada District. USFS Project # 40960; BLM Project # DOI-BLM-NV-S030-2013-0010-EA, 70784=–Though with much more to impart, I now close in order get this timely input in by June 30, 2013, to the email address provided in your document. I have a history of giving such input as well as federal court testimony to defend the precious wild horses and wild burros of the Spring Mountain Complex. From any objective point of view, these “national heritage, returned native” species are not overpopulated.  Though BLM & USFS have contrived to paint a negative picture of them in the Spring Mountain Complex in this and earlier documents, the truer and fuller story of these wonderful and ancient presences is not to be found in such evanescent and shallow-minded assertions. The greater story concerning both horses and burros is one with All Life’s Greatest Story. This story includes us all as equals, all individuals and all kinds – however minutely or broadly categorized – for each inextricably and indispensably related within the Great Unfolding Tree of Life.  And to acknowledge, respect, and honor the precious freedom of brother/sister/blesser of humanity horse/burro to realize its greater calling, purpose, and destiny in relation to All of Life, not just humanity alone – well, my friend, this is nothing short of a supreme and liberating Virtue!, 33491=1029, 16573=I have visited the Complex and its equid herds many times dating back to the 1970s but with special intensity during the past six years.  In 2010 I even flew around the complex to get an overview of this fascinating and bio-diverse range and to assess the population density and distribution of its wild horses and burros.  I have spent many days observing the wild horses and burros around Cold Creek and in diverse seasons, and have also observed wild horses on the western side of the Wheeler Pass HMA and the wild burros of the Red Rock JMA. , 36949=1048, 12862=Subject: Corrected Input for Spring Mtns Wild Horse & Burro Complex HMA Project Plan. USFS Project 40960; BLM Project DOI-BLM-NV-S030-2013-0010-EA, 14014=Las Vegas NV 89130-2301, 73162=Posted in ALERTS, Fate of Sled Dogs, Help Needed, LOKI, LOKI : fact not fiction, Recovery, Rescue, Touching One's Soul, Tribute to Animal Angels, tagged Action Alert, animal cruelty in Canada's North, animal protection in N.W.T., Commitment & Devotion, Family Members deserve the Best, LOKI Sole Survivor, LOKI UPDATES on May 25, 2013 | 2 Comments », 36632=2065, 30500=2606}",
    "textBeforeTable": "    2013 Pop. Est.; B = WB Median 2013 Pop. Est.; C = WH Median 2013 Proposed AML; D = WB Median 2013 Proposed AML; E = Total JMA acres; F = WH # acres per individual, current 2013 pop.; G = WB # acres per individual, current 2013 pop.; H = WH # acres per individual, proposed AML 2013; I = WB # acres per individual, proposed AML 2013. Table of Existing and Proposed Acres per Individual Wild Horse/Wild Burro for Spring Mountains Complex, USFS/BLM Joint Management Areas (JMA) Proposed Action (WH = wild horse; WB = wild burro) Lettered Columns: A = WH Median       Section 2 c of the Wild Free-Roaming Horses and Burros Act of 1971 (WFHBA) plainly states that the land where the wild horses & burros lived in 1971 (meaning their year-round habitat by any fair and judicial view) were to be “devoted principally … to their welfare …”  The proposal contained in your document, however, ignores this core legal intent by assigning ridiculously low Appropriate Management Levels that are both genetically non-viable and would create tortured populations of wild horses and burros. These would be frustrated in realizing their natural, ecological niche, or place in the life community. Here I present a Table for your",
    "textAfterTable": "    The mathematical analysis of acres per existing individual 2013 wild horse/wild burro and proposed 2013 AML individual wild horse/wild burro reveals the gross unfairness of the proposed joint BLM/USFS plan for the Spring Mountain Complex toward the legitimate wild horse and burro populations.  I have double checked these figures and they clearly reveal: (1) that the current wild horse and burro populations in the Complex are not overpopulated, but rather are still in the process of filling their respective horse or burro ecological niches in this region.  Even in the drier portions of the Complex, the number of acres per individual wild horse or burro should be in the low hundreds per individual, not in the low thousands per individual (existing 2013 population) and much less in the several thousands of acres per individual wild horse or wild burro!  That the proposed Appropriate Management Levels for the enormous 784,325-acre Spring Mountains Complex plans to allow for only one individual wild horse per 7,615 legal JMA acres and for only one individual wild burro per 5,299 legal JMA acres reveals the disgusting extent to which our BLM & USFS public officials are subverting the true intent and purpose of the unanimously passed WFHBA!  This is a travesty of justice and must not be allowed by a caring public!  It makes mockery of American democracy and caters to the traditional enemies of the wild horses and burros,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}