{
    "relation": [
        [
            "Community",
            "Belle Fourche",
            "Sturgis",
            "Rapid City",
            "Buffalo",
            "Pierre"
        ],
        [
            "Location",
            "Belle Fourche Rec. Center 1111 National St.",
            "Sturgis Community Center 1401 Lazelle",
            "Best Western Ramkota 2111 N. Lacross",
            "Buffalo Rec. Center Hodge Street",
            "Governors Inn 700 W. Sioux Ave."
        ],
        [
            "Day",
            "Monday",
            "Tuesday",
            "Thursday",
            "Friday",
            "Tuesday"
        ],
        [
            "Date",
            "July 8",
            "July 9",
            "July 11",
            "July 19",
            "July 23"
        ],
        [
            "Time",
            "4-6 p.m.",
            "4-6 p.m.",
            "4-6 p.m.",
            "4-6 p.m.",
            "4-6 p.m."
        ]
    ],
    "pageTitle": "BLM Releases South Dakota Draft Management Plan for Public Review",
    "title": "",
    "url": "http://www.blm.gov/mt/st/en/info/newsroom/2013/june/blm_releases_south.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042981576.7/warc/CC-MAIN-20150728002301-00090-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 335848318,
    "recordOffset": 335840116,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{5644=July 9, 8467=After the comment period ends a proposed Final RMP/EIS will be issued in late summer 2014.  That will be followed by the final step in the process, issuing a Record of Decision (ROD).  Until the Final RMP/EIS ROD is signed, the South Dakota Field Office will continue to manage public land resources under the 1986 South Dakota RMP., 5527=Sturgis Community Center 1401 Lazelle, 3374=The public comment period will end Sept. 11, 2013., 5404=July 8, 5288=Belle Fourche Rec. Center 1111 National St., 5881=July 11, 6110=July 19, 5770=Best Western Ramkota 2111 N. Lacross, 6338=July 23}",
    "lastModified": "Tue, 28 Jul 2015 05:51:03 GMT",
    "textBeforeTable": "  South Dakota Field Office BUREAU OF LAND MANAGEMENT NEWS RELEASE U.S. DEPARTMENT OF THE INTERIOR",
    "textAfterTable": "Friday July 19 4-6 p.m. Pierre Governors Inn 700 W. Sioux Ave. Tuesday July 23 4-6 p.m. Each meeting will include introductions, a brief BLM presentation, and an opportunity to talk individually with various BLM resource specialists.  Public comment forms will be provided during the meetings for members of the public to submit written comments, which are considered in finalizing the document. The public may submit written comments related to the South Dakota DRMP/EIS by any of the following methods: Email: BLM_MT_South_Dakota_RMP@blm.gov Fax:    (605)892-7015 Mail or hand-delivery: \"South Dakota RMP Comments,\" 315 Roundup Street, Belle Fourche, SD 57717 Whenever possible, please reference the page or section in the DRMP/EIS to which the comment applies.  Specific comments addressing concerns that are within BLM’s legal responsibilities and that can be resolved in the land-use planning process would be most helpful.  The Draft RMP/EIS was developed with assistance from local counties, the state and other federal agencies, tribal governments, BLM’s Dakotas Resource Advisory Council and a variety of interest groups. All letters and emails should include the first and last name of the individual commenting and a complete mailing address.  Before including your address, phone number, email address, or other personal identifying information in your comment, you should be aware that your entire comment – including your personal identifying information – may be made publicly available at any time.  While you can ask us in your comment to withhold your personal identifying information from",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}