{
    "relation": [
        [
            "",
            "Number of students graduating from program.",
            "Number of students graduating from program who took examination.",
            "Number of students who passed the examination on the first attempt.",
            "Percentage of students who passed the examination on the first attempt.",
            "Number of students who passed the examination regardless of the number of attempts.",
            "Percentage of students who passed the examination regardless of the number of attempts."
        ],
        [
            "2010 to 2011",
            "8",
            "8",
            "5",
            "62.5%",
            "7",
            "87.5%"
        ],
        [
            "2011 to 2012",
            "5",
            "5",
            "2",
            "40%",
            "5",
            "100%"
        ],
        [
            "2012 to 2013",
            "12",
            "11",
            "7",
            "63.64%",
            "9",
            "81.82%"
        ],
        [
            "2013 to 2014",
            "5",
            "4",
            "3",
            "75%",
            "3",
            "75%"
        ],
        [
            "3 YEAR AGGREGATE",
            "22",
            "20",
            "12",
            "60%",
            "17",
            "85%"
        ]
    ],
    "pageTitle": "Athletic Training at Colby-Sawyer College",
    "title": "",
    "url": "http://www.colby-sawyer.edu/ess/training.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 0,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00063-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 367201127,
    "recordOffset": 367184944,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{28098=Founded in 1837, Colby-Sawyer is a comprehensive baccalaureate college that integrates the liberal arts and sciences with professional preparation. The college is located in the scenic Lake Sunapee Region of central New Hampshire., 662=The program also prepares students for graduate studies in athletic training, physical therapy and allied health fields. Students are eligible to apply for the Board of Certification exam after completing this program, which is accredited by the Commission on Accreditation of Athletic Training Education with the next comprehensive review due during the 2021-22 academic year.}",
    "textBeforeTable": "Board of Certification examination rates: For complete information about major requirements and course offerings, please refer to the college catalog. The program also prepares students for graduate studies in athletic training, physical therapy and allied health fields. Students are eligible to apply for the Board of Certification exam after completing this program, which is accredited by the Commission on Accreditation of Athletic Training Education with the next comprehensive review due during the 2021-22 academic year. The program supplements students' academic preparation with clinical experience, preparing them for careers in educational settings, professional sports, sports medicine clinics and corporate or industrial settings. The Athletic Training Program, accredited by the Commission on Accreditation of Athletic Training Education, educates students in the prevention, recognition, management and rehabilitation of injuries for the physically active. B.S. in Athletic Training Every spring the Symposium focuses on a chosen theme with speakers who are experts in their fields. ESS Symposium… Athletic Traing majors learn from experienced, expert faculty members. ESS Faculty… One of the most active student organizations on campus, the ESS Club is designed to develop skills and build connections outside the classroom. ESS Club… An increased demand for professionals with expertise in athletic training creates a variety of opportunities. Career Opportunities… Athletic Training majors gain valuable professional experience through a required internship. ESS Internships… \"People here are active and passionate; if you're not involved",
    "textAfterTable": "Grad School Affiliations and Pre-Professional Programs… Colby-Sawyer has affiliation agreements to assist qualified baccalaureate degree graduates from Colby-Sawyer College in gaining admission into the graduate programs at Plymouth State University and Springfield College. The ESS major is a strong foundation for careers in physical therapy and other fields in health care. Program Highlights An on-campus teaching lab and sports medicine clinic puts education into action. Athletic Training majors may compete on Division III varsity teams. Affiliation agreements assist qualified candidates' entrance into the graduate programs at Plymouth State University and Springfield College in Springfield, Mass. The Exercise and Sport Sciences Department boasts more clinical professors than most schools our size. Clinical Experiences In their second year, Athletic Training majors begin the first of five required clinical experiences. Colby-Sawyer students work with a variety of organizations, including: Dartmouth College's football and rugby teams Kearsarge Regional High School Keelin Studio for Strength & Wellness Kimball Union Academy Proctor Academy SMART Physical Therapy St. Anselm College's football, ice hockey, and lacrosse teams Career Paths Clinic director\u0097Warwick Physical Therapy Institute Clinical dietitian\u0097Holy Family Hospital Director of fitness\u0097Manchester Athletic Club EMT\u0097Golden Cross Ambulance, Inc. Head athletic trainer/assistant director of athletics\u0097Berkshire School Physician assistant\u0097Emergency/Intensive Care/Surgery, Holy Cross Hospital Researcher\u0097Exercise Testing Lab, Beth Israel Deaconess Medical Center Athletic Training Student Outcomes Graduates will possess knowledge, skills and values necessary to enter the field of athletic training. Students will be able to: Identify injury and illness risk factors that",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}