{
    "relation": [
        [
            "Feature",
            "Read RFID",
            "Credit Vending Machine",
            "Track Member Account",
            "Deduct From Member Account",
            "Email Balance to Member",
            "Member Account Top Up",
            "Pay Pal Top Up",
            "Video Display Balance",
            "Video Advertizing",
            "Mounting Brackets",
            "RFID Mounting",
            "Bitcoin Payments",
            "Speaker Feedback",
            "Motion Detector"
        ],
        [
            "Description",
            "Ability to read members's RFID tag",
            "Ability to credit the vending machine to allow the dispencing of caffeene",
            "Ability to track member's pop account balance",
            "Ability to deduct a credit from a members's account balance",
            "Ability to email a balance to a member's account from pop.pi@ents.ca",
            "Ability to top up a members account.",
            "Ability to top up a members account from paypal payment",
            "Video display member balance information",
            "Make use of the video monitor for displaying ad's",
            "3D Printed Mounting Brackets Modeled to hold the PI and Relay",
            "3D Printed Mounting Brackets Modeled to hold the RFID where the Change was inserted.",
            "Have the ability to take bitcoin payments.",
            "Make use of the audio jack on the pi to output auditory feedback on payment. Sounds to be determined. (Lottery Machine noises, Portal Sounds)",
            "Make use of a motion detector as a type of Occupancy sensor for the display screen as well as feedback on when to enable/disable the rfid reader."
        ],
        [
            "Version",
            "1",
            "1",
            "1",
            "1",
            "2",
            "2",
            "TBD",
            "3",
            "4",
            "2",
            "3",
            "TBD",
            "TBD",
            "TBD"
        ],
        [
            "Complete",
            "Yes",
            "Yes",
            "Yes",
            "Yes",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No",
            "No"
        ],
        [
            "",
            "Render, Colin",
            "",
            "Colin",
            "Colin",
            "Render, Colin",
            "Colin",
            "",
            "",
            "",
            "",
            "",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Difference between revisions of \"Projects/RFIDpop\" - ENTS",
    "title": "",
    "url": "http://www.ents.ca/index.php?title=Projects/RFIDpop&diff=596&oldid=581",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 2,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00093-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 417787095,
    "recordOffset": 417773486,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{53263=http://stackoverflow.com/questions/372885/how-do-i-connect-to-a-mysql-database-in-python, 55614=http://alexba.in/blog/2013/01/07/use-your-raspberrypi-to-power-a-company-dashboard/, 54549=http://www.adafruit.com/blog/2013/09/05/pool-table-accepts-bitcoin-with-help-from-raspberry-pi/, 52813=http://www.susa.net/wordpress/2012/06/raspberry-pi-relay-using-gpio/, 53504=http://www.sundh.com/blog/2013/09/connect-parallax-rfid-to-raspberry-pi/, 54312=http://www.learn2crack.com/2013/10/setup-apache-web-server-php-mysql-raspberry-pi.html}",
    "textBeforeTable": "Planned and Implemented features, if you would like to participate or learn about any of the features contact the people who are associated with the feature or talk to one of us. Feature Roadmap Photo of Orcinus playing around Media:Pop-Pi_Orc_face.jpg Photo of the replacement Plexiglass sign in it's test fit (note the blue protective plastic is still in place) Media:Pop-Pi_Plex_Test_fit.jpg Photo of the Prototype system in it's first live test on the machine (it worked!) Media:Pop-Pi_first_test.jpg Photo of the internal electromechanical schematic: Media:RFIDpop_mech_schematic.jpg Photo's: Need a second relay to cut power to the credit relay after timeout Software currently crashing often. Needs lots of work Column #1 needs adjustment to sync up the gear works when loaded Paint trim areas and fix chipping of paint Clean and measure outside surfaces for painting/decals Clean all surfaces, particularly the compressor compartment To-Do: Pi and other components installed and a first run of RFID enabled dispensing is available Monitor has been mounted, though mounting scheme may change in the future Plastic exit chute was found to be stuck shut from a long ago exploded can. Removed and washed Proper",
    "textAfterTable": "API to interface to paypapal. 3D Printed mount for the RFID reader. Pop Level Management. Include a web cam to be hosted on live hacker spaces. \"Live from the pop machine!\" PI Pinout Assignments In Progress. Assignment Pin Pin Assignment 3v3 to LV on Logic Converter 1 2 5V to HV on logic converter 3 4 5V to + on Relay 5 6 7 8 GND to Logic Converter 9 10 To A1 on level shifter pass through to TX on RFID reader 11 12 To A2 on level shifter pass through to Enable on RFID reader 13 14 To S on Relay 15 16 17 18 19 20 21 22 23 24 25 26 Database Table: MemberAccount Column DataType Description Id int auto increment id for the account table RFID varchar decimal value of the member's rfid Account int account balance Email varchar used to email users when their account is low Fritzing Schematic Fritzing can be found at",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}