{
    "relation": [
        [
            "Date",
            "Jan 8, 1998",
            "Mar 30, 1998",
            "Mar 19, 2002",
            "Apr 18, 2006",
            "May 12, 2006",
            "Oct 21, 2009",
            "Nov 11, 2010",
            "Jan 10, 2012"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: SIEMENS MICROELECTRONICS, INC., CALIFORNIA Free format text: CHANGE OF NAME;ASSIGNOR:SIEMENS COMPONENTS, INC.;REEL/FRAME:009027/0590 Effective date: 19971001",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: INFINEON TECHNOLOGIES NORTH AMERICA CORP., CALIFOR Free format text: CHANGE OF NAME;ASSIGNOR:SIEMENS MICROELECTRONICS, INC.;REEL/FRAME:017606/0359 Effective date: 19990928",
            "Owner name: INFINEON TECHNOLGOES AG, GERMANY Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INFINEON TECHNOLOGIES NORTH AMERICA CORP.;REEL/FRAME:023401/0082 Effective date: 20060901 Owner name: MOSAID TECHNOLOGIES INCORPORATED, CANADA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:INFINEON TECHNOLOGIES AG;REEL/FRAME:023401/0132 Effective date: 20060905",
            "Owner name: MOSAID TECHNOLOGIES INCORPORATED, CANADA Free format text: CHANGE OF ADDRESS;ASSIGNOR:MOSAID TECHNOLOGIES INCORPORATED;REEL/FRAME:025346/0806 Effective date: 20090209",
            "Owner name: ROYAL BANK OF CANADA, CANADA Free format text: U.S. INTELLECTUAL PROPERTY SECURITY AGREEMENT (FOR NON-U.S. GRANTORS) - SHORT FORM;ASSIGNORS:658276N.B. LTD.;658868 N.B. INC.;MOSAID TECHNOLOGIES INCORPORATED;REEL/FRAME:027512/0196 Effective date: 20111223"
        ]
    ],
    "pageTitle": "Patent US5357674 - Method of manufacturing a printed circuit board - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5357674?dq=3657699",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987552.57/warc/CC-MAIN-20150728002307-00025-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469277039,
    "recordOffset": 469254865,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{21199=This is a divisional of application Ser. No. 07/876,640 filed Apr. 30, 1992 U.S. Pat. No. 5,311,407.}",
    "textBeforeTable": "Patent Citations While the invention has been described in detail with reference to the preferred embodiment thereof, it will be apparent to one skilled in the art that various changes and modifications can be made therein without departing from the spirit and scope thereof. The present invention is only limited by the claims appended hereto. To sum up, in accordance with the present invention, it is possible to provide a simply constructed electronic component mounting printed circuit board which facilitates the design of a circuit, which dispenses with the slow lamination process, unreliable through hole plating techniques, and complex mechanical abrasion and etching techniques; and affords excellent connection reliability economically, which can readily form a heat radiating structure, and provides multi-level semiconductor placement on the PCB. Referring to FIG. 13, LED (Light Emitting Diode display) arrays are mounted to the top side of the substrate and the semiconductor chip is mounted on the back side to the exposed heatsink/leadframe. The wirebonds from the semiconductor chip are bonded to the top and the bottom PCBs. It will be appreciated that various types of semiconductor devices may be incorporated in other applications. As shown in FIG. 12, semiconductor chips are mounted on both sides of the substrate with one of the chips attached to the heatsink/leadframe. Individual semiconductor devices 210 may thus be provided on the outside (top) surface of the substrate, and a second plurality of individual semiconductor devices",
    "textAfterTable": "Universal unit strip/carrier frame assembly and methods US6329705 May 20, 1998 Dec 11, 2001 Micron Technology, Inc. Leadframes including offsets extending from a major plane thereof, packaged semiconductor devices including same, and method of designing and fabricating such leadframes US6331448 * Aug 28, 2000 Dec 18, 2001 Micron Technology, Inc. Leadframes including offsets extending from a major plane thereof, packaged semiconductor devices including same, and methods of designing and fabricating such leadframes US6500697 * Aug 29, 2001 Dec 31, 2002 Micron Technology, Inc. Leadframes including offsets extending from a major plane thereof, packaged semiconductor devices including same, and methods of designing and fabricating such leadframes US6574858 * Feb 13, 1998 Jun 10, 2003 Micron Technology, Inc. Method of manufacturing a chip package US6687980 Aug 11, 2000 Feb 10, 2004 Tessera, Inc. Apparatus for processing flexible tape for microelectronic assemblies US6703260 Dec 30, 2002 Mar 9, 2004 Micron Technology, Inc. Leadframes including offsets extending from a major plane thereof,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}