{
    "relation": [
        [
            "Citing Patent",
            "US8051289",
            "US8312262",
            "US8457308 *",
            "US8769299",
            "US8806216",
            "US8850518 *",
            "US8874914 *",
            "US20100054463 *",
            "US20110197065 *",
            "US20130305328 *",
            "US20140122890 *",
            "US20150067327 *",
            "EP2568406A1"
        ],
        [
            "Filing date",
            "Oct 14, 2010",
            "Apr 30, 2004",
            "Jun 11, 2009",
            "Oct 13, 2010",
            "Sep 10, 2012",
            "Jun 8, 2007",
            "Feb 5, 2010",
            "",
            "",
            "May 8, 2012",
            "May 24, 2012",
            "Aug 27, 2013",
            "Sep 10, 2012"
        ],
        [
            "Publication date",
            "Nov 1, 2011",
            "Nov 13, 2012",
            "Jun 4, 2013",
            "Jul 1, 2014",
            "Aug 12, 2014",
            "Sep 30, 2014",
            "Oct 28, 2014",
            "Mar 4, 2010",
            "Aug 11, 2011",
            "Nov 14, 2013",
            "May 1, 2014",
            "Mar 5, 2015",
            "Mar 13, 2013"
        ],
        [
            "Applicant",
            "Avow Systems, Inc.",
            "Qualcomm Incorporated",
            "Chi Mei Communications Systems, Inc.",
            "The Boeing Company",
            "Dictao",
            "Ingenico",
            "Accenture Global Services Limited",
            "Chi Mei Communication Systems, Inc.",
            "Stauth Sean Alexander",
            "Wai Pong Andrew LEUNG",
            "Symeos",
            "Paul Alexander Lipton",
            "Dictao"
        ],
        [
            "Title",
            "Electronic document management and delivery",
            "Management of signing privileges for a cryptographic signing service",
            "Communication system and method for protecting messages between two mobile phones",
            "License utilization management system license wrapper",
            "Implementation process for the use of cryptographic data of a user stored in a data base",
            "Method and device for user authentication",
            "Secure and automated credential information transfer mechanism",
            "Communication system and method for protecting messages between two mobile phones",
            "Secure and automated credential information transfer mechanism",
            "Systems and methods for passing password information between users",
            "Method and system for securing the exchange of data between a client module and a server module",
            "Methods, devices, and mediums for securely sharing restricted content",
            "Implementation method, from a terminal, of cryptographic data for a user stored in a database"
        ]
    ],
    "pageTitle": "Patent US7725723 - Data certification method and apparatus - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7725723?dq=5,966,702",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042989507.42/warc/CC-MAIN-20150728002309-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 467088231,
    "recordOffset": 467046056,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6340=FIG. 1 schematically shows a system according to an embodiment of the present invention. It shows a user 102 operating a source device, which in the present embodiment is a workstation 101, which is connected to a certifying device, which in the present embodiment is signature server 110, via a communication line 140. The communication line 140 is not inherently secure. The workstation 101 may be any terminal at which communication may be established with the signature server 110. For example, the workstation 101 may be an interactive television set. The requirement is that the workstation 101 can communicate with the signature server 110. No special software is required at the workstation 101 side of the link. The signature server 110 securely stores the private keys of each user and may additionally log some or all relevant information regarding users and their activities. The signature server 110 handles requests from users via the workstation 101 and may issue requests to a CA server. The signature server 110 is ideally certified to an International standard, such as FIPS 140-1 level 3 or 4 (see FIPS Pub 140-1, 1994. National Institute of Standards & Technology, USA, the contents of which are incorporated herein by reference), which is a generally accepted standard to indicate the quality of the tamper resistance features of the hardware protection of the server.}",
    "TableContextTimeStampAfterTable": "{73864=One established approach to the protection of the private key of a key pair used for digital signatures is to use software solutions and then store it on the owner's workstation or a floppy disk protected by a pincode or passphrase controlled by the owner. However, it is generally agreed that such a software-only solution is not sufficiently secure for high value transactions, unless the workstation is extraordinarily well protected. This is because it will typically be possible to recover the private key using an exhaustive search for the password on the workstation, and in any case, it is difficult to protect the private key from so-called “Trojan horse” attacks. Here a malicious programme, a type of virus, is installed by an intruder, e.g. via an e-mail which contains an executable file, and this programme secretly copies the private key of the user when it is being used in the signature process, or it secretly copies the passphrase used to protect the private key. Measures can be introduced which make such attacks more difficult, but even so, they are still not easily prevented. For security and applicability reasons the physical protection offered by smartcards, which in addition provide a mobile solution, is attractive. The disadvantage of his method is that it requires smartcard readers, which are still not widely available., 72605=A digital certificate, comprising a public key/private key pair has additional advantages over a traditional signature solution without certificates in that it may have a limited operational period and may also be suspended or revoked, should the private key of the user be compromised, for example by being made available to a third party. In order for the signature to be of any use, it must preferably be represented in a standardised format, such as Public Key Crypto Standard (PKCS#1) signatures, formatted according to CMS (the Cryptographic Message Syntax) (PKCS#7, for further information on which see PKCS #1,7, RSA Cryptography Standard, RSA Laboratories, 2001, the contents of which are incorporated herein by reference)., 98526=The authentication server 120 distributes one-time passwords and/or challenges to customers through an alternate channel 151. In the present embodiment, the alternate channel 151 employs SMS (short message service) messages sent via a cellular network for mobile phones for communicating the one-time passwords. Alternatively, the user might possess a handheld so-called secure token 190, a small device which shares an individual key with the authentication server 120. Once the challenge has been received via the workstation 101, this is keyed in by the user on the token 190, and the response which basically is an encryption of the challenge with the key held on the token 190, is keyed in at the workstation 101 as the one-time password. The signature server 110 may verify that the response is indeed an encryption of the challenge as it receives a derived version of the one time password from the authentication server 120. However, many alternatives are available such as Wireless Application Protocol (WAP) over a cellular network (which is a specialised version of the Internet, and which can be accessed by WAP enabled mobile telephones), or ordinary paper mail. Alternatively, passwords may be distributed via the Internet, via an applet, which communicates as directly as possible with a printer attached to the workstation 101 (as this limits the risk of password copies remaining in their printer/spooler buffers, or on the workstation 101 by means of Trojan horses which “sniff” the passwords). Examples of types of password that can be used in the present invention are discussed below in any event, the exact nature of this authentication process is not limited to that described, and many variations are possible within the context of the invention., 69918=Because knowledge of the key used for verification does not enable signing, it is possible to broadcast this key (the so called “public key”) as widely as possible, to as many people as possible, typically by providing a so-called Public Key Infrastructure (PKI, see CCITT (Consultative Comm. on Intern. Telegraphy and Telephony), Recommendation X.509: The Directory—Authentication Framework, 1994, and Public Key Infrastructure: The PKIX Reference Implementation, Internet Task Engineering Force, both of which are incorporated herein by reference) so that anyone can make use of it., 67189=A generally accepted—and the only known—way of achieving this is to use cryptography. In particular, a form of asymmetric cryptography called a public key scheme is used A public key scheme employs two different but mathematically related “keys”. Such asymmetric keys work by using a so called “one way” algorithm. Such an algorithm can be used to produce a so-called digital signature with one key and verify this with the other key, but it is very time-consuming and in fact practically infeasible, with the right choice of key size, to use the verifying key to generate the signature. Currently it is a very simple matter to use the verification key to verify the signature and hence the integrity and origin of the message, and this is how each key pair is normally used. These public key schemes may either be based on so called one-way functions, where the verification process involves checking a mathematical equation (e.g. ElGamal, elliptic curves, etc. see Menezes, A, Oorschot, P. van, and Vanstone, S., Handbook of Applied Cryptography, CRC, 1996, the contents of which are incorporated herein by reference) or on encryption-decryption functions (e.g. RSA, see Rivest, R. L., Shamir, A. and Adleman, L, A method for Obtaining Digital Signatures of Public Key Cryptosystems, Communications of the ACM, 21 (2), 1978: 120-126, the contents of which are incorporated herein by reference). The latter differs from symmetric encryption, where the same key is used to both encrypt and decrypt a message. One of the advantages of such asymmetric methods is that even if a third party is in possession of the key used to verify the message they cannot produce the signature without the other key. If an encryption-decryption scheme is used, the encryption key is the verifying key and the decryption key is the signing key.}",
    "textBeforeTable": "Patent Citations Unless the context clearly requires otherwise, throughout the description and the claims, the words “comprise”, “comprising”, and the like, are to be construed in an inclusive as opposed to an exclusive or exhaustive sense; that is to say, in the sense of “including, but not limited to”. The present invention has been described above purely by way of example, and modifications can be made within the spirit of the invention. The invention also consists in any individual features described or implicit herein or shown or implicit in the drawings or any combination of any such features or any generalisation of any such features or combination, which extends to equivalents thereof. Although the above embodiments have been described in relation to a workstation and server, any situation where a message needs to be signed with a digital signature without the private key of a user leaving a secure server will also fall within this invention. Also, the terms server, client and workstation used herein are not limited to the narrow meaning of the terms. A server may be any computer or the like, which can be contacted as a central unit by a number of workstations. A workstation is in interface between the user and the server, which transmits the electronic data and passwords, if required, to the server. Clients are simply interfaces, which allow administration of a server. The embodiments provide a",
    "textAfterTable": "US7210037 * Dec 15, 2000 Apr 24, 2007 Oracle International Corp. Method and apparatus for delegating digital signatures to a signature server US20010002485 * Dec 14, 2000 May 31, 2001 Bisbee Stephen F. System and method for electronic transmission, storage, and retrieval of authenticated electronic original documents US20020002678 * Aug 14, 1998 Jan 3, 2002 Stanley T. Chow Internet authentication technology US20020042879 * Oct 5, 2001 Apr 11, 2002 Gould Terry A. Electronic signature system US20020078355 Dec 15, 2000 Jun 20, 2002 Vipin Samar Method and apparatus for delegating digital signatures to a signature server US20020095507 * Jun 28, 2001 Jul 18, 2002 Jerdonek Robert A. Methods for pre-authentication of users using one-time passwords US20020095569 * Jun 28, 2001 Jul 18, 2002 Jerdonek Robert A. Apparatus for pre-authentication of users using one-time passwords",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}