{
    "relation": [
        [
            "Citing Patent",
            "US8882001 *",
            "US8934788 *",
            "US20110182578 *",
            "US20140151050 *",
            "WO2010052388A1 *"
        ],
        [
            "Filing date",
            "Dec 19, 2012",
            "Jun 30, 2008",
            "Jun 30, 2008",
            "Dec 3, 2012",
            "Nov 4, 2009"
        ],
        [
            "Publication date",
            "Nov 11, 2014",
            "Jan 13, 2015",
            "Jul 28, 2011",
            "Jun 5, 2014",
            "May 14, 2010"
        ],
        [
            "Applicant",
            "Forced Gas Technologies, Llc",
            "Telefonaktiebolaget L M Ericsson (Publ)",
            "Fabio Cavaliere",
            "Dow Global Technologies Llc",
            "Osmooze"
        ],
        [
            "Title",
            "Fire suppression apparatus and method for generating foam",
            "Optical apparatus",
            "Optical Apparatus",
            "Injection System for Enhanced Oil Recovery",
            "Method for forming an emulsion from liquids mutually immiscible and application for the liquid supply of a nebulisation device"
        ]
    ],
    "pageTitle": "Patent US7137569 - Chemical injector - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7137569?dq=5,664,133",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 6,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 469205627,
    "recordOffset": 469186521,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations Whereas, the present invention has been described in relation to the drawings attached hereto, it should be understood that other and further modifications, apart from those shown or suggested herein, may be made within the spirit and scope of this invention. The effective dispersion of the fluid chemical in the pipeline minimizes the possibility of corrosive chemical build-up on the walls of the pipeline. In order to utilize the present invention, a ball is placed into the body 34 and the spring is thereafter placed in the body with the smallest diameter end facing and mating with the ball. Thereafter, the injector tube 30 is screwed into the body 34 to seal the tube to the body. Thereafter, the assembled chemical injector 10 is inserted into the threaded coupling 28 which is mounted by welding or otherwise fixed to the pipeline 12. An arrow 54 may be stamped or printed on an external portion of the body 34 to indicate the orientation of the angled tip of the tube tip 44 inside of the pipeline 12. The chemical delivery tube 24 attached to the chemical injection pump 20 is connected to the body 34 of the injector via tube connector 26. The chemical injector 10 may be fabricated from various materials. In a preferred embodiment, the injector is fabricated from stainless steel, although other materials are possible. The spring may be fabricated",
    "textAfterTable": "US5277250 Sep 30, 1992 Jan 11, 1994 Nalco Chemical Company Injector quill US5993296 Jun 30, 1998 Nov 30, 1999 Siemens Automotive Corporation Tool quill and method for finishing fuel injector needle tips US6165372 Aug 11, 1999 Dec 26, 2000 Betzdearborn Inc. Injection quill for water treatment US6238557 Sep 20, 2000 May 29, 2001 Betzdearborn Inc. Injection quill for water treatment * Cited by examiner Referenced by Citing Patent Filing date Publication date Applicant Title US8882001 * Dec 19, 2012 Nov 11, 2014 Forced Gas Technologies, Llc Fire suppression apparatus and method for generating foam US8934788 * Jun 30, 2008 Jan 13, 2015 Telefonaktiebolaget L M Ericsson (Publ) Optical apparatus US20110182578 * Jun 30, 2008 Jul 28, 2011 Fabio Cavaliere Optical",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}