{
    "relation": [
        [
            "Date",
            "Mar 28, 1990",
            "Aug 1, 1995",
            "Sep 8, 1999",
            "Sep 3, 2003",
            "Sep 22, 2003",
            "Apr 26, 2005",
            "Jun 28, 2006"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "FPAY",
            "FPAY",
            "AS",
            "AS",
            "AS"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Fee payment",
            "Assignment",
            "Assignment",
            "Assignment"
        ],
        [
            "Description",
            "Owner name: R. J. REYNOLDS TOBACCO COMPANY, A CORP. OF NJ, NOR Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNORS:CLEARMAN, JACK F.;CHIOU, JOSEPH J;WILLIAMS, DARRELL D.;AND OTHERS;REEL/FRAME:005273/0483 Effective date: 19900322",
            "Year of fee payment: 4",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "",
            "",
            "Owner name: JPMORGAN CHASE BANK, N.A., AS COLLATERAL AGENT,NEW Free format text: SECURITY INTEREST;ASSIGNOR:R.J. REYNOLDS TOBACCO COMPANY;REEL/FRAME:017906/0671 Effective date: 20060526"
        ]
    ],
    "pageTitle": "Patent US5099861 - Aerosol delivery article - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5099861?dq=system+for+measuring+web+traffic&ei=Lg8FT__TIIr-sQKzxaGRCg",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 475652279,
    "recordOffset": 475612595,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{113286=The cartridge contains two segments of substrate materials. One segment, positioned immediately behind the retaining member, consists of about 140 mg alumina beads and aerosol forming material described in Example 1. A second segment, positioned behind the alumina beads, consists of glycerin carried by a gathered paper wrapped in a paper wrapper. The gathered paper substrate has a generally cylindrical shape, about 3.3 mm in length and about 23.2 mm in circumference. The longitudinal axis of the cylindrical paper substrate is positioned parallel to the longitudinal axis of the article. The gathered paper is available as MS2408/S538 from Filtrona Ltd , and is gathered into a segment weighing about 25 mg. About 45 mg of glycerin is added to the gathered paper., 78488=One type of substrate has the form of a non-woven sheet-like material or a cellulosic material, such as paper. Such a substrate typically is provided as a cylindrical segment including a gathered web of paper within a circumscribing outer wrapper. Such cylindrical segments can be provided from rods which are manufactured using equipment and techniques described in U.S. Pat. No. 4,807,809 to Pryor et al. Exemplary papers which are gathered to form substrates are available as MS2408/S538 from Filtrona, Ltd. Another substrate can have the form or a porous, air permeable pad which wicks liquid aerosol forming material from a container., 99050=The entire length of the article, or any portion thereof, can be overwrapped with paper. Preferred papers which circumscribe the heat conducting member should not openly flame during use of the article and should have controllable smolder properties. Exemplary, papers are described in U.S. Pat. No. 4,779,631 to Durocher et al and European Patent Application No. 304,766. Suitable paper wrappers are available as P1981-152, P1981-124 and P1224-63 from Kimberly-Clark Corp. Tipping paper can circumscribe the extreme mouth end of the article. Suitable tipping papers are non-porous tipping papers treated with \"non-lipsticking\" materials, and such papers will be apparent to the skilled artisan., 80035=Another type of substrate has the form of a densified pellet formed from carbon or mixtures of alumina and cellulose. Densified pellets can be manufactured using a Marumerizer available from Fuji Paudal KK, Japan. See, German Patent No. 1,294,351, U.S. Pat. No. Re 27,214 and Japanese Patent Specification No. 8684/1967., 114552=The cartridge contains a segment of substrate material which is positioned immediately behind the retaining member. The segment consists of glycerin and flavor carried by a gathered paper wrapper in a paper wrapper. The gathered paper substrate has a generally cylindrical shape, about 7 mm in length and about 23 mm in circumference. The longitudinal axis of the cylindrical paper substrate is positioned parallel to the longitudinal axis of the article. The gathered paper is available as MS2408/S538 from Filtrona Ltd., and is gathered into segment weighing about 53 mg. About 130 mg glycerin and about 8 mg flavor is added to the paper. The flavor is Natural and Artificial Coffee Flavor, No. S2329, from Petran Products Corp., 87467=The composition of the combustible material of the fuel element can vary. Preferred fuel elements contain carbon, and highly preferred fuel elements are composed of carbonaceous materials. Preferred carbonaceous materials have a carbon content above about 60 weight percent, more preferably above about 75 weight percent. Flavors, extracts, fillers (e.g. clays or calcium carbonate), burn additives (e.g., sodium chloride to improve smoldering and act as a glow retardant), combustion modifying agents (e.g., potassium carbonate to control flammability), binders, and the like, can be incorporated into the fuel element. Exemplary compositions of preferred carbonaceous fuel elements are set forth in U.S. Pat. Nos. 4,793,365 to Sensabaugh, Jr. et al, 4,756,318 to Clearman et al and 4,881,556 to Clearman et al, and U.S. patent application Ser. No. 378,551, filed July 11, 1989, now U.S. Pat. No. 4,991,596 to Lawrence et al; as well as in European Patent Application No. 236,992. Other fuel elements can be provided from cellulosic materials, modified cellulosic materials, and the like.}",
    "textBeforeTable": "Patent Citations The article is used, and yields visible aerosol and coffee flavor on all puffs for about 10 puffs. The cartridge contains a segment of substrate material which is positioned immediately behind the retaining member. The segment consists of glycerin and flavor carried by a gathered paper wrapper in a paper wrapper. The gathered paper substrate has a generally cylindrical shape, about 7 mm in length and about 23 mm in circumference. The longitudinal axis of the cylindrical paper substrate is positioned parallel to the longitudinal axis of the article. The gathered paper is available as MS2408/S538 from Filtrona Ltd., and is gathered into segment weighing about 53 mg. About 130 mg glycerin and about 8 mg flavor is added to the paper. The flavor is Natural and Artificial Coffee Flavor, No. S2329, from Petran Products Corp. Aerosol delivery articles are manufactured as described in Example 2, except that the following substrate material and aerosol forming material are employed. EXAMPLE 4 The article is used, and yields visible aerosol and flavor on all puffs for about 13 puffs. The article exhibits a pressure drop of about 90 mm H2 O at 17.5 cc/sec using the device described in Example 2. The cartridge contains two segments of substrate materials. One segment, positioned immediately behind the retaining member, consists of about 140 mg alumina beads and aerosol forming material described in Example 1. A second segment, positioned",
    "textAfterTable": "US4714082 * Oct 23, 1985 Dec 22, 1987 R. J. Reynolds Tobacco Company Smoking article US4732168 * May 15, 1986 Mar 22, 1988 R. J. Reynolds Tobacco Company Smoking article employing heat conductive fingers US4756318 * Oct 28, 1985 Jul 12, 1988 R. J. Reynolds Tobacco Company Smoking article with tobacco jacket US4771795 * May 15, 1986 Sep 20, 1988 R. J. Reynolds Tobacco Company Smoking article with dual burn rate fuel element US4793365 * Sep 14, 1984 Dec 27, 1988 R. J. Reynolds Tobacco Company Smoking article US4819665 * Jan 23, 1987 Apr 11, 1989 R. J. Reynolds Tobacco Company Aerosol delivery article US4827950 * Jul 28, 1986 May 9, 1989 R. J. Reynolds Tobacco Company Method for modifying a substrate material for use with smoking articles and product produced thereby",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}