{
    "relation": [
        [
            "Citing Patent",
            "US8341717",
            "US8363658 *",
            "US8374178 *",
            "US8437321 *",
            "US8437322 *",
            "US8479266",
            "US8638716",
            "US8752160 *",
            "US8811397 *",
            "US9088638",
            "US20100135292 *",
            "US20110200045 *",
            "US20110286470 *",
            "US20140380460 *",
            "WO2014059585A1 *"
        ],
        [
            "Filing date",
            "Nov 13, 2008",
            "Nov 13, 2008",
            "Nov 30, 2009",
            "Sep 3, 2009",
            "Sep 3, 2009",
            "Nov 13, 2008",
            "Sep 3, 2009",
            "Sep 13, 2012",
            "Feb 16, 2010",
            "Sep 3, 2009",
            "Nov 30, 2009",
            "Feb 16, 2010",
            "May 20, 2010",
            "Jun 24, 2013",
            "Oct 15, 2012"
        ],
        [
            "Publication date",
            "Dec 25, 2012",
            "Jan 29, 2013",
            "Feb 12, 2013",
            "May 7, 2013",
            "May 7, 2013",
            "Jul 2, 2013",
            "Jan 28, 2014",
            "Jun 10, 2014",
            "Aug 19, 2014",
            "Jul 21, 2015",
            "Jun 3, 2010",
            "Aug 18, 2011",
            "Nov 24, 2011",
            "Dec 25, 2014",
            "Apr 24, 2014"
        ],
        [
            "Applicant",
            "Sprint Communications Company L.P.",
            "Sprint Communications Company L.P.",
            "Samsung Electronics Co., Ltd.",
            "Apriva, Llc",
            "Apriva, Llc",
            "Sprint Communications Company L.P.",
            "Apriva, Llc",
            "Sprint Communications Company L.P.",
            "Ncp Engineering Gmbh",
            "Apriva, Llc",
            "Samsung Electronics Co. Ltd.",
            "Andreas Baehre",
            "Cisco Technology, Inc.",
            "Cisco Technology, Inc.",
            "Itp Innovation Limited"
        ],
        [
            "Title",
            "Dynamic network policies based on device classification",
            "Dynamic firewall and dynamic host configuration protocol configuration",
            "Apparatus and method for supporting NAT traversal in voice over internet protocol system",
            "Method and system for communicating fixed IP address based voice data in a dynamic IP address based network environment",
            "Method and system for communicating fixed IP address based voice data in a dynamic IP address based network environment",
            "Network assignment appeal architecture and process",
            "System and method for facilitating secure voice communication over a network",
            "Dynamic firewall and dynamic host configuration protocol configuration",
            "System and method for data communication between a user terminal and a gateway via a network node",
            "System and method for facilitating secure voice communication over a network",
            "Apparatus and method for supporting nat traversal in voice over internet protocol system",
            "System and Method for Data Communication Between a User Terminal and a Gateway via a Network Node",
            "System and method for providing multicast delivery in a network environment",
            "Dynamic Communication Between Secure Endpoints",
            "Instant call translation system and method"
        ]
    ],
    "pageTitle": "Patent US8059641 - Encapsulation method discovery protocol for network address translation ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US8059641?ie=ISO-8859-1&dq=FRAIOLI",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 17,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484076423,
    "recordOffset": 484041210,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{55023=The table below shows the IP bandwidth in Kbps required for the two most common codecs and the MOS (Mean opinion score) of each codec., 94597=The comparative bandwidth utilizations of the various encapsulation methods are shown in Table 9. The table below shows the bandwidth required to support 100 concurrent calls using a G.711 Codec and packetization delay of 20 ms with the various IPSec encapsulation schemes., 97468=Table 10 below shows the bandwidth required to support 100 concurrent calls using a G.729 Codec and packetization delay of 20 ms with the various IPSec encapsulation schemes.}",
    "textBeforeTable": "Patent Citations Moreover, though the description of the invention has included description of one or more embodiments and certain variations and modifications, other variations and modifications are within the scope of the invention, e.g., as may be within the skill and knowledge of those in the art, after understanding the present disclosure. It is intended to obtain rights which include alternative embodiments to the extent permitted, including alternate, interchangeable and/or equivalent structures, functions, ranges or steps to those claimed, whether or not such alternate, interchangeable and/or equivalent structures, functions, ranges or steps are disclosed herein, and without intending to publicly dedicate any patentable subject matter. The foregoing discussion of the invention has been presented for purposes of illustration and description. The foregoing is not intended to limit the invention to the form or forms disclosed herein. In the foregoing Detailed Description for example, various features of the invention are grouped together in one or more embodiments for the purpose of streamlining the disclosure. This method of disclosure is not to be interpreted as reflecting an intention that the claimed invention requires more features than are expressly recited in each claim. Rather, as the following claims reflect, inventive aspects lie in less than all features of a single foregoing disclosed embodiment. Thus, the following claims are hereby incorporated into this Detailed Description, with each claim standing on its own as a separate preferred embodiment of the invention.",
    "textAfterTable": "Non-Patent Citations Reference 1 \"NAT Network Address Translation explained at HomeNetHelp.com\"; http://www.homenethelp.com/web/explain/about-NAT.asp; printed Apr. 18, 2006; 9 pages. 2 \"Network address translation\"; from Wikipedia, the free encyclopedia; http://en.wikipedia.org/wiki/Network-address-translation; printed Apr. 18, 2006; 5 pages. 3 \"Network Address Translation\"; http://www.vicomsoft.com/knowledge/reference/nat.html; printed Apr. 18, 2006; 10 pages. 4 \"Network address translation\"; from Wikipedia, the free encyclopedia; http://en.wikipedia.org/wiki/Network—address—translation; printed Apr. 18, 2006; 5 pages. 5 PF: NEtwork Address Translation (NAT); http://www.openbsd.org/faq/pf/nat.html; printed Apr. 18, 2006; 8 pages. Referenced by Citing Patent Filing date Publication date Applicant Title US8341717 Nov 13, 2008 Dec 25, 2012 Sprint Communications Company L.P. Dynamic network policies based on device classification US8363658 * Nov 13, 2008 Jan 29, 2013 Sprint Communications Company L.P. Dynamic firewall and dynamic host configuration protocol configuration US8374178",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}