{
    "relation": [
        [
            "Date",
            "Dec 20, 2000",
            "Dec 20, 2000",
            "Jan 2, 2001",
            "May 14, 2001",
            "Dec 3, 2004",
            "Dec 10, 2008",
            "May 4, 2011"
        ],
        [
            "Code",
            "SULP",
            "FPAY",
            "REMI",
            "AS",
            "FPAY",
            "FPAY",
            "AS"
        ],
        [
            "Event",
            "Surcharge for late payment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Assignment",
            "Fee payment",
            "Fee payment",
            "Assignment"
        ],
        [
            "Description",
            "",
            "Year of fee payment: 4",
            "",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12",
            "Owner name: SANDISK TECHNOLOGIES INC., TEXAS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SANDISK CORPORATION;REEL/FRAME:026223/0659 Effective date: 20110404"
        ]
    ],
    "pageTitle": "Patent US5638320 - High resolution analog storage EPROM and flash EPROM - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5638320?dq=5,915,131",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 9,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484785535,
    "recordOffset": 484737693,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{126633=In the read circuit of FIG. 19a, cascoding device 1940 limits drain voltage Vdrain so that memory cell 1910 operates in the linear region, and a current-mirror 1950 and a resistor 1960 generate an output voltage Vout which is proportional to current Ids through memory cell 1910. Resistor 1960 has a resistance chosen such that a P-channel pull-up device 1954 in current-mirror 1950 operates in the saturation region so that both P-channel transistors 1952 and 1954 form a current-mirror pair. During a read, a charge pump biases a control gate 1913 of memory cell 1910 to a voltage Vg which is higher than the maximum possible threshold voltage, and drain voltage Vdrain of memory cell 1910 is held constant independent of the threshold voltage of memory cell 1910. An optional feedback circuit such as inverter 1935 can increase or decrease gate voltage of cascoding device 1940 to keep drain voltage Vdrain constant. Output voltage Vout is a nearly linear function of the threshold voltage Vt of memory cell 1910 as shown in FIG. 19b by the intersections of I-V curve 1990 for resistor 1960 with curves 1992 to 1996 which are the I-V curves of P-channel current-mirror transistor 1954, corresponding to different threshold voltage Vt of memory cell 1910., 135718=When the drain 2182 of selected memory cell 2180 goes from high to low, the control gate voltage from slow ramp circuit 2110 equals the threshold voltage of selected memory cell 2180. Furthermore, if read circuits (including for example current source 2136, inverting sense amplifier 2150, and one-shot circuit 2160) used in the read operation are also used in the verify cycles during a write operation, the threshold voltage Vt equals the analog signal Vanalog written to selected memory cell 2180. Unlike the other read processes discussed earlier, there are no signal distortions and no voltage translations required when using read circuit 2100. However, if desired, the read circuits for the read operation do not need to be identical to read circuits for the verify cycles. A deliberate difference causing a predetermined offset in the threshold voltage read-outs may be desirable for some applications. Also, if desired, a companding scheme which compresses an analog signal before writing and decompresses the output voltage after reading may be employed., 134397=FIG. 21b shows a selected memory cell 2180 from memory array 2130 has a source 2181 which is grounded and a drain 2182 which is charged to less than about 1.5 volts to avoid read disturb. A current source 2136 and a cascoding device 2134 are connected to a bit line 2135 of array 2130 through a column decode transistor 2141 which is part of a conventional column decoder 2140 (FIG. 21a). While slow ramp circuit 2110 applies to a control gate 2183 a voltage below the threshold voltage Vt of memory cell 2180, the voltage at drain 2182 stays high (about 1.5 volts) because selected memory cell 2180 does not conduct (or conducts a negligible amount of current). When the control gate voltage is higher than threshold voltage Vt, selected memory cell 2180 conducts sufficient current to pull the voltage at drain 2182 low. A conventional inverting sense amplifier 2150 is connected through column decoder 2140 to selected memory cell 2180 and senses current through selected memory cell 2180. Sense amplifier 2150 trips a one-shot circuit 2160 which activates a sample-and-hold circuit 2170 when the control gate voltage reaches the threshold voltage of selected memory 2180. Sample-and-hold circuit 2170 samples the control gate voltage from slow ramp circuit 2110 and asserts an output voltage Vout., 136802=An added advantage of read circuit 2100 is that slow ramp circuit 2110 rather than drain 2182 of selected flash EPROM cell 2180 asserts the output voltage Vout. The output impedance of the slow ramp circuit 2110 is lower than the impedance of a typical pull-up device and bit line in a memory, and makes reading of output voltage Vout faster and more accurate than reading an output voltage which depends on the drain (bit line) voltage. Additionally, no complicated circuits are required., 101165=Another advantage of short duration write pulses is that the distribution of the threshold voltages of different cells is tighter with multiple short pulses than with multiple long pulses with the same total pulse duration. FIG. 10c shows experimental plots 1050 and 1060 of the standard deviation of the threshold voltages of a set of memory cells versus accumulated write time for 0.1-μs write pulses and 10-μs write pulses respectively. The standard deviation of threshold voltages drops more quickly with accumulated write time for 0.1-μs pulses than for 10-μs pulses. This can be explained by the higher injection efficiency of shorter pulses and the threshold voltage approaching the saturation threshold voltage faster., 145613=FIG. 23 illustrates using a \"cell-tracking\" current source to compensate for these variations. A current mirror circuit 2380 mirrors to the current-source pull-up devices 2328 and 2318, the current through a reference cell 2340 having a threshold voltage at the virgin level. Current mirror circuit 2380 contains P-channel device 2348 which differs in size from devices 2328 and 2318 such that the current-mirror current through cells 2320 and 2310 is a predetermined fraction of the current through reference cell 2340. Accordingly, currents through column lines 2325 and reference column lines 2315 track the intrinsic cell current through reference cell 2340, and the trip points of one-shot circuits 2160A and 2160B are less sensitive to the variations discussed earlier., 109727=Before target threshold voltage Vtt is attained, signal Vanalog being applied to control gate 1413 of selected memory cell 1410 causes memory cell 1410 to conduct. Thus drain 1412 discharges through memory cell 1410 during the verify cycle. The voltage on drain 1412 stays high when cell 1410 reaches a threshold voltage Vt which equal or exceeds signal Vanalog. A conventional inverting sense amplifier 1250 and one-shot circuit 1260 monitor drain voltage Vdrain on drain 1412 during each verify cycle. One-shot circuit 1260 trips when the voltage on drain 1412 stays high, which signals the threshold voltage of memory cell 1410 equals or exceeds target threshold voltage Vtt. One-shot circuit 1260 prevents further pulsing of control gate 1413 at voltage Vpp, or alternately, disables a write loadline such as 1130 (FIG. 11a) or 530 (FIGS. 5a and 11b) to stop the writing., 138435=FIG. 22 shows a very precise continuous ramping circuit which includes a constant current source 2210 and a capacitor 2220. Capacitor 2220 is precharged to an initial voltage V0 (typically ground) before ramping begins. During a read, current source 2210 charges capacitor 2220 with a constant current so that the output voltage Vout across capacitor 2220 rises linearly with a ramp rate .increment.V/.increment.t equal to the ratio of current from current source 2210 to the capacitance of capacitor 2220., 104140=FIG. 11b illustrates a current mirror circuit which adjusts the current of pull-up device 530 to track input analog voltage Vanalog. Signal Vanalog is applied to a gate of an N-channel transistor 1140 so that current through transistor 1140 increases with signal Vanalog. A P-channel transistor 1150 has its gate coupled to its drain and to the gate of pull-up device 530 so that the current through pull-up device 530 mirrors current through transistor 1150 and compensates for the reduced resistance of memory cell 510 when control gate voltage Vpp (and signal Vanalog) is high. FIG. 11c shows plots 1195 to 1199 of current versus drain voltage for memory cell 510 in FIGS. 11a and 11b and plots 1190 to 1194 of current versus drain voltage for pull-up device 530 for different control gate voltages Vpp and corresponding analog signals Vanalog., 133632=Another read circuit in accordance with an embodiment of this invention slowly ramps the control gate voltage of a flash EPROM cell and senses when the control gate voltage reaches the cell's threshold voltage. This embodiment is especially useful in applications such as audio record and playback applications where the available read time can be as long as the write time. FIG. 21a shows a block diagram of a read path 2100 including a slow ramp circuit 2110 which asserts a control gate voltage through a row decoder 2120 to a row line in a flash EPROM array 2130. The ramped control gate voltage can change continuously as shown in voltage versus time plot 2191 of FIG. 21c or step-wise as shown in voltage versus time plot 2192 of FIG. 21c., 146418=The above-disclosed embodiments which write or read an analog signal to a single memory cells can also be applied to systems which simultaneously read or write multiple analog signals in memory cells of an analog storage array. FIG. 26 shows a system which reads and writes multiple analog signals in an analog storage array 2640. An analog write means 2630 writes N parallel analog signals from conventional analog input buffers 2670 into analog storage array 2640. Analog write means 2630 can be any combination of one or more of the write circuits and processes (which may include verify cycles) disclosed above. Analog read means 2650, which may be any combination of the read circuits and processes disclosed above, reads N analog signals from analog storage array 2640 into conventional analog output buffers 2610. Parallel writing and reading of multiple analog signals extends the application of the analog memory to applications that require higher rates of input and output than are required in voice and audio record and playback., 103208=A variable loadline can compensate for different currents through a memory cell and maintain a constant drain voltage Vdrain. FIG. 11a shows a variable loadline circuit 1130 having an analog-to-digital converter (ADC) 1132 and a series of P-channel transistors Q1 to QN which control the impedance of variable loadline 1130. Transistors Q1 to QN have channel widths and lengths selected so that ADC 1132 applies a multi-bit digital representation of voltage Vanalog to the gates of transistors Q1 to QN and turns on a combination of transistors which makes the impedance of loadline 1130 proportional to signal Vanalog. For a standard base-two binary representation of voltage Vanalog, each transistors of Q2 to QN in the series has twice the impedance (when on) of the preceding transistor Q1 to QN-1., 114217=FIG. 15e illustrates a waveform with initial write pulses 1570 having peak voltage above level Vpp which provides target threshold voltage Vtt. The initial write pulses write a memory cell faster, and are reduced in magnitude before the threshold voltage is driven over the target threshold voltage Vtt. FIG. 15f shows a waveform that has initial write pulses have higher peak voltage and longer duration than subsequent write pulses. FIGS. 15f through 15h illustrate a variety of ways to vary both the peak voltage and the duration of the write pulses., 144070=FIG. 25 shows an embodiment which uses reference cells 2510 in combination with the source follower read process as disclosed in regard to FIGS. 20a and 20b. During a read, after a predetermined bias voltage Vbias2 (about 6 volts) is applied to control gates of both a selected memory cell 2010 in the array and a selected reference cell 2510, common source line 2011 of cells 2510 and 2010 is ramped up to voltage Vbias1 to avoid read disturb as discussed above. Voltages Vouta on column line 2015 and Voutb on a reference column line 2515 have one-to-one relationships with the threshold voltages of respective cells 2010 and 2510. Sample-and-hold circuits 2170A and 2170B simultaneously sampled voltages Vouta and Voutb at a predetermined time. The difference between the sampled voltages Vouta and Voutb indicates the threshold voltage of selected memory cell 2010 relative to the threshold voltage of reference cell 2510 and indicates the input analog signal stored in selected memory cell 2010., 125437=The read circuit of FIG. 18a has two drawbacks. First, biasing memory cell 1810 in the saturation region allows a high drain voltage which can disturb the threshold voltage Vt of memory cell 1810 during a read. Second, the linearity between voltage Vout and threshold voltage Vt (or signal Vanalog) is poor which makes producing a signal equal to signal Vanalog difficult., 138972=Flash EPROM cells, just like the other types of floating gate memory cells, exhibit intrinsic charge loss over time. To compensate for the intrinsic charge loss, one or more columns of reference cells can be added to a memory array. FIG. 23 shows an embodiment of this invention which includes reference cells 2310. For the purpose of illustration, FIG. 23 shows only a single reference cell 2310. An actual flash memory would typically contain hundred of reference cells 2310 with drains 2312 connected together through a reference column line 2315. Additional columns of reference cells 2310 can also be added. A control gate 2313 of each reference cell 2310 is connected through a row line 2330 to control gates 2323 of memory cells 2320 in a row of the array. (A row with a single memory cell 2320 is shown for simplicity of illustration.) Sources 2311 of reference cells 2310 are connected to ground., 147479=Writing and reading processes in accordance with this invention are also applicable to storing conventional digital data and information. A memory 2700 shown in FIG. 27 handles multiple bits of conventional digital data. An input/output buffer 2710 provides a conventional interface between a data bus 2770 and a conventional digital-to-analog converter (DAC) 2720 and between data bus 2770 and a conventional ADC 2760. DAC 2720 converts input digital data into an analog signal which has discrete possible values. An analog write means 2730 writes the analog signal into a memory array 2740 in the form of varying threshold voltages. Analog writing means 2730 can use any combination of one or more of the write circuits and processes (which may also include verify cycles) described above. An analog read means 2750 reads the stored information and may use any combination of the read circuits and processes described earlier. ADC 2760 converts the output voltage read from the memory cells in the storage array 2740 into multiple bits of conventional digital data., 124416=One way to read a threshold voltage is to bias a flash EPROM cell 1810 as shown in FIG. 18a. Flash EPROM cell 1810 has a control gate 1813 biased high to a voltage Vg which exceeds the maximum possible threshold voltage of memory cell 1810. A drain 1812 of memory cell 1810 connects through a pull-up device 1830 to power supply voltage Vcc. Pull-up device 1830 has a resistance R such that memory cell 1810 operates in the saturation region for the full range of possible threshold voltages Vt. FIG. 18b shows a family of I-V curves 1892 to 1896 for memory cell 1810. The saturation current of memory cell 1810 decreases with increasing threshold voltage Vt. The intersections of a loadline I-V curve 1891 and I-V curves 1892 to 1896 are the output voltages Vout read at node 1825 and show a one-to-one correspondence between output voltage Vout and threshold voltage Vt. As described above, the threshold voltage Vt of memory cell 1810 indicates the analog signal Vanalog stored in memory cell 1810., 111759=During a verify cycle, read circuit 1252 reads the threshold voltage of the selected cell and asserts to an input terminal of a comparator 1254 a voltage Vout indicating the value stored in the selected cell. A signal V1 that has a one-to-one correspondence with analog signal Vanalog is applied to a second input terminal of comparator 1254. Comparator 1254 trips one-shot circuit 160 when voltage Vout is first greater than or equal to signal V1. When one-shot circuit 1260 is tripped, voltage Vout read from the selected memory cell equals signal V1 to within a resolution defined by the change in threshold voltage per write pulse, and one-shot circuit 1260 generates a signal to terminate the write process. Signal Vanalog is determined from the one-to-one correspondence with signal V1, and writing is terminated by stopping further write pulses, stopping channel current through the selected cell, or stopping both write pulses and channel current., 116220=FIG. 16b shows an example write pulse 1691 used in the embodiment of FIG. 16a. At a time T0, before write pulse 1691 is asserted to a control gate 1613 of selected memory cell 1610, a signal PRECHARGE CLOCK turns on P-channel transistor 1650 which connects voltage Vdd to a node 1645 and a capacitor 1640. Node 1645 and capacitor 1640 can be connected through a column decoder including decode device 1630 to any column in a block of a memory array (not shown) which contains memory cell 1610. Column decoder device 1630 connects node 1645 and capacitor 1640 to drain 1612 of selected memory cell 1610., 99708=FIG. 10a shows plots 1010 and 1020 of threshold voltage versus the total accumulated write time for write pulses that are 0.1 μs and 10 μs long respectively applied to a typical memory cell. As shown in FIG. 10a, threshold voltage increases faster when multiple short pulses are applied to a control gate., 133401=The read circuit of FIG. 20a biases source 2011 high. Alternatively, the roles of drain 2012 and source 2011 can be reversed so that drain 2012 is biases high during a read using the timing as shown in FIG. 20b., 100033=Short write pulses also achieve high resolution in the written threshold voltage Vtt. As the number of pulses increases, the threshold voltage of the memory cell approaches a saturation threshold voltage corresponding to the control gate voltage Vpp, and the number of hot electrons injected per pulse into the floating gate decreases. When the written threshold voltages the number of write pulses, the threshold voltage change per pulse determines the possible resolution between two consecutive threshold voltages. Row driver size and total resistance and capacitance of the control gates in a row of memory cells determine the minimum charging and discharging times for a row and restrict the shortest write pulses usable for programming a flash EPROM cell. As shown in FIG. 10b, a plot 1030 of the threshold voltage change per pulse for short write pulses of about 0.1 μs decreases more rapidly with accumulated write time than does a plot 1040 of the threshold voltage changes per long write pulses of 10 μs. Accordingly, using shorter write pulses improves the resolution of the threshold voltage written., 139897=The reference columns can be located anywhere within the memory array. If reference cells 2310 are placed at one edge of the array, a column of \"dummy\" cells should be placed next to the reference column at the outer edge of the array to minimize the optical/microloading effects. Similar \"dummy\" columns and rows should be added to the other edges of the memory array., 140306=After a conventional erase, a signal corresponding to the minimum possible analog signal, is written into each of reference cells 2310. That is, control gates 2313 of the reference cell 2310 are pulsed to the minimum voltage Vpp while line 2315 is driven a desired drain voltage during a write operation. As an alternative to writing a minimum analog signal to reference cells 2310, the signal written into reference cells 2310 can correspond to the maximum analog signal, or an intermediate voltage. The writing of reference cells 2310 can occur before or after the writing of input analog signals into the memory cell 2320. For example, in an application such as sound recording where most or all of memory cells 2320 are written in a relatively short time, the reference column is written at the beginning or end of the recording. For random access applications, reference cells are typically written after a corresponding block of memory cells is erased., 118481=FIG. 16d shows the timing of pulses applied to control gate 1613 and drain 1612 of FIG. 16c. Voltage Vpp is asserted to control gate 1613 at a time T0' while voltage Vcd is low and no current flows through memory cell 1610. The write control signal goes low at time T1' and begins a write pulse 1651 to drain 1612. Between time T1' and a time T2', current through memory cell 1610 increases while voltage on node 1645 charges to almost voltage Vdd. Since control gate 1613 is at voltage Vpp, CHE injection becomes significant when the current through memory cell 1610 and the voltage drop across memory cell 1610 exceed critical levels for producing hot electrons., 148566=As discussed earlier, an advantage of storing conventional digital information in the analog form is the reduction of the size of memory array 2740. Data which requires one memory cell per bit to store in a conventional binary memory cell, can be stored with several bits per single memory cell in the form of varying threshold voltage. The resolution, or the number of bits per cell depends on several factors such as the resolution or accuracy of DAC 2720, analog write means 2730, analog storage array 2740, analog read means 2750, and ADC 2760. According to this invention, a threshold voltage resolution of better than 1 mV can be achieved and therefore, each 5-volt range of threshold voltages has more than 4,096 distinguishable analog levels and can store the equivalent of more than 12 bits of digital information. The digital information themselves can be compressed digital data which are compressed by any conventional data compression means (performed outside of the memory system 2700)., 132002=The capacitance 2030 connected to drain 2012 through column decode device 2020 charges up as the voltage at source 2011 is ramped. Before memory cell 2010 approaches the threshold voltage cutoff, current Ids is small because capacitor 2030 remains nearly charged and a high resistance load 2040 (typically 1 MΩ to 10 MΩ) limits current Ids. Load 2040 acts as a \"bleeder\" to ground to prevent output voltage Vout from overshooting. Without load 2040, noise in supply voltages can temporary increase voltage Vbias1 and charge drain 2012 (and voltage Vout) to a high level that is preserved when the supply voltage falls., 117764=Another method for generating write pulses is to pulse the drain voltage of a selected memory cell. FIG. 16c shows an embodiment of this invention where a write control signal applied to the gate of P-channel transistor 1650 controls drain voltage Vdrain of selected memory cell 1610. FIG. 16c differs from FIG. 16a in that no capacitor is connected to node 1645 in FIG. 16c. The embodiments of FIGS. 16a and 16c use P-channel transistor 1650 to control pulsing of drain 1613. Alternatively, an N-channel transistor could operate with write control pulses opposite in phase to those shown in FIGS. 16b, 16d, and 16e and with the high level of the pulses bootstrapped to voltages above voltage Vdd., 119759=Alternative timing diagrams to those shown in FIG. 16d are shown in FIG. 16e in which drain 1612 is pulsed a number of times while control gate 1613 remains at voltage Vpp. There are no verify cycles between initial write pulses 1661 applied to drain 1612. Verify cycles 1652 occur between subsequent write pulses 1663 when the threshold voltage of the memory cell 1610 is near its target threshold voltage Vtt. The waveforms of FIG. 16e is similar to the waveform described in regard to FIG. 15d and reduce the total write time because dormant times 1662 between the write pulses 1661 can be shorter than the time required for the verify cycles 1652. Variation of the durations and amplitudes of drain write pulses adjust the effect of write pulses in a manner similar to variation of control gate write pulses such as shown in FIGS. 15a, 15b, and 15c., 137311=Slow ramp circuit 2110 can begin ramping up the control gate voltage from any voltage lower than the minimum threshold voltage in memory array 2130. Alternatively, control gate voltage can be ramped down from a high voltage (higher than the maximum possible threshold voltage), and the threshold voltage is detected when the selected memory cell stops conducting. In the above embodiments, the ramping can stop once the threshold voltage is detected, or it can continue until the end of the read period., 142092=Difference amplifier 2350 generates a difference signal Vout which is proportional to the difference in the threshold voltages of memory cell 2320 and reference cell 2310. Accordingly, the difference signal Vout is the difference between threshold voltage Vt of memory cell 2320 (indicating the stored analog signal Vanalog) and the threshold voltage of reference cell 2310 (indicating the minimum possible analog signal). Variations such as those in power supply voltage, temperature, and intrinsic charge loss, many common mode noises, and offsets in the write and read circuits for cells 2310 and 2320 tend to track each other and cancel in the difference signal Vout. As a result, the quality of the signal Vout is improved., 119165=At time T2', the write control signal goes high. Voltage Vcd and the channel current through memory cell 1610 fall. Since CHE injection stops when drain voltage Vdrain stops producing hot electrons, the effective duration of write pulse 1651 is limited by the duration of the write control signal rather than the duration that the control gate is at voltage Vpp. The write control signal goes high at time T2' before the voltage on control gate 1613 falls to voltage Vanalog at time T3'. Control gate 1613 is lowered to voltage Vanalog for a verify cycle as described above., 108932=FIG. 14 shows verify circuitry which biases and reads a selected floating gate non-volatile memory cell 1410 during a verify cycle. Additional circuitry (not shown but well known) generates the drain voltage of memory cell 1410 during a write pulse. During a verify cycle, a drain 1412 of selected memory cell 1410 is pulled up by a weak current source 1440. A cascoding device 1430 gated with a bias voltage Vbias limits drain voltage Vdrain of drain 1412 to less than about 1.5 volts to avoid a read disturb. If drain voltage Vdrain is more than about 1.5 volts for an extended period of time, some electrons, aided by the electric field caused by drain voltage Vdrain, escape from the floating gate of memory cell 1410 and reduce the threshold voltage of memory cell 1410., 108137=During a verify cycle, the control gate voltage of the selected memory cell equals signal Vanalog, and source and drain voltages are set for reading the selected cell. For example, the drain is at about 1.5 volts, and the source is grounded. A conventional column decoder 1240 and an inverting sense amplifier 1250 determine if signal Vanalog causes the selected memory cell to conduct and asserts to a one-shot circuit 1260 a signal that indicates whether the threshold voltage of the selected memory cell is lower than signal Vanalog. If the signal indicates the threshold voltage exceeds signal Vanalog, further writing is inhibited. FIG. 13 shows a typical voltage waveform asserted to the control gate of the selected flash EPROM cell during the write and verify cycles., 137834=The accuracy of read path 2100 depends on the ramp rate or the ramp step size and is independent of the time before one-shot circuit 2160 activates sample-and-hold circuit 2170. Slower ramp rates increase the accuracy or resolution of the read voltages Vout. For a range of threshold voltages between 2 and 7 volts, increasing the control gate voltage by 1 mV every 20 ns achieves a read resolution of 1 mV within a total read time of 100 μs. Accordingly, the read path 2100 would not be a bottleneck that limits the accuracy of the storage (writing and reading) of analog signals., 142840=Addition of reference columns and generating a differential output voltage also applies to the other read processes. FIG. 24 shows an embodiment which adds a column of reference cells 2410 to a flash memory cells having read circuits as disclosed in regard to FIG. 19a where selected memory cell 1910 is biased in the linear region. A reference memory cell 2410 within the reference column is biased in the linear region during a read by a cascoding device 2440 through a column decoder 2430 and a bit line 2415 which are substantially identical to cascoding device 1940, column decoder 1930, and bit line 1915 described in regard to FIG. 19a. Current mirror 1950 and resistor 1960 generate output voltage Vouta which indicates the threshold voltage of selected memory cell 1910. Current mirror 2450 and resistor 2460 generate output voltage Voutb which indicates the threshold voltage of selected reference cell 2410. Two sample-and-hold circuits 2170A and 2170B sample output voltages Vouta from selected memory cell 1910 and Voutb from reference memory cell 2410 at a predetermined time during a read. The two voltages Vouta and Voutb feed difference amplifier 2350 which generates a difference signal Vout., 111104=During a write operation, a write control circuit 1280 controls which of high voltage shifter 1210 and read voltage source 1270 drives the control gate of the selected memory cell. During write pulses, high voltage shifter 1210 asserts voltage Vpp to the control gate, and the threshold voltage of the selected memory cell increases. During verify cycles, read voltage source 1270 asserts a voltage to the control gate for reading the selected memory cell. Other circuits (not shown in FIG. 12b) drive the drain and source voltages for increasing the threshold voltage during write pulses and for reading the cell during verify cycles., 121426=FIGS. 17a and 17b illustrate an embodiment of this invention having a loadline 1730 which changes resistance with time to provide a higher initial drain voltage to increase initial injection current and writing speed and a lower drain voltage near the target threshold voltage Vtt to improve resolution. Loadline 1730 contains a binary counter 1732 and a series of transistors Q1 to QN. The series of transistors Q1 to QN has increasing resistance as described in regard to FIG. 11a. Write pulses in addition to being asserted to control gate 513 of memory cell 510 are asserted to a clock input terminal of binary counter 1732 so that binary counter 1732 increments with each write pulse and changes the combination of transistors Q1 to QN which are on. The resistance of loadline 1730 increases with each write pulse thereby decreasing current through memory cell 510 and the voltage on drain 512. During a write, the loadline current versus drain voltage plot changes from plot 1790 to plot 1795 shown in FIG. 17b, and the current through memory cell 510 and the CHE injection current decrease. Decreasing the CHE injection improves threshold voltage resolution near the target threshold voltage. After writing memory cell 510, a reset signal resets binary counter 1732 for writing the next memory cell., 116842=At a time T1, P-channel transistor 1650 disconnects voltage Vdd from capacitor 1640 and node 1645. Node 1645 is charged to an initial drain voltage Vdrain about equal to voltage Vdd. At a time T2, write pulse 1691 begins, and memory cell 1610 discharges drain 1612 to a low level (about 0 volts in FIG. 16b). Capacitor 1640 and the capacitance of circuitry coupled to drain 1612 and node 1645 control the rate at which drain voltage Vdrain decreases. Even when control gate 1613 stays at a high voltage Vpp, CHE injection stops when drain voltage Vdrain drops below a critical level required for providing hot electrons in the channel of memory cell 1610. This effectively generates short duration write pulses and achieves a high threshold voltage resolution. At time T3, when drain 1612 is nearly discharged, the voltage on control gate 1613 falls to voltage Vanalog, and a verify cycle is performed., 149586=If the number of bits of data on bus 2770 is greater than what the resolution of system 2700 can store in a single memory cell, the data can be split and stored in two or more memory cells. For example, a 16-bit data signal on input data bus 2780 can be split into two 8-bit signals. DAC 2720 converts the two 8 -bit signals into two analog signals each having 256 possible levels, and analog write means 2730 writes the two analog signals into two memory cells in analog storage array 2740. During a read, analog read means 2750 reads two analog signals, and ADC 2760 converts the two analog signals into two 8-bit digital signals. The two 8-bit digital signals are then combined into a 16-bit output signal on data bus 2790., 145090=As described earlier, physical dimension variations, process variations and other factors, as well as supply voltage and temperature variations, can cause the cell current to vary during a read operation and from one read operation to the next. Current variation is particularly a concern for the control gate slow ramp process described in regard to FIGS. 21a, 21b, 21c, 22, and 23 because the trip points of the one-shot circuits 2160 depend on pull-up device currents versus the memory cell currents., 107034=FIG. 12a shows a block diagram of write and verify paths for an embodiment of this invention where the target threshold voltage Vtt of a selected memory cell equals analog signal Vanalog. In FIG. 12a, a voltage shifter 1210 generates a control gate write voltage Vpp from signal Vanalog. Voltage Vpp and signal Vanalog are asserted to input terminals of a multiplexer 1215. Multiplexer 1215 has an output terminal connected to a conventional row decoder 1220 and alternates between selecting voltage Vpp as output signal during write pulses and selecting signal Vanalog as output signal during verify cycles. Row decoder 1220 drives the control gates of the row in flash EPROM array 1230 containing the selected memory cell., 110622=FIG. 12b shows an alternative write path which uses read circuitry 1252 and 1270 during verify cycles. Read circuitry 1270 and 1252 respectively drive a control voltage of a selected memory cell and generate a voltage Vout indicating the value stored in the selected memory cell. Several alternative embodiments for read circuits 1270 and 1252 are disclosed below and circuits 1270 and 1252 can perform both read operations and verify cycles of write operations., 126327=where Vdrain is the drain voltage and Vt is the threshold voltage of memory cell 1910. For any given threshold voltage Vt of memory cell 1910, change .increment.Ids in current Ids is proportional to change .increment.Vfg in floating gate voltage Vfg if drain voltage Vdrain is constant., 127910=FIG. 20a illustrates a read circuit 2000 which uses a source follower approach for reading the threshold voltage of a memory cell 2010. Read circuit 2000 has the advantage of consuming very little power. In a typical flash EPROM array, drains of memory cells are coupled together in columns through metal bit lines, and sources are coupled together in blocks through diffused and metal source lines. In the discussion of FIGS. 20a and 20b, a source 2011 is the terminal of memory cell 2010 connected to the source lines of the array, and a drain 2012 is the terminal connected to bit line 2015. Electrical classification of current carrying terminals, a source/drain terminal and a drain/source terminal, as either the source or drain depends on the voltages applied and may differ from the structural classification used here., 132650=As memory cell 2010 enters the saturation region, drain-to-source voltage Vds increases because voltage at drain 2012 cannot exceed Vbias2-Vt. A read disturb problem does not arise because: (1) channel current Ids is several orders of magnitude smaller during a read than channel current Ids during a write; (2) the floating gate-to-source voltage difference is small (about one volt) and the resulting vertical electric field between the floating gate and source 2011 is weak, and between the floating gate and drain 2012, tends to repel electrons from getting into the floating gate; and (3) the body effect due to the source bias reduces the generation of substrate current and hence further reduces generation of hot electrons., 113862=FIG. 15d shows a waveform which disables verify cycles 1560 between initial write pulses 1530 and enables verify cycles 1550 between the subsequent write pulses 1540. Total waveform of FIG. 15d reduces write time because dormant times 1560 between initial write pulses 1530 can be shorter than the time required for verify cycles 1550., 128757=In read circuit 2000, a control gate 2013 and source 2011 of memory cell 2010 are biased high during a read, and parasitic capacitance 2030, bit line 2015 and structures connected to bit line 2015 through a column select device 2020 charge to an output voltage Vout. Voltage Vout corresponds one-to-one to the threshold voltage Vt of memory cell 2010 because of the source follower action which keeps drain 2012 at a voltage less than Vbias2-Vt. The well known body effect on memory cell 2010 affects the relation between output voltage Vout and stored signal Vanalog because a read operation charges drain 2012 (which acts electrically as the source of the memory cell 2010 during a read) and increases the source bias of the memory cell 2010. The source bias causes a deviation δVt from threshold voltage Vt0 of memory cell 2010 at zero source bias. Eq. 4 gives the deviation δVt., 130120=Deviation δVt in threshold voltage Vt distorts the relation between signal Vout and input signal Vanalog especially if read circuit 2000 is not used in the verify cycles of a write operation. If circuit 2000 reads threshold voltage Vt for both read operations and verify cycles, then deviation δVt affects the linearity between analog signal Vanalog and the threshold voltage Vt but retains the linearity between signal Vanalog and signal Vout. If the body factor m is large, as in typical flash EPROM cells, the nonlinear mapping of input analog signal Vanalog into threshold voltages Vt is undesirable because .uniform steps in analog signal Vanalog cause non-linear steps in threshold voltage Vt. For some values of signal Vanalog (and voltage Vout), write pulses which change the threshold voltage of a cell as described above, may cause a change that exceeds the desired resolution in signal Vanalog (and Vout)., 131056=A source follower read process in accordance with this invention controls drain-to-source voltage Vds and channel current Ids of memory cell 2010 to eliminate read disturb problems. As shown in the timing diagram in FIG. 20b, control gate 2013 is first biased high to a voltage Vbias2 (typically about 6 volts). Then, after a time .increment.t, source terminal 2011, acting electrically as a drain in this case, is slowly ramped from ground up to a voltage Vbias1 (typically about 6 volts). Ramping of source 2011 is at a rate which initially restricts memory cell 2010 to operation in the linear region to avoid the generation of hot electrons at high currents. Before the voltage difference between control gate 2013 and drain 2012 reaches the threshold voltage of memory cell 2010, the voltage at drain 2012 closely follows the voltage at source 2011 and limits the drain-to-source voltage Vds to less than about 1.5 volts., 115671=FIG. 16a shows an embodiment of this invention that limits the total charge which flows through a selected memory cell 1610 during a write pulse. Before each write pulse, a P-channel transistor 1650 and a column decode device 1630 connect a voltage Vdd to a capacitor 1640 and to a drain of memory cell 1610. Voltage Vdd is high enough to provide hot channel electrons and depends on the structure of memory cell 1610. Typically, voltage Vdd is independent of the supply voltage Vcc and is supplied by a high voltage charge pump., 141284=During a read of a selected memory cell 2320, a reference cell 2310 in the same row as the selected cell 2320 is also selected. The embodiment of FIG. 23 illustrates using the slow ramp read process as an example. As slow ramp circuit 2110 ramps the voltage on row line 2330 (the control gate voltages of cells 2310 and 2320), the threshold voltages of memory cells 2310 and 2320 are read out separately through separate read paths as shown in FIG. 23. The read path for cell 2320 (2310) include a sense amplifier 2150A (2150B), a one shot circuit 2160A (2160B), and a sample-and-hold circuit 2170A (2170B). Sample-and-hold circuits 2170A and 2170B generate output voltages equal to the threshold voltages of cells 2320 and 2310 respectively which are sent to a difference amplifier 2350., 125829=To avoid the read disturb problem, a cascoding device 1940 as shown in FIG. 19a can limit the drain voltage to less than about 1.5 volt. This restricts memory cell 1910 to operation in the linear region. In the linear region, a current Ids through memory cell 1910 depends on the floating gate voltage Vfg as shown in the eq. 3., 49013=This application is a division of application Ser. No. 08/333,381, filed Nov. 2, 1994.}",
    "textBeforeTable": "Patent Citations Although the present invention has been described with reference to particular embodiments, the description is only an example of the invention's application and should not be taken as a limitation. Various adaptations and combinations of features of the embodiments disclosed will be apparent to those skilled in the art and are within the scope of the present invention as defined by the following claims. If the number of bits of data on bus 2770 is greater than what the resolution of system 2700 can store in a single memory cell, the data can be split and stored in two or more memory cells. For example, a 16-bit data signal on input data bus 2780 can be split into two 8-bit signals. DAC 2720 converts the two 8 -bit signals into two analog signals each having 256 possible levels, and analog write means 2730 writes the two analog signals into two memory cells in analog storage array 2740. During a read, analog read means 2750 reads two analog signals, and ADC 2760 converts the two analog signals into two 8-bit digital signals. The two 8-bit digital signals are then combined into a 16-bit output signal on data bus 2790. As discussed earlier, an advantage of storing conventional digital information in the analog form is the reduction of the size of memory array 2740. Data which requires one memory cell per bit to store in a conventional binary",
    "textAfterTable": "Dec 26, 1989 Information Storage Devices High density integrated circuit analog signal recording and playback system US4935702 * Dec 9, 1988 Jun 19, 1990 Synaptics, Inc. Subthreshold CMOS amplifier with offset adaptation US4989179 * Oct 12, 1989 Jan 29, 1991 Information Storage Devices, Inc. High density integrated circuit analog signal recording and playback system US4996571 * Jul 6, 1989 Feb 26, 1991 Hitachi, Ltd. Non-volatile semiconductor memory device erasing operation US5012448 * Jul 15, 1988 Apr 30, 1991 Ricoh Company, Ltd. Sense amplifier for a ROM having a multilevel memory cell US5028810 * May 18, 1990 Jul 2, 1991 Intel Corporation Four quadrant synapse cell employing single column summing line US5042009 * Dec 9, 1988 Aug 20, 1991 Waferscale Integration, Inc. Method for programming a floating gate memory device US5055897 *",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}