{
    "relation": [
        [
            "Citing Patent",
            "US6075069 *",
            "US6086193 *",
            "US6196659 *",
            "US6375308",
            "US6474799 *",
            "US6499824",
            "US7029109 *"
        ],
        [
            "Filing date",
            "Sep 23, 1997",
            "Aug 4, 1997",
            "Dec 2, 1997",
            "Sep 29, 1997",
            "Mar 15, 2000",
            "Sep 19, 2000",
            "Aug 15, 2002"
        ],
        [
            "Publication date",
            "Jun 13, 2000",
            "Jul 11, 2000",
            "Mar 6, 2001",
            "Apr 23, 2002",
            "Nov 5, 2002",
            "Dec 31, 2002",
            "Apr 18, 2006"
        ],
        [
            "Applicant",
            "Seiko Epson Corporation",
            "Seiko Epson Corporation",
            "Canon Kabushiki Kaisha",
            "Seiko Epson Corporation",
            "Seiko Epson Corporation",
            "Canon Kabushiki Kaisha",
            "Canon Kabushiki Kaisha"
        ],
        [
            "Title",
            "Color ink jet recording method",
            "Ink cartridge and a printing device using the ink cartridge",
            "Ink jet recording apparatus with dedicated wiping members",
            "Ink jet recording apparatus with high and low color-density inks",
            "Ink cartridge and a printing device using the ink cartridge",
            "Ink jet recording apparatus with dedicated wiping members",
            "Ink, ink set, ink jet recording method, ink jet recording apparatus, recording unit and ink cartridge"
        ]
    ],
    "pageTitle": "Patent US5731825 - Image recording apparatus and method - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5731825?ie=ISO-8859-1&dq=6373188",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 471904003,
    "recordOffset": 471871790,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{80524=FIG. 11 is a block diagram showing the image signal processing portion of a first embodiment of an ink jet recording apparatus in accordance with the present invention. In the following embodiments, it is assumed that a recording apparatus wherein an ordered dithering or error diffusion technique is employed to convert the input signal into a binary signal, and to control the intensity by the number of dots in superpixels. With regard to these techniques, the description on pages 350-352 of \"Output Hardcopy Device\", 1988, edited by Robert C. Durbeck et al., Academic Press, Inc. is incorporated here by reference., 126473=In addition, the present invention can be applied to such apparatus where the ink is liquefied just before the ejection by the thermal energy as follows so that the ink is expelled from the orifices in the liquid state, and then begins to solidify on hitting the recording medium, thereby preventing the ink evaporation: the ink is transformed from solid to liquid state by positively utilizing the thermal energy which would otherwise cause the temperature rise; or the ink, which is dry when left in air, is liquefied in response to the thermal energy of the recording signal. In such cases, the ink may be retained in recesses or through holes formed in a porous sheet as liquid or solid substances so that the ink faces the electrothermal transducers as described in Japanese Patent Application Laying-open Nos. 56847/1979 or 71260/1985. The present invention is most effective when it uses the film boiling phenomenon to expel the ink., 48108=This application is a continuation of application Ser. No. 08/589,307 filed Jan. 22, 1996, which was a continuation of application Ser. No. 07/942,935 filed Sep. 10, 1992, both now abandoned., 122757=U.S. Pat. Nos. 4,558,333 and 4,459,600 disclose the following structure of a recording head, which is incorporated to the present invention: This structure includes heating portions disposed on bent portions in addition to a combination of the ejection orifices, liquid passages and the electrothermal transducers disclosed in the above patents. Moreover, the present invention can be applied to structures disclosed in Japanese Patent Application Laying-open Nos. 123670/1984 and 138461/1984 in order to achieve similar effects. The former discloses a structure in which a slit common to all the electrothermal transducers is used as ejection orifices of the electrothermal transducers, and the latter discloses a structure in which openings for absorbing pressure waves caused by thermal energy are formed corresponding to the ejection orifices. Thus, irrespective of the type of the recording head, the present invention can achieve recording positively and effectively.}",
    "textBeforeTable": "Patent Citations Although specific embodiments of an image recording apparatus constructed in accordance with the present invention have been disclosed, it is not intended that the invention be restricted to either the specific configurations or the uses disclosed herein. Modifications may be made in a manner obvious to those skilled in the art. Accordingly, it is intended that the invention be limited only by the scope of the appended claims. Furthermore, the ink jet recording apparatus of the present invention can be employed not only as an image output terminal of an information processing device such as a computer, but also as an output device of a copying machine including a reader, and as an output device of a facsimile apparatus having a transmission and receiving function. In addition, the present invention can be applied to such apparatus where the ink is liquefied just before the ejection by the thermal energy as follows so that the ink is expelled from the orifices in the liquid state, and then begins to solidify on hitting the recording medium, thereby preventing the ink evaporation: the ink is transformed from solid to liquid state by positively utilizing the thermal energy which would otherwise cause the temperature rise; or the ink, which is dry when left in air, is liquefied in response to the thermal energy of the recording signal. In such cases, the ink may be retained in recesses or through holes",
    "textAfterTable": "US4740796 * Feb 6, 1986 Apr 26, 1988 Canon Kabushiki Kaisha Bubble jet recording method and apparatus in which a heating element generates bubbles in multiple liquid flow paths to project droplets US4829323 * Aug 21, 1987 May 9, 1989 Canon Kabushiki Kaisha Color image recording apparatus US4853768 * Dec 24, 1986 Aug 1, 1989 Canon Kabushiki Kaisha Color image processing apparatus with linear masking circuit having coefficients which vary in accordance with the levels of color component signals US4882621 * Nov 6, 1987 Nov 21, 1989 Canon Kabushiki Kaisha Color image recording apparatus JPS581276A * Title not available JPS5456847A * Title not available JPS5865666A * Title not available JPS6071260A *",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}