{
    "relation": [
        [
            "Citing Patent",
            "US5612246 *",
            "US5801081 *",
            "US5943562 *",
            "US5994188 *",
            "US6096583 *",
            "US6127701 *",
            "US6162665 *",
            "US6291858",
            "US6350653",
            "US6590259",
            "US6759282",
            "US6835629",
            "US7141853",
            "US7320918",
            "US7491588",
            "US20040066827 *",
            "US20050029592 *",
            "US20130083492 *"
        ],
        [
            "Filing date",
            "Oct 27, 1995",
            "May 28, 1997",
            "Oct 14, 1997",
            "Oct 3, 1997",
            "Aug 12, 1998",
            "Apr 5, 1999",
            "May 23, 1995",
            "Jan 3, 2000",
            "Oct 12, 2000",
            "Nov 2, 2001",
            "Jun 12, 2001",
            "Jan 23, 2003",
            "Apr 27, 2004",
            "May 11, 2005",
            "Nov 13, 2006",
            "Sep 26, 2003",
            "Apr 27, 2004",
            ""
        ],
        [
            "Publication date",
            "Mar 18, 1997",
            "Sep 1, 1998",
            "Aug 24, 1999",
            "Nov 30, 1999",
            "Aug 1, 2000",
            "Oct 3, 2000",
            "Dec 19, 2000",
            "Sep 18, 2001",
            "Feb 26, 2002",
            "Jul 8, 2003",
            "Jul 6, 2004",
            "Dec 28, 2004",
            "Nov 28, 2006",
            "Jan 22, 2008",
            "Feb 17, 2009",
            "Apr 8, 2004",
            "Feb 10, 2005",
            "Apr 4, 2013"
        ],
        [
            "Applicant",
            "Samsung Electronics Co., Ltd.",
            "Fujitsu Ltd.",
            "Advanced Micro Devices, Inc.",
            "Delco Electronics Corporation",
            "Mitsubishi Denki Kabushiki Kaisha",
            "Delco Electronics Corporation",
            "Ixys Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Stmicroelectronics S.R.L.",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "International Business Machines Corporation",
            "Steiger Thomas D.",
            "Campbell John E.",
            "Samsung Electro-Mechanics Co., Ltd"
        ],
        [
            "Title",
            "Method for manufacturing semiconductor substrate having buck transistor and SOI transistor areas",
            "Semiconductor device and method of manufacturing semiconductor device",
            "Semiconductor fabrication employing a transistor gate coupled to a localized substrate",
            "Method of fabricating a vertical power device with integrated control circuitry",
            "Semiconductor device and manufacturing method thereof",
            "Vertical power device with integrated control circuitry",
            "High voltage transistors and thyristors",
            "Multistack 3-dimensional high density semiconductor device and method for fabrication",
            "Embedded DRAM on silicon-on-insulator substrate",
            "Semiconductor device of an embedded DRAM on SOI substrate",
            "Method and structure for buried circuits and devices",
            "Power integrated circuit with vertical current flow and related manufacturing process",
            "Method and structure for buried circuits and devices",
            "Method and structure for buried circuits and devices",
            "Method and structure for buried circuits and devices",
            "Cathodes for fluorine gas discharge lasers",
            "Method and structure for buried circuits and devices",
            "Power module package and method of manufacturing the same"
        ]
    ],
    "pageTitle": "Patent US5547886 - Method of producing a semiconductor device - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5547886?ie=ISO-8859-1&dq=6289460",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 7,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00335-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 484539575,
    "recordOffset": 484516856,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{33103=As shown in FIG. 3, a lower bonding material 50 includes a single-crystal Si substrate 1b and an N+ region 11b which is formed by diffusing impurities at high concentration on the bottom surface of the single-crystal Si substrate 1b. The surface impurity concentration and thickness of the substrate 1b are designed in accordance with the breakdown voltage and the like of a power device formed later. For example, when a breakdown voltage of 1000 V is required, a thickness of about 70 μm and a surface impurity concentration of about 1014 cm -3 are selected., 21300=This is a Division of application Ser. No. 07/904,666 filed on Jun. 26, 1992, now abandoned.}",
    "textBeforeTable": "Patent Citations While the invention has been shown and described in detail, the foregoing description is in all aspects illustrative and not restrictive. It is therefore understood that numerous modifications and variations can be devised without departing from the scope of the invention. FIGS. 13 and 14 show a second preferred embodiment according to the present invention. As shown in FIG. 13, impurities of high concentration are diffused on the bottom surface of the single-crystal Si substrate 1b to form the N+ region 11b. This provides a structure similar to the lower bonding material 50 of FIG. 3. SIMOX technique is carried out by implantation with oxygen ions at high energy from the surface opposite to the N+ region 11b, so that the relatively thin single-crystal layer 1a and oxide film 20 are formed on the substrate 1b. The single-crystal layer 1a is made with the thickness of about 2 to 5 μm by annealing after ion implantation. However, since the power device is not formed in this portion, the thickness of the single-crystal layer 1a may be increased by epitaxial growth, if necessary. Thereafter the execution of similar steps of FIGS. 6 to 12 provides for the power IC according to the present invention. According to the second preferred embodiment, the thickness of the single-crystal layer 1a is controlled by an acceleration voltage in oxygen ion implantation. The second preferred embodiment, although it is necessary to adjust",
    "textAfterTable": "US6127701 * Apr 5, 1999 Oct 3, 2000 Delco Electronics Corporation Vertical power device with integrated control circuitry US6162665 * May 23, 1995 Dec 19, 2000 Ixys Corporation High voltage transistors and thyristors US6291858 Jan 3, 2000 Sep 18, 2001 International Business Machines Corporation Multistack 3-dimensional high density semiconductor device and method for fabrication US6350653 Oct 12, 2000 Feb 26, 2002 International Business Machines Corporation Embedded DRAM on silicon-on-insulator substrate US6590259 Nov 2, 2001 Jul 8, 2003 International Business Machines Corporation Semiconductor device of an embedded DRAM on SOI substrate US6759282 Jun 12, 2001 Jul 6, 2004 International Business Machines Corporation Method and structure for buried circuits and devices US6835629 Jan 23, 2003 Dec 28, 2004 Stmicroelectronics S.R.L. Power integrated circuit with vertical current flow and related manufacturing process US7141853 Apr 27, 2004 Nov 28, 2006 International Business Machines Corporation",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}