{
    "relation": [
        [
            "Date",
            "Dec 30, 2002",
            "Jan 10, 2003",
            "Feb 27, 2003",
            "Sep 20, 2010",
            "Aug 27, 2014"
        ],
        [
            "Code",
            "AS",
            "AS",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: SYNDEON AB, SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SOLEM, JAN OTTO;REEL/FRAME:013611/0535 Effective date: 20021129 Owner name: VALVIDA AB, SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KIMBLAD, PER OLA;REEL/FRAME:013611/0579 Effective date: 20021129",
            "Owner name: JOMED N.V., NETHERLANDS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:SYNDEON AB;VALVIDA AB;REEL/FRAME:013651/0768 Effective date: 20021129",
            "Owner name: EDWARDS LIFESCIENCES AG, SWITZERLAND Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:JOMED N.V.;REEL/FRAME:013795/0553 Effective date: 20030214 Owner name: JOMED N.V., NETHERLANDS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SYNDEON A.B.;REEL/FRAME:013795/0537 Effective date: 20021129 Owner name: JOMED N.V., NETHERLANDS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:VALVIDA AB;REEL/FRAME:013795/0511 Effective date: 20021129 Owner name: JOMED N.V., NETHERLANDS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:BERGER, ERWIN;SCHWAGER, MICHAEL;REEL/FRAME:013795/0573 Effective date: 20030214 Owner name: SYNDEON AB, SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:SOLEM, JAN OTTO;REEL/FRAME:013795/0479 Effective date: 20021129 Owner name: VALVIDA AB, SWEDEN Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNOR:KIMBLAD, PER OLA;REEL/FRAME:013795/0524 Effective date: 20021129",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US20010018611 - Method and device for treatment of mitral insufficiency - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US20010018611?dq=7,496,943",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 477665447,
    "recordOffset": 477632397,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{28799=[0001] This application is a continuation-in-part of U.S. patent application Ser. No. 09/345,475 that was filed on Jun. 30, 1999.}",
    "textBeforeTable": "Patent Citations [0071] It is to be understood that modifications of the above-described device and method can be made by people skilled in the art without departing from the spirit and scope of the invention. [0070] Concludingly, the present invention provides a device placed in the coronary sinus 5 and designed to reduce the dilatation of the mitral annulus. This device is at a distance from the attachment of the posterior leaflet that does not much exceed the distance at which present annuloplasty rings are placed by open surgery techniques, and the coronary sinus is along its entire course large enough to hold such a device. The device could be positioned by catheter technique or any other adequate technique and offers a safer alternative to the current open surgery methods. The device could be designed or heparincoated so as to avoid thrombosis in the coronary sinus, thus reducing the need for aspirin, ticlopedine or anticoagulant therapy. [0069] When this device is positioned in the coronary sinus 5, the proximal and distal sections 30, 31 are first expanded, as illustrated in FIG. 19, and then the central stent section 42 is expanded. AS a consequence of its length reduction when expanded, the central stent section 42 will reduce the distance between the proximal and distal stent sections 30, 31 and thus reduce the radius of curvature of the coronary sinus 5,",
    "textAfterTable": "US5876419 * Oct 15, 1997 Mar 2, 1999 Navius Corporation Stent and method for making a stent US5876433 * May 29, 1996 Mar 2, 1999 Ethicon, Inc. Stent and method of varying amounts of heparin coated thereon to control treatment US5919233 * Jun 25, 1997 Jul 6, 1999 Ethicon, Inc. Flexible implant US6006122 * Sep 25, 1997 Dec 21, 1999 Medtronic, Inc. Medical electrical lead US6013854 * Jun 16, 1995 Jan 11, 2000 Terumo Kabushiki Kaisha Indwelling stent and the method for manufacturing the same US6027525 * May 23, 1997 Feb 22, 2000 Samsung Electronics., Ltd. Flexible self-expandable stent and method for making the same US6093203 * May 13, 1998 Jul 25, 2000 Uflacker; Renan Stent or graft support structure for treating bifurcated vessels having different diameter portions and methods of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}