{
    "relation": [
        [
            "Date",
            "Oct 13, 1994",
            "May 19, 1997",
            "Mar 2, 1999",
            "Apr 2, 2001",
            "Mar 4, 2003",
            "Sep 30, 2005",
            "Sep 30, 2009"
        ],
        [
            "Code",
            "AS",
            "AS",
            "CC",
            "FPAY",
            "AS",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Assignment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: WESTGATE MEDICAL PRODUCTS CORP., MASSACHUSETTS Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:HEADLEY, THOMAS D.;POWERS, EDWARD T.;REEL/FRAME:007220/0210 Effective date: 19941013",
            "Owner name: TRANSFUSION TECHNOLOGIES CORPORATION, MASSACHUSETT Free format text: CHANGE OF NAME;ASSIGNOR:WESTGATE MEDICAL PRODUCTS CORPORATION;REEL/FRAME:008514/0252 Effective date: 19950126",
            "",
            "Year of fee payment: 4",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US5733253 - Fluid separation system - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US5733253?dq=7,328,163",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042986444.39/warc/CC-MAIN-20150728002306-00180-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474439143,
    "recordOffset": 474383634,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97778=Thus, in a preferred embodiment the rotor is emptied in the following manner, with reference to FIG. 4. Initially, the rotor 2a is spinning at full processing speed--say for instance 5000 rpm. The gas in the chuck 4a is positively pressurized, thereby causing fluid to flow out of the rotor's chamber 30 until an equilibrium is reached between the gas pressure in the chuck and the centrifugal force acting on the fluid in the channel 44 above the plate 40 between the outer edge of the collector assembly 46 and the inner vertical face of the diaphragm (lines 31a, 31b, 31c and 31d. The gas may continue to be pressurized until it reaches 2 psi--or whatever pressure limit is chosen. Then, the rotational speed of the rotor 2a is reduced. The rotational speed may be reduced without affecting the separation of the fluids in the rotor if the speed is reduced smoothly and slowly, and as long as the rotational speed does not fall below the minimum speed necessary to maintain separation, which may for example be as low as 500-1500 rpm. Reducing the speed lowers the centrifugal force on the fluid in the channel 44. Thus, additional fluid is forced out of the rotor until a new equilibrium is reached. By continuing to reduce the rotor's rotational speed, additional fluid is forced out of the rotor even though the gas pressure in the chuck 4a is kept constant.}",
    "textBeforeTable": "Patent Citations Although the invention has been described with reference to several preferred embodiments, it will be understood by one of ordinary skill in the art that various modifications can be made without departing from the spirit and the scope of the invention, as set forth in the claims hereinbelow. Different types of outlet-control means may be used. For example, FIGS. 41 and 42 show top and cross sectional views of a preferred embodiment of the rotor. This rotor uses grooves 244--preferably radially aligned--formed on the bottom of the top wall 10 as the outlet control means, instead of tubes or an interior perforate wall. The grooves 244 are defined by vertical channel walls 240; if the vertical channel walls 240 are placed close enough to each other, they can keep channels--the grooves 244--open from the holes 239, which connect the processing chamber and the collector assembly 46, to the periphery of the rotor, or to whatever radius it is desired to maintain a channel. The FIG. 42 rotor has a fixed portion (which includes the collector assembly 46 and which interfaces the rotating portion of the rotor at a rotary seal 48), and thus a small-diameter internal wall 237 is necessary to keep the spinning diaphragm 31 from coming into contact with the fixed portion and possibly being abraded. It will be appreciated that the rotors of the present invention can have shapes other than those described",
    "textAfterTable": "US4047526 * May 22, 1975 Sep 13, 1977 Sorenson Research Co., Inc. Autologous blood system and method US4056224 * Feb 11, 1976 Nov 1, 1977 Baxter Travenol Laboratories, Inc. Flow system for centrifugal liquid processing apparatus US4086924 * Oct 6, 1976 May 2, 1978 Haemonetics Corporation Plasmapheresis apparatus US4094461 * Jun 27, 1977 Jun 13, 1978 International Business Machines Corporation Centrifuge collecting chamber US4114802 * Aug 29, 1977 Sep 19, 1978 Baxter Travenol Laboratories, Inc. Centrifugal apparatus with biaxial connector US4151844 * Nov 11, 1977 May 1, 1979 Baxter Travenol Laboratories, Inc. Method and apparatus for separating whole blood into its components and for automatically collecting one component US4163519 * Nov 1, 1977 Aug 7, 1979 Union Carbide Corporation Compensating rotor US4221322 *",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}