{
    "relation": [
        [
            "Date",
            "Jul 1, 1986",
            "Mar 22, 1991",
            "May 2, 1995",
            "Jul 27, 1995",
            "Jul 27, 1995",
            "Dec 15, 1998"
        ],
        [
            "Code",
            "AS",
            "FPAY",
            "REMI",
            "SULP",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Fee payment",
            "Maintenance fee reminder mailed",
            "Surcharge for late payment",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: BELL OF PENNSYLVANIA, 901 FAYETTE STREET, CONSHOHO Free format text: ASSIGNMENT OF ASSIGNORS INTEREST.;ASSIGNOR:MCDERMOTT, MICHAEL G.;REEL/FRAME:004575/0498 Effective date: 19860701",
            "Year of fee payment: 4",
            "",
            "",
            "Year of fee payment: 8",
            "Year of fee payment: 12"
        ]
    ],
    "pageTitle": "Patent US4695926 - Encapsulation and insulation of electronic circuit board structures - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US4695926?dq=7069184",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 8,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988922.24/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 486527167,
    "recordOffset": 486505334,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Patent Citations The preceding specification describes a preferred embodiment of the invention as an illustration and not a limitation thereof. It is appreciated that equivalent variations will occur to those skilled in the art, such as the encapsulation of a plurality of unmounted, interconnected, circuit components. Such modifications, variations and equivalents are within the scope of the invention as recited with greater particularity in the appended claims when interpreted to obtain the benefits of all equivalents to which the invention is legally and equitably entitled. There has thus been shown a method for encapsulating a circuit board and the various electronic components mounted thereon, as well as circuit boards formed in accordance with the invention and electronic devices incorporating the same. In accordance with the invention, these boards are formed by mounting the electronic components thereon and thereafter enclosing the combined structure by a single heat-shrink tubing to encapsulate the board and the components, together. Further, although two specific circuits have been shown encapsulated with the circuit board therefor, it should be clear that any circuit structure, of any complexity, may be mounted on and encapsulated with the circuit board. Thus, an entire system may be encapsulated by a single heat-shribnk layer and in a single heat-shrink operation, together with the supporting board therefor. Such a system may be used in a computer environment, as a board to be mounted on a motherboard, for example, as shown in",
    "textAfterTable": "Mar 20, 1990 Ritter Charles H Method of repairing a tooth and apparatus therefor US5095626 * Aug 10, 1989 Mar 17, 1992 Hitachi, Ltd. Method of producing semiconductor memory packages US5223851 * Nov 5, 1991 Jun 29, 1993 Trovan Limited Apparatus for facilitating interconnection of antenna lead wires to an integrated circuit and encapsulating the assembly to form an improved miniature transponder device US5274914 * Jul 20, 1992 Jan 4, 1994 Hitachi, Ltd. Method of producing surface package type semiconductor package US5295297 * Jul 20, 1992 Mar 22, 1994 Hitachi, Ltd. Method of producing semiconductor memory US5331513 * Jul 6, 1992 Jul 19, 1994 Rohm Co., Ltd. Method of mounting electronic part on circuit substrate and circuit substrate including electronic parts mounted thereon US5607059 * Jun 23, 1994 Mar 4, 1997 Hitachi, Ltd. Surface package type semiconductor package and method of producing",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}