{
    "relation": [
        [
            "START",
            "1:00 PM",
            "1:30 PM",
            "2:00 PM",
            "2:45 PM"
        ],
        [
            "END",
            "2:30 PM",
            "3:30 PM",
            "4:00 PM",
            "4:30 PM"
        ],
        [
            "EVENT DESCRIPTION",
            "Kids Culinary Creations Do you dig chocolate, cookies, raisins and cereal? Have you ever made lasagna with them? Here\u0092s your chance to get cooking with chocolate and other goodies at Kids Culinary Creations on Monday, June 24, at the Central Point Branch Library, 116 South Third Street. Sign up for one Read more...",
            "Ashland Teen Summer Reading Activities Begin Soon Ashland Teen Library's Summer Reading Program kicks off on June 10 with lots of great activities. Join in the fun at the Ashland Branch Library, 410 Siskiyou Boulevard. Here\u0092s just a sampling of the fun to come: Monday, June 10, 1:30 \u0096 3:30 p.m.: CD Scratch Art. Decorate with co Read more...",
            "Medford Teen Summer Reading Activities Medford Teen Library's Summer Reading Program kicks off on June 10 with lots of great activities. Join in the fun at the Medford Branch Library, 205 South Central Avenue. Monday, June 10, 2 \u0096 4 p.m.: Movie. A wrongfully convicted boy is sent to a brutal desert detention camp whe Read more...",
            "Monday Movies The Monday Movies series continues on Mondays from 2:45 \u0096 4:30 p.m. at the Phoenix Branch Library, 510 West 1st Street. All ages are welcome. June 3: Seven young friends find themselves on a thrilling underground adventure filled with humor and heart-pounding peril as they Read more..."
        ],
        [
            "LOCATION",
            "Central Point Branch Library",
            "Ashland Branch Library",
            "Medford Branch Teen Library",
            "Phoenix Branch Library"
        ]
    ],
    "pageTitle": "Jackson County Oregon - Calendar",
    "title": "",
    "url": "http://www.co.jackson.or.us/Calendar.asp?View=WEEK&date=6-23-2013&SectionID=15",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00303-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 371357583,
    "recordOffset": 371341648,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Sunday, June 23, 2013 Week of June 23, 2013 - June 29, 2013 LIBRARY CALENDAR ONLY View All SET A REMINDER    REQUEST A MAP    ICON KEYS: Advanced Search",
    "textAfterTable": "1:00 PM 2:30 PM Kids Culinary Creations Do you dig chocolate, cookies, raisins and cereal? Have you ever made lasagna with them? Here\u0092s your chance to get cooking with chocolate and other goodies at Kids Culinary Creations on Monday, June 24, at the Central Point Branch Library, 116 South Third Street.   Sign up for one Read more... Central Point Branch Library 1:30 PM 3:30 PM Ashland Teen Summer Reading Activities Begin Soon Ashland Teen Library's Summer Reading Program kicks off on June 10 with lots of great activities. Join in the fun at the Ashland Branch Library, 410 Siskiyou Boulevard. Here\u0092s just a sampling of the fun to come:   Monday, June 10, 1:30 \u0096 3:30 p.m.: CD Scratch Art. Decorate with co Read more... Ashland Branch Library 2:00 PM 4:00 PM Medford Teen Summer Reading Activities Medford Teen Library's Summer Reading Program kicks off on June 10 with",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}