{
    "relation": [
        [
            "Size",
            "Mini",
            "XX Small",
            "X Small",
            "Small",
            "Medium",
            "Large",
            "X Large (M65 Option Only)"
        ],
        [
            "Chest",
            "40\" (101.5cm)",
            "44\" (112cm)",
            "46\" (117cm)",
            "50\" (127cm)",
            "56\" (142cm)",
            "58\" (147cm)",
            "60\" (152.5cm)"
        ],
        [
            "Length, Collar to end of fishtail",
            "36\" (91.5cm)",
            "38\" (96.5cm)",
            "40\" (101.5cm)",
            "40\" (101.5cm)",
            "42\" (106.5cm)",
            "42\" (106.5cm)",
            "43\" (109cm)"
        ],
        [
            "Arm, Shoulder seam to end of cuff",
            "23\" (58.4cm)",
            "23\" (58.4cm)",
            "M51: 24\" (61cm) | M65: 25\" (63.5cm)",
            "M51: 24\" (61cm) | M65: 25\" (63.5cm)",
            "M51: 25\" (63.5cm) | M65: 26\" (66cm)",
            "M51: 25\" (63.5cm) | M65: 27\" (68.5cm)",
            "27\" (68.5cm)"
        ]
    ],
    "pageTitle": "Fishtail Parkas: Quadrophenia Parka, Who Parka, Fishtail Parka",
    "title": "",
    "url": "http://www.fishtailparkas.com/Quadrophenia_Parka.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00300-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 441936288,
    "recordOffset": 441920330,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{46373=I have practically not left the house without it since I received it in December. It is both smart and practical (the weather in Denmark have been very snowy and cold) and I really enjoy the hood with fur (my first parka came without fur and hood liner). Definetely my best x-mas present in years.\", 45399=\"Thrilled, Spectacular, Awesome\" \"Thank you for all your help with finding me an original M-1951 Parka. The package arrived today much sooner than expected (only took three days to cross the pond). When I opened the box, I was thrilled. As describe, the parka and liner were in near un issued condition. In fact, they were spectacular! The Wolf fur on the detachable hood is awesome and really adds character to the parka. Please tell your refurbished they did one heck of a job. Finally, the advice you gave me regarding sizing was spot on and the parka fits exactly as desired.\", 20630=*** The Who acquired our Classic M-1951 fishtail parka complete with 'The Who' Q signage on the back and relevant patches for their US & UK Quadrophenia 2012 / 2013 tour. ***, 20276=We have two Quadrophenia parka options to choose from: 1. Authentic M-1965 which comes complete with a real fur hood, or 2. Our Classic M-1951 fishtail parka which has a fixed hood that forms part of the outer shell. This is the correct style parka as used by The Who and worn throughout their cult film Quadrophenia., 41828=Fishtailparkas.com Established 2004. Copyright 2015 All Rights Reserved & Owned By FishtailParkas.com Of England.}",
    "lastModified": "Sat, 11 Jul 2015 14:02:41 GMT",
    "textBeforeTable": "We advise to leave 6 to 8 inches spare underneath a parka for wearing jumpers, suits etc. Plus it helps achieve the correct look as these parka's are not meant to worn fitted. Therefore, a person with a 42 inch chest measurement would require size small. SIZING GUIDE Worldwide Tracked & Insured Delivery £30 Black Olive Green Choose Colour XX Small M51 Quad Parka £145.00 GBP X Small M51 Quad Parka £145.00 GBP Small M51 Quad Parka £145.00 GBP Medium M51 Quad Parka £145.00 GBP Large M51 Quad Parka £145.00 GBP Choose Size European Union Tracked & Insured Delivery £20",
    "textAfterTable": "* If an item with is purchased, it is understood that the buyer agrees to our Returns Policy. Please read accordingly prior to making a purchase. Thank you. Fishtailparkas.com Established 2004. Copyright 2015 All Rights Reserved & Owned By FishtailParkas.com Of England. \"Magnificent Parka\" \"I received today this magnificent parka, the size is good and I am very impressed it is really in very good state .I still thank you for your great follow-up.Your Web site is great I learnt more has knowing the MODS and their stories.\" Merci encore et bonne continuation a vous Fabien Granados, France \"Absolutely Fantastic\" Just got the parka. It’s absolutely fantastic, the wolf trim",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}