{
    "relation": [
        [
            "Babysitters",
            "Caretakers",
            "Cleaning people"
        ],
        [
            "Drivers",
            "Health aides",
            "Housekeepers"
        ],
        [
            "Nannies",
            "Private nurses",
            "Yard workers"
        ]
    ],
    "pageTitle": "Instructions for Schedule H (Form 1040), Household Employment Taxes - 2011 Instructions for Schedule H (Form 1040) Household Employment Taxes",
    "title": "",
    "url": "http://taxmap.ntis.gov/taxmap/archive2011/taxmap/instr/i1040sh-000.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00230-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 235140416,
    "recordOffset": 235132214,
    "tableOrientation": "VERTICAL",
    "lastModified": "Tue, 08 Jan 2013 15:33:59 GMT",
    "textBeforeTable": "Household work is work done in or around your home. Some examples of workers who do household work are: You paid Betty Oak to babysit your child and do light housework 4 days a week in your home. Betty followed your specific instructions about household and child care duties. You provided the household equipment and supplies Betty needed to do her work. Betty is your household employee. Example.(p2) If you hired someone to do household work and you were able to control what work he or she did and how he or she did it, you had a household employee. This is true even if you gave the employee freedom of action. What matters is that you had the right to control the details of how the work was done. Did you have a household employee?(p2) taxmap/instr/i1040sh-000.htm#TXMP21288bb4Yes to any of the questions on lines A, B, or C of Schedule H. You must file Schedule H if you answer Who Needs To File Schedule H?(p2)",
    "textAfterTable": "If a worker is your employee, it does not matter whether the work is full or part-time or that you hired the worker through an agency or from a list provided by an agency or association. Also, it does not matter if the wages paid are for work done hourly, daily, weekly, or by the job. If you are a home care service recipient receiving home care services through a program administered by a federal, State, or local government agency, you can designate an agent under section 3504 to report, file, and pay all federal employment taxes, including FUTA taxes, on your behalf. Note.(p2) If a government agency or third party agent reports and pays the employment taxes on wages paid to your household employee under its employer identification number (EIN), you do not need to file Schedule H to report those taxes. taxmap/instr/i1040sh-000.htm#TXMP39554ccb Workers who are not your employees.(p2) Workers you get from an agency are not your employees if the agency is responsible for who does the work and how it is done. Self-employed workers are also not your employees. A worker is self-employed if only he or she can",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}