{
    "relation": [
        [
            "Count",
            "1",
            "1",
            "1"
        ],
        [
            "Component",
            "",
            "",
            ""
        ],
        [
            "DateTime",
            "2011-10-06T00:00:00",
            "2012-04-01T00:00:00",
            "2013-01-22T00:00:00"
        ],
        [
            "Description",
            "Data were processed to an initial LAS format using the Riegl RiProcess software. The Applanix POSPac software was utilized for GPS and inertial processing, and Terrasolid software for data visualization, 3D editing, and export to final LAS file. Data were processed in NAD83 horizontal and vertical datum.",
            "The NOAA Coastal Services Center (CSC) received the files in las format. The files contained LiDAR elevation as well as intensity and encoded RGB image values. The data were in UTM, Zone 18 coordinates. CSC performed the following processing for data storage and Digital Coast provisioning purposes: 1. The data were converted from UTM Zone 18 coordinates to geographic coordinates. 2. The data were filtered for outliers. 3. The data were converted to LAZ format.",
            "The NOAA National Geophysical Data Center (NGDC) received lidar data files via ftp transfer from the NOAA Coastal Services Center. The data are currently being served via NOAA CSC Digital Coast at http://www.csc.noaa.gov/digitalcoast/. The data can be used to re-populate the system. The data are archived in LAS or LAZ format. The LAS format is an industry standard for LiDAR data developed by the American Society of Photogrammetry and Remote Sensing (ASPRS); LAZ is a loseless compressed version of LAS developed by Martin Isenburg (http://www.laszip.org/). The data are exclusively in geographic coordinates (either NAD83 or ITRF94). The data are referenced vertically to the ellipsoid (either GRS80 or ITRF94), allowing for the ability to apply the most up to date geoid model when transforming to orthometric heights."
        ]
    ],
    "pageTitle": "Docucomp ISO19115Components-HTMLTable",
    "title": "",
    "url": "http://www.ngdc.noaa.gov/docucomp/page?xml=NOAA/NESDIS/NGDC/MGG/Lidar/iso/xml/2011_NGS_NYNJ_m1170.xml&view=ISO19115Components-HTMLTable&altview=none",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00262-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 617918475,
    "recordOffset": 617910710,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "MD_DataIdentification Aggregation Info | Bands | Citations | Constraints | Coverage Descriptions | Dimensions | Extents | Formats | Geographic Bounding Box Georectified Information | Georeferenceable Information | Identifiers | Instruments | Mediums | OnlineResources | Operations Platforms | Process Steps | Range Elements | Reference Systems | Responsible Parties | Series | Sources | Spatial Grids | Temporal Extents Metadata Identifier: gov.noaa.csc.maps:2011_NGS_NYNJ_m1170Get DataFAQHTML, 19139 XML Assess Metadata For: Completeness, DOI Readiness, CSW Readiness, Components ISO Table ViewBack to Collection NOAA/NESDIS/NGDC/MGG/Lidar View Metadata As: , , } background-color:#F0F0F0; th{ } empty-cells:show; table{",
    "textAfterTable": "Component Title Date Citation Identifier 1 2011 NOAA National Geodetic Survey (NGS) Lidar: Fire Island, NY and Cape May to Absecon Inlet, NJ 2012-04-01 3 None 1 North American Datum 1983 2007-01-19 Top CI_Series none found Top CI_ResponsibleParty Count Component Individual Organization Position Email Role Linkage 1 resourceProvider http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::4269 1 NGS (originator) DOC/NOAA/NOS/NGS/RSD > Remote Sensing Division, National Geodetic Survey, National Ocean Service, National Oceanic and Atmospheric Administration, U.S. Department of Commerce Chief, Remote Sensing Division originator 1 NGS (pointOfContact) DOC/NOAA/NOS/NGS/RSD > Remote Sensing Division, National Geodetic Survey,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}