{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "I believe the campus is safe but there is room for improvement.",
            "There are plenty clubs and activities on campus.",
            "I believe this campus is good for all students there is something for everyone to do.",
            "I go to the student lounge and play pool. I also enjoy movie night in the lounge for it really is fun.",
            "I enjoy the food but the price is pretty high. There are times when the food doesn't add up to the price.",
            "I have never been in the dorm .",
            "I believe the academic at Purdue is very high and if a person puts forth the effort they will receive their just reward.",
            "There are a lot of things on campus to do but, there are a lot of things that are available to divert your attention. You must keep your focus on the reason you are there.",
            "The campus needs to change the parking for there a several times when you are unavailable to find parking."
        ]
    ],
    "pageTitle": "Purdue University-Calumet Campus Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Purdue-University-Calumet-Campus/reviews?_escaped_fragment_=/show/25280",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00080-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898377255,
    "recordOffset": 898313458,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{23802=I agree with the other person that it's ridiculous for students to be charged for parking whether we even drive or not. And I was going to sign up for summer courses, but they got canceled because I couldn't pull $1300 out of thin air for just two classes. While I understand that it's cheaper than most schools, it's still too much for me at times. And I hear tuition will be raised to pay for the $115,000 the school recently spent renovating the campus bookstore., 333652=© 2015, Cappex.com, LLC}",
    "textBeforeTable": "12/31/2009 Reviewer is A current student here. 8 out of 9 people found this review useful. 1 of 88 Allicia from Chicago, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Tips for prospective students Make sure you join at least some extracurricular activity while at Purdue Calumet University, like Student Government or the school paper, for this looks really good on your resume when applying for jobs, especially on campus. PUC now has a co - curricular transcript, so this is an extra incentive to join student organizations at PUC. Login to rate or flag the reviews Taylor from Gary, IN 07/18/2009 Reviewer is A current student here. 3 out of 3 people found this review useful. 3 of 88 Categories Comments Great for these types of students Purdue is great for International students and people who want to stay in a small town, but still get a university experience. Tips for prospective students Try to get involved with the on campus activities. They're really nice and you get to meet the other students, and sometimes faculty. I would also suggest joining a club or organization. Bang for the buck",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}