{
    "relation": [
        [
            "Metric",
            "Database Name (key column)",
            "Average Data Write Rate",
            "Average Index Write Rate",
            "Average Page Read Rate",
            "Average Page Write Rate",
            "Database Buffer Pool Hit Ratio (%)",
            "Logical Data Read Rate",
            "Logical Index Read Rate",
            "Physical Index Read Rate",
            "Physical Index Read Rate",
            "Pool Logical Data Reads",
            "Pool Logical Index Reads",
            "Pool Physical Data Reads",
            "Pool Physical Index Reads",
            "Pool Asynchronous Data Reads",
            "Pool Asynchronous Data Writes",
            "Pool Asynchronous Index Reads",
            "Pool Asynchronous Index Writes",
            "Pool Asynchronous Read Time",
            "Pool Asynchronous Write Time (ms)",
            "Pool Data Writes",
            "Pool Index Writes",
            "Pool Logical Data Reads",
            "Pool Logical Index Reads",
            "Pool Physical Index Reads",
            "Pool Physical Data Reads",
            "Pool Read Time (ms)",
            "Pool Write Time (ms)",
            "Synchronous Data Read Rate",
            "Synchronous Data Write Rate",
            "Synchronous Index Read Rate",
            "Synchronous Index Write Rate"
        ],
        [
            "Description and User Action",
            "Real name of the database for which information is collected or to which the application is connected. This is the name the database was given when created.",
            "Pool data write rate, which equals: (pool_data_writes/pool_write_time)",
            "Pool index write rate, which equals: (pool_index_writes/pool_write_time)",
            "The rate equals: (pool_data_p_reads + pool_index_p_reads )/pool_read_time",
            "The rate equals: (pool_data_writes + pool_index_writes)/pool_write_time",
            "The ratio equals: (1-((pool_data_p_reads + pool_index_p_reads)/ (pool_index_l_reads + pool_index_l_reads )))*100 The desired value can be set for the warning and critical thresholds to monitor any adverse conditions.",
            "The rate equals: (pool_data_l_reads /pool_read_time)",
            "The rate equals: (pool_index_l_reads /pool_read_time)",
            "The rate equals: (pool_index_p_reads/pool_read_time)",
            "The rate equals: pool_data_p_reads/pool_read_time",
            "This count includes accesses to data that is already in the buffer pool when the database manager needs to process the page and read into the buffer pool before the database manager can process the page.",
            "Number of logical read requests to get index pages into the buffer pool.",
            "Number of read requests that required I/O to get data pages into the buffer pool.",
            "Number of physical read requests to get index pages into the buffer pool.",
            "Number of data pages read asynchronously to the buffer pool by prefetchers.",
            "Number of times a buffer pool data page was physically written to disk by either an asynchronous page cleaner or a prefetcher.",
            "Number of index pages read asynchronously to the buffer poll by prefetchers.",
            "Number of times a buffer pool index page was physically written to disk by either an asynchronous page cleaner or a prefetcher.",
            "Number of times a buffer pool data page was physically read from disk by an asynchronous page prefetcher.",
            "Number of times a buffer pool index page was physically written to disk by either an asynchronous page cleaner or prefetcher.",
            "Number of times the buffer pool data page was physically written to the disk.",
            "Number of times the buffer pool index page was physically written to the disk.",
            "This count includes accesses to data that is already in the buffer pool when the database manager needs to process the page and read into the buffer pool before the database manager can process the page.",
            "Indicates the number of logical read requests to get index pages into the buffer pool.",
            "Indicates the number of physical read requests to get index pages into the buffer pool.",
            "Number of read requests that required I/O to get data pages into the buffer pool.",
            "Provides the total amount of elapsed time spent processing read requests that caused data or index pages to be physically read from disk to buffer pool.",
            "Total amount of time spent physically writing data or index pages from the buffer pool to disk.",
            "Total synchronous read rate, which equals: ((pool_read_time-pool_async_read_time == 0) ? 0 :((pool_data_p_ reads-pool_async_data_reads )/(pool_read_time-pool_async_read_ time)))",
            "Pool data synchronous write rate, which equals: ((pool_data_writes - pool_async_data_writes )/(pool_write_time-pool_async_write_time))",
            "Index synchronous read rate, which equals: (pool_data_p_reads-pool_async_index_reads )/(pool_read_time-pool_async_read_time)",
            "Index synchronous write rate, which equals: ((pool_index_writes - pool_async_index_writes )/(pool_write_time-pool_async_write_time))"
        ]
    ],
    "pageTitle": "IBM DB2 Database Metrics",
    "title": "",
    "url": "http://docs.oracle.com/cd/B16240_01/doc/em.102/b28748/database_db2.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 77812215,
    "recordOffset": 77786342,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{171575=Build level, as returned by the db2level command; for example, n041021., 171289=Service level, as returned by the db2level command; for example, DB2 v8.1.1.80.}",
    "lastModified": "Thu, 15 Mar 2012 06:34:55 GMT",
    "textBeforeTable": "Table 2-22 Bufferpool Database Performance Metrics Default Collection Interval — Every 15 minutes The metrics in this category provide performance metrics for all the bufferpools in the database. Bufferpool Database Performance Metrics Number of times a page cleaner was invoked because a buffer pool had reached the dirty page threshold criterion for the database. Cleans for Threshold Number of times a page cleaner was invoked because a synchronous write was needed during the victim buffer replacement for the database. Cleans for Steals Real name of the database for which information is collected or to which the application is connected. This is the name the database was given when created. Database Name (key column) Description and User Action Metric Table 2-21 Agent Performance Metrics Default Collection Interval — Every 15 minutes",
    "textAfterTable": "Bufferpool Performance Metrics The metrics in this category provide performance metrics for the individual bufferpools in the database. Default Collection Interval — Every 15 minutes Table 2-23 Bufferpool Performance Metrics Metric Description and User Action Buffer Pool Name (key column) Name of the bufferpool. Database Buffer Pool Hit Ratio (%) Buffer pool hit ratio, which equals: (1-((pool_data_p_reads + pool_index_p_reads)/ (pool_index_l_reads + pool_index_l_reads )))*100) The desired value can be set for the warning and critical thresholds to monitor any adverse conditions. Database Name Real name of the database for which information is collected or to which the application is connected. This is the name the database was given when created. Database Alias Alias for the database. Database Path",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}