{
    "relation": [
        [
            "Ryan Murphy and Brad Falchuk",
            "Noah Hawley",
            "Neil Cross",
            "Steven Moffat",
            "Larry Kramer",
            "David Simon and Eric Overmyer"
        ],
        [
            "American Horror Story: Coven",
            "Fargo",
            "Luther",
            "Sherlock (His Last Vow)",
            "The Normal Heart",
            "Treme"
        ],
        [
            "FX",
            "FX",
            "BBC America",
            "PBS",
            "HBO",
            "HBO"
        ]
    ],
    "pageTitle": "2014 Primetime Emmy Award Nominations and Analysis - Metacritic",
    "title": "",
    "url": "http://www.metacritic.com/feature/2014-primetime-emmy-nominees",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 586148187,
    "recordOffset": 586113944,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{93408=For the complete list of 2014 Emmy nominees, including the numerous technical, directing, and writing categories not listed above, visit the official Emmy website., 91464=Last year, The Voice ended The Amazing Race's ownership of this category, though the latter has still won 9 of the 11 awards ever given out for reality competition shows. The six nominees are identical to the 2013 list., 45489=Only Bialik, Bowen, and Chlumsky are repeats from this category last year, and the 2013 winner, Nurse Jackie's Merritt Wever, is absent. Mulgrew and McKinnon are first-time nominees, though the latter was also nominated this year for co-writing a song that appeared in SNL., 93655=This year's Emmy Awards will be handed out several weeks earlier than normal, and on a Monday rather than the traditional Sunday. The August 25th ceremony will be hosted by Seth Meyers and will air live coast to coast on NBC. In the week leading up to the broadcast, we'll have a guide to expert predictions in each major category. But before that, you'll have an opportunity to make your own predictions in our annual Emmy poll; look for that beginning next week., 4416=As always, HBO received more nominations than any other network, though its 2014 total of 99 was down a bit from last year's 108. Following behind the pay cable giant was FX, with 45 (up from 26 last year). Netflix, meanwhile, collected an impressive 31 nominations this year, up from 14 the previous year. The streaming service managed to score more nominations than more established competitors like AMC (26 nominations) and Showtime (24)., 47220=Louis C.K.'s hosting gig on SNL brought his 2014 nomination total to four (and his career total to an impressive 29), while Fallon was nominated for hosting both SNL and his own Tonight Show. Cole is a first-time nominee., 21033=Last year's winner here was Boardwalk Empire's Bobby Cannavale, so the field is wide open, though Breaking Bad's Paul (who won in 2010 and 2012) and The Good Wife's Charles are the sentimental favorites in their last opportunities to win for their respective shows. But Dinklage has also won recently in this category (in 2011)., 40404=Cheadle, C.K., LeBlanc, and Parsons are all repeats from last year, while Gervais earned his first nomination since Extras, and Macy picked up his first since a 2007 miniseries. Golden Globe winner Andy Samberg (Brooklyn Nine-Nine) is nowhere to be found, however., 143204=© 2015 CBS Interactive Inc. All rights reserved. | Privacy Policy | Terms of Use}",
    "textBeforeTable": "Outstanding Drama Series Last year's winners in each category are marked with an asterisk (if re-nominated this season). Drama nominees Listed below are this year's Emmy nominees in each major category. CBS led all broadcast networks with 47 nominations (down from last year's 53), while NBC, which tied CBS for the broadcast lead last year, finished second this year with 46. As always, HBO received more nominations than any other network, though its 2014 total of 99 was down a bit from last year's 108. Following behind the pay cable giant was FX, with 45 (up from 26 last year). Netflix, meanwhile, collected an impressive 31 nominations this year, up from 14 the previous year. The streaming service managed to score more nominations than more established competitors like AMC (26 nominations) and Showtime (24). That ended American Horror Story's two-year run as the most-nominated program, though that FX series still added 17 nominations this year, just behind fellow FX program Fargo's 18. The final eight episodes of Breaking Bad added 16 nominations, while HBO movie The Normal Heart was also nominated 16 times. Netflix newcomer Orange Is the New Black also scored big, with 12 total nominations (for its first season, which streamed last year), Early Thursday morning, the Academy of Television Arts and Sciences announced its nominations for the 66th Primetime Emmy Awards, and HBO's hit Game of Thrones led all shows with 19 nominations for its just-concluded fourth season.",
    "textAfterTable": "Mad Men AMC True Detective HBO One of the many quirky things about the Emmys: it is up to the networks to determine where their shows are submitted. For example, after failing to gain much traction at the Golden Globes in the drama category, Netflix opted to submit Orange Is the New Black to Emmy voters as a comedy. (Netflix also didn't want one of its own shows stealing potential votes away from House of Cards.) HBO felt that True Detective would have a better chance as a drama series rather than a miniseries—even though it was a short, self-contained story—while FX went in the opposite direction with the longer Fargo, entering it as a miniseries. Those decisions explain why neither Fargo nor OITNB made the cut for best drama. It doesn't explain why The Good Wife once again missed the cut, however; that acclaimed CBS series was favored to receive a nomination this year.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}