{
    "relation": [
        [
            "Identifier",
            "CSCts59247",
            "CSCts59250",
            "CSCts59251",
            "CSCty49659",
            "CSCtz50685",
            "CSCtz59867",
            "CSCua23846",
            "CSCua08301"
        ],
        [
            "Component",
            "softphone",
            "deskphone",
            "deskphone",
            "softphone",
            "contact-mgmt",
            "softphone",
            "softphone",
            "softphone"
        ],
        [
            "Severity",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "3",
            "4"
        ],
        [
            "Headline",
            "Forwarding calls to Voicemail or Mobile does not work and ICW is displayed.",
            "Desk Phone mode: FAC code entered from Jabber (from phone view) is not processed by the client, thus the call is not set up.",
            "Desk Phone mode: CMC code entered from Jabber (from phone view) is not processed by the client, thus the call is not set up.",
            "On the first attempt, when I click answer, call never connects.",
            "Federated contact display name and info is gone after quit and log in.",
            "When in mtg, user answers call, both ICW and phoneview displayed.",
            "Place a call from Jabber breaks wireless network connection completely.",
            "History: Park number is stored along with extension after callretrieved."
        ]
    ],
    "pageTitle": "Release Notes for Cisco Jabber for Mac Release 8.6.5 - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/voice_ip_comm/cupc/8_6/b_jabber_RN_mac.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00246-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 351779439,
    "recordOffset": 351724748,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{405053=CSCts72751, 446606=http://www.cisco.com/en/US/products/ps11764/}",
    "textBeforeTable": "The following table lists the ports used by Cisco Jabber. These ports must be open on all firewalls for Cisco Jabber to function properly. Network ports used by Cisco Jabber Network Requirements 300 MB free disk space OS X Lion, version 10.7.3 (or later) or OS X Snow Leopard, version 10.6.8 (or later) 1 GB of RAM Mac Mini iMac MacBook Air MacBook MacBook Pro Mac Pro Intel Core 2 Duo or later processors in any of the following Apple hardware: The minimum system requirements for running Cisco Jabber for Mac are listed below. System Requirements This release also includes numerous bug fixes. Consult the Limitations and Restrictions and Caveats sections of the Release Notes for details. Enhancements to support",
    "textAfterTable": "Note    Cisco Jabber for Mac does not support port 3269 (Active Directory Global Catalog over LDAPS). 993 IMAP (SSL) Connects to Cisco Unity or Cisco Unity Connection to retrieve and manage the list of voice messages for the user, and the voice messages themselves. 1080 FTP File transfer between peers or when using a server proxy in on-premises deployment. Note    if port 1080 is in use, try ports 1081 through 1089. 2748 TCP Connects to the CTI gateway, which is the CTIManager component of Cisco Unified Communications Manager. 5060 UDP / TCP Provides Session Initiation Protocol (SIP) call signaling. 5061 TCP Provides secure SIP call signaling. 5222 TCP (XMPP) Connects to the Cisco Unified Presence server for availability status and instant messaging features. 7993 IMAP (TLS) Connects to Cisco Unity Connection to retrieve and manage the list of secure voice messages for the user, and the secure voice messages themselves. 8191",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}