{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Always see cops around and there is a police training building here so there are always future cops around as well",
            "None really",
            "There are clubs but you don't hear about them unless you go out of your way to find them.",
            "Quiet people, people who are trying to save a lot of money, people who have a high tolerance.",
            "They had a corn on the cob cook out during the spring semester where they gave out a free ear of corn that was dumped in melted butter. They also gave you a free drink with it. Sounds weird but it was delicious.",
            "Its worth suffering through. Each credit hour is so cheap and your saving thousands of dollars every semester compared to a university.",
            "They always have random events going on and when its nice out people sit out on the grass all over campus. Also there are sporting events and clubs.",
            "Very good food for a junior college and there are comfy couches everywhere.",
            "Junior college so no dorms",
            "Just think about how much money you are saving each year and you can still get a associates degree there which can do very well for your future.",
            "To be honest it sucks. Most people are antisocial or just to quiet and to lazy to talk to people. Just about everyone except me smokes cigarettes. Most teachers are very well educated and know what they are talking about but every semester you always get one teacher who doesn't really care about you and your goals or you get a psycho who will take points off for not stapling a paper. I'm reading to move on to another school. Last the counslers suck."
        ]
    ],
    "pageTitle": "Triton College Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Triton-College/reviews?_escaped_fragment_=/show/94583",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00249-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 881313391,
    "recordOffset": 881276874,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{105143=Triton college was nothing but great to me. I got one-on-one help from teachers and campus Tutors located in the library. They also help me apply to my dream school which is University of South Florida that I will be attending in the Fall of 2013., 6815=Triton was my first college, I am now enrolled in Ambria college which is a nursing school and I intend to graduate by the summer 2013. I enjoy it very much the staff and faculty help their students out as much as they can., 157196=© 2015, Cappex.com, LLC, 31854=Triton students can take a class to perform every March in the Triton Troupers Circus. A lot of students hang out together in the cafeteria. In the spring time, the college hosts hotdog lunches and ice cream socials.}",
    "textBeforeTable": "01/05/2010 Reviewer is Accepted here and planning to attend soon. Reviewer has not been to campus. 1 out of 3 people found this review useful. 1 of 40 Anonymous Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\");",
    "textAfterTable": "Categories Comments What to do for fun Join a gym! Food and Dining There is no cafeteria in our school. Dorm Life I don't live on campus. Academic Rigor Curriculum is organized and easy to follow if you put your mind to it! Tips for prospective students Study and read everyday! In three sentences Triton was my first college, I am now enrolled in Ambria college which is a nursing school and I intend to graduate by the summer 2013. I enjoy it very much the staff and faculty help their students out as much as they can. Login to rate or flag the reviews Sylvia from Oak Park, IL 07/09/2011 Reviewer is A current student here. 4 of 40",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}