{
    "relation": [
        [
            "First Name",
            "Christopher",
            "Christopher",
            "Grover"
        ],
        [
            "Last Name",
            "Prandoni",
            "Butler",
            "Norquist"
        ],
        [
            "Suffix",
            "",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            "",
            ""
        ],
        [
            "New",
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=89FB99A5-3DAF-4B2D-98D6-FCDD2F619324&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 217341763,
    "recordOffset": 217333561,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{48934=H.R. 1971 The Pharmacy Competition and Consumer Choice Act of 2011 S 3187, the Food and Drug Administration Safety and Innovation Act, 1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 19372=H.R. 2146 The DATA Act H.R. 4628 Interest Rate Reduction Act H.R. 4310 The National Defense Authorization Act of 2013 NA Department of Defense Appropriations H.R. 5972 Transportation, Housing and Urban Development and Related Agencies Appropriations Act NA Congressional Budget Office Transparency Act H.R. 5325 Energy and Water Development and Related Agencies Appropriations Act of 2013 H.R. 5362 Commerce, Justice, Science and Related Agencies Appropriations Act, 2013, 41514=S. 3187 Food and Drug Administration Safety and Innovation Act H.R. 436 Protect Medical Innovation Act H.R. 5842 Restoring Access to Medications Act H.R. 5858 Health Savings Account Improvement Act H.R. 1004 Health Flexible Spending Account Improvement Act H.R. 6079 Repeal of Obamacare Act,, 30809=H.R. 4310 The National Defense Authorization Act of 2013, 55517=H.R. 9 Small Business Tax Cut Act S. 2231 Small Business Lending Enhancement Act, 45598=S. 1789 The 21st Century Postal Service Act of 2012 S.J. Res 36 Ambush Election CRA S. 3221 RAISE Act H.R. 4385 RAISE Act, 12210=H.R.3062 Dairy Security Act of 2011 S.3240 Agriculture Reform, Food, and Jobs Act of 2012 H.R.6083 Federal Agriculture Reform and Risk Management Act of 2012, 64615=S. 971 Digital Goods and Services Tax Fairness Act of 2011 H.R. 1860 Digital Goods and Services Tax Fairness Act of 2011 S.1452 Main Street Fairness Act H.R.2701 Main Street Fairness Act H.R.3179 Marketplace Equity Act of 2011 S.1832 Marketplace Fairness Act H.Res. 57 Expressing the sense of the House of Representatives that the United Nations and other international governmental organizations shall not be allowed to exercise control over the Internet. H.R.3675 Next Generation Television Marketplace Act S.2008 Next Generation Television Marketplace Act of 2011 WT Docket No. 12-4 Verizon Wireless, SpectrumCo and Cox - Assignment of AWS Licenses, 34059=H.R. 5974 Invest in America Now Act of 2012 H.R. 4348 An act to authorize funds for Federal-aid highways, highway safety programs, and transit programs, and for other purposes. S. 2204 Repeal Big Oil Tax Subsidies Act H.R. 6082 Congressional Replacement of President Obamas Energy-Restricting and Job-Limiting Offshore Drilling Plan H.R. 1837 San Joaquin Valley Water Reliability Act S.J. Res 37 Overturn Utilty MACT regulation, 59365=H.R. 9 Small Business Tax Cut Act H.R. 436 Protect Medical Innovation Act H.R. 5842 Restoring Access to Medications Act H.R. 5858 Health Savings Account Improvement Act H.R. 1004 Health Flexible Spending Account Improvement Act S. 1796 Free File Improvement Act of 2011 H.R. 5974 Invest in America Now Act of 2012 H.R. 4348 An act to authorize funds for Federal-aid highways, highway safety programs, and transit programs, and for other purposes. H.R. 6079 Repeal of Obamacare Act S. 971 Digital Goods and Services Tax Fairness Act of 2011 H.R. 1860 Digital Goods and Services Tax Fairness Act of 2011 S.1452 Main Street Fairness Act H.R.2701 Main Street Fairness Act H.R.3179 Marketplace Equity Act of 2011 S.1832 Marketplace Fairness Act H.R. 1834 Freedom to Invest Act of 2011 S. 2204 Repeal Big Oil Tax Subsidies Act, 27264=S.1452 Main Street Fairness Act H.R.2701 Main Street Fairness Act H.R.3179 Marketplace Equity Act of 2011 S.1832 Marketplace Fairness Act H.Res. 57 Expressing the sense of the House of Representatives that the United Nations and other international governmental organizations shall not be allowed to exercise control over the Internet., 52266=S. 1789 The 21st Century Postal Service Act of 2012, 23655=S. 971 Digital Goods and Services Tax Fairness Act of 2011 H.R. 1860 Digital Goods and Services Tax Fairness Act of 2011 H.R.3675 Next Generation Television Marketplace Act S.2008 Next Generation Television Marketplace Act of 2011 WT Docket No. 12-4 Verizon Wireless, SpectrumCo and Cox - Assignment of AWS Licenses}",
    "textBeforeTable": "",
    "textAfterTable": "State DC Zip Code 20002 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Mr.  Christopher Butler  2027850266  cbutler@atr.org 5. Senate ID#  3801-12 7. Client Name Self Check if client is a state or local government or instrumentality",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}