{
    "relation": [
        [
            "Time",
            "10:30 AM",
            "11:30 AM",
            "12:30 PM",
            "1:30 PM",
            "2:30 PM",
            "3:30 PM"
        ],
        [
            "Session",
            "Mandolin (B)",
            "Tin Whistle (B)",
            "Banjo (I)",
            "Hammered Dulcimer (B)",
            "Harmonica (B)",
            "Klezmer Music"
        ],
        [
            "Name",
            "Laurie Phillips",
            "Andy Moss",
            "David Margolin",
            "Scott Reeder",
            "Scott Ware",
            "Beth Cohen"
        ],
        [
            "Description",
            "Bring your ax and learn which end is right (and don't be left). You don't need to read music ... but we won't hold it against you if you can! We'll discuss the local music scene, point to some things to work on, and practice some basic moves and tactics. And we WILL learn a tune. As always: a handout to take home!",
            "Workshop for whistle beginners. In one hour, play a few tunes. Have lots of fun.",
            "Members of old-time bands may think that clawhammer banjo tunings are intended solely to irritate people who play less idiosyncratic instruments. While that is largely the case, they also enable us banjo players to negotiate some old-time tunes with elegance and efficiency. This is especially true of the focus of this workshop, \"double-C\" based G tunings, which make otherwise awkward tunes very enjoyable to play. A number of common G tunes will provide proof of concept.",
            "If you can tap a tune out on a table top, then you can play hammered dulcimer. Come check out this many-stringed instrument, and see how fun it is to play!",
            "(Note: Teacher change from Alex Hastings to Scott Ware) Come learn to play harmonica with Scott Ware, a local Celtic and folk musician. It's easy and fun, and almost as annoying as accordion! Bring a harmonica in the key of C, or buy an inexpensive one from one of our festival vendors before the workshop.",
            "Klezmer refers to the the dance music of the eastern European Jewish people. Learn to play a klezmer dance tune with Beth Cohen: a long-time ABQ music teacher and folk musician, Community Klezmer band director since 1995, co-producer of KlezmerQuerque & band member of The Rebbe's Orkestra & Goddess of Arno. All levels of musicians and all instruments are welcome. http://www.nahalatshalom.org - or if you'd rather have the exact but longer link for the klezmer band page it is: http://nahalatshalom.org/index.php?option=com_content&task=view&id=25&Itemid=56"
        ]
    ],
    "pageTitle": "Albuquerque Folk Festival: 2012 Information",
    "title": "",
    "url": "http://abqfolkfest.org/2012FestivalInfo.shtml",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 3315311,
    "recordOffset": 3269008,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{13510=International Bluegrass Music Association executive director Dan Hays calls Laurie “one of the preeminent bluegrass and Americana artists of our time.” Acclaimed musician Sam Bush puts it more simply, calling her “a great singer, terrific fiddle player, fine songwriter, and one very good band leader.” Laurie also performed on both the Grammy-award winning, 1997 IBMA album of the year True Life Blues: The Songs of Bill Monroe, and the Grammy-nominated Ralph Stanley & Friends’ release Clinch Mountain Country., 5705=Thanks to everyone who made the 2012 Albuquerque Folk Festival a great success! We made some big changes last year, and the festival was the best ever!, 9295=To give you an idea of what's in store for 2013, here's a look back at our 2012 festival:, 69956=Here's our 2012 dance workshop schedule, with two dance venues. Don't miss the chance to try all kinds of different dancing styles. Thanks to Patsy Gregory for organizing the dance workshops., 117826=Sunny invites you to join her and the Puppet Playhouse for other events. \"We invite you to dress in costume and bring your own puppets or call 944-6605 ahead of the event and we'll bring a giant puppet for you to wear! We will be at the Children's Festival at El Rancho de las Golondrinas on Saturday, September 1 with a puppet show and puppet parade.\", 118200=Sunny will present giant puppet making workshops on Sundays in August at Offcenter Arts and coordinate the Giant Puppet Parade for the Folk Art Festival on Sunday, September 9. They'll also will be at Old Town for Halloween and the Holiday Stroll on Friday, December 7th., 25883=Albuquerque’s own Irish music trio Finn’s Thumb performs traditional songs and music of Ireland with respect and passion. Finn's Thumb has been playing music together since June of 2010, performing at playhouses, pubs, weddings, and corporate and public events throughout Albuquerque. The trio includes Jeannie Dyke (guitar, vocals, whistle, flute) Dain Forsythe (flute, whistles, bohdrán, vocals) and Pam Morden (violin, mandolin, bouzouki)., 69623=Of course, you can always dance to the live music at various venues around the festival. And if you feel like dance jammin', you can join in the Band/Dance Scramble, with planning, rehearsal, and name creation from 4:30-5:30 p.m. and performance from 5:30-6:30 p.m., 14427=In 2004, Lewis & Rozum released their third duo album, Guest House (their first for HighTone Records), a characteristically versatile and engaging offering of love songs, laments, social commentary, and freewheelin' fun in the spirit of old-time music. Laurie and Tom pay homage to such eminent influences as Woody Guthrie, Hazel Dickens, Grandpa Jones, and the inimitable Bill Monroe, adding their own distinctive touches to traditional favorites as well as performing several of Laurie’s nonpareil compositions., 69112=The dancing just gets better and better every year at the Festival. On Saturday, the dance workshops, in two venues, start at 10:30 a.m. Take a dinner break at 6:30 p.m. and then come back for the Saturday evening dances that start at 7:30 p.m.. This year, the Barn Dance co-sponsored by ADC will feature Cathy Faber's Swingin' Country Band, and the Contra Dance, sponsored by FolkMADS, will feature the Albuquerque Megaband with Wendy Graham calling., 84077=Variety Barn Dance \"under the stars\" in the Dance Tent, 7:30-10:30 p.m., sponsored in part by the Albuquerque Dance Club. Music by Cathy Faber's Swingin' Country Band, 24871=The Saltine Ramblers started as a group of friends bringing their diverse influences to acoustic jams in a Los Lunas living room in 2004. Bluegrass, alt-country, old time fiddle tunes, folk, blues, cajun, rock & roll, the Grateful Dead and life in New Mexico are all influences that commingle in the music, including originals that they create. Musicians include original members Kevin Strange (guitar, vocals) Cory Minefee (electric guitar, vocals) David Ivey (fiddle, mandolin, vocals) with old friend Dave Payne (bass, squeeze box, vocals) and new friend Mark Beck (pedal steel, cowboy hat)., 124212=Last updated Monday, January 14, 2013, 14039=New England native Tom Rozum \"possesses an earnest tenor voice in the vein of contemporary bluegrass great Tim O'Brien, and peels off rhythmically crisp licks on mandolin and guitar.\" —Derk Richardson In 1998, he released his debut solo album Jubilee on Dog Boy Records. “Without reservation, one of 1998’s most rewarding acoustic releases.” —Amazon.com, 20974=The Duke City Swampcoolers of Albuquerque, play bluegrass music as well as original tunes, folk, and gospel, with a little jazz and swing thrown in for good measure.  Formed in 2004, members include Tony Smith, Bill Dufault, Jon Bryan, Aaron Combs, and Tony Kahn., 94785=All of these workshops are designed for festival goers' participation. Even if you don't have an instrument to play, workshop presenters and/or other participants can often loan you one or share theirs to give you chance for a little hands on. Don't be shy! Come join the fun! And if you do have an instrument at home, don't hesitate to bring it along. We have an instrument check room available from the festival start until 10:00 PM so you don't have to lug that instrument around all day if you don't want to., 20175=Winner of Best Vocal and Best Western Song in 2011, Holy Water and Whisky has been delighting audiences for over 8 years with their fine harmony singing, great humor, and traditional, folk, original, bluegrass, gospel, and cowboy musical selections. The group consists of Maggie Washburne on bass, Scott Altenbach on guitar, and Bruce Washburne on guitar and banjo., 13101=Since forming a musical partnership in 1986, when Tom first joined Laurie’s acclaimed band, Grant Street, Laurie Lewis and Tom Rozum have recorded 12 albums and performed around the globe. These Grammy-nominated artists (for their 1995 album The Oak and the Laurel) are widely regarded as among the leading lights of modern bluegrass and are highly-prized by their peers as sidemen and producers., 9437=The Folk Festival will run from 10:00 AM to 11:00 PM on Saturday, June 2 at the Albuquerque International Balloon Museum in Albuquerque., 15396=Lorenzo Trujillo has been a musician, ethnic dancer, and folklorist for four decades. His roots in the traditions of the 1840’s of Southern Colorado and Northern New Mexico permeate his performances with Southwest Musicians, a multi-generational group whose music has been handed down through many generations of family musicians. In 2004, Dr. Trujillo was awarded the Hilos Culturales Distinguished Traditional Folk Artist Premio for his lifetime contributions to the traditional Hispanic traditions of Southern Colorado and New Mexico, and in 2009, he was inducted into the Colorado Chicano Music Hall of Fame., 65581=The popular Sign-up Stage returns for 2012. This venue is a centrally-located opportunity for people (musical bands, individuals, dancers, singers, etc.) to sign up and perform for 30 minutes on our stage. On Saturday, new group/individual will perform every 45 minutes. This is a great opportunity for people to be seen and to share your musical talents with all festival-goers., 68153=For additional information, contact Gary Libman, Director ABQ Folk Festival 2012, at .}",
    "textBeforeTable": "Sandia · Jemez · Mt. Taylor Performance Stages For more info: celticeclectic.com Saoirse (Seer-shih), in Gaelic, means 'Freedom'. Saoirse, a 'Celtic-Eclectic' band, with current members Laura 'Io' Berg, Susan Taichert, John Brinduse, Lisa Nicols, Harlow Pinson, Will Hanley, and Glenn Maxwell, plays progressive Celtic World music. Complimentary vocals, along with a richly layered mix of flutes, fiddles, uilleann pipes, guitars, dulcimers, banjos, mandolins and Bodhrans, make Saoirse an enjoyable listening experience, and a great introduction the power and beauty of the Celtic musical tradition. Saoirse Mt. Taylor Stage: 7:30 pm For more info: Ladyfingers The Ladyfingers, an all-woman band from Albuquerque, present Celtic, Gypsy, and Old-World folk music, along with some fun singing. A delicious mix of acoustic instruments with Pat Arruffo (fiddle), Barb Belknap (mandolin), Erika Gerety (bass), and Gretchen Newman (guitar). Ladyfingers Sandia Stage: 12:30 pm For more info: finnsthumb.com Albuquerque’s own Irish music trio Finn’s Thumb performs traditional songs and music of Ireland with respect and passion. Finn's Thumb has been playing music together since June of 2010, performing at playhouses, pubs, weddings, and",
    "textAfterTable": "The Buckarettes are an almost all-female group of well seasoned musicians that span not only the styles of rare and collectible western swing, eclectic selections from the 40' & 50's, but also include compositions from modern day writers--even from within the group. Their performances are known for outstanding cowgirl harmonies, superb musicianship, swingin' hips and fringe, kick-up-your-boots-rhythm and spontaneous sillyness that erupts from the girls on stage and flows to their delighted audiences everywhere. The Buckarettes have enjoyed recognition around the state of New Mexico and parts of Arizona & Colorado. They have performed a vast array of shows--a 4-H hog-judging post party at the Santa Fe County Fair, an evening at the Biopark \"Summer Nights\" in Albuquerque, a swingin' set or two down in Las Cruces for the renowned \"Cowboy Days\", and a concert setting at the prestigious Cowboy Trappings exhibition in Flagstaff, AZ. Their music has been heard literally around the world on the radio waves in Germany, France, England, Australia, China & Japan to mention a few. They have appeared in magazines such as Cowboys and Indians, New Mexico Magazine, the Albuquerque Journal, Rope Burns, Crosswinds Weekly, and received a five star customer review on Amazon.com. They were featured in the culture section of the Dec. \"Best of 2005\" issue of Albuquerque the Magazine with a full page color photo and a downright upright write-up! They have shared the stage with regional giants Bill & Bonnie Hearne, Michael Hearne & South by",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}