{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "For the short time I am here, again, I rate a 5 star rating. We have a girl with us who is not a Freshman, who helps us understand the ways and rules and keeps us on track for cleaning days. But there is also a security person that keeps watch over us and we know we are safe.",
            "For the time I am here, since July 1, I give it a 5 star rating. We are doing everything. I know when Fall Semester starts Aug. 23, we will be doing Football games and community service and just enjoying a super college life.",
            "Mars Hill is great for any type student. It has so much to offer to all.",
            "I am not really here long enough to answer this.",
            "I give Mars Hill 5 Stars, as I feel that I am going to get more out of college than I ever imagined. Just touring the grouds back in May, I felt I had to be here to enjoy all this school has to offer. The one thing that impressed me the most is that I was told I will a staff member monitor me throughout the year and help to keep me in a positive direction. It is expensive, but the college works with you and then fafsa helps and now I am still applying for more scholarship to help with the remaining tuition.",
            "I couldn't even imagine that college would be fun. As it is, I have been in Mars Hill Summer program since July 1 and have not gone home once yet. I am ready to go home to relax, as we have not stopped doing things since I got here. We have gone to the Biltmore, to barbeques, to Virginia for bike riding. We were supposed to go white water rafting, but had to cancel due to waters a little rough, but will still do it before fall semester begins. Fun!",
            "I get 3 square meals a day. I am enjoying being able to go out with my dorm friends or by myself to the cafeteria and eat, and in my case, the food is included in my tuition. The food is great and the fact that it is included in my tuition is such a help and a lot of pressure off of me. We also go out to dine at local restaurants from time to time. 5 Stars",
            "Dorm life has been super. The girls are like a family, a family who stand by each other. I have made several new friends and am so pleased to have met each and every one of them. 5 stars",
            "I am taking Personal Finances and Computer Art Graphics. My professors are great. I am enjoying college and the fact that I could take summer courses and get adjusted ahead of time is such an asset. 5 stars",
            "Come to Mars Hill and enjoy the beauty of N.C. and enjoy a staff of people that make college, especially Mars Hill College, a place you want to be. They are with you and behind you all the way. I could have never imagined it to be so great.",
            "Mars Hill College is an excellent college, beyond what I could have imagined. I am presently in a summer program and will enter Freshman year, Aug. 23, 2013. I find the college staff, employees, professors, etc, the most helpful and concerned people that I could have ever hoped for."
        ]
    ],
    "pageTitle": "Mars Hill University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Mars-Hill-University/reviews?_escaped_fragment_=/show/74935",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894796183,
    "recordOffset": 894760912,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{95988=For the time I am here, since July 1, I give it a 5 star rating. We are doing everything. I know when Fall Semester starts Aug. 23, we will be doing Football games and community service and just enjoying a super college life., 81297=The cafeteria has some ok meals nothing too special and fancy but enough to satisfy your appetite. The cafe is not open late but the den is open until 11:30, 97043=I give Mars Hill 5 Stars, as I feel that I am going to get more out of college than I ever imagined. Just touring the grouds back in May, I felt I had to be here to enjoy all this school has to offer. The one thing that impressed me the most is that I was told I will a staff member monitor me throughout the year and help to keep me in a positive direction. It is expensive, but the college works with you and then fafsa helps and now I am still applying for more scholarship to help with the remaining tuition., 100430=Mars Hill College is an excellent college, beyond what I could have imagined. I am presently in a summer program and will enter Freshman year, Aug. 23, 2013. I find the college staff, employees, professors, etc, the most helpful and concerned people that I could have ever hoped for., 121733=© 2015, Cappex.com, LLC, 8436=I personally love Mars Hill. At first it was a little strange coming to a school that was much smaller than my high school, Mars Hill only has around 1100 people. I love that Mars Hill is little though, because you will walking around campus and you know or at least recognize every face you see and that part is amazing. There are also a ton of really nice people, when you come to visit campus or if you are a student you will hardly ever walk around and not see someone a smile on their face. People are so friendly., 97739=I couldn't even imagine that college would be fun. As it is, I have been in Mars Hill Summer program since July 1 and have not gone home once yet. I am ready to go home to relax, as we have not stopped doing things since I got here. We have gone to the Biltmore, to barbeques, to Virginia for bike riding. We were supposed to go white water rafting, but had to cancel due to waters a little rough, but will still do it before fall semester begins. Fun!, 49142=There is going to be a brand new dining facility for the 2012-2013 school year. There are also two food shops on campus, not to mention the close by diners.}",
    "textBeforeTable": "07/21/2009 Reviewer is A current student here. 10 out of 10 people found this review useful. 1 of 29 Stephanie from Andrews, NC Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6,",
    "textAfterTable": "Am enjoying being here The campus is so small, and because of that it is easier to get to know people. The college sponsors so many events, and that allows all of the students to get to know each other and the staff. Am learning a lot Because of it being a private college the classes are so small, and with that the professors can work with each student. It is so helpful and is so much easier to learn the information they give us. Login to rate or flag the reviews Katherine from Mountain Home, NC 01/12/2010 Reviewer is A current student here. 2 out of 2 people found this review useful. 3 of 29 Categories Comments Great for these types of students Mars Hill is great for students that would like to participate in a sport in college, over 75 percent of our population are student-athletes. But I don't want to discourage non-athletes either, Mars Hill is",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}