{
    "relation": [
        [
            "Patent application number",
            "20140234197",
            "20140363362"
        ],
        [
            "Description",
            "METHOD FOR PRODUCING CHLOROPOLYSILANE AND FLUIDIZED-BED REACTOR - Disclosed is a method for producing chloropolysilane by which the yield of a fluid reaction to produce the chloropolysilane is improved while blockage in a reactor caused by attachment of higher-order silicon chloride as a by-product is prevented. In producing the chloropolysilane by reacting fluidized silicon particles or silicon alloy particles with a chlorine gas, an outlet filter is provided, upstream from a product outlet that releases a reaction product, above the area in which the silicon particles or silicon alloy particles are fluidized inside a reaction tank. The outlet filter prevents fine particles blown up by fluidization from flowing out of the reaction tank through the product outlet. A temperature of the outlet filter is set in a range of 210 to 350° C.",
            "MANUFACTURING METHOD OF HIGH-PURITY CHLOROPOLYSILANE - [Problem] Chloropolysilane having a low metallic impurity concentration has been required to be obtained in order to be used for semiconductor applications. However, it is difficult by distillation to remove impurities such as a titanium compound having a vapor pressure close to that of chloropolysilane and an aluminum compound having a sublimating property. Meanwhile, when the content of metallic impurities such as aluminum and titanium reduces in metallic silicon that is a raw material, chlorination reaction is less likely to occur unless a reaction temperature is raised and that causes equipment to be restricted. It is found that a chlorination reaction can be carried out at a relatively low temperature by heating a mixture of granular metallic silicon and metallic copper or a copper compound in an inert atmosphere even when the metallic silicon has a high purity and does not contain aluminum and titanium and that chloropolysilane of high purity can be obtained by further adding metallic silicon as needed after the chlorination reaction is started."
        ],
        [
            "Published",
            "08-21-2014",
            "12-11-2014"
        ]
    ],
    "pageTitle": "Takashima, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/takashima-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00217-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 448420463,
    "recordOffset": 448390088,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kanemasa Takashima, Tokai JP 06-10-2010 CONVEYING APPARATUS - A conveyance device uses a simple structure to cause a travel body on which food and drink are placed to travel stably. The conveyance device ( 20100140057 Published Description Patent application number Ikuo Takashima, Kanazawa-Shi JP 10-28-2010 CONVEYING DEVICE - To provide a conveying device that has a simple structure and can stably travel a traveling body on which food and drink articles are placed. The conveying device comprises a conveying drive part ( 20100270123 Published Description Patent application number Ikuo Takashima, Ishikawa JP 11-05-2009 Fuel Cell System Designed to Ensure Stability of Operation - A fuel cell control system is provided which is designed to ensure the stability of operation of a fuel cell stack. The system includes a magnetic sensor and a controller. The magnetic sensor works to measure a change in magnetic flux density of magnetic field produced by an electric current as generated by electrochemical reaction taken place in each of fuel cells. The controller is designed to analyze the change in magnetic flux density measured by the magnetic sensor to specify the cause and location resulting in a drop in ability of the fuel cell stack to generate electricity which is to occur partially in the fuel cell stack. The controller takes a predetermined measure to control the operation of the",
    "textAfterTable": "Kazuhiko Takashima, Kanagawa-Ken JP Patent application number Description Published 20090297283 CUTTING EDGE CONFIGURATION OF CUTTING TOOL - A cutting edge configuration of a cutting tool for performing a cutting process on a surface ( 12-03-2009 Kazunori Takashima, Toyohashi-Shi JP Patent application number Description Published 20100089754 METHOD OF MEASURING MICROPARTICLES HAVING NUCLEIC ACID AND APPARATUS THEREFOR - To provide a system by which evaluation of circumstances of contamination by microparticles having nucleic acid can be performed rapidly and accurately. The theme is achieved by a system for measuring microparticles that includes: (1) a microparticle adhesion step of adhering the microparticles having nucleic acid to a microparticle adhesion member; (2) a membrane breakage step of breaking membranes of the adhered microparticles by electrical discharge; (3) an electrophoresis step of electrophoresing the microparticles in a thickness direction of a gel to make the nucleic acid in the microparticles migrate from a negative electrode side toward a positive electrode side and adhere the nucleic acid on a surface of a nucleic acid detection member; and (4) a nucleic acid measurement step of fluorescently staining the surface of the nucleic acid detection member to measure a concentration of the nucleic acid. 04-15-2010 Keiichi Takashima, Kawasaki-Shi JP Patent application number Description Published 20080273813 METHOD FOR CONTROLLING THE COMBINING OF ORIGINAL IMAGE DATA AND CODED IMAGE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}