{
    "relation": [
        [
            "Name",
            "Rex Lane",
            "Beva Lane",
            "Verle Lane",
            "Carroll Lane",
            "Denman Claire Lane",
            "Floy Lane"
        ],
        [
            "Age",
            "41",
            "42",
            "19",
            "10",
            "8",
            "5"
        ]
    ],
    "pageTitle": "gwinelizaLouisaHLaneETWells.htm",
    "title": "",
    "url": "http://www.gwingenealogy.net/GENEALOGY/SURNAMES/Gwin/gwinelizaLouisaHLaneETWells.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00142-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 485888183,
    "recordOffset": 485807923,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{29205=13 Dec 1918- Westboro Enterprise, 29021=MRS J. G. LANE DEAD - Westboro relatives received notice Thursday morning of the death of Mrs. J. G. Lane, at Yuma, Colorado.  Mrs. Lane had been a sufferer of tuberculosis for some time and her death was not unexpected.  She was a woman loved and esteemed by all who knew her, and the news of her death is cause for much sadness here which was the home of the Lanes for many years and where they raised their family.  She left to mourn her death her husband, two daughters, Mrs. Ed Flack and Mrs. David Lackey, and two sons, Lloyd and Rex Lane, all of Yuma, Colorado.  Besides these she is survived by four sisters and two brothers, Mrs. J. D. Macrander [Note: Cora May Mumford] Miller Anis Mumford of Westboro, Mrs. Ed Hutt and Mrs. Joe Hutt of Blanchard, Colfax Twp, Page Co., Iowa, Theodore Mumford of Winston, Daviess Co., MO, and Mrs. Lyman Dixon, Nortonville, Atchison Co., KS.}",
    "TableContextTimeStampAfterTable": "{4506=His father, Earle, started milking a few cows to benefit of his own family, and soon they were providing milk to neighbors. Eventually, the Harper Dairy was  established, and Max and Howard helped deliver milk to the doorsteps around Yuma. Max graduated from Yuma Union High School with the class of 1944.  Max Harper and Phyllis Jean Davis were married on February 9, 1945, just about the time of Max’s induction into the United States Army.  He served in the 7th Infantry Division in the Philippines, Japan, and Korea., 5183=After Max returned from military service, he went back to work on the Harper Dairy, eventually becoming a partner with his father Earle and brothers Howard and Jim. Together, they expanded the dairy operation to include a large farming operation growing wheat, corn, sugar beets, soybeans, alfalfa, and other crops. Max was very active in his community through the Lions Club, the Yuma County Fair Board and the Yuma School Board. For many years, he refereed high school football and basketball games in northeast Colorado, Kansas and Nebraska. In agricultural ventures, he served as a member of the Board of Directors of the Rocky Mountain Sugar Beet Growers Association, Mountain States Dairymen Association, and Dairy Farmers of America. He was a candidate for political office in 1990 and was appointed by Governor Roy Romer to the Colorado Agricultural Commission where he served for twelve years., 6633=Max continued to be interested and involved in politics, and in 2007 he attended the Democratic Party’s State Convention and Barack Obama’s acceptance speech at Invesco Field., 54913=\"The building was dedicated August 28, 1910, and the Yuma Pioneer reported that the building contained a \"splendid Williams organ\".  Upon completion, the congregation boasted nineteen members and a salaried preacher.  Rev. York was paid a yearly salary of $69.65 by the churches he served; Pleasant Valley’s share was $12.40.  The first service at the new church was a gala affair. A quartet consisting of Wesley and Ralph Weekly, Lena Buchanan and Zella Lane Lackey, drove out from Yuma in a carriage rented from the local livery stable to perform.\", 6881=In August 2010, Max and Phyllis, along with other Harper family members, accepted a Centennial Farms Award at the Colorado State Fair in Pueblo, Colorado, capping off a lifetime spent in farming with his brothers and his children., 8359=Max died after a brief illness on November 3, 2012 in Yuma, Colorado, at the age of eighty-six., 3993=Max LaVerne Harper was born to Betheen Faris Flack and Earle Bartlett Harper on August 14, 1926, in Yuma, Colorado. He was the oldest of three brothers, including Howard and Jim, with whom he would share a lifelong partnership.  During the depression, when Max was seven years old, his family moved one mile east of Yuma to the farm then owned by Edwin P. Flack, his maternal grandfather.}",
    "lastModified": "Sat, 20 Jun 2015 22:41:28 GMT",
    "textBeforeTable": "Household Members: Neodesha, Wilson, Kansas Residence in 1935: Neodesha, Wilson, Kansas Inferred Residence in 1935: South Main Street: Blanchard, Page, Iowa Home in 1940: Colorado Birthplace: abt 1921 Estimated Birth Year: 19 Age: Verle Lane Name: L500 Lane, Rex, 70, b 10 Mar 1899 Wboro; d muni; wed 20 Apr 1919 Beva Henderson at Yuma, Colo; f John Lane; i Shen. CHJ 28 Jul 1969 l-r: Carroll, Claire, Rex, and Floy Lane, and Rex's nephew, Stanley Lane",
    "textAfterTable": "27.01 --Verle R. Lane, b. 4 Aug 1920 in CO/MO/NE; d. 8 Jun 1999 in South Gate, CA; bd. unk. ; m. Evelyn McDowell ; unk. ch. [listed as Verle R. Lane, 19, b. in CO/MO/NE , in the 8 Apr 1930 census of Neodesha, Wilson Co., KS] [listed as Verle Lane, 9, well driller, b. in CO , in the 8 Apr 1940 census of Blanchard, Page Co., IA] Persons born 04 August 1920 in the Social Security Death Master File VERLE R. LANE was born 04 August 1920, got Social Security number *******0504 (indicating Kansas) and died 08 June",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}