{
    "relation": [
        [
            "Religion",
            "Evangelical Protestant",
            "Mainline Protestant",
            "Catholic",
            "Black Protestant",
            "Other",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "61,933",
            "16,076",
            "2,883",
            "2,421",
            "2,337",
            "58",
            "109,377"
        ],
        [
            "Congregations",
            "172",
            "38",
            "1",
            "12",
            "6",
            "1",
            "-"
        ]
    ],
    "pageTitle": "Helena, Alabama (AL 35080) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Helena-Alabama.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00024-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 382981439,
    "recordOffset": 382842835,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{7483=According to our research of Alabama and other state lists there were 4 registered sex offenders living in Helena, Alabama as of July 29, 2015. The ratio of number of residents in Helena to the number of sex offenders is 4,302 to 1. The number of registered sex offenders compared to the number of residents in this city is a lot smaller than the state average., 128966=We are giving away $1200 in prizes - enter simply by sending us your own city pictures!}",
    "TableContextTimeStampAfterTable": "{34538=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 11.2. This is worse than average. Closest monitor was 7.7 miles away from the city center., 30971=Air Quality Index (AQI) level in 2012 was 95.6. This is worse than average., 46071=Graphs represent county-level data. Detailed 2008 Election Results, 32347=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.58. This is better than average. Closest monitor was 10.1 miles away from the city center., 33784=Particulate Matter (PM10) [µg/m3] level in 2012 was 24.6. This is worse than average. Closest monitor was 7.7 miles away from the city center., 26834=Tourist attraction: R & B Transportation (Tours & Charters; 1906 Lakeland Trail) (1). Display/hide its approximate location on the map, 44929=2000 Presidential Elections Results, 41433=Educational Attainment (%) in 2013, 45501=2008 Presidential Elections Results, 33079=Ozone [ppb] level in 2012 was 24.8. This is better than average. Closest monitor was 3.2 miles away from the city center., 31623=Carbon Monoxide (CO) [ppm] level in 2012 was 0.219. This is better than average. Closest monitor was 14.6 miles away from the city center., 61645=8.06% of this county's 2011 resident taxpayers lived in other counties in 2010 ($48,148 average adjusted gross income), 142242=Total of 29 patent applications in 2008-2015., 14247=On 4/4/1977, a category F5 (max. wind speeds 261-318 mph) tornado 17.2 miles away from the Helena city center killed 22 people and injured 130 people and caused between $5,000,000 and $50,000,000 in damages., 44643=1996 Presidential Elections Results, 45787=2012 Presidential Elections Results, 14565=On 4/8/1998, a category F5 tornado 20.8 miles away from the city center killed 32 people and injured 259 people and caused $200 million in damages., 63862=7.50% of this county's 2010 resident taxpayers moved to other counties in 2011 ($50,573 average adjusted gross income), 45215=2004 Presidential Elections Results, 41831=School Enrollment by Level of School (%) in 2013, 143540=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc.}",
    "textBeforeTable": "Religion statistics for Helena city (based on Shelby County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Bottled, tank, or LP gas (1%) Utility gas (46%) Electricity (53%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 24 Shelby County: 1.31 / 10,000 pop. Alabama: 1.89 / 10,000 pop. Number of supercenters and club stores: 3 This county: 0.16 / 10,000 pop. State: 0.20 / 10,000 pop. Number of convenience stores (no gas): 5 Shelby County: 0.27 / 10,000 pop. Alabama: 0.65 / 10,000 pop. Number of convenience stores (with gas): 94 Shelby County: 5.14 / 10,000 pop. State: 6.32 / 10,000 pop. Number of full-service restaurants: 124 Here: 6.78 / 10,000 pop. State: 5.75 / 10,000 pop. Adult diabetes rate: This county:",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}