{
    "relation": [
        [
            "Outsourcer name",
            "Kado",
            "HighTech Passport, Ltd.",
            "New Suzhou Translation Agency Co., Ltd. / Suzhou President Translation co / suzhoufanyi",
            "Access Translation Services"
        ],
        [
            "Country",
            "Canada",
            "United States",
            "China",
            "United States"
        ],
        [
            "LWA",
            "5",
            "5",
            "5",
            "5"
        ],
        [
            "Comment",
            "Hidden",
            "Hidden",
            "Hidden",
            "Hidden"
        ],
        [
            "Outsourcer feedback",
            "Hidden",
            "...",
            "Hidden",
            "..."
        ]
    ],
    "pageTitle": "English to Bulgarian technical translator",
    "title": "",
    "url": "http://www.proz.com/profile/40374",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00301-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 653821239,
    "recordOffset": 653799670,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Access to Blue Board comments is restricted for non-members. Click the outsourcer name to view the Blue Board record and see options for gaining access to this information. 4 entries Blue Board entries made by this user  PRO-level points: 167, Questions answered: 121, Questions asked: 76 KudoZ activity (PRO) Less More Aerospace / Aviation / Space Law: Contract(s) IT (Information Technology) General / Conversation / Greetings / Letters Furniture / Household Appliances Engineering: Industrial Engineering (general) Computers: Systems, Networks Computers: Hardware Computers (general)",
    "textAfterTable": "More Less Portfolio Sample translations submitted: 1 English to Bulgarian: Ultra-low temperature coefficient of capacitance (TCC) of the SrSnO3-based electrical components Source text - English The perovskite-structured SrSnO3 possessing steady capacitance over the temperature range between 27 °C and 300 °C in a frequency domain spanning nearly four decades has been evaluated. The samples investigated in this study were synthesized by using solid-state reaction (SSR) and self-heat-sustained (SHS) techniques. These samples were sintered at a temperature (T ) ranging between 1200 °C and 1600 °C with a soak-time (t) ranging between 2 h and 60 h. The ac immittance (impedance or admittance) measurements were conducted on these sintered bodies in the frequency range 5 Hz to 13 MHz. These ac electrical data were found to exhibit relaxation in more than one complex plane formalisms in a simultaneous manner. The magnitude of the terminal capacitance was found to be in a narrow window of 3 pF to 6 pF possessing very weak temperature dependence. Further analysis also revealed that this material system possessed low dielectric constant and ultra-low temperature coefficient of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}