{
    "relation": [
        [
            "Situation",
            "INDOORS Relaxed conversation, background Leq=45dB, 100% intelligibility if background noise were continuous at 45 dB",
            "OUTDOORS Normal voice at 2 meters, background Leq=60dB, 95% intelligibility if background noise were continuous at 60 dB"
        ],
        [
            "A-Weighted level of intruding noise during \"on-cycle,\" decibels",
            "45 50 55 60 65 70 75 80",
            "60 65 70 75 80"
        ],
        [
            "Duration of intruding noise as percent of total time",
            "100 32 10 3 1 0.3 0.1 0.03",
            "100 32 10 3 1"
        ],
        [
            "Percent interference if intruding noise were continuous",
            "0 0.5 1 2 6 40 100 100",
            "5 7.7 53 100 100"
        ],
        [
            "Average percent interference in cycled noise",
            "0 0.16 0.1 0.06 0.06 0.12 0.1 0.03",
            "5.0 2.5 5.3 3.0 1.0"
        ]
    ],
    "pageTitle": "NPC Online Library: Information on Levels of Environmental Noise Requisite to Protect Public Health and Welfare with an Adequate Margin of Safety",
    "title": "",
    "url": "http://www.nonoise.org/library/levels74/levels74.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00207-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 613030055,
    "recordOffset": 612909678,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{325459=In 1967, a second surveyD-15 was taken around Heathrow Airport in the same general area as the first survey. While refinements were attempted over the first survey, the results were generally the same. In 1971, the results of an intensive three year program under NASA sponsorship which studies eight air carrier airports in the United States were reported by Tracor. D-7 Since each of these efforts is discussed in detail in the references, only an analysis of their combined results is considered here. BorskyD-17 used the data from these studies to correlate annoyance with noise exposure level for people having different attitudinal characteristics and different degrees of annoyance., 153467=The measure CNEL itself is essentially the same as Ldn except for the method of treating nighttime noises. In CNEL, the 24-hour period is broken into three periods: day (0700-1900), evening (1900-2200), and night (2200-0700). Weightings of 5 dB are applied to the evening period and 10 dB to the night period. For most time distributions of aircraft noise around airports, the numerical difference between a two-period and three-period day are not significant, being of the order of several tenths of a decibel at most., 1099=The Congress included among the requirements of the Noise Control Act of 1972 a directive that the Administrator of the Environmental Protection Agency \"...develop and publish criteria with respect to noise...\" and then \"publish information on the levels of environmental noise the attainment and maintenance of which in defined areas under various conditions are requisite to protect the public health and welfare with an adequate margin of safety.\", 339693=Since 1950 recommendations by a number of authors, as well as national standards, have been presented. Eighteen of these recommendations are tabulated in Table D-10. D-21 through D-38 It is encouraging to note the consistency displayed, although many of the later recommendations may be based on the recommendations of the earlier authors., 132675=The Equivalent Noise Level was introduced in 1965 in Germany as a rating specifically to evaluate the impact of aircraft noise upon the neighbors of airports. A-9 It was almost immediately recognized in Austria as appropriate for evaluating the impact of street traffic noise in dwellings A-10 and in schoolrooms. A-11 It has been embodied in the National Test Standards of both East Germany A-12 and West Germany A-13 for rating the subjective effects of fluctuating noises of all kinds, such as from street and road traffic, rail traffic, canal and river ship traffic, aircraft, industrial operations (including the noise from individual machines), sports stadiums, playgrounds, etc. It is the rating used in both the East German A-14 and West German A-15 standard guidelines for city planning. It was the rating that proved to correlate best with subjective response in the large Swedish traffic noise survey of 1966-67. It has come into such general use in Sweden for rating noise exposure that commercial instrumentation is currently available for measuring Leq directly; the lightweight unit is small enough to be held in one hand and can be operated either from batteries or an electrical outlet. A-16, 183178=PERCENT CONTRIBUTION OF EACH SOURCE IDENTIFIED BY RESPONDENTS CLASSIFYING THEIR NEIGHBORHOOD AS NOISY (72% OF 1200 RESPONDENTS)B-3, 19650=2200, 151390=The effect of a nighttime weighting can also be studied indirectly by examining the correlation between noise measure and observed community response in the 55 community reaction cases presented in the EPA report to Congress of 1971.A-1 The data have a standard deviation of 3.3 dB when a 10 dB nighttime penalty is applied, but the correlation worsens (std, dev. = 4.0 dB) when no nighttime penalty is applied. However, little difference was observed among values of the weighting ranging between 8 and 12 dB. Consequently, the community reaction data support a weighting of the order of 10 dB but they cannot be utilized for determining a finer gradation. Neither do the data support \"three-period\" in preference to \"two-period\" days in assigning nondaytime noise penalties., 410808=Figure G-1. The 1968 CHABA G-1 Damage-Risk Criterion for Impulse Noise Exposure (solid lines) and a Proposed Modification (hatched lines). Peak Sound Pressure Level is Expressed as a Function of A- or B-Duration in the Range 25 Microseconds to 1 Second. G-1, 417040=Support for the extension of the equal-energy (equivalent A-weighted sound energy) concept of hearing hazard from continuous noise exposure to include impulse noise expo- sure has recently been gaining ground. G-19 At the 1970 Teddington Conference on \"Occupational Hearing Loss\", it was suggested that a unifying rule based on this concept might be drawn up to link continuous and impulse noise exposure limits in a single continuum relating A-weighted sound level to effective daily exposure duration. G-20 An empirical formula enabling the A-weighted Leq to be calculated from the peak sound pressure (ph) repetition rate in impulses per second (N) and the decay constant of the impulse envelope (k) in inverse seconds, was introduced as follows: G-21, 146433=Ln = Leq for the nighttime (2200-0700 hours)., 419433=3. If the number of similar impulses (N) experienced per day exceeds 100, reduce the permissible level by 10 dB for every tenfold increase in N (e.g., 10 dB when N = 1000, 20 dB when N = 10,000)., 285725=Activity interference due to noise is not new. The recent EPA document concerning public health and welfare criteria for noiseD-5 mentions an ordinance enacted 2500 years ago by the ancient Greek community of Sybaris, banning metal works and the keeping of, 209386=Although hearing loss for frequencies above 2000 Hz is not treated as significant by most of the existing occupational hearing damage-risk criteria, the ability to hear frequencies above 2000 Hz is important for understanding speech and other signals. Despite the traditional use of the term \"speech frequencies\" to apply to 500, 1000 and 2000 Hz, useful energy in speech sound ranges from about 200 to 6100 Hz.C-l It has been known for many years that the equal discriminability point in the speech spectrum is at about 1600 Hz. That is, frequencies above 1600 Hz are equal in importance to those below 1600 Hz for understanding speech. C-l However, there are other reasons for preserving the frequencies above 2000 Hz. Higher frequencies are important for the localization and identification of faint, high-pitched sounds in a variety of occupational and social situations. Detection of soft, relatively highfrequency sounds can be especially important in dgflance tasks, such as those which may occur in the military. In addition, good hearing for the higher frequencies is important to hear everyday occurrences such as sounds indicative of deterioration in mechanical equipment, crickets on a summer evening, bird song, and certain musical sounds. In fact, highfidelity sound reproducing equipment is often promoted on the basis of its fidelity up to 15,000 Hz, or even 30,000 Hz., 20767=Nighttime equivalent A-weighted sound level between the hours of 2200 and, 186206=number of people living in areas which are exposed to freeway and aircraft noise are taken from the EPA airport/aircraft noise report.B-4 They were based on calculated noise contours and associated populations for a few selected situations which formed the basis for extrapolation to national values. The estimates for the number of people living in areas in which the noise environment is dominated by urban traffic were developed from a surveyB-5 conducted in Summer 1973 for EPA. The survey measured the outdoor 24-hour noise environment at 100 sites located in 14 cities, including at least one city in each of the ten EPA regions. These data, supplemented with that from previous measurements at 30 additional sites, were correlated with census tract population density to obtain a general relationship between Ldn and population density. This relationship was then utilized, together with census data giving population in urban areas as a function of population density, to derive the national estimate given in Table B-2., 23223=The first requirement was completed in July, 1973, when the document \"Public Health and Welfare Criteria for Noise\" was published. The present document represents the second step. Much of the scientific material on which this document is based was drawn from the earlier \"criteria document\", while additional material was gathered from scientific publications and other sources, both from the U.S. and abroad. In addition, two review meetings were held which were attended by representatives of the Federal agencies as well as distinguished members of the professional community and representatives from industrial and environmental associations. The reviewers' suggestions, both oral and written, have received thoughtful attention, and their comments incorporated to the extent feasible and appropriate., 187277=These data on urban noise enable an estimate of the percentage urban population in terms of both noise levels and the qualitative descriptions of urban residential areas which were utilized in the Title IV EPA report to Congress in 1971.B-6, 395716=Although the workplace is a vital component of the human environment, the Environmental Protection Agency does not have jurisdiction over most occupational health and safety matters. These matters have traditionally been the responsibility of the Departments of Labor and Health, Education and Welfare. Section 6(b)(5 ) of the Occupational Safety and Health Act of 1972 specifies that the Secretary of Labor, \". . . in promulgating standards dealing with toxic materials or harmful physical agents . . . shall set the standard which most adequately assures, to the extent feasible, on the basis of the best available evidence, that no employee will suffer material impairment of health or functional capacity even if such employee has regular exposure to the hazard dealt with by such standard for the period of his working life . . . In addition to the attainment of the highest degree of health and safety protection for the employee, other considerations shall be the latest available scientific data in the field, the feasibility of the standards, and experience gained under this and other health and safety laws.\", 396855=In contrast, section 5(a)(2) of the Noise Control Act of 1972 directs EPA's Adminisrator to \"publish information on the levels of environmental noise, the attainment and maintenance of which in defined areas under various conditions are requisite to protecting the public health and welfare with an adequate margin of safety.\", 164535=Comparison of Leq with HUD Guideline Interim Standards (1390.2 Chg. 1), 120853=The response of human beings to sound depends strongly on the frequency of sound. In general, people are less sensitive to sounds of low frequency, such as 100 hertz (Hz)*, than to sounds at 1000 Hz; also at high frequencies such as 8000 Hz, sensitivity decreases. Two basic approaches to compensate for this difference in response to different frequencies are (1) to segment the sound pressure spectrum into a series of contiguous frequency bands by electrical filters so as to display the distribution of sound energy over the frequency range; or (2) to apply a weighting to the overall spectrum in such a way that the sounds at various frequencies are weighted in much the same way as the human ear hears them., 421883=Present day knowledge regarding the acceptability of sonic booms by man is based on observations from both experimental field and laboratory studies and observations of community response to actual sonic boom exposures. Individual human response to sonic boom is very complex and involves not only the physical stimulus, but various characteristics of the environment as well as the experiences, attitudes and opinions of the population exposed. G-22 One of the most comprehensive studies to date on sonic boom exposure of a large community over a relatively long period of time was the Oklahoma City study conducted in 1964. G-23, G-24 Eight sonic booms per day at a median outdoor peak overpressure level of 57.46 pascals (or 1.2 psf)* were experienced by this community over a, 405562=In 1968, Working Group 57 of CHABA prepared a damage risk criterion for gunfire noise, based essentially on the work of Coles et. al., G-6 which included procedures to allow for repetition of impulses and some of the other parameters listed above.G-1 Some modification has recently been proposed by Coles and Rice. G-7 The CHABA proposal was intended to protect 95% of the exposed population., 213350=Figure C-1 summarizes hearing levels of the general U.S. population at 4000 Hz. The data are from the Public Health Survey, (PHS) conducted in 1960-62 in the United States.C-4 Robinson'sC-5 non-noise-exposed and otologically screened population is shown for comparison. Several points should be noted., 32962=Pursuant to Section 5(a)(1), EPA developed and published on July 27, 1973, criteria, 156771=This method, currently in wide use, for making noise exposure forecasts utilizes a perceived noise level scale with additional corrections for the presence of pure tones. Two time periods are used to weight the number of flights (Galloway, W.J. and Bishop, D.E., \"Noise Exposure Forecasts: Evolution Evaluation, Extensions and Land Use Interpretations,\" FAA-NO-70-9, August 1970., 330132=In 1972, a study of urban noise was conducted primarily to evaluate motor vehicle noise for the Automobile Manufacturers Association. D-9 As part of this survey, 20 different urban-suburban residential locations not in the vicinity of airports were studied in Boston, Detroit, and Los Angeles. Noise measurements were acquired and a social survey of 1200, 411207=Figure G-1. The 1968 CHABAG-1 Damage-Risk Criterion for Impulse Noise Exposure (solid lines) and a Proposed Modification (hatched lines). Peak Sound Pressure Level is Expressed as a Function of A- or B-Duration in the Range 25 Microseconds to 1 second.G-1, 21810=The Noise Control Act of 1972 established by statutory mandate a national policy \"to promote an environment for all Americans free from noise that jeopardizes their public health and welfare\". The Act provides for a division of powers between the Federal and state and local governments, in which the primary Federal responsibility is for noise source emission control, with the states and other political subdivisions retaining rights and authorities for primary responsibility to control the use of noise sources and the levels of noise to be permitted in their environment., 322699=The first survey of about 2,000 residents in the vicinity of Heathrow airport was conducted in 1961 and reported in 1963.D-6 The survey was conducted to obtain responses of residents exposed to a wide range of aircraft flyover noise. A number of questions were used in the interviews to derive measures of degrees of reported annoyance. Two results of this survey are considered here., 406679=CHABA'S 1968 Damage-Risk Criteria (DRC) G-1 recommended limits to peak level as a function of impulse duration for a nominal exposure of l00 impulses per day at normal incidence (discussed below and shown in Figure G-1). These limits were intended to protect 95% of the people according to an implied criterion of NIPTS not exceeding 20 dB at 3 kHz or above, after 20 yrs. If 90% of the people were to be protected to a criterion of NIPTS not exceeding 5 dB at 4 kHz, it would be necessary to lower the CHABA limits by 12 dB (15 dB reduction to meet the more stringent criterion, assuming an approximately decible to decibel relationship in the range of interest [see Table G-2], less 3 dB elevation to apply the limit to the 90th percentile). This modified CHABA limit is shown in Figure G-1 by hatched lines., 124924=With respect to both simplicity and adequacy for characterizing human response, a frequency-weighted sound level should be used for the evaluation of environmental noise. Several frequency weightings have been proposed for general use in the assessment of response to noise, differing primarily in the way sounds at frequencies between 1000 and 4000 Hz are evaluated. The A-weighting, standardized in current sound level meter specifications, has been widely used for transportation and community noise description. A-1 For many noises the A-weighted sound level has been found to correlate as well with human response as more complex measures, such as the calculated perceived noise level or the loudness level derived from spectral analysis. A-2 However, psychoacoustic research indicates that, at least for some noise signals, a different frequency weighting which increases the sensitivity to the 1000-4000 Hz region is more reliable. A-3 various forms of this alternative weighting function have been proposed; they will be referred to here as the type \"D-weightings\". None of these alternative weightings has progressed in acceptance to the point where a standard has been approved for commercially available instrumentation., 163825=Nn = total number of events during the period 2200 to 0700, 415357=Certain combinations of impulsive and continuous noise, such as occur in industry may be antagonistic-that is, one may provide some protection from the other-probably because of acoustic reflex activation. Other studies, however, show that the effects of combined impulse and steady noise are additive.G-2, G-16 ISO, in its Recommendation R/1999,G-17 proposed a flat weighting of 10 dB for \"impulsiveness\" in distributed noise, but the validity of this rule is questionable. On present evidence, it is probably safest to, 337727=of Knudsen and Harris D-21 in 1950. It is of interest to quote from the text to understand the reasoning used to develop the recommended levels:, 115849=SOUND LEVEL. The quantity in decibels measured by a sound level meter satisfying the requirements of American National Standards Specification for Sound Level Meters Sl.4-1971. Sound level is the frequency-weighted sound pressure level obtained with the standardized dynamic characteristic \"fast\" or \"slow\" and weighting A, B, or C; unless indicated otherwise, the A-weighting is understood. The unit of any sound level is the decibel, having the unit symbol dB., 2248=Given the foregoing, EPA has sought to provide information on the levels of noise requisite to protect public health and welfare with an adequate margin of safety. The information presented is based on analyses, extrapolations and evaluations of the present state of scientific knowledge. This approach is not unusual or different from that used for other environmental stressors and pollutants. As pointed out in \"Air Quality Criteria\"-Staff Report, Subcommittee on Air and Water Pollution, Committee on Public Works, U-S. Senate, July, 1968,, 163706=Nd = total number of events during the period 0700 to 2200, 228568=1. Leq (8) of 84 dB will cause no more than a 5 dB shift at the critical percentile for the averaged frequencies 500, 1000 and 2000 Hz., 227476=A similar analysis can be made for 5 dB and 10 dB NIPTS at the mid frequencies (Figure C-4). The upper PHS curve represents the better ear data for the average of 500, 1000 and 2000 Hz of both men and women from the Public Health Survey.C-4 Both men and women are used since there is little difference due to sex and hearing levels for these frequencies. Considering that the curves will merge in the same manner as the 5 dB at 4000 Hz NIPTS and PHS curves, one can conclude that:, 181197=The dominant sources for outdoor noise in urban residential areas are motor vehicles, aircraft and voices. This conclusion has been found in several studies, including a recent survey B-1 of 1200 people which is summarized in Table B-1., 306462=Correction for these factors were initially made in 5 dB intervals since the magnitudes of many of the corrections were based solely on the intuition of the authors, and it was considered difficult to assess the response to any greater degree of accuracy. D-11-13 This model was incorporated in the first Air Force Land Use Planning GuideD-14 in 1957 and was later simplified for ease of application by the Air Force and the Federal Aviation Administration., 131793=The concept of Equivalent Sound Level was developed in both the United States and Germany over a period of years. Equivalent level was used in the 1957 original Air Force Planning Guide for noise from aircraft operations, A-6 as well as in the 1955 report A-7 on criteria for short-time exposure of personnel to high intensity jet aircraft noise, which was the forerunner of the 1956 Air Force Regulation A-8 on \"Hazardous Noise Exposure\". A more recent application is the development of CNEL (Community Noise Equivalent Level) measure for describing the noise environment of airports. This measure, contained in the Noise Standards, Title 4, Subchapter 6, of the California Administrative Code (1970) is based upon a summation of Leq over a 24-hour period with weightings for exposure during evening and night periods, 111723=ENVIRONMENTAL NOISE. By Sec 3(11) of the Noise Control Act of 1972, the term \"environmental noise\" means the intensity, duration, and character of sounds from all sources., 341019=Knudsen-Harris 1950 1 dB(A), 111161=Note: This is defined for medical and cognate purposes as the hearing threshold level for speech or the average hearing threshold level for pure tones of 500, 1000 and 2000 Hz in excess of 92 dB., 168997=Comparison of Leq with Federal Highway Administration Noise Standards, PPM 90-2, February 8, 1973, 412211=TTS (and, by inference, NIPTS) grows linearly with the number of impulses in a series, or linearly with time when the rate of impulses is constant. G-8 CHABA G-1 recommended an allowance of -5 dB for every tenfold increase in number of impulses in a daily exposure (Figure G-2). Recently, Coles and Rice G-7 have contended that this rule is underprotective for large numbers (N) of impulses and have recommended a modification (see Figure G-2). In 1973, McRobert and Ward G-3 questioned this modification, maintaining that it is probably grossly overprotective for N>1000, and commented also on the CHABA rule in the light of recent experiments. Figure G-2 reproduces a comparison by McRobert and Ward of the CHABA rule with Coles and Rice G-7 and an \"equal-energy\" rule (10 dB weighting for each tenfold increase in N) originating at N = 100., 44276=The definition of \"environmental noise\" is provided in Section 3(11) of the Noise Control Act of 1972. \"The term 'environmental noise' means the intensity, duration, and the character of sounds from all sources.\" As discussed earlier, it is the intent of Congress that a simple, uniform measure of noise be developed. Not all information contained in the noise environment can be easily considered and analyzed. Instead, for practical purposes, it needs to be condensed to result in one indicator of the environmental quantity and quality of noise, which correlates with the overall long-term effects of noise on public health and welfare., 224595=A study of the data provides a basis for a reasonable estimate of this critical percentile. Baughn's data gives an indication that the population with a hearing level greater than 60 dB after a 40-year exposure begins to become less affected by noise (Figures 9, 10, and 11 of ref. C-2). For example, if a person has a hearing loss greater than 75 dB, it is not reasonable to expect that an A-weighted noise of 75 dB (which normally means that only a level of 65 dB would be present at the octave band centered at 4000 Hz) will cause a further increase of the 75 dB loss. Next, it is necessary to determine the distribution of hearing levels of the non-noise-exposed population at age 60. The best data available are the hearing levels of 60 year-old women of the 1960-62 Public Health Survey,C-4 While certainly some of the women in the sample may be noise exposed, the noise exposure of that population sample can be considered minor as compared to the apparent noise exposure of men. The data from the Public Health Survey predict the percentage of the population with hearing levels above 70, 75, and 80 dB., 154918=The original method for evaluating land use around civil airports is the composite noise rating (CNR). It is still in wide use by the Federal Aviation Administration and the Department of Defense for evaluating land use around airfields (Civil Engineering Planning and Programming, \"Land Use Planning with Respect to Aircraft Noise,\" AFM 86-5, TM 5-365, NAVDOCKS P-98, October 1, 1964). This noise exposure scale may be expressed as follows:, 228724=2. Leq(8) dB will cause no more than a 10 dB shift at the most critical percentile for the averaged )requencies 500, 1000 and 2000 Hz., 161279== total number and average number per hour, respectively, of flights during the period 0700 to 1900, 208621=The levels identified in this document for hearing conservation purposes are those which have been shown to provide protection from any measurable degradation of hearing acuity. This protection is prodded even for those portions of the hearing mechanism which respond to the audiometric frequency at which noise-induced hearing impairment first occurs, namely 4000 Hz. The definition of hearing handicap originated by the American Academy of Opthalmology and Otolaryngology (AA00), and currently incorporated in many hearing damage-risk criteria, is somewhat different from the definition used in this document. Hearing handicap, (and later, hearing impairment) was defined by a formula which used the average hearing level at 500 Hz, 1000 Hz and 2000 Hz., 34461=The need for such action was the subject of considerable Congressional interest in the hearings on the various noise control bills, which finally resulted in enactment of the Noise Control Act of 1972. The concept underlying this present document can be better appreciated from the following pertinent elements of the legislative history of the Act., 161494== total number and average number per hour, respectively, of flights during the period 1900 to 2200, 251=MARCH 1974, 291684=A recent studyD-9 in the USA found that 46% of the 1200 respondents were annoyed by surface vehicle noise at some time. Activities which were reported disturbed are indicated by percentages shown in Table D-6. Here we see that sleeping is the activity most disturbed by surface vehicle noise, followed in order by listening to TV, radio orrecordings; mental activity, such as reading, writing or thinking; driving; conversing; resting and walking., 340848=August 10, 1973, 161736== total number and average number per hour, respectively, of flights during the period 2200 to 0700, 146320=Ld = Leq for the daytime (0700-2200 hours), 114541=OCCUPATIONAL EXPOSURE TO ENVIRONMENTAL NOISE. The noise exposure of an individual defined under Pi. 91-596, Occupational Safety and Health Act of 1970.}",
    "lastModified": "Wed, 08 Feb 2012 18:18:55 GMT",
    "textBeforeTable": "(see Table 4 for a detailed description) SUMMARY OF NOISE LEVELS IDENTIFIED AS REQUISITE TO PROTECT PUBLIC HEALTH AND WELFARE WITH AN ADEQUATE MARGIN OF SAFETY Table 1 Table of Contents NPC Online Library NPC Law Library NPC Noise News NPC Home 2 b. Of the various kinds of activity interference, speech interference is the one that is most readily quantifiable. a. Annoyance due to noise, as measured by community surveys, is the consequence of activity interference. 4. To identify levels requisite to protect against activity interference (see Appendix D): b. The TTS Hypothesis a. The Equal Energy Hypothesis 3. To correct for intermittence and duration in identifying the appropriate level to protect against hearing loss (also, see Appendix C): d. Protecting the population up to a critical percentile (ranked according to decreasing ability to hear) will also protect those above that percentile, (in view of consideration 2c above) thereby protecting virtually the entire population. c. One cannot be damaged by sounds considered normally audible, which one cannot hear. b. Changes in hearing level of less than 5 dB are generally not considered noticeable or significant. a. The human ear, when damaged by noise, is typically affected first at the audiometric frequency of 4000 Hz. 2. To protect against hearing impairment (see Appendix C): 1. In order to describe the effects of environmental noise in a simple, uniform and",
    "textAfterTable": "Indoor residential areas Leq(24) =< 45 dB Other indoor areas with human activities such as schools, etc. Explanation of Table 1: 1. Detailed discussions of the terms Ldn and Leq appear later in the document. Briefly, Leq(24) represents the sound energy averaged over a 24-hour period while Ldn represents the Leq with a 10 dB nighttime weighting. 2. The hearing loss level identified here represents annual averages of the daily level over a period of forty years. (These are energy averages, not to be confused with arithmetic averages.) 3. Relationship of an Leq(24) of 70 dB to higher exposure levels. EPA has determined that for purposes of hearing conservation alone, a level which is protective of that segment of the population at or below the 96th percentile will protect virtually the entire population. This level has been calculated to be an Leq of 70 dB over a 24-hour day. 3 Table of Contents NPC Online Library NPC Law Library NPC Noise News NPC Home Given this quantity, it is possible to calculate levels which, when averaged over given durations shorter than 24 hours, result in equivalent amounts of energy. For example, the energy contained in an 8-hour exposure to 75 dB is equivalent to the energy contained in a 24-hour exposure to 70 dB. For practical purposes, the former exposure is only equivalent to the",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}