{
    "relation": [
        [
            "Unlockable",
            "AntiNavi M",
            "Anubis A",
            "BlakWing W",
            "BlizzardMan B",
            "BlizzardManSP B",
            "CloudMan C",
            "CloudMan DS C",
            "CloudMan SP C",
            "CosmoMan C",
            "CosmoMan DS C",
            "CosmoMan SP C",
            "Fullcust *",
            "Muramasa M",
            "ProtoMan B/Colonel C",
            "ShadeMan DS S",
            "ShadeMan S",
            "ShadeMan SP S",
            "Z Saber Z"
        ],
        [
            "How to Unlock",
            "Beat Mission 4 in 9 - 10",
            "Beat Mission 9 in 14 or less",
            "Beat Mission 7 in 10 or less",
            "Beat Mission 1 in 6 - 7",
            "Beat Mission 1 in 5 or less",
            "Beat Mission 3 in 8 - 9",
            "Beat Mission 8 in 13 - 14",
            "Beat Mission 3 in 7 or less",
            "Beat Mission 5 in 8 - 9",
            "Beat Mission 9 in 15 - 16",
            "Beat Mission 5 in 7 or less",
            "Beat Mission 4 in 8 or less",
            "Beat Mission 8 in 12 or less",
            "Beat Mission 6 in 9 - 10",
            "Beat Mission 7 in 11 - 12",
            "Beat Mission 2 in 8 - 9",
            "Beat Mission 2 in 7 or less",
            "Beat Mission 6 in 8 or less"
        ]
    ],
    "pageTitle": "Mega Man Battle Network 5: Double Team Cheats, Codes, and Secrets for DS - GameFAQs",
    "title": "",
    "url": "http://www.gamefaqs.com/ds/928331-mega-man-battle-network-5-double-team/cheats?mob_on=1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 462325083,
    "recordOffset": 462304049,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{97088=Easy to Learn, Fun to Play: Entertaining games help you learn Japanese words, grammar, and sentence structure, while ..., 100988=© 2015 CBS Interactive Inc. All rights reserved.SitemapAdvertisePrivacy PolicyAd ChoiceTerms of Use, 73874=Contributed By: Dark Isaac, timhk2004, Nigoli, mario753, and dinobotmaximized., 20016=Because this game can't link to Boktai 2 to earn Crossover Points, this new system was created to give them to you. By Slotting in Boktai 1, 2 or 3, the Samurai Statue in GargoyleCastle turns into an Otenko Statue, and the 100 Warrior wacking minigame turns into a 1000 bat wacking minigame for crossover points. Also, an Zoktai trader appears in Oran Area 2 to exchange your Crossover Points for chips, 58894=A easy way to make Zenny is during or after Cosmoman's liberation mission. Get NumberMan to search the 3 item panels straight ahead of the start point. You should get 1800 Zenny. Retreat and restart the mission. The item panels will be back, along with the 1800 Zenny. Repeat until you have all the zenny you need., 90426=After winning the End Area 5 Liberation Mission, there will be a gold Mr. Prog there who will recreate the battle. Talk to him and start the battle. Send a Navi to liberate the first item square and you should obtain 1800 Zennys. Next, retreat. You will leave the battle, however you will keep the 1800 Zennys. Repeat as many times as you want for more Zennys., 50389=Contributed By: Nigoli and timhk2004., 86708=Contributed By: bookofmoon2000 and timhk2004.}",
    "textBeforeTable": "Highlight the corresponding program from the list and hold down the right button. Then push the following buttons to compress them by one block. To uncompress them, just repeat the above process again. Navi Customizer Compression Codes Codes }); $('.content_nav_wrap').toggleClass('content_nav_open'); $('#js_content_nav_toggle').click(function(){",
    "textAfterTable": "Giga Virus BBRALBLARR Hub Batch ALRABLRALR Humor ABLARABLRL Jungle LRLABLBBLA Mega Folder +2 LABBLBAALL Mega Folder+1 BBABBRRLAR Mega Virus AABLARBLAA Millions RLRARRLLLR Oil Body LBRARLABLB Reflect LLRBLLAALB Rush RBLRBRLLRL Shield ABARALRBBA Sneak Run RLLALLBABB Speed MAX RARLLRRABA Super Armor RABRALLRBA Tango LBLABLABAL Undershirt ARBBRLRALA Contributed By: RandyPandy. 2 0 Numberman Codes DS Exclusive Go to the numberman machine in Higsby's shop when it is placed there and enter the passwords to get your prize. These codes can only be used for the DS Version, they can't work on the GBA Versions. Effect Code Area Steal * 99428938 Dark Recovery * 91182599 DoroTsunamiBall * 78234329 Leaders Raid L 01285874 Lord of Chaos X 39285712 MagmaSeed * 29387483 NumberBall * 64836563 P. Battle Pack 1 22323856 P. Battle Pack 2 66426428 P.Attack+3 76820385 P.Chip+50 48582829 P.HP+100 28475692 P.HP+50 53891756 Super Kitakaze * 29486933",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}