{
    "relation": [
        [
            "Name",
            "class_idx",
            "proto_idx",
            "name_idx"
        ],
        [
            "Format",
            "ushort",
            "ushort",
            "uint"
        ],
        [
            "Description",
            "index into the type_ids list for the definer of this method. This must be a class or array type, and not a primitive type.",
            "index into the proto_ids list for the prototype of this method",
            "index into the string_ids list for the name of this method. The string must conform to the syntax for MemberName, defined above."
        ]
    ],
    "pageTitle": "Dalvik Executable format | Android Open Source Project",
    "title": "",
    "url": "http://source.android.com/devices/tech/dalvik/dex-format.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00278-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 230202871,
    "recordOffset": 230179491,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{9251=Note: At least a couple earlier versions of the format have been used in widely-available public software releases. For example, version 009 was used for the M3 releases of the Android platform (November–December 2007), and version 013 was used for the M5 releases of the Android platform (February–March 2008). In several respects, these earlier versions of the format differ significantly from the version described in this document.}",
    "lastModified": "Mon, 01 Jun 2015 22:45:00 GMT",
    "textBeforeTable": "File layout 16255 16256 -128 80 7f 126 127 -1 7f 0 1 1 01 -1 0 0 00 As uleb128p1 As uleb128 As sleb128 Encoded Sequence Here are some examples of the formats: The variant uleb128p1 is used to represent a signed value, where the representation is of the value plus one encoded as a uleb128. This makes the encoding of -1 (alternatively thought of as the unsigned value 0xffffffff) — but no other negative number — a single byte, and is useful in exactly those cases where the represented number must either be non-negative or -1 (or 0xffffffff), and where no other negative values are allowed (or where large unsigned values are unlikely to be needed). bit7 bit8 bit9 bit10 bit11 bit12 bit13 0 bit0 bit1 bit2 bit3 bit4 bit5 bit6 1 Second byte First byte Bitwise diagram of a two-byte LEB128 value Each LEB128 encoded value consists of one to five bytes, which together represent a single 32-bit value. Each byte has its most significant bit set except for the final byte in the sequence, which has its most significant bit clear. The remaining seven bits of each byte are payload, with the least significant seven bits of the quantity in the first byte, the next seven in",
    "textAfterTable": "proto_ids proto_id_item[] method prototype identifiers list. These are identifiers for all prototypes referred to by this file. This list must be sorted in return-type (by type_id index) major order, and then by arguments (also by type_id index). The list must not contain any duplicate entries. field_ids field_id_item[] field identifiers list. These are identifiers for all fields referred to by this file, whether defined in the file or not. This list must be sorted, where the defining type (by type_id index) is the major order, field name (by string_id index) is the intermediate order, and type (by type_id index) is the minor order. The list must not contain any duplicate entries. method_ids method_id_item[] method identifiers list. These are identifiers for all methods referred to by this file, whether defined in the file or not. This list must be sorted, where the defining type (by type_id index) is the major order, method name (by string_id index) is the intermediate order, and method prototype (by proto_id index) is the minor order. The list must not contain any duplicate entries. class_defs class_def_item[] class definitions list. The classes must be ordered such that a given class's superclass and implemented interfaces appear in the list earlier than the referring class. Furthermore, it is invalid for a definition for the same-named class to appear more than once in the list. data ubyte[] data area, containing all the support data for the tables listed above. Different",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}