{
    "relation": [
        [
            "Patent application number",
            "20100107237",
            "20120072492"
        ],
        [
            "Description",
            "COMMUNICATION SYSTEM, RELIABLE COMMUNICATION MECHANISM, AND COMMUNICATION METHOD USED FOR THE SAME - Provided is a communication system capable of fundamentally preventing an attack from an unspecified counterpart and resolve problem even when a problem occurs in a user terminal or client and a server. A mediation server (",
            "BROWSING INFORMATION GATHERING SYSTEM, BROWSING INFORMATION GATHERING METHOD, SERVER, AND RECORDING MEDIUM - When a client transmits an HTML request to a server (step S"
        ],
        [
            "Published",
            "04-29-2010",
            "03-22-2012"
        ]
    ],
    "pageTitle": "Shigeyoshi - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/shigeyoshi-7/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00199-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 430225121,
    "recordOffset": 430209466,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Shigeyoshi Shima, Minato-Ku JP 01-21-2010 Assembling structure of a plated resin article - The invention prevents an assembling structure of the plated resin article from generation of squeak noise with suppressing increase in costs. The assembling structure includes a first member including a first resin molded article at least a first surface of which is coated by a coating film; and a second member including a second resin molded article at least a second surface of which is plated by a plating film. The first member and the second member are assembled so as to frictionally contact at the coating of the first surface and the plating film of the second surface; and the coating film includes a particle made from a fluorine resin. The generation of squeak noise can be suppressed with maintaining the physical properties of the coating film, such as gloss and re-coating ability. 20100015434 Published Description Patent application number Shigeyoshi Setsuda, Aichi-Ken JP 07-25-2013 ROTATING ELECTRICAL MACHINE - In a rotating electrical machine of axial-gap type in which a stator and a rotor are opposed to each other in arrangement and winding axis is parallel with a rotating shaft direction, the stator has an “m” protruding in the rotating shaft direction are distributed along a circumferential direction thereof, in which the winding pole is formed of a magnetic member having a plurality of teeth in a circular-arc shape in a diameter",
    "textAfterTable": "Shigeyoshi Takasawa, Cheshire GB Patent application number Description Published 20090049658 Readily Burstable Slide Fastener - A readily burstable slide fastener 02-26-2009 Shigeyoshi Takasawa, Anaheim, CA US Patent application number Description Published 20120011684 READILY BURSTABLE SLIDE FASTENER - A readily burstable slide fastener 01-19-2012 Shigeyoshi Tanaka, Wakayama JP Patent application number Description Published 20090171124 PROCESS FOR PRODUCING ALPHA, BETA-UNSATURATED ALDEHYDE COMPOUNDS - The present invention relates to processes for producing α,β-unsaturated aldehyde compounds and unsaturated alcohols with a good yield. There is provided a process for producing and α,β-unsaturated aldehyde compound including the step of subjecting a raw aldehyde compound to an intermolecular condensation reaction in the presence of an amine and a protonic acid having 4 to 20 carbon atoms or a salt thereof; and a process for producing an unsaturated alcohol including the step of subjecting the α,β-unsaturated aldehyde compound to a reduction reaction. 07-02-2009 Patent applications by Shigeyoshi Tanaka, Wakayama JP Shigeyoshi Tanaka, Oume-Shi JP Patent application number Description Published 20110004725 DATA STORAGE DEVICE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}