{
    "relation": [
        [
            "Patent application number",
            "20080219981",
            "20080227705",
            "20090275059",
            "20100196928"
        ],
        [
            "Description",
            "Diagnostic Kit for Solid Cancer and Medicament for Solid Cancer Therapy - The present invention provides novel solid cancer antigenic proteins, and diagnostic kits for solid cancer and therapeutic agents for solid cancer based on the antigenic proteins. Specifically, the present invention provides a human solid cancer antigenic polypeptide having an amino acid sequence selected from the group consisting of SEQ ID NOS: 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 48, 50, 52, 54, 56, 59, 61, 63, 65, 67, 69, 71, 73, and 75.",
            "Apoptosis-inducing agent and method for inducing apoptosis - An object of the present invention is to provide a novel means for stably and surely inducing cell apoptosis using the c-myc gene as a target. The present invention relates to an apoptosis-inducing agent containing a protein that interacts with an FBP protein or a polynucleotide encoding the protein as an active ingredient and a method for inducing apoptosis, which comprises a step of causing the apoptosis-inducing agent to come into contact with cells.",
            "Marker proteins for diagnosing liver disease and method of diagnosing liver disease using the same - Using the protein chip technology, biological samples such as sera are subjected to proteome analysis. Thus, a protein which is a human fibrinogen α-E chain decomposition product and has a molecular weight of 5,900, a protein which is an apolipoprotein AII decomposition product and has a molecular weight of 7,800, and a protein which is an apolipoprotein AI decomposition product and has a molecular weight of 28,000, each showing an increase or a decrease with the habit of drinking, are newly found out. By detecting or quantifying these proteins, a liver disease in a subject such as one having a problem of drinking can be diagnosed at the early stage.",
            "Gene specific to cancer and diagnosis kit using the same - The present invention provides a new additional identification of a gene related to cancer expression and a diagnostic kit using the same."
        ],
        [
            "Published",
            "09-11-2008",
            "09-18-2008",
            "11-05-2009",
            "08-05-2010"
        ]
    ],
    "pageTitle": "Tomonaga, JP - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/tomonaga-jp-5/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00017-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 445386291,
    "recordOffset": 445366971,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Takeshi Tomonaga, Chiba JP 10-06-2011 ROTARY ELECTRIC MACHINE - A rotary electric machine configured with a stator, rotor, and permanent magnets disposed in an inverted V-shape that becomes gradually narrower from a side of a center of rotation of the rotor. The rotor is provided with a plurality of support portions that extend radially about the center of rotation, and gap portions are respectively formed in correspondence with the plurality of support portions at positions spaced by a predetermined distance from an edge portion of the permanent magnets in a flowing direction of magnetic flux between the permanent magnets and the stator. The gap portions are formed to have such a length that causes magnetic saturation during generation of low torque in a low-current state and that causes no magnetic saturation during generation of maximum torque in a high-current state in which electricity at a high current is supplied to the stator coil. 20110241468 Published Description Patent application number Takeshi Tomonaga, Toyota JP 11-08-2012 METHOD FOR MANUFACTURING PRINTED WIRING BOARD - Quickly making changes to etching conditions suppresses the production yield of printed wiring boards from being deteriorated. Disclosed is a method comprising: an etching step that comprises: preparing a conductor-clad base material continuous in a certain direction, the conductor-clad base material ( 20120279050 Published Description Patent application number Takaomi Tomonaga, Sakura-Shi JP 12-23-2010",
    "textAfterTable": "Patent applications by Takeshi Tomonaga, Chiba JP Takeshi Tomonaga, Chiba-Shi JP Patent application number Description Published 20100330554 DIAGNOSTIC KIT FOR SOLID CANCER AND MEDICAMENT FOR SOLID CANCER THERAPY - The present invention provides novel solid cancer antigenic proteins, and diagnostic kits for solid cancer and therapeutic agents for solid cancer based on the antigenic proteins. Specifically, the present invention provides a human solid cancer antigenic polypeptide having an amino acid sequence selected from the group consisting of SEQ ID NOS: 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 48, 50, 52, 54, 56, 59, 61, 63, 65, 67, 69, 71, 73, and 75. 12-30-2010 Tsuneaki Tomonaga, Kanagawa JP Patent application number Description Published 20090120352 Semiconductor Single Crystal Manufacturing Device and Manufacturing Method - In order to provide a semiconductor single crystal manufacturing device and a manufacturing method using a CZ method wherein the resistivity and oxygen concentration of a silicon single crystal can be controlled and wherein a single crystal yield can be improved, in the present invention, there is provided a wall 05-14-2009",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}