{
    "relation": [
        [
            "Payment method",
            "",
            "Bank Deposit"
        ],
        [
            "Preferred/Accepted",
            "Accepted",
            "Accepted"
        ],
        [
            "",
            "",
            ""
        ]
    ],
    "pageTitle": "Elvis Presley 110x80cm Memorabilia Signed Frame Limited Edtn 499 | eBay",
    "title": "",
    "url": "http://www.ebay.com.au/itm/ELVIS-PRESLEY-110X80CM-MEMORABILIA-SIGNED-FRAME-LIMITED-EDTN-499-/170775119805?pt=AU_MusicMemorabilia&hash=item27c2fd87bd",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00092-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 412363655,
    "recordOffset": 412316134,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{59970=                                1935  - 1977}",
    "textBeforeTable": "Payment details returns - opens in a new window or tab. Refunds by law: In Australia, consumers have a legal right to obtain a refund from a business for goods purchased if the goods are faulty, not fit for purpose or don't match description. More information at Acceptable only when the item received isn't as per description. An email with some photos taken of the item must be sent to the seller for a consent,prior to sending back. Thanks for understanding. Return policy details The buyer is responsible for return postage costs. Exchange 7 days after the buyer receives it Refund will be given as Item must be returned within Return policy",
    "textAfterTable": "Seller's payment instructions Thanks for your purchase!! The payment for this item is expected within 3 working days upon completion of purchase. Should there be any problem, please contact us upon check out. We accept Bank transfer/deposit (preferred), or alternatively via Paypal. Thanks again. Current bid amount + + import charges (shown at checkout) time left ##2## left | Bid Count",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}