{
    "relation": [
        [
            "Pos.",
            "G",
            "G",
            "G",
            "F",
            "F"
        ],
        [
            "#",
            "23",
            "5",
            "11",
            "35",
            "25"
        ],
        [
            "Player",
            "Tim Frazier",
            "Matt Glover",
            "Jermaine Marshall",
            "Billy Oliver",
            "Jon Graham"
        ],
        [
            "Ht",
            "6-1",
            "6-4",
            "6-4",
            "6-8",
            "6-8"
        ],
        [
            "Wt",
            "170",
            "210",
            "200",
            "230",
            "240"
        ],
        [
            "Year",
            "Junior",
            "Sophomore",
            "Sophomore",
            "Junior",
            "Freshman"
        ],
        [
            "Home",
            "Houston, Tex.",
            "Orange, Calif.",
            "Etters, Pa.",
            "Chatham, NJ",
            "Baltimore, Md."
        ],
        [
            "PPG",
            "17.1",
            "3.3",
            "9.8",
            "7.8",
            "3.2"
        ],
        [
            "Other",
            "6.8 apg",
            "4.6 rpg",
            "3.8 rpg",
            "3.8 rpg",
            "3.3 rpg"
        ]
    ],
    "pageTitle": "Peegs.com - Suddenly dangerous Lions host Hoosiers at noon today",
    "title": "",
    "url": "https://indiana.rivals.com/content.asp?CID=1316159&PT=4&PR=2",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00077-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 836714491,
    "recordOffset": 836698891,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1946=Rivals.com is your source for: College Football | Football Recruiting | College Basketball | Basketball Recruiting | College Baseball | High School | College Merchandise Site-specific editorial/photos © 2006 Peegs.com. All rights reserved. This website is an officially and independently operated source of news and information not affiliated with any school or team. About | Advertise with Us | Contact | Privacy Policy | About our Ads | Terms of Service | Copyright/IP policy | Yahoo! Sports - NBC Sports Network Statistical information ©2014 STATS LLC All Rights Reserved.}",
    "TableContextTimeStampAfterTable": "{43962=January 8, 2012, 58800=Top 10 upsets: A November to remember}",
    "textBeforeTable": "Starters: Expected starters and key reserves: For more on the Nittany Lions, check out the Hoosier Game Day page. \"Going on the road and getting the wins early in the season has helped this team tremendously,\" said Jordan Hulls. \"We know the mentality you have to take if you are going to win on the road,\" said Victor Oladipo. The Hoosiers players are confident in being prepared for that first road league victory today. \"As I said before, a defining moment for our team this year was our win at Evansville,\" said Crean. \"Our approach was outstanding and we have built off that experience which has allowed us to play pretty well away from Assembly Hall.\" The Hoosiers have won twice on the road but fell at Michigan State in their only conference game away from Assembly Hall. \"Coach Chambers' teams get after it every possession and you can see that they play really well together,\" said Crean. \"They have a number of guys who are playing bigger roles and they are responding to the challenge.\" The Purdue win moved Penn State to 1-2 in conference and 9-7 overall. Other major conference wins for the Lions before this week included an ACC/Big Ten Challenge victory over Boston College (62-54) and a neutral court 53-49 win over South Florida of the Big East. \"Tim Frazier is playing as well as anyone in the league and he does a great job of getting in the lane as he looks to score",
    "textAfterTable": "Key reserves: Pos. # Player Ht Wt Year Home PPG Other G 24 Cameron Woodyard 6-5 210 Senior Westminster, Md. 8.2 4.5 rpg G 3 Trey Lewis 6-1 180 Freshman Garfield Heights, Oh 5.7 1.5 rpg F 20 Sasa Borovnjak 6-9 240 Sophomore Belgrade, Serbia 5.4 3.9 rpg Talk about it in the Indiana Message Boards FEATURED PRODUCT Mens Indiana Hoosiers adidas Crimson/White Authentic On-Court Candy Striped Warm-Up Tear Away Pants",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}