{
    "relation": [
        [
            "Patent application number",
            "20100017564",
            "20100302664",
            "20140122747"
        ],
        [
            "Description",
            "CONTROLLER, DATA STORAGE DEVICE, AND DATA COMMUNICATION SYSTEM HAVING VARIABLE COMMUNICATION SPEED - A main controller for use within a data storage device including a first data storage device and a second data storage device is disclosed. The controller includes a memory configured to store a plurality of protocol program data, and a processor configured to receive a host control signal from a host defining a primary operation, and to execute protocol program data selected from the plurality of protocol program data to define a first data communication protocol in accordance with the received host control signal. The processor is further configured to electrically store data in the first data storage device or magnetically store the data in the second data storage device during a secondary operation associated with the first operation, wherein the data is communicated from the processor to the first data storage device or the second data storage device during the secondary operation using a second.",
            "DISK DRIVE DATA STORAGE SYSTEMS AND METHODS USING BACKUP POWER SOURCE CHARGED BY SPINDLE MOTOR - A data storage system includes data storage including at least one data storage disk driven by a spindle motor and a control circuit coupled to the data storage and configured to be coupled to a main power source and a backup power source. The control circuit is configured to detect failure of the main power source, to responsively write data to the data storage while powered by the backup power source, and to subsequently recharge the backup power source using the spindle motor. The control circuit may be configured to further write data to the data storage using the recharged backup power source. The data storage system may further include a head configured to read and/or write data to or from the at least one data storage disk, and the control circuit may be configured to park the head using the recharged backup power source.",
            "CONTROLLER, DATA STORAGE DEVICE, AND DATA COMMUNICATION SYSTEM HAVING VARIABLE COMMUNICATION SPEED - Apparatuses having variable communication speeds are disclose. In one example, an apparatus may comprise a controller configured to: receive a signal from a host, the signal being compatible with a data communication protocol at a first data communication speed; selectively implement a first data communication protocol from a plurality of data communication protocols to communicate with a first memory or implement a second data communication protocol from the plurality of data communication protocols to communicate with a second memory based on the data communication speed; store data in the first memory via the first data communication protocol when the data communication speed is a first speed; and store data in the second memory via the second data communication protocol when the data communication speed is a second speed that is different than the first speed."
        ],
        [
            "Published",
            "01-21-2010",
            "12-02-2010",
            "05-01-2014"
        ]
    ],
    "pageTitle": "Heo, Seoul - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/heo-seoul-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435651164,
    "recordOffset": 435609824,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{72703=Patent applications by June Seok Heo, Seoul KR, 67545=Patent applications by Jun Heo, Seoul KR, 105098=Patent applications by Seong-Jun Heo, Seoul KR}",
    "textBeforeTable": "Keun Heo, Seoul KR 03-18-2010 Query Expansion Method Using Augmented Terms for Improving Precision Without Degrading Recall - A query expansion method that improves the precision without degrading the recall, uses augmented terms. The method steps expand an initial query by adding new terms that are related to each term of the initial query. The query is further expanded by adding augmented terms, which are conjunctions of the terms. A weight is assigned to each term so that the augmented terms have higher weights than the other terms. 20100070506 Published Description Patent application number Jun Seok Heo, Seoul KR //]]> BarDraw('3572505',['Patent applications by Jung-Shik Heo, Seoul KR'],[[1,2,1,2]],['2008','2011','2012','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3572505\" align=\"center\"></div> </div> <canvas id=\"bg3572505\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by Jung-Shik Heo, Seoul KR</p> <div class=\"bar3572505\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody> </tr> <td>11-14-2013</td> <td><a href=\"/patents/app/20130302964\">SEMICONDUCTOR DEVICE AND METHOD OF FABRICATING THE SAME</a> - A semiconductor device may include a first insulating layer disposed on a substrate, a gate electrode disposed on the first insulating layer, and a second insulating layer disposed on the gate electrode and the first insulating layer. The second insulating layer includes a first discharge site.</td> <td>20130302964</td> <tr> </tr> <td>07-04-2013</td> <td><a href=\"/patents/app/20130171793\">METHODS OF FORMING SEMICONDUCTOR DEVICES USING ELECTROLYZED SULFURIC ACID (ESA)</a> - A method of forming a semiconductor device may include forming a metal layer on a silicon portion",
    "textAfterTable": "Keunjae Heo, Seoul KR Patent application number Description Published 20110107226 MOBILE TERMINAL AND METHOD OF PROVIDING INFORMATION USING THE SAME - A mobile terminal including a display unit configured to display information; a wireless Internet module configured to wirelessly access the Internet; and a controller configured to display an Internet access history including web page images of captured web pages previously accessed through the wireless Internet module in a first area of the display unit, to group the web page images by categories, and to display the grouped web page images in the first area. 05-05-2011 20120060089 METHOD FOR PROVIDING USER INTERFACE BASED ON MULTIPLE DISPLAYS AND MOBILE TERMINAL USING THE SAME - Disclosed is a user interface, and particularly, to a method for providing a user interface based on multiple displays and a mobile terminal using the same. The method for providing a user interface of a mobile terminal comprises controlling transparency of a first display unit, controlling the first display unit to display a first screen, controlling a second display unit to display a second screen, and controlling the second display unit to display one or more parts of the first screen. 03-08-2012 Kwang Heo, Seoul KR Patent application number Description Published 20100044777 RECONFIGURABLE SEMICONDUCTOR DEVICE - A reconfigurable semiconductor device is disclosed. The semiconductor device includes a substrate, a first insulating material formed on",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}