{
    "relation": [
        [
            "Religion",
            "Catholic",
            "Mainline Protestant",
            "Evangelical Protestant",
            "Other",
            "Black Protestant",
            "Orthodox",
            "None"
        ],
        [
            "Adherents",
            "304,677",
            "52,851",
            "33,484",
            "19,943",
            "6,471",
            "3,731",
            "441,320"
        ],
        [
            "Congregations",
            "104",
            "149",
            "208",
            "79",
            "35",
            "11",
            "-"
        ]
    ],
    "pageTitle": "Ansonia, Connecticut (CT 06401) profile: population, maps, real estate, averages, homes, statistics, relocation, travel, jobs, hospitals, schools, crime, moving, houses, news, sex offenders",
    "title": "",
    "url": "http://www.city-data.com/city/Ansonia-Connecticut.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00018-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 374897615,
    "recordOffset": 374760375,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{26320=Incorporated on 04/1889, 7475=According to our research of Connecticut and other state lists there were 35 registered sex offenders living in Ansonia, Connecticut as of July 29, 2015. The ratio of number of residents in Ansonia to the number of sex offenders is 529 to 1. The number of registered sex offenders compared to the number of residents in this city is near the state average.}",
    "TableContextTimeStampAfterTable": "{169568=Recent home sales, price trends, and home value evaluator powered by Onboard Informatics © 2015 Onboard Informatics. Information is deemed reliable but not guaranteed.   City-data.com does not guarantee the accuracy or timeliness of any information on this site.  Use at your own risk. Website © 2015 Advameg, Inc., 55385=2008 Presidential Elections Results, 51620=School Enrollment by Level of School (%) in 2013, 44049=Particulate Matter (PM2.5) [µg/m3] level in 2012 was 8.30. This is about average. Closest monitor was 7.3 miles away from the city center., 55955=Graphs represent county-level data. Detailed 2008 Election Results, 16992=On 7/10/1989, a category F4 (max. wind speeds 207-260 mph) tornado 8.2 miles away from the Ansonia city center injured 40 people and caused between $50,000,000 and $500,000,000 in damages., 39722=Air Quality Index (AQI) level in 2012 was 110. This is significantly worse than average., 73720=3.88% of this county's 2011 resident taxpayers lived in other counties in 2010 ($47,620 average adjusted gross income), 17278=On 7/29/1971, a category F3 (max. wind speeds 158-206 mph) tornado 14.4 miles away from the city center injured 2 people and caused between $50,000 and $500,000 in damages., 51222=Educational Attainment (%) in 2013, 55099=2004 Presidential Elections Results, 41845=Sulfur Dioxide (SO2) [ppb] level in 2012 was 1.17. This is significantly better than average. Closest monitor was 1.9 miles away from the city center., 40384=Carbon Monoxide (CO) [ppm] level in 2012 was 0.267. This is about average. Closest monitor was 8.0 miles away from the city center., 41101=Nitrogen Dioxide (NO2) [ppb] level in 2012 was 13.4. This is significantly worse than average. Closest monitor was 1.9 miles away from the city center., 54527=1996 Presidential Elections Results, 43294=Particulate Matter (PM10) [µg/m3] level in 2012 was 14.9. This is better than average. Closest monitor was 0.6 miles away from the city center., 75952=4.53% of this county's 2010 resident taxpayers moved to other counties in 2011 ($51,036 average adjusted gross income), 168226=Total of 75 patent applications in 2008-2015., 54813=2000 Presidential Elections Results, 42589=Ozone [ppb] level in 2012 was 25.5. This is better than average. Closest monitor was 1.9 miles away from the city center., 55671=2012 Presidential Elections Results}",
    "textBeforeTable": "Religion statistics for Ansonia city (based on New Haven County data) Graphs represent county-level data. Detailed 2008 Election Results 2012 Presidential Elections Results 2008 Presidential Elections Results 2004 Presidential Elections Results 2000 Presidential Elections Results 1996 Presidential Elections Results 2012 2008 2004 2000 1996 Presidential Elections Results Wood (1%) Bottled, tank, or LP gas (1%) Electricity (9%) Fuel oil, kerosene, etc. (30%) Utility gas (59%) Most commonly used house heating fuel:",
    "textAfterTable": "Source: Clifford Grammich, Kirk Hadaway, Richard Houseal, Dale E.Jones, Alexei Krindatch, Richie Stanley and Richard H.Taylor. 2012. 2010 U.S.Religion Census: Religious Congregations & Membership Study. Association of Statisticians of American Religious Bodies. Jones, Dale E., et al. 2002. Congregations and Membership in the United States 2000. Nashville, TN: Glenmary Research Center. Graphs represent county-level data Food Environment Statistics: Number of grocery stores: 172 New Haven County: 2.04 / 10,000 pop. Connecticut: 2.21 / 10,000 pop. Number of supercenters and club stores: 7 This county: 0.08 / 10,000 pop. State: 0.07 / 10,000 pop. Number of convenience stores (no gas): 96 New Haven County: 1.14 / 10,000 pop. Connecticut: 1.02 / 10,000 pop. Number of convenience stores (with gas): 186 New Haven County: 2.20 / 10,000 pop. State: 2.27 / 10,000 pop. Number of full-service restaurants: 764 Here: 9.05 / 10,000 pop. State: 9.19 / 10,000 pop. Adult diabetes rate: This",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}