{
    "relation": [
        [
            "Categories",
            "Clubs and Activities",
            "Share any unusual traditions or locations on campus",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are over thirty different clubs and organizations, so there is sure to be something for everyone.",
            "UD has the second largest Groundhog Day celebration in the U.S.",
            "There is plenty to do on campus. There is the swimming pool, or you can climb the Braniff Tower. There is usually something fun happening on the mall.",
            "The food is delicious, both in the cafeteria and in the Rathskeller.",
            "There are lots of clubs and organizations that have events on campus. There are lots of weekly events, such as Music on the Mall, and TGIT, where different bands play each week.",
            "From what I have seen, UD has extremely difficult academics. However, the professors are willing to work with you. If you need to, you can make an appointment with your professor to discuss your work.",
            "Be sure to try the Cap Bar and visit the Art Village.",
            "An excellent university. Academically challenging, with a strong Catholic faith. Tons of fun stuff and activities on and off campus."
        ]
    ],
    "pageTitle": "University of Dallas (UD) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-Dallas/reviews?_escaped_fragment_=/show/11740",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 898577971,
    "recordOffset": 898525665,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{194287=© 2015, Cappex.com, LLC, 102462=Despite being only 1300 students strong, the offerings of the school in way of clubs and activities is staggering. The two sports clubs, rugby and Ultimate Frisbee (co-ed), are quite popular. Swing dancing is a weekly, well-attended event, There are also the various service and academic clubs., 22210=Do your best and remember that knowledge is better than book smart. I would also recommend applying at the Early Application deadline in November so that you have a better chance at scholarships and acceptance., 61027=Be ready to read everything starting from 2000 B lot wiser.C! Don't give up, because you will leave this school veryy wise. Start reading the summer before, and chose your major early on in order to plan courses accordingly., 73255=Due to the small population of about 1200 students there are not Greek houses. However, students tend to have a lot of pride in the dorms they represent and there is a strong student government., 51033=There is no Greek life. Since there are only about 1300 undergraduates, the whole campus has a bit of the feel of one large family.}",
    "textBeforeTable": "01/07/2010 Reviewer is A current student here. 12 out of 12 people found this review useful. 1 of 38 Amanda from Clint, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5",
    "textAfterTable": "Great for these types of students UD embraces many different types of students, but most share a love of learning. If you are - curious - want to learn about more than just your major through the Core Curriculum - want to spend a semester abroad in Italy - are a Catholic looking for a supportive, moral environment - want a small school with small class sizes - love a good challenge, then you should definitely consider the University of Dallas. UD has very strong Biology, Theology, and Philosophy programs, and is a good choice for those who would like to go on to law or medical school. It’s also a very good place for science majors who want a liberal arts education while still learning the technical information required by their chosen field. Tips for prospective students If you're a prospective student, the best thing you can do is visit the campus. It's what convinced me to attend UD, and I know many other students who had a similar experience. If you do attend UD, then DO: - Go to Rome. UD has a campus in Due Santi (just outside Rome), and students often attend school in Italy for an entire semester during the Sophomore or Junior year. More information about the program can be found here: http://www.udallas.edu/aboutus/offices/advancement/giving/givingopportunities/rome - Visit Campus Ministry. The people there are the most quirky/interesting/goodhearted people you will meet, and",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}