{
    "relation": [
        [
            "",
            "NatureCity® AloeCran™",
            "Ocean Spray® Cranberry Juice",
            "Welch’s® Grape Juice"
        ],
        [
            "Sugar",
            "0g",
            "28g",
            "40g"
        ],
        [
            "Fiber",
            "5g",
            "0g",
            "0g"
        ],
        [
            "Calories",
            "8",
            "120",
            "170"
        ]
    ],
    "pageTitle": "Why is this One of The Fastest Growing Drinks in America?",
    "title": "",
    "url": "http://www.naturecity.com/lp/aloecran/aloecran.php",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 606203751,
    "recordOffset": 606166183,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{10242=I have the problem no more. Just saying thank you is not nearly enough but I do not know how else to say how I feel. Thank you so much for making my life so much better!” – Martha C., Shalimar, FL Individual results may vary, 19008=Last summer I read about AloeCran. I ordered some, and started taking it in August., 41482=This wonderful note comes from Martha in Shalimar, Fl.  I have to admit when I first heard her story I had tears in my eyes.  I was so happy we could help her – that’s what I love about my job., 90992=Online ordering is safe and secure, however, if you'd rather order by phone please call 1-800-593-2563 and mention special savings code ., 58995=PACran® is so unique it was the first cranberry product in the world with a government sanctioned health claim. In 2009, the Korean Food and Drug Administration (KFDA) approved PACran® for urinary health – quite an accomplishment., 20634=Following up on this work, in 2002, researchers from the University of Wisconsin and Rutgers University were able to show that the PACs in cranberry help prevent E. coli bacteria from sticking to the urinary tract walls., 35326=We both love the taste and the fact that it is not sweetened with sugar. Thanks for a great product and very helpful employees.” – June C., Selmer, TN Individual results may vary, 20429=Finally, in 1994, Harvard Medical School researchers discovered that a class of antioxidants in cranberry, known as “proanthocyanidins” or PACs, that seemed to be the difference makers., 29319=The note above comes from a client in Troy, Tennessee named Kenneth.  He started using AloeCran™ in 2010 and is ecstatic how it has improved his digestion and gastrointestinal system.}",
    "textBeforeTable": "How Making the Switch to AloeCran™ Helps You Drop Hard to Lose Pounds… A recent study titled “What America Drinks” revealed an astounding fact. Researchers found that beverages account for a whopping 22% of calories in the average American diet. Most of these calories come from sugar in drinks like soda and juice. Not only do these drinks cause you to gain weight – they also spike your blood sugar. And here’s where AloeCran™ can make a big difference in your waistline. Unlike a glass of regular cranberry juice, grape juice or soda that has up to 170 calories, a glass of AloeCran™ contains only 8 calories. What’s more, all 8 calories in AloeCran are from fiber – which won’t cause hunger pangs due to wild swings in blood sugar. Just the opposite, the FiberSol®-2 in AloeCran™, has been shown to prolong stomach emptying time – so you don’t get hungry as quickly. Here’s the bottom line…if you substitute just one glass of AloeCran for a daily soda or juice, over the next year you will save about 51,100 calories. That’s almost 15 pounds of fat you can lose or not gain in one year! Just another great reason to start AloeCran today! AloeCran™ is Great for Your Waistline Too! Not only is AloeCran™ nutritious and delicious, but you get all the flavor without",
    "textAfterTable": "Fibersol®-2 has been shown to prolong stomach emptying time – so you don’t get hungry as quickly after eating. Plus recent research presented at the Vahouny Fiber Symposium, showed that Fibersol®-2 also helps signal when you should stop eating by increasing the PYY and GLP-1 hormones in your gut.  These two hormones help tell your brain, you’re full. Just losing a few pounds can make you look younger, but AloeCran™ doesn’t stop there. A recent study conducted by the Korean FDA, showed that women drinking ACTIValoe® reduced facial wrinkles by 10%. Plus, skin elasticity improved 30% and skin roughness was reduced by 17%. That’s real beauty from within! Click here to try AloeCran™ Risk Free! The Reason WHY We Can Charge You Less… Each bag of AloeCran™ makes 1.5 gallons of delicious and nutritious juice. You may be wondering why we don’t just sell the juice instead of the AloeCran™ juice powder. The simple answer is to save you money and also give you a better product. Most companies take powder and add water and sell you juice. But that costs you a lot of money. That’s because a gallon and a half of water or juice weighs about 12 pounds. Shipping this extra weight to you by UPS or the post office would cost an extra $10.00 -$15.00! We know you have fresh water at your home, so we let you add the water and save you the extra money. Plus, this",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}