{
    "relation": [
        [
            "Season Highs",
            "2013-14",
            "Blocks",
            "2 vs. Lafayette (11/20/13)",
            "Career Highs",
            "2012-14",
            "Blocks",
            "3, last at Columbia (2/22/13)"
        ],
        [
            "Points",
            "15, last at Rice (11/23/13)",
            "Field Goals",
            "6 at Rice (11/23/13)",
            "Points",
            "17 vs. Rider (12/20/12)",
            "Field Goals",
            "7 vs. Rider (12/20/12)"
        ],
        [
            "Rebounds",
            "11 at Butler (11/16/13)",
            "3-Point Field Goals",
            "3 at Rice (11/23/13)",
            "Rebounds",
            "15 vs. TCNJ (1/27/13)",
            "3-Point Field Goals",
            "3 at Rice (11/23/13)"
        ],
        [
            "Assists",
            "4 vs. FAMU (11/10/13)",
            "Free Throws",
            "5 at Butler (11/16/13)",
            "Assists",
            "4, last vs. FAMU (11/10/13)",
            "Free Throws",
            "5 at Butler (11/16/13)"
        ],
        [
            "Steals",
            "2, last vs. George Mason (11/26/13)",
            "Minutes",
            "39 at Butler (11/16/13)",
            "Steals",
            "2, last vs. George Mason (11/26/13)",
            "Minutes",
            "39 at Butler (11/16/13)"
        ]
    ],
    "pageTitle": "Men's Hoops to Renew Series at Bucknell Saturday - GoPrincetonTigers.com - Education Through Athletics ... An Unmatched Tradition of Athletic Success.",
    "title": "",
    "url": "http://www.goprincetontigers.com/ViewArticle.dbml?SPID=4264&DB_LANG=C&DB_OEM_ID=10600&ATCLID=209323932",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 479515779,
    "recordOffset": 479486256,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{17144= vs. Fairleigh Dickinson, Sat., Dec. 7 in Princeton All-Time Series: First Meeting Last Meeting: N/A, 42838=• Bucknell had four players who scored double-figure points last season - the only ones who averaged more than 2.6 ppg in 2012-13 - and graduated three of them with Mike Muscala (18.7), Bryson Johnson (11.1) and Joe Willman (10.6). Cameron Ayers, who averaged 12.4 ppg last season, is averaging a team-best 15.2 ppg this season. • Bucknell's returners took just 42.6 percent of the team's field goal attempts last season and scored just 39.6 percent of the team's points. • Bucknell was picked fourth in the Patriot League's preseason poll behind newcomer Boston University, Lafayette and Army. • Bucknell head coach Dave Paulsen is in his sixth season at Bucknell, and his win total has never decreased from season to season. He started with seven wins in 2008-09, followed by 14, then 25 each of the next two years as Bucknell made an NCAA and an NIT, and 28 last season. • Bucknell is on a streak of making three straight postseason tournaments, falling to UConn in the 2011 Round of 64, defeating Arizona before losing to Nevada in the Rounds of 32 and 16 in the 2012 NIT, and losing to Butler in the 2013 NCAA Round of 64. • Bucknell has shown itself to be effective on offense this season, shooting .506 (167-330) from the field and .471 (48-102) from beyond the arc. Despite the key losses of Muscala, Johnson and Willman to graduation, three others, including 6-8 forward Brian Fitzpatrick (11.5), 6-3 guard Steven Kaspar (11.0) and 6-6 guard Ben Brackney (10.0) have stepped up to average double figures so far this season. • Despite Bucknell's shooting .506 from the field this season, the Bison enter Saturday with just the second-leading field goal percentage in the Patriot League, behind Colgate's .513. The .471 3FG percentage is also second to Colgate, with .489. • Bucknell's got two of the top four shooters in the Patriot League by field goal percentage, with Dom Hoffman at .650 and Brian Fitzpatrick at .617. Steven Kaspar leads the Patriot in assists at 5.8 apg., 18106=at Rutgers, Wed., Dec. 11 in Piscataway, N.J. All-Time Series: Princeton leads 74-45 Last Meeting: Nov. 16, 2012 in Princeton. Rutgers won 58-52, 35415=• Princeton and Bucknell will meet for the fourth straight season, just the second time that has happened in a series that began way back in 1902. The teams played four straight years from 1996-99, with Princeton taking 3 of 4, something the Tigers can do again Saturday over a four-year stretch. • Princeton won the 2010 meeting 66-55 against Bucknell at James Madison as part of an in-season tournament but lost the next year at Bucknell 62-56 as part of another in-season event. The teams met as part of a usual non-conference game last season in Jadwin Gym, a 79-67 win, and the Tigers return the visit this season. • Last season's 12-point win for the Tigers over the Bison came with Bucknell entering with an 11-1 record, including a win over Purdue and the only loss to Penn State, by three points. Princeton's margin of victory was Bucknell's largest loss of the season until Butler beat the Bison in the NCAA Tournament, also by 12, capping a 28-6 season. • Both Princeton and Bucknell enter this season having lost a major piece from last season. The Tigers graduated Ian Hummer '13, the program's second-leading scorer in history, while the Bison graduated Mike Muscala, the leading scorer in his program's history. Both were their respective league's Player of the Year last year. Muscala was drafted by Dallas and traded to Atlanta but now plays in Spain. • The Tigers are in the fourth game of four straight in which the opposing coach has been a head coach in the NCAA Tournament. Lafayette's Fran O'Hanlon coached the Leopards in the dance in 1999 and 2000, Rice's Ben Braun coached Eastern Michigan and Cal a combined eight visits in the tournament, including with the Bears in 1997 against then-junior Mitch Henderson's Tigers, while George Mason's Paul Hewitt coached Siena and Georgia Tech a combined six times, including a 2004 NCAA final defeat against UConn with the Yellow Jackets. Saturday, the Tigers will square off against Dave Paulsen, who's guided Bucknell to the bracket in 2011 and 2013. • Princeton has taken 107 free throws through its first five games. That's the highest total for a Princeton team through the first five games of a season since the 1982-83 campaign, when the Tigers took 114 through five games. It's not dramatically higher than recent seasons, as Princeton had 101 at this point in 2010-11 and 100 in 2011-12, though just 73 last year through five games. • Princeton has won four straight games against Patriot League foes and seven of the last eight, dating back to the 2009-10 season. The only loss in that eight-game stretch was at Bucknell on Nov. 25, 2011. • Princeton has scored 356 points so far this season, an average of 71.2 ppg. It's the most points Princeton has scored through five games since the 1971-72 season, when the team had 413 points through games against Rutgers, Penn State, No. 2 North Carolina, No. 18 Villanova and Navy. • Princeton has almost doubled its opponents in the number of 3-pointers made this season, canning 48 to 25 for its foes. The Tigers have also tried significantly more than their opponents, though not twice as many, 125-74. • The Tigers are shooting .466 so far this season and are coming off their best shooting game in nearly two years, since Feb. 25, 2012 at Dartmouth, when the Tigers shot .654. Princeton made 61 percent of its field goals against George Mason. • Of Princeton's 251 field goal attempts this season, 125, or 49.8 percent, have been from beyond the arc. That number went down against George Mason, as Princeton tried a season-low 17 3s after averaging 27 tries a game coming in. Seven players have more tries from beyond the arc than from inside, including Will Barrett (23 of 32), Ben Hazel (24-36), Spencer Weisz (15-21), T.J. Bray (9-16), Jimmy Sherburne (12-21), Chris Clement (9-11) and Clay Wilson (2-2). • Princeton has outrebounded four of its first five opponents this season. It's the first time the Tigers have done that since the 2010-11 season, when they outrebounded each of their first five foes. • Princeton enters the Bucknell game with five players averaging double-figure points. There's a long way to go, but if Princeton ended the season that way, it'd be the first time since 2002-03 that five Tiger players ended a season with double-figure scoring averages. • Princeton ended Tuesday night ranked first in the Ivy in 3-pointers per game at 9.6 (Dartmouth was second at 8.7). • The Tigers have used the same starting lineup in all five games, with 6-10 senior Will Barrett, 6-8 sophomore Hans Brase, 6-3 senior Jimmy Sherburne, 6-5 junior Ben Hazel and 6-4 freshman Spencer Weisz getting the nod. • Princeton returns nearly 75 percent of its scoring from a year ago despite graduating reigning Ivy Player of the Year Ian Hummer ’13. The team also returns 71 percent of its starts and 67 percent of its minutes, with Denton Koon, T.J. Bray, Will Barrett and Hans Brase all having started at least 18 games last season. • 39.3 percent of Princeton's points this season have been scored by players who weren't on the 2012-13 roster, including Spencer Weisz (7.2 ppg), Ben Hazel (10.6 ppg), Jimmy Sherburne (7.2 ppg), Peter Miller (2.6 ppg) and Steven Cook (0.7 ppg). Hazel, a junior, and Sherburne, a senior, took the 2012-13 season off. • The Tigers have a six-member freshman class and five of them have seen game action, including Khyan Rayner, Hashim Moore, Steven Cook, Peter Miller and Spencer Weisz. Miller has played in all five games, and Weisz has started all five.}",
    "textBeforeTable": "Live Stats BucknellBison.com Twitter @PUTIGERS Live Video Patriot League Network Live Audio WPRB 103.3 FM GoPrincetonTigers.com     } display: none; #articleRelated {",
    "textAfterTable": " vs. Fairleigh Dickinson, Sat., Dec. 7 in Princeton All-Time Series: First Meeting Last Meeting: N/A at Rutgers, Wed., Dec. 11 in Piscataway, N.J. All-Time Series: Princeton leads 74-45 Last Meeting: Nov. 16, 2012 in Princeton. Rutgers won 58-52 at Penn State, Sat., Dec. 14 in State College, Pa. All-Time Series: Penn State leads 8-3 Last Meeting: Dec. 12, 2007 at Penn State. Penn State won 61-38 11/10 FLORIDA A&M, W, 67-50 12/21 vs. Portland #, 11 p.m. ET 2/15 at Yale*, 7 p.m. 11/16 at Butler, L, 70-67 12/31 KENT STATE, 12 p.m. 2/21 DARTMOUTH*, 7 p.m. 11/20 LAFAYETTE, W, 81-80 (OT) 1/4 at Liberty, 2 p.m. 2/22 HARVARD*, 8 p.m. 11/23 at Rice, W, 70-56 1/11 at Penn*, 6 p.m. 2/28 YALE*, 7 p.m. 11/26 GEORGE MASON, W, 71-66 1/26 KEAN, 2 p.m. 3/1 BROWN*, 6 p.m. 11/30 at Bucknell, 7 p.m. 1/31 at Harvard*, 7 p.m. 3/7",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}