{
    "relation": [
        [
            "Candidate",
            "Tim Ryan",
            "Duane Grassell"
        ],
        [
            "Party",
            "Democratic",
            "Republican"
        ],
        [
            "Notes",
            "Incumbent",
            ""
        ],
        [
            "Votes",
            "217,556",
            "60,760"
        ],
        [
            "Percentage",
            "78.17%",
            "21.83%"
        ]
    ],
    "pageTitle": "United States House of Representatives elections in Ohio, 2008 - Wikipedia, the free encyclopedia",
    "title": "",
    "url": "https://en.wikipedia.org/wiki/United_States_House_of_Representatives_elections_in_Ohio,_2008",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00061-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 859567223,
    "recordOffset": 859540128,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{29741=The 2008 congressional elections in Ohio were held on November 4, 2008 and determined who will represent the state of Ohio in the United States House of Representatives. The primary election was held on March 4, 2008., 30234=Ohio has eighteen seats in the House, apportioned according to the 2000 United States Census. Representatives are elected for two-year terms; those elected in November 2008 will serve in the 111th Congress from January 4, 2009 until January 3, 2011. The election coincided with the 2008 U.S. presidential election., 97719=The election results were essentially tied, requiring an automatic recount. CQ Politics rated the race as 'Leans Democratic'. Republican incumbent Deborah Pryce did not run for reelection in 2008, leaving this an open seat. Kilroy defeated Stivers by 2,311 votes in a race not decided until the final ballots were counted on December 7, 2008., 86561=A special election was held on November 18, 2008 to fill Jones's seat for the remainder of the 110th Congress, until January 3, 2009, which Fudge won with 100% of the vote.[5] See Ohio's 11th congressional district special election, 2008., 30859=Districts 1, 15 and 16 changed party (from Republican to Democratic), although CQ Politics had forecasted districts 1, 2, 14, 15, 16 and 18 to be at some risk for the incumbent party. District 15 was not decided until December 8, 2008.[1], 72462=Republican incumbent David Hobson did not run for reelection in 2008. Republican nominee Steve Austria won against Democratic nominee Sharen Neuhardt. CQ Politics rated the race as 'Republican Favored'. The following candidates ran in the general election:}",
    "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT",
    "textBeforeTable": "Democratic nominee Steve Driehaus won against Republican incumbent Steve Chabot. CQ Politics rated the race as 'No Clear Favorite'. The following candidates ran in the general election: Ohio's 1st congressional district See also: District 1[edit] Fred Dailey Zack Space Re-election Zack Space 18 Duane Grassell Tim Ryan Re-election Tim Ryan 17 Kirk Schuring John Boccieri Open Ralph Regula 16 Travis Casper Don Elijah Eckhart Mark M. Noble Steve Stivers Mary Jo Kilroy Open Deborah Pryce 15",
    "textAfterTable": "Rich Stevenson (WI) Independent 67 .02% Eric Wilson (WI) Independent 84 .03% Race ranking and details from CQ Politics Campaign contributions from OpenSecrets.org Chabot (R-i) vs Driehaus (D) graph of collected poll results from Pollster.com District 2[edit] See also: Ohio's 2nd congressional district Republican incumbent Jean Schmidt won against Democratic nominee Victoria Wulsin and Independent candidate David Krikorian. CQ Politics rated the race as 'Leans Republican'. The following candidates ran in the general election: Candidate Party Notes Votes Percentage Jean Schmidt Republican Incumbent 148,671 44.83% Victoria Wulsin Democratic 124,213 37.46% David Krikorian Independent Endorsed by the Libertarian Party of Ohio 58,710 17.70%[3]",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}