{
    "relation": [
        [
            "Date",
            "Aug 8, 2001",
            "Feb 5, 2008",
            "May 21, 2010",
            "May 21, 2014"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Event",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Description",
            "Owner name: CISCO TECHNOLOGY, INC., CALIFORNIA Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KIRKWOOD, MICHAEL J.;YAZDANI, SIMA;BASKAR, JERALD AL;REEL/FRAME:012070/0316 Effective date: 20010731",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US7139973 - Dynamic information object cache approach useful in a vocabulary retrieval ... - Google Patents",
    "title": "",
    "url": "http://www.google.com/patents/US7139973?dq=6356708",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00323-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474183847,
    "recordOffset": 474121923,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{6153=In one embodiment, object repository 1220 and persistent content store 454 are configured as a set of tables in a relational database management system. FIG. 13 is a diagram of an example schema of tables that may be used in an embodiment. Boxes represent tables, and connecting lines represent primary keys into other tables. Elements identifies as “Number” each are 4 bytes long and “String” elements are 256 characters, in an embodiment. The ID values are generated by cache servers 440.}",
    "TableContextTimeStampAfterTable": "{280442=Such a schema is highly optimized in terms of table size and memory usage. Each table has relatively few columns. A vocabulary table 1302 defines primary keys for a Relation Type table 1303, Relation Type Participant table 1304, a Relation Participant table 1306, and an Attribute table 1308. Relation types refer to relationships among information objects, e.g., one vocabulary item in Vocabulary table 1302 may have a “has_doc” relation with a particular information object, which indicates that the vocabulary item has a document associated with it. Information objects that are referenced in Info Object table 1310 may be stored in a content management system (CMS) 1312, in an LDAP directory 1314, or in a file system 1316, as indicated by an object ID value 1311 that uniquely identifies an object. Thus, the repository may reference any number of different information storage mechanisms. Ultimately, this enables a dynamically constructed electronic document based on such information objects to have a richer variety of information., 273074=Each of the product values and information object values is a reference to a node object in the tree described above. The value “intro” refers to an “Introduction” information object type that is associated with information that gives an introduction to a product; the value “bene” identifies a “Features & Benefits” information type. Assume further that client 1202 issues a request for all “Features and Benefits” information objects for product p1, and the request has the form: SELECT (“p1”, “bene”). Thus, the request means, “select from the cache all objects that are for product p1 and contain Features and Benefits (“bene”) information.” In response to this query, the cache generates interim results as follows:, 268585=The interim results are combined by the cache according to logical rules within the query to result in creating and storing raw results from cache 1210. For example, raw results from cache 1210 represents the logical intersection of interim results 1212A, 1212B., 266674=In operation, query processor 1204 parses a client request. Query processor 1204 then searches result cache 1206 to determine whether a result set value is present that matches the concept and information type in the query. The result set identifies one or more rows in cached content that contain index pointers to information objects in stored content chunks 1216, or in object repository 1220, that are responsive to the user query. If a result set is present, then the information objects that are referenced in the result set index pointers are obtained from either stored content chunks 1216, or object repository 1220, and returned to client 1202., 290866=The invention is related to the use of computer system 1000 for a vocabulary development server and information object repository. According to one embodiment of the invention, a vocabulary development server is provided by computer system 1000 in response to processor 1004 executing one or more sequences of one or more instructions contained in main memory 1006. Such instructions may be read into main memory 1006 from another computer-readable medium, such as storage device 1010. Execution of the sequences of instructions contained in main memory 1006 causes processor 1004 to perform the process steps described herein. In alternative embodiments, hard-wired circuitry may be used in place of or in combination with software instructions to implement the invention. Thus, embodiments of the invention are not limited to any specific combination of hardware circuitry and software., 283890=Similarly, Technology proxy root node 1408 and Solution proxy root node 1410 reference a distributed root node 1424 in a second machine 1414 in which both a Technology root node 1426 and Solution root node 1428 are rooted. Thus, one or more hierarchies, trees or branches may reside on a machine., 295954=Computer system 1000 can send messages and receive data, including program code, through the network(s), network link 1020 and communication interface 1018. In the Internet example, a server 1030 might transmit a requested code for an application program through Internet 1028, ISP 1026, local network 1022 and communication interface 1018. In accordance with the invention, one such downloaded application provides for an information object repository API as described herein., 257267=Use of interface 1112 and delivery engine 1110 improves scalability by enabling the cache server 440 to respond to a large number of clients 1104 wherein data presentation and delivery are controlled by delivery engine 1110. Further, this arrangement enables concept cache server 440 to cache information objects, vocabulary trees, relationship instances, or other components of electronic documents that are dynamically generated by the delivery engine 1110. Unlike past approaches that involve caching static pages, delivery engine 1110 can search the cache server 440 to obtain needed information objects in the process of assembly a dynamically generated electronic document. If the requested information objects are not in the cache of the cache server 440, the cache server can query the persistent content store 454 to obtain the requested objects. The cache server also can query any other logical store or network resource to obtain the requested objects, e.g., an LDAP directory, database server, etc., 267928=Each set of interim results comprises a table of rows having a plurality of column values. In first interim results 1212A, the column values comprise a concept identifier, and a set of row identifiers for rows of cached content 1214 that match the associated concept identifier. In second interim results 1212B, the column values comprise an information type value, and a set of row identifiers for rows of cached content 1214 that match the associated information type value. Thus, each of the interim results 1212A, 1212B functions as an index into the cached content 1214., 269207=As one specific example of operation, assume that cached content 1214 contains data organized as follows:, 258388=Further, delivery engine 1110 is not required to interact directly with the persistent content store 454 or any other repository. Unlike past approaches, delivery engine 1110 is not required to carry out operations with the content store that involve substantial overhead, such as establishing a database connection each time that the delivery engine needs a particular information object, querying the database, finding the correct object, retrieving the information objects from relatively slow disk storage of the database, etc. Such queries would be required frequently, because a complete page would become invalidated often as a result of changes in data underlying one or more information objects that make up the page. By caching individual information objects rather than entire pages, a substantial performance bottleneck is avoided. Further, because all the vocabularies and information objects are connected, the system can determine which pages use a particular information object and use such data to rebuild only those pages., 277655=Row 1 of cached content 1214 identifies content chunk “/b.cnk.” Therefore, query processor 1204 returns that content chunk to the client as the result of the query. Client 1202 may be the delivery engine 1110. Thus, in response to receiving the result of the query, comprising one or more content chunks or information objects, delivery engine 1110 can dynamically construct an electronic document that contains the information objects and is responsive to the user query., 265518=Stored content chunks 1216 serve as a local cache for information objects that are persistently stored in object repository 1220. Stored content chunks 1216 may be stored in a file system, database, etc. Least-recently-used information objects in stored content chunks 1216 are removed according to a conventional LRU algorithm. Use of an LRU process ensures that the amount of memory required by stored content chunks 1216 remains within a specified reasonable limit., 278195=If client 1202 issues a second query in the same form (seeking information matching “p1” and “bene”), the result cache 1206 is first searched for matching information. In the example given, the result cache has the values “p1,” “bene,” and “1.” Thus, a search of the result cache 1206 yields a result set matching the query, so no inquiry to cached content 1214 or generation of interim result sets is needed. The row values in the client (“1” in this example) are immediately returned to the client., 286448=According to other features, an Event Manager notifies interested applications about what is happening in the caching system. The cache may generate events, for example, when values of tree nodes are changed, when index updates are carried out, when hierarchies are re-synchronized, etc. As a specific example, when an information object value changes, an event is published. The delivery engine 1110 subscribes to such events so that it can request a new copy of the changed information object when it next generates an electronic document that contains such information object. Examples of events that can be published include Node Added; Node Removed; Node Attribute Added; Node Attribute Removed; Relation Type Added; Relation Type Removed; Relation Attribute Added; Relation Attribute Removed; Relation Instance Added; Relation Instance Removed., 294096=Computer system 1000 also includes a communication interface 1018 coupled to bus 1002. Communication interface 1018 provides a two-way data communication coupling to a network link 1020 that is connected to a local network 1022. For example, communication interface 1018 may be an integrated services digital network (“ISDN”) card or a modem to provide a data communication connection to a corresponding type of telephone line. As another example, communication interface 1018 may be a local area network (“LAN”) card to provide a data communication connection to a compatible LAN. Wireless links may also be implemented. In any such implementation, communication interface 1018 sends and receives electrical, electromagnetic or optical signals that carry digital data streams representing various types of information., 266054=Additions, deletions, and changes to stored content chunks 1216 are received from a vocabulary index builder 1216 that communicates with cached content 1214. The vocabulary index builder is manipulated by an administrative user who can retrieve master copies of content objects from an object repository 1220 through a database access API., 291843=The term “computer-readable medium” as used herein refers to any medium that participates in providing instructions to processor 1004 for execution. Such a medium may take many forms, including but not limited to, non-volatile media, volatile media, and transmission media. Non-volatile media includes, for example, optical or magnetic disks, such as storage device 1010. Volatile media includes dynamic memory, such as main memory 1006. Transmission media includes coaxial cables, copper wire and fiber optics, including the wires that comprise bus 1002. Transmission media can also take the form of acoustic or light waves, such as those generated during radio-wave and infra-red data communications., 295011=Network link 1020 typically provides data communication through one or more networks to other data devices. For example, network link 1020 may provide a connection through local network 1022 to a host computer 1024 or to data equipment operated by an Internet Service Provider (“ISP”) 1026. ISP 1026 in turn provides data communication services through the world wide packet data communication network now commonly referred to as the “Internet” 1028. Local network 1022 and Internet 1028 both use electrical, electromagnetic or optical signals that carry digital data streams. The signals through the various networks and the signals on network link 1020 and through communication interface 1018, which carry the digital data to and from computer system 1000, are exemplary forms of carrier waves transporting the information., 278756=In this configuration, retrieval of complex information content is carried out using highly efficient data storage. For example, cached content 1214 may be created using as few as 13 bytes per row to store a ROWID, attribute values, and chunk references. Actual information object content chunks are stored outside the cache core, as stored content chunks 1216, which are accessed only when a cache hit occurs, as indicated by information in result set 1208B. In contrast, object repository 1220 typically uses far greater storage for object references., 296520=The received code may be executed by processor 1004 as it is received, and/or stored in storage device 1010, or other non-volatile storage for later execution. In this manner, computer system 1000 may obtain application code in the form of a carrier wave., 290041=Computer system 1000 may be coupled via bus 1002 to a display 1012, such as a cathode ray tube (“CRT”), for displaying information to a computer user. An input device 1014, including alphanumeric and other keys, is coupled to bus 1002 for communicating information and command selections to processor 1004. Another type of user input device is cursor control 1016, such as a mouse, a trackball, or cursor direction keys for communicating direction information and command selections to processor 1004 and for controlling cursor movement on display 1012. This input device typically has two degrees of freedom in two axes, a first axis (e.g., x) and a second axis (e.g., y), that allows the device to specify positions in a plane., 254577=A client 1104 is communicatively coupled to a network 1101. At a server side of the network 1101, input data from subject matter experts (represented by block 1114) is received into the vocabulary development server 410. In this context, subject matter experts are individuals associated with the enterprise that owns or operates vocabulary development server 410 and who have knowledge about particular products, services, solutions, technologies, or other information using vocabulary terms that are managed by the vocabulary development server, or managed by associated tools or processes that interface with application programming interfaces of the vocabulary development server. Thus, the subject matter experts act as arbiters of what vocabulary terms are correct, alternatives, incorrect, etc., and store such information in the vocabulary development server 410. The subject matter experts may do so by processing through workflow steps and actions that are based on their access level and other relationships to the concepts, attributes and relationships., 255996=The cache server 440 communicates with external applications and servers through a concept access application programming interface (API) 432. Calls to the API and results from the API are provided to an interface 1112 to a delivery engine library. A preview server acting as a delivery engine, represented by block 1110, is communicatively coupled from the interface 512 to network 401. The delivery engine 1110 dynamically generates electronic documents in response to requests of client 1104, and can allow updates to system information from clients. In particular, the delivery engine 1110 determines a format of an electronic document that is responsive to the client request, and queries concept cache server 440 through concept access API 432 to obtain one or more information objects that form components of the dynamically generated electronic document. The information objects provide all things required to generate the document, including content, applications, images, templates, code, etc. When the electronic document is fully assembled, the delivery engine 1110 delivers the document to the client 1104 through network 1101., 282577=Stored content chunks 1216 and object repository 1220 may be distributed over multiple machines. For example, one hierarchical tree of information objects (such as the “Product” category tree) may be stored in one physical computing machine and other trees may be stored in other machines. Alternatively, one category may be replicated in part or whole, and may be integrated with an event manager to maintain consistency and integrity of data and relationships., 293069=Various forms of computer readable media may be involved in carrying one or more sequences of one or more instructions to processor 1004 for execution. For example, the instructions may initially be carried on a magnetic disk of a remote computer. The remote computer can load the instructions into its dynamic memory and send the instructions over a telephone line using a modem. A modem local to computer system 1000 can receive the data on the telephone line and use an infra-red transmitter to convert the data to an infra-red signal. An infra-red detector can receive the data carried in the infra-red signal and appropriate circuitry can place the data on bus 1002. Bus 1002 carries the data to main memory 1006, from which processor 1004 retrieves and executes the instructions. The instructions received by main memory 1006 may optionally be stored on storage device 1010 either before or after execution by processor 1004., 279370=A cache system as described herein is optimized for operation in connection with data representing vocabulary concepts, relationships, and information objects, in this embodiment. Lookup time is minimized by using a cascading lookup scheme that first involves querying result cache 1206. Cached content 1214 and object repository 1220 are queried, and result sets are constructed, only if necessary., 268908=Query processor 1204 receives the raw results from cache 1210 and stores them in the result cache 1206 in the form of a final result set 1208B. Query processor 1204 then delivers final result set 1208B to client 1202., 267417=If result cache 1206 does not contain a matching result set, then cached content 1214 is searched according to the following process. Query processor 1204 generates and sends one or more index lookup requests to cached content 1214. In response to the lookup requests, cached content 1214 is searched and one or more interim result sets, represented by first interim results 1212A and second interim results 1212B, are generated., 263457=Requests for information objects are received from a client 1202 at a query processor 1204. Each client request is presented in the form of a query. For example, a query might encapsulate the request, “Show me an electronic document that describes the Features & Benefits of Product 7500.” In this context, client requests may be issued programmatically from one or more software applications that are executed by client 1202. For example, a client request may be formulated and generated by a Web application that the client uses to interface to a complex enterprise Web site., 47011=This application is related to and claims domestic priority from prior U.S. Provisional application Ser. No. 60/252,378, filed Nov. 20, 2000, the entire disclosure of which is hereby incorporated by reference as if fully set forth herein. This application is related to U.S. Pat. No. 6,665,662 issued on Dec. 16, 2003, entitled “Query Translation System for Retrieving Business Vocabulary Terms” by inventors M. Kirkwood et al.; U.S. patent application Ser. No. 09/823,819, filed on Mar. 30, 2001, entitled “Business Vocabulary Data Storage Using Multiple Inter-Related Hierarchies” by inventors M. Kirkwood et al.; U.S. patent application Ser. No. 09,908,947, filed on Jul. 18, 2001, entitled “Business Vocabulary Data Retrieval Using Alternative Forms” by inventors M. Kirkwood et al.; U.S. patent application Ser. No. 09/909,108, filed on Jul. 18, 2001, entitled “Techniques for Forming Electronic Documents Comprising Multiple Information Types” by inventors M. Kirkwood et al.; and U.S. patent application Ser. No. 09/925,204, filed Aug. 8, 2001, entitled “Multiple Layer Information Object Repository” by inventors M. “Multiple Layer Information Object Repository” by inventors M. Kirkwood et al., the entire disclosures of all of which are hereby incorporated by reference for all purposes as if fully set forth herein., 215853=In step 646, the returned array is filtered to remove instances that do not match the user associated with the request. For example, the rows of Table 16 having an rID of 1117, which involve the technical job role, are eliminated because the user associated with the request is a marketing person, not a technical person. Only the rows with an rID of 9877 remain., 266454=Cached content 1214 is managed by software elements that ensure that the least-recently-used (LRU) cache entries are regularly deleted from the cache. This controls the cache size.}",
    "textBeforeTable": "Patent Citations In the foregoing specification, the invention has been described with reference to specific embodiments thereof. It will, however, be evident that various modifications and changes may be made thereto without departing from the broader spirit and scope of the invention. The specification and drawings are, accordingly, to be regarded in an illustrative rather than a restrictive sense. 6.0 Extensions and Alternatives The received code may be executed by processor 1004 as it is received, and/or stored in storage device 1010, or other non-volatile storage for later execution. In this manner, computer system 1000 may obtain application code in the form of a carrier wave. Computer system 1000 can send messages and receive data, including program code, through the network(s), network link 1020 and communication interface 1018. In the Internet example, a server 1030 might transmit a requested code for an application program through Internet 1028, ISP 1026, local network 1022 and communication interface 1018. In accordance with the invention, one such downloaded application provides for an information object repository API as described herein. Network link 1020 typically provides data communication through one or more networks to other data devices. For example, network link 1020 may provide a connection through local network 1022 to a host computer 1024 or to data equipment operated by an Internet Service Provider (“ISP”) 1026. ISP 1026 in turn provides data communication services through the world wide",
    "textAfterTable": "Nov 30, 1993 Jul 1, 1997 Hitachi, Ltd. Method and apparatus for displaying items of information organized in a hierarchical structure US5678045 Dec 6, 1993 Oct 14, 1997 Digital Equipment Corporation Method and apparatus for multiscript access to entries in a directory US5696916 Sep 21, 1992 Dec 9, 1997 Hitachi, Ltd. Information storage and retrieval system and display method therefor US5740425 Sep 26, 1995 Apr 14, 1998 Povilus; David S. Data structure and method for publishing electronic and printed product catalogs US5752023 Apr 24, 1996 May 12, 1998 Massachusetts Institute Of Technology Networked database system for geographically dispersed global sustainability data US5875443 Jan 30, 1996 Feb 23, 1999 Sun Microsystems, Inc. Internet-based spelling checker dictionary system with automatic updating US5907837 * Nov 17, 1995 May 25, 1999 Microsoft Corporation Information retrieval system in an on-line network including separate content and layout of published titles US5924090 * May 1, 1997",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}