{
    "relation": [
        [
            "Technical term",
            "Yagi Antenna, Yagi-Uda antenna",
            "Y-modem",
            "Yotta, yottabyte",
            "Yocto, yocto-second (ys)"
        ],
        [
            "Context and Discussion",
            "This is a directional antenna named after the Japanese inventor. The word antenna, is from Latin and suggests a sail-yard which \"sticks out\"",
            "This is an error-correction protocol for modems which use 1024-byte data blocks.",
            "see also terabyte, mega etc., this is 10-24 which is effectively, 1024.",
            "this is 10-24 seconds. A pico-second (pico-paraya) is 10-12. Hence a Yocto second is a pico-pico second."
        ],
        [
            "සිංහල යෙදීම SINHALA FORMS",
            "Yagi pitaskoora",
            "Y-muhuyathnaya",
            "Yotha-badh-dwithaya",
            "Yokto-tathparaya, yoktoparaya"
        ]
    ],
    "pageTitle": "Technical terms in Sinhala",
    "title": "",
    "url": "http://dh-web.org/place.names/tech2sinhala.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 76571983,
    "recordOffset": 76509617,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "A B C D E F G H I J K L M N O P Q R S T U V W X Y Z A Online english-sinhala dictionary with many technical words Prof. Epasinghe's look back in an article on: Reforming education in Sri Lanka for the 21st century Teaching Science in Sinhala, early efforts at Vidyodya etc Aelian de Silva's critique Siyabas.lk site Sinhala-Unicode\" target=\"_blanktarget=\" _blank\"=\"\">සිංහල යුනිකෝඩ් සමූහය - Sinhala Unicode Group Sinhala Unicode    A discussion of style for sinhala in the context of computers History of Sinhala software A list of sinhala technical-language references තෙක්නිකය සඳහා සිංහල වදන් This list as been prepared by CDW using available background material, and in recognition that scientific terms will slowly diffuse into general non-technical sinhala usage due to the increasing technicization of society. Hence it is important to ensure that wrong usages and inappropriate forms do not get entrenched. Users are invited to send in their corrections, comments and suggestions to:   chandre.dharma@yahoo.ca",
    "textAfterTable": "Action In quantum physics ACTION is a dynamical quantity similar to \"work\", evaluated as a path integral connecting the initial and endpoint of the path. Non-technicl meanings would include ක්‍රියාව, කාර්යය, කිරිය Sakriyataava sa k ri ya th va   (e2s map) Active, (opposed to passive) an active component is in use, or powered Sakriya, සක්රිය (as opposed to akriya, inactive or passive) Active-Matrix Active-matrix is a technology used in flat-panel and other displays. Matrix is a system made up of columns and rows. \"kuluPe~liya\" signifies the column (Kuluna)-row(Pe~liya) structure. The word න්‍යාසය does not adequately bring out its meaning. Sakriya kuluPe~liya සක්රිය කුලු ේපලිය Access, (Microsoft Access) A database application for windows MS-Access actual actuality real reality virtual imaginary unreal li>An actual process is is something which corresponds to data excternal to the computer. actuality is being associated with an actual process A real*8 array is made up of real numbers of 8-bit words. A real image appears as a bright object on a screen. reality is associated with actual proceses A virtual memory is an additional amount of memory that may be available to a computer user during run time. A virtual image is not captured on a screen. imaginary numbers are no more imaginary than real numbers. \"kalpitha sangkya yath sangkya valata vad",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}