{
    "relation": [
        [
            "Element",
            "Transaction Code",
            "Transaction Name",
            "Is System"
        ],
        [
            "Description",
            "The barcode used for the type of activity or transaction.",
            "The type of transaction or activity associated with the barcode.",
            "An indicator of the type of barcode. System barcodes are default barcodes provided with the software."
        ]
    ],
    "pageTitle": "A User Interface",
    "title": "",
    "url": "http://docs.oracle.com/cd/E21764_01/doc.1111/e10640/e01_interface.htm",
    "hasHeader": true,
    "headerPosition": "MIXED",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 75350947,
    "recordOffset": 75300195,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{16465=Required for processing fiscal date periods. Initial default: April 1., 213683=Memo: Text field, 1000 characters maximum.}",
    "lastModified": "Wed, 13 May 2015 05:19:00 GMT",
    "textBeforeTable": "Permissions: The PCM.Admin.Manager right is needed to perform this action. This right is assigned by default to the PCM Administrator role. To access this page, click Physical then Configure then Function Barcodes from the Top menu. This page is used to set a barcode numbering system. A.5.2.6 Configuring Custom Barcode Page Available only for offsite storage. Used to specify the Ship To code for offsite storage. Offsite Ship To Code Addressing information for offsite storage. Address Information Available only for storage locations that can hold items. Used to specify a barcode for the location. If not specified, a random 19-digit number is automatically assigned. Maximum number of characters: 30 Barcode Available only for storage locations that can hold items. Used to specify the maximum number of items the location can hold. This number is used to track space availability. If not specified, 1 (one) is assumed, which means only a single item can be assigned to the storage location. Maximum",
    "textAfterTable": "A.5.2.7 Create Custom Barcode Dialog This dialog is used to create a new custom barcode. This dialog is displayed after clicking Add on the Configuring Custom Barcode Page. Permissions: The PCM.Admin.Manager right is needed to perform this action. This right is assigned by default to the PCM Administrator role. Element Description Transaction Code Enter the code to be associated with the new transaction type. Values must be between 7000 and 9999. Required. Transaction Name Enter the activity or event associated with the barcode. Required. A.5.2.8 Create Batch Storage Import File Page This page is used to define a new storage hierarchy by specifying several creation rules.",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}