{
    "relation": [
        [
            "Play Type",
            "Out",
            "Out",
            "Walk",
            "Single",
            "Substitution",
            "Single"
        ],
        [
            "Play",
            "Prince Fielder grounded out second to first. None on with one out and Don Kelly due up.",
            "Don Kelly struck out swinging on a foul tip. None on with two outs and Matt Tuiasosopo due up.",
            "Matt Tuiasosopo walked. Runner on first with two outs and Jhonny Peralta due up.",
            "Jhonny Peralta singled to right. On the play, Matt Tuiasosopo advances to second. Runners on first and second with two outs and Alex Avila due up.",
            "Brayan Pena is pinch-hitting for Alex Avila.",
            "Pinch-Hitter Brayan Pena singled to right. On the play, Matt Tuiasosopo thrown out at home, right to catcher, to end the inning."
        ]
    ],
    "pageTitle": "Thursday, May 2, 2013 Detroit Tigers - Houston Astros Box Scores, Game Results & Summary - USATODAY.com",
    "title": "",
    "url": "http://content.usatoday.com/sportsdata/baseball/mlb/game/Tigers_Astros/2013/05/02",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 57302027,
    "recordOffset": 57285507,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{2368=View all MLB box scores for 5/2/2013}",
    "textBeforeTable": "Top of the 1st Tim Welke  3B Scott Barry  2B Marty Foster  1B Mike Everitt  H Umpires 1.08 7 10 0 0 0 0 1 0.2 Jose Cisnero  4.80 44 78 4 4 4 4 7 4.1 Dallas Keuchel (L, 0-1) 4.09 13 19 4 0 0 0 0 1.1 Jose Veras  2.57 3 7 0 0 0 1 1 0 Wesley Wright (BS, 1) 4.80 4 8 0 1 0 0 0 0.2 Hector Ambriz (H, 4) 4.34 6 7 2 0 0 0 0 0.2 Paul Clemens (H, 1) 4.00 10 13 2 0 0 0 0 1.1 Travis Blackley (H, 2) 3.60 54 79 6 1 2 2 6 5 Jordan Lyles  ERA Strikes Pitches SO BB ER R H IP Name 0.00 \" xmlns:fo=\"http://www.w3.org/1999/XSL/Format\" />Astros pitching http://i.usatoday.net/_common/_images/_sports/logos/mlb/astros_22t.png 23 35 4 1 0 0 0 2.1 Luke Putkonen (W, 1-0) 3.18 8 14 1 0 0 0 1 0.2 Darin Downs  1.88 20 32 3 1 0 0 0 2 Joaquin Benoit  0.00 16 27 3 0 0 0 0 2 Jose Ortega  7.52 63 97 7 0 3 3 5 7",
    "textAfterTable": "Out Jose Altuve struck out swinging. Runner on second with one out and Jason Castro due up. Error-passed-ball With Jason Castro batting, Robbie Grossman advances to third on a passed ball by Alex Avila. Runner on third with one out and Jason Castro at the plate. Home-run Jason Castro one-out, two-run Home Run (2) to left scored Robbie Grossman. Carlos Pena due up. Out Carlos Pena grounded out pitcher to first. None on with two outs and Chris Carter due up. Out Chris Carter fouled out to third to end the inning. Top of the 2nd Play Type Play Single Prince Fielder singled to left. Runner on first with none out and Victor Martinez due up. Out Victor Martinez flied out to center. Runner on first with one out and Andy Dirks due up. Out Andy Dirks lined out to right. Runner on first with two outs and Jhonny Peralta due up. Out Jhonny Peralta struck out swinging to end the inning. Bottom of the 2nd Play Type Play Out Fernando Martinez grounded out second to first. None on with one out and Brandon Barnes due",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}