{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "rage",
            "Japanese News",
            "NBC Today",
            "Good Morning America",
            "Home Shopping"
        ],
        [
            "Time",
            "5 am - 6 am",
            "5:40 am - 6:15 am",
            "4 am - 6 am",
            "4:30 am - 6 am",
            "5:30 am - 6 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/01/19/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00156-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 720721027,
    "recordOffset": 720645718,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{61467=MEGAN DOHERTY Canberra legend Robert De Castella, who lost his Chapman home in the 2003 firestorm, believes the national capital is a stronger city 10 years after the disaster., 91158=In 1880, Ned Kelly was denied a burial after his execution. But on Sunday, he will finally be laid to rest., 69234=Top places to go in Australia in 2013., 55947=LUCY MACKEN The offering of James Packer's Bondi Beach pad is just one of a handful of Sydney trophy homes kicking off the 2013 season., 98237=This beautiful 2013 Taronga Wildlife calendar is free in The Sun-Herald this Sunday.}",
    "TableContextTimeStampAfterTable": "{121778=January 26 Australia Day isn't just about the Skyworks on the river., 232252=The top places to go in Australia in 2013, 54925=Get out and about in Brisbane this January 18 to 20., 247005=Lovin' it, Jan 18, 2013, 7:12PM, 124680=January 20 The Grapes and Gallops festival returns to Mount Barker with the South West's richest race., 99898=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 227975=Hot tips for 2012, 246087=majid, Jan 18, 2013, 7:58PM, 259889=January 18 2013, 77184=A special presentation of stories from the devastating 2003 bushfires., 241066=1109 views, 237455=Total votes: 2044., 122760=January 20 Flashmobs are usually secret, but not this one., 236449=Total votes: 2569., 123627=January 23: Rocksters Weezer are bringing their Blue Album to the Perth Arena for a one-off show.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: If nothing else, this will make you a lot more careful. Seconds From Disaster What's on TV Tonight One of Disney.Pixar’s most beloved films ever returns to the big screen. Win 'Monsters, Inc' prize packs Competition We've done the legwork to help you decide which shows to see. Line up your laughs Brisbane Comedy Festival Brisbane TV show looking for energetic kids. The handball's in your court Get out and about in Brisbane this January 18 to 20.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD rage 5 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane NBC Today 4 am - 6 am Channel Nine Brisbane Good Morning America 4:30 am - 6 am Network TEN Brisbane Home Shopping",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}