{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "In three sentences"
        ],
        [
            "Comments",
            "Most of the Security guards on campus are super nice and helpful. They always respond or come to assit students in less than 10 minutes. The area doesn't have the greatest reputation for being safe but the campus is well lit.",
            "The Rogalski food court is convenient and they have a good selection. It's not the cheapest though.",
            "Ambrose has pretty buildings and a beautiful campus. They just built a new dorm building on the corner of Lombard and Harrison. They have town houses on campus as well.",
            "If you complete your work, try, and attend classes, you'll most likely pass you courses.",
            "Ambrose is about community. It's small, students and teachers create close relationships and are very helpful. The staff and professors are encouraging and are knowledgable in their focused field."
        ]
    ],
    "pageTitle": "Saint Ambrose University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Saint-Ambrose-University/reviews?_escaped_fragment_=/show/99515",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00068-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 888106547,
    "recordOffset": 888065253,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{98037=St. Ambrose is a small, closely knit school full of great teachers. I have learned and exponential amount since starting here in 2009 and the marketing/music programs are phenomenal. Having a degree from this university will certainly put a boost in my resume, 38095=The food is good, there is a lot of variety, although it can get boring after a year or two, but the cafeteria can get crowded. Luckily, the school is expanding it now for Fall 2012., 150343=© 2015, Cappex.com, LLC, 140908=At ambrose it get into their PT or OT program you must have a 3.5 gpa or higher so you need to pull off good grades. For nursing you must have a 3.0 or higher. When looking at the nursing program when visiting it seems great! but being a nursing student there is awful!! they keep changing their teachers and the head of the department which makes it hard on the students. I went in as a freshman in 2012 with a certain list of pre reqs and they got a new head of the department my sophomore year and now the prereqs have changed so i wasted money and time on classes that I no longer need. So then you get behind. It was just an aweful experience and not only i have left but many other people have left ambrose and i know of 4 people male and female leaving in spring of 2014, 3236=ambrose has campus security 24 hours, 7 days a week. they also have student security at night before per mar comes to ensure that people who are not supposed to be in the residence halls do not get it. ambrose also has a great residence life staff that does rounds every night of the week to make sure that students are having a fun and safe college experience, 59855=Students pay and get a bang for their buck. Staff is friendly and helpful to all students. there is an 11:1 student to faculty member ratio. Small classes and individual attention are a primacy here.}",
    "textBeforeTable": "05/07/2011 Reviewer is Accepted here and planning to attend soon. Reviewer has been to campus. 6 out of 6 people found this review useful. 1 of 32 Jacqueline from Bartlett, IL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ }",
    "textAfterTable": "02/21/2012 Reviewer is A current student here. 3 out of 3 people found this review useful. 2 of 32 Categories Comments Campus Safety ambrose has campus security 24 hours, 7 days a week. they also have student security at night before per mar comes to ensure that people who are not supposed to be in the residence halls do not get it. ambrose also has a great residence life staff that does rounds every night of the week to make sure that students are having a fun and safe college experience Greek Life there is no greek at ambrose Clubs and Activities too many to write down. you will just have to come and find out when you get on campus. Great for these types of students ambrose is great for students who want a great education, small class sizes and want to meet a wide variety of individuals. Share any unusual traditions or locations on campus there are no real traditions on campus",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}