{
    "relation": [
        [
            "Condition:",
            "Color:",
            "Neckline:",
            "UPC:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item (including handmade items) in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Soft White",
            "Sweetheart",
            "435100000559"
        ],
        [
            "Size Type:",
            "Size:",
            "Designer/Brand:",
            ""
        ],
        [
            "Plus",
            "X-Large (14-16)",
            "Vera Wang Bridal",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.ca/itm/Vera-Wang-Wedding-Dress-VW3511003-NWT-/221381575918?pt=Wedding_Dresses&hash=item338b5ec4ee",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00220-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 411711499,
    "recordOffset": 411673145,
    "tableOrientation": "VERTICAL",
    "textBeforeTable": "Item specifics Seller assumes all responsibility for this listing. 221381575918 eBay item number: Shipping and payments Description current Report item - opens in a new window or tab Covers your purchase price and original shipping. Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab Guarantee:",
    "textAfterTable": "Vera Wang for David’sBridal Wedding Gown VW3511003 NWT Thisstunning gown has never been worn or altered. Simple and elegant. Can bedressed up or down depending on jewelry. Very flattering andversatile. Church or beach ready. Light weight net and chiffon fabric. Sweetheartneckline. Soft White in colour. Size 14. Proper 36D strapless bra slip ($79.00) and garment bag included. Retailsfor $700. Priced to sell $380 If you would like more specific pictures, please do not hesitate to ask. Questions and answers about this item No questions or answers have been posted about this item. Ask a question - opens in a new window or tab Seller assumes all responsibility for this listing. Shipping and handling This item will",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}