{
    "relation": [
        [
            "starting nutrient",
            "proteins and peptides",
            "lipids",
            "carbohydrates"
        ],
        [
            "end product",
            "amino acids",
            "fatty acids and gylcerol",
            "simple sugars (monsacharides)"
        ],
        [
            "enzyme(s) responsible",
            "trypsin and chymotrypsin",
            "Pancreatic lipase with help from bile (not an enzyme)",
            "Pancreatic amylase"
        ]
    ],
    "pageTitle": "Where is food digested?",
    "title": "",
    "url": "http://www.edinformatics.com/math_science/where_is_food_digested.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00241-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 404726395,
    "recordOffset": 404711689,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Sun, 31 May 2015 13:31:06 GMT",
    "textBeforeTable": "Mouth: Mechanical and chemical digestion begin in the mouth where food is chewed. The glands that act first are in the mouth—the salivary glands. Saliva produced by these glands contains an enzyme called ptyalin that begins to digest the starch from food into smaller molecules (maltose). Esophagus: no digestion occurs here. The esophagus is the organ into which the swallowed food is pushed. It connects the throat above with the stomach below. At the junction of the esophagus and stomach, there is a ringlike valve closing the passage between the two organs. However, as the food approaches the closed ring, the surrounding muscles relax and allow the food to pass. Stomach: The next set of digestive glands is in the stomach lining. This is where protein begins it digestion. The stomach lining produce stomach acid (HCl) and an enzyme called pepsin that digests protein. One of the unsolved puzzles of the digestive system is why the acid juice of the stomach does not dissolve the tissue of the stomach itself. In most people, the stomach mucosa is able to resist the juice, although food and other tissues of the body cannot. The stomach has three mechanical tasks to do. First, the stomach must store the swallowed food and liquid. This requires the muscle of the upper part of the stomach to relax and accept large volumes of swallowed material. The second",
    "textAfterTable": "Digested food broken down in the small intestine is the size of molecules and can now pass through the villi into the blood stream through the process of diffusion. Digested molecules of food, as well as water and minerals from the diet, are absorbed from the cavity of the upper small intestine. Most absorbed materials cross the mucosa into the blood and are carried off in the bloodstream to other parts of the body for storage or further chemical change. As already noted, this part of the process varies with different types of nutrients. Finally, all of the digested nutrients are absorbed through the intestinal walls. The waste products of this process include undigested parts of the food, known as fiber, and older cells that have been shed from the mucosa. Large Intestine - Colon -- These materials are propelled into the colon, where they remain, usually for a day or two. Its function is to absorb water from the remaining indigestible food matter, and then to pass useless waste material from the body. It also compacts feces, and stores fecal matter in the rectum until it can be discharged via the anus in defecation. Dietary fiber, or simply called fiber, refers to plant cell wall components that are not digestible. Note: The large intestine houses over 700 species of bacteria",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}