{
    "relation": [
        [
            "First Name",
            "Lonnie",
            "Michael"
        ],
        [
            "Last Name",
            "Johnson",
            "Roman"
        ],
        [
            "Suffix",
            "",
            ""
        ],
        [
            "Covered Official Position (if applicable)",
            "",
            ""
        ],
        [
            "New",
            "",
            ""
        ]
    ],
    "pageTitle": "LD-2 Disclosure Form",
    "title": "",
    "url": "http://soprweb.senate.gov/index.cfm?event=getFilingDetails&filingID=D9D13B30-6AA7-4CAD-A7E7-BCF0B1328362&filingTypeID=60",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00290-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 231214084,
    "recordOffset": 231204653,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{1019=Lobbying Disclosure Act of 1995 (Section 5) - All Filers Are Required to Complete This Page, 41155=HR 2250: EPA Regulatory Relief Act of 2011; provisions related to permits HR 2401: Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011; provisions related to regulations S 214: Big Oil Bailout Prevention Unlimited Liability Act of 2011; provisions related to liability S 231: EPA Stationary Source Regulations Suspension Act; provisions related to Clean Air Act GHG regulation S 394: No Oil Producing and Exporting Cartels Act of 2011 (NOPEC); provisions related to United States authority under court decisions S 482: Energy Tax Prevention Act of 2011; provisions related to Clean Air Act GHG regulation S 600: Use It or Lose It Act of 2011; provisions related to energy production S. Amdt. 215 (Amends S 493: SBIR/STTR Reauthorization Act of 2011): To suspend, until the end of the 2-year period beginning on the date of enactment of this Act, any Environmental Protection Agency action under the Clean Air Act with respect to carbon dioxide or methane pursuant to certain proceedings, other than with respect to motor vehicle emissions; provisions related to GHG regulations S. Amdt. 236 (Amends S 493: SBIR/STTR Reauthorization Act of 2011): To prohibit the regulation of greenhouse gases from certain sources; provisions related to GHG regulations S. Amdt. 277 (Amends S 493: SBIR/STTR Reauthorization Act of 2011): To suspend, for 2 years, any Environmental Protection Agency enforcement of greenhouse gas regulations, to exempt American agriculture from greenhouse gas regulations, and to increase the number of companies eligible to participate in the successful Advanced Energy Manufacturing Tax Credit Program; provisions related to GHG regulations S 511: Boutique Fuel Reduction Act of 2011; provisions related to fuel S 516: Lease Extension and Secure Energy Act of 2011; provisions related to energy production S 520: Volumetric Ethanol Excise Tax Credit Repeal Act; provisions related to ethanol S 587: Fracturing Responsibility and Awareness of Chemicals Act (FRAC Act); provisions related to fracturing S 600: Use it or Lose it Act of 2011; provisions related to energy production S 609: Comprehensive Assessment of Regulations on the Economy Act of 2011; provisions related to economic impacts of regulations S 706: 3-D, Domestic Jobs, Domestic Energy, and Deficit Reduction Act of 2011; provisions related to energy production S 892: Consolidation of Department of Energy and Environmental Protection Agency Act of 2011; provisions related to combining departments S 916: Oil and Gas Facilitation Act of 2011; provisions related to energy production S 917: Outer Continental Shelf Reform Act of 2011; provisions related to technology requirements S 953: Offshore Production and Safety Act of 2011; provisions related to energy production S 1140: Gulf Coast Restoration Act; provisions related to restoration of Gulf of Mexico coastal areas S 1226: Offshore Energy and Jobs Permitting Act of 2011; provisions related to air permits Discussions related to potential ethanol blendwall and Low Carbon Fuel Standard Discussions related to Toxic Substances Control Act reform, 63649=HR 601: End Big Oil Tax Subsidies Act of 2011; provisions related to taxes HR 1689: Big Oil Welfare Repeal Act of 2011; provisions related to taxes HR 1712: Job Creation and Energy Security Act of 2011; provisions related to taxes HR 1834: Freedom to Invest Act of 2011; provisions related to energy S. Amdt. 28 to S 223: To repeal expansion of information reporting requirements under The Patient Protection and Affordable Care Act and for other purposes; provisions related to revenue and funding S 940: Close Big Oil Tax Loopholes Act; Title I, provisions related to taxes Discussions related to proposals in President Obamas Fiscal Year 2011 budget; provisions related to revenue and funding Discussions related to proposals in President Obamas Fiscal Year 2012 budget proposal; provisions related to revenue and funding Discussions related to Corporate Tax Reform Proposals; provisions related to taxes Discussions related to taxes, 12219=HR 2279: Airport and Airway Extension Act of 2011, Part III; provisions related to corporate aircraft, 22946=HR 910: Energy Tax Prevention Act of 2011; provisions related to Environmental Protection Agency GHG regulation HR 1249/S 23: Leahy-Smith America Invents Act; provisions related to patent reform, 29951=HR 501: Implementing the Recommendations of the BP Oil Spill Commission Act of 2011; provisions related to oil spill response HR 527: Regulatory Flexibility Improvements Act of 2011; provisions related to regulations HR 901: Chemical Facility Anti-Terrorism Security Authorization Act of 2011; provisions related to chemical facility security HR 910: Energy Tax Prevention Act of 2011; provisions related to energy production HR 927: United States Exploration on Idle Tracts Act; provisions related to energy production HR 1084: Fracturing Responsibility and Awareness of Chemicals Act of 2011; provisions related to fracturing HR 1149: To amend the Clean Air Act to include algae-based biofuel in the renewable fuel program and amend the Internal Revenue Code of 1986 to include algae-based biofuel in the cellulosic biofuel producer credit; provisions related to energy HR 1229: Putting the Gulf of Mexico Back to Work Act; provisions related to energy development HR 1230: Restarting American Offshore Leasing Now Act; provisions related to energy development HR 1231: Reversing President Obamas Offshore Moratorium Act; provisions related to energy development HR 1287: 3-D, Domestic Jobs, Domestic Energy, and Deficit Reduction Act of 2011; provisions related to energy development HR 1346: No Oil Producing and Exporting Cartels Act of 2011 (NOPEC); provisions related to United States authority under court decisions HR 1380: New Alternative Transportation to Give Americans Solutions Act of 2011; provisions related to natural gas regulations and mandates HR 1473: Department of Defense and Full-Year Continuing Appropriations Act of 2011; provisions related to energy HR 1540: National Defense Authorization Act for Fiscal Year 2012; provisions related to energy HR 1572: Offshore Installation Emergency Evacuation Act; provisions related to energy production HR 1682: American-Made Energy Act of 2011; provisions related to energy production HR 1705: Transparency in Regulatory Analysis of Impacts on the Nation Act of 2011; provisions related to energy regulations HR 1777: To provide consumer relief for artificially high gas prices, and for other purposes; provisions related to energy production HR 1861: Infrastructure Jobs and Energy Independence Act; provisions related to energy HR 1870: Increase American Energy Production Now Act of 2011; provisions related to energy production HR 1938: North American-Made Energy Security Act; provisions related to energy HR 2017: Homeland Security Appropriations Act of Fiscal Year 2012; provisions related to chemical facility security and energy security HR 2021: Jobs and Energy Permitting Act of 2011; provisions related to energy production HR 2055: Military Construction and Veterans Affairs, and Related Agencies Appropriations Act of 2012; provisions related to energy HR 2112: Agriculture, Rural Development, Food and Drug Administration, and Related Agencies Appropriations Act of 2012; provisions related to energy HR 2150: National Petroleum Reserve Alaska Access Act; provisions related to energy production HR 2219: Department of Defense Appropriations Act of 2012; provisions related to energy HR 2354: Making appropriations for energy and water development and related agencies for the fiscal year ending September 30, 2012, and for other purposes; provisions related to energy and water projects H. Con. Res. 34: Establishing the budget for the United States Government for fiscal year 2012 and setting forth appropriate budgetary levels for fiscal years 2013 through 2021; provisions related to energy S 214: Big Oil Bailout Prevention Unlimited Liability Act of 2011; provisions related to liability S 231: EPA Stationary Source Regulations Suspension Act; provisions related to Clean Air Act GHG regulation S 275: Pipeline Transportation Safety Improvement Act of 2011; provisions related to pipeline safety S 394: No Oil Producing and Exporting Cartels Act of 2011 (NOPEC); provisions related to United States authority under court decisions S 482: Energy Tax Prevention Act of 2011; provisions related to Clean Air Act GHG regulations S 516: Lease Extension and Secure Energy Act of 2011; provisions related to energy production S 587: Fracturing Responsibility and Awareness of Chemicals Act (FRAC Act); provisions related to fracturing S 600: Use it or Lose it Act of 2011; provisions related to energy production S 602: Clearing Unnecessary Regulatory Burdens Act; provisions related to guidance documents for major rules and regulatory issues and processes S 609: Comprehensive Assessment of Regulations on the Economy Act of 2011; provisions related to economic impacts of regulations S 706: 3-D, Domestic Jobs, Domestic Energy, and Deficit Reduction Act of 2011; provisions related to energy production S 892: Consolidation of Department of Energy and Environmental Protection Agency Act of 2011; provisions related to combining departments S 916: Oil and Gas Facilitation Act of 2011; provisions related to energy production S 917: Outer Continental Shelf Reform Act of 2011; provisions related to technology requirements S 953: Offshore Production and Safety Act of 2011; provisions related to energy production and energy efficiency S 1140: Gulf Coast Restoration Act; provisions related to restoration of Gulf of Mexico coastal areas S 1226: Offshore Energy and Jobs Permitting Act of 2011; provisions related to air permits HR 4173 (111th Congress): Dodd-Frank Wall Street Reform and Consumer Protection Act; provisions related to transparency Discussions related to energy development Discussions related to shale gas Discussions related to energy and trade issues in Free Trade Agreements Discussions related to budget, debt, energy security and access}",
    "textBeforeTable": "",
    "textAfterTable": "City IRVING State TX Zip Code 75039 Country USA 3. Principal place of business (if different than line 2) City   State   Zip Code   Country   4a. Contact Name b. Telephone Number c. E-mail  Ms.  COURTNEY S. WALKER  9724441181  courtney.s.walker@exxonmobil.com 5. Senate ID#  14017-12",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}