{
    "relation": [
        [
            "Categories",
            "Campus Safety",
            "Greek Life",
            "Clubs and Activities",
            "Great for these types of students",
            "Share any unusual traditions or locations on campus",
            "Bang for the buck",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "There are lots of safety guards and lots of things put in place to make us safe. It isnt in the best location and people do get mugged pretty close to campus but if you don't go out walking around the burger king at 3am you should be fine.",
            "there are no frats or anything like that here sorry.",
            "we have quidditch if you like harry potter. there are lots of harry potter type clubs. we have a very nice hulahoop club. videogame club. lgbt community, lots of drawing clubs. lots of activities like dances and events.",
            "Artistic, hardworking,",
            "Its just really nice, everyones going there for a similar thing so everyone has common interest so they get along. Most colleges aren't like that.",
            "Its really expensive. you could go to a four year college for the price of one year hear. I have no idea if i made the right decision or if its worth it. I just hope it is.",
            "Art, people just hang out and draw and thats what you're going to be doing for a long time. We also play video games and watch movies. Everyone id very nice and its easy to make friends",
            "Its alright. Im a vegetarian and there weren't many options for me but they try and what i could eat was good.",
            "Everyone is very friendly and nice. I lived in Goldstein my first year on the 5th floor and it was very nice. Ive seen most of the other dorms and they are nice too. Goldstein is significantly nicer though because its newer and has more stuff. They also have apartments with kitchens and those are nice too.",
            "Its hard but worth it.",
            "Work very hard. You get what you put in. Even if it gets to hard just keep going, its worth it.",
            "Ringling college of art and design is very friendly and informative. They make sure you learn what you need to learn. At times its tough but if you can pull through its worth it if that really what you want to be in the industry."
        ]
    ],
    "pageTitle": "Ringling College of Art and Design Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Ringling-College-of-Art-and-Design/reviews?_escaped_fragment_=/show/12600",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00011-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 905238711,
    "recordOffset": 905186829,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{218972=© 2015, Cappex.com, LLC, 154138=We unfortunately live near the ghetto. Don't walk alone at night. Don't guard your 1000 dollar bike with a cheap lock. Don't carry your Macbook around at night. Stay on campus. You'll be fine.}",
    "textBeforeTable": "08/06/2009 Reviewer is A current student here. 36 out of 36 people found this review useful. 1 of 46 Phillip from Punta Gorda, FL Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new",
    "textAfterTable": "Am learning a lot As anyone who has heard of Ringling College of Art and Design will know, Ringling is one of the top colleges in the WORLD for artists and designers. Everyone at the school begins with the same curriculum-- basic studio classes such as drawing and 3D are required (however, next year the curriculum is changing, and many core classes will not be required anymore e.g. Film majors won't need to take drawing). These basic classes start everyone off at the same page. If you're someone like me, who hasn't had any formal art education before Ringling, you'll definitely be brought up to speed by professors who are high-quality, well-known professionals in their own fields. If you're a bit more experienced, there are plenty of school competitions and opportunities for you to stretch your creative muscle as well. Login to rate or flag the reviews Chelsea from Jacksonville, FL 06/01/2011 Reviewer is A current student here. 8 out of 8 people found this review useful. 3 of 46 Categories Comments Great for these types of",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}