{
    "relation": [
        [
            "",
            "plain present form",
            "3rd sg present form",
            "preterite form",
            "plain form",
            "gerund-participle",
            "past participle"
        ],
        [
            "lie \"tell untruths\" (intransitive)",
            "lie",
            "lies",
            "lied",
            "lie",
            "lying",
            "lied"
        ],
        [
            "lie \"be recumbent\" (intransitive)",
            "lie",
            "lies",
            "lay",
            "lie",
            "lying",
            "lain"
        ],
        [
            "lay \"deposit\" (transitive)",
            "lay",
            "lays",
            "laid",
            "lay",
            "laying",
            "laid"
        ]
    ],
    "pageTitle": "Language Log: May 2004 Archives",
    "title": "",
    "url": "http://itre.cis.upenn.edu/~myl/languagelog/archives/2004_05.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00131-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 119182959,
    "recordOffset": 118938526,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{451204=It is true that in my 350-word post with no verbs in it, just to have something to say, I chose to lambast Thaler as a posturing fool (\"nuts, bonkers, round the bend. Mad as a March hare...\"). However, I was completely insincere. I have not even laid eyes on Le Train de Nulle Part. It might be fascinating. For I can tell you this: I myself found it extraordinarily challenging to write without verbs. I couldn't believe how hard it was. Moreover, as I tried it I kept finding myself driven into a much more florid, literary, poetic style than normally comes out of me (not all of what I wrote survived in the posted draft). I have no idea what might emerge if I tried a serious full-length literary work in that mode, but just trying to do 350 words was highly instructive., 640628=In 2004, things are quite different. The notion of the city as unhealthy for one's morals is antique. We pity urban residents dealt a bad hand, but hardly suppose that they would be best off relocating to Gopher Prairie -- we assume that The City should be made a better place for them. And every second short story in THE ATLANTIC shows us small-town folk underemployed, understimulated and on the brink of divorce. To us, \"America\" writ large is a list of the big cities, with the other places \"in between,\" just as Germany is Berlin, Munich, and Cologne, not Regensburg, Wiesbaden and Siegen., 598478=Actually, the web site of her organization, the oddly named Requisite Organization International Institute, reveals (see this press release) that the relevant work was the dissertation research of Dr Alison Brause, who is not mentioned in the New Yorker piece (it says \"Cason has discovered\" and so on; it appears that should be \"Brause has discovered\"). Cason, via McGrath, appears to give a rather fuddled account of Brause's research. It appears to be this simple. If you use or you are doing declarative thinking. If you use and you are doing cumulative thinking. If you use if you are doing serial thinking. If you use if and only if you are doing parallel thinking. These indicate four successively more advanced levels of complexity of thinking, and the winner in a presidential race is always the more complex thinker. Bush is mainly cumulative, like Clinton, Mondale, and Nixon before him. But Kerry is serial, which is superior: Cason is 100% confident that he will win in November., 301311=I for one can't believe that they seriously think it is damaging to their interests if I say I am so impressed by Word's many cool features (using a genitive form of the Microsoft trademark Word®). I think that (once again) we have a case of people who want to say something that involves grammar only they have no idea how to control the terminology so as to say what they mean., 209940=Arnold has explained lucidly why splitting an infinitive is sometimes obligatory, as in \"to more than double.\" But in the interest of historical accuracy (vulgarly known as \"claiming credit\"), I should point out that the observation, if not its elucidation, is first recorded in the usage note for \"split infinitive\" that I wrote for the third edition of the American Heritage Dictionary, which appeared in 1993. It reads, in part:, 478721=Just possibly, an exercise, for the undergraduates in my course on English grammar this fall quarter. Their mission: an effort at construction of fifty words of coherent prose with never a verb; the point: only those in possession of enough grammatical knowledge for verb identification capable of success. Worth a try? Perhaps. And in that case, a word of gratitude to Thaler (otherwise an unimportant screwball). Always that extra possibility: the idea justifiable not because of its implementation, but in virtue of a complementary or counterposed idea emergent in the mind of someone else -- serendipitous bastard offspring of a deranged cognitive parent. So my gratitude to this pusillanimous poseur, this literary clown. A new idea, my idea, all mine (accessible here on Language Log to just a few thousand close friends)., 493327=I didn't find anything in Irvine's 1989 article about acquired disfluency and morphological ineptness among Wolof nobles. I'll continue to surmise that this is discussed in the 1978 article, at least until I have a chance to get to the library and read it.], 32793=It was the words \"in Arabic\" that truly shocked me. The source: Jeffrey Goldberg's long article \"Among the Settlers\" in the May 31 New Yorker (related slide show with audio here). The scene: outside Hadassah House, home to several families of Jewish settlers in Hebron, across the street from the Córdoba School for (Palestinian Arab) girls., 290681=The time function of counts may not be reliable in this source -- I think the date restriction is based on file dates in a current snapshot, not samples collected at different times -- but such as it is, this evidence certainly doesn't support the view that \"last winter [cold snap] disappeared and was never uttered again\". As a spot check, Google's news search shows plenty of recent news items using \"cold snap\", such as this Chicago Sun-Times \"Midwest Fishing Report\" dated May 19, 2004, which tells us that, 273877=I have only just seen for the first time your column of December 26, 1996, \"To Throw in a Lot of 'Bes,' or not? A conversation on Ebonics.\" There was one thing about it that fascinated me., 639525=But I wasn't alone. A few years later, a girlfriend of mine was given to road-rage moments when stuck behing a slow-driving old person where she would grouse \"You can turn now, GRANDPAW!\" But why the Li'l Abner appellation? Whence her natural sense that an oldster in 1985 was GRANDPAW rather than GRANDPA? I highly suspect she picked it up from reruns on the tube like I did., 594090=It's partly our fault because we've allowed the educational system to turn out PhDs who think and write like this about the structure of arguments. It's pretty clear that if the Requisites ever took a course in logic or philosophy of language, not much of it stuck. We've come a long way since grammar, rhetoric and logic were viewed as the trivial foundations for any other sort of education., 393576=Although the use of IPA is still distressingly uncommon, these are by no means the first. Just rummaging through books I have on hand, I see that 小沢重男's モンゴル語四週間 (Mongolian in Four Weeks), published in 1986, uses the IPA to explain the Cyrillic writing system for Mongolian. So it isn't as if the IPA is a recent creation or that publishers and textbook authors have been unaware of it., 447633=This is no accident; more than, up to, and over are in fact prepositional modifiers (Cambridge Grammar of the English Language, pp. 357, 432f.), and like prepositions in general, must be immediately adjacent to the expression they combine with:, 74622=The traditional statement about imperative clauses is that they express commands: they are for bossing people around, telling people what to do. This is not so. Imperatives express a much wider range of meanings, referred to in The Cambridge Grammar as directives. In today's Garfield cartoon strip (May 28, 2004) the difference comes out clearly., 97833=\"the marriage register contains an entry of the names of Thomas Tilsey and Ursula Russel, the first of whom being \"deofe and also dombe,\" it was agreed by the bishop, mayor, and other gentlemen of the town, that certain signs and actions of the bridegroom should be admitted instead of the usual words enjoined by the Protestant marriage ceremony\" (The Mirror of Literature, Vol. 20, Issue 572, October 20, 1832; http://www.gutenberg.net/1/1/8/6/11863/11863-h/11863-h.htm) {type (b)}, 281898=I forwarded the posting on Wolof men to my professor, Omar Ka, who is native Senegalese, and he wrote, 418475=Evidently this fiction-writing business (in which I am not an expert) has more rules than I thought. Perhaps if I limited myself to novels that respected all of the rules it would get me down to such short lists that it would be easy to pick the next novel I should read (I don't know if I dare admit this to you, but I read one novel a year, whether I need it or not; I don't have time for more than that, and occasionally I skip a year \u0097 or waste a year the way I wasted 2003 on The Da Vinci Code)., 270855=The occasion for writing the letter was that I had just seen the remarkably unfunny humorous column Raspberry published in the Washington Post on December 26, 1996, right after the Oakland story broke. Like everyone else, he was indirectly mocking the Oakland Unified School District and the idea of making an unprejudiced judgment about the sociolinguistic situation of many of Oakland's black schoolchildren, and directly mocking `Ebonics'., 285304=As Diane pointed out, this strongly suggests that the Marthambles (and perhaps the others as well) were not in fact invented by Dr. Tufts in 1675, but were taken by him from a popular culture of medicine that had been around at least since Tudor times. And therefore, Dorothy Dunnett is absolved of any taint of anachronism., 164939=\"The partnership between Mfume and Bond, both of whom having held elective offices for many years, pushed the NAACP aggressively back into national politics in the 2000 election.\" \"...it was fascinating to find the many fields of medicine entered and the many locations chosen by those of us who attended Duke Medical School together just after the war, most of whom having also been in the armed services.\" \"She seems to know and be known by a great many residents, many of whom I also know, several of whom being some of the finest elder members in my own congregation, Nashville’s Second Presbyterian Church.\" \"CFA has grown to represent many of the leading names in UK chilled food production, who employ more than 50,000 people around the UK, many of whom being in rural areas.\" \"He was one of four brothers, three of whom having died or departed.\" \"Two associate members and two alternates (none of whom having a prior or present employment relationship with the Fund) would be appointed by the Managing Director after appropriate consultation.\" The design and manufacture of the prototype is predicted at a total of eight months, three months of which being design., 284328=I observed at the time that a date of 1675 for the source pamphlet would have made the Marthambles an anachronism both in Dunnett's book (which is set in 1555) and in O'Brian's (which is set in 1811)., 85355=The Adrienne theater is now showing a play called 'Speech acts' written by Claire Gleitman (Lila and Henry's daughter). This is a play about the successful career and not-so-successful marriage of a female linguist. It is a rare opportunity to see a play where the characters agonize over giving LSA papers, academia, prescriptive grammar and the Great Vow Shift (after all, the play is also about a troubled marriage). The play is very funny - I saw it last night at the premiere and really enjoyed it., 616211=[Update 2004/05/11: Quite a few people want to know where to get 芝士士的巻. The place is called Evergreen and is located at 4726 Spruce Street. The telephone number is: 215-476-0371. Cheese steak rolls are only $1.20.], 76031=In the May 28 Ecommerce Times, Naseem Javed has a \"Viewpoint\" article entitled \"Six Questions to Spur Web Success\". Question number 5 is:, 269716=I wrote the letter a few months after the disastrous press reception of the Oakland, California, school board's declaration on the possible educational importance of classroom use of what they most unwisely called `African Language Systems'. At just one point they also mentioned the name `Ebonics', and that was the name the press picked up on as they went into an orgy of riducle and outright hostility. (If you don't know the story, John Rickford's writings might be the place to start reading.) At the time, my own unwise practice (as in my commentary \"Language that dare not speak its name\" in Nature 386, 27 March 1997, 321-322) was to call the language in question African American English (AAE), since that was shorter than the familiar linguist's term African American Vernacular English (AAVE). What's unwise about that is that of course millions of African Americans don't speak the language at all; it is a vernacular dialect restricted mostly to uneducated residents of segregated areas. (I have corrected AAE to AAVE in the letter below.), 456170=In fact, it was not until 1923, some 172 years after Franklin's complaints, that the U.S. Supreme Court determined that \"mere knowledge of the German language cannot reasonably be regarded as harmful.\" And now, 253 years later, the collateral descendents of the Palatine boors in question (i.e. peasant farmers from south-central Germany) have apparently lost track of their history., 306071=The trouble is, of course, that the old definition is a complete crock. It is almost useless. Not completely useless, mark you: as Rodney Huddleston and I point out in Chapter 1 of The Cambridge Grammar of the English Language, it is useful in identifying which of the word classes in a language is the one that corresponds to the class we call noun in English (or any other language we've analyzed). The words we should call nouns in Japanese are the ones in that class of words (and there will be one) which includes the most basic words for kinds of thing, sorts of place, and types of people. There will be Japanese words for rice, bowl, tree, dog, hill, ocean, man, woman, etc. When you've found the grammatical class of words that includes those, you've found the nouns in Japanese., 13582=If I have one ambition for my professional life, it is to do something to drive back the dark forces of grammatical fascism of this kind, to help get English language teaching back into a state where the things that are taught about the grammar of the language are broadly the things that are true, rather than ridiculous invented nonsense like that all words are forbidden except where they are required., 351249=Well, I don't know who is paying that copy editor, but if she were working for me she would be toast, because every single thing about English grammar here is wrong., 444324=(5) a. ... These products have allowed the company's turnover more than to double: from £66.3m in the year to June 30 1998 to £150m in the 2001 -02 financial year. b. ... It is rubbing salt into the wound more than to double the charges at such short notice. I appeal to the Minister and to his right hon. and hon. ... c. ... If the cost of living has more than doubled, it would be necessary more than to double the pension in order to keep the recipients on the same poor scale of ..., 234876=\u0097 how could anybody think it was incorrect to use trademarks as nouns, given that millions of dollars are committed to the details of big advertising campaigns and the company controls every line and every word of the copy used? The answer: even quite educated people today know so little about grammar that often they aren't really sure what's a noun and what's not, what's a tense and what's not, what's a passive and what's not, etc., etc., 636390=An old Bugs Bunny cartoon of 1944, THE OLD GREY HARE, depicts Bugs and Elmer Fudd as old men going through their usual antics with canes, gray beards, spectacles and the shakes. But these aren't the only traits indicating their having reached their twilight years. Bugs, as an oldster, talks in a hillbilly accent., 10942=I talked recently with an undergraduate who told me something about her grammar instruction in the Los Angeles public schools. And in addition to the usual nonsense about not ending sentences with prepositions and never using \"contractions\" and things of that sort, she told me a new one. She was told that sentences like the one you are now reading are ungrammatical., 293220=Comparing scaled counts, with the first half of 2002 set to a value of 1, suggests that \"big reveal\" is indeed booming this past year year to a larger extent than \"cold snap\":, 216107=Now that the summer is starting, here's an extended quotation on learning in school and out of it, from Walker Percy's 1954 essay The Loss of the Creature (available in his collection of essays The Message in the Bottle: How Queer Man is, How Queer Language Is, and What One Has to Do With the Other)., 66168=The people working on (2) are doing brilliantly. (Notice, the spotting of likely spelling mistakes in Google and advanced word processors is an aspect of (2), and deserves some real respect.) But work on (1) was all but abandoned in industry some ten years or more ago. It didn't have to be. Nothing was discovered that made people decide syntax or literal meaning were impossible to grapple with algorithmically. I am not ready to believe that centuries will have to elapse before I can send email to a shopping robot \"Get me price information on Simmons Beautyrest mattresses from at least five stores in Northern California\" and get some useful data back in response. Sure, there are some syntactically irresolvable ambiguities in there (is it mattresses from five stores, or information from five stores?). But Google's ad-relevance technology could pretty much figure out what I want even without analyzing the grammar. If we brought even just a little grammar together with some educated guesswork and smart search technology, we could have something really remarkable. Not intelligence and empathy \u0097 we're going to be talking about something vastly less intelligent than a cockroach here, and an equivalent level of empathy, i.e., none \u0097 but it could still be something very effective, something that you could easily mistake for rapid and effective assistance from an intelligent entity that had understood the gist of what you said., 566196=It's not the slightest bit unusual for educated people who are excellent writers to be unable to state grammatical generalizations correctly. And as Mark recently wrote here, \"It's partly our fault because we've allowed the educational system to turn out PhDs who think and write like this... We've come a long way since grammar, rhetoric and logic were viewed as the trivial foundations for any other sort of education.\" Sunk a long way, he could have said., 244929=The bottom line: it is raving, wild-eyed lunacy to say that no trademarks are corectly used as nouns or that they always have to be attributive modifiers. No company respects these principles; no company could. Yet the people at INTA aren't raving, wild-eyed lunatics. It's just that like an enormous percentage of the educated population of the USA, they know virtually no grammar at all. The schools aren't teaching it, and the linguistics departments that know about it aren't reaching enough college-going students., 59410=1952 R. JAKOBSON et al. Prelim. Speech Analysis 31 Flat vs. Plain...Flattening manifests itself by a downward shift of a set of formants., 596337=The original example of this kind was something like \"More people have been to Russia than I have\", though other versions mentioning Moscow, Berlin, and Brooklyn have also been cited. The example type has been attributed to Andy Barss, Elliott Moreton, Lance Nathan, Colin Phillips, Chris Potts, Ken Shan, William Snyder, and probably others, but in fact researches by Kai von Fintel have revealed that the original source was probably an actual occurrence in the speech of Herman Schultze. He uttered the sentence in the presence of Mario Montalbetti, who thanks Schultze on page 6 of the Prologue to his 1984 MIT dissertation After Binding: On the Interpretation of Pronouns \"for uttering the most amazing */? sentence I've ever heard\". Von Fintel also found that a student at the University of Houston has actually used in an op-ed piece the sentence I admit that more people have been to Iraq than I have, so I don't know everything. But he may have been kidding; the piece is apparently intended to be humorous., 289097=Well, in the first place, I'm with Jacob (and other commenters) who think that \"cold snap\" is an old standard -- and I grew up in rural eastern Connecticut. I also haven't noticed any recent peak and subsequent decline in usage. The OED says that \"cold snap\" is originally from the U.S., and gives a citation from T. Smith's \"Jrnl.\" for 1776. Using Altavista's \"Advanced Web Search\", I get the following counts for \"cold snap\" within the past five six-month periods (ignoring that 2004 isn't half over yet):, 389608=The situation is similar with language textbooks. I recently had occasion to use John Mason's Tigrinya Grammar (Lawrenceville, NJ: The Red Sea Press, 1996). Tigrinya is a language whose sound system is quite exotic from an English speaker's point of view. It has a series of ejectives, voiced stops that are truly voiced even in word-initial position, phonemic glottal stop, and several fricatives absent from English, including a pair of pharyngeals. The English speaker desirous of learning Tigrinya is going to need some assistance with the sound system. This is not provided by the textbook. It uses the Ethiopic script, in which Tigrinya looks like this: ሰዋስው, throughout, without transliteration. That's very hard on the learner, who needs some practice with an unfamilar writing system, and some confirmation that he or she is reading it and writing it correctly. What is worse, the explanation of the Tigrinya writing system uses an ad hoc transcription system. Some of the ejectives are simply not indicated as being ejective; others are incorrectly labelled \"plosive\". Several Ethiopic letters are transcribed by the letter q, alone or in combination. If this means anything to an English speaker, it will probably be taken to indicate [kʷ]. In fact, it represents an ejective velar stop; the combinations represent a glottalized velar fricative and labialized versions of the first two. There is no way that anyone could learn this from the textbook., 319071=Americans traditionally are not enormously interested in studying the languages of other countries, a fact that I take to be well known. Sometimes it almost seems that if a public figure is well acquainted with a foreign language other than Mexican Spanish he needs to conceal it. And linguistic general knowledge is so sorely lacking that Language Loggers find public dimwittedness on linguistic topics to mock nearly every week. But let's not ignore good news. Language Log has not overlooked the encouraging and remarkable facts revealed a few weeks ago by a Modern Language Association report, based on Fall 2002 enrollments in courses as compared to Fall 1998: all languages shot up, especially the less commonly taught ones, and some are up by very substantial factors indeed., 174514=A transcript entitled \"Gen. Anthony Zinni, USMC (Ret.) Remarks at CDI Board of Directors Dinner, May 12, 2004\" contains the following phrase:, 40378=1881 Punch 23 July 25/2 The same aged lover was bidding, with rather a ‘plummy’ voice, the More-than-Middle-Aged Heroine ‘good bye for ever’. 1947 Jrnl. Inst. Electrical Engin. XCIV. IIIA 446/1 Such distortions can be tolerated..without serious loss of articulation, though the speech will usually sound rather ‘plummy’ and unnatural. 1951 K. HARRIS Innocents from Abroad 199 The rich, plummy voice of [actor] Edward Arnold. 1955 Times 3 May 14/4 A disc which sounds plummy and muffled in tone. 1965 G. MCINNES Road to Gundagai xi. 197 His voice..was wonderfully plummy and Edwardian. 1970 Daily Tel. 1 Sept. 9/5 All India Radiomodelled..on the BBC, even down to the plummy accents of its announcers. 1975 City Press 1 May 16/5 Her duchess on the make is a finely pointed performance, the plummy vowels contrasting splendidly with consonants periodically marred by the lack of false teeth. 1977 Early Mus. Oct. 549/3 The plummy..tone [of Flemish virginals] is evidently more popular than the musically versatile but astringent Italian virginal. 1978 Gramophone Feb. 1439/1 His tone is mellow, but again, as in the Waltzes..the sound sometimes seems a bit plummy and close., 237483=But notice, none of this is relevant to other products, for example, cars: Porsche is surely very happy for you to praise Porsches as much as you like, calling them Porsches. INTA's intent is clear, but what is actually stated about grammar on their website and in their brochure is nothing like what it is trying to say., 312227=Bill Poser recently remarked, in a post submitted at 1:39 a.m. on May 18 (make sure you get some sleep, Bill) that although there is an evolutionary psychologist called Fitness and there used to be brain scientists called Brain and Head, \"I can't think of any linguists whose names reflect their profession.\", 467045=Here the analysis of The Cambridge Grammar facilitates things a little. There is a tradition in the grammar scholarship of the period 1500-2000 of equating the notion \"adjective\" with the function of qualifying the meaning of a noun. Take, for instance, the phrase I just used in the sentence that precedes this one: \"grammar scholarship\". Since \"grammar\" qualifies the meaning of \"scholarship\" there, as the tradition has it, \"grammar\" must be an adjective. The Cambridge Grammar rejects that tradition. It claims that grammar is a noun. Always a noun. But nouns can be used as modifiers of nouns. That is, they can be used attributively. It doesn't make them adjectives, any more than using an axe to hammer in a nail makes the axe a hammer., 413048=Indeed. Though Thaler already has a distinguished etymological history in English, via the (literal, silver) coinage of St. Joachim's Valley; the OED cites: 1864 CARLYLE Fredk. Gt. XVII. v. IV. 571 'Let my ducat be a Joachimsthal one, then!'.. 'a Joachimsthal-er'; or for brevity, a Thal-er; whence Thaler, and at last Dollar. ], 586267=Back in January, Geoff Pullum mentioned in passing Henry Sweet's listing of the four pronunciations of have:, 569203=        [Leaves of Grass, 1860-61], 563583=The writer of the Respectful of Otters blog (named Rivka, I noticed only after drafting this), is a highly educated psychologist whose series of posts on the Abu Ghurayb revelations I have been reading with admiration. The writing is clear, trenchant, sometimes brilliant. But even for the highly educated in this country, grammar instruction is now so cursory and misguided that it is rare for a non-linguist to be able to go through a passage of prose and pick out, say, the passive clauses. I pointed this out before (here) with respect to a published report on media bias against Israel, in which a claim crucially depended on distinguishing passive from active clauses, and the rate of correct identification achieved was 1 out of 3. In this passage Rivka does better than that, but still gets only 2 out of 3 correct:, 638550=And the Looney Tunes squad had pulled the same thing in an earlier Red Riding Hood parody in 1937, LITTLE RED WALKING HOOD. This time Red talked like Katherine Hepburn, but Granny again had an Ozark accent, as well as a stereotypical fondness for her nip, furtively ordering gin over the phone., 617926=Although in theory all six languages have equal status, some languages are more equal than others. English, French and Spanish are the working languages of the General Assembly; English and French are the working languages of the Security Council. Public information is often not translated into Spanish, Arabic, and Chinese. This led to a protest in 2001 by the representatives of the Spanish-speaking countries., 186494=So a bit less than a year ago, Google indexed 3.3 billion textual pages, vs. 4.3 billion now. That's about a 30% increase. At that rate of increase, the index will double in size in about 2.5 years, and will increase by a factor of 100 in about 17.5 years. In 2021, Google may or not still be in business, and the web will certainly be organized in very different ways -- average document sizes may be quite different, to mention one trivial matter -- but to the extent that we want to make comparisons of frequencies over time -- even over a couple of years of time -- we'd better do our best to normalize counts somehow. And we linguists aspire to work on a time-scale of centuries, if not millennia., 251790=My main exposure to grammatical analysis of rodent behavior has been via the stochastic grammar of cephalocaudal grooming in mice, but Anne explains that \"in rats, most sequences appear to be loosely organized\", so that perhaps this is not such an interesting subject in that species. As an alternative, let me suggest applying grammatical methods to studying the political economy of allogrooming, as Pavel Stopka and David Macdonald did in (\"The Market Effect in the Wood Mouse\", Ethology , vol. 105 no. 11 p. 969 (1999)):, 560903=According to difference theories (sometimes called two-culture theories), men and women inhabit different cultural (and therefore linguistic) worlds. To quote from the preface to Deborah Tannen's 1990 popularization You just don't understand, \"boys and girls grow up in what are essentially different cultures, so talk between women and men is cross-cultural communication.\", 140356=But maybe not, because as I recall (and I might be misremembering), Gordon's explanation for the asymmetry in compounds had to do with late vs. early plural formation, depending on whether it was the default regular plural (as in rats) or an irregular plural like mice; and that wouldn't be relevant for the list in the logging book. I also don't think the asymmetry is an idiosyncrasy of this author, because it sounds fine to me, and replacing mice with mouse doesn't. So what governs this pattern in the list of mammal sightings? I'm hoping that a blogger with more insight into English grammar than I have will provide The Answer., 387172=Nowadays, with computer word-processing there is no reason not to use standard IPA symbols. The fonts are readily available. If you use a Unicode editor such as yudit or a Unicode-capable word-processor, you might try the Code 2000 font, available here. This font covers pretty much all of the Basic Multilingual Plane, which includes all of the IPA symbols. A smaller font, covering just the IPA, variants of the Roman alphabet, Greek, and a few others, is the Lucida Sans Unicode font. If you use Microsoft Word, you can download one of the free fonts available from the Summer Institute of Linguistics here. Depending on your software and your preferences you will enter the IPA symbols in different ways. It may be necessary to know the numerical codes, either to enter them directly or to set up your keyboard. Lists of numerical codes can be found here, here, and here., 318004=Frankel has a weblog, but as of today, its only post (from May 7) says \"This is a test.\" The book does have a web site with actual content, though, including links to other magazine articles that he's written on the subject., 472352=When the second volume appeared in 1786, Gibbon again arrived to offer a personal copy. The duke's reply? \"Another damned, thick, square book! Always scribble, scribble, scribble! Eh, Mr. Gibbon!\", 191270=The term \"ghit\" for \"Google hit\" is slowly beginning to get established, at least here on Language Log. It seems to me unfair to Google&tm; to use the lower-case \"g\"; it should be \"Ghits\". We should honor Google (a company that includes \"You can make money without doing evil\" as part of its corporate philosophy deserves our respect) the way Heinrich Hertz (1857-1894) is honored in the abbreviation \"Hz\", the basic unit of measurement for frequency of wave vibrations. The term for the unit should be the Ghit, with capital G, pronounced G hit (\"jee hit\"), and the abbreviation should be Gh., 435763=2b. To put out of countenance, abash, dismay. 1607 TOPSELL Four-f. Beasts (1658) 160 Casting..burning torches into the face of the elephant; by which the huge beast is not a little disgraced and terrified., 203001=[First found early in 15th c. No corresp. adj. in Teutonic, Romanic, or Celtic. The general spelling down to the 18th c. was identical with that of the n. COURSE; with that word it is still identical in pronunciation, both in standard English and in the dialects (e.g. Scotch kurs); the spelling coarse appears to have come in about the time when the pronunciation of course changed from (u), to (o). Hence the suggestion of Wedgwood that coarse is really an adj. use of course, with the sense ‘ordinary’, as in the expression of course, ‘of the usual order’. It appears to have been used first in reference to cloth, to distinguish that made or worn in ordinary course from fine cloth or clothes for special occasions or special persons; ‘course cloth’ would thus be ‘cloth of (ordinary) course’. Cf. the history of mean, and such expressions as ‘a very ordinary-looking woman’, a ‘plain person’. Our first contemporary example of the spelling coarse is in Walton 1653 (where course however also occurs; it became frequent after 1700; course occurs occasionally down to 1800.], 472590=And as a suggestion that acquired disfluency has also had a place in that strange culture, consider this passage from Hilaire Belloc's 1910 Dedicatory Ode:, 641754=Today this would make no sense. We do not spontaneously sense a person past sixty living in Philadelphia, Chicago or San Francisco as talking like Dolly Parton or Jeff Foxworthy. But the demographic tipping point in 1930 helps make sense of a tendency in the entertainment of the era that, otherwise, is intriguingly mystifying. Diane Keaton will be sixty in a couple of years -- and yet I doubt that in SOMETHING'S GOTTA GIVE, PART TWO she will be saying things like \"Aintcha gonna eat me?\", 57774=1874 R. MORRIS Hist. Eng. Gram. §54 B and d, &c. are said to be soft or flat, while p and t, &c. are called hard or sharp consonants., 159925=So that's my current proposal: measuring currency of (sets of) strings on the web by whG/Gp. Though we probably haven't heard the last of this thread. We may need a national standards committee to make recommendations to a central council standing executive committee which will then report to the membership at large through delegates to a national congress... yawn... I never wanted to become a national standards administrator. I'm a grammarian. Grammar is fun. Grammar is exciting., 402281=The Dante Club's front matter tells us that \"Matthew Pearl graduated from Harvard University summa cum laude in English and American literature in 1997, and in 2000 from Yale Law School\". I ask you, is it likely that a person with that background would be so insensitive to the norms of the English language?, 637164=In a 1932 musical film STRIKE ME PINK with Eddie Cantor and Ethel Merman, in one song near the end they are transformed into oldster versions of themselves (never mind why), and suddenly they are cackling along in \"Consarn it!\" accents that neither of the urban characters they were playing in the film used., 44838=[Note for Americans who (like me) don't follow British politics very closely: Boris Johnson has not suffered too much after losing his Radio 4 gig: Simon Hoggart wrote a few days ago in the Guardian that \"in the fullness of time [Boris Johnson] will probably become prime minister\". So apparently plumminess is not terminally out of fashion in the U.K. -- assuming, as I do, that Johnson did not take Gregory de Polnay's 1999 advice. I'm not sure whether Hoggart is serious, however, since most of his article deals with aspects of British culture that are opaque to me, such as what it means that Johnson \"produced a used envelope and tossed it onto the table of the house\", or why Mickey Fabb \"will be polishing [Boris'] bat with linseed oil\".], 285165=Although I've not read Copeman's book, I've ascertained that it was published in 1960, in London by Dawson., 520154=Consider the following passage from D.H. Lawrence's 1928 novel Lady Chatterly's Lover. Here Lady Chatterly (Connie), first encounters her husband Clifford's gamekeeper, Mellors., 321687=[Source: Foreign language enrollments in United States institutions of higher education, fall 2002 by Elizabeth B. Welles, available as a PDF file from the web site of the Association of Departments of Foreign Languages.], 485551=[Update: Mark S, in a comment on Language Hat's site, points out that Thaler was scooped in 2001 by Miranda Tedholm, a 17-year-old New Jersey high school student. A female New Jersey high school student, in fact, whose brain capacity was enough larger than Thaler's for her to have the idea first, and then to give it up after seven paragraphs and a Scholastic \"Art and Writing\" award in the category of humor., 315495=Nathan Bierma at Nathan's Notebook offers a blizzard of interesting Wordcraft links: his own Chicago Tribune review, on-line academic lectures on naming at Stanford (from a course on The Language of Advertising) and Penn, and the 1997 Wired article out of which Frankel's book was developed. Nathan also provides the last graf of his review, cut by some merciless Tribune editor:, 286120=So I apologize to the spirit of Ms. Dunnett -- she died in 2001 -- and to Diane. I've also added a link from the earlier post to this one., 470385=Specifically, there are many words that older traditional views take to be adverbs which, the way The Cambridge Grammar analyzes them (following the great Danish grammarian Otto Jespersen), are prepositions that don't require object noun phrases. (I can't list them; they are prepositions, it would ruin everything.) There are also words that traditionally get called \"subordinating conjunctions\", and The Cambridge Grammar assigns them the categorization prepositions that require a complement clause. I haven't used any words that either category embraces. I haven't been able to use any full comparative constructions, either, because there are two prepositional items that such constructions frequently demand (I'm not permitted to name them; can you?)., 605831=In the June issue of the Atlantic Magazine (not on line yet), Barbara Wallraff proposes a new explanation for the use of phrases like we cannot understate the importance of X when the writer seems to mean we cannot overstate the importance of X. At least, her explanation is new to me. When I first read it, her analysis didn't seem to make sense. But on reflection, I think she may be on to something., 421899=Checking relative frequencies on the web, I got an answer: 416,000 ghits for \"California-based\" vs. 2,580 for \"Californian-based\". 99.4% of the web agrees with my judgment -- and also with grammar and logic, it seems to me, since \"X-based\" should be a compositional compound noun, meaning \"based in (or on) X\", where X is a noun. Nobody would say \"based in Californian.\" QED. The feeble 0.6% are just confused, I thought smugly. Perhaps they are attracted by the irrelevant analogy of other adjective-noun sequences. So much for the Beeb, how the mighty have fallen, etc., 458481=No, Bush fumbled his words once again. Stumbling around between saying \"I was disgusted\" (or perhaps \"dismayed\" or \"disturbed\") and \"It was a disgrace\" (or \"It was disgraceful\"), he tripped over the dis- words, picked up the wrong one, and blurted out \"I was disgraced.\" One NPR reporter (Don Gonyea, May 14, 2004) talked about this being the strongest condemnation yet. It wasn't. Perhaps one should say that the President of the United States ought to feel indirectly disgraced by the revelations about what happened in Abu Ghraib on his watch; perhaps we Americans all should. But I am absolutely certain that the President himself did not mean any such thing. Being disgusted (or dismayed or disturbed) is quite different from being disgraced by an event; to be disgraced is to have an event reflect badly on you personally -- it has to bring shame down upon you., 619967=Kyrie O'Connor, deputy managing editor for features at the Houston Chronicle, has started publishing her daily memos to her staff as a weblog. In her May 4th MeMo, she remarks that \"the idea of a 'linguist joke' is inherently appealing\", thus endearing herself to linguists everywhere. After quick notes on \"Zebra butt\", repairman excuses and Lewis Black, she closes with this \"Grammatical cranky rant du jour\":, 465949=With regard to whether one could write English without ever using an adjective (since we've seen examples of writing with no verbs and with no nouns and with no prepositions ), we are of course told by some that writing of quality never uses adjectives at all: \"sages of writing\" are alleged to agree that adjectives are to be avoided completely by writers of taste and discernment (I discussed this topic here). The sages who do say such things, if there are such sages, are nutballs. They should be drummed out of the grammar service, stripped of their sagehood. It is an absurdity to suggest that writing fails in some way when adjectives are permitted., 469522=Language Log fans will no doubt want to be sure, having seen a verbless post and a nounless one, that any other lexical category could likewise be eliminated, and intelligible prose still be written. This post constitutes one such exercise that is not too difficult: it absolutely and completely lacks prepositions. It is not too appallingly difficult to write this way (I confess that early drafts slipped many times, but I fixed them). However, it's a bit more difficult when we adopt the modern conception that The Cambridge Grammar advances. This conception entails that far more words get classified \"preposition\"., 515230=For instance, in a 1969 study done in New York City, Bill Labov found that in casual conversation, g-dropping varied with social class as follows:, 40035=However, the citations for sense 2.b., which go back to 1881, seem to refer to personal or stylistic characteristics, or even the sound of certain kinds of amplifying circuits, rather than to social class. Class aside, it's clear that sometimes plumminess is a Good Thing and sometimes (despite sense 2.a.) not:, 566836=Grammar is hardly taught at all these days. Almost everything most educated Americans believe about English grammar is wrong, and hardly anyone even controls a system of grammatical terminology that makes any sense. It is to at least some extent the fault of my profession. We theoretical linguists do not generally deign to do applied analysis of discourse or propaganda ourselves, or assist in it; and we do so little teaching of basic grammar of relevant kinds to a broad audience that the prevailing conception of grammar in the English-speaking world has hardly changed in a hundred and fifty years. It is perfectly sensible to attempt to discern psychological states of an author (like refusal to accept responsibility) from examining the use of particular kinds of grammatical construction in a text; but it generally gets done by people who do not have a sufficient grasp of grammar to permit the analysis they seek to understake. You can hardly blame them. It isn't like they're forgetting things that other people know. It just isn't true that everybody with an advanced degree will have had at least one coherent course on English grammar. Things are likely to stay this way until grammar teaching changes, or textual analysis with writers on politics and society is done in collaboration with grammarians ., 603178=[Note added later: As of May 6 and 7, American newspapers are reporting that President Bush apologized during an appearance in the Rose Garden with King Abdullah II of Jordan. He did not. He said, describing an earlier private meeting, \"I told him I was sorry for the humiliation suffered by Iraqi prisoners...\" That is a claim about his earlier linguistic behavior in a private meeting of which we don't have a transcript. I don't know what utterances he used when talking to the King. But \"I'm sorry this happened\" is not an apology (it's an expression of regret); \"I feel sorry for the prisoners\" is not (it's an expression of pity); and so on. There many ways to weasel around with the word sorry and not actually apologize. If this president told a lie about matters of what speech acts had taken place, it would not be the first time, as I pointed out in my very first Language Log post.], 638857=This kind of thing was so common in American pop culture before 1950 that I would venture that I got a sense of the contours of hillbilly dialect (in caricatured form, to be sure) from these depictions of old people in the cartoons and old movies that were still staples on UHF as a grew up. I recall an afternoon in high school in 1980 when, joking with some friends, I passingly slid into such an accent depicting a person in their old age -- you know, \"Sonny\" and such. One guy joshingly objected \"How come when he got old he would start talking in a Southern accent?\" It struck me. He was right -- what kind of sense did this make?, 86056=Adrienne Theatre 2030 Sansom St. Philadelhia (ground floor, called \"The Playroom\")., 97218=\"Sir Henry Sidney had three children, one of whom being Sir Philip Sidney, the type of a most gallant knight and perfect gentleman.\" (GORDON HOME, WHAT TO SEE IN ENGLAND, 1908; http://www.gutenberg.net/1/1/6/4/11642/11642-8.txt) {type (a)}, 58679=1934 H. C. WYLD in S.P.E. Tract XXXIX. 609 The tongue may be so used that neither back nor front predominates, but the whole tongue, which lies evenly in the mouth, is raised or lowered. Vowels so formed are called ‘mixed’ by Sweet, but I owe to him also the term ‘flat’ which I prefer as more descriptive. The vowel [ʌ] in bird is low-flat., 358808=Recently, giving a speech on a hot day he remarked \"I better quit before some of us fall out\" (www.nytimes.com/2004/05/12/politics/ trail/12TRAIL-HEAT.html). And then earlier, he said during another speech (http://www.whitehouse.gov/news/releases/2004/01/20040122-6.html) \"There are 34 nations that have joined us in Iraq. That's too long to list. The Senator might fall out on me if I start trying to read them all.\", 37540=According to a 1999 BBC News article, Radio 4 is said to have dumped an announcer for excessive plumminess:, 493915=The Wellcome Trust has recently released a study of \"Costs and Business Models in Scientific Research Publishing\", as a follow-up to its September 2003 study \"An Economic Analysis of Scientific Research Publishing\", and its January 2003 report \"Sharing Data from Large-Scale Biological Research Projects\"., 307330=Of course terror is a noun in English. There is no doubt about that. But don't expect its meaning to settle the issue. The word denotes a kind of feeling. There could easily be a word in which the only way to talk about that kind of feeling was to use adjectives (I'm terrified) or verbs (I tremble). Notice how the French for I'm hungry is J'ai faim (literally, \"I have hunger\"): for us, an adjective and an expression of predication, and for them, a noun and an expression of possession. Same concept, different grammar., 48929=On May 14, when Bob Mondello reviewed Troy on NPR, he said:, 637937=The 1949 Looney Tune THE WINDBLOWN HARE is a parody of the Little Red Riding Hood tale. Bugs talks like Bugs, the Wolf talks like Bluto in the Popeye cartoons, but Granny talks, once again, like she grew up in the fastnesses of West Virginia. The Wolf is so focused on catching Bugs that he barely has time to acknowledge Granny as per the progression of the story that he has already read in a book. As he hastily shoves her out of the house, Granny exclaims \"Land sakes, aintcha gonna eat me?\" As the Wolf pushes her out the door she continues \"Can't a body get her shawl tied?\", 454963=-- Benjamin Franklin, Observations Concerning the Increase of Mankind, Peopling of Countries, etc., 1751, 408335=But there are some key differences here. I don't mean that Rimbaud is a dead French poet, while Mondello is a live American movie critic. I mean that Rimbaud was working out a systematic metaphorical (or synaesthetic) correspondence between (nouns for) vowels and (adjectives for) colors. Mondello, on the other hand, is just thoughtlessly mis-using one verb, originally a term for shape, that already has a standard meaning in the domain of vowel sounds. 19th-century French phoneticians didn't use rouge and bleu as technical terms for vowel \"color\" -- nor do they now -- but they did use the term arrondi (\"rounded\"), and in the vowel charts of the International Phonetic Association, since the first one was published in 1888, vowels have been presented in the traditional rounded and unrounded pairs, with a specific meaning that is not Mondello's., 291643=There are plenty of recent uses in papers from the northeastern U.S., such as the Providence Journal on May 11: \"New England's power grid has concluded there was no market abuse involving a high number of shutdowns by generators using natural gas during a January cold snap\"; or the Philadelphia Inquirer for May 16: \"The limited supply is due to last winter's cold snap that killed off large numbers of woolly adelgid before they could be harvested to feed beetles...\", 491742=I'd recommend that you check out Irvine's 1978 article, and perhaps other sources, before trusting that my description of Wolof attitudes towards fluency and morphological accuracy is accurate.], 241465=Here's where they contradict themselves: they said above that a trademark must always be used as an \"adjective\" (they meant attributive modifier). Now they say a trademark must be used \"as an adverb followed by a noun\". It's just a proofreading error. But it makes you wonder just how much the people who wrote and checked this page must know about grammar if the mistake doesn't leap out at them like it did at me., 283246=Back in February, I noted that Dorothy Dunnett used the pseudo-disease name \"Marthambles\" in her novel The Ringed Castle, published in 1971, some seven years before Patrick O'Brian first used the same word in his novel Desolation Island. Shortly thereafter, I posted a note from Lisa Grossman, who reported tracing the word (with the help of a researcher from the National Library of Medicine) to a pamphlet published in London by a Dr. Tufts to advertise his tonics and medicines. Lisa said that \"[t]he pamphlet was not clearly dated, but Tompson placed it circa 1675.\", 370723=Anyhow, in addition to the delicious food and interesting writing on the window, Tropika has a linguistically interesting menu. It is tri-lingual. Every item is described in English, Chinese, and Japanese. My first question is, why Japanese? English makes sense since it is the dominant language in Vancouver. And Chinese makes sense since it is a Chinese restaurant, and also since Chinese is now the second language in Vancouver. (According to the 1996 census, 13.8% of the people in the Greater Vancouver Regional District listed Chinese as their first language.) But why Japanese? Less than 1% of Vancouver residents speak Japanese. Japanese are a fairly important segment of the tourist trade, but not so important that other restaurants have Japanese language menus, except of course for Japanese restaurants. And why not Malay? I'd like to think that it's because I don't know Malay, but that doesn't seem very likely. I'm guessing that the answer is that although the people who run the restaurant are from Malaysia and speak Malay, and their cuisine is influenced by Malay food, their linguistic and cultural orientation is Chinese., 616811=While we're on the subject of international languages, the choice of languages at the United Nations is interesting. The original official languages were English, Chinese, French, and Russian, not coincidentally the languages of the permanent members of the Security Council. The choice was largely political. English had perhaps the strongest case. Not only was it already widely used as an international language, it was the dominant language of the United States, which had emerged as the greatest military and economic power. Chinese too was the language of a major power, as well as the most widely spoken language. Russian was the language of one of the major powers though not particularly widely spoken outside of the Soviet Union. French was chosen because it was still widely considered the international language of diplomacy. Spanish and Arabic were added in 1973, in both cases because they are the languages of a score of nations., 21834=[Prior postings by Kerim Friedman (May 28) and and Irish Eagle (May 25).], 443650=(4) a. ...BenQ plans to more than double its channel this year, its president says... b. .... GPRC hopes to more than double student housing by September 2005... c. ... The broadband market is set to explode, with access expected to more than double to 46 million-plus households in the United States by 2008, up..., 142616=At the time of writing this revised post (May 26, 8:35pm EST) you can see the evidence here: a page of details on nasty military books about killing people in which \"88 pp\" has been changed to \"88 pages\" by someone so careless with the editor that they also changed \"an opponent's ability to fight\" to \"an opagesonent's ability to fight\", and \"Poisons & Application Devices\" to \"Poisons & Apageslication Devices\", etc., 122621=Those who have noted that Language Log doesn't have an open comments section have sometimes wondered why. Those who are aware that robots can be programmed to scour the blogosphere for open comments sections and spit spam into them may have some sense of why Language Log has been cautious so far. Here is just one small story about what's out there itching to get at you: recently posted statistics reveal that the percentage of material mailed to Debian Linux mailing lists that passes all ID checks and content X-raying and security screenings and is duly made available to the subscribers on one of the lists is just 3.5%. That's not a typo: three point five percent. Only 35 out of every thousand items sent to the list are genuine postings by human beings that pertain to Debian Linux. The rest, the spam, is caught by various filters, which some human has to constantly tune and maintain. Such is the flood of mass-mailed garbage travelling around the net looking for a way to get to your screen. The percentage of all email that is from spammers is said to be as high as 80% as of April 2004, and rising. These may be underestimates. Even running spamassassin in fairly aggressive mode does not prevent my address, which I do not advertise, from getting at least one Nigerian scam letter per day that skips past the filtering (plus a dozen pieces of other junk that get caught \u0097 a very light spam load by some people's standards). This is Geoff Pullum, looking forward to not hearing too much from anyone at ssshhhh!@censored.sorry.xyz., 421607=For the three months to 27 March, the Californian-based company made a profit of $1.7bn, almost double the $915m recorded for the same period in 2003., 495157=A news article from the May 8 British Medical Journal includes this quote from Dr. Mark Walport, director of the Wellcome Trust:, 269169=Seven years is probably long enough to wait for a reply to a letter before concluding that there will never be a reply. April 23 passed this year, like six before it, with still no reply to a letter about African American Vernacular English that I sent on that date in 1997 to the well known African American columnist William Raspberry (Pulitzer Prize nominee and recipient of several honorary doctorates), who writes for the Washington Post. So I think it's time to just post the letter on Language Log for others to see it., 73033=Proposed strictly transitive verbs have half-lives as short as synthesized high-end transuranic elements. Lance Nathan at MIT squelches Adam Albright's suggestion squelch with a sentence off the web (http://thalo.net/freedom.html): \"I have been a participant in other online forums, grew dissatisfied with the rampant tyranny of political correctness and impulse to squelch, and therefore acted to whack together my own modest forum site.\" So much for squelch. He also kills predecease: \"Where the husband predeceases, neither widow nor children can claim a right in any part of the heirship moveables\" (Erskine, Inst. Law Scot., 1765, via OED). And M. Crawford writes with this example of induce with implicit object: \"I'm really hoping I go before they have to induce because I've heard so many bad things about induction and how much more painful it is.\" (That's, about inducing labor to hasten childbirth, of course.) So, though one could quibble, that looks like three of Adam Albright's potential strict intransitive verbs gone. And more counterexamples are coming in over the transom all the time., 17160=Prosecutors dropped their case Friday against a security guard in the 2000 death of a man put in a choke hold during a shoplifting investigation — a case that took on racial overtones., 336033=1937 E. H. DERRICK in Med. Jrnl. Australia 21 Aug. 282/1 The suspicion arose and gradually grew into a conviction that we were here dealing with a type of fever which had not been previously described. It became necessary to give it a name, and ‘Q’ fever was chosen to denote it until fuller knowledge should allow a better name. 1964 E. H. DERRICK in Queensland's Health Dec. 11/2 ‘X’ is a recognised term for an unknown quantity. But Australia already had an ‘X disease’, now known as Murray valley encephalitis. However, the rest of the alphabet was open. Query also signified the unknown. ‘Q (for query) fever’ it became. Ibid., Many have wrongly assumed that the ‘Q’ stands for Queensland., 648633=Bill Poser's observation that there are 380 language pairs of languages used in the European Community as from May 1st is of course obtained by the formula n2 - n (multiply the number of languages, n, by itself, and subtract n to get rid of the cases where the two members of the pair are the same \u0097 you don't need French to French translation). Could the EU assume that any Latvian/Maltese interpreter or translator they find find will be able to do Maltese/Latvian as well? Maybe (though Bill points out to me that translators usually work only in one direction, and not all simultaneous interpreters can do both directions unless they are fully balanced bilinguals with experience of translating in both directions). If we could assume bidirectionality, the EU would only looking for (n2 - n)/2 = 190 kinds of interpreter and/or translator. That still seems a lot., 182754=What do do? Perhaps use Whits (for \"Web hits\") as the more general term, with usages like \"1234 Whits (Altavista)\", and then consider Ghits to be an abbreviation for \"Whits (Google)\"?, 382785=The IPA is a system for transcribing speech. It attempts to provide a symbol for every distinct speech sound found in some human language. For instance, the sound at the end of ring is represented by the symbol ŋ, while the sound at the beginnng of this is represented by ð. Since there are several hundred such sounds, some of the symbols are composite. For instance, aspirated consonants are written with a small superscript h after the symbol for the corresponding unaspirated consonant. For example, [p] stands for the unaspirated sound, as in English spot; its aspirated counterpart, as in pot, is [pʰ]. The IPA is intended only to record those differences in sound that are distinctive in some language. However, diacritics are provided that allow finer detail to be recorded. The IPA is defined by the International Phonetic Association, which revises it from time to time as new speech sounds are discovered. The very first version of the IPA dates to 1886; it had attained essentially its current form by 1949. The changes since then consist almost entirely of the addition of symbols for the more exotic speech sounds., 674871=\"The sixteen first rules of fiction\" (May 15, 2004) \"Dan Brown still moving very briskly about\" (November 4, 2004) \"Renowned author Dan Brown staggered through his formulaic opening sentence\" (November 7, 2004) \"Oxen, sharks, and insects: we need pictures\" (November 8, 2004) \"Thank God for film: Dan Brown without the writing\" (December 2, 2004) \"Learning the ropes in the trenches with Dan Brown\" (July 14, 2005) \"Don't look at their eyes!\" (July 19, 2005) \"A five-letter password for a man obsessed with Susan\" (September 10, 2005) \"Some striking similarities\" (May 15, 2006) \"Is Mark Steyn guilty of plagiarism?\" (May 15, 2006) Cutting in line: what would Of Nazareth do? (May 16, 2006) A tale of two copiers (May 17, 2006), 569319=Assuming that this was really some kid's high school English composition submitted in June of 2000, and that it was scanned and posted by the teacher rather than the student, it was probably illegal, but I'm happy to have been able to read it. I hope that Peter got a book contract or a Hollywood screenwriting job out of the deal. Though he does need to work on his punctuation, and lose the faggotry jokes., 453333=In spite of the concern about being overwhelmed by German-speaking hordes reported by Mark, as a young man in 1732 Benjamin Franklin was the publisher of the first German-language newspaper in North America, the Philadelphische Zeitung. It lasted only briefly, perhaps in part because Franklin did not have German type. He used his usual Caslon Antiqua, which must have seemed as odd to the German readers of the day as English printed in Fraktur type would seem to us., 120106=Lara St. John is a classical violinist described as a \"striking six-foot blonde\". For the past few years, she's been trying to get past her first album picture, which showed her naked holding her instrument across her chest. So for a recital in Toronto last February, she \"chose her best gown, a simple navy blue silk\", explaining that \"because the recital was so serious I didn't want trouble with the visuals\". But John Terauds, apparently disappointed at the contrast with the album cover, wrote in the Toronto Star that, 12719=But I think I know where it comes from. I think it originates in an elevation of a stupid mantra to the status of a holy edict. The mantra is \"Omit needless words,\" stated on page 23 of Strunk and White's poisonous little collection of bad grammatical advice, The Elements of Style, and elaborated on by E. B. White in the reminiscences of his introduction. It could be interpreted in a sensible way as a piece of advice for those editing their own writing: make sure you're not being too wordy (e.g., why say on a daily basis if you're trying to keep to a length limit and the phrase every day is shorter). But the teacher must have decided that the Strunkian imperative had to be obeyed literally and without question at all times, and that punishment must be meted out to those who do not obey. Fascist grammar., 11885=What my undergraduate student's high school English teacher insisted on was that you should look at any sentence containing the subordinator that and see whether omitting it would leave the sentence still grammatical. If so, then you must omit it, this teacher said. She would grade you down if you ever used that where grammar did not absolutely require it., 506489=There's a weekly column at The Morning News called The Non-Expert: \"Experts answer what they know. The Non-Expert answers anything.\" In the May 7, 2004 Non-Expert, Andrew Womack writes on the topic of English. Specifically, he \"illustrates, exhibits, and displays how proper editing makes English all that more the understandable.\", 607370=Wallraff's explanation (The Atlantic, v. 293 no. 5, June 2004, p. 154) is completely different. She suggest that phrases like cannot understate are genuinely ambiguous, not just confusing:, 273681=April 23, 1997, 50963=An IMDB review of the 1955 movie Seven Cities of Gold complains about Richard Egan as \"Jose Mendoza\" that, 548402=An older set of sexist stereotypes about gender differences in communication are expressed in Rudyard Kipling's 1911 poem The female of the species. Kipling depicts the stereotypical man as an equivocator, \"whose timid heart is bursting with the things he must not say.\" Men in conversation are therefore ready to compromise and to discuss all sides of an issue, and tend to be diverted by humor, doubt and pity. A woman, on the other hand, \"who faces Death by torture for each life beneath her breast / May not deal in doubt or pity -- must not swerve for fact or jest.\" For a woman, \"her contentions are her children,\" and anyone who disagrees will be met with \"unprovoked and awful charges -- even so the she-bear fights.\" The conclusion, for Kipling, is that women should be excluded from politics:, 513380=Historically, g-dropping is actually a more conservative pattern. The English present participle suffix was originally pronounced with a coronal, not a velar nasal: in early middle English, this inflection was -inde or -ende. There was a derivational ending -ung for making nouns out of verbs, which produced words like present-day \"building.\" These eventually merged into the modern -ing suffix. In 19th- and early 20th-century England, the g-dropping pattern (which really was the \"not g-adding pattern\") marked the rural aristrocracy as well as the lower classes. Thus this passage from John Galsworthy's 1931 novel Maid in Waiting:, 437506=To establish that W's sense of \"disgraced\" -- and mine -- are not just archaic 17th- and 18th-century usages somehow preserved in rural America, I'll cite, as one last piece of evidence, (Philadelphia native) Joan Jett's 1995 song Last to Know:, 305518=The traditional definition of the term \"noun\" has a fantastically strong hold on the public imagination. In old-fashioned grammar books it is usually the first line of the first section of the first chapter: \"A noun,\" it will say, \"is the name of a person, place, or thing.\" What Jon Stewart has dimly perceived is that terror is not a person, so we can't assassinate it; it is not a place, so we can't bomb it; and it is not a thing, so we can't find where it is and blow it up -- it has no spatial location., 261015=Incidentally, it's possible that all those live reveals on Trading Spaces are a rather different phenomenon. As a parallel, consider the word vanish. Until recently, this verb could also occur as a noun (1872 'MARK TWAIN' Roughing It iii. 33 \"He..left for San Francisco at a speed which can only be described as a flash and a vanish.\"). Nowadays, however, the only people using it as a noun are magicians, who use it quite routinely to describe disappearing acts. For instance (quoted from a page on magic for kids): \"With a magical gesture reveal the vanish of the coin, then make it re-appear wherever you want.\" It seems that the magician's use of vanish is meant to indicate the act, or performance, of causing something to vanish. The reveal seems to have a similar flavor; it sounds like a bit of reality-TV board-room lingo for a packaged act, that has slipped onto the screen., 351427=There are some style suggestions included: don't overuse footnotes, don't be too liberal with the rather literary device of the semicolon. On things like this, advice from an opinionated reader or a publisher with style guidelines can be helpful. I won't say anything about them. And the last point is also about style, though I think the style advice is dead wrong: inviting the reader into your deliberations and saying as we saw in the previous chapters feels much warmer and more supportive than the alternatives (as I stated in the previous chapters is all pay-attention-to-me, and as you saw in the previous chapters suggests authorial omniscience about the reader's mental state). But the rest (familiar copy-editor changes all) are based on nothing more or less than flatly false claims about what is grammatical in contemporary Standard English. This copy editor should be told not just to lay off, but to go to school and take a serious grammar course. Enough of these 19th-century snippets of grammatical nonsense that waste authors' time all over the English-speaking world. Let me go through the grammar points on which poor Mark is being corrected, one by one:, 674426=*The third non-reader was unknown when this post was first drafted, but it has since been edited, and as of today (May 2, 2004) I can confirm that Bill Poser and Danny Yee are both claiming not to have read The Da Vinci Code. Fair enough. So at least four people have not read it. I just wish one of them was me., 85908=For those of you who would like to see it, it is on Mondays, Tuesdays, Wednesdays, Thursdays and Friday nights, through June 18:, 436304=1752 JOHNSON Rambler No. 196 7 Of his children..some may disgrace him by their follies., 660521=Now, The Dante Club's front matter tells us that \"Matthew Pearl graduated from Harvard University summa cum laude in English and American literature in 1997, and in 2000 from Yale Law School\". I ask you, is it likely that a person with that background would be so insensitive to the norms of the English language?, 171788=I'll risk adding even more verbiage to this already over-long post, by observing again that this case provides another example of the unsolved problem of looking things up in grammar books., 167725=The 99ER Pairs is open to any two players neither of whom having more than 100 or more masterpoints as of November 1st of the year in which the event is held., 431605=Adding it all up, it's about 79% for the nouns, 21% for the adjectives. A victory for logical grammar, but hardly a resounding one. There are several pockets of stalwart adjectival resistance (or craven concession to adjectival irrationality?): Europe, France, Canada, at .70, .85, .75 noun/adjective ratios respectively. Germany is on the edge at 1.01., 555812=Over the past couple of decades, there has been a lively controversy over the question of whether men and women use language differently, what the differences might be, and how and why the differences (if they exist) arise. A different perspective was expressed a few years ago in an article by Penny Eckert and Sally McConnell-Ginet, the authors of a 2003 book entitled \"Language and Gender\":, 298564=A revealing, revelation, disclosure. 1629 WADSWORTH Pilgr. iii. 22 He vtterly disclaimed their superstitious reueales. 1646 SIR T. BROWNE Pseud. Ep. 195 In nature the concealment of secret parts is the same in both sexes and the shame of their reveale equall. 1858 BAILEY Age 41 Faith her first law, knowledge her last reveal., 516715=In the 1969 NYC study, this pattern was maintained across the full interaction of social class and degree of formality:, 221461=The phrase specimen of expresses in the most succinct way imaginable the radical character of the loss of being which has occurred under his very nose. To refer to the dogfish, the unique concrete existent before him, as a ``specimen of Squalus acanthias'' reveals by its grammar the spoliation of the dogfish by the theoretical method. This phrase, specimen of, example of, instance of, indicates the ontological status of the individual creature in the eyes of the theorist. The dogfish itself is seen as a rather shabby expression of an ideal reality, the species Squalus acanthias. The result is the radical devaluation of the individual dogfish..., 273724=Mr William Raspberry The Washington Post 1150 15th Street NW Washington, DC 20071, 478419=Thaler: nuts, bonkers, round the bend. Mad as a March hare. The Liberman conjecture (about survival of high school literary experimentation into adulthood because of a dysfunctional authoritarian French educational system): probably true. My attitude: contempt, really. Except... Unless..., 272261=My letter about this lame column was relatively friendly, though, because I sought information. I wanted to know something about him. I've shortened the letter a little below, removing some further boring friendlinesses that did not advance the main content (stuff about how it was ironic and perhaps apparently presumptuous for a white linguist born in Britain to be writing to an African American journalist about the grammar of AAVE). But perhaps the reason my letter met with seven years (so far) of stony silence was that nobody likes to be accused of being linguistically clueless, and what I had to say to him was at root, however politely cloaked, that he didn't know a single thing about the language he was mocking. This is extraordinary, because he was born in Okolona, Mississippi, in 1935, and I would have thought that would have put him in a monolingual AAVE community, but as I argue in the letter, it's as if he had never heard the language at all. Here's the letter, placed on Language Log for the record in case it has more interest to you than it apparently did to its distinguished addressee., 588597=After attending Biolink-2004 yesterday in Boston, I took the train back to Philly today. This morning in South Station, as I was waiting to board, I overheard a conversation between two middle-aged male railroad workers. One of them said to the other \"He was gettin' all autistic on me.\" The other one responded \"Boy, I know what you mean.\", 118659=The full description of the Nature article is: \"DNA sequence and comparative analysis of chimpanzee chromosome 22\", by The International Chimpanzee Chromosome 22 Consortium, Nature 429, 382 - 388 (27 May 2004).}",
    "lastModified": "Thu, 02 Sep 2010 11:35:29 GMT",
    "textBeforeTable": "Have I made myself absolutely clear? Well, just in case, I will say this once more in a box, in a larger typeface designed to catch the attention of dimwitted people or perhaps even copy editors: Note and notice, as verbs, have basically the same meaning. It is hard to imagine a context in which one would need to be corrected to the other, or in which direction. Then can introduce a new clause immediately after a comma; an extra and is not needed. Bram Stoker writes: The carriage went at a hard pace straight along, then we made a complete turn and went along another straight road. Do these copy editors think their writing wisdom is greater than that of the author of Dracula? Huh? They are morons, and they are wasting Mark Pilgrim's time with their fiddling. Like has exactly the same meaning as such as in contexts like this one (I could have said in contexts such as this one). There is a difference in formality level: like is more informal. But informal does not mean incorrect. I believe I have said this before. Please pay attention. Do I need to go on? No. The point is clear. On average, by the time you've read about 3% of a book by an author who knows how to write you will already have encountered an integrated relative clause beginning with which. They are fully grammatical for everyone. The copy editors are enforcing a rule",
    "textAfterTable": "Marketing to grammar victims Steven Bird's picture of the International Phonetic Alphabet on the packaging of a new Olympus digital camera is heartwarming -- may it be the first of many similar examples. Unfortunately, the µ[mju:] 400 appears to be the European packaging of what is marketed in the U.S. as the Stylus 400. This may be related to the fact that recent British dictionaries for the European market use IPA in their pronunciation fields, while the American versions of the same dictionaries not only provide American pronunciations, but translate them into a non-IPA pseudo-orthographic system concocted for the occasion. Still -- who'd've thought that the way to popularize linguistic analysis might be... marketing? Continuing with Steven's idea that IPA=hitech, I fantasize about seeing kəˈʧɪŋ digital headphones: \"Now with infinite impulse response!\". Trying for some orthographic fetishism, a line of sandals branded /ˈwʊʤəz/. Or for that southern flair, /ˈwʊʤɔl/. We need some fonts in general distribution that make IPA look more elegant, though. When I look at IPA in unicode through a standard web browser or text processor, the mixture of styles and the poor hinting usually make it look like a ransom note (even without all the problems of diacritics...) I don't expect that Britney Spears will replace her \"Hebrew\" tattoo with an IPA inscription, but maybe some future Hollywood guru will promote incantatory mantras in IPA. Or",
    "hasKeyColumn": true,
    "keyColumnIndex": 3,
    "headerRowIndex": 0
}