{
    "relation": [
        [
            "Published Date",
            "May 28, 2015",
            "Mar 28, 2014",
            "May 14, 2013",
            "Dec 22, 2011",
            "Dec 23, 2010",
            "May 3, 2010",
            "Mar 16, 2010",
            "Jul 14, 2009",
            "Nov 21, 2008",
            "Aug 24, 2007",
            "May 31, 2007"
        ],
        [
            "Version",
            "23 (current)",
            "22",
            "19",
            "13",
            "11",
            "10",
            "7",
            "6",
            "3",
            "2",
            "1"
        ],
        [
            "Files",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download",
            "download"
        ]
    ],
    "pageTitle": "DailyMed - XIFAXAN- rifaximin tablet",
    "title": "",
    "url": "http://dailymed.nlm.nih.gov/dailymed/drugInfo.cfm?setid=c5e8e2fd-7087-4b78-9181-cc259c0be2f1",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00311-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 62489127,
    "recordOffset": 62446790,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{51501=Malignant schwannomas in the heart were significantly increased in male Crl:CD® (SD) rats that received rifaximin by oral gavage for two years at 150 to 250 mg/kg per day (doses equivalent to 2.4 to 4 times the recommended dose of 200 mg three times daily for TD, and equivalent to 1.3 to 2.2 times the recommended dose of 550 mg twice daily for HE, based on relative body surface area comparisons). There was no increase in tumors in Tg.rasH2 mice dosed orally with rifaximin for 26 weeks at 150 to 2000 mg/kg per day (doses equivalent to 1.2 to 16 times the recommended daily dose for TD and equivalent to 0.7 to 9 times the recommended daily dose for HE, based on relative body surface area comparisons)., 33505=Trial 3 evaluated repeat treatment in adults with IBS-D meeting Rome III criteria** for up to 46 weeks. A total of 2579 were enrolled to receive open-label XIFAXAN for 14 days. Of 2438 evaluable patients, 1074 (44%) responded to initial treatment and were evaluated over 22 weeks for continued response or recurrence of IBS-symptoms. A total of 636 patients had symptom recurrence and were randomized into the double-blind phase of the study. These patients were scheduled to receive XIFAXAN 550 mg three times a day (n=328) or placebo (n=308) for two additional 14-day repeat treatments courses separated by 10 weeks. See Figure 3., 2301=Rev. 05/2015, 19206=In TARGET 3, 2579 patients were scheduled to receive an initial 14-day course of open-label XIFAXAN followed by 4 weeks of treatment-free follow-up. At the end of the follow-up period, patients were assessed for response to treatment. Patients were considered a responder if they achieved both of the following:, 83156=A pre and postnatal development study in rats showed no evidence of any adverse effect on pre and postnatal development at oral doses of rifaximin up to 300 mg/kg per day (approximately 5 times the recommended dose for TD [600 mg per day], and approximately 2.6 times the recommended dose for HE [1100 mg per day], and approximately 1.8 times the recommended dose for IBS-D [1650 mg per day] adjusted for body surface area)., 16901=There were 1074 (44%) of 2438 evaluable patients who responded to initial treatment with improvement in abdominal pain and stool consistency. The response rate for each IBS symptom during the open-label phase of Trial 3 is similar to the rates seen in Trials 1 and 2 (see Table 7). A total of 636 patients subsequently had sign and symptom recurrence and were randomized to the repeat treatment phase. The median time to recurrence for patients who experienced initial response during the open-label phase with XIFAXAN was 10 weeks (range 6 to 24 weeks)., 84039=Rifaximin was teratogenic in rats at doses of 150 to 300 mg/kg (approximately 2.5 to 5 times the recommended dose for TD [600 mg per day], and approximately 1.3 to 2.6 times the recommended dose for HE [1100 mg per day], and approximately 0.9 to 1.8 times the recommended dose for IBS-D [1650 mg per day] adjusted for body surface area). Rifaximin was teratogenic in rabbits at doses of 62.5 to 1000 mg/kg (approximately 2 to 33 times the recommended dose for TD [600 mg per day], and approximately 1.1 to 18 times the recommended dose for HE [1100 mg per day], and approximately 0.7 to 12 times the recommended dose for IBS-D [1650 mg per day] adjusted for body surface area). These effects include cleft palate, agnathia, jaw shortening, hemorrhage, eye partially open, small eyes, brachygnathia, incomplete ossification, and increased thoracolumbar vertebrae., 121808=Pregnancy: May cause fetal harm (8.1), 78557=No specific information is available on the treatment of overdosage with XIFAXAN. In clinical studies at doses higher than the recommended dose (greater than 600 mg per day for TD, greater than 1100 mg per day for HE or greater than 1650 mg per day for IBS-D), adverse reactions were similar in subjects who received doses higher than the recommended dose and placebo. In the case of overdosage, discontinue XIFAXAN, treat symptomatically, and institute supportive measures as required., 50730=Rifaximin was not genotoxic in the bacterial reverse mutation assay, chromosomal aberration assay, rat bone marrow micronucleus assay, rat hepatocyte unscheduled DNA synthesis assay, or the CHO/HGPRT mutation assay. There was no effect on fertility in male or female rats following the administration of rifaximin at doses up to 300 mg/kg (approximately 5 times the clinical dose of 600 mg per day for TD, and approximately 2.6 times the clinical dose of 1100 mg per day for HE, adjusted for body surface area)., 85052=There are no available data on XIFAXAN use in pregnant women to inform any drug associated risks. Teratogenic effects were observed in animal reproduction studies following administration of rifaximin to pregnant rats and rabbits during organogenesis at doses approximately 0.9 to 5 times and 0.7 to 33 times, respectively of the recommended human doses of 600 mg to 1650 mg per day. In rabbits, ocular, oral and maxillofacial, cardiac, and lumbar spine malformations were observed. Ocular malformations were observed in both rats and rabbits at doses that caused reduced maternal body weight gain [see Data]. In the U.S. general population, the estimated background risk of major birth defects and miscarriage in clinically recognized pregnancies is 2 to 4% and 15 to 20%, respectively.Advise pregnant women of the potential risk to a fetus., 130781=Indications and Usage, Irritable Bowel Syndrome with Diarrhea (1.3) 5/2015, 130610=Dosage and Administration, Irritable Bowel Syndrome with Diarrhea (2.3) 5/2015, 35222=The first two trials, Trials 1 and 2 were of identical design. In these trials, a total of 1258 patients meeting Rome II criteria for IBS* were randomized to receive XIFAXAN 550 mg three times a day (n=624) or placebo (n=634) for 14 days and then followed for a 10-week treatment-free period. The Rome II criteria further categorizes IBS patients into 3 subtypes: diarrhea-predominant IBS (IBS-D), constipation-predominant IBS (IBS-C), or alternating IBS (bowel habits alternating between diarrhea and constipation). Patients with both IBS-D and alternating IBS were included in Trials 1 and 2. XIFAXAN is recommended for use in patients with IBS-D., 31886=Trials 1 and 2 included 1258 IBS-D patients (309 XIFAXAN, 314 placebo); (315 XIFAXAN, 320 placebo). The primary endpoint for both trials was the proportion of patients who achieved adequate relief of IBS signs and symptoms for at least 2 of 4 weeks during the month following 14 days of treatment. Adequate relief was defined as a response of “yes” to the following weekly Subject Global Assessment (SGA) question: “In regards to your IBS symptoms, compared to the way you felt before you started study medication, have you, in the past 7 days, had adequate relief of your IBS symptoms? [Yes/No].”, 17761=When patients experienced recurrence of their symptoms of abdominal pain or mushy/watery stool consistency for 3 weeks of a rolling 4-week period, they were randomized into the double-blind, placebo-controlled repeat treatment phase. Of 1074 patients who responded to open-label XIFAXAN, 382 experienced a period of symptom inactivity or decrease that did not require repeat treatment by the time they discontinued, including patients who completed the 22 weeks after initial treatment with XIFAXAN. See Figure 3., 122395=To report SUSPECTED ADVERSE REACTIONS, contact Salix Pharmaceuticals at 1-800-508-0024 and www.Salix.com or FDA at 1-800-FDA-1088 or www.fda.gov/medwatch., 120990=Revised: 5/2015, 17198=Overall, 1257 of 2579 patients (49%) were nonresponders in the open-label phase and per the study protocol were withdrawn from the study. Other reasons for discontinuation include: patient request (5%), patient lost to follow-up (4%), adverse reaction (3%), and other (0.8%).}",
    "textBeforeTable": "Number of versions: 11 XIFAXAN- rifaximin tablet View Label Archives for this drug View Label Archives, RxNorm, Get Label RSS Feed More Info on this Drug Medline Plus, Clinical Trials, PubMed, Biochemical Data Summary Related Resources Report Adverse Events, FDA Safety Recalls, Presence in Breast Milk Safety (also available in the left menu) Find additional resources Close All Sections View All Sections Close MANUFACTURE(65649-301, 65649-303) 205475333 Patheon-Whitby Inc Business Operations ID/FEI Address Name Establishment Labeler - Salix Pharmaceuticals, Inc. (793108036) 05/01/2010 NDA021361 NDA Marketing End Date Marketing Start Date Application Number or Monograph Citation Marketing Category Marketing Information",
    "textAfterTable": "RxNorm XIFAXAN- rifaximin tablet RxCUI RxNorm NAME RxTTY 1 429662 rifaximin 200 MG Oral Tablet PSN 2 429662 rifaximin 200 MG Oral Tablet SCD 3 539789 XIFAXAN 200 MG Oral Tablet PSN 4 539789 rifaximin 200 MG Oral Tablet [XIFAXAN] SBD 5 539789 Xifaxan 200 MG Oral Tablet SY 6 856664 rifaximin 550 MG Oral Tablet PSN 7 856664 rifaximin 550 MG Oral Tablet SCD 8 856666 XIFAXAN 550 MG Oral Tablet PSN 9 856666 rifaximin 550 MG Oral Tablet [XIFAXAN] SBD 10 856666 Xifaxan 550 MG Oral Tablet SY Get Label RSS Feed for this Drug XIFAXAN- rifaximin tablet To receive this label RSS feed Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/labelrss.cfm?setid=c5e8e2fd-7087-4b78-9181-cc259c0be2f1 To receive all DailyMed Updates for the last seven days Copy the URL below and paste it into your RSS Reader application. https://dailymed.nlm.nih.gov/dailymed/rss.cfm What will I get with the DailyMed RSS feed? DailyMed will deliver notification of updates",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}