{
    "relation": [
        [
            "COM Port",
            "COM3",
            "COM4",
            "COM5",
            "COM6"
        ],
        [
            "I/O Addr",
            "BASE + 00",
            "BASE + 04",
            "BASE + 08",
            "BASE + 0C"
        ],
        [
            "COM Port",
            "COM7",
            "COM8",
            "COM9",
            "COM10"
        ],
        [
            "I/O Addr",
            "BASE + 10",
            "BASE + 14",
            "BASE + 18",
            "BASE + 1C"
        ]
    ],
    "pageTitle": "TS-7300 - Technologic Systems Manuals",
    "title": "",
    "url": "http://wiki.embeddedarm.com/wiki/TS-7300",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 272211495,
    "recordOffset": 272149564,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{185973=The TS-CAN1 provides one single channel CAN interface and enables a PC/104 embedded systems to be connected to CAN1.1 and CAN2.0a networks. It uses a Philips SJA1000 CAN controller which is opto-isolated from the physical CAN network, increasing the system security. Up to four boards can be installed in any single system., 56337=The TS-7300 SBC's proprietary boot firmware makes it possible for the board to boot directly from the SD Card on the first socket, therefore the TS-7300's are shipped standard with the full-featured Debian Linux installed on the first SD Card. Debian can also be used with an NFS root file system or USB flash drives. The TS-Kernel used is based upon the version 2.4.26, patched and compiled for the Cirrus EP9302 ARM920T processor, and is real-time capable through RTAI., 53571=The TS-ENC730 brings out some features implemented on the TS-7300 FPGA, such as the SJA1000 CAN core, PWM for the DAC lines, 800x600 VGA Video, second ethernet port, additional serial ports, etc., 186405=Technologic Systems provides complete SJA1000 Linux driver support for TS-CAN1, including CANOpen high level protocol. Documentation and support for CAN application development are also provided., 85856=Those lines starting with a # symbol are comments. The line auto lo eth0 means both the loopback interface and the first ethernet interface will be started automatically by the Debian networking scripts. The above example shows that eth0 would be assigned the static address of 192.168.0.50, using 192.168.0.1 as the default gateway. If one was to comment out those lines, and then uncomment the line iface eth0 inet dhcp, then eth0 would use a dhcp client to obtain it's IP and other relevant network information., 132495=The COM2 Port supports RS-485 half duplex or full duplex operation. RS-485 drivers allow communications between multiple nodes up to 4000 feet (1200 meters) via twisted pair cable. Half-duplex RS-485 requires one twisted pair plus a Ground connection, while full duplex requires two twisted pair plus a Ground. For half-duplex operation, a single twisted pair is used for transmitting and receiving.}",
    "lastModified": "Sat, 27 Jun 2015 06:49:51 GMT",
    "textBeforeTable": "The Technologic System SD Card core is a very small implementation and can be integrated on the TS-7300 CPLD. Four 8-bit registers are available for the software layer to control the SD Card hardware: SD Memory Card technology provides large capacity and fast access combined with a compact and slim profile, making it very appealing for a wide range of next generation products and applications. In addition, SD Cards feature content protection, planned capacity growth, high-speed data transfer, and a write protect switch. These devices supply additional non-volatile storage either for data or for a complete operation system distribution, such as Debian, to be used with the TS-7300 SBC. Technologic Systems has a full license for using the additional SD features which are reserved for members of the SD Card Association. This has allowed us to design both the hardware logic core and software specifically tuned to the capabilities of the TS-7300 CPU using the official SD specification documents. Since both a Linux driver module and an ARM9 object file containing OS-independent access routines are provided to customers purchasing the board hardware, customers do not have to seek SD licensing themselves. 3.2.5 SD Memory Card /usr/bin/loadUSB.sh to chroot into the Debian OS. First, invoke /usr/bin/loadUSBModules.sh, then run the script flash TS-Linux file system or available for download at our website. One can load Debian OS with two scripts provided by the on-board Drivers are available in the TS-Kernel to support USB flash",
    "textAfterTable": "The CPLD handles control signals on the PC104 bus, has a watchdog timer, enables jumper settings reading, handles the reset button, interfaces to the real-time clock and controls the EEPROM chip select. It also implements peripheral features that, together with EP9302 modules, makes available an advanced set of communication ports, DIO pins, ADC converters, and others. The inclusion of a CPLD on the SBC allows customized programming for customers with special needs, without having to do a more expensive board redesign. For example, the MAXII CPLD on the TS-7260 can be configured with three different cores: 2TTLCOM option: 2 extra TTL-only serial ports with TX enable signals and that includes a very simple GPIO core (data direction register and data register only). TS-XDIO option: uber-GPIO that can do quadrature, PWM, freq-counter, pulse timing, IRQ and DRQ, etc SDSOCKET option: a special core for a SD interface that requires a special Linux driver module to be of use. The CPLD can be programmed using the JTAG header and special software/hardware supporting tools. Contact Technologic Systems for support on CPLD programming software and tools. 3.4 Cyclone II FPGA The inclusion of an Altera FPGA on the TS-7300 and a dedicated high-speed bus between the CPU and FPGA provides unique design possibilities in the hands of creative embedded designers. The FPGA has its own dedicated 8MB SDRAM and customers can load their own bitstream or use the default",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}