{
    "relation": [
        [
            "VOTE:",
            "",
            "",
            ""
        ],
        [
            "Ida L. Castro",
            "Alan Dexter Bowman",
            "Josephine DiRienzo",
            "Robert J. Long"
        ],
        [
            "(Yes)",
            "(Yes)",
            "(Yes)",
            "(Abstained)"
        ]
    ],
    "pageTitle": "Civil Service Commission | Meeting Minutes of May 15, 2002",
    "title": "",
    "url": "http://www.nj.gov/csc/about/meetings/minutes/020515m.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00013-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 622440047,
    "recordOffset": 622417542,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{3945=A-5 TERESA SPALDING Teresa Spalding, County Correction Officer, County of Burlington, County Jail, ten-day suspension and removal effective December 22, 2000, on charges of chronic or excessive absenteeism or lateness, and violation of Burlington County Jail's attendance policy., 75629=B-155 GREGORY HENDERSON Gregory Henderson petitions the Merit System Board for reconsideration of the decision rendered on June 12, 2001 which found that, per the substitution clause for education, he was below the minimum requirements in experience for the promotional examination for Technician, Management Information Systems (PS9231K), Ancora Psychiatric Hospital., 32174=B-54 MARK SAUNDERS Mark Saunders, represented by Sharon A. King, Esq., seeks enforcement of the Merit System Board decision rendered on June 16, 1998, mandating his appointment, absent any other disqualification issue, from the Police Officer (M1836M), City of Camden eligible list based on the appointing authority's failure to meet its burden of proof that appellant was medically unfit to effectively perform the duties of Police Officer., 15478=ACTION: The Merit System Board directed that this appeal be granted, and the appellant's name be restored to the Ranger Trainee (S9999A), eligible list and reflected on the October 13, 2000 certification as interested but not reachable for appointment., 41510=B-62 PEARLIE KINCHEN The appeal of Pearlie Kinchen, a Human Services Assistant with Vineland Developmental Center, Department of Human Services, of her removal effective February 3, 2000, on the charge of physical abuse of a client, was heard by Administrative Law Judge John R. Futey (ALJ), who rendered his initial decision on January 7, 2002, upholding the removal. At its meeting on April 10, 2002, the Merit System Board (Board) upheld the lesser-included charge of inappropriate physical contact with a client and modified the removal to a 90-day suspension. The proposed final decision is now submitted for the Board's review., 77755=B-158 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of April 24, 2002 are submitted for adoption., 25312=B-39 TRUCK DRIVER (C9122A), COUNTY OF MERCER The County of Mercer, represented by Alfred B. Vuocolo, Jr., County Counsel, requests reconsideration of that part of the decision rendered on March 13, 2001 by the Merit System Board ordering the appointing authority to pay selection processing costs in the amount of $2,048., 6267=A-9 TODD SILVERMAN Todd Silverman, Senior Correction Officer, East Jersey State Prison, Department of Corrections, appeals the denial of sick leave injury benefits. It is noted that at the time of the incident the appellant was employed by the New Jersey Training School for Boys, Juvenile Justice Commission. This matter was held over from the Merit System Board meeting of April 24, 2002., 31909=B-53 ERIC PRAUZE Eric Prauze, a former County Correction Officer with Gloucester County, appeals his resignation in good standing effective September 24, 2001., 20595=B-32 VINCENT P. STRIGNILE Vincent P. Strignile, a Senior Sanitary Inspector with the City of Paterson, represented by Irwin H. Tessler, Esq., petitions the Merit System Board for interim relief of his immediate suspension, effective September 13, 2001., 4449=A-6 JACQUETTA SPINKS Jacquetta Spinks, County Correction Officer, County of Union, Department of Public Safety, removal effective May 24, 2000, on the charge of conduct unbecoming a public employee., 25815=B-40 JAN RONK Jan Ronk, a Behavior Modification Program Technician at Woodbridge Developmental Center, Department of Human Services, represented by Sarah Evans, Staff Representative, CWA Local 1040, petitions the Merit System Board for reconsideration of the final administrative decision rendered on January 30, 2001, which denied her request for sick leave injury (SLI) benefits., 29096=B-47 JOHN K. KAVAKICH John K. Kavakich, represented by Merick H. Limsky, Esq., requests appropriate salary step placement consistent with a retroactive permanent appointment date of August 25, 1998 to the title of Police Officer, City of Clifton., 261=A regular meeting of the Merit System Board was held on Wednesday, May 15, 2002, in Trenton, New Jersey., 755=Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey., 80169=There being no further business before the Merit System Board, the meeting was adjourned to convene on Wednesday, May 29, 2002 at 10:00 a.m., at 3 Station Plaza, Trenton, New Jersey. ______________________________ IDA L. CASTRO COMMISSIONER MERIT SYSTEM BOARD, 639=In accordance with L.1975, c.231, Chairwoman Ida L. Castro opened the meeting with the following statement:, 38499=B-60 WILLIAM GAWRON The appeal of William Gawron, a Police Captain with the Borough of Sayreville, of his bypass on the eligible list for Police Chief, was heard by Administrative Law Judge Kathryn A. Clark (ALJ), who rendered her initial decision on February 4, 2002. At its meeting on March 27, 2002, the Merit System Board (Board) adopted the ALJ's recommendation to uphold the bypass. The proposed final decision is now submitted for the Board's review., 3489=A-4 HARRY TOMLIN AND EDWARD F. PAUL, III Harry Tomlin and Edward F. Paul, III, Emergency Medical Technicians, City of Gloucester, Fire Department, appeal the good faith of their layoffs effective July 23, 1999 for reasons of economy and efficiency., 36877=B-59 JESSIE BROWN The appeals of Jessie Brown, a Data Entry Machine Operator with the City of East Orange, Municipal Court, of her 30-day suspension beginning March 8, 1999, and removal effective December 13, 1999, both on charges, were considered by Administrative Law Judge Elinor R. Reiner (ALJ), who rendered her initial decision on February 15, 2002. At its meeting on March 27, 2002, the Merit System Board (Board) adopted the ALJ's recommendations to uphold the 30-day suspension and the removal. The proposed final decision is now submitted for the Board's review., 76087=B-156 GEORGE M. LOBMAN George M. Lobman petitions the Merit System Board for reconsideration of the decision rendered on June 12, 2001, which found that he was ineligible for the promotional examination for Supervising Engineer Construction and Maintenance (PS245T), Department of Transportation, because he was not permanent in a title to which the examination was open., 35118=B-58 CAMILLE BILELLO The appeal of Camille Bilello, a Senior Cook with the Brick Township School District, concerning her return to her permanent title at the end of her working test period effective January 4, 2000, was heard by Administrative Law Judge Anthony T. Bruno (ALJ), who rendered his initial decision on February 8, 2002. At its meeting on March 27, 2002, the Merit System Board did not adopt the ALJ's recommendation to reverse to failure of the working test period and to grant permanent status in the title of Senior Cook. Rather, the Board ordered that the matter be remanded to the Office of Administrative Law for further proceedings. The proposed decision is now submitted for the Board's review., 43193=B-63 CRAIG DICKSON The appeal of Craig Dickson, a Truck Driver with the Department of Public Works, Township of Pennsauken, of his removal effective December 1, 2000 on charges, was heard by Administrative Law Judge Bruce R. Campbell (ALJ), who rendered his initial decision on March 11, 2002, upholding the removal. At its meeting on April 24, 2002, the Merit System Board did not adopt the ALJ's recommendation. Rather, the Board ordered that the matter be remanded to the Office of Administrative Law. The proposed decision is now submitted for the Board's review., 76695=ACTION: The Merit System Board adopted the minutes of its meeting of April 10, 2002., 4833=A-7 CARLA YOUNG Carla Young, Senior Clerk Typist, County of Gloucester, Prosecutor's Office, was initially removed effective July 2, 1997, based on the criminal charge on possession of a controlled dangerous substance with the intent to distribute. While the case was pending at the Office of Administrative Law, the criminal charge was dismissed. Pursuant to an Interlocutory Order, the Administrative Law Judge allowed the appointing authority to amend the charges to conduct unbecoming a public employee, inability to perform duties, and other sufficient cause., 28871=ACTION: The Merit System Board granted the appellant $2,084.28 in back pay plus PERS contributions from September 30, 1997 through May 11, 2000 and granted the appellant $7,233.72. in counsel fees., 40006=B-61 JANET COOKE The appeal of Janet Cooke, a Fire Alarm Operator with the City of East Orange Fire Department, of her removal effective November 12, 1996, on charges, was heard by Administrative Law Judge Stephen G. Weiss (ALJ), who rendered his initial decision on February 28, 2002, upholding the removal. At its meeting on April 10, 2002, the Board adopted the ALJ's recommendation. The proposed final decision is now submitted to the Board's review., 45322=B-67 NIGEL D. BROWN Nigel D. Brown appeals the determination of the Division of Selection Services, which found that he did not meet the experience requirement for the open competitive examination for Electronic Systems Technician 1 (C6240C), Cape May County., 2567=A-2 MARGARET FORD Margaret Ford, Social Work Supervisor, County of Gloucester, Board of Social Services, demotion to the title of Social Worker effective October 16, 2000, on charges of incompetency, inefficiency, failure to perform duties and inability to perform duties., 43869=B-64 ROBERT LOCKETT The appeal of Robert Lockett, an Industrial Manager 2 at the Albert C. Wagner Youth Correctional Facility, Department of Corrections, of his removal effective December 1, 1999 on charges, was heard by Administrative Law Judge John R. Tassini (ALJ), who rendered his decision on January 18, 2002, reversing the removal. At its meeting on April 24, 2002, the Board ordered that this matter be remanded to the Office of Administrative Law. The proposed decision is now submitted for the Board's review., 7993=A-12 HENRY R. CIOFFI - SETTLEMENT Henry R. Cioffi, City of Long Branch, eligible list bypass dispute. Settled to appointment to the next available regular appointment as a Fire Fighter. This matter was held over from the Merit System Board meeting of March 27, 2002., 8442=A-13 DOLORES PHILLIPS (CONSOLIDATION) Dolores Phillips, Senior Parole Officer, Division of Parole and Community Programs, Department of Corrections, ten-day suspension, and removal effective May 18, 1998, on the charge of neglect of duty, a 20-day suspension on the charge of insubordination, and a resignation not in good standing effective May 18, 1998, on the charge of absent from duty for five or more consecutive days without approval. Ms. Phillips also appeals the denial of an extended medical leave of absence. This matter was held over from the Merit System Board meeting of March 27, 2002., 76547=B-157 MERIT SYSTEM BOARD MINUTES The Merit System Board Minutes for the meeting of April 10, 2002 are submitted for adoption., 20870=ACTION: The Merit System Board denied the request for interim relief regarding his immediate suspension, denied the request for counsel fees, and directed that the request for back pay be granted in part from December 13, 2001 to January 15, 2002., 5583=A-8 HALL WHITE Hall White, Senior Correction Officer, New Jersey State Prison, Department of Corrections, ten-day suspension, 30- day suspension and two removals effective January 24, 1997 and March 14, 1997, on charges of, inter alia, insubordination, conduct unbecoming a public employee and violation of various Department rules regarding personal conduct, intentional disobedience, disrespect or use of insulting or abusive language to a supervisor., 6884=A-10 CURTIS GERMANY Curtis Germany, Security Guard, State-Operated School District of Newark, removal effective December 1, 1998, on charges of conduct unbecoming a public employee and other sufficient cause., 33605=B-57 KATHERINE BERGMANN The appeal of Katherine Bergmann, an unclassified Secretary to the Warren County Prosecutor, of her removal effective July 24, 1995, was heard by Administrative Law Judge Arnold Samuels (ALJ), who rendered his initial decision on December 21, 2001, upholding the removal. At its meeting on March 27, 2002, the Merit System Board (Board) adopted the ALJ's recommendation. The proposed final decision is now submitted for the Board's review.}",
    "lastModified": "Wed, 07 May 2014 18:25:24 GMT",
    "textBeforeTable": "Ida L. Castro, Chairwoman Alan Dexter Bowman Josephine DiRienzo Robert J. Long A regular meeting of the Merit System Board was held on Wednesday, May 15, 2002, in Trenton, New Jersey. PRESENT: Chairwoman Ida L. Castro, Merit System Board Members, Alan Dexter Bowman, Josephine DiRienzo, and Robert J. Long; Andrea Grundfest, Deputy Attorney General; and Henry Maurer, Director, Division of Merit System Practices and Labor Relations. In accordance with L.1975, c.231, Chairwoman Ida L. Castro opened the meeting with the following statement: Notice of this meeting was filed with the Secretary of State and sent to the Trentonian, Trenton Times, Courier-Post and Star Ledger on March 7, 2002, and posted at the Department of Personnel, 3 Station Plaza, Trenton, New Jersey. All actions were by unanimous vote unless otherwise specified. SECTION A - HEARING MATTERS A-1 SETTLEMENTS In the Matter of William Ailes-Flanagan Riverfront State Prison Department of Corrections SLI denial appeal In the Matter of Albert Clark William Paterson University Suspension In the Matter of Andre Davis Newark Housing Authority Removal In the Matter of James Davis City of Jersey City Library Suspensions (2) In the Matter of John Fitzgerald New Jersey State Prison Department of Corrections Removal In the Matter of Patricia Hayes North Jersey Developmental Center",
    "textAfterTable": "B-58 CAMILLE BILELLO The appeal of Camille Bilello, a Senior Cook with the Brick Township School District, concerning her return to her permanent title at the end of her working test period effective January 4, 2000, was heard by Administrative Law Judge Anthony T. Bruno (ALJ), who rendered his initial decision on February 8, 2002. At its meeting on March 27, 2002, the Merit System Board did not adopt the ALJ's recommendation to reverse to failure of the working test period and to grant permanent status in the title of Senior Cook. Rather, the Board ordered that the matter be remanded to the Office of Administrative Law for further proceedings. The proposed decision is now submitted for the Board's review. ACTION: The Merit System Board adopted the decision. VOTE: Ida L. Castro (Yes) Alan Dexter Bowman (Yes) Josephine DiRienzo (Yes) Robert J. Long (Abstained) B-59 JESSIE BROWN The appeals of Jessie Brown, a Data Entry Machine Operator with the City of East Orange, Municipal Court, of her 30-day suspension beginning March 8, 1999, and removal effective December 13, 1999, both on charges, were considered by Administrative Law Judge Elinor R. Reiner (ALJ), who rendered her initial decision on February 15, 2002. At its meeting on March 27,",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}