{
    "relation": [
        [
            "Related Topic",
            "Licensing",
            "Command reference"
        ],
        [
            "Document Title",
            "Cisco NX-OS Licensing Guide",
            "Cisco Nexus 5000 Series NX-OS Command ReferenceCisco Nexus 6000 Series Command Reference"
        ]
    ],
    "pageTitle": "Cisco Nexus 6000 Series NX-OS Fundamentals Configuration Guide, Release 6.x - Working with Configuration Files [Cisco Nexus 6000 Series Switches] - Cisco",
    "title": "",
    "url": "http://www.cisco.com/c/en/us/td/docs/switches/datacenter/nexus6000/sw/fundamentals/6x/b_6k_Fund_Config_6x/b_6k_Fund_Config_602N11_chapter_01000.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00135-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 361040507,
    "recordOffset": 361021192,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "The following table shows the licensing requirements for this feature: Licensing Requirements for Configuration Files Downloading the Startup Configuration From a Remote Server Saving the Running Configuration to the Startup Configuration Related Tasks To change the startup-configuration file, you can either save the running configuration file to the startup configuration or download a configuration file from a file server to the startup configuration. To change the running configuration, use the configure terminal command to enter global configuration mode. As you use the Cisco NX-OS configuration modes, commands generally are executed immediately and are saved to the running configuration file either immediately after you enter them or when you exit a configuration mode. The Cisco NX-OS software has two types of configuration files, running configuration and startup configuration. The device uses the startup configuration (startup-config) during device startup to configure the software features. The running configuration (running-config) contains the current changes that you make to the startup-configuration file. The two configuration files can be different. You might want to change the device configuration for a short time period rather than permanently. In this case, you would change the running configuration by using commands in global configuration mode but not save the changes to the startup configuration.",
    "textAfterTable": "Managing Configuration Files This section describes how to manage configuration files. Saving the Running Configuration to the Startup Configuration Copying a Configuration File to a Remote Server Downloading the Running Configuration From a Remote Server Downloading the Startup Configuration From a Remote Server Copying Configuration Files to an External Flash Memory Device Copying the Running Configuration from an External Flash Memory Device Copying the Startup Configuration from an External Flash Memory Device Copying Configuration Files to an Internal File System Rolling Back to a Previous Configuration Removing the Configuration for a Missing Module Erasing a Configuration Clearing Inactive Configurations Saving the Running Configuration to the Startup Configuration You can save the running configuration to the startup configuration to save your changes for the next time you that reload the device. SUMMARY STEPS 1.    (Optional) show running-config 2.    copy running-config startup-config DETAILED STEPS   Command or Action Purpose Step 1",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}