{
    "relation": [
        [
            "Categories",
            "Great for these types of students",
            "What to do for fun",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "Music Students, especially those wanting to major in Jazz Studies.",
            "The college campus has a rec center free with student ID that is available everyday of the week and late nights. There's a place called The Square located to the east of campus that offers many cool restaurants (with frequent band performances) and places to shop.",
            "Definitely tour the campus before attending. I would also suggest trying to sit in on a couple of classes so you can get an idea for the class sizes and professors at the University of North Texas. If you're a music student, try to schedule a meeting with your area's head professor. I found that helpful for both being able to screen who I would potentially study under and for getting to know what they would expect of me for the audition.",
            "UNT is an excellent school that provides a world class music program for an affordable price. I love the campus as it is positioned 40 miles from Dallas giving it a secluded feeling. Overall this college satisfies both my desires for a exceptional college of music and for an academic challenge."
        ]
    ],
    "pageTitle": "University of North Texas (UNT) Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/University-of-North-Texas/reviews?_escaped_fragment_=/show/87216",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 913475183,
    "recordOffset": 913289934,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{591273=Freshmen are required to have a meal plan for this school, but the food is great. They offer many different styles of cafeterias such as, an all vegan hall, a Cajun hall, a general foods hall, and many others. We have many places to eat on campus and some high dollar places like Starbucks., 58465=As I am in pursuit of my B.A.A.S. degree, UNT has excellent programs that accept my credits earned at a Technical College. I am looking forward to attending in the Fall of 2009. Everyone I have met at the campus is friendly and very helpful., 867393=February is a spring month, why is there snow? My class wasn't uphill when I was on time last Monday... HOW IS IT FINALS ALREADY????, 380469=I have attended UNT since Spring 2012 including Summer after having transferred from a junior college. I attend evening classes and had been working fulltime until now. As a result I am not very involved with lot's of campus activities, my review may be limited in some aspects., 383158=There are so many things on campus to do for fun, but the Union at the 1 o'clock lounge is the place to be on campus., 755652=A variety to choose from. There is cajun cafeterias, vegan cafeterias, as well as the standard ones., 214768=unt might not have the same prestige as smu, but it is still very nice, and certainly much cheaper. expect to pay about $1300 per 4 hour class (including fees, texts, etc.). financial aid seems kind of lacking, but the fa office claims it is temporarily short on funding., 408856=UNT is the best decision I have every made! I will be graduating this December with a Bachelors in Psychology and Minor in Spanish. Its diverse, comfortable, and its a awesome school!, 449420=I do not know yet. I will start in August., 51814=well lit, unt shuttle buses run all over campus and town until like 10:30, and emergency stations are numerous., 873635=Every April there is a 12 hour concert in one of the dorms (Bruce Hall) called Bruce Jam. This concert is open to everyone and features student bands. Bruce Hall also host a haunted house every October/, 938232=If you look around, there is usually something to do every day. I'm more of a hermit and keep to my room, but I hear about a lot of different things. Andy Grammar even did a concert here the other week! Most things are free too!, 1149997=UNT is great on traditions like the Mean Green Victory march after winning football games., our Alma Mater chant at Football games. Fraternity Bid Day marches around campus in the Fall and Spring. The campus bell that rings a nice little tune every hour on the hour. And certainly the unforgettable Eagle CAWH that anyone can throw up at a given time to show school spirit., 22038=Make sure you like where you will be living first and if you need a job apply in June or July. If you don't like noise don't stay in a dorm. Best freshmen halls for walking to class are Kerr and Maple as they have food for first thing in the morning and bus stops right in front of them. Also DON'T DO MORNING CLASSES!!! It's not like high school 8am because at least there you can go to bed before oh say... midnight?}",
    "textBeforeTable": "07/11/2009 Reviewer is A current student here. 64 out of 65 people found this review useful. 1 of 431 Amber from Denton, TX Check out reviews left by other students or leave your own review. You could win a free scholarship. University of North Texas Reviews University of North Texas › Texas › By State › Colleges › } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.create', -->",
    "textAfterTable": "Categories Comments Great for these types of students North Texas has the allure of having a great art/music school with the diversity (and affordability!) you would expect from a state school. Denton is a great city as well with many parks and festivals to partake in. The public transportation is fairly decent as well. Tips for prospective students Weird/art kids tend to gravitate towards Bruce Hall their first year (myself included). Most residence halls have a distinctive community feel. Mean Greens has the best food on campus with the paninis being the best. Login to rate or flag the reviews Laura from Kingwood, TX 07/17/2009 Reviewer is A current student here. 27 out of 27 people found this review useful. 3 of 431 Categories Comments Great for these types of students The University definitely has an extremely broad horizon of students. Because the Visual Arts program is extremely well known and growing, there are alot of artsy people. I think this school is perfect for those",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}