{
    "relation": [
        [
            "",
            "Renin (μU/mL)",
            "Aldosterone (pg/mL)"
        ],
        [
            "Before",
            "0.7",
            "280"
        ],
        [
            "After",
            "0.6",
            "580"
        ],
        [
            "RV",
            "(D -1 - 20 μU/mL) (S – 2 - 60 μU/mL)",
            "(D - 10 - 160 pg/mL) (S - 40 - 310 pg/mL)"
        ]
    ],
    "pageTitle": "Primary Hyperaldosteronism: Pitfalls in the Diagnosis and a not so Peculiar Evolution - Case Report | Martins | Journal of Endocrinology and Metabolism",
    "title": "",
    "url": "http://www.jofem.org/index.php/jofem/article/viewArticle/113/188",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00071-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 519555255,
    "recordOffset": 519522073,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{9968=HS, a Caucasian female patient, aged 32, unskilled worker, divorced, living in Lisbon, was referred to the Endocrine Out Patient Department of a public central hospital, on October 1999, because of HBP and hypokalemia. , 6874=Figure 1. Abdominal CT scan. (a) 1999 - a small nodular lesion around 1 cm is noted in the left adrenal gland; no abnormalities were found regarding the right adrenal gland. (b) 2001 - a nodular lesion hypodense with 15 mm maximal diameter, is noted in the right adrenal gland, which is not apparent in the previous scan; no apparent lesions were found regarding the left adrenal gland., 22426=aEndocrine Department, Santa Maria Hospital and Lisbon Medical School, Lisbon, Portugal bCorresponding author: Joao Martin Martins, Servico de Endocrinologia, Piso 6, Hospital de Santa Maria, Av. Prof. Egas Moniz, 1649-028 Lisboa, Portugal, 21841=Manuscript accepted for publication August 17, 2012 Short title: Primary Hyperaldosteronism doi: http://dx.doi.org/10.4021/jem113w, 18796=High blood pressure (HBP) occurs in 25% of the western developed world population [1]. It is now considered that up to 15% may correspond to secondary forms [2-4]. In particularly, recent studies suggest, primary hyperaldosteronism (PA), first described by Conn in 1955, is a rather common condition accounting for more than 10% of all cases [2-4]. This contrasts sharply with previous consensus, where essential or “idiopathic” hypertension was assumed to account for about 95% of all cases of non selected HBP [5]. , 29865=ICMJE Recommendations (updated August 2013) Recommendations for the Conduct, Reporting, Editing and Publication of Scholarly Work in Medical Journals, 29470=WMA Declaration of Helsinki Ethical Principles for Medical Research Involving Human Subjects (October 2013)}",
    "TableContextTimeStampAfterTable": "{32815=On January 2001, the patient now aged 33, was again admitted to the Endocrine Unit after a week end free of medication. The saline suppression test (Table 4) and the ambulatory test (Table 5) were again repeated. An adrenal CT scan was again obtained and a nodular lesion of 15 mm diameter, with low density and smooth contours was found in the right adrenal, with no apparent abnormalities on the left (Fig. 1b). Previous diagnosis and therapy were resumed after discharge.   , 31213=Figure 2. 131I Norcholesterol Scintigraphic examination. (a) 1999 - images were obtained at the 3rd, 5th and 8th day; slight hyperfixation is found over both the adrenals. (b) 2007 - images were obtained at the 3rd and 7th day; clear hyperfixation above the upper pole of the right kidney more evident at the 7th day., 128317=Journal of Endocrinology and Metabolism, bimonthly, ISSN 1923-2861 (print), 1923-287X (online), published by Elmer Press Inc.      The content of this site is intended for health care professionals. This is an open-access journal, published articles are distributed under the terms of the Creative Commons Attribution License, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited. website: www.jofem.org   editorial contact: editor@jofem.org Address: 9160 Boul Leduc, Bureau 410, Brossard, Quebec, J4Y 0E3, Canada © Elmer Press Inc. All Rights Reserved., 47757=On March 2002, a planned pregnancy occurred after dexamethasone substitution for alpha-methyldopa 500 mg tid. Pregnancy was uneventful with normal blood pressure levels and no pre-eclampsia or eclampsia. A boy was born with normal weight and normal vitality at 5 and 10 min. Phallopian tubes were ligated at the time and dexamethasone was again resumed 1.0 mg, at bedtime every other day. , 48291=On August 2005, the patient now aged 37 was again admitted to the Endocrine Department because of acute gastroenteritis with serious hypokalemia (1.8 mEq/L). The patient denied missing any drug schedule and she was not hypertensive. There was no fever and the stools were without blood, mucus or pus. C-Reactive protein was negative. Again high serum aldosterone levels (280 pg/mL) and low renin levels (0.7 μU/mL) were measured. Three days later after correction of the clinical condition and serum potassium the patient was discharged and previous medication was resumed. , 49404=Since 2008, blood pressure levels began to increase despite drug treatment and spironolactone 100 mg/day and later bisoprolol 5 mg/day were added. At this time there was still no evidence of target-organ lesions, namely regarding the heart or the kidneys. At the end of 2008 the patient was again admitted to the Endocrine Department because of resistant high blood pressure, although with no specific symptoms and still with a normal serum potassium levels. Dynamic tests were again repeated and are shown in Tables 6 and 7. A new scintigraphic examination with 19-noriodomethylcolesterol was performed hat revealed persistent and abnormal fixation at the right adrenal gland (Fig. 2b). Surgery was decided and performed on March 2009; the right adrenal gland with 24 × 1 mm and 9 g was removed and an adenoma was identified. There was no reference to adrenal hyperplasia on the remaining gland.   }",
    "textBeforeTable": "Table 5. Ambulatory Testing (4 h Brisk Walking)     (10 - 160 pg/mL) 560 320 350 Aldosterone (pg/mL)",
    "textAfterTable": "On March 2002, a planned pregnancy occurred after dexamethasone substitution for alpha-methyldopa 500 mg tid. Pregnancy was uneventful with normal blood pressure levels and no pre-eclampsia or eclampsia. A boy was born with normal weight and normal vitality at 5 and 10 min. Phallopian tubes were ligated at the time and dexamethasone was again resumed 1.0 mg, at bedtime every other day.  On August 2005, the patient now aged 37 was again admitted to the Endocrine Department because of acute gastroenteritis with serious hypokalemia (1.8 mEq/L). The patient denied missing any drug schedule and she was not hypertensive. There was no fever and the stools were without blood, mucus or pus. C-Reactive protein was negative. Again high serum aldosterone levels (280 pg/mL) and low renin levels (0.7 μU/mL) were measured. Three days later after correction of the clinical condition and serum potassium the patient was discharged and previous medication was resumed.  Again for 2 years, evolution was uneventful with normal blood pressure levels and normal serum potassium, and no relevant side effects.  Since 2008, blood pressure levels began to increase despite drug treatment and spironolactone 100 mg/day and later bisoprolol 5 mg/day were added. At this time there was still no evidence of target-organ lesions, namely regarding the heart",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}