{
    "relation": [
        [
            "Patent application number",
            "20140081776",
            "20140081809",
            "20140081847"
        ],
        [
            "Description",
            "SYSTEM AND METHOD FOR PURCHASING IN A DIGITAL CHANNEL - The systems, methods, and computer program products (collectively “systems”) described herein are generally configured to monitor actions in digital channels. More specifically, the systems are capable of initiating purchases in a broadcast channel. The systems are capable of syncing transaction accounts with various digital channels. Moreover, the systems are capable of initiating or completing transaction based on user information. The systems may also be capable of providing rewards based on activities or accomplishments in the digital channels. Moreover, the systems may be capable of verifying activities based on transaction information.",
            "SYSTEM AND METHOD FOR PURCHASING IN A DIGITAL CHANNEL - The systems, methods, and computer program products (collectively “systems”) described herein are generally configured to monitor actions in digital channels. More specifically, the systems are capable of initiating purchases in a broadcast channel. The systems are capable of syncing transaction accounts with various digital channels. Moreover, the systems are capable of initiating or completing transaction based on user information. The systems may also be capable of providing rewards based on activities or accomplishments in the digital channels. Moreover, the systems may be capable of verifying activities based on transaction information.",
            "SYSTEM AND METHOD FOR PURCHASING IN DIGITAL CHANNELS - The systems, methods, and computer program products (collectively “systems”) described herein are generally configured to monitor actions in digital channels. More specifically, the systems described herein are capable of initiating a transaction with a transaction account based on an action in any suitable digital channel. The systems are capable of syncing transaction accounts with various digital channels. Moreover, the systems are capable of initiating or completing transaction based on user information. The systems may also be capable of providing rewards based on activities or accomplishments in the digital channels. Moreover, the systems may be capable of verifying activities based on transaction information."
        ],
        [
            "Published",
            "03-20-2014",
            "03-20-2014",
            "03-20-2014"
        ]
    ],
    "pageTitle": "King, MA - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/king-ma-3/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00285-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 428344451,
    "recordOffset": 428314531,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Kathleen King, Mattapoisett, MA US 06-24-2010 METHODS OF MODULATING METABOLIC MEMORY - Described are methods of identifying modulators of metabolic memory, for the treatment of microvascular complications of diabetes, as well as methods of use thereof. Also described are methods of treating microvascular complications of diabetes by decreasing expression and/or activity of SHP-1. 20100160412 06-03-2010 METHODS OF MODULATING ANGIOGENESIS - The present inventors discovered that PKCε is necessary for VEGF signaling through PI3K/Akt-dependent pathways and is involved in MAPK-dependent pathways, thus regulating eNOS activity and DNA synthesis, respectively. Thus differential manipulation of PKCε activity can be used to modify VEGF effects in conditions in which modulation of angiogenesis is desirable (e.g., for treatment of diabetic proliferative retinopathy or to enhance angiogenesis for treatment of peripheral and myocardial ischemia). 20100135995 Published Description Patent application number George Liang King, Dover, MA US 07-03-2014 PREDICTING AND TREATING DIABETIC COMPLICATIONS - Compositions and methods for diagnosing, predicting risk of, and/or treating diabetic retinopathy and/or diabetic nephropathy. 20140187498 Published Description Patent application number George L. King, Dover, MA US //]]> BarDraw('3000947',['Patent applications by George King, Ware, MA US'],[[1,1,1]],['2009','2010','2013'],0); // <script type=\"text/javascript\"> </div> <div id=\"legend3000947\" align=\"center\"></div> </div> <canvas id=\"bg3000947\" style=\"max-width: 500px; width: 100%;\"></canvas> <div> <p align=\"center\">Patent applications by George King, Ware, MA US</p> <div class=\"bar3000947\" style=\"max-width: 500px; width: 100%; float:left; \"> <div align=\"left\" style=\"padding-top:20px;\"> </table> </tbody>",
    "textAfterTable": "Kenneth King, East Freetown, MA US Patent application number Description Published 20130199386 PRINT HEAD FOR STENCIL PRINTER - A stencil printer for printing viscous material on an electronic substrate includes a stencil having apertures formed therein, and a print head positioned over the stencil and configured to deposit viscous material within the apertures of the stencil. The print head includes a housing defining an elongate chamber, a source port defining a passage having an inlet positioned to allow viscous material to flow into the elongate chamber, a pair of blades defining a slot that provides an outlet from which viscous material can flow out of the elongate chamber, an elongate plunger movable in the elongate chamber to reduce a volume of viscous material within the elongate chamber, and at least one sensor to detect pressure of the viscous material within the elongate chamber. 08-08-2013 20150014396 PRINT HEAD FOR STENCIL PRINTER - A stencil printer for printing viscous material on an electronic substrate includes a stencil having apertures formed therein, and a print head positioned over the stencil and configured to deposit viscous material within the apertures of the stencil. The print head includes a housing defining an elongate chamber, a source port defining a passage having an inlet positioned to allow viscous material to flow into the elongate chamber, a pair of blades defining a slot that provides an outlet from which viscous material can flow out of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}