{
    "relation": [
        [
            "Datum",
            "8. Juli 2002",
            "31. Mai 2005",
            "4. Jan. 2008",
            "3. Jan. 2012"
        ],
        [
            "Code",
            "AS",
            "CC",
            "FPAY",
            "FPAY"
        ],
        [
            "Ereignis",
            "Assignment",
            "Certificate of correction",
            "Fee payment",
            "Fee payment"
        ],
        [
            "Beschreibung",
            "Owner name: PSC SCANNING, INC., OREGON Free format text: ASSIGNMENT OF ASSIGNORS INTEREST;ASSIGNORS:KEYS, BARRY H.;DELOGE, STEPHEN P.;MACOMBER, LARRY RAMSEY;REEL/FRAME:013058/0686;SIGNING DATES FROM 20020313 TO 20020315",
            "",
            "Year of fee payment: 4",
            "Year of fee payment: 8"
        ]
    ],
    "pageTitle": "Patent US6758403 - System for editing data collection device message data - Google Patente",
    "title": "",
    "url": "http://www.google.de/patents/US6758403?hl=de",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00133-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 474736771,
    "recordOffset": 474674061,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{273080=In another important aspect of the invention, legacy software prompt screen 1141 sp preferable comprises a graphical user interface (GUI), as is indicated in the embodiment of FIG. 2c which typically includes such features as drop down menus and control buttons, e.g. 195 which are operable with use of a point-and-click device such as a mouse 113 m. Configuring program 190 so that prompt screen 114 lsp comprises a GUI allows a complete set of instructions for editing message data to be built without typing mnemonics or other words using a keyboard 113 k., 230539=Return a string that has been left justified or truncated according to n. The integer constant n must be in the range of 1 to 32000 and specifies the total number of characters in the output; if n is greater than the size of string, then it is padded with the optional fill character or with nulls and if less than the size of string, the string is truncated from the right. Labeling of arguments is optional (the labels are enclosed in [ ]); they are used merely for readability., 263791=Referring again to the legacy software information prompting screen 114 lsp shown in FIG. 2c, the manner in which legacy software information prompt screen 114 lsp can be utilized so that compatibility is achieved between modern 2D shipping label 245 and the data receipt software package driving 1D data receipt screen 232 will be described. Legacy software information prompt screen 114 lsp shown in FIG. 2c prompts a user to enter information respecting (1) the types of data messages (Serial no., Part no., and Quantity) received and (2) the ordering in which those data messages are received. Legacy software information prompting screen 114 lsp also prompts a programmer-user to enter information regarding whether a PREAMBLE or POSTAMBLE must be attached to the message data output by device 10. In the specific example provided in which a programmer-user wishes to edit data generated by decoding 2d symbol into a form in which it can be received by host operating under the control of the legacy software package driving screen 232 a programmer-user checks appropriate part number, serial no., and quantity boxes of the fields of column 152 to designate the data types being received, and then enters appropriate information in the fields of receive ordering column 154 to designate the ordering in which that data is to be received. A user-programmer also enters the appropriate carriage return entry “CRLF” in the appropriate fields of the POSTAMBLE column 158 of screen 1141 sp and into GLOBAL POSTAMBLE input Field 156 to entering information respecting legacy software package, a programmer-user may utilize screen 114 lsp to enter the data format type of the dataform replacing the dataforms of the shipping label to be replaced. In the example provided, a user-programmer enters the DATAMATRIX menu choice in field 160 to indicate that the message data being acted upon by the set of data editing instructions being built is DATAMATRIX message data. Referring to additional features of prompt screen 114 lsp, prompt screen 114 lsp can include any of control buttons 191, 192, 193, 194, 195, and 196 as explained with reference to FIG. 2b., 149944=1.8.10. Flagged Warning parameter—The syntax of this parameter is the single character W. If included, this specifies that if no output results from this data locator, then the missing data warning flag will be raised so that appropriate action may be taken by the application., 232546=Return a string that has been right justified or truncated according to n. The integer constant n must be in the range of 1 to 32000 and specifies the total number of characters in the output; if n is greater than the size of string, then it is padded with the optional fill character or with nulls and if less than the size of string, the string is truncated from the left. Labeling of arguments is optional (the labels are enclosed in [ ]); they are used merely for readability., 124400=A data locator permits symbol data to be edited and reported and can be used multiple times in an edit format to edit and report symbol data in different ways. For example, via the M parameter, so that only a subset of the raw data is reported; message data can also be right or left justified data editing instructions can conditionally add a preamble or postamble depending on whether or not any data results from the range adjustment step. For example, a social security number symbol decoded as “123456789” can be edited for reporting as “123-45-6789” using the edit format %DM1,3%-%DM4,2%-%DM6,4%, where 3 characters starting at the first position in the symbol data are specified, followed by a dash, followed by 2 characters starting at the fourth position in the symbol data, followed by a dash, followed by 4 characters starting at the sixth position in the symbol message data. The text “Soc. sec. #=” could be positioned in front of the %DM1,3% to produce “Soc. sec. #32 123-45-6789” as output by changing %DM1,3% to %D{circumflex over ( )}PRD (Soc. sec. #=)M1,3%. The edit formats %DM1,3%, %DM4, 2%, and %DM6,4% are all data locator type instructions embedded with reporting type instructions. In addition to specifying what text to report, message data can also optionally be right or left justified, possibly with blank or zero padding. For example, changing %DM1,3% to %DZLM1, 3,5% causes the first field to be left justified in a 5 character field resulting in “12300-45-6789”, where two zero pad characters are added to the 3 symbol data characters. There are more elaborate ways of specifying the symbol data to be used via the M parameter (using search strings, for example) which will be explained in more detail in the Syntax section below., 285529=Light reflected from the target T is detected by the photo-sensor 32, which outputs a data signal 310 indicative of lighter and darker portions of the target. In a preferred embodiment, the photo-sensor 32 comprises, for example, a CCD linear sensor, but it may also be embodied as a two-dimensional CCD array, a linear or multi-dimensional CMOS array (such as described in U.S. patent application Ser. No. 08/697,408 filed Aug. 23, 1996, hereby incorporated by reference as is set forth fully herein), or a photodiode. The photo-sensor output data signal 38 is fed to the signal control process block 34, which conditions the photo-sensor output signal 38 and generates an output signal 39 that generally identifies which regions of the image correspond to light areas, and which correspond to dark areas. Either analog or digital signal processing (which may include, for example, amplification and/or filtering) may be utilized in the control process block 34. Preferably, the control process block 34 sets the exposure time and thresholding so that the bars or relatively darker regions of the barcode or other target are reported as being dark, and the spaces or relatively lighter regions between the bars or darker regions are reported as being light, according to any number of techniques well known in the art. Exposure control techniques are described, for example, in U.S. patent application Ser. No. 08/697,408, previously incorporated herein by reference. The control process block 34 outputs data 39 indicative of the relative light and dark portions of the target T, and this data 39 is reported to control circuit 40 for further processing., 150241=1.8.11. Flagged Termination parameter—The syntax of this parameter is the single character T. If included, this specifies that if no output results from this data locator, then the terminate flag will be raised so that appropriate action may be taken by the application., 150531=1.8.12 Other Rules., 309976=FIG. 3k is a flow chart illustrating an embodiment of the data editing and scheme in a control circuit 40 of the present invention. In this embodiment, raw data e.g. data 39 from data reading front end e.g. 22 is delivered over a front end interface 60 to a decode process area 62 o the control circuit 40. The decode process area decodes the encoded raw data. The decoded output message data 59 is then presented to the edit/format process area 64 of the control circuit 40. Using a concentrate of edit formats (i.e. commands and or fixed text) of program 90, the edit/process area translates the decoded data 59 into an edited and formatted data 50 that is useful to a host 200. The edited 1106 is then outputted over the interface process area 65 to the host 200.}",
    "textBeforeTable": "Patentzitate While the present invention has been explained with reference to the structure disclosed herein, it is not confined to the details set forth and this invention is intended to cover any modifications and changes as may come within the scope of the following claims. A set of edit formats (commands and/or fixed text) exists for each symbology or symbology group, which is applied to symbol data of that symbology. When selecting the set or concatenate of edit forms to be used with a decoded data symbology, the edit formats are chosen through the user configuration process area 66 having a plurality of configuration levels 67 a and 67 b). The various configuration methods and apparatus in the configuration process area have been discussed above. In addition, in any of the above embodiments, the purpose of the edit section of program 90 is to allow a decoded symbol data, as reported by the control circuit 40 transformed into a data format is useful to a host by using simple edit formats (i.e., commands and/or fixed text). In any of the above embodiments of the present invention, program 90 may be stored in a nonvolatile memory within control circuit 40. However, as an alternative, program 90 may be stored by hardwired or semi-hardwired means such as microprogrammed hardware or hard-wired control logic within control circuit 40. In addition, program 90 can be a firmware that is specifically designed for",
    "textAfterTable": "Accessory for conversion with housing with first connection includes host cable and host connector and second connection including a plug-in modular connector US5675139 6. Dez. 1996 7. Okt. 1997 Symbol Technologies, Inc. Interface arrangement for use with consumer devices US5696496 * 15. Mai 1996 9. Dez. 1997 Khyber Technologies Corporation Portable messaging and scheduling device with homebase station US5745794 30. Sept. 1996 28. Apr. 1998 Symbol Technologies, Inc. System for converting signals into a predetermined data exchange format with plug-in modular connector having voltage, ground, data, and clock terminals for a scanning head US5770847 23. Dez. 1994 23. Juni 1998 Spectra-Physics Scanning Systems, Inc. Bar code reader with multi-focus lens US5814803 21. Dez. 1995 29. Sept. 1998 Spectra-Physics Scanning Systems, Inc. Image reader with multi-focus lens US5875415 18. Sept. 1997 23. Febr. 1999 Symbol Technologies, Inc. Universal host interface for data acquisition systems US5932862 * 3. Sept. 1996 3. Aug. 1999",
    "hasKeyColumn": true,
    "keyColumnIndex": 2,
    "headerRowIndex": 0
}