{
    "relation": [
        [
            "Working Standard (ug/mL)",
            "0.02",
            "0.05",
            "0.1",
            "0.2",
            "0.5",
            "1",
            "2",
            ""
        ],
        [
            "Std Solution (ug/mL)",
            "1",
            "5",
            "10",
            "10",
            "10",
            "100",
            "100",
            ""
        ],
        [
            "Aliquot (mL)",
            "10",
            "5",
            "5",
            "10",
            "25",
            "5",
            "10",
            ""
        ],
        [
            "Final Vol (mL)",
            "500",
            "500",
            "500",
            "500",
            "500",
            "500",
            "500",
            ""
        ]
    ],
    "pageTitle": "Occupational Exposure to Cadmium. - 58:21778-21850",
    "title": "",
    "url": "https://www.osha.gov/pls/oshaweb/owadisp.show_document?p_table=FEDERAL_REGISTER&p_id=13294",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00161-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 919537203,
    "recordOffset": 919373527,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{79147=(4) Watkins, R. Fieldkamp, SC, Thibert, RJ, and Zak, B, Clin Chem, 21, 1002 (1975), 84512=PART 1926--[AMENDED], 597846=(11) Gadsden, RH, and Phelps, CA, A Normal Range Study of Amylase in Urine and Serum on the Du Pont ACA, Du Pont Company, Wilmington, DE (March 1978). (Reprints available from Du Pont Company, Diagnostic Systems, 44418=106. On page 42426, first column, fourth paragraph, line 16, the word \"inperindividual\" is corrected to read, \"interindividual\", 18462=16. On page 42117, Table V-10., right most column, third entry, under the heading \"P Value\", is corrected to read, \"> 0.0001\", 58768=142. Beginning on page 42444 and continuing through page 42446, \"Attachment 2\" is corrected to read,, 472929=The data provided in table 4 from Kowal et al. (1979) are from studies conducted between 1974 and 1976 evaluating CDB levels for the general population in Chicago, and are considered to be representative of the U.S. population. These studies indicate that the average CDB concentration among those not occupationally exposed to cadmium is approximately 1 ug/l, 129600=(iv) For all employees to whom medical surveillance is provided, beginning on January 1, 1999, and in lieu of paragraphs (l)(3)(i)-(iii):, 79618=(7) Physicians' Desk Reference, Medical Economics Company, 33 Edition, 1979, 85600=156. On page 42455, Table 1. - Respiratory Protection for Cadmium, right column, line 2 under the heading, \"Required respirator type (b)\", is corrected by inserting a closed parenthesis after the abbreviation, \"(\"PAPR\" \", 86460=160. On page 42456, third column, paragraph (l)(1)(i)(A), line 17, the word \"reinforcing\" is corrected to read, \"reinforced\", 92789=(ii) Where the employer has monitored after September 14, 1991, under conditions that in all important aspects closely resemble those currently prevailing and where that monitoring satisfies all other requirements of this section, including the accuracy and confidence levels of paragraph (d)(6), the employer may rely on such earlier monitoring results to satisfy the requirements of paragraph (d)(2)(i) of this section, 30116=PART 1915-[AMENDED], 78674=(2) Tietz, NW, Fundamentals of Clinical Chemistry, W. B. Saunders Co., Philadelphia, PA, 1976, pp 47-52, 1211, 27661=46. On page 42191, first column, footnote number 5, line 5, the word, \"multiples\" is corrected to read, \"multiplies\", 576983=Skin Irritant; Rinse Contacted Area With Water. Comply With OSHA's Bloodborne Pathogens Standard While Handling Biological Samples (29 CFR 1910.1039), 219393=1. Substance Identification Chemical name: Cadmium sulfide Formula: CdS Molecular weight: 144.5 CAS No. 1306-23-6 Other Identifiers: RTECS EV3150000 Synonyms: Aurora yellow; Cadmium Golden 366; Cadmium Lemon Yellow 527;, 21990=36. On page 42180, second column, Table VI-9., footnotes \"a\" and \"b\" are corrected to read, \"a is B = 0.00061 (ug-years/m(3))(-1) b is B = 0.00026 (ug-years/m(3))(-1)\", 19535=22. On page 42134, first column, first paragraph, line 3, is corrected to read, \"and may cause damage; there is medical\", 195597=Annesley, T., England, B., and Schork, A.M. \"Occupational Cadmium Exposure and Renal Status.\" Am J.Ind.Med. 4:541, 1983.(64) 8-86A. Friberg, L., C.G. Elinder, et al., Cadmium and Health a Toxicological and Epidemiological Appraisal Volume I Exposure, Dose, and Metabolism. CRC Press, Inc., Boca Raton, FL, 1986. (Available from the OSHA Technical Data Center) 8-86B. Friberg, L., C.G. Elinder, et al. Cadmium and Health: A Toxicological and Epidemiological Appraisal Volume II Effects and Response. CRC Press, Inc., Boca Raton, FL, 1986. (Available from the OSHA Technical Data Center) L-140-45. Elinder, C.G., \"Cancer Morality of Cadmium Workers\", Brit. J, 12654=OSHA deleted the saccharin solution aerosol qualitative fit test protocol from the Cadmium final rule based upon a misreading of a comment submitted by the Maryland Occupational Safety and Health Administration (MOSH). The comment suggested the deletion of a reference to disposable dust respirators from the saccharin solution protocol in page 4131 Appendix C of the proposed Cadmium standard, 55 FR 4052 (February 6, 1990), since the standard prohibited the use of such respirators unless equipped with high efficiency filters. MOSH deemed the deletion to be necessary to avoid confusion. OSHA mistakenly deleted the entire protocol instead of only eliminating the reference to disposable dust respirators from the saccharin solution protocol. OSHA is correcting the preamble to the final rule and Appendix C by reinstating the deleted protocol and eliminating the reference to disposable dust respirators from the saccharin solution protocol to accurately reflect MOSH's comment, 85100=155. On page 42454, second column, paragraph (f)(5)(i), lines 1 through 8, are corrected to read,, 88045=168. On page 42462, first column, paragraph (m)(4)(iii)(H), line 2, is corrected to read, \"records under 1910.20(e) and (g).\", 216679=Do not touch spilled material. Stop leak if you can do it without risk. Do not get water inside container. For large spills, dike spill for later disposal. Keep unnecessary people away. Isolate hazard area and deny entry. The Superfund Amendments and Reauthorization Act of 1986 Section 304 requires that a release equal to or greater than the reportable quantity for this substance (1 pound) must be immediately reported to the local emergency planning committee, the state emergency response commision, and the National Response Center (800) 424-8802; in Washington, D.C. metropolitan area (202) 426-2675, 442841=Guarding against cadmium contamination of biological samples is particularly important when analyzing blood samples because cadmium concentrations in blood samples from nonexposed populations are generally less than 2 ug/l (2 ng/ml), while occupationally-exposed workers can be at medical risk to cadmium toxicity if blood concentrations exceed 5 ug/l (ACGIH 1991 and 1992). This narrow margin between exposed and unexposed samples requires that exceptional care be used in performing analytic determinations for biological monitoring for occupational cadmium exposure, 15761=8. On page 42113, third column below Table V-2, paragraph \"iv. Jarup et al\", line 15, the word \"had\" is corrected to read \"have\", 20040=25. On page 42170, second column, Table VI-5, the entries in the column marked \"Cumulative dose (ug/m(3)-yrs)\" is corrected to read:, 20874=30. On page 42178, second column, third paragraph, the equation under \"Linear:\" is corrected to read, \"h = alpha + E(j)(theta(j)W(j)) + gamma(chi) + deltaY + betaX\", 18949=19. On page 42129, the heading for Table V-19 is corrected to read, \"Levels of Cadmium in Blood and Urine Among Workers in Pigment Production: Average Levels of Cadmium in Blood (ug/liter whole blood) and Cadmium in Urine (ug/gram creatinine)\", 31600=Section 1910.1025 also issued under 5 U.S.C. 553, 29120=54. On page 42381, first column, lines 12 and 13, are corrected to read, \"cadmium; electrical grounding with cadmium welding, or electrical work using\", 15347=5. On page 42109, second column, second full paragraph, line 13, is corrected to read, \"lethal concentration of cadmium was\", 46107=\"Upper 95th percentile of range(e)( )(f) 114. On page 42431, in Table 5, column headed \"Mean concentration of cadmium in air (ug/m(3))\", first entry, is corrected to read, \"< or = 90\", 166300=(vi) Hygiene and lunchroom facilities. (A) Handwashing facilities, permanent or temporary, shall be provided in accordance with 29 CFR 1910.141 (d)(1)and (2) as soon as possible and in any event no later than 60 days after the effective date of this section, 211911=If the results for biological monitoring are above specific \"high levels\" [cadmium urine greater than 10 micrograms per gram of creatinine (ug/g Cr), cadmium blood greater than 10 micrograms per liter of whole blood (ug/lwb), or beta-2-microglobulin greater than 1000 micrograms per gram of creatinine (ug/g Cr)], the worker has a much greater chance of developing other kidney diseases, 88331=1. The authority citation for 29 CFR part 1928, Subpart M is revised to read as follows:, 10464=29 CFR Parts 1910, 1915 and 1928, 222933=Do not touch spilled material. Stop leak if you can do it without risk. For small, dry spills, with a clean shovel place material into clean, dry container and cover. Move containers from spill area. For larger spills, dike far ahead of spill for later disposal. Keep unnecessary people away. Isolate hazard and deny entry. The Superfund Amendments and Reauthorization Act of 1986 Section 304 requires that a release equal to or greater than the reportable quantity for this substance (100 pounds) must be immediately reported to the local emergency planning committee, the state emergency response commission, and the National Response Center (800) 424-8802; in Washington, D.C. Metropolitan area (202) 426-2675, 88432=Authority: Secs. 4, 6, and 8, Occupational Safety and Health Act of 1970 (29 U.S.C. 653, 655, 657); Secretary of Labor's Orders Nos. 12-71 (36 FR 8754), 8-76 (41 FR 25059), 9-83 (48 FR 35736) or 1-90 (55 FR 9033), as applicable; and 29 CFR part 1911. Section 1928.21 also issued under 5 U.S.C. 553, 45581=111. On page 42431 and page 42432, in Table 5, column heading \"Geometric mean (+ or - GSD)(e)\" is corrected to read \"Geometric mean (GSD)(e)\", 34065=71. On page 42395, second column, paragraph (l)(4)(v)(B), line 9, the word, \"within\" is deleted, 34610=75. On page 42397, third column, paragraph (l)(16), lines 5 through 7, are corrected to read, \"condition or disorder caused by occupational exposure to cadmium associated with employment as\", 28282=50. On page 42194, second column, third full paragraph, line 17, is corrected to read, \"X greater than or equal to X(O)\", 48849=125. On page 42438, first column, line 22, is corrected to read, \"listed in Table 9 (Section 5.3.7), the average\", 45031=110. On page 42430, in Table 4, the text of footnotes a through g were omitted. The text of the footnotes should be as follows:, 154473=(m) Communication of Cadmium Hazards to Employees. (1) General. In communications concerning cadmium hazards, employers shall comply with the requirements of OSHA's Hazard Communication Standard, 29 CFR 1910.1200, including but not limited to the requirements concerning warning signs and labels, material safety data sheets (MSDS), and employee information and training. In addition, employers shall comply with the following requirements:, 27198=43. On page 42187, second column, first full paragraph, line 20 is corrected to read, \"cohort by Stayner et al. (Ex L-140-20)\", 80780=144. On page 42446, third column, lines 1, 2 and 3 under the heading \"Attachment 3\" are deleted, 163709=(p) Dates. (1) Effective Date. This section became effective December 14, 1992. (2) Start-up dates. All obligations of this section commence on the effective date except as follows:, 29578=57. On page 42388, second column, paragraph numbered \"1.\", line 8, is corrected to read, \"1965, 41 U.S.C. 351 et seq.; sec. 107 Contract\", 79706=(8) Henry, JB, Clinical Diagnosis and Management by Laboratory Methods, W.B. Saunders Co., Philadelphia, PA 1979, Vol. III, 226774=8. The test subject shall conduct the negative and positive pressure fit checks as described below or in ANSI Z88.2-1980. Before conducting the negative or positive pressure test, the subject shall be told to seat the mask on the face by moving the head from side-to-side and up and down slowly while taking in a few slow deep breaths. Another facepiece shall be selected and retested if the test subject fails the fit check tests, 50569=131. On page 42442, third column, second paragraph under the heading \"Attachment 1 - Nonmandatory Protocol for an Internal Quality Assurance/Quality Control Program\" line 2, is corrected to read \"protocol, the QA/QC program for\", 41230=88. On page 42414, second column, paragraph 4.3.2., line 2, is corrected to read, \"NH(4)H(2)PO(4) and magnesium nitrate, Mg(NO(3))(2) * 6H(2)O,\", 162065=(5) Availability. (i) Except as otherwise provided for in this section, access to all records required to be maintained by paragraphs (n)(1-4) of this section shall be in accordance with the provisions of 29 CFR 1910.20, 26639=40. On page 42181, second column below Table VI-11., line 1, the \" = \" symbol is corrected to read, \"identical with\", 294195=3.5.10. Nitric acid, 10% v/v: Carefully add 100 mL of concentrated HNO(3) to 500 mL of DI H(2)O and dilute to 1 L, 16593=13. On page 42115, Table V-6., far left column, line 5, under the heading, \"Cum exposure (mg/m(3)-yrs)\", is corrected to read, \"greater than or equal to 5\", 47757=121. On page 42435, Table 8, in the second column headed, \"Work Environment\", delete the space between entry 16, \"(Smokers)\", and entry 17, \"(Nonsmokers)\", so that the data in the columns to the right correspond correctly, 33627=69. On page 42395, first column, paragraph (l)(4)(iv), lines 7 through 10, are corrected to read, \"specified in paragraphs (l)(3)(ii) or (iii); or, beginning on January 1, 1999, in excess of the levels specified in paragraphs (l)(3)(ii) or (iv) of this section, the\", 194621=\"Carcinogenicity of Cadmium Chloride Aerosols in Wistar Rats\". JNCI 70:367373, 1983. (32) 4-68. - Thun, M.J., T.M. Schnoor, A.B. Smith, W.E. Halperin, R.A. Lemen, 50133=129. On page 42440, second column, second paragraph under paragraph 5.4.3., line 4, the word, \"chromofore\", is corrected to read, \"chromophore\", 30988=Section 1910.1000, the Transitional Limits columns of Table Z-1-A, Table Z-2, and Table Z-3 also issued under 5 U.S.C. 533. Section 1910.1000, the Transitional Limits columns of Table Z-1-A, Table Z-2, and Table Z-3 not issued under 29 CFR part 1911 except for the arsenic, benzene, cotton dust, and formaldehyde listings, 87438=165. On page 42459, first column, paragraph (l)(4)(v)(B), line 13, is corrected to read, \"monitoring specified in\", 84552=152. On page 42452, second column, paragraph numbered, \"10\", line 6, is corrected to read, \"C, D, E, and F of 1910.1027 of subpart Z\", 51092=133. On page 42443, first column, first full paragraph under the heading \"Initial Characterization Runs and Establishing Control\" lines 3 and 4, are corrected to read, \"of the analytes for which determinations will be made. The concentrations of quality\", 159345=(iii) The employer shall maintain this record for at least thirty (30) years, in accordance with 29 CFR 1910.20, 610655=2.7.2. Follow the appropriate shipping procedures. The following modified special safety precautions are based on those recommended by the Centers for Disease Control (CDC)(Ref. 5.8.) and OSHA's Bloodborne Pathogens standard (29 CFR 1910.1039), 51569=135. On page 42443, second column, first paragraph following the second formula, lines 2 and 3 are corrected to read, \"then given by the mean plus or minus 2 standard deviations (X + or - 2 unbiased standard deviation). The control\", 83593=147. On page 42448, first column, paragraph 2.7.2, line 6, is corrected to read, \"(CDC)(Ref. 5.8.) and OSHA's Bloodborne Pathogens standard (29 CFR 1910.1039).\", 30155=60. On page 42388, second column, paragraph numbered \"2.\", is corrected to read,, 108973=Footnote(c) HEPA means High-efficiency Particulate Air. Footnote(d) Fit testing, qualitative or quantitative, is required. SOURCE: Respiratory Decision Logic, NIOSH, 1987, 33174=66. On page 42391, Table 2. - Respiratory Protection for Cadmium, footnote c, is corrected to read, \"HEPA means High-efficiency Particulate Air.\", 461867=Claeys-Thoreau (1982) and DeBenzo et al. (1990) diluted blood samples at a ratio of 1:10 with a matrix modifier (0.2 percent Triton X-100, a wetting agent) for direct determinations of CDB. DeBenzo et al. also demonstrated that aqueous standards of cadmium, instead of spiked, whole-blood samples, could be used to establish calibration curves if standards and samples are treated with additional small volumes of matrix modifiers (i.e., 1 percent HNO(3), 0.2 percent ammonium hydrogenphosphate and 1 mg/ml magnesium salts.) These direct dilution procedures for CDB analysis are simple and rapid, 86307=159. On page 42456, third column, paragraph (l)(1)(i)(A), line 9, is corrected to read, \"grounding with cadmium welding; cutting,\", 42385=94. On page 42422, first column, line 3, delete the parenthetical notation, \"(i.e., compliance samples),\", 16394=12. On page 42115, third column, third full paragraph, lines 13 and 14 are corrected to read, \"working lifetime (1 mg/m(3) divded by 45 years = 22.2 ug/m(3).) If exposures are\", 19678=23. On page 42149, third column, first full paragraph, lines 10 through 12 are corrected to read, \"CdO-exposed rats. Neither Dr. Heinrich nor Dr. Oberdorster, however, could give an estimate of the carcinogenic\", 58630=141. On page 42444, second and third column, the second paragraph under the heading \"Corrective Actions\" is deleted, 61374=Skin Irritant; Rinse Contacted Area With Water Comply With OSHA's bloodborne Pathogens Standard While Hndling Biological Samples (29 CFR 1910.1039), 20195=45 225 450 900 1800 2250 4500, 22344=38. On page 42181, third column, Table VI-10., is corrected to read:, 307389=3.11.10. If possible, analyze quality control samples from an independent source as a check of analytical recovery and precision, 87893=167. On page 42459, third column, paragraph (l)(8)(ii), line 3, is corrected to read, \"surveillance under paragraph (l)(4)(v) of\", 14222=The following corrections are made in the final rule for Occupational Exposure to Cadmium published in the Federal Register on September 14, 1992 (57 FR 42101), 41965=91. On page 42420, second column, first paragraph, lines 6 through 12 are deleted, 157924=(G) The contents of this section and its appendices, and, (H) The employee's rights of access to records under section 1910.20 (e) and (g), 217370=1. Substance identification Chemical name: Cadmium Oxide Formula: Cd0 Molecular Weight: 128.4 CAS No.: 1306-19-0 Other Identifiers: RTECS EV1929500 Synonyms: Kadmu tlenek (Polish) 2. Physical data Boiling point (760 mm Hg): 950 degrees C decomposes Melting point: 1500 degrees C Specific Gravity: (H(2)O = 1 @ 20 degrees oC): 7.0 Solubility: Insoluble in water; soluble in acids and alkalines Appearance: Red or brown crystals, 218475=Do not touch spilled material. Stop leak if you can do it without risk. For small spills, take up with sand or other absorbent material and place into containers for later disposal. For small dry spills, use a clean shovel to place material into clean, dry container and then cover. Move containers from spill area. For larger spills, dike far ahead of spill for later disposal. Keep unnecessary people away. Isolate hazard area and deny entry. The Superfund Amendments and Reauthorization Act of 1986 Section 304 requires that a release equal to or greater than the reportable quantity for this substance (1 pound) must be immediately reported to the local emergency planning committee, the state emergency response commission, and the National Response Center (800) 424-8802; in Washington, D.C. metropolitan area (202) 426-2675, 18623=17. On page 42118, first column, second paragraph, line 9 is corrected to read, \"in persons with cumulative exposure greater than or equal to\", 40565=83. On page 42412, table at the top of the third column, the fifth entry in the column marked \"Aliquot\" is corrected to read \"5\", 109407=(B) This respirator will provide adequate protection to the employee. (3) Respirator program. (i) Where respiratory protection is required, the employer shall institute a respirator protection program in accordance with 29 CFR 1910.134, 43840=103. On page 42423, second column below Table 2, second formula, place a \"^\" above the \"sigma\" on the left side of the equation and correct the lower case \"n\" in the denominator to read an upper case \"N\", 134768=(iv) If the results of periodic biological monitoring or the results of biological monitoring performed as part of the periodic medical examination show the level of the employee's CdU, B(2)-M, or CdB to be in excess of the levels specified in paragraphs (l)(3)(ii) or (iii); or, beginning on January 1, 1999, in excess of the levels specified in paragraphs (l)(3)(ii) or (iv) of this section, the employer shall take the appropriate actions specified in paragraphs (l)(3)(ii)-(iv) of this section, 79242=(5) Kawas, EE, Richards, AH, and Bigger, R, An Evaluation of a Kinetic Creatinine Test for the Du Pont ACA, Du Pont Company, Willmington, DE (February 1973). (Reprints available from DuPont Company, Diagnostic Systems) (6) Westgard, JO, Effects of Hemolysis and Lipemia on ACA Creatinine Method,0.200 uL,Sample Size, Du Pont Company, Wilmington, DE (October 1972), 43363=100. On page 42423, first column under Table 2, third paragraph, line 7, is corrected to read, \"values, X, (with N being the total number of samples analyzed):\", 27347=44. On page 42190, Table VI-15., column under the heading \"Falck (Ex. 4-28)\", line 2, the word \"hazing\" is corrected to read \"brazing\", 620472=5.1. Clark, L.C.; Thompson, H.L.; Anal. Chem. 1949, 21, 1218 5.2. Peters, J.H.; J. Biol. Chem. 1942, 146, 176 5.3. Hansen, V.A.; Fuchs, D.; Wachter, H.; J. Clin. Chem. Clin          Biochem. 1981, 19, 373-378. 5.4. Clark, P.M.S.; Kricka, L.J.; Patel, A.; J. Liq. Chrom          1980, 3(7), 1031-1046 5.5. Ballerini, R.; Chinol. M.; Cambi, A.; J. Chrom. 1979, 179,          365-369 5.6. Ogata, M.; Taguchi, T.; Industrial Health 1987, 25,          225-228 5.7. \"Merck Index\", 11th ed; Windholz, Martha Ed,; Merck;          Rahway, N.J., 1989; p. 403 5.8. Kimberly, M.; \"Determination of Cadmium in Urine by          Graphite Furnace Atomic Absorption Spectrometry with Zeeman          Background Correction.\" Centers for Disease Control,          Atlanta, Georgia, unpublished, update 1990., 422657=Based on the above-cited studies, the U.S. Environmental Protection Agency (EPA) classifies cadmium as \"B1,\" a probable human carcinogen (USEPA 1985). IARC in 1987 recommended that cadmium be listed as a probable human carcinogen, 400696=1. Centre de Toxicologie du Quebec, Le Centre Hospitalier de l'Universite Laval, 2705 boul. Laurier, Quebec, Que., Canada G1V 4G2. (Prepared 6 times per year.) 2. National Institute of Standards and Technology (NIST), Dept. of Commerce, Gaithersburg, MD; tel: (301) 975-6776. (Prepared as SRM 2670 freeze-dried urine [metals]; set includes normal and elevated levels of metals; cadmium is certified for elevated level of 88.0 ug/l in reconstituted urine.) 3. Kaulson Laboratories Inc., 691 Bloomfield Ave., Caldwell, NJ 07006;, 326857=NJ, 1983. 5.6. Analytical Methods for Atomic Absorption Spectrophotometry, The Perkin-Elmer Corporation: Norwalk, CT, 1982, 327917=Documentation of the NIOSH Validation Tests by D. Taylor, R. Kupel, and J. Bryant (DHEW/NIOSH Pub. No. 77-185). Cincinnati, OH: National Institute for Occupational Safety and Health, 1977, 27810=47. On page 42192, third column, first full paragraph, line 18, is corrected to read, \"test. As indicated by Table VI-18, the\", 42887=97. On page 42422, third column, sixth paragraph, line 5, place a \"^\" above the \"sigma\", 48686=124. On page 42437, first column, first full paragraph, line 6, is corrected to read, \"ug/l, a target precision of 40% is acceptable, while\", 88997=1928.1027 Cadmium, 32703=63. On page 42389, first column, paragraph (b), seventh definition, lines 1 and 2, are corrected to read, \"High-efficiency particulate air (HEPA) filter means a filter capable\", 294360=3.6.1. Clean Phillips beakers by refluxing with 1:1 nitric acid on a hot plate in a fume hood. Thoroughly rinse with deionized water and invert the beakers to allow them to drain dry, 84718=153. On page 42452, second column, paragraph (a)(6) is corrected to read, \"(6) Electrical grounding with cadmium welding, or electrical work using cadmium-coated conduit;\", 58171=139. On page 42444, first column, in the fifth paragraph numbered \"2.\", the statistical terms \"2 unbiased standard deviation\" are corrected to read \"2 unbiased standard deviation\", 84170=150. On page 42452, first column, the far right side of the equation following paragraph \"3.7.4.\", is corrected to read, \"ug A/g creatinine\", 43007=98. On page 42422, third column, sixth paragraph, line 7, is corrected to read, \"(e.g., + or - 1 ug or 15% of the mean, whichever is\", 30077=PART 1910-[AMENDED], 16192=11. On page 42115, third column, first full paragraph, lines 12, 13 and 14 are corrected to read \"using the model: log (B(2)-M) = [a X age] + [b X cumulative dose] + [c]. Elinder\", 596953=(5) Kawas, EE, Richards, AH, and Bigger, R, An Evaluation of a Kinetic Creatinine Test for the Du Pont ACA, Du Pont Company, Wilmington, DE (February 1973). (Reprints available from Du Pont Company, Diagnostic Systems), 193056=3.The gravity of cadmium-induced renal damage is compounded by the fact there is no medical treatment to prevent or reduce the accumulation of cadmium in the kidney (Ex. 8-619). Dr. Friberg, a leading world expert on cadmium toxicity, indicated in 1992, that there is no form of chelating agent that could be used without substantial risk. He stated that tubular proteinuria has to be treated in the same way as other kidney disorders (Ex. 29), 10808=Summary: The Occupational Safety and Health Administration is correcting errors in the entire Occupational Exposure to Cadmium Final Rule which appeared in the Federal Register on September 14, 1992 (57 FR 42101) and adding new provisions on Occupational Health to cover the agriculture industry. Regulations covering the agriculture industry were inadvertently omitted from the September 14 rule, 587835=- Suggested Calibration Levels: 1,5,20, mg/mL [88, 442, 1768 umol/L] - Calibration Scheme: 3 levels, 3 packs per level - Frequency: Each new pack lot. Every 3 months for any one pack lot., 47159=118. On page 42434, second column, first full paragraph, lines 6 and 7, are corrected to read, \"(target of + or - 2 ug/l or 15% of the consensus mean, whichever is greater) were achieved by only 44-52% of the 34 laboratories participating in the\", 214538=1. Substance Identification Chemical name: Cadmium Formula: Cd Molecular Weight: 112.4 Chemical Abstracts Sevice (CAS) Registry No.: 7740-43-9 Other Identifiers: RETCS EU9800000; EPA D006; DOT 2570 53 Synonyms: Colloidal Cadmium: Kadmium (German): CI 77180 2. Physical data Boiling point: (760 mm Hg): 765 degrees C Melting point: 321 degrees C Specific Gravity: (H(2)0=@ 20 degrees C): 8.64 Solubility: Insoluble in water; soluble in dilute nitricacid and in sulfuric acid Appearance: soft, blue-white, malleable, lustrous metal or grayish-white powder, 89034=(a) Scope. This standard applies to all occupational exposures to cadmium and cadmium compounds, in all forms, and in all industries covered by the Occupational Safety and Health Act, except the construction-related industries, which are covered under 29 CFR 1926.63, 86865=\"specified in paragraphs (l)(3)(ii) or (iii) of this section; or beginning on January 1, 1999, in excess of the levels specified in paragraphs (l)(3)(ii) or (iv), the employer shall take the appropriate actions specified in paragraphs (l)(3)(ii)-(iv) of this section, respectively.\", 28974=53. On page 42351, second column, third new paragraph, line 13, is corrected to read, \"guide employers and laboratories in\", 313753=4.3.1 J.T. Baker Chem. Co. (Analyzed grade) concentrated nitric acid, 69.0-71.0%, and concentrated hydrochloric acid, 36.5-38.0%, were used to prepare the samples and standards, 495433=Surveys of CDU concentrations in the general population were first reported from cooperative studies among industrial countries (i.e., Japan, U.S. and Sweden) conducted in the mid-1970s. In summarizing these data, Kjellstrom (1979) reported that CDU concentrations among Dallas, Texas men (age range: < 9-59 years; smokers and nonsmokers) varied from 0.11-1.12 ug/l (uncorrected for creatinine or specific gravity). These CDU concentrations are intermediate between population values found in Sweden (range: 0.11-0.80 ug/l) and Japan (range: 0.14-2.32 ug/l), 34183=72. On page 42395, second column, paragraph (l)(4)(v)(B), line 12, is corrected to read, \"monitoring, specified in\", 601297=This method is very similar to that of Ogata and Taguchi (Ref          5.6.), except they used centrifugation for sample clean-up          It is also of note that they did a comparison of their HPLC          results to those of the Jaffe method (a picric acid method          commonly used in the health care industry) and found a          linear relationship of close to 1:1. This indicates that          either HPLC or colorimetric methods may be used to measure          creatinine concentrations in urine, 546745=Meridian Research, Inc. (1989). Quantitative Assessment of Cancer Risks Associated with Occupational Exposure to Cd. Prepared by Meridian Research, Inc. and Roth Associates, Inc. for the Occupational Safety & Health Administration. June 12, 1989, 79841=(9) Krupp, MA, Tierney, LM Jr., Jawetz, E, Roe, Rl, Camargo, CA, Physicians Handbook, Lange Medical Publications, Los Altos, CA, 1982 pp 635-636, 44869=109. On page 42430, in Table 4, eighth column, delete the \"+ or -\" so the heading is corrected to read, \"Geometric mean (GSD)(e)\", 41397=89. On page 42419, first column, first full paragraph, line 10, is corrected to read, \"decisions made by the\" by deleting the word \"discretionary\", 16963=15. On page 42116, Table V-8., is corrected to read,, 35168=78. On page 42400, second column, paragraph \"C. Employee Requirements\", line 10, is corrected to read, \"source of unnecessary cadmium exposure.\", 469068=The UNEP/WHO global study of cadmium biological monitoring set a limit for CDB accuracy using the maximum allowable deviation method at Y = X + or - (0.1 X + 1) for a targeted concentration of 10 ug Cd/l (Friberg and Vahter 1983). The performance of participating laboratories over a concentration range of 1.5-12 ug/l was reported by Lind et al. (1987). Of the 3 QC runs conducted during 1982 and 1983, 1 or 2 of the 6 laboratories failed each run. For the years 1983 and 1985, between zero and 2 laboratories failed each of the consecutive QC runs, 525357=Determining a reasonable upper limit from the range of B2M concentrations observed among those who do not exhibit signs of proteinuria is problematic. Elevated B(2)MU levels are among the signs used to define the onset of kidney dysfunction. Without access to the raw data from the studies listed in Table 9, it is necessary to rely on reported standard deviations to estimate an upper limit for normal B(2)MU concentrations (i.e., the upper 95th percentile for the distributions measured). For the 8 studies reporting a geometric standard deviation, the upper 95th percentiles for the distributions are 180-1140 ug/g CRTU. These values are in general agreement with the upper 95th percentile for the distribution (i.e., 631 ug/g CRTU) reported by Buchet et al. (1980). These upper limits also appear to be in general agreement with B(2)MU values (i.e., 100-690 ug/g CRTU) reported as the normal upper limit by Iwao et al. (1980), Kawada et al. (1989), Wibowo et al. (1982), and Schardun and van Epps (1987). These values must be compared to levels reported among those exhibiting kidney dysfunction to define a threshold level for kidney dysfunction related to cadmium exposure, 598070=(12) Dicht, JJ, Reference Intervals for Serum Amylase and Urinary Creatinine on the Du Pont ACA(R) Discrete Clinical Analyzer, Du Pont Company, Wilmington, DE (November 1984), 187078=Based on the above cited studies, the U.S. Environmental Protection Agency (EPA) classified cadmium as \"B1\", a probable human carcinogen, in 1985 (Ex. 4-4). The International Agency for Research on Cancer (IARC) in 1987 also recommended that cadmium be listed as \"2A\", a probable human carcinogen (Ex. 4-15). The American Conference of Governmental Industrial Hygienists (ACGIH) has recently recommended that cadmium be labeled as a carcinogen. Since 1984, NIOSH has concluded that cadmium is possibly a human carcinogen and has recommended that exposures be controlled to the lowest level feasible, 196301=Ind. Med., 42, 651-655, 1985. L-140-50. Thun, M., Elinder, C.G., Friberg, L, \"Scientific Basis for an Occupational Standard for Cadmium, Am. J. Ind. Med., 20; 629-642, 1991, 219625=Cadmium Orange; Cadmium Primrose 819; Cadmium Sulphide; Cadmium Yellow; Cadmium Yellow 000; Cadmium Yellow Conc. Deep; Cadmium Yellow Conc. Golden; Cadmium Yellow Conc. Lemon; Cadmium Yellow Conc. Primrose; Cadmium Yellow Oz. Dark; Cadmium Yellow Primrose 47-1400; Cadmium Yellow 10G Conc.; Cadmium Yellow 892; Cadmopur Golden Yellow N; Cadmopur Yellow: Capsebon; C.I. 77199; C.I. Pigment Orange 20; CI PigmentYellow 37; Ferro Lemon Yellow; Ferro Orange Yellow; Ferro Yellow; Greenockite; NCI-C02711. 2. Physical data Boiling point (760 mm. Hg): sublines in N(2) at 980 degrees C Melting point: 1750 degrees C (100 atm) Specific Gravity: (H(2)0= 1@ 20 degrees C): 4.82 Solubility: Slightly soluble in water; soluble in acid. Appearance: Light yellow or yellow-orange crystals, 15155=4. On page 42103, third column, first full paragraph after the heading, \"C. Regulation\", line 2, is corrected to read, \"standard is also found in section 8(c)\", 21769=35. On page 42180, second column, Table VI-9., the heading, \"Relative Rate Model\" should only be above the columns labeled, \"Poisson regression(a)\" and \"Cox regression(b)\", 31676=Section 1910.1043 also issued under 5 U.S.C. 551 et seq, 70655=- Assay Range: 0-20 mg/mL [0-1768 umol/L](e) ______, 87320=164. On page 42459, first column, paragraph (l)(4)(v)(B), line 10, the word \"within\" is deleted, 117710=(1) General. For employees whose airborne exposure to cadmium is above the PEL, the employer shall provide clean change rooms, handwashing facilities, showers, and lunchroom facilities that comply with 29 CFR 1910.141, 26788=41. On page 42182, third column, second paragraph following the heading, \"Potential for Confounding by Arsenic Exposure in Thun Cohort\", line 15, is corrected to read, \"That said, we can interpret the post-1940 data with\", 162704=(6) Transfer of Records. Whenever an employer ceases to do business and there is no successor employer to receive and retain records for the prescribed period or the employer intends to dispose of any records required to be preserved for at least 30 years, the employer shall comply with the requirements concerning transfer of records set forth in 29 CFR 1910.20 (h). (o) Observation of Monitoring, 49987=128. On page 42440, first column, paragraph 5.3.8.3, line 5, the word, \"Delphiad\" is corrected to read, \"Delphia\", 45755=112. On page 42431 and page 42432, in Table 5, column heading, \"Lower 95th percentile of range(e)( )(f)\" should be corrected to read, \"Lower 95th percentile of range(e)( )(f)\" 113. On page 42431 and page 42432, in Table 5, column heading, \"Upper 95th percentile of range(e)( )(f)\" should be corrected to read,, 21354=33. On page 42179, second column below Table VI-8., move the word \"Where:\" to below the formula and preceding the definition \"RR(i) is the risk ratio for lung cancer predicted by the model based on the exposure scenario assumed.\", 41576=90. On page 42419, third column, fourth full paragraph labeled, \"Target Value:\", lines 5 through 10 is corrected to read, \"rule. For CDB, the target values are 5, 10, and 15 ug/l. For CDU, the target values are 3, 7, and 15 ug/g CRTU. For B(2)MU, the target values are 300, 750 and 1500 ug/g CRTU. (Note that target values may vary as a function of time.)\", 83941=149. On page 42452, first column, first formula, the result on the far right side of the equation reading \"mg/L\" is corrected by lowering it and made parallel to the middle column reading, \"ug/mL\", 128429=CdU exceeds 15 ug/g Cr; or CdB exceeds 15 ug/lwb; or B(2)-M exceeds 1500 ug/g Cr, and in addition CdU exceeds 3 ug/g Cr or CdB exceeds 5 ug/liter of whole blood, then the physician shall medically remove the employee from exposure to cadmium at or above the action level. If the second set of biological monitoring results obtained during the medical examination does not show that a mandatory removal trigger level has been exceeded, then the employee is not required to be removed by the mandatory provisions of this paragraph. If the employee is not required to be removed by the mandatory provisions of this paragraph or by the physician's determination, then until the employee's CdU level falls to or below 3 ug/g Cr, B(2)-M level falls to or below 300 ug/g Cr and CdB level falls to or below 5 ug/lwb, the employer shall:, 277144=Method Classification: Validated Date:June, 1992, 47586=120. On page 42435 and page 42356, Table 8, column heading \"Geometric mean (+ or - GSD)(e)\" is corrected to read \"Geometric mean (GSD)(e)\", 44728=108. On page 42430, third column, first paragraph, line 4, is corrected to read, \"+ or - 10% of the true value at CDB\", 161447=(iii) The employer shall assure that this record is maintained for the duration of employment plus thirty (30) years, in accordance with 29 CFR 1910.20, 547007=Meridian Research, Inc and Roth Associates, Inc. (1989). Quantitative Assessment of the Risk of Kidney Dysfunction Associated with Occupational Exposure to Cd. Prepared by Meridian Research, Inc. and Roth Associates, Inc. for the Occupational Safety & Health Administration. July 31 1989, 464424=The APHA (1988) reports a range of 1.0-25 ug/l, with a CV of 7.3 percent (concentration not stated). Insufficient documentation was available to critique this method, 33342=67. On page 42392, second column, paragraph (i)(2)(iv), line 8, is corrected to read \"paragraph (m)(3) of this section.\", 30354=Authority: Sections 4, 6, and 8, Occupational Safety and Health Act, 29 U.S.C. 653, 655, and 657; Secretary of Labor's Orders Nos. 12-71 (36 FR 8754), 8-76 (41 FR 25059), 9-83 (48 FR 35736) or 1-90 (55 FR 9033), as applicable; and 29 CFR part 1911, 16781=14. On page 42115, Table V-6., middle column, under the heading \"Slight proteinuria(1) No. (percent)(2)\", fourth entry, the symbol \"< \" is deleted, 80120=(11) Gadsden, RH, and Phelps, CA, A Normal Range Study of Amylase in Urine and Serum on the Du Pont ACA, Du Pont Company, Wilmington, DE (March 1978). (Reprints available from DuPont Company, Diagnostic Systems) (12) Dicht, JJ, Reference Intervals for Serum Amylase and Urinary Creatinine on the Du Pont ACA(R) Discrete Clinical Analyzer, Du Pont Company, Wilimgton, DE (November 1984), 293391=3.5.7. Cadmium standard stock solution, 1,000 ug/mL: Use a commercially available certified 1,000 ug/mL cadmium standard or, alternatively, dissolve 1.0000 g of cadmium metal in a minimum volume of 1:1 HCl and dilute to 1 L with 4% HNO(3). Observe expiration dates of commercial standards. Properly dispose of commercial standards with no expiration dates or prepared standards one year after their receipt or preparation date, 621748=[FR Doc. 93-0935 Filed 4-22-93; 8:45 am], 85863=157. On page 42455, Table 1. - Respiratory Protection for Cadmium, right column, line 11 under heading \"Required respirator type (b)\", is corrected to read, \"A self-contained breathing apparatus with a full facepiece operated in the pressure\", 28425=51. On page 42195, third column, third paragraph, line 2, is corrected to read, \"biological arguments that indicate a\", 545327=Kowal N, Johnson D, Kraemer D, and Pahren H. (1979). Normal levels of cadmium in diet, urine, blood, and tissues of inhabitants of the United States. Journal of Toxicology and Environmental Health, 5, 995-1014, 553987=USEPA. (1985). Updated Mutagenicity and Carcinogenicity Assessments of Cd: Addendum to the Health Assessment Document for Cd (May 1981). Final Report. June 1985, 462967=Sample collection procedures are addressed primarily to identify ways to minimize the degree of variability that may be introduced by sample collection during medical monitoring. It is unclear at this point the extent to which collection procedures contribute to variability among CDB samples. Sources of variation that may result from sampling procedures include time-of-day effects and introduction of external contamination during the collection process. To minimize these sources, strict adherence to a sample collection protocol is recommended. Such a protocol must include provisions for thorough cleaning of the site from which blood will be extracted; also, every effort should be made to collect samples near the same time of day. It is also important to recognize that under the recent OSHA blood- borne pathogens standard (29 CFR 1910.1030), blood samples and certain body fluids must be handled and treated as if they are infectious, 12363=The amendments in this document rectify the technical failure to print the standard for the agricultural industries (29 CFR Part 1928), and reflect OSHA's consistent intention to cover the general, agricultural and maritime industries (57 FR 42333; 55 FR 4121; February 6, 1990), 19215=20. On page 42131, third column, third paragraph, line 11, is corrected to read, \"The unexposed group whose\", 35483=80. On page 42407, second column, a new paragraph \"4.\" is to be inserted immediately preceding paragraph \"C. Quantitative Fit Test (QNFT) Protocol\" to read as follows, 31759=Sections 1910.1200, 1910.1499 and 1910.1500 also issued under 5 U.S.C. 553.\", 179154=Some studies indicate that such proteinuria may be progressive; levels of B(2)-M observed in the urine increase with time even after cadmium exposure has ceased. See, for example, Elinder et al., 1985. Such observations, however, are not universal, and it has been suggested that studies in which proteinuria has not been observed to progress may not have tracked patients for a sufficiently long time interval (Jarup, Ex. 8-661), 325914=Spectroscopy Div.: Ridgefield, CT , 1984; p. 18 and pp. 83-90. 5.2. Grosser, Z., Ed.; Techniques in Graphite Furnace Atomic Absorption Spectrophotometry; Perkin-Elmer Corp., Spectroscopy Div.: Ridgefield, CT, 1985, 418185=Exposure to cadmium fumes and dusts in an occupational setting where air concentrations are 20-50 ug/m(3) results in an additional daily intake of several hundred micrograms (Friberg and Elinder 1988, p. 563). In such a setting, occupational exposure to cadmium occurs primarily via inhalation, although additional exposure may occur through the ingestion of material via contaminated hands if workers eat or smoke without first washing. Some of the particles that are inhaled initially may be ingested when the material is deposited in the upper respiratory tract, where it may be cleared by mucociliary transport and subsequently swallowed, 326461=5.4. Occupational Safety and Health Administration Salt Lake Technical Center: Metal and Metalloid Particulate in Workplace Atmospheres (ICP)(USDOL/OSHA Method No. ID-125G). In OSHA Analytical Methods Manual 2nd ed. Cincinnati, OH: American Conference of Governmental Industrial Hygienists, 1991, 326992=5.7. Slavin, W., D.C. Manning, G. Carnrick, and E. Pruszkowska: Properties of the Cadmium Determination with the Platform Furnace and Zeeman Background Correction. Spectrochim. Acta 38B:1157-1170 (1983), 14538=2. On page 42102, first column, third paragraph, lines 11 through 15 are corrected to read, \"has also established separate engineering control air limits (SECAL) of either 15 ug/m(3) or 50 ug/m(3) as the lowest feasible levels above the PEL that can be achieved by engineering and work practice controls.\", 15494=6. On page 42109, third column, line 2, is corrected to read \"this exposure level, there is\", 48540=123. On page 42436, second column, line 12, is corrected to read, \"lower than levels of other studies reported in Table 8.\", 23628=39. On page 42181, Table VI-11, is corrected to read,, 42513=95. On page 42422, second column, fourth paragraph under paragraph 3.3.1.1., line 3, the symbol \"+\" is deleted, 11231=Effective Date: December 14, 1992, 27959=48. On page 42193, Table VI-18, first column, the sixth entry under the heading, \"Jarup 2(c)(Ex. 8-661):\", is corrected to read, \">15,000\", 29431=56. On page 42385, third column, third paragraph, line 9, is corrected to read, \"Electrical grounding with cadmium welding;\", 46346=115. On page 42431, in Table 5, column headed \"Employment in years (mean)\", tenth entry, is corrected to read \"(4.2)(g)\", 33916=70. On page 42395, first column, paragraph (l)(4)(v)(A), line 8, is corrected to read, \"(l)(3)(i)(B) of this section one year\", 31337=Section 1910.1001 also issued under sec. 107 of Contract Work Hours and Safety Standards Act, 40 U.S.C. 333, 40403=82. On page 42412, second column, paragraph 3.5.8., line 3, is corrected to read, \"Mg(NO(3))(2) * 6H(2)O in approximately 200 mL deionized\", 303639=3.10.10. Record the final instrument settings at the end of the analysis. Date and label the output, 34988=77. On page 42398, second column, paragraph (m)(4)(iii)(H), is corrected to read, \"(H) The employee's rights of access to records under 1910.20 (e) and (g).\", 78356=Assay Range;(m) 0.0-20.0 mg/dl [0-1768 umol] m. See REPRODUCIBILITY for method performance within the assay range. Analytical Specificity: See KNOWN INTERFERING SUBSTANCES section for details, 40969=86. On page 42414, first column, paragraph 4.2.1., line 12, is corrected to read, \"parameters are listed in Attachment 1.\", 31868=61. Beginning on page 42388, third column, paragraph \"6.\", is corrected to read, \"6. In 1910.1000, Table Z-2, footnotes \"1\" and \"2\" are renamed \"a\" and \"b\", respectively, and a footnote superscript \"c\" is added after the entries \"Cadmium fume (Z37.5-1970)\" and \"Cadmium dust (Z37.5-1970)\" and footnote \"c\" is added after footnote \"b\" to read \"c. This standard applies to any operations or sectors for which 1910.1027 is stayed or otherwise not in effect.\", 465582=Weber (1988) reports on the results of the proficiency program run by the Centre de Toxicologie du Quebec (CTQ). As indicated previously, participants in that program receive 18 blood samples per year having cadmium concentrations ranging from 0.2-20 ug/l. Currently, 76 laboratories are participating in this program. The program is established for several analytes in addition to cadmium, and not all of these laboratories participate in the cadmium proficiency-testing program, 20717=29. On page 42178, first column, fourth paragraph, line 4, change the \"+ or -\" symbol to a \"greater than or equal to\" symbol, 50309=130. On page 42442, third column, first paragraph under the heading \"Attachment 1 - Nonmandatory Protocol for an Internal Quality Assurance/Quality Control Program\" line 4, is corrected to read \"satisfy OSHA requirements under\", 80518=143. On page 42446, third column, the heading \"Attachment 3\" is corrected to read, \"Attachment 3 - Analysis of Creatinine for the Normalization of Cadmium and Beta-2-Microglobulin Concentrations in Urine (OSLTC PROCEDURE)\", 43163=99. On page 42423, first column under Table 2, second paragraph, line 11, should be corrected to read, \"the period; and, use of + or - 2 unbiased standard deviation (as defined\", 194820=\"Mortality Among a Cohort of U.S. Cadmium Production Workers - An Update.\" JNCI 74(2):325-33, 1985.(8) 4-25. - Elinder, C.G., Kjellstrom, T., Hogstedt, C., et al., \"Cancer Mortality of Cadmium Workers.\" Brit. J. Ind. Med. 42:651-655, 1985.(14) 4-26. - Ellis, K.J. et al., \"Critical Concentrations of Cadmium in Human Renal Cortex: Dose Effect Studies to Cadmium Smelter Workers.\" J.Toxicol. Environ. Health 7:691-703, 1981.(76) 4-27. - Ellis, K.J., S.H. Cohn and T.J. Smith. \"Cadmium Inhalation Exposure Estimates: Their Significance with Respect to Kidney and Liver Cadmium Burden.\" J. Toxicol. Environ. Health 15:173-187, 1985, 58029=138. On page 42444, first column, first paragraph, lines 9 through 11, are corrected to read, \"updated every 2 months.\", 15609=7. On page 42110, third column, first full paragraph, line 28, is corrected to read, \"proteinuria (Exs. 8-86-B, p. 63; 4-54). In\", 42059=92. On page 42420, second column, first paragraph, line 13, is corrected to read, \"In determining which laboratories to employ for\", 51824=136. On page 42443, third column, third paragraph, line 10, insert \"^\" above the \"sigma\", 48021=122. On page 42435 and 42436, in Table 8, the text of footnotes a through h was omitted. The text of the footnotes should be as follows:, 543184=IARC (1987). IRAC Monographs on the Evaluation of Carcinogenic Risks to Humans. Overall Evaluation of Carcinogenicity: Update of Volume 1-42. Supplemental 7, 1987, 16068=10. On page 42115, third column, line 1, is corrected to read, \"Cr the proportion of cases of B(2)-M\", 400047=1. Centre de Toxicologie du Quebec, Le Centre Hospitalier de l'Universite Laval, 2705 boul. Laurier, Quebec, Que., Canada G1V 4G2. (Prepared 6 times per year at 1-15 ug Cd/l.) 2. H. Marchandise, Community Bureau of Reference-BCR, Directorate General XII, Commission of the European Communities, 200, rue de la Loi, B-1049, Brussels, Belgium. (Prepared as Bl CBM-1 at 5.37 ug Cd/l, and Bl CBM-2 at 12.38 ug Cd/l.) 3. Kaulson Laboratories Inc., 691 Bloomfield Ave., Caldwell, NJ 07006;, 43693=102. On page 42423, second column under Table 2, third line below the first formula, place a \"^\" above the \"sigma\", 44286=105. On page 42424, first column, first full paragraph, lines 2 and 3, place \"^\" above the \"sigma\"s, 18788=18. On page 42119, first column, third full paragraph, line 11, is corrected to read, \"ug/liter and total protein < or = 135 mg/l. For\", 84343=151. On page 42452, first column, heading \"XI. Final Standard (Construction)\" is corrected to read, \"XII. Final Standard (Construction)\", 50830=132. On page 42443, first column, first full paragraph is corrected to read, \"All standards should be kept fresh, and as they get old, they should be compared with new standards and replaced if they exceed the new standards by + or - 15%.\", 194046=b. The Docket Officer maintains a record of the rulemaking. The Cadmium Docket (H-057A), is located at 200 Constitution Ave. N.W., Room N-2625, Washington, D.C. 20210; telephone: 202-523-7894, 20237=26. On page 42171, second column, third full paragraph, lines 4 and 5, are corrected to read, \"(Exs. 38; 19-43; L-140-23; 144-8a; 144-8b; 114-8c; 114-17). The Globe plant\", 21220=32. On page 42178, third column, line 13, is corrected to read, \"chi represents Hispanic ethnicity (chi = 1 if\", 75108=Limitation of Procedure: Results >20 mg/dL [1768 umol/L]:, 40866=85. On page 42413, second column, line 14, is corrected to read, \"Attachment 2.\", 307530=3.11.11. Record the final instrument settings at the end of the analysis. Date and label the output, 34321=73. On page 42396, first column, paragraph (l)(6)(iv), line 3, is corrected to read, \"(l)(6)(i), (ii), or (iii) of this section are\", 29911=59. On page 42388, second column, paragraph numbered \"1.\", line 12, is corrected to read, \"Compensation Act, 33 U.S.C. 941; National\", 529566=Dr. Elinder, chairman of the Department of Nephrology at the Karolinska Institute, testified at the hearings on the proposed cadmium rule. According to Dr. Elinder (exhibit L-140-45, OSHA docket H057A), the normal concentration of B(2)MU has been well documented (Evrin and Wibell 1972; Kjellstrom et al. 1977a; Elinder et al. 1978, 1983; Buchet et al. 1980; Jawaid et al. 1983; Kowal and Zirkes, 1983). Elinder stated that the upper 95 or 97.5 percentiles for B(2)MU among those without tubular dysfunction is below 300 ug/g CRTU (Kjellstrom et al. 1977a; Buchet et al. 1980; Kowal and Zirkes, 1983). Elinder defined levels of B2M above 300 ug/g CRTU as \"slight\" proteinuria, 87170=163. On page 42458, third column, paragraph (l)(4)(v)(A), line 8, is corrected to read, \"(l)(3)(i)(B) of this section one year\", 22200=37. On page 42181, first column, third paragraph, line 2, is corrected to read, \"restriction a(NH) = 0 (corresponding to\", 86755=162. On page 42458, third column, paragraph (l)(4)(iv), lines 7 through 13 are corrected to read,, 541504=Federal Register. (1990). Occupational exposure to cadmium: Proposed rule. 55/22/4052-4147, February 6, 49165=127. On page 42438, in Table 9, the text of footnotes a through f and h through k and n and p was omitted. The text of the footnotes should be as follows:, 32902=64. On page 42391, first column, paragraph (f)(4) is deleted. 65. On page 42391, Table 2. - Respiratory Protection for Cadmium, column under the heading \"Required respirator type(b)\", line 11, the phrase \"unknown concentrations\" is deleted, 84912=154. On page 42453, first column, second full paragraph, lines 1 and 2, are corrected to read, \"High-efficiency Particulate Air (HEPA) filter means a filter capable\", 19912=24. On page 42168, Table VI-2., column headed, \"Weibull model(g)\", delete the superscript \"(g)\", 221549=1. Substance Identification Chemcial name: Cadmium chloride Formula: CdC1(2) Molecular weight: 183.3 CAS No. 10108-64-2 Other Indentifiers: RTECS EY0175000 Synonyms: Caddy; Cadmium dichloride; NA 2570 (DOT); UI-CAD;, 44578=107. On page 42429, first column, first paragraph, line 6, the term, \"cadmium-13\" is corrected to read, \"cadmium-113\", 29748=58. On page 42388, second column, paragraph numbered \"1.\", line 11, is corrected to read, \"41, Longshoremen's and Harbor Workers'\", 46499=116. On page 42431 and page 42432, in Table 5, the text of footnotes a through g was omitted. The text of the footnotes should be as follows:, 21616=34. On page 42179, second column, line 4 following the formula is corrected to read, \"q(1)(i) is the background age-specific lung\", 58393=140. On page 42444, second column, first paragraph under the heading \"Corrective Actions\", lines 14 and 15, are corrected to read, \"(CAR) must be completed. CARs should be kept on file by the laboratory.\", 34823=76. On page 42398, first column, paragraph (m)(4)(iii)(A), lines 4 and 5, are corrected to read, \"incorporated in Appendix A to this section:\", 15932=9. On page 42114, second column, Table V-3., left most column, the sixth entry is corrected to read, \">15,000\", 489048=In the method described by Pruszkowska et al. (1983), which has become the preferred method for CDU analysis, urine samples were diluted at a ratio of 1:5 with water; diammonium hydrogenphosphate in dilute HNO(3) was used as a matrix modifier. The matrix modifier allows for a higher charring temperature without loss of cadmium through volatilization during preatomization. This procedure also employs a stabilized temperature platform in a graphite furnace, while nonspecific background absorption is corrected using the Zeeman technique. This method allows for an absolute detection limit of approximately 0.04 ug Cd/l urine, 587159=- Assay Range: 0-20 mg/mL [0-1768 umol/L](e). __________, 51379=134. On page 42443, first column, last two lines above Figure 1, are corrected to read, \"pool of each analyte for which determinations will be made and control charts\", 88749=2. Part 1928 is amended by adding and reserving subparts J through L and adding a new subpart M - Occupational Health, is added consisting of a new section 1928.1027, as set forth below, 80898=145. On page 42447, first column, line 34, is corrected to read, \"methylhydantoin-2-imide\", 20431=27. On page 42174, third column, line 16, is corrected to read \"et al., Ex. 4-34; Levy et al., Ex. 8-117).\", 47428=119. On page 42435 and page 42356, Table 8, in the heading, the word \"CONCENTRATION'S\" is corrected to read, \"CONCENTRATIONS\", 621580=Signed at Washington, DC, this 13th day of April, 1993, 29294=55. On page 42383, second column, the last line is corrected to read, \"Electrical grounding with cadmium welding;\", 88193=In addition to the corrections above, Part 1928 is being amended as set forth below:, 35345=79. On page 42402, third column, paragraph \"b.\", line 5, is corrected to read, \"telephone: 202-219-7894.\", 31472=Section 1910.1002 not issued under 29 U.S.C. 655 or 29 CFR part 1911; also issued under 5 U.S.C. 553, 597185=(6) Westgard, JO, Effects of Hemolysis and Lipemia on ACA Creatinine Method, 0.200 uL, Sample Size, Du Pont Company, Wilmington, DE (October 1972), 83776=148. On page 42448, second column, first paragraph under paragraph 3.3., line 1, is corrected to read, \"3.3.1 Stock standards are prepared by\", 28566=52. Beginning on page 42348, third column, second full paragraph, is corrected to read,, 14401=1. On page 42102, the CFR heading for the document is corrected to read, \"29 CFR Parts 1910, 1915, 1926, and 1928\", 42646=96. On page 42422, third column, second paragraph, lines 6 and 7 are corrected to read, \"compliance samples or at least one set of QC samples per analysis of compliance samples, whichever is greater. If only 2 samples\", 19346=21. On page 42132, third column, second full paragraph under the heading, \"ix. Summary\", line 10, is corrected to read, \"were 10.3 ug/lwb and 8.78 ug/g Cr,\", 30258=2. The authority citation for subpart Z of part 1910 is revised to read as follows:, 365022=In conclusion, this document is intended as a supplement to characterize and maintain the quality of medical monitoring data collected under the final cadmium rule promulgated by OSHA (29 CFR 1910). OSHA has been granted authority under the Occupational Safety and Health Act of 1970 to protect workers from the effects of exposure to hazardous substances in the work place and to mandate adequate monitoring of workers to determine when adverse health effects may be occurring. This nonmandatory protocol is intended to provide guidelines and recommendations to improve the accuracy and reliability of the procedures used to analyze the biological samples collected as part of the medical monitoring program for cadmium, 47008=117. On page 42432, third column, paragraph 5.1.7.3., line 12, is corrected to read, \"presented in Attachment 1 is based on the\", 197015=(A) Biological monitoring results categories are set forth in Appendix A Table A for the periods ending December 31, 1998 and for the period beginning January 1, 1999, 327565=5.10. Mandel, J.: Accuracy and Precision, Evaluation and Interpretation of Analytical Results, The Treatment of Outliers. In Treatise On Analytical Chemistry, 2nd ed., Vol.1, edited by I. M. Kolthoff and P. J. Elving. New York: John Wiley and Sons, 1978. pp. 282-285, 496006=Kowal and Zirkes (1983) reported CDU concentrations for almost 1,000 samples collected during 1978-79 from the general U.S. adult population (i.e., nine states; both genders; ages 20-74 years). They report that CDU concentrations are lognormally distributed; low levels predominated, but a small proportion of the population exhibited high levels. These investigators transformed the CDU concentrations values, and reported the same data 3 different ways: ug/l urine (unadjusted), ug/l (specific gravity adjusted to 1.020), and ug/g CRTU. These data are summarized in Tables 6 and 7, 34476=74. On page 42396, third column, paragraph (l)(11)(iv), line 5, is corrected to read, \"medical removal trigger\", 14866=3. On page 42102, second column, second paragraph after the heading, \"A. General\", lines 5 and 6, is corrected to read, \"at 29 CFR 1910.1027 for general industry, 1915.1027 for maritime, 1928.1027 for agriculture and 1926.63 for the construction industry.\", 86138=158. On page 42455, Table 1. - Respiratory Protection for Cadmium, footnote c, is corrected to read, \"HEPA means High-efficiency Particulate Air.\", 88290=PART 1928 - [AMENDED], 71326=- Suggested Calibration: 1,5,20, mg/mL [88, 442, 1768 umol/L] - Calibration Scheme: 3 levels, 3 packs per level - Frequency: Each new pack lot. Every 3 months for any one pack lot, 21071=31. On page 42178, third column, line 10, is corrected to read, \"[E(j); (theta(j)W(j)) = theta(j') where j' is the particular\", 86617=161. On page 42457, third column, paragraph (l)(3)(i)(B), line 1, is corrected to read \"one year after the initial\", 87575=166. On page 42459, second column, paragraph (l)(6)(iv), lines 1 through 5 are corrected to read,, 552808=Takenaka et al. (1983). Carcinogenicity of Cd Chloride Aerosols in White Rates. INCI 70: 367-373, 1983, 40726=84. On page 42412, third column, paragraph 3.10.1, line 17, is corrected to read, \"method are given in Attachment 1.\", 190631=6. Until five years from the effective date of the standard, medical removal is required when CdU is greater than 15 ug/gram creatinine (g Cr), or CdB is greater than 15 ug/liter whole blood (lwb), or B(2)-M is greater than 1500 ug/g Cr, and CdB is greater than 5 ug/lwb or CdU is greater than 3 ug/g Cr;, 294049=3.5.9 Nitric Acid, 1:1 HNO(3)/DI H(2)O mixture: Carefully add a measured volume of concentrated HNO(3) to an equal volume of DI H(2)O, 493629=Another report from the CTQ (1991) summarizes preliminary CDU results from their 1991 interlaboratory program. According to the report, for 3 CDU samples with values of 9.0, 16.8, 31.5 ug/l, acceptable results (target of + or - 2 ug/l or 15 percent of the consensus mean, whichever is greater) were achieved by only 44-52 percent of the 34 laboratories participating in the CDU program. The overall CVs for these 3 CDU samples among the 34 participating laboratories were 31 percent, 25 percent, and 49 percent, respectively. The reason for this poor performance has not been determined, 32451=62. On Page 42389, first column, amendatory instruction 7. is corrected by revising the phrase \"a new subpart Z\" to read \"subparts m through y are added and reserved and a new subpart Z - Toxic and Hazardous Substances\", 44096=104. On page 42423, second column below Table 2, first full paragraph under the second formula, line 2, is corrected to read, \"Attachment 1) indicates that QC samples\", 41114=87. On page 42414, second column, line 6, is corrected to read, \"are listed in Attachment 2.\", 48985=126. On page 42438, third column, paragraph \"5.3.7.1\", line 17, is corrected to read, \"dysfunction (including cadmium-exposed workers with none of\", 326140=5.3. Occupational Safety and Health Administration Salt Lake Technical Center: Metal and Metalloid Particulate in Workplace Atmospheres (Atomic Absorption)(USDOL/OSHA Method No. ID-121). In OSHA Analytical Methods Manual 2nd ed. Cincinnati, OH: American Conference of Governmental Industrial Hygienists, 1991, 370340=Target Value: Those values of CDB, CDU or B(2)MU which trigger some action as prescribed in the medical surveillance section of the regulatory text of the final cadmium rule. For CDB, the target values are 5, 10, and 15 ug/l. For CDU, the target values are 3, 7, and 15 ug/g CRTU. For B(2)MU, the target values are 300, 750, and 1500 ug/g CRTU. (Note that target values may vary as a function of time.) Theoretical Value (or Theoretical Amount): The reported concentration of a quality-control sample (or calibration standard) derived from prior characterizations of the sample, 40253=81. On page 42412, first column, Appendix E, paragraph 3.5.5., is corrected to read, \"Magnesium nitrate, Mg(NO(3))(2) * 6H(2)O\", 81011=146. On page 42447 and page 42448, the Storage Data Table, is corrrected to read,, 51945=137. On page 42443, Figure 1, is corrected to read,, 328631=Documentation of Threshold Limit Values and Biological Exposure Indices. 5th ed. Cincinnati, OH: American Conference of Governmental Industrial Hygienists, 1986, 43546=101. On page 42423, second column under Table 2, first line below the first formula, place a \"^\" above the \"sigma\", 28133=49. On page 42193, Table VI-19, footnote c, is corrected to read, \"(c) Restriction imposed of tau = 1 (linear dose response).\", 42213=93. On page 42421, third column, sixth full paragraph, lines 13 and 14 are corrected to read \"than for CTQ proficiency testing should be accompanied\", 599405=Date: January 1992, 114559=(ii) Gloves, head coverings, and boots or foot coverings; and, (iii) Face shields, vented goggles, or other appropriate protective equipment that complies with 29 CFR 1910.133, 464602=Stoeppler and Brandt (1980) achieved a detection limit of 0.2 ug Cd/l whole blood, with a linear range of 0.4-12.0 ug Cd/l, and a CV of 15-30 percent, for samples at < 1.0 ug/l. Improved precision (CV of 3.8 percent) was reported for CDB concentrations at 9.3 ug/l, 33485=68. On page 42393, third column, paragraph (l)(3)(i)(B), line 6, is corrected to read, \"CdB one year after the initial\", 27524=45. On page 42191, first column, footnote number 5, line 2, the word, \"thed\" is corrected to read, \"the\", 27042=42. On page 42187, second column, first full paragraph, line 4, is corrected to read, \"exposure group (< 584 mg-days/m(3)) of the\", 20561=28. On page 42177, Table VI-7., the \"Combined\" \"Exp\" column, the entries marked \"7\" on lines 2 and 10 are deleted, 549284=Potts, C.L. (1965). Cadmium Proteinuria -- The Health Battery Workers Exposed to Cadmium Oxide dust. Ann Occup Hyg, 3:55-61, 1965, 328117=5.12. Occupational Safety and Health Administration Analytical Laboratory: Precision and Accuracy Data Protocol for Laboratory Validations. In OSHA Analytical Methods Manual 1st ed. Cincinnati, OH: American Conference of Governmental Industrial Hygienists (Pub. No. ISBN: 0-936712-66-X), 1985}",
    "textBeforeTable": "15. On page 42116, Table V-8., is corrected to read, 14. On page 42115, Table V-6., middle column, under the heading \"Slight proteinuria(1) No. (percent)(2)\", fourth entry, the symbol \"< \" is deleted 13. On page 42115, Table V-6., far left column, line 5, under the heading, \"Cum exposure (mg/m(3)-yrs)\", is corrected to read, \"greater than or equal to 5\" 12. On page 42115, third column, third full paragraph, lines 13 and 14 are corrected to read, \"working lifetime (1 mg/m(3) divded by 45 years = 22.2 ug/m(3).) If exposures are\" 11. On page 42115, third column, first full paragraph, lines 12, 13 and 14 are corrected to read \"using the model: log (B(2)-M) = [a X age] + [b X cumulative dose] + [c]. Elinder\" 10. On page 42115, third column, line 1, is corrected to read, \"Cr the proportion of cases of B(2)-M\" 9. On page 42114, second column, Table V-3., left most column, the sixth entry is corrected to read, \">15,000\" 8. On page 42113, third column below Table V-2, paragraph \"iv. Jarup et al\", line 15, the word \"had\" is corrected to read \"have\" 7. On page 42110, third column, first full paragraph, line 28, is corrected to read, \"proteinuria (Exs. 8-86-B, p. 63; 4-54). In\" 6. On page 42109, third column, line 2, is corrected to read \"this exposure level, there is\" 5. On page 42109, second column, second full paragraph, line 13, is corrected to read, \"lethal concentration of cadmium was\" 4. On page",
    "textAfterTable": "32. On page 42178, third column, line 13, is corrected to read, \"chi represents Hispanic ethnicity (chi = 1 if\" 33. On page 42179, second column below Table VI-8., move the word \"Where:\" to below the formula and preceding the definition \"RR(i) is the risk ratio for lung cancer predicted by the model based on the exposure scenario assumed.\" 34. On page 42179, second column, line 4 following the formula is corrected to read, \"q(1)(i) is the background age-specific lung\" 35. On page 42180, second column, Table VI-9., the heading, \"Relative Rate Model\" should only be above the columns labeled, \"Poisson regression(a)\" and \"Cox regression(b)\" 36. On page 42180, second column, Table VI-9., footnotes \"a\" and \"b\" are corrected to read, \"a is B = 0.00061 (ug-years/m(3))(-1) b is B = 0.00026 (ug-years/m(3))(-1)\" 37. On page 42181, first column, third paragraph, line 2, is corrected to read, \"restriction a(NH) = 0 (corresponding to\" 38. On page 42181, third column, Table VI-10., is corrected to read: Table VI-10.--RESULTS OF APPLYING OSHA'S MODIFIED RELATIVE RISK MODEL TO THE 1984 FOLLOWUP OF THE THUN COHORT   Case I(a)(a(N)H = 0) Case II(a)(a(NH) estimated) a(H)(s.e.) -1.4 (0.60) -1.8 (0.91) a(NH)) 0 -0.48 (0.77) B (b) 0.00027 (0.000098) 0.00054 (0.00057) Deviance 10.29 9.88",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}