{
    "relation": [
        [
            "Error Code",
            "4602",
            "4604",
            "4606",
            "4610",
            "4611",
            "4613",
            "4615",
            "4617",
            "4618",
            "4619",
            "4701",
            "4706",
            "4707",
            "4708",
            "4709",
            "4711",
            "4712"
        ],
        [
            "Description",
            "Only members of the sysadmin role can grant or revoke the CREATE DATABASE permission.",
            "There is no such user or group '%.*ls'.",
            "Granted or revoked privilege %ls is not compatible with object.",
            "You can only grant or revoke permissions on objects in the current database.",
            "To revoke grantable privileges, specify the CASCADE option with REVOKE.",
            "Grantor does not have GRANT permission.",
            "Invalid column name '%.*ls'.",
            "Cannot grant, deny or revoke permissions to or from special roles.",
            "You do not have permission to use %.*ls in the AS clause.",
            "CREATE DATABASE permission can only be granted in the master database.",
            "Could not truncate table '%.*ls' because this table does not exist in database '%.*ls'.",
            "Could not truncate table '%.*ls' because there is not enough room in the log to record the deallocation of all the index and data pages.",
            "Could not truncate object '%.*ls' because it or one of its indexes resides on a READONLY filegroup.",
            "Could not truncate object '%.*ls' because it is not a table.",
            "You are not allowed to truncate the system table '%.*ls'.",
            "Cannot truncate table '%.*ls' because it is published for replication.",
            "Cannot truncate table '%.*ls' because it is being referenced by a FOREIGN KEY constraint."
        ]
    ],
    "pageTitle": "TSQL Error Messages",
    "title": "",
    "url": "http://docs.intersystems.com/ens20081/csp/docbook/DocBook.UI.Page.cls?KEY=RERR_tsql",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00105-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 73911155,
    "recordOffset": 73801377,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "TSQL Error Codes - 0 to 199 This section contains the TSQL error messages.   Search:   TSQL Error Messages] [ Error Reference] >  [ Development References] >  [ Documentation] >  [   User:UnknownUser Instance:ENS20081 Server:docs.intersystems.com »    ",
    "textAfterTable": "118 Only members of the sysadmin role can specify the %ls option for the %ls statement. 119 Must pass parameter number %d and subsequent parameters as '@name = value'. After the form '@name = value' has been used, all subsequent parameters must be passed in the form '@name = value'. 120 The select list for the INSERT statement contains fewer items than the insert list. The number of SELECT values must match the number of INSERT columns. 121 The select list for the INSERT statement contains more items than the insert list. The number of SELECT values must match the number of INSERT columns. 122 The %ls option is allowed only with %ls syntax. 123 Batch/procedure exceeds maximum length of %d characters. 124 CREATE PROCEDURE contains no statements. 125 Case expressions may only be nested to level %d. 128 The name '%.*ls' is not permitted in this context. Only constants, expressions, or variables allowed here. Column names are not permitted. 129 Fillfactor %d is not a valid percentage; fillfactor must be between 1 and 100. 130 Cannot perform an aggregate function on an expression containing an aggregate or a subquery. 131 The size (%d) given to the %S_MSG '%.*ls' exceeds the maximum allowed for",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}