{
    "relation": [
        [
            "Categories",
            "What to do for fun",
            "Food and Dining",
            "Dorm Life",
            "Academic Rigor",
            "Tips for prospective students",
            "In three sentences"
        ],
        [
            "Comments",
            "there is the red barn and all kinds of fun to do.",
            "the food is amazing. they offer subway and other places.",
            "i don't live in the dorms.",
            "the classes are hard but they make it easy to understand.",
            "prepare everything now.",
            "it's a great campus. the technology is up to date. parking is the only bad side."
        ]
    ],
    "pageTitle": "Austin Peay State University Reviews: Student Reviews and Ratings | Cappex",
    "title": "",
    "url": "https://www.cappex.com/colleges/Austin-Peay-State-University/reviews?_escaped_fragment_=/show/32306",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00155-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 894935663,
    "recordOffset": 894859466,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{302883=I have a few friends that live in the dorms and they are a lot nicer then any other dorms I've seen. They have about 1300 new dorms built in the last year or two., 158780=The polar plunge is done around December or January I think. It's where student jump into the freezing cold pool and just have fun. You also get a free shirt., 67355=Get involved! I don't even start until August 29th and I am already an active part of three organizations here on campus! You won't get the full experience unless you're involved., 17353=Turn in your application as early as possible. Fill out financial aid forms as fast as possible, the money does run out. If possible live on campus, it makes the early class that you are likely to have to get a lot easier, if you don't have to get up extra early to drive to school. If you must drive arrive sometime between 6:30-7:10 for morning classes, and 12:30-1:10 for afternoon classes if want a decent parking spot. If you have a dorm room that is kind of out of the way, or if you are a commuter student I would try to get a locker, there are some lockers on the first floor of the MUC and there are some for Art students in Trahern. There may be more but I don't know where they are., 98540=the dorms are nice and clean. there are a new set of dorms that were put in at the beginning of the fall 2011 semester and they are very nice. apsu is in the process of tearing down the older dorms and putting in newer ones. there are also many different dormitories to choose from both directly on campus and some right behind it., 378032=© 2015, Cappex.com, LLC, 217722=APSU has a fun little event every year at the end of homecoming week called Mud Bowl. They make a mud pit on campus, and teams of students play either volleyball or tug-o-war in the mud. We also do Polar Plunge in January. President Hall is known to jump in with students in his suit and tie. Sign up early if you want a t-shirt, they go fast.}",
    "textBeforeTable": "07/14/2009 Reviewer is A current student here. 28 out of 28 people found this review useful. 1 of 88 April from Clarksville, TN Check out reviews left by other students or leave your own review. You could win a free scholarship. googletag.cmd.push(function() { googletag.display('div-gpt-ad-1414696943434-2'); }); cpx.googleAds.customAdData = {}; cpx.googleAds = {}; var cpx = cpx || {}; } } } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; if (jsonParam.state == \"on\") { function plusOneCallback(jsonParam) { }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for IE6, IE5 } xmlhttp = new XMLHttpRequest(); if (window.XMLHttpRequest) {// code for IE7+, Firefox, Chrome, Opera, Safari var xmlhttp; function(response) { FB.Event.subscribe('edge.remove', }); }); accountOptTypeID: 464 $.fn.jqAchievementLogger({ } xmlhttp = new ActiveXObject(\"Microsoft.XMLHTTP\"); else {// code for",
    "textAfterTable": "Gen from TN 05/30/2009 Reviewer is A current student here. 9 out of 10 people found this review useful. 2 of 88 Categories Comments Great for these types of students Of you are looking to save a few dollars or you have to take out a student loan and dont want to have to pay for it forever then APSU is your school. If you need a group of friends at all times there are plenty of organizations for you to join or you can just hang out in the plaza area. Tips for prospective students Have a little money saved up for books at least 400 before the semester starts because sometimes refund checks come later then the teacher wants to start working on material Bang for the buck APSU is very affordable if you live in state and are just taking regular classes with no extra fees you need about 4000 a semester to get a nice refund check and get everything paid for. Not all the courses require the newest versions",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}