{
    "relation": [
        [
            "Days",
            "30",
            "50",
            "150",
            "200"
        ],
        [
            "BSE",
            "473.04",
            "424.75",
            "374.00",
            "369.38"
        ],
        [
            "NSE",
            "472.71",
            "424.59",
            "373.98",
            "369.42"
        ]
    ],
    "pageTitle": "Sutlej Textiles and Industries Stock Price, Share Price, Live BSE/NSE, Sutlej Textiles and Industries Bids Offers. Buy/Sell Sutlej Textiles and Industries news & tips, & F&O Quotes",
    "title": "",
    "url": "http://www.moneycontrol.com/india/stockpricequote/textiles-general/sutlejtextilesindustries/STI9?sc_did=STI9",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00228-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 596183727,
    "recordOffset": 596133771,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{209580=Zensar Technologies Recommended on Mar 24th 2015, 210891=Sutlej Textiles is in the Textiles - General sector. The current market capitalisation stands at Rs 940.38 crore. The company management includes C S Nopany - Executive Chairman, Dilip Kumar Ghorawat - CFO & Wholetime Director, U K Khaitan - Director, Amit Dalal - Director, Rajan Dalal - Director, Rajiv K Podar - Director, Mahmoodur Rahman - Director, Sukhvir Singh - Director, Sonu Bhasin - Addnl. & Ind.Director. It is listed on the BSE with a BSE Code of 532782 and the NSE with an NSE Code of SUTLEJTEX. Its Registered office is at Pachpahar Road , Bhawanimandi,Rajasthan - 326502. Their Registrars are Sharepro Services (India) Pvt.Ltd., 136600=JSWSteel Jul Fut, 135382=28 July 2015, 135893=UnitedBrewerie Jul Fut}",
    "textBeforeTable": "Edit Watchlist Have you invested in these stocks? You can track them better in your Portfolio close[x] Add to Watchist Account Optional Optional Optional Optional Add to Portfolio OR Add to watchlist } $('#mcpcp_addprof_info').hide(); { function close_info()",
    "textAfterTable": "Keep me signed in Forgot Password? New to Moneycontrol - Sign up now Its easy and FREE! Username Username should be atleast 4 characters Password Password should be 6 to 10 characters Confirm Password Email OR connect with LIVE",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}