{
    "relation": [
        [
            "Condition:",
            "Shoe Type:",
            "Style:",
            "Heel Height:"
        ],
        [
            "New with tags: A brand-new, unused, and unworn item in the original packaging (such as the original box or bag) and/or with the original tags attached. See all condition definitions- opens in a new window or tab ... Read moreabout the condition",
            "Boots",
            "Wedge Mid Calf Boots",
            "Med (1 3/4 in. to 2 3/4 in.)"
        ],
        [
            "Brand:",
            "Colour:",
            "Material:",
            ""
        ],
        [
            "No! Shoes",
            "Black",
            "Synthetic",
            ""
        ]
    ],
    "pageTitle": "",
    "title": "",
    "url": "http://www.ebay.com.au/itm/Womens-Fur-Trim-Wedge-Mid-Calf-Boots-Fluff-Black-By-No-Shoes-/190794864681",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988718.8/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 422275775,
    "recordOffset": 422226529,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Item specifics View all revisions Last updated on  13 Jan, 2015 15:26:00 AEDST  Seller assumes all responsibility for this listing. 190794864681 eBay item number: Postage and payments Description current Report item - opens in a new window or tab Get the item you ordered or get your money back. Money Back Guarantee  | See details - opens in a new window or tab",
    "textAfterTable": "Style, height, and warmth can be found in the Fluff wedge boots from No! Shoes. Textured faux leather upper with full length side zip for easy on and off wear. Textile lining and footbed wicks away moisture leaving the foot cool and dry. Molded rubber wedge heel and outsole delivers long-lasting durability. Measurements: Heel Height: 5 cm Platform Height: 1.5 cm Weight: 525 g Circumference: 38 cm Shaft: 39 cm Product measurements were taken using size 9, B - Medium. Please note that measurements may vary by size. The Appearance of Product Colour: Disclaimer Due to the limitations of desktop scanners and the relative inconsistencies of various display monitors, the colours you see on your screen may not be a totally accurate reproduction of the actual product. We strive to make our colours as accurate as possible, but screen images are intended as a guide only and should not be regarded as absolutely correct. Please ensure you take this into consideration when purchasing as we will not cover the postage for the return",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}