{
    "relation": [
        [
            "Notre Dame",
            "Stovall, Maurice",
            "Shelton, Matt",
            "McKnight, Rhema",
            "Powers-Neal, Rashon"
        ],
        [
            "Att",
            "5",
            "1",
            "3",
            "1"
        ],
        [
            "Yds",
            "82",
            "46",
            "42",
            "8"
        ]
    ],
    "pageTitle": "USATODAY.com",
    "title": "",
    "url": "http://usatoday30.usatoday.com/sports/scores104/104255/20040911NCAAFNOTREDAME-0.htm",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00008-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 251844135,
    "recordOffset": 251831050,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampAfterTable": "{63684=SOUTH BEND, Indiana (Ticker) -- Freshman Darius Walker ran for \r\ntwo fourth-quarter touchdowns as Notre Dame pulled off a 28-20\r\nupset of No. 7 Michigan, which self-destructed in the second\r\nhalf.\r\n\r\nWalker's first score from six yards out gave the Irish (1-1)\r\ntheir first lead, 14-12, just over a minute into the fourth\r\nquarter.  After a blocked punt on Michigan's next possession,\r\nWalker scampered five yards around left end to extend the lead\r\nto 21-12.\r\n\r\n\"This was a big win. Any time you knock off a top 10 team, it's\r\na big win,\" Notre Dame coach Tyrone Willingham said. \"This was\r\njust one game, though. I can't get ahead of myself, I won't let\r\nmy team get ahead of itself.  Today was fantastic; tomorrow we\r\nstart over again.\"\r\n\r\nWalker finished with 115 yards on 31 carries, becoming the first\r\nNotre Dame freshman to top the 100-yard mark since Julius Jones\r\nin 1999.\r\n\r\n\"(Running backs coach) Buzz Preston and I talked during the\r\nweek. We wanted to get him in in the first quarter, but we\r\ndidn't know how many carries he would get,\" Willingham said.\r\n\"He gave us a spark. The right person at the right time can give\r\nyou that spark that everyone feeds off of.\"\r\n\r\nMichigan (1-1) was undone by miscues in the second half, turning\r\nthe ball over three times in addition to the blocked punt.  The\r\nWolverines also were unable to establish their running game,\r\ngaining just 55 yards on 28 carries.\r\n\r\n\"We have no excuse for what happened out there today.  We just\r\ndid not do the things necessary to win,\" Michigan coach Lloyd\r\nCarr said.  \"I thought Notre Dame's defense played outstanding\r\ntoday. This was a disappointing loss, but when you give up big\r\nplays and have a punt blocked, it makes it that much harder to\r\nwin.\"\r\n\r\nThe Wolverines held a 9-0 lead at the half as Garrett Rivas\r\nconnected on field goals of 38, 33 and 22 yards.  The Irish\r\nlooked much like the squad that lost at Brigham Young last week.\r\n\r\nNotre Dame got on the board in the third period when Brady\r\nQuinn, who completed 10-of-20 passes for 178 yards and two TDs,\r\nhit Matt Shelton with a 46-yard scoring strike.  Rivas' fourth\r\nfield goal from 47 yards gave Michigan a 12-7 lead heading into\r\nthe final period.\r\n\r\nMichigan freshman Chad Henne was 25-of-40 for 240 yards and a TD\r\nto Steve Breaston with 2:27 to play.  Henne found Breaston for\r\nthe two-point conversion to provide the final margin.\r\n\r\n\"It's all about execution and unfortunately, sometimes we didn't\r\nexecute what we wanted to and that was the difference in the\r\ngame,\" Henne said. \"We opened things up a little more this week.\r\nWe just didn't capitalize on those opportunities.\"\r\n\r\nThe loss was nothing new to Michigan, which has lost its last\r\nfive road openers.  The Wolverines have not won at Notre Dame\r\nStadium since 1994, when Remy Hamilton kicked a game-winning\r\nfield goal as time expired in a 26-24 triumph.\r\n\r\nThe Wolverines hold a 18-13-1 all-time lead in the series but\r\nare just 4-8-1 since 1987, including 1-5-1 here.}",
    "textBeforeTable": "Game Story Extended Box click here.'); else { } document.write('Your scores pages are set to refresh every two minutes. To cancel the automatic refresh, click here'); if(usat.cookie.get(\"sportsNoRefresh\") == null){ function writeText() { } document.location.reload(); usat.cookie.set(\"sportsNoRefresh\",\"true\",new Date(\"09/01/2002\"),\"/\"); function setCookieToExpire(){ } document.location.reload(); usat.cookie.set(\"sportsNoRefresh\",\"true\",new Date(\"09/01/2013\"),\"/\"); function writeCookie(){ writeText(); } } document.write ('Your scores pages can be set to automatically refresh every two minutes. To auto refresh, Sep 11, 2004 Michigan vs. Notre Dame",
    "textAfterTable": "0 0 7 21 28   Scoring MICHIGAN G Rivas 38 YD   MICHIGAN G Rivas 33 YD   MICHIGAN G Rivas 22 YD   NOTREDAME M Shelton 46 YD PASS FROM B Quinn (D Fitzpatrick KICK)   MICHIGAN G Rivas 47 YD   NOTREDAME D Walker 6 YD RUN (D Fitzpatrick KICK)   NOTREDAME D Walker 5 YD RUN (D Fitzgerald KICK)   NOTREDAME R Powers-Neal 8 YD PASS FROM B Quinn (D Fitzpatrick KICK)   MICHIGAN S Breaston 25 YD PASS FROM C Henne",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}