{
    "relation": [
        [
            "s",
            "c16",
            "ps"
        ],
        [
            "-",
            "-",
            "-"
        ],
        [
            "ponteiro para matriz de caracteres estreita onde o personagem multibyte será armazenado Original: pointer to narrow character array where the multibyte character will be stored The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions.",
            "o personagem de 16 bits para converter Original: the 16-bit character to convert The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions.",
            "ponteiro para o objeto de estado de conversão utilizado ao interpretar a string multibyte Original: pointer to the conversion state object used when interpreting the multibyte string The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions."
        ]
    ],
    "pageTitle": "c16rtomb - cppreference.com",
    "title": "",
    "url": "http://pt.cppreference.com/w/c/string/multibyte/c16rtomb",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00045-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 205719902,
    "recordOffset": 205704276,
    "tableOrientation": "HORIZONTAL",
    "lastModified": "Wed, 11 Sep 2013 07:26:25 GMT",
    "textBeforeTable": "[editar] Parâmetros here for instructions. You can help to correct and verify the translation. Click Google Translate. The text has been machine-translated via __STDC_UTF_16__ is defined, the 16-bit encoding used by this function is UTF-16, otherwise it is implementation-defined. In any case, the multibyte encoding used by this function is specified by the currently active C locale. If the macro Original: __STDC_UTF_16__ macro é definida, a codificação de 16 bits utilizado por esta função é UTF-16, caso contrário, é definida pela implementação. Em qualquer caso, a codificação de vários bytes utilizado por esta função é especificado pelo locale C actualmente activo. Se o here for instructions. You can help to correct and verify the translation. Click Google Translate. The text has been machine-translated via *ps is updated to represent the initial shift state. u'\\0', a null byte is stored, preceded by any shift sequence necessary to restore the initial shift state and the conversion state parameter If c16 is the null wide character Original:",
    "textAfterTable": "[editar] Valor de retorno Em caso de sucesso, retorna o número de bytes (incluindo as seqüências de turnos) escritos para a matriz de caracteres cujo primeiro elemento é apontado por s. Este valor pode ser ​0​, e.g. ao processar o char16_t primeiro de uma par substituto. Original: On success, returns the number of bytes (including any shift sequences) written to the character array whose first element is pointed to by s. This value may be ​0​, e.g. when processing the first char16_t in a surrogate pair. The text has been machine-translated via Google Translate. You can help to correct and verify the translation. Click here for instructions. Em caso de falha ( c16 não é um caractere de 16 bits válidos), retorna -1, lojas EILSEQ em errno e deixa *ps em estado indeterminado. Original: On failure (if c16 is not a valid 16-bit character), returns -1, stores",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}