{
    "relation": [
        [
            "Channel",
            "ABC1 NSW",
            "SBS ONE Sydney",
            "Channel Seven Sydney",
            "Channel Nine Sydney",
            "Network TEN Sydney"
        ],
        [
            "TV show",
            "Eggheads",
            "Japanese News",
            "Seven Early News",
            "Today",
            "CBS This Morning"
        ],
        [
            "Time",
            "5:29 am - 6 am",
            "5:40 am - 6:15 am",
            "5:30 am - 6 am",
            "5:30 am - 9 am",
            "5:30 am - 7 am"
        ]
    ],
    "pageTitle": "Sydney Morning Herald - Business & World News Australia | smh.com.au",
    "title": "Summary of what TV shows are on tonight",
    "url": "http://www.smh.com.au/am/2013/01/03/index.html",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00021-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 711173035,
    "recordOffset": 711104511,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{88764=James Joyce selects 50 of 100 films destined for the 2013 big screen.}",
    "TableContextTimeStampAfterTable": "{241627=Total votes: 11686., 124017=February 8 - March 7: PIAF explodes across all forms with a spirit that makes Perth the place to be., 100696=Start your training for Run Melbourne 2013, to be held on Sunday, July 21., 125986=April 15: 30 Rock star Tracy Morgan in Perth on his first Australian tour., 251656=Filmscribe, Jan 2, 2013, 3:10PM, 77033=Revisit the stories and images you clicked on in 2012., 232209=1193 cars torched in NYE French tradition, 126931=May 31: Rock'n'roll warriors Dragon return to Perth - a few decades older but still with the same hits., 264734=December 31 2012, 123014=February 2: Free event celebrates best food and wine of the region., 192101=85 questions about the shows that graced our screens in 2012., 252532=Pah, Jan 2, 2013, 4:24PM, 36156=Over 1000 'loony dookers' start 2013 with a splash in Scotland., 124979=February 9 This year delivers an eclectic international line-up that concert lovers have come to expect.}",
    "textBeforeTable": "7am 6:30am 6am 5:30am 5am 4:30am Skip to: Finally an opportunity for the Kardashians to present their thoughtful, important views on life. Carry on Kardashian What's on TV Tonight We reveal who is most likely to make headlines next year. Who'll make news in 2013 Making news Some of the city's best minds share their expertise. Brisbane's best advice Good advice Getting a taste for the annual Woodford Folk Festival. Peace, Love and Cabernet The Wine Punter Resist the temptation to Google the answer to this long-running mystery.",
    "textAfterTable": "Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Korean News 5:05 am - 5:40 am Channel Seven Brisbane Sunrise Extra 5 am - 5:30 am Channel Nine Brisbane Nine's Early Morning News 5 am - 5:30 am Network TEN Brisbane Life Today with James Robison 5 am - 5:30 am Summary of what TV shows are on tonight Channel TV show Time ABC1 QLD Eggheads 5:29 am - 6 am SBS ONE Queensland Japanese News 5:40 am - 6:15 am Channel Seven Brisbane Seven Early News 5:30 am - 6 am Channel Nine Brisbane Today 5:30",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}