{
    "relation": [
        [
            "Patent application number",
            "20090247497",
            "20120046265"
        ],
        [
            "Description",
            "FORMULATION AND USE OF ERGOSTA-7,22-DIEN-3BETA-OL - An isolated and purified form of ergosta-7,22-dien-3β-ol and its use as a marker for identifying",
            "USE OF ERGOSTA-7,22-DIEN-3beta-OL IN THE TREATMENT OF CANCER - A use of an isolated and purified form of ergosta-7,22-dien-3β-ol in the treatment of cancer is provided."
        ],
        [
            "Published",
            "10-01-2009",
            "02-23-2012"
        ]
    ],
    "pageTitle": "Chan, Hong Kong - Patent applications",
    "title": "",
    "url": "http://www.faqs.org/patents/inventor/chan-hong-kong-4/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00326-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 435616348,
    "recordOffset": 435575668,
    "tableOrientation": "HORIZONTAL",
    "textBeforeTable": "Hei Ling Helen Chan, Hong Kong HK 02-02-2012 METHOD AND SYSTEM OF SECURING CARGO - A method and system of securing cargo for preventing access to cargo during transportation is disclosed. In an embodiment, the system comprises a security net adapted for covering the cargo, the net comprising a panel with a periphery. The panel is made from a net with holes of sufficiently small size to prevent objects from readily being inserted therethrough without causing a tear thereto. The periphery contains a plurality of openings. The system also comprises a plurality of security locks adapted for locking onto a pallet beneath the cargo and coupling onto one of the plurality of openings. Each security lock has a first identifier for identifying whether the plurality of security locks belong to a predetermined set. 20120027535 Published Description Patent application number Hanson How Sin Chan, Hong Kong HK 12-02-2010 WEARABLE POWER ASSISTIVE DEVICE FOR HELPING A USER TO MOVE THEIR HAND - A rehabilitation system ( 20100305717 Published Description Patent application number David Tai Wai Chan, Hong Kong HK 04-22-2010 ANNEXIN II COMPOSITIONS FOR TREATING OR MONITORING INFLAMMATION OR IMMUNE-MEDIATED DISORDERS - Methods and compositions for treating, detecting, diagnosing or assisting in the diagnosis of an inflammatory or immunological disorder are provided. The authors have made the novel discovery that anti-dsDNA antibodies are reactive to cell",
    "textAfterTable": "Hoi Ming Chan, Hong Kong HK Patent application number Description Published 20110267441 3-D MOVING PICTURE VIEWING APPARATUS - A 3-D viewing apparatus for viewing moving pictures, the apparatus comprising a left-channel viewer and a right-channel viewer respectively for viewing by left-eye and right-eye of a user, and an electronically controlled shutter mechanism which is arranged to alternatively shut the left-channel viewer and the right-channel viewer such that a user only sees the left- and right- channels through the left- and right viewers respectively. The shutting frequency of the shutter mechanism is predetermined or preset by an electronic controller. The 3-D viewing glass has a shutting mechanism which is arranged to shut the left- and right-viewers at a predetermined, preset or pre-programmed means there is no need to extract electronic synchronization signals from the video source and this makes the 3-D viewing glass more economical and more convenient to use. 11-03-2011 20140098202 THREE-DIMENSIONAL VIEWING SYSTEM - A three-dimensional viewing system includes a television having an electric circuit provided therein for the generation of alternating left-eye image and right-eye image on a screen, a micro controller unit provided inside the television and configured to extract a vertical synchronizing signal therefrom, a signal transmitting system for directly transmitting the vertical synchronizing signal to a pair of three-dimensional shutter glasses to be worn by the viewer in front of the television. The shutter glasses include left and right liquid crystal shutter lenses",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}