{
    "relation": [
        [
            "Team",
            "Rangers",
            "MLB Rank"
        ],
        [
            "WAR",
            "18.7",
            "16"
        ],
        [
            "BT Wins",
            ".6",
            "10"
        ],
        [
            "Clutch",
            "-1.1",
            "17"
        ],
        [
            "Prod. Out %",
            "38",
            "1"
        ],
        [
            "2 Out, RISP",
            ".285",
            "1"
        ],
        [
            "Late/Close",
            ".248",
            "11"
        ],
        [
            "High Leverage",
            ".281",
            "3"
        ],
        [
            "Extra Inn.",
            ".271",
            "13"
        ]
    ],
    "pageTitle": "MLB Power Rankings: The 30 Teams on Offensive 'Clutchness' in the 2010 Season | Bleacher Report",
    "title": "",
    "url": "http://bleacherreport.com/articles/585347-ranking-the-30-mlb-teams-on-offensive-clutchness-in-the-2010-season",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00027-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 27603291,
    "recordOffset": 27546602,
    "tableOrientation": "VERTICAL",
    "TableContextTimeStampAfterTable": "{104646=This slideshow is ranking the 30 MLB teams from least to most clutch, as a whole, for the 2010 season. In order to fully analyze the 'clutchness' of a team I used 8 different statistical categories., 235714=Copyright © 2015 Bleacher Report, Inc. Turner Broadcasting System, Inc. All Rights Reserved. BleacherReport.com is part of Bleacher Report - Turner Sports Network, part of the Turner Sports and Entertainment Network. Certain photos copyright © 2015 by Getty Images. Any commercial use or distribution without the express written consent of Getty Images is strictly prohibited., 104163=Individual clutch performances can greatly affect a player's career and it can also give his team an extra win or two but the combine clutch offensive performances of an entire team can have a huge impact on the team's season. A team with a lot of talent but who doesn't get the big hits often misses the playoffs whereas a team with less offensive talent but gets the big hit when it matters most can win the World Series (see the 2010 San Francisco Giants). }",
    "textBeforeTable": "The Mariners also finished 2nd to last in High Leverage and Extra Innings BA categories. The Mariners finished last in BT Wins and 2 Out W/RISP categories. The Bad: The Mariners were almost in the top 3rd of baseball with their Clutch rating. The Good: Eliot J. Schechter/Getty Images 30. Seattle Mariners Next » 32 of 2 « Prev Begin Slideshow » With this extensive list of stats of the entire teams combined offensive stats, I was able to fully analyze each team's ability to perform in the clutch and, thus, rank them from least to most clutch.  This includes: WAR (wins above replacement), BT Wins (adjusted batting wins - which measures a hitter's contribution to his team's wins with only his bat), Clutch (which measures the win probability of a team having a particular player), Productive Outs Percentage (which measures a player's ability to make productive outs - i.e. moving a runner along, etc.), BA with Two",
    "textAfterTable": "« Prev 3 of 32 Next » 29. Pittsburgh Pirates Jared Wickerham/Getty Images The Good: The Pirates had a good Clutch rating in 2010. The Bad: While a good Clutch rating is good, it doesn't account for everything; in all of the other categories the Pirates finished in the bottom 3rd of all 30 MLB teams (including a combined MLB worst in the WAR category).    WAR BT Wins Clutch Prod. Out % 2 Out, RISP Late/Close High Leverage Extra Inn. Pirates -4.4 -13.6 .8 28 .225 .236 .243 .224 MLB Rank 30 29 8 26 24 22 26 25 « Prev 4 of 32 Next » 28. New York Mets",
    "hasKeyColumn": true,
    "keyColumnIndex": 0,
    "headerRowIndex": 0
}