{
    "relation": [
        [
            "type",
            "FR Doc.",
            "RIN",
            "Docket No."
        ],
        [
            "regulations.gov",
            "2015-09566",
            "1905-AD50",
            "EERE-2013-BT-TP-0055"
        ]
    ],
    "pageTitle": "10 CFR Part 429, Subpart B - Certification | US Law | LII / Legal Information Institute",
    "title": "",
    "url": "https://www.law.cornell.edu/cfr/text/10/part-429/subpart-B?qt-cfr_tabs=4",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042982502.13/warc/CC-MAIN-20150728002302-00318-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 890778959,
    "recordOffset": 890752286,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{1115=Title 10 published on 2015-01-01.}",
    "TableContextTimeStampAfterTable": "{68804=On April 1, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking and public meeting for Energy Conservation Program: Test Procedure for Pumps. This document corrects terms in four equations., 49574=On March 11, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) that proposes to revise its test procedure for residential furnaces and boilers established under the Energy Policy and Conservation Act (80 FR 12876). DOE published this NOPR so stakeholders can review and provide input on these proposed revisions. The comment period for the NOPR pertaining to the subject residential furnaces and boilers test procedure was scheduled to end May 26, 2015. After receiving a request for additional time to comment, DOE has decided to reopen the comment period for the NOPR pertaining to the test procedure for residential furnaces and boilers until July 10, 2015., 114797=The U.S. Department of Energy (DOE) proposes to amend the test procedure proposals presented in a notice of proposed rulemaking (NOPR), published on May 21, 2014. The proposed revisions include modifications to the whole-home dehumidifier test setup and conduct, and revisions to the measurement of energy use in fan-only operation first proposed in the May 2014 NOPR. DOE also introduces a methodology to determine whole-home dehumidifier case volume, clarifies the equations used to calculate corrected relative humidity and capacity for portable and whole-home dehumidifiers, and provides additional technical corrections and clarifications. The additional proposals are to be combined with the initial proposals from May 2014., 64717=On April 2, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) and public meeting for Energy Conservation Program: Energy Conservation Standards for Pumps. This document corrects the terms in one of the equations., 59550=On April 14, 2015, the U.S. Department of Energy (DOE) published in the Federal Register a notice of proposed rulemaking (NOPR) that proposes mathematical conversion factors for converting from the current efficiency metrics ( i.e., energy factor for residential water heaters, and thermal efficiency and standby loss for commercial water heaters) to the uniform efficiency descriptor ( i.e., uniform energy factor metric). The comment period for the NOPR pertaining to the test procedures for water heaters was scheduled to end May 14, 2015. After receiving a request for additional time to comment for stakeholders, DOE is reopening the comment period for the NOPR for the Conversion Factor for Test Procedures for Consumer and Certain Commercial Water Heaters to June 15, 2015. Additionally, at the request of stakeholders, DOE is announcing a public meeting to discuss the conversion factors for consumer and commercial water heaters., 22752=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, prescribes energy conservation standards for various consumer products and certain commercial and industrial equipment, including commercial prerinse spray valves (CPSVs). EPCA also requires the U.S. Department of Energy (DOE) to determine whether more-stringent, amended standards would be technologically feasible and economically justified, and would save a significant amount of energy. In this notice, DOE proposes amended energy conservation standards for commercial prerinse spray valves. The notice also announces a public meeting to receive comment on these proposed standards and associated analyses and results., 81660=As required by the Energy Policy and Conservation Act of 1975 (EPCA), as amended, the U.S. Department of Energy (DOE) proposes to establish a mathematical conversion factor for the purpose of translating efficiency ratings for water heaters under the test method currently in effect to the ratings under the amended test method promulgated by DOE in a final rule published on July 11, 2014 (hereinafter referred to as the “the July 2014 final rule”). Compliance with the amended test procedure is required beginning on the later of: one year after the publication of a final rule that establishes a mathematical conversion factor, or December 31, 2015. This rulemaking document proposes a mathematical conversion factor which may be used to convert the existing efficiency ratings under the current Federal test procedure to efficiency ratings under the test procedure adopted in the July 2014 final rule for water heater basic models manufactured, tested and certified prior to the compliance date of the amended test procedure. The amended test procedure applies to all covered consumer water heaters and the covered commercial water heating equipment with residential applications defined in the July 2014 final rule as a “residential-duty commercial water heater.” In addition, this document proposes amendments to the minimum energy conservation standards for consumer water heaters and residential-duty commercial water heaters to account for the impact of the new metric, but does not alter the stringency of the existing energy conservation standards. While DOE has not planned a public meeting to discuss this proposal, DOE is willing to consider a request to hold a meeting., 88106=The Energy Policy and Conservation Act of 1975 (EPCA), as amended, sets forth a variety of provisions designed to improve energy efficiency. Part C of Title III, which for editorial reasons was re-designated as Part A-1 upon incorporation into the U.S. Code, establishes the “Energy Conservation Program for Certain Industrial Equipment.” The covered equipment includes pumps. In this document, DOE proposes to establish new energy conservation standards for pumps and announces a public meeting to receive comment on these proposed standards and associated analyses and results., 3334=On March 13, 2014, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedures for packaged terminal air conditioners (PTACs) and packaged terminal heat pumps (PTHPs). That NOPR serves as the basis for this final rule regarding the test method for PTACs and PTHPs. The amendments adopted here do not affect measured energy use. These changes incorporate by reference certain sections of the latest versions of industry test procedures AHRI Standard 310/380-2014, ANSI/ASHRAE Standard 16-1983 (RA 2014), ANSI/ASHRAE Standard 37-2009, and ANSI/ASHRAE Standard 58-1986 (RA 2014), and specify additional testing provisions that must be followed including an optional break-in period, require that cooling capacity tests be conducted using electricity measuring instruments accurate to +/− 0.5% of reading, explicitly require that wall sleeves be sealed, allow for the pre-filling of the condensate drain pan, and require testing with 14-inch deep wall sleeves and the filter option most representative of a typical installation., 13512=Title 10 published on 2015-01-01, 43554=In this supplemental notice of proposed rulemaking (SNOPR), the U.S. Department of Energy (DOE) proposes a number of changes to the proposed test procedure rule published on October 17, 2014. Specifically, DOE proposes to clarify that a ceiling fan is not subject to the test procedure if the plane of rotation of the ceiling fan's blades cannot be within 45 degrees of horizontal, rather than exempt air circulators (or air-circulating fan heads) from the test procedure. DOE also proposes to test high-volume small-diameter ceiling fans according to test procedures based on the current DOE test procedure for ceiling fans, rather than the Air Movement and Control Association International, Inc. (AMCA) 230 test procedure. All ceiling fans larger than seven feet in diameter would still be tested according to a test procedure based on the AMCA 230 test procedure, but all ceiling fans less than seven feet in diameter would be tested according to test procedures based on the current DOE test procedure. DOE also proposes that the test require mounting all ceiling fans with blade spans less than or equal to seven feet to the real ceiling, rather than a false ceiling, during testing. The proposed test method would also increase the number of speeds at which ceiling fans with blade spans greater than seven feet are tested, and clarify the weighting associated with each tested speed in the energy efficiency metric and update the test room dimensions for ceiling fans with blade spans greater than seven feet. Finally, DOE proposes to clarify the effective date corresponding to the NOPR proposal to reinterpret the statutory definition of a ceiling fan to include hugger ceiling fans., 93388=The U.S. Department of Energy (DOE) proposes to establish a new test procedure for pumps. Specifically, DOE is proposing a test method for measuring the hydraulic power, shaft power, and electric input power of pumps, inclusive of electric motors and any continuous or non-continuous controls. The proposal, if adopted, would incorporate by reference the test procedure from the Hydraulic Institute (HI)—Standard 40.6-2014, “Methods for Rotodynamic Pump Efficiency Testing.” The proposed test procedure would be used to determine the constant load pump energy index (PEI CL ) for pumps sold without continuous or non-continuous controls or the variable load pump energy index (PEI VL ) for pumps sold with continuous or non-continuous controls. The PEI CL and PEI VL describe the power consumption of the rated pump, inclusive of an electric motor and, if applicable, any integrated continuous or non-continuous controls, normalized with respect to the performance of a minimally compliant pump for each pump basic model. The proposal reflects certain recommendations made by a stakeholder Working Group for pumps established under the Appliance Standards Rulemaking Federal Advisory Committee (ASRAC). DOE is also announcing a public meeting to discuss and receive comments on issues presented in this notice of proposed rulemaking (NOPR).}",
    "lastModified": "Tue, 28 Jul 2015 20:11:31 GMT",
    "textBeforeTable": "Additional Documents GPO FDSys XML | Text 80 FR 37136 - Energy Conservation Program: Test Procedures for Packaged Terminal Air Conditioners and Packaged Terminal Heat Pumps 2015-06-30; vol. 80 # 125 - Tuesday, June 30, 2015 For a complete list of all Rules, Proposed Rules, and Notices view the Rulemaking tab. The following are only the Rules published in the Federal Register after the published date of Title 10. Title 10 published on 2015-01-01. Appendix A to Subpart B of Part 429 - Student's t-Distribution Values for Certification Testing § 429.71 — Maintenance of records. § 429.70 — Alternative methods for determining energy efficiency or energy use. § 429.54",
    "textAfterTable": "DEPARTMENT OF ENERGY, Office of Energy Efficiency and Renewable Energy Final rule. The effective date of this rule is July 30, 2015. The final rule changes will be mandatory for representations starting June 24, 2016. The incorporation by reference of certain publications listed in this rule was approved by the Director of the Federal Register as of July 30, 2015. 10 CFR Parts 429 and 431 Summary On March 13, 2014, the U.S. Department of Energy (DOE) issued a notice of proposed rulemaking (NOPR) to amend the test procedures for packaged terminal air conditioners (PTACs) and packaged terminal heat pumps (PTHPs). That NOPR serves as the basis for this final rule regarding the test method for PTACs and PTHPs. The amendments adopted here do not affect measured energy use. These changes incorporate by reference certain sections of the latest versions of industry test procedures AHRI Standard 310/380-2014, ANSI/ASHRAE Standard 16-1983 (RA 2014), ANSI/ASHRAE Standard 37-2009, and ANSI/ASHRAE Standard 58-1986 (RA 2014), and specify additional testing provisions that must be followed including an optional break-in period, require that cooling capacity tests be conducted using electricity measuring instruments accurate to +/− 0.5% of reading, explicitly require that wall sleeves be sealed, allow for the pre-filling of the condensate drain pan, and require testing with 14-inch deep wall sleeves and the filter option most representative of",
    "hasKeyColumn": false,
    "keyColumnIndex": -1,
    "headerRowIndex": 0
}