{
    "relation": [
        [
            "Property Type",
            "Apartments",
            "Apartments"
        ],
        [
            "Bedrooms",
            "2bhk",
            "3bhk"
        ],
        [
            "Area",
            "1260-1304 sq.ft",
            "1550-1914 sq.ft"
        ],
        [
            "Price",
            "85.68L - 88.67L",
            "1.05Cr - 1.30Cr"
        ]
    ],
    "pageTitle": "Gurgaon Apartments | Residential Projects in Gurgaon | Flats in Gurgaon",
    "title": "",
    "url": "https://www.commonfloor.com/Gurgaon-apartments/",
    "hasHeader": true,
    "headerPosition": "FIRST_ROW",
    "tableType": "RELATION",
    "tableNum": 25,
    "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987135.9/warc/CC-MAIN-20150728002307-00051-ip-10-236-191-2.ec2.internal.warc.gz",
    "recordEndOffset": 907884863,
    "recordOffset": 907802712,
    "tableOrientation": "HORIZONTAL",
    "TableContextTimeStampBeforeTable": "{12712=1165 Projects, 7670=1165 results ( Budget : Any | Bedrooms : All | Property Type : All ), 12977=1165 Projects ( Budget : Any | Bedrooms : 1 BHK | Property Type : Apartment, Villa, Row House, Plot )}",
    "TableContextTimeStampAfterTable": "{320362=Construction business has been the core activity of Puri Constructions. Since 1971, Puri Constructions has executed landmark projects within record time. From large scale steel plants and dams to luxury hotels, from state owned institutions to new age commercial & residential projects, Puri Constructions has always been associated with supreme quality. Since its inception Puri Construction's reputation is built on rock solid values, benchmark quality standards, uncompromising business ethos, focused customer centric approach, robust engineering, and transparency in all spheres of conducting business. Puri Constructions is an ISO 9001:2000 company appraised by the stringent UKAS and DNV. It is also a Patron member of NAREDCO., 203482=HCBS Sports Ville This is a residential project of hcbs promoters & developers pvt. Ltd. In the prime Sector - 2 & 35, Of the sohna, Under the affordable housing policy 2013. Govt. Of haryana has rolled-Out a policy to cater the needs of home for middle class and lower middle class at affordable cost in the urban areas., 122328=Emaar MGF Land Limited is a joint venture between Emaar Properties PJSC (\"Emaar\") of Dubai and MGF Development Limited (\"MGF\") of India. Emaar is one of the world's leading real estate companies, having developed approximately 89 million square feet of real estate across residential, commercial and other business segments and with operations in 14 countries. MGF has established itself as one of the key players in retail real estate development in Northern India and has delivered approximately 2 million square feet of retail space The Company commenced operations in India in February 2005 and is into real estate development with a pan-India presence and operations spanning all key segments of the Indian real estate industry, namely the residential, commercial, retail and hospitality sectors. The Company's operations encompass various aspects of real estate development, such as land identification and acquisition, project planning, designing, marketing and execution. At present, its focus is on the development of residential projects in Delhi and elsewhere in the NCR, Mohali, Hyderabad, Chennai and other key Indian cities, 73633=Homestead is engaged in the business of the development of Real Estate with a vision of expansion in India, Singapore, Saudi Arabia, Sri Lanka & Bangladesh. The India operations functions out of Gurgaon, Haryana. It serves as the regional headquarters for South Asia. Inspired by the concept of Human Architecture, Homestead with the help of its international expertise envisages to create a future where people will live, work & play in the spaces which will enhance their quality of life. Mission To create four brands delivering 4 mn sq.ft. of developed space and establish homestead as market leader in concept selling. Vision To create valuable ideas through human architecture which will act as market differentiator for the company and create new benchmark for the real estate industry. Our Associates Good Association always helps to create good things. To be amongst the best in the industry, Homestead has affiliations with the best:- Jones Lang LaSalle for Research Maisam of Jordan, DFI India and Rajinder Kumar & Associates for all design services Piedemont for Project Management, 298505=Era Group has over two decades of track record in customer satisfaction and innovation. Bringing concretes and bricks to life, the real estate arm of the Era Group, Era Landmarks Ltd. was incorporated in 2005. It is an ISO 9001 : 2008 certified company. A premium and leading real estate company, it has a diverse product portfolio spread across Residential, IT Parks, Commercial, Malls & Multiplexes. Era enjoys the credit for introducing and pioneering the revolutionary concepts in form of its projects like SkyVille, Cosmocity, Redwood Residency and Divine Court. Empowering the ideas with technical precision, the company achieved smooth functioning towards Business Applications and Employees Self services by developing an ERP structure, a customer related accountability system and CRM internally. With geographic footprints spread strategically across Metros as well as Tier I cities, it is ideally positioned to make the most of the burgeoning realty potential across India., 135639=Raheja Developers Limited was incorporated in the year 1990 by Mr. Navin M. Raheja, the first generation entrepreneur. Today, the company enjoys a strong presence in NCR and has made its position as one of the largest companies in the Real Estate Industry. The company is one of the fastest growing entities in the realty sector with a difference that offers luxury for reasonable costs, excellent customer care levels with highest customer satisfaction index and the highest imaginable standards for the welfare of its staff, society as well as for the environment. The Company has traversed a path of steady growth & expansion and has posted increasing turnover and profits year after year. The systems have been strengthened and new processes have been added. Today, the company is one of the largest in the Real Estate Industry with projects all over India. It is also one of the biggest companies in India with executable and sanction projects over 60 million sq. ft. in hand with projects spanning over 900 acres of land at various stages of deliberations. The company so far has executed and delivered 29.5 million sq.ft. of mainly residential and commercial projects including farmhouses, plotted development and hotel properties and with over 15.50 million under construction. The company is managed by highly qualified professionals who are fully engrossed to ensure that the company maintains its high standards in quality construction, timely delivery and customer satisfaction. The company has always strived hard to keep its commitments and thus enjoys an extremely resonant reputation in the construction industry., 345992=Godrej Properties was established in 1990 as a real estate development company within the Godrej Group of businesses. The company was originally incorporated as Sea Breeze Constructions and Investments Private Limited on February 8, 1985. The company's name was changed to Godrej Properties and Investments Private Limited on July 2, 1990 and subsequently to Godrej Properties Limited on November 23, 2004. Since 1897, customers have trusted Godrej to deliver innovation and excellence across a broad spectrum of services and products. The promise to deliver value drives the organization at every stage of operation. Firstly, the company evaluates the potential of possible locations and is led by a team of qualified managers. Once a location has been identified as a potential development zone, GPL works with only the foremost architects, contractors, and project managers to bring the project to life. GPL knows that its obligation to its customers and partners does not end upon the completion of a project, and therefore, provides post-project professional and accessible support also. Godrej Properties adheres to a simple philosophy: providing exemplary service based on the optimal use of available resources. The company has completed projects in Mumbai and Pune and is currently developing residential towers such as the Planet Godrej in central Mumbai and the Godrej Woodsman Estate in Bangalore. Godrej Properties intends to leverage its established brand image to deliver property solutions across major Indian metros., 249764=VATIKA THE SEVEN LAMPS Vatika Seven Lamps in Sector 82 of Gurgaon is an actualization of an inspiration. The inspiration came from an essay entitled 'The Seven Lamps of Artchitecture' published in book form by notable English art critic John Ruskin as early as May 1849. However, the seven lamps of architecture still hold stead today in the contemporary world. These comprise of basic principles of good quality architecture namely - sacrifice, truth, power, beauty, life, memory and obedience. Sacrifice here is relevant in as much as it amounts to a token of respect of man's craft to divinity. Truth refers to using good quality raw material to build a truely safe and secure structure. Power refers to the power of human intellect to construct a structure meeting the requirements the stucture proposes to provide. This structure must be aesthetic. Life refers to the element of liveliness man puts into the structure by his own labour done enthusiastically. Obedience refers to respect for prior architectural culture not surpassing the finer quality of structures. Adhering to these morals, The Vatika Group has imbibed these values while conceptualizing Vatika The Seven Lamps., 98207=The Tulip Group is a company which has achieved excellence through its foresightedness and expertise in its field. The focused vision, undivided dedication and constant efforts of the company help it to develop strategies for its ceaseless growth in the sphere of real estate and construction. Tulip Group is promoted by Shri Praveen Jain, the Chairman and Managing Director of the company, a first generation entrepreneur having more than 17 years of experience in construction, real estate and development. His vision, dedication, hard work, objective approach and leadership qualities changed the future of Tulip Infratech Pvt. Ltd to make it as an ISO 9001-2000 company. Maintaining the highest standards of quality has always been the foremost priority at Tulip, enabling it to earn an enviable reputation in a brief period of time. With residential and commercial projects, planned to create a benchmark in the future, Tulip is embarking very fast on the way to success., 47320=Supertech Infrastructure dispatching new moderate 1 & 2 BHK Apartments -Basera in Sector 79 Gurgaon under Haryana Affordable Housing Policy 2013. Basera, comes to you as a genuine partner forever. It is imagined under the Haryana Affordable Housing Scheme 2013; and is genuinely wanted to provide for you world class living background right in the most creating private and business center of Gurgaon. Division 79 is one of the new divisions around the National Highway 8, that are a piece of Gurgaon Master Plan 2021, with the amplest Expressway in the nation that will join NH-8 to IGI Airport and Dwarka.}",
    "textBeforeTable": "Unit Types SUPERTECH ARAVILLE Green is where your heart is. Araville, a 10-acre residential development nestled in the foothills of the Aravallis. A unique concept, Araville brings together the best of urban living with the joys of nature. In fact, it's so close to the greens, that 'home' gets a whole new definition here. A premium residential development, Araville offers a range of 2/3/4 BHK apartments spread on lush green open environs. Overview More Details Enquire Now _gaq.push(['_trackEvent','Enquiry form-lf','Enquire','CAP']);\"> Sale: 49     Listings Available : From Aug 2016 Possession : 2BHK, 3BHK, 4BHK Unit Type: Apartments Property Type: Supertech Limited Builder: 1295Sq ft - 3620Sq ft Rs. 81.58L - 2.28Cr",
    "textAfterTable": "Apartments 4bhk 3620 sq.ft 2.28Cr Approvals Home Loans providers include Corporation Bank, Bank of Baroda, HDFC Bank, Axis Bank, LIC Housing Finance Ltd, Indiabulls, Punjab National Bank, IDBI Bank, ICICI Bank, Bank Of India Map Amenities Garden Swimming Pool Play Area 24Hr Backup Security Intercom Club House Rain Water Harvesting Cafeteria Library Tennis Court Badminton Court Gymnasium Indoor Games Basket Ball Court Jogging Track Secured Toddlers’ Zones Crèche & Day Care Facility About Builder Supertech Limited, India's leading real estate developer was founded 25 years back in National Capital Region and since then has been scaling new heights by each passing day. The company has set new trends of architectural finesse in the contemporary global scenario touching the horizons of excellence. Established under the dynamic leadership of Mr. R. K. Arora, Supertech has led to creation of various landmark projects. The leaders and skilled professionals of the company",
    "hasKeyColumn": true,
    "keyColumnIndex": 1,
    "headerRowIndex": 0
}